{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Aang",
      "target": {
        "href": "Category_Aang",
        "page": "Category_Aang"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "href": "Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Due to his friendly and peaceful nature, Aang encountered many different people. While he befriended several of them, his position an destiny as the ${link_2} also placed him at odds with several others.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "This page is comprised of Aang's relationships with other characters in the World of Avatar. Due to his friendly and peaceful nature, Aang encountered many different people. While he befriended several of them, his position an destiny as the Avatar also placed him at odds with several others."
    },
    {
      "body": "${link_0} stood in with his entire family for a photo.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Aang stood in with his entire family for a photo."
    },
    {
      "body": "Aang fathered three children with ${link_0}. His first born son and eldest child, ${link_1}, was a nonbender. His second child, ${link_2}, was his only daughter and the only ${link_3} among his children, and his youngest son, ${link_4}, was the only child in the family who inherited Aang's ${link_5} skills. While Aang loved all his children equally, as noted by Tenzin, Aang was burdened with the responsibilities of both being the Avatar and keeping his Air Nomad lineage alive after his passing. This ultimately led to Aang spending more time with Tenzin than Bumi or Kya in order to pass his airbending knowledge and skill on to him. As the only living airbending master, Aang taught Tenzin the art of airbending to the point where he mastered the skill and earned his arrows. While this extra effort toward Tenzin allowed the two to enjoy many fond moments together, it also caused Aang's elder children to develop a slight resentment toward their father, which continued even in their adulthood. Despite this, Bumi and Kya still hold dear affection toward their father, as they looked fondly at an old picture of them with Aang, and Kya remembers appreciatively that Aang was \"nothing but supportive\" when she revealed her sexual orientation to him.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "href": "Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Kya",
          "key": "${link_2}",
          "target": {
            "href": "Kya",
            "page": "Kya"
          }
        },
        {
          "body": "waterbender",
          "key": "${link_3}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_4}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "airbending",
          "key": "${link_5}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Aang fathered three children with Katara. His first born son and eldest child, Bumi, was a nonbender. His second child, Kya, was his only daughter and the only waterbender among his children, and his youngest son, Tenzin, was the only child in the family who inherited Aang's airbending skills. While Aang loved all his children equally, as noted by Tenzin, Aang was burdened with the responsibilities of both being the Avatar and keeping his Air Nomad lineage alive after his passing. This ultimately led to Aang spending more time with Tenzin than Bumi or Kya in order to pass his airbending knowledge and skill on to him. As the only living airbending master, Aang taught Tenzin the art of airbending to the point where he mastered the skill and earned his arrows. While this extra effort toward Tenzin allowed the two to enjoy many fond moments together, it also caused Aang's elder children to develop a slight resentment toward their father, which continued even in their adulthood. Despite this, Bumi and Kya still hold dear affection toward their father, as they looked fondly at an old picture of them with Aang, and Kya remembers appreciatively that Aang was \"nothing but supportive\" when she revealed her sexual orientation to him."
    },
    {
      "body": "Bumi, in particular, has had to deal with a lot of strain in regards to his Air Nomad roots as he was born a nonbender, which contradicted what his father wished, and admitted to have never felt any sort of connection toward his father's people until he actually gained the ability to airbend. He cared much for his father's view of him, having joined the United Forces to help protect the world as best he could to make Aang proud of him. In his later life, Aang built ${link_0} on which Tenzin and his family reside. Tenzin has a great deal of respect for his father; on his way back to Air Temple Island, he bowed his head respectfully to Aang's massive statue overlooking ${link_1}, and he also still appeared to miss his father greatly. In 171 AG, when Tenzin was lost in the ${link_2}, a vision of Aang appeared, helping Tenzin to realize that his goal to be more like Aang was wrong and that he should just be himself instead.",
      "links": [
        {
          "body": "Air Temple Island",
          "key": "${link_0}",
          "target": {
            "href": "Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Fog of Lost Souls",
          "key": "${link_2}",
          "target": {
            "href": "Fog_of_Lost_Souls",
            "page": "Fog_of_Lost_Souls"
          }
        }
      ],
      "text": "Bumi, in particular, has had to deal with a lot of strain in regards to his Air Nomad roots as he was born a nonbender, which contradicted what his father wished, and admitted to have never felt any sort of connection toward his father's people until he actually gained the ability to airbend. He cared much for his father's view of him, having joined the United Forces to help protect the world as best he could to make Aang proud of him. In his later life, Aang built Air Temple Island on which Tenzin and his family reside. Tenzin has a great deal of respect for his father; on his way back to Air Temple Island, he bowed his head respectfully to Aang's massive statue overlooking Republic City, and he also still appeared to miss his father greatly. In 171 AG, when Tenzin was lost in the Fog of Lost Souls, a vision of Aang appeared, helping Tenzin to realize that his goal to be more like Aang was wrong and that he should just be himself instead."
    },
    {
      "body": "${link_0} met ${link_1} shortly after the latter recovered from being fatally attacked.",
      "links": [
        {
          "body": "Hakoda",
          "key": "${link_0}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Hakoda met Aang shortly after the latter recovered from being fatally attacked."
    },
    {
      "body": "${link_0} and Aang first formally met when a heavily wounded Aang awoke on their decoy ${link_1} after weeks of unconsciousness. Aang was pleased to officially meet the ${link_2} and Hakoda himself was honored to meet Aang. Alone among the parents of Aang's five companions, Hakoda is the only one to have ever been his ally, as his ${link_3} was dead, ${link_4}'s parents did not approve of Aang, ${link_5}'s ${link_6} was Aang's archenemy, his ${link_7} was missing, and the team never encountered ${link_8}'s parents.",
      "links": [
        {
          "body": "Hakoda",
          "key": "${link_0}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "ship",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_cruiser",
            "page": "Fire_Nation_cruiser"
          }
        },
        {
          "body": "Southern Water Tribe Chief",
          "key": "${link_2}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "wife",
          "key": "${link_3}",
          "target": {
            "href": "Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        },
        {
          "body": "Toph",
          "key": "${link_4}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_5}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "father",
          "key": "${link_6}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "mother",
          "key": "${link_7}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        },
        {
          "body": "Suki",
          "key": "${link_8}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        }
      ],
      "text": "Hakoda and Aang first formally met when a heavily wounded Aang awoke on their decoy ship after weeks of unconsciousness. Aang was pleased to officially meet the Southern Water Tribe Chief and Hakoda himself was honored to meet Aang. Alone among the parents of Aang's five companions, Hakoda is the only one to have ever been his ally, as his wife was dead, Toph's parents did not approve of Aang, Zuko's father was Aang's archenemy, his mother was missing, and the team never encountered Suki's parents."
    },
    {
      "body": "Hakoda and Aang did not have direct contact after first meeting each other, but when a miserable ${link_0} confronted him about Aang running off, Hakoda defended Aang by saying that running off may have been Aang's way of being brave. Katara said that he was not being brave but selfish and stupid because his friends could be helping him. She acknowledged that the world needed Aang, but emphasized that his friends needed him, too. Hakoda rightly realized that Katara was talking about him as well.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Hakoda and Aang did not have direct contact after first meeting each other, but when a miserable Katara confronted him about Aang running off, Hakoda defended Aang by saying that running off may have been Aang's way of being brave. Katara said that he was not being brave but selfish and stupid because his friends could be helping him. She acknowledged that the world needed Aang, but emphasized that his friends needed him, too. Hakoda rightly realized that Katara was talking about him as well."
    },
    {
      "body": "Hakoda and Aang fought together at the ${link_0}, and both survived the ${link_1}. After the end of the Hundred Year War, Aang became a part of Hakoda's family as the chief's son-in-law through his marriage to Katara.",
      "links": [
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_1}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "Hakoda and Aang fought together at the invasion of the Fire Nation, and both survived the Hundred Year War. After the end of the Hundred Year War, Aang became a part of Hakoda's family as the chief's son-in-law through his marriage to Katara."
    },
    {
      "body": "${link_0} and ${link_1} disguised themselves as servants in order to reach the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_2}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "Aang and Sokka disguised themselves as servants in order to reach the Earth King."
    },
    {
      "body": "When Aang and ${link_0} first encountered one another, the ${link_1} immediately assumed the strange boy in the iceberg was a ${link_2} spy. Though this initial suspicion was quickly disproven, the young ${link_3}'s occasional carelessness often infuriated Sokka. When Aang tried ${link_4}, resulting in Katara's burnt hands, Sokka pushed a concerned Aang into the ground angrily, yelling, \"You burned my sister!\" For his part, Aang often made light of Sokka's serious demeanor. Along with Katara, he viewed Sokka's skeptical favoring of science over magic with some bewildered amusement, though he grew impressed with Sokka's engineering skills. Aang told Sokka that the latter was usually the one who came up with plans to help them, proving that he depended on Sokka's help and intelligence openly. Aang also did not voice any annoyance nor contempt toward Sokka for his lack of bending skills. Through their travels around the world, the two boys formed a solid bond. Aang and Sokka often goofed around with each other, much to Katara's annoyance. The childlike nature of their characters usually resulted in them sharing a joke or reacting similarly to games and activities, such as both of them chuckling at the mention of \"buttresses\" and making fun of Katara by imitating \"spirit magic\". He also seemed to desire Sokka's permission for a relationship with his sister, Katara, though Sokka at the time could not tell Aang was talking about Katara. Their relationship became more profound after the fall of ${link_5}, when Sokka sought Aang's advice and consolation after a moment of blunder in front of the invasion force.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Water Tribe warrior",
          "key": "${link_1}",
          "target": {
            "href": "Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "firebending",
          "key": "${link_4}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_5}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "When Aang and Sokka first encountered one another, the Water Tribe warrior immediately assumed the strange boy in the iceberg was a Fire Nation spy. Though this initial suspicion was quickly disproven, the young Avatar's occasional carelessness often infuriated Sokka. When Aang tried firebending, resulting in Katara's burnt hands, Sokka pushed a concerned Aang into the ground angrily, yelling, \"You burned my sister!\" For his part, Aang often made light of Sokka's serious demeanor. Along with Katara, he viewed Sokka's skeptical favoring of science over magic with some bewildered amusement, though he grew impressed with Sokka's engineering skills. Aang told Sokka that the latter was usually the one who came up with plans to help them, proving that he depended on Sokka's help and intelligence openly. Aang also did not voice any annoyance nor contempt toward Sokka for his lack of bending skills. Through their travels around the world, the two boys formed a solid bond. Aang and Sokka often goofed around with each other, much to Katara's annoyance. The childlike nature of their characters usually resulted in them sharing a joke or reacting similarly to games and activities, such as both of them chuckling at the mention of \"buttresses\" and making fun of Katara by imitating \"spirit magic\". He also seemed to desire Sokka's permission for a relationship with his sister, Katara, though Sokka at the time could not tell Aang was talking about Katara. Their relationship became more profound after the fall of Ba Sing Se, when Sokka sought Aang's advice and consolation after a moment of blunder in front of the invasion force."
    },
    {
      "body": "Aang and Sokka became cooperative on the battlefield, as Sokka chose to assist Aang in his failed attempt to defeat ${link_0} Ozai. It was prior to that battle that Aang cheered Sokka up following his botched battle speech, and Sokka confessed that while he had not liked Aang at first, he had grown to love him platonically over time. When Zuko requested to join the ${link_1}, Sokka refused on Aang's account, defending his friend's safety. Finally, however, when Aang did choose to accept him after the latter saved their lives, Sokka gave his consent, trusting Aang's judgment on the matter. Sokka also aided Aang significantly during his friend's last confrontation with Fire Lord Ozai in ${link_2}, where together with Suki and Toph, he brought down the ${link_3} fleet, stopping the continued destruction of the ${link_4} from the other firebenders while Aang defeated Ozai.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "group",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Wulong Forest",
          "key": "${link_2}",
          "target": {
            "href": "Wulong_Forest",
            "page": "Wulong_Forest"
          }
        },
        {
          "body": "Fire Nation airship",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_4}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Aang and Sokka became cooperative on the battlefield, as Sokka chose to assist Aang in his failed attempt to defeat Fire Lord Ozai. It was prior to that battle that Aang cheered Sokka up following his botched battle speech, and Sokka confessed that while he had not liked Aang at first, he had grown to love him platonically over time. When Zuko requested to join the group, Sokka refused on Aang's account, defending his friend's safety. Finally, however, when Aang did choose to accept him after the latter saved their lives, Sokka gave his consent, trusting Aang's judgment on the matter. Sokka also aided Aang significantly during his friend's last confrontation with Fire Lord Ozai in Wulong Forest, where together with Suki and Toph, he brought down the Fire Nation airship fleet, stopping the continued destruction of the Earth Kingdom from the other firebenders while Aang defeated Ozai."
    },
    {
      "body": "The two later became brothers-in-law as a result of Aang's marriage to Katara.",
      "links": [],
      "text": "The two later became brothers-in-law as a result of Aang's marriage to Katara."
    },
    {
      "body": "${link_0} and ${link_1} kissed outside the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Jasmine Dragon",
          "key": "${link_2}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "text": "Aang and Katara kissed outside the Jasmine Dragon."
    },
    {
      "body": "The first thing Aang saw upon waking from his one-hundred year sleep was the face of the fourteen-year-old waterbender, Katara, who was his liberator from the iceberg, along with her fifteen-year-old brother, Sokka. Throughout his time at the ${link_0}, Aang instantly formed a tight bond with her; they connected over their bending and Katara instantly placed a lot of trust on the young boy. After they started traveling together, their relationship only strengthened and many of Aang's actions and antics were motivated by his want to impress Katara and gain her attention; for example, when they visited ${link_1}, he was idolized by the children there but mainly ignored by Katara, much to his disappointment.",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        }
      ],
      "text": "The first thing Aang saw upon waking from his one-hundred year sleep was the face of the fourteen-year-old waterbender, Katara, who was his liberator from the iceberg, along with her fifteen-year-old brother, Sokka. Throughout his time at the South Pole, Aang instantly formed a tight bond with her; they connected over their bending and Katara instantly placed a lot of trust on the young boy. After they started traveling together, their relationship only strengthened and many of Aang's actions and antics were motivated by his want to impress Katara and gain her attention; for example, when they visited Kyoshi Island, he was idolized by the children there but mainly ignored by Katara, much to his disappointment."
    },
    {
      "body": "His growing affection became more obvious when he made her a necklace to replace her ${link_0}'s, which had been lost earlier. Shortly after, he eavesdropped on one of her conversations, in which she had her fortune told by Aunt ${link_1}, and gleefully celebrated after hearing that she would marry a powerful bender. When having his own fortune told, Aang specifically asked Aunt Wu if she had seen anything in his future concerning a girl. He began acting \"aloof\" on Sokka's advice, who mistook ${link_2} as his target, but this only succeeded in confusing Katara; finally, after seeing a woman react positively to the gift of a rare ${link_3}, Aang climbed to the top of ${link_4} to bring Katara such a flower. This resulted in him finding out that the volcano was about to erupt after all, contrary to Aunt Wu's earlier prediction. Before leaving the village, Aang asked Aunt Wu if she had lied about his love life during his fortunetelling. Aunt Wu responded by saying: \"I'll tell you a secret, young airbender: Just as you reshaped those clouds, you have the power to shape your own destiny\".",
      "links": [
        {
          "body": "grandmother",
          "key": "${link_0}",
          "target": {
            "href": "Kanna",
            "page": "Kanna"
          }
        },
        {
          "body": "Wu",
          "key": "${link_1}",
          "target": {
            "href": "Wu_(fortuneteller)",
            "page": "Wu_(fortuneteller)"
          }
        },
        {
          "body": "Meng",
          "key": "${link_2}",
          "target": {
            "href": "Meng",
            "page": "Meng"
          }
        },
        {
          "body": "panda lily",
          "key": "${link_3}",
          "target": {
            "href": "Panda_lily",
            "page": "Panda_lily"
          }
        },
        {
          "body": "Mt. Makapu",
          "key": "${link_4}",
          "target": {
            "href": "Mt",
            "page": "Mt"
          }
        }
      ],
      "text": "His growing affection became more obvious when he made her a necklace to replace her grandmother's, which had been lost earlier. Shortly after, he eavesdropped on one of her conversations, in which she had her fortune told by Aunt Wu, and gleefully celebrated after hearing that she would marry a powerful bender. When having his own fortune told, Aang specifically asked Aunt Wu if she had seen anything in his future concerning a girl. He began acting \"aloof\" on Sokka's advice, who mistook Meng as his target, but this only succeeded in confusing Katara; finally, after seeing a woman react positively to the gift of a rare panda lily, Aang climbed to the top of Mt. Makapu to bring Katara such a flower. This resulted in him finding out that the volcano was about to erupt after all, contrary to Aunt Wu's earlier prediction. Before leaving the village, Aang asked Aunt Wu if she had lied about his love life during his fortunetelling. Aunt Wu responded by saying: \"I'll tell you a secret, young airbender: Just as you reshaped those clouds, you have the power to shape your own destiny\"."
    },
    {
      "body": "When Aang, Katara, and ${link_0} became lost in the ${link_1} where the only solution to successfully navigating the tunnels was to trust in love, Katara, who was embarrassed and shortly afterward dismissed the idea as crazy, suggested that by kissing, they could find their way out. Aang's attempts to agree with her backfired and left her angry with him:",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "labyrinth",
          "key": "${link_1}",
          "target": {
            "href": "Cave_of_Two_Lovers",
            "page": "Cave_of_Two_Lovers"
          }
        }
      ],
      "text": "When Aang, Katara, and Appa became lost in the labyrinth where the only solution to successfully navigating the tunnels was to trust in love, Katara, who was embarrassed and shortly afterward dismissed the idea as crazy, suggested that by kissing, they could find their way out. Aang's attempts to agree with her backfired and left her angry with him:"
    },
    {
      "body": "Eventually, desperation – and possibly mutual affection – led to the two trying out the suggestion.",
      "links": [],
      "text": "Eventually, desperation – and possibly mutual affection – led to the two trying out the suggestion."
    },
    {
      "body": "Aang later discovered that his love for Katara was the rebirth for his love of the deceased ${link_0} when he went to the ${link_1}. This love for her put Aang in an unforeseen position to learn to control the ${link_2} from Guru ${link_3}. Pathik told Aang that controlling the Avatar State involved the releasing of various emotions in the seven chakras spread throughout the body, including earthly attachment. In order to open the seventh chakra, Aang was told that he must let go of his earthly attachment to Katara. He was reluctant to agree and eventually abandoned the process entirely when he had a vision that Katara was in danger, despite Guru Pathik's warning that it would lock his inner chakra and he would not be able to enter the Avatar State at all.",
      "links": [
        {
          "body": "Air Nomads",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Eastern Air Temple",
          "key": "${link_1}",
          "target": {
            "href": "Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Pathik",
          "key": "${link_3}",
          "target": {
            "href": "Pathik",
            "page": "Pathik"
          }
        }
      ],
      "text": "Aang later discovered that his love for Katara was the rebirth for his love of the deceased Air Nomads when he went to the Eastern Air Temple. This love for her put Aang in an unforeseen position to learn to control the Avatar State from Guru Pathik. Pathik told Aang that controlling the Avatar State involved the releasing of various emotions in the seven chakras spread throughout the body, including earthly attachment. In order to open the seventh chakra, Aang was told that he must let go of his earthly attachment to Katara. He was reluctant to agree and eventually abandoned the process entirely when he had a vision that Katara was in danger, despite Guru Pathik's warning that it would lock his inner chakra and he would not be able to enter the Avatar State at all."
    },
    {
      "body": "Aang received a kiss on the cheek from her on three known occasions, blushing each time. Similarly, her changing outfits usually had a positive influence on him. While spending some time in prison, Aang received some advice concerning her from the other inmates. During a secret dance party, he danced with her quite impressively, gaining the attention of the entire party. Later, when Aang saw that his previous incarnation also had troubles with girls, Avatar ${link_0} remarked that \"love is hard when you're young\" and consolingly explained, \"Don't worry; it gets better.\" When trying to revive ${link_1}'s memory, after Sokka suggested Katara kiss Jet to bring back his memory, Aang muttered under his breath that the idea was \"a bad one\".",
      "links": [
        {
          "body": "Roku",
          "key": "${link_0}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Jet",
          "key": "${link_1}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        }
      ],
      "text": "Aang received a kiss on the cheek from her on three known occasions, blushing each time. Similarly, her changing outfits usually had a positive influence on him. While spending some time in prison, Aang received some advice concerning her from the other inmates. During a secret dance party, he danced with her quite impressively, gaining the attention of the entire party. Later, when Aang saw that his previous incarnation also had troubles with girls, Avatar Roku remarked that \"love is hard when you're young\" and consolingly explained, \"Don't worry; it gets better.\" When trying to revive Jet's memory, after Sokka suggested Katara kiss Jet to bring back his memory, Aang muttered under his breath that the idea was \"a bad one\"."
    },
    {
      "body": "Facing separation from Katara, Aang attempted to tell her of his feelings, only to be interrupted by Sokka at the last minute.",
      "links": [],
      "text": "Facing separation from Katara, Aang attempted to tell her of his feelings, only to be interrupted by Sokka at the last minute."
    },
    {
      "body": "While in the ${link_0}, Aang and Katara faced overwhelming odds against ${link_1}, Zuko and the ${link_2}. Believing that entering the Avatar State was their only hope, Aang isolated himself and meditated, hoping to let go of his attachment to Katara and unlock the seventh chakra. Though Aang began to release the chakra and entered the Avatar State, the \"Celestial Avatar Spirit Aang\", he was unable to complete the process due to being shot by Azula's ${link_3}. Consequently, Aang was prevented from clearing the seventh chakra and mastering the Avatar State, leaving his attachment to Katara intact.",
      "links": [
        {
          "body": "Crystal Catacombs",
          "key": "${link_0}",
          "target": {
            "href": "Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_2}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "lightning bolt",
          "key": "${link_3}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        }
      ],
      "text": "While in the Crystal Catacombs, Aang and Katara faced overwhelming odds against Azula, Zuko and the Dai Li. Believing that entering the Avatar State was their only hope, Aang isolated himself and meditated, hoping to let go of his attachment to Katara and unlock the seventh chakra. Though Aang began to release the chakra and entered the Avatar State, the \"Celestial Avatar Spirit Aang\", he was unable to complete the process due to being shot by Azula's lightning bolt. Consequently, Aang was prevented from clearing the seventh chakra and mastering the Avatar State, leaving his attachment to Katara intact."
    },
    {
      "body": "Later, he was successful in telling her his feelings and sneaked in a kiss or two as part of a daydream, before realizing the whole scenario was merely a figment of his imagination. Ultimately, however, with the upcoming battle with the Fire Lord, Ozai, the possibility that he might not come back alive from that encounter gave Aang enough courage and motivation to successfully declare his affections for her - in the form of a kiss, to which she responded by leaning in. Afterward, though, she looked away, and her expression seemed slightly sad, although this could be interpreted as her thinking about the kiss and worrying about the fact that she may never see Aang again.",
      "links": [],
      "text": "Later, he was successful in telling her his feelings and sneaked in a kiss or two as part of a daydream, before realizing the whole scenario was merely a figment of his imagination. Ultimately, however, with the upcoming battle with the Fire Lord, Ozai, the possibility that he might not come back alive from that encounter gave Aang enough courage and motivation to successfully declare his affections for her - in the form of a kiss, to which she responded by leaning in. Afterward, though, she looked away, and her expression seemed slightly sad, although this could be interpreted as her thinking about the kiss and worrying about the fact that she may never see Aang again."
    },
    {
      "body": "Katara was Aang's only teacher to use positive reinforcement as a teaching method, something to which Aang responded well. In addition, Katara remained the only person able to calm Aang out of the Avatar State. Additionally, Katara was able to renew emotions and believed in Aang where others were unable. While others tried to renew Aang's optimism and hope, only Katara was successful.",
      "links": [],
      "text": "Katara was Aang's only teacher to use positive reinforcement as a teaching method, something to which Aang responded well. In addition, Katara remained the only person able to calm Aang out of the Avatar State. Additionally, Katara was able to renew emotions and believed in Aang where others were unable. While others tried to renew Aang's optimism and hope, only Katara was successful."
    },
    {
      "body": "Aang grew jealous when the actress on the stage playing Katara confessed her love to the ${link_0} playing Zuko and said that she saw Aang as a brother. This upset Aang, and he later confronted her about it. She claimed it was only acting, but Aang was unconvinced. He thought that something should have happened between them since they kissed on the morning of the invasion. Katara told Aang that she was just confused and that it \"wasn't the right time\". Aang tried to kiss her, only to have her pull back and reiterate, albeit a bit forcefully, that she was confused. She left Aang feeling heartbroken and stupid for his own actions.",
      "links": [
        {
          "body": "actor",
          "key": "${link_0}",
          "target": {
            "href": "Ember_Island_Players#Actor_Zuko",
            "page": "Ember_Island_Players"
          }
        }
      ],
      "text": "Aang grew jealous when the actress on the stage playing Katara confessed her love to the actor playing Zuko and said that she saw Aang as a brother. This upset Aang, and he later confronted her about it. She claimed it was only acting, but Aang was unconvinced. He thought that something should have happened between them since they kissed on the morning of the invasion. Katara told Aang that she was just confused and that it \"wasn't the right time\". Aang tried to kiss her, only to have her pull back and reiterate, albeit a bit forcefully, that she was confused. She left Aang feeling heartbroken and stupid for his own actions."
    },
    {
      "body": "After the end of the Hundred Year War, in Ba Sing Se, Katara approached Aang and instigated a hug and a passionate kiss. This finally demonstrated that Aang's feelings for Katara were mutual, and the two enjoyed a long-term relationship.",
      "links": [],
      "text": "After the end of the Hundred Year War, in Ba Sing Se, Katara approached Aang and instigated a hug and a passionate kiss. This finally demonstrated that Aang's feelings for Katara were mutual, and the two enjoyed a long-term relationship."
    },
    {
      "body": "Katara and Aang went to Yu Dao during the Harmony Restoration Movement. The two constantly called each other \"sweetie\", much to the annoyance of Sokka who remarked that they were giving him the \"oogies\". When battling Zuko's soldiers, Katara defended Aang after his shirt caught fire and boldly stated, \"Stop. Trying. To. Set. My. Boyfriend. On. Fire!\", impressing Aang. When Aang entered the Avatar State to fulfill his promise and end Zuko, Katara once again calmed Aang out of the Avatar State. Later, Aang thanked her for this, and they hugged.",
      "links": [],
      "text": "Katara and Aang went to Yu Dao during the Harmony Restoration Movement. The two constantly called each other \"sweetie\", much to the annoyance of Sokka who remarked that they were giving him the \"oogies\". When battling Zuko's soldiers, Katara defended Aang after his shirt caught fire and boldly stated, \"Stop. Trying. To. Set. My. Boyfriend. On. Fire!\", impressing Aang. When Aang entered the Avatar State to fulfill his promise and end Zuko, Katara once again calmed Aang out of the Avatar State. Later, Aang thanked her for this, and they hugged."
    },
    {
      "body": "In Ba Sing Se, Aang and Katara met the ${link_0}, much to the annoyance of Katara. When making introductions, Katara cleared her throat so Aang would introduce her as \"his girlfriend, Katara\". One of the co-presidents and co-founders ${link_1} responded saying, \"What an honor it is to meet Avatar Aang's first girlfriend\", irritating Katara further. As Aang continued to impress the club members, he unknowingly increased Katara's jealousy over the attention he was receiving. When they were leaving, Aang remarked that the girls made him feel \"like he was at home with his people\", making Katara realize that her jealousy had been unnecessary. This left her feeling guilty for her lack of faith in him, and when he thanked her for agreeing to stay the night, she dismissed his gratitude, claiming that she did not deserve it.",
      "links": [
        {
          "body": "Official Avatar Aang Fan Club",
          "key": "${link_0}",
          "target": {
            "href": "Official_Avatar_Aang_Fan_Club",
            "page": "Official_Avatar_Aang_Fan_Club"
          }
        },
        {
          "body": "Won-Yee",
          "key": "${link_1}",
          "target": {
            "href": "Won-Yee",
            "page": "Won-Yee"
          }
        }
      ],
      "text": "In Ba Sing Se, Aang and Katara met the Official Avatar Aang Fan Club, much to the annoyance of Katara. When making introductions, Katara cleared her throat so Aang would introduce her as \"his girlfriend, Katara\". One of the co-presidents and co-founders Won-Yee responded saying, \"What an honor it is to meet Avatar Aang's first girlfriend\", irritating Katara further. As Aang continued to impress the club members, he unknowingly increased Katara's jealousy over the attention he was receiving. When they were leaving, Aang remarked that the girls made him feel \"like he was at home with his people\", making Katara realize that her jealousy had been unnecessary. This left her feeling guilty for her lack of faith in him, and when he thanked her for agreeing to stay the night, she dismissed his gratitude, claiming that she did not deserve it."
    },
    {
      "body": "Back at Yu Dao, Katara helped Aang with his conflicting feelings. She also explained to him that when she saw ${link_0} family, she saw her future with Aang. She told Aang to go to a quiet place to think, and he departed with a passionate kiss with Katara. Aang decided that Katara was right. When Aang formed the ${link_1} from the members of the fan club, Katara watched and admired from afar.",
      "links": [
        {
          "body": "Kori's",
          "key": "${link_0}",
          "target": {
            "href": "Kori_Morishita",
            "page": "Kori_Morishita"
          }
        },
        {
          "body": "Air Acolytes",
          "key": "${link_1}",
          "target": {
            "href": "Air_Acolytes",
            "page": "Air_Acolytes"
          }
        }
      ],
      "text": "Back at Yu Dao, Katara helped Aang with his conflicting feelings. She also explained to him that when she saw Kori's family, she saw her future with Aang. She told Aang to go to a quiet place to think, and he departed with a passionate kiss with Katara. Aang decided that Katara was right. When Aang formed the Air Acolytes from the members of the fan club, Katara watched and admired from afar."
    },
    {
      "body": "They later married, culminating with the birth of three children, a daughter, Kya, and two sons, Bumi and Tenzin.",
      "links": [],
      "text": "They later married, culminating with the birth of three children, a daughter, Kya, and two sons, Bumi and Tenzin."
    },
    {
      "body": "On his journey around the world, Aang made many friends from all ${link_0}. Though ${link_1} remained his only friend from before the Hundred Year War and Aang's one hundred years frozen in the iceberg, he mentioned that he had many friends from the other nations, including the Fire Nation. Now that those one hundred years had passed, most of his friends from pre-war were deceased, though he had made many new friends after being liberated from the iceberg. Katara, Sokka, Toph, and Suki became his closest friends. He also formed friendships with former enemies, such as Zuko and ${link_2}.",
      "links": [
        {
          "body": "four nations",
          "key": "${link_0}",
          "target": {
            "href": "Four_nations",
            "page": "Four_nations"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_2}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "On his journey around the world, Aang made many friends from all four nations. Though Bumi remained his only friend from before the Hundred Year War and Aang's one hundred years frozen in the iceberg, he mentioned that he had many friends from the other nations, including the Fire Nation. Now that those one hundred years had passed, most of his friends from pre-war were deceased, though he had made many new friends after being liberated from the iceberg. Katara, Sokka, Toph, and Suki became his closest friends. He also formed friendships with former enemies, such as Zuko and Iroh."
    },
    {
      "body": "${link_0} was ${link_1}'s beloved animal companion.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Appa was Aang's beloved animal companion."
    },
    {
      "body": "Appa, the ${link_0}, was Aang's loyal pet and friend, as well as Team Avatar's primary means of travel. Aang first met Appa at the Eastern Air Temple when the latter was just a calf during a customary event where all airbender children are paired with a flying bison for life. After Aang offered an apple to Appa, the young sky bison seemed to bond with him immediately, affectionately licking his face. Aang loved his fellow survivor of a century of sleep, noting that they could both be the last of their kind.",
      "links": [
        {
          "body": "flying bison",
          "key": "${link_0}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        }
      ],
      "text": "Appa, the flying bison, was Aang's loyal pet and friend, as well as Team Avatar's primary means of travel. Aang first met Appa at the Eastern Air Temple when the latter was just a calf during a customary event where all airbender children are paired with a flying bison for life. After Aang offered an apple to Appa, the young sky bison seemed to bond with him immediately, affectionately licking his face. Aang loved his fellow survivor of a century of sleep, noting that they could both be the last of their kind."
    },
    {
      "body": "Appa was faithful and protective toward Aang, and on various occasions he entered into battle to protect his little friend. Aang was similarly protective toward Appa; when Toph blamed the sky bison for leaving a trail of fur for Azula and her team to follow, Aang angrily defended Appa, and later, when Appa was kidnapped by ${link_0} in the ${link_1}, Aang became furious upon finding those that stole him and even entered the Avatar State upon discovering that his friend had been muzzled. Despite his pacifistic nature, he destroyed all the sand-sailers and almost attacked the sandbenders, had it not been for Katara who managed to comfort and calm him down, though the grief over losing Appa would stay with Aang for a while, overshadowing his generally cheerful demeanor. During his time apart from Appa, Aang was often morose and driven to get him back, which he finally did when Team Avatar traveled to ${link_2}. After reuniting with Appa, Aang cried in happiness.",
      "links": [
        {
          "body": "sandbenders",
          "key": "${link_0}",
          "target": {
            "href": "Sandbender_Tribes",
            "page": "Sandbender_Tribes"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_1}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        },
        {
          "body": "Lake Laogai",
          "key": "${link_2}",
          "target": {
            "href": "Lake_Laogai",
            "page": "Lake_Laogai"
          }
        }
      ],
      "text": "Appa was faithful and protective toward Aang, and on various occasions he entered into battle to protect his little friend. Aang was similarly protective toward Appa; when Toph blamed the sky bison for leaving a trail of fur for Azula and her team to follow, Aang angrily defended Appa, and later, when Appa was kidnapped by sandbenders in the Si Wong Desert, Aang became furious upon finding those that stole him and even entered the Avatar State upon discovering that his friend had been muzzled. Despite his pacifistic nature, he destroyed all the sand-sailers and almost attacked the sandbenders, had it not been for Katara who managed to comfort and calm him down, though the grief over losing Appa would stay with Aang for a while, overshadowing his generally cheerful demeanor. During his time apart from Appa, Aang was often morose and driven to get him back, which he finally did when Team Avatar traveled to Lake Laogai. After reuniting with Appa, Aang cried in happiness."
    },
    {
      "body": "Aang possessed a flying ${link_0}, which emitted sounds almost inaudible to humans, to summon Appa from a distance. Additionally, he could command him to fly with a cry of \"Yip-yip!\"",
      "links": [
        {
          "body": "bison whistle",
          "key": "${link_0}",
          "target": {
            "href": "Bison_whistle",
            "page": "Bison_whistle"
          }
        }
      ],
      "text": "Aang possessed a flying bison whistle, which emitted sounds almost inaudible to humans, to summon Appa from a distance. Additionally, he could command him to fly with a cry of \"Yip-yip!\""
    },
    {
      "body": "${link_0} and ${link_1} ${link_2} enjoyed riding down the ${link_3}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "King",
          "key": "${link_1}",
          "target": {
            "href": "King_of_Omashu",
            "page": "King_of_Omashu"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_2}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "Omashu delivery system",
          "key": "${link_3}",
          "target": {
            "href": "Omashu_delivery_system",
            "page": "Omashu_delivery_system"
          }
        }
      ],
      "text": "Aang and King Bumi enjoyed riding down the Omashu delivery system."
    },
    {
      "body": "King Bumi, the ${link_0} ruler of the Earth Kingdom city of ${link_1}, was the only known still living peer of Aang, prior to Aang's disappearance one hundred years earlier. Aang fondly remembered how a young Bumi taught him to use Omashu's mail chutes as a giant super slide. Now a supercentenarian, Bumi maintained the eccentric and unconventional thinking that caused Aang to dub him, \"a mad genius\". In addition, he also showed a similar sense of fun from his childhood, enjoying to ride the ${link_2} with Aang again. Aang had planned to receive teachings in earthbending under the king, but after the Avatar found out that Bumi had been taken prisoner with no intention of escaping from his prison after the capture of Omashu, waiting for an unsaid opportunity, Aang was forced to find a new teacher. Aang later named his first son after him.",
      "links": [
        {
          "body": "earthbender",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_1}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "mail chute",
          "key": "${link_2}",
          "target": {
            "href": "Omashu_delivery_system",
            "page": "Omashu_delivery_system"
          }
        }
      ],
      "text": "King Bumi, the earthbender ruler of the Earth Kingdom city of Omashu, was the only known still living peer of Aang, prior to Aang's disappearance one hundred years earlier. Aang fondly remembered how a young Bumi taught him to use Omashu's mail chutes as a giant super slide. Now a supercentenarian, Bumi maintained the eccentric and unconventional thinking that caused Aang to dub him, \"a mad genius\". In addition, he also showed a similar sense of fun from his childhood, enjoying to ride the mail chute with Aang again. Aang had planned to receive teachings in earthbending under the king, but after the Avatar found out that Bumi had been taken prisoner with no intention of escaping from his prison after the capture of Omashu, waiting for an unsaid opportunity, Aang was forced to find a new teacher. Aang later named his first son after him."
    },
    {
      "body": "${link_0} and Monk ${link_1} shared a father-and-son-like bond.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Gyatso",
          "key": "${link_1}",
          "target": {
            "href": "Gyatso",
            "page": "Gyatso"
          }
        }
      ],
      "text": "Aang and Monk Gyatso shared a father-and-son-like bond."
    },
    {
      "body": "Monk ${link_0} was an important figure in the young Avatar's life as a mentor, guardian, and surrogate father. According to Aang, Gyatso taught him everything he knew, considering him to be the only father he ever really had. When the other head monks revealed to a twelve-year-old Aang that he was the Avatar, Gyatso was the only person who still saw him as the child he was; he attempted to relieve Aang's confused emotions, distracted him through fun and games, and shielded him from Monk ${link_1}, who believed that Aang should have concerned himself with learning all four elements. Gyatso and Aang's relationship came to an abrupt end, however, when the head monk, ${link_2}, decided to separate them, causing Aang to run away from the Southern Air Temple. Aang and Gyatso never saw each other again, as the Avatar ended up frozen for a century in ice and Gyatso was killed during the Air Nomad Genocide. Aang felt guilty about his departure from the temple, and when he had to meditate to open his ${link_3}, he had a vision of the Air Nomads, with Gyatso first among them.",
      "links": [
        {
          "body": "Gyatso",
          "key": "${link_0}",
          "target": {
            "href": "Gyatso",
            "page": "Gyatso"
          }
        },
        {
          "body": "Tashi",
          "key": "${link_1}",
          "target": {
            "href": "Tashi",
            "page": "Tashi"
          }
        },
        {
          "body": "Pasang",
          "key": "${link_2}",
          "target": {
            "href": "Pasang",
            "page": "Pasang"
          }
        },
        {
          "body": "air chakra",
          "key": "${link_3}",
          "target": {
            "href": "Chakras",
            "page": "Chakras"
          }
        }
      ],
      "text": "Monk Gyatso was an important figure in the young Avatar's life as a mentor, guardian, and surrogate father. According to Aang, Gyatso taught him everything he knew, considering him to be the only father he ever really had. When the other head monks revealed to a twelve-year-old Aang that he was the Avatar, Gyatso was the only person who still saw him as the child he was; he attempted to relieve Aang's confused emotions, distracted him through fun and games, and shielded him from Monk Tashi, who believed that Aang should have concerned himself with learning all four elements. Gyatso and Aang's relationship came to an abrupt end, however, when the head monk, Pasang, decided to separate them, causing Aang to run away from the Southern Air Temple. Aang and Gyatso never saw each other again, as the Avatar ended up frozen for a century in ice and Gyatso was killed during the Air Nomad Genocide. Aang felt guilty about his departure from the temple, and when he had to meditate to open his air chakra, he had a vision of the Air Nomads, with Gyatso first among them."
    },
    {
      "body": "${link_0} received advice from ${link_1} as they searched for ${link_2} and ${link_3}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_3}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Aang received advice from Iroh as they searched for Katara and Zuko."
    },
    {
      "body": "Iroh was originally one of Aang's enemies, albeit indirectly, as the firebender was aiding his nephew, ${link_0} Zuko, in capturing the Avatar and restoring his honor in the Fire Nation, actually attacking the team early in their journey. Iroh and Aang did not truly know each other much during most of their travels, but, while the Avatar was learning waterbending in the North Pole, the Fire Navy attacked the ${link_1}. In the chaos, ${link_2} ${link_3} was able to infiltrate the ${link_4} and attempted to slay the ${link_5}. When Aang was unable to stop him, Iroh intervened and warned Zhao to let the spirit go, as upsetting the natural balance would not only affect the ${link_6} but also the entire world; when the admiral arrogantly refused and murdered the Moon Spirit, the old general defeated the rest of the Fire Nation soldiers before assisting ${link_7} ${link_8} in her sacrifice.",
      "links": [
        {
          "body": "Prince",
          "key": "${link_0}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Admiral",
          "key": "${link_2}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_3}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Spirit Oasis",
          "key": "${link_4}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "Moon Spirit",
          "key": "${link_5}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_6}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Princess",
          "key": "${link_7}",
          "target": {
            "href": "Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_8}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        }
      ],
      "text": "Iroh was originally one of Aang's enemies, albeit indirectly, as the firebender was aiding his nephew, Prince Zuko, in capturing the Avatar and restoring his honor in the Fire Nation, actually attacking the team early in their journey. Iroh and Aang did not truly know each other much during most of their travels, but, while the Avatar was learning waterbending in the North Pole, the Fire Navy attacked the Northern Water Tribe. In the chaos, Admiral Zhao was able to infiltrate the Spirit Oasis and attempted to slay the Moon Spirit. When Aang was unable to stop him, Iroh intervened and warned Zhao to let the spirit go, as upsetting the natural balance would not only affect the Water Tribe but also the entire world; when the admiral arrogantly refused and murdered the Moon Spirit, the old general defeated the rest of the Fire Nation soldiers before assisting Princess Yue in her sacrifice."
    },
    {
      "body": "Some weeks later, a thoroughly sleep-deprived Aang was fighting a ${link_0} between Zuko, Princess Azula, and himself; Iroh, along with Katara, Sokka, and Toph arrived to aid him. Even against the combined efforts of the team, the prince, and the Dragon of the West, Azula was able to escape.",
      "links": [
        {
          "body": "three-way duel",
          "key": "${link_0}",
          "target": {
            "href": "Confrontation_at_Tu_Zin",
            "page": "Confrontation_at_Tu_Zin"
          }
        }
      ],
      "text": "Some weeks later, a thoroughly sleep-deprived Aang was fighting a three-way duel between Zuko, Princess Azula, and himself; Iroh, along with Katara, Sokka, and Toph arrived to aid him. Even against the combined efforts of the team, the prince, and the Dragon of the West, Azula was able to escape."
    },
    {
      "body": "Aang spent some time with Iroh when the two of them were tunneling into the catacombs of Ba Sing Se in order to save Katara and Zuko from the Dai Li. Despite a past of attacks, Aang bore no real grudge against Iroh, as the latter had merely accompanied Zuko on the exiled prince's attempts to capture the airbender, nor did the member of the ${link_0} take issue with the Avatar. Instead, Aang, who knew that Iroh had advised Toph, asked the wise firebender for guidance. When Aang explained that he had been given the opportunity to master the Avatar State by a guru, but as opening the chakras meant forgoing his feelings for Katara, he had not taken the chance, Iroh commended Aang on choosing love instead of power, stating, \"Perfection and power are overrated. I think you were very wise to choose happiness and love.\" After rejoining with each other, Katara and Aang were forced to fight both Azula and Zuko; the Fire Nation princess shot a bolt of lightning into the Avatar. Iroh joined the fray shortly thereafter, holding off the firebenders and the Dai Li long enough to allow Katara to escape with the injured Aang. Once safely on Appa, Katara revived Aang with the ${link_1} at the North Pole.",
      "links": [
        {
          "body": "Order of the White Lotus",
          "key": "${link_0}",
          "target": {
            "href": "Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        },
        {
          "body": "water from the Spirit Oasis",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_water",
            "page": "Spirit_water"
          }
        }
      ],
      "text": "Aang spent some time with Iroh when the two of them were tunneling into the catacombs of Ba Sing Se in order to save Katara and Zuko from the Dai Li. Despite a past of attacks, Aang bore no real grudge against Iroh, as the latter had merely accompanied Zuko on the exiled prince's attempts to capture the airbender, nor did the member of the Order of the White Lotus take issue with the Avatar. Instead, Aang, who knew that Iroh had advised Toph, asked the wise firebender for guidance. When Aang explained that he had been given the opportunity to master the Avatar State by a guru, but as opening the chakras meant forgoing his feelings for Katara, he had not taken the chance, Iroh commended Aang on choosing love instead of power, stating, \"Perfection and power are overrated. I think you were very wise to choose happiness and love.\" After rejoining with each other, Katara and Aang were forced to fight both Azula and Zuko; the Fire Nation princess shot a bolt of lightning into the Avatar. Iroh joined the fray shortly thereafter, holding off the firebenders and the Dai Li long enough to allow Katara to escape with the injured Aang. Once safely on Appa, Katara revived Aang with the water from the Spirit Oasis at the North Pole."
    },
    {
      "body": "Iroh, Grand Lotus of the Order of the White Lotus, later assisted Team Avatar in defeating the Fire Nation, and became an official friend of Aang after the end of the Hundred Year War, as shown in the ${link_0}.",
      "links": [
        {
          "body": "Jasmine Dragon",
          "key": "${link_0}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "text": "Iroh, Grand Lotus of the Order of the White Lotus, later assisted Team Avatar in defeating the Fire Nation, and became an official friend of Aang after the end of the Hundred Year War, as shown in the Jasmine Dragon."
    },
    {
      "body": "${link_0} ${link_1} ${link_2}'s ${link_3} abilities.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "restored",
          "key": "${link_1}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "bending",
          "key": "${link_3}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "Aang restored Korra's bending abilities."
    },
    {
      "body": "Avatar ${link_0} is Aang's immediate reincarnation, born of the ${link_1}. Korra initially had no connection with the previous Avatar, having had difficulty with the spiritual side of bending. She did, however, learn waterbending from Aang's wife, Katara, with whom she developed a strong bond, even sneaking to Republic City with her blessing.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "Avatar Korra is Aang's immediate reincarnation, born of the Southern Water Tribe. Korra initially had no connection with the previous Avatar, having had difficulty with the spiritual side of bending. She did, however, learn waterbending from Aang's wife, Katara, with whom she developed a strong bond, even sneaking to Republic City with her blessing."
    },
    {
      "body": "Eventually, Korra began having various visions of an adult Aang, along with Toph and Sokka. Korra initially was unable to figure out what the visions meant until she brought them up with Tenzin, who said that Aang's spirit could be trying to contact the young Avatar.",
      "links": [],
      "text": "Eventually, Korra began having various visions of an adult Aang, along with Toph and Sokka. Korra initially was unable to figure out what the visions meant until she brought them up with Tenzin, who said that Aang's spirit could be trying to contact the young Avatar."
    },
    {
      "body": "Korra finally made a connection with Aang when ${link_0} kidnapped her. In order to find a way to escape, Korra meditated and discovered Aang's struggles with Tarrlok's father, ${link_1}, forty years earlier. With these visions Korra managed to understand that Aang had been trying to warn her of Tarrlok, who had inherited his father's ability to ${link_2} without a full moon.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Yakone",
          "key": "${link_1}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        },
        {
          "body": "bloodbend",
          "key": "${link_2}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        }
      ],
      "text": "Korra finally made a connection with Aang when Tarrlok kidnapped her. In order to find a way to escape, Korra meditated and discovered Aang's struggles with Tarrlok's father, Yakone, forty years earlier. With these visions Korra managed to understand that Aang had been trying to warn her of Tarrlok, who had inherited his father's ability to bloodbend without a full moon."
    },
    {
      "body": "When Korra had her bending taken away from her by ${link_0}, she was at a low point in her life and ran off from her family and friends to be alone for a moment. Suddenly, Aang's spirit appeared and approached the young Avatar, gently telling her that she had finally connected with her spiritual self and that \"when we [reach] our lowest point [in life], we are open to the greatest change\". All of the previous Avatars appeared behind Aang, who compassionately used ${link_1} to restore Korra's bending and passed on the knowledge to her.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "energybending",
          "key": "${link_1}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        }
      ],
      "text": "When Korra had her bending taken away from her by Amon, she was at a low point in her life and ran off from her family and friends to be alone for a moment. Suddenly, Aang's spirit appeared and approached the young Avatar, gently telling her that she had finally connected with her spiritual self and that \"when we [reach] our lowest point [in life], we are open to the greatest change\". All of the previous Avatars appeared behind Aang, who compassionately used energybending to restore Korra's bending and passed on the knowledge to her."
    },
    {
      "body": "${link_0} was Aang's friend from the Fire Nation. The two had a close relationship, as \"[they] used to get in and out of so much trouble together\". Aang even referred to him as \"one of the best friends he ever had\".",
      "links": [
        {
          "body": "Kuzon",
          "key": "${link_0}",
          "target": {
            "href": "Kuzon",
            "page": "Kuzon"
          }
        }
      ],
      "text": "Kuzon was Aang's friend from the Fire Nation. The two had a close relationship, as \"[they] used to get in and out of so much trouble together\". Aang even referred to him as \"one of the best friends he ever had\"."
    },
    {
      "body": "Kuzon also offered a helping hand when Team Avatar traveled into the Fire Nation. When Aang was asked his name by a Fire Nation school teacher, he chose the name Kuzon as a cover name.",
      "links": [],
      "text": "Kuzon also offered a helping hand when Team Avatar traveled into the Fire Nation. When Aang was asked his name by a Fire Nation school teacher, he chose the name Kuzon as a cover name."
    },
    {
      "body": "${link_0} and Aang \"got along famously\" and enjoyed each other's company. During the ${link_1}'s finals, Lin said she had a hard time believing that \"sweet-tempered Aang\" was reincarnated into a hot-headed young girl.",
      "links": [
        {
          "body": "Lin",
          "key": "${link_0}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Pro-bending Tournament",
          "key": "${link_1}",
          "target": {
            "href": "Pro-bending#Pro-bending_Tournament",
            "page": "Pro-bending"
          }
        }
      ],
      "text": "Lin and Aang \"got along famously\" and enjoyed each other's company. During the Pro-bending Tournament's finals, Lin said she had a hard time believing that \"sweet-tempered Aang\" was reincarnated into a hot-headed young girl."
    },
    {
      "body": "The ${link_0} imparted ${link_1} with the knowledge of ${link_2}.",
      "links": [
        {
          "body": "lion turtle",
          "key": "${link_0}",
          "target": {
            "href": "Lion_turtle#Era_of_the_Avatar",
            "page": "Lion_turtle"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "energybending",
          "key": "${link_2}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        }
      ],
      "text": "The lion turtle imparted Aang with the knowledge of energybending."
    },
    {
      "body": "When Aang was desperate to find a way to defeat Ozai without killing him, he was highly unsuccessful. As he meditated consistently on the subject, he spotted a mysterious island at night near the coast of ${link_0}, where he and his friends had made their hideout. An exhausted Aang sleepwalked his way onto the island, followed by Momo. Aang awoke the next morning, believing his journey to the island was a strange dream, only to find the dream as a reality. Aang was not only on the island, but the island itself, which had been clearly near the shore of Ember Island, was now far away in the middle of the vast ocean.",
      "links": [
        {
          "body": "Ember Island",
          "key": "${link_0}",
          "target": {
            "href": "Ember_Island",
            "page": "Ember_Island"
          }
        }
      ],
      "text": "When Aang was desperate to find a way to defeat Ozai without killing him, he was highly unsuccessful. As he meditated consistently on the subject, he spotted a mysterious island at night near the coast of Ember Island, where he and his friends had made their hideout. An exhausted Aang sleepwalked his way onto the island, followed by Momo. Aang awoke the next morning, believing his journey to the island was a strange dream, only to find the dream as a reality. Aang was not only on the island, but the island itself, which had been clearly near the shore of Ember Island, was now far away in the middle of the vast ocean."
    },
    {
      "body": "Aang had no idea where he was and stated his confusion aloud. Eventually, he found his way to the top of the island. After trying to bend the earth beneath him, the island remained as smooth and silent as ever, which could only mean Aang did not stand on normal rock. A confused Aang looked deep within himself and summoned the spirit of Roku, who was just as clueless as Aang to their current location. After Aang had concluded from a series of conversations with Roku and their past lives that the only way to conquer Ozai was to kill him, he and Momo slept a while waiting to be found.",
      "links": [],
      "text": "Aang had no idea where he was and stated his confusion aloud. Eventually, he found his way to the top of the island. After trying to bend the earth beneath him, the island remained as smooth and silent as ever, which could only mean Aang did not stand on normal rock. A confused Aang looked deep within himself and summoned the spirit of Roku, who was just as clueless as Aang to their current location. After Aang had concluded from a series of conversations with Roku and their past lives that the only way to conquer Ozai was to kill him, he and Momo slept a while waiting to be found."
    },
    {
      "body": "When Aang and Momo awoke, the island was moving toward some mountains at the edge of the sea. Shortly after realizing the island was moving, Aang jumped into the water and swam deeper down, where he found to his amazement the island to have gargantuan claws with which it paddled. When Aang resurfaced, he stated his amazement to Momo and believed the mysterious swimming island was in fact a shell belonging to what Aang thought largest animal in the world.",
      "links": [],
      "text": "When Aang and Momo awoke, the island was moving toward some mountains at the edge of the sea. Shortly after realizing the island was moving, Aang jumped into the water and swam deeper down, where he found to his amazement the island to have gargantuan claws with which it paddled. When Aang resurfaced, he stated his amazement to Momo and believed the mysterious swimming island was in fact a shell belonging to what Aang thought largest animal in the world."
    },
    {
      "body": "Aang dived underwater again and stopped in front of what he found to be the creature's closed eyelid which opened behind him. The creature lifted Aang upward with its claw. Aang emerged above the water surface standing on the claw of none other than a ${link_0}. Aang bowed in respect before the ancient animal and asked him for help in his quest to vanquish Ozai without killing Ozai. The wise lion turtle informed the young Avatar of an ancient though forgotten art which could be used to defeat Ozai, and Aang regained confidence in his ability to defeat the Fire Lord without taking his life. A little while later, the lion turtle left Aang at the shore and told him to wait for Ozai.",
      "links": [
        {
          "body": "lion turtle",
          "key": "${link_0}",
          "target": {
            "href": "Lion_turtle#Era_of_the_Avatar",
            "page": "Lion_turtle"
          }
        }
      ],
      "text": "Aang dived underwater again and stopped in front of what he found to be the creature's closed eyelid which opened behind him. The creature lifted Aang upward with its claw. Aang emerged above the water surface standing on the claw of none other than a lion turtle. Aang bowed in respect before the ancient animal and asked him for help in his quest to vanquish Ozai without killing Ozai. The wise lion turtle informed the young Avatar of an ancient though forgotten art which could be used to defeat Ozai, and Aang regained confidence in his ability to defeat the Fire Lord without taking his life. A little while later, the lion turtle left Aang at the shore and told him to wait for Ozai."
    },
    {
      "body": "When Aang had Ozai at his knees but still as malevolent as ever, Aang used ${link_0} to bend the earth around them which trapped Ozai. Remembering what the lion turtle had told him, Aang used energybending to strip Ozai of his firebending, thus sparing his life but rendering him totally powerless. Weak and dazed, Ozai found himself unable to even stand and fell limply to the ground. In the process, it was revealed that Aang had become a fully realized Avatar.",
      "links": [
        {
          "body": "seismic sense",
          "key": "${link_0}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        }
      ],
      "text": "When Aang had Ozai at his knees but still as malevolent as ever, Aang used seismic sense to bend the earth around them which trapped Ozai. Remembering what the lion turtle had told him, Aang used energybending to strip Ozai of his firebending, thus sparing his life but rendering him totally powerless. Weak and dazed, Ozai found himself unable to even stand and fell limply to the ground. In the process, it was revealed that Aang had become a fully realized Avatar."
    },
    {
      "body": "Aang could never have defeated Ozai the way he wanted to without the lion turtle's help. When Sokka, Toph, and Suki joined Aang shortly after Momo had, the three friends expected Ozai to be dead, but to their surprise, they were mistaken. Aang explained that he had extracted the firebending power out of Ozai's body, which bewildered his three friends even more. When Toph asked him what sage or master had trained Aang to extract the bending power out of a bender's body, Aang answered honestly, showing his great respect for the lion turtle.",
      "links": [],
      "text": "Aang could never have defeated Ozai the way he wanted to without the lion turtle's help. When Sokka, Toph, and Suki joined Aang shortly after Momo had, the three friends expected Ozai to be dead, but to their surprise, they were mistaken. Aang explained that he had extracted the firebending power out of Ozai's body, which bewildered his three friends even more. When Toph asked him what sage or master had trained Aang to extract the bending power out of a bender's body, Aang answered honestly, showing his great respect for the lion turtle."
    },
    {
      "body": "${link_0} found ${link_1} in the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Momo",
          "key": "${link_1}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        },
        {
          "body": "Southern Air Temple",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        }
      ],
      "text": "Aang found Momo in the Southern Air Temple."
    },
    {
      "body": "Aang discovered ${link_0}, a ${link_1}, while wandering about the ruins of the ${link_2}. Amazed to find a creature ties to his culture to still be alive, Aang quickly befriended the lemur and claimed him as a pet, naming him after the ${link_3} Momo was holding at the time.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        },
        {
          "body": "winged lemur",
          "key": "${link_1}",
          "target": {
            "href": "Winged_lemur",
            "page": "Winged_lemur"
          }
        },
        {
          "body": "Southern Air Temple",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        },
        {
          "body": "peach",
          "key": "${link_3}",
          "target": {
            "href": "Moon_peach",
            "page": "Moon_peach"
          }
        }
      ],
      "text": "Aang discovered Momo, a winged lemur, while wandering about the ruins of the Southern Air Temple. Amazed to find a creature ties to his culture to still be alive, Aang quickly befriended the lemur and claimed him as a pet, naming him after the peach Momo was holding at the time."
    },
    {
      "body": "After Momo joined the group, he was mostly seen perched on Aang's shoulder, and they were quite close. Aang was also very protective of Momo, as evidenced when he struck down a ${link_0} in order to rescue him and told Momo, the only one who had accompanied him, to go right before his final ${link_1}.",
      "links": [
        {
          "body": "buzzard wasp",
          "key": "${link_0}",
          "target": {
            "href": "Buzzard_wasp",
            "page": "Buzzard_wasp"
          }
        },
        {
          "body": "battle with Ozai",
          "key": "${link_1}",
          "target": {
            "href": "Battle_at_Wulong_Forest",
            "page": "Battle_at_Wulong_Forest"
          }
        }
      ],
      "text": "After Momo joined the group, he was mostly seen perched on Aang's shoulder, and they were quite close. Aang was also very protective of Momo, as evidenced when he struck down a buzzard wasp in order to rescue him and told Momo, the only one who had accompanied him, to go right before his final battle with Ozai."
    },
    {
      "body": "${link_0} and ${link_1} met during the former's time at the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "On Ji",
          "key": "${link_1}",
          "target": {
            "href": "On_Ji",
            "page": "On_Ji"
          }
        },
        {
          "body": "Fire Nation school",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation_school",
            "page": "Fire_Nation_school"
          }
        }
      ],
      "text": "Aang and On Ji met during the former's time at the Fire Nation school."
    },
    {
      "body": "While in the Fire Nation, Aang accidentally disguised himself as a student from the ${link_0}; confused and in desperate need of help, he befriended a girl named ${link_1}, who aided him throughout the school day. Growing jealous, On Ji's boyfriend, ${link_2}, threatened Aang for speaking to her, but the Avatar invited her nonetheless to the party at the cave; he even danced with her. When the ${link_3} of the school and several truant officers arrived at the party to stop it, Aang and the rest of Team Avatar fled with the help of the other students.",
      "links": [
        {
          "body": "local school",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_school",
            "page": "Fire_Nation_school"
          }
        },
        {
          "body": "On Ji",
          "key": "${link_1}",
          "target": {
            "href": "On_Ji",
            "page": "On_Ji"
          }
        },
        {
          "body": "Hide",
          "key": "${link_2}",
          "target": {
            "href": "Hide",
            "page": "Hide"
          }
        },
        {
          "body": "headmaster",
          "key": "${link_3}",
          "target": {
            "href": "Headmaster",
            "page": "Headmaster"
          }
        }
      ],
      "text": "While in the Fire Nation, Aang accidentally disguised himself as a student from the local school; confused and in desperate need of help, he befriended a girl named On Ji, who aided him throughout the school day. Growing jealous, On Ji's boyfriend, Hide, threatened Aang for speaking to her, but the Avatar invited her nonetheless to the party at the cave; he even danced with her. When the headmaster of the school and several truant officers arrived at the party to stop it, Aang and the rest of Team Avatar fled with the help of the other students."
    },
    {
      "body": "On Ji showed some possible romantic interest in Aang; this unrequited affection became more evident when she blushed as Aang approached her.",
      "links": [],
      "text": "On Ji showed some possible romantic interest in Aang; this unrequited affection became more evident when she blushed as Aang approached her."
    },
    {
      "body": "${link_0} sought ${link_1} ${link_2}'s advice on multiple occasions.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        }
      ],
      "text": "Aang sought Avatar Roku's advice on multiple occasions."
    },
    {
      "body": "As the Avatar, Aang was able to speak and interact with his ${link_0}.",
      "links": [
        {
          "body": "past lives",
          "key": "${link_0}",
          "target": {
            "href": "Avatar#Past_lives",
            "page": "Avatar"
          }
        }
      ],
      "text": "As the Avatar, Aang was able to speak and interact with his past lives."
    },
    {
      "body": "Aang first learned of his past self, Avatar Roku, from Monk Gyatso, and he later connected with him at the temple on ${link_0}. On Crescent Island, Roku informed his reincarnation that Fire Lord Ozai must be defeated before the arrival of ${link_1} at summer's end. Afterward, Roku became a spiritual guide to Aang, teaching him everything he knew about being the Avatar, including the dangers of the Avatar State, and helping him when he needed advice. When Aang believed that he had failed the world, Roku, with help from Yue, encouraged him and convinced him to continue with his struggle against the Fire Lord as he had previously. However, Roku's counsel was not always what Aang wanted to hear; Roku's wisdom regarding the issue of taking the Fire Lord's life was to \"be decisive\". Otherwise, Aang would make the same mistake Roku made by sparing Fire Lord ${link_2}'s life, thus indirectly being the cause for the ${link_3} and subsequent war.",
      "links": [
        {
          "body": "Crescent Island",
          "key": "${link_0}",
          "target": {
            "href": "Crescent_Island",
            "page": "Crescent_Island"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_1}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_2}",
          "target": {
            "href": "Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "Air Nomad Genocide",
          "key": "${link_3}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        }
      ],
      "text": "Aang first learned of his past self, Avatar Roku, from Monk Gyatso, and he later connected with him at the temple on Crescent Island. On Crescent Island, Roku informed his reincarnation that Fire Lord Ozai must be defeated before the arrival of Sozin's Comet at summer's end. Afterward, Roku became a spiritual guide to Aang, teaching him everything he knew about being the Avatar, including the dangers of the Avatar State, and helping him when he needed advice. When Aang believed that he had failed the world, Roku, with help from Yue, encouraged him and convinced him to continue with his struggle against the Fire Lord as he had previously. However, Roku's counsel was not always what Aang wanted to hear; Roku's wisdom regarding the issue of taking the Fire Lord's life was to \"be decisive\". Otherwise, Aang would make the same mistake Roku made by sparing Fire Lord Sozin's life, thus indirectly being the cause for the Air Nomad Genocide and subsequent war."
    },
    {
      "body": "Additionally, Aang relied on his three past lives prior to Roku for support and guidance. The day before Sozin's Comet arrived, Aang faced a moral crisis: the monks had taught him that killing was wrong, yet everyone he knew was pressuring him to end the Hundred Year War and save the world by taking Ozai's life. After Roku more or less bluntly told Aang to take the ${link_0}'s life by urging him to \"be decisive,\" the monk decided to ask his other incarnations in the hopes that one of them would give him a way out of taking Ozai's life. He first approached Avatar ${link_1} for advice, and she reminded Aang of her conflict with ${link_2} the Conqueror: she had been prepared to end Chin's life and therefore saw no difference as to whether she had killed him deliberately or not - and now Aang must do whatever it took to stop Ozai. Naturally, Aang regretted asking her for this advice, stating that \"[he] knew [he] shouldn't have asked Kyoshi\" and went on to question Avatar ${link_3}, who talked about how laid back the Water Tribe Avatar had been and how his lack of action had cost him his bride ${link_4} to ${link_5}; his advice was that, as the Avatar, Aang must actively shape his own destiny and the destiny of the world. Desperate to find another way that did not involve taking anyone's life, he asked the Air Nomad Avatar before him; Avatar ${link_6}. Although she agreed that all life was sacred and that Aang had been taught well by the monks, she advised Aang that \"selfless duty\" meant that he needed to sacrifice his own spiritual needs to satisfy the needs of the world. Aang initially decided to accept his past lives' advice and kill the Fire Lord, but later changed his mind upon conversing with the lion turtle.",
      "links": [
        {
          "body": "Phoenix King",
          "key": "${link_0}",
          "target": {
            "href": "Phoenix_King",
            "page": "Phoenix_King"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        },
        {
          "body": "Chin",
          "key": "${link_2}",
          "target": {
            "href": "Chin",
            "page": "Chin"
          }
        },
        {
          "body": "Kuruk",
          "key": "${link_3}",
          "target": {
            "href": "Kuruk",
            "page": "Kuruk"
          }
        },
        {
          "body": "Ummi",
          "key": "${link_4}",
          "target": {
            "href": "Ummi",
            "page": "Ummi"
          }
        },
        {
          "body": "Koh",
          "key": "${link_5}",
          "target": {
            "href": "Koh",
            "page": "Koh"
          }
        },
        {
          "body": "Yangchen",
          "key": "${link_6}",
          "target": {
            "href": "Yangchen",
            "page": "Yangchen"
          }
        }
      ],
      "text": "Additionally, Aang relied on his three past lives prior to Roku for support and guidance. The day before Sozin's Comet arrived, Aang faced a moral crisis: the monks had taught him that killing was wrong, yet everyone he knew was pressuring him to end the Hundred Year War and save the world by taking Ozai's life. After Roku more or less bluntly told Aang to take the Phoenix King's life by urging him to \"be decisive,\" the monk decided to ask his other incarnations in the hopes that one of them would give him a way out of taking Ozai's life. He first approached Avatar Kyoshi for advice, and she reminded Aang of her conflict with Chin the Conqueror: she had been prepared to end Chin's life and therefore saw no difference as to whether she had killed him deliberately or not - and now Aang must do whatever it took to stop Ozai. Naturally, Aang regretted asking her for this advice, stating that \"[he] knew [he] shouldn't have asked Kyoshi\" and went on to question Avatar Kuruk, who talked about how laid back the Water Tribe Avatar had been and how his lack of action had cost him his bride Ummi to Koh; his advice was that, as the Avatar, Aang must actively shape his own destiny and the destiny of the world. Desperate to find another way that did not involve taking anyone's life, he asked the Air Nomad Avatar before him; Avatar Yangchen. Although she agreed that all life was sacred and that Aang had been taught well by the monks, she advised Aang that \"selfless duty\" meant that he needed to sacrifice his own spiritual needs to satisfy the needs of the world. Aang initially decided to accept his past lives' advice and kill the Fire Lord, but later changed his mind upon conversing with the lion turtle."
    },
    {
      "body": "${link_0} grew concerned for ${link_1} after learning that ${link_2} had been taken.",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Appa",
          "key": "${link_2}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Suki grew concerned for Aang after learning that Appa had been taken."
    },
    {
      "body": "Aang and Suki met each other when she and her ${link_0} ambushed him, Katara, and Sokka, but after Aang informed them that he was the Avatar, they started to treat him and his friends as honored guests. They met again at ${link_1}, and she accompanied Aang and the rest of Team Avatar when they led several refugees through the ${link_2}. When she found out about Appa, she expressed concern for Aang and asked if he was feeling okay. When she discovered Appa hiding in a cave, Suki attempted to reunite Aang with Appa, only to be stopped by Azula, ${link_3}, and ${link_4}. Aang and Suki met again when she escaped from the ${link_5}.",
      "links": [
        {
          "body": "warriors",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Full Moon Bay",
          "key": "${link_1}",
          "target": {
            "href": "Full_Moon_Bay",
            "page": "Full_Moon_Bay"
          }
        },
        {
          "body": "Serpent's Pass",
          "key": "${link_2}",
          "target": {
            "href": "Serpent%27s_Pass",
            "page": "Serpent%27s_Pass"
          }
        },
        {
          "body": "Mai",
          "key": "${link_3}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_4}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_5}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        }
      ],
      "text": "Aang and Suki met each other when she and her warriors ambushed him, Katara, and Sokka, but after Aang informed them that he was the Avatar, they started to treat him and his friends as honored guests. They met again at Full Moon Bay, and she accompanied Aang and the rest of Team Avatar when they led several refugees through the Serpent's Pass. When she found out about Appa, she expressed concern for Aang and asked if he was feeling okay. When she discovered Appa hiding in a cave, Suki attempted to reunite Aang with Appa, only to be stopped by Azula, Mai, and Ty Lee. Aang and Suki met again when she escaped from the Boiling Rock."
    },
    {
      "body": "${link_0} listened as ${link_1} told him about her background.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Aang listened as Toph told him about her background."
    },
    {
      "body": "Toph first appeared as a vision of the future to Aang in a ${link_0}.",
      "links": [
        {
          "body": "mystical swamp",
          "key": "${link_0}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        }
      ],
      "text": "Toph first appeared as a vision of the future to Aang in a mystical swamp."
    },
    {
      "body": "When Aang first truly met Toph, he recognized her talent and remembered both his swamp vision and Bumi's advice of finding a teacher who listened before striking. Wanting to talk to her, he accidentally defeated her in an ${link_0} match and lost her the championship, causing her to initially dislike him. Later, while the Avatar tried to persuade her to be his earthbending teacher, Toph, fearing her parent's wrath if they discovered her secret life as the Blind Bandit, declined the offer; however, after a dinner fiasco in front of her parents, she \"[called] a truce\" with Aang and agreed to that with him. The two took a stroll about the garden, and she explained why she could not leave her parents. Following her parents' discovery of her talent and her pseudonym, Toph joined Team Avatar in order to teach Aang earthbending. After a sleepless night, Toph accused Appa of leading Azula to him, and an enraged Aang snapped her, causing her to temporarily leave the group. Acting on Iroh's advice, she rejoined them at a moment of crisis and helped in the fight against Azula in ${link_1}. Afterward, Toph officially began teaching Aang earthbending. She had a much different teaching approach than Katara, one akin to that of an army drill sergeant: Just like their elements, Aang and Toph's personalities were complete opposites. At first, he was intimidated by Toph's bold nature and tried to work peacefully around it, but he eventually learned to stand up to her after fighting a ${link_2} and took back his staff, which she had been using as a nutcracker. When the group found itself stranded in the ${link_3}, Aang, believing that Toph had allowed Appa to be captured due to her previous complaints about him, yelled at her in a fit of anger.",
      "links": [
        {
          "body": "Earth Rumble VI",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Rumble_VI",
            "page": "Earth_Rumble_VI"
          }
        },
        {
          "body": "Tu Zin",
          "key": "${link_1}",
          "target": {
            "href": "Tu_Zin",
            "page": "Tu_Zin"
          }
        },
        {
          "body": "saber-tooth moose lion",
          "key": "${link_2}",
          "target": {
            "href": "Saber-tooth_moose_lion",
            "page": "Saber-tooth_moose_lion"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_3}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        }
      ],
      "text": "When Aang first truly met Toph, he recognized her talent and remembered both his swamp vision and Bumi's advice of finding a teacher who listened before striking. Wanting to talk to her, he accidentally defeated her in an Earth Rumble VI match and lost her the championship, causing her to initially dislike him. Later, while the Avatar tried to persuade her to be his earthbending teacher, Toph, fearing her parent's wrath if they discovered her secret life as the Blind Bandit, declined the offer; however, after a dinner fiasco in front of her parents, she \"[called] a truce\" with Aang and agreed to that with him. The two took a stroll about the garden, and she explained why she could not leave her parents. Following her parents' discovery of her talent and her pseudonym, Toph joined Team Avatar in order to teach Aang earthbending. After a sleepless night, Toph accused Appa of leading Azula to him, and an enraged Aang snapped her, causing her to temporarily leave the group. Acting on Iroh's advice, she rejoined them at a moment of crisis and helped in the fight against Azula in Tu Zin. Afterward, Toph officially began teaching Aang earthbending. She had a much different teaching approach than Katara, one akin to that of an army drill sergeant: Just like their elements, Aang and Toph's personalities were complete opposites. At first, he was intimidated by Toph's bold nature and tried to work peacefully around it, but he eventually learned to stand up to her after fighting a saber-tooth moose lion and took back his staff, which she had been using as a nutcracker. When the group found itself stranded in the Si Wong Desert, Aang, believing that Toph had allowed Appa to be captured due to her previous complaints about him, yelled at her in a fit of anger."
    },
    {
      "body": "However, they seemed to have an easier relationship as time went along. Aang referred to everyone, including Toph, as his family. Aang and Toph became good and steadfast friends, and Aang enjoyed hanging out with her, even if it meant scamming people for money. Toph also regularly referred to Aang as \"${link_0}\" in reference to his light footsteps.",
      "links": [
        {
          "body": "Twinkle Toes",
          "key": "${link_0}",
          "target": {
            "href": "Slang_in_the_World_of_Avatar",
            "page": "Slang_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "However, they seemed to have an easier relationship as time went along. Aang referred to everyone, including Toph, as his family. Aang and Toph became good and steadfast friends, and Aang enjoyed hanging out with her, even if it meant scamming people for money. Toph also regularly referred to Aang as \"Twinkle Toes\" in reference to his light footsteps."
    },
    {
      "body": "${link_0} chose ${link_1} to be his ${link_2} teacher.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Aang chose Toph to be his earthbending teacher."
    },
    {
      "body": "Despite their differences, Aang held Toph in great admiration, respect, and even awe at times because of her unique bending capabilities. After Toph explained the full capacity of her power, Aang responded: \"That's amazing!\" He repeated the same line after she revealed how she learned earthbending. Toph also seemed to eventually show respect for Aang's own bending power; she told him just before the ${link_0}, \"You're the man, Twinkle Toes!\" and \"I hope you kick some serious Fire Lord-butt, Twinkle Toes!\" showing her belief in his capability.",
      "links": [
        {
          "body": "invasion",
          "key": "${link_0}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "text": "Despite their differences, Aang held Toph in great admiration, respect, and even awe at times because of her unique bending capabilities. After Toph explained the full capacity of her power, Aang responded: \"That's amazing!\" He repeated the same line after she revealed how she learned earthbending. Toph also seemed to eventually show respect for Aang's own bending power; she told him just before the invasion, \"You're the man, Twinkle Toes!\" and \"I hope you kick some serious Fire Lord-butt, Twinkle Toes!\" showing her belief in his capability."
    },
    {
      "body": "Aang and Toph's relationship was temporarily strained by their different perspectives regarding the revival of Yangchen's Festival, though the two eventually came to an understanding.",
      "links": [],
      "text": "Aang and Toph's relationship was temporarily strained by their different perspectives regarding the revival of Yangchen's Festival, though the two eventually came to an understanding."
    },
    {
      "body": "The friendship and cooperation between Aang and Toph persisted into their adulthood, as clearly seen when the Avatar decided to assist Toph Beifong, who had become ${link_0}, in arresting Yakone, a criminal who had been terrorizing Republic City. Even at the age of forty, Aang was still referred to by Toph as \"Twinkle Toes\", however, not to the airbender's amusement, demonstrating that the dynamics between the two had remained much the same.",
      "links": [
        {
          "body": "Chief of Police",
          "key": "${link_0}",
          "target": {
            "href": "Chief_of_Police",
            "page": "Chief_of_Police"
          }
        }
      ],
      "text": "The friendship and cooperation between Aang and Toph persisted into their adulthood, as clearly seen when the Avatar decided to assist Toph Beifong, who had become Chief of Police, in arresting Yakone, a criminal who had been terrorizing Republic City. Even at the age of forty, Aang was still referred to by Toph as \"Twinkle Toes\", however, not to the airbender's amusement, demonstrating that the dynamics between the two had remained much the same."
    },
    {
      "body": "${link_0} helped ${link_1} think of a way to turn the ${link_2} away from the ${link_3}.",
      "links": [
        {
          "body": "Yue",
          "key": "${link_0}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_3}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "text": "Yue helped Aang think of a way to turn the Fire Nation away from the Northern Water Tribe."
    },
    {
      "body": "During the events of the ${link_0}, Aang realized that there were far too many Fire Navy ships to destroy them himself, so Yue brought the Avatar to the Spirit Oasis in order to aid him journey to the ${link_1} and the seek the advice of Tui and La, the Ocean and Moon Spirits. After Admiral Zhao slayed the Moon Spirit, Yue, who had a spiritual connection to the moon, sacrificed her life in order to restore it and became the physical appearance of the spirit as well.",
      "links": [
        {
          "body": "Siege of the North",
          "key": "${link_0}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "During the events of the Siege of the North, Aang realized that there were far too many Fire Navy ships to destroy them himself, so Yue brought the Avatar to the Spirit Oasis in order to aid him journey to the Spirit World and the seek the advice of Tui and La, the Ocean and Moon Spirits. After Admiral Zhao slayed the Moon Spirit, Yue, who had a spiritual connection to the moon, sacrificed her life in order to restore it and became the physical appearance of the spirit as well."
    },
    {
      "body": "As the Moon Spirit, Yue helped Aang many times. After he was shot by Azula's lightning, she served as his guide when she informed him he needed to reconnect with his past lives to keep the Avatar Cycle whole. After he awoke from his coma, Aang decided to leave his friends and face the Fire Lord alone, but, still injured, he was unable to make it and found himself stranded in the middle of the ocean. Convinced he had failed, the Avatar even refused to be consoled by Roku, but Yue, calming the seas, reminded him that he had already saved the world and encouraged him not to give up by saying he would save the world again; with his will restored, Aang realized he had to keep trying, and the Moon Spirit helped him bend a giant wave to give him a safe journey toward the Fire Nation.",
      "links": [],
      "text": "As the Moon Spirit, Yue helped Aang many times. After he was shot by Azula's lightning, she served as his guide when she informed him he needed to reconnect with his past lives to keep the Avatar Cycle whole. After he awoke from his coma, Aang decided to leave his friends and face the Fire Lord alone, but, still injured, he was unable to make it and found himself stranded in the middle of the ocean. Convinced he had failed, the Avatar even refused to be consoled by Roku, but Yue, calming the seas, reminded him that he had already saved the world and encouraged him not to give up by saying he would save the world again; with his will restored, Aang realized he had to keep trying, and the Moon Spirit helped him bend a giant wave to give him a safe journey toward the Fire Nation."
    },
    {
      "body": "${link_0} was initially hunted down by ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Aang was initially hunted down by Zuko."
    },
    {
      "body": "Prince Zuko was at first one of Aang's greatest enemies. His persistent quest to capture the Avatar, fueled by his need to have his father's acceptance, was a threat to both Aang and the world at large, as he was the only thing standing between the Fire Nation and total world domination, yet each of them had helped the other in various ways. Because his right to the throne and to return home from exile hinged on the Avatar's capture, he had to protect Aang from other potential \"threats\": the possibilities of someone else fulfilling his mission. When Aang was abducted by the prince's rival, Admiral Zhao, Zuko, hiding his identity behind a blue mask, posed as a vigilante and master of dual dao swords named the Blue Spirit in order to free Aang from custody. In turn, the Avatar rescued the exiled prince when the latter was knocked unconscious during the escape attempt. Afterward, reflecting on an old Fire Nation friend named Kuzon, Aang asked Zuko if they could have been friends under different circumstances, only to receive a fire blast in reply.",
      "links": [],
      "text": "Prince Zuko was at first one of Aang's greatest enemies. His persistent quest to capture the Avatar, fueled by his need to have his father's acceptance, was a threat to both Aang and the world at large, as he was the only thing standing between the Fire Nation and total world domination, yet each of them had helped the other in various ways. Because his right to the throne and to return home from exile hinged on the Avatar's capture, he had to protect Aang from other potential \"threats\": the possibilities of someone else fulfilling his mission. When Aang was abducted by the prince's rival, Admiral Zhao, Zuko, hiding his identity behind a blue mask, posed as a vigilante and master of dual dao swords named the Blue Spirit in order to free Aang from custody. In turn, the Avatar rescued the exiled prince when the latter was knocked unconscious during the escape attempt. Afterward, reflecting on an old Fire Nation friend named Kuzon, Aang asked Zuko if they could have been friends under different circumstances, only to receive a fire blast in reply."
    },
    {
      "body": "Despite objections from the rest of Team Avatar, Aang also saved Zuko from freezing to death in the icy tundra of the North Pole. During their subsequent encounter several weeks later, Zuko and Aang initially traded blows but eventually fought alongside once again, this time against their mutual enemy, Princess Azula.",
      "links": [],
      "text": "Despite objections from the rest of Team Avatar, Aang also saved Zuko from freezing to death in the icy tundra of the North Pole. During their subsequent encounter several weeks later, Zuko and Aang initially traded blows but eventually fought alongside once again, this time against their mutual enemy, Princess Azula."
    },
    {
      "body": "Zuko's life development paralleled Aang's as both of them confronted their pasts at the same time; later, while Aang was learning to earthbend, Zuko also struggled with a new skill, lightning generation, and finally learned to ${link_0}.",
      "links": [
        {
          "body": "redirect lightning",
          "key": "${link_0}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "text": "Zuko's life development paralleled Aang's as both of them confronted their pasts at the same time; later, while Aang was learning to earthbend, Zuko also struggled with a new skill, lightning generation, and finally learned to redirect lightning."
    },
    {
      "body": "As individuals, Aang and Zuko shared many similarities: both had profound father figures in their lives, as Monk Gyatso served as Aang's guardian when the latter was taken from his parents to become a monk, while Uncle Iroh acted as a watchful mentor to his nephew Zuko after Fire Lord Ozai banished him. The two also had shameful pasts and were forced to live with the guilt of disappointing those that they revered the most - and both were forever marked with a symbol of their guilt, as Aang had received his traditional Air Nomad ${link_0} from the monk, while Zuko's father had burned a scar onto his son's face. As well, the two were fighting for something specific; Aang persevered for the world and the people around him, while Zuko strove for his honor. To some extent, Aang displayed interest in Zuko as a person, but the exiled prince only saw the Avatar as a means to regain his lost honor.",
      "links": [
        {
          "body": "tattoos",
          "key": "${link_0}",
          "target": {
            "href": "Body_markings_in_the_World_of_Avatar",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "As individuals, Aang and Zuko shared many similarities: both had profound father figures in their lives, as Monk Gyatso served as Aang's guardian when the latter was taken from his parents to become a monk, while Uncle Iroh acted as a watchful mentor to his nephew Zuko after Fire Lord Ozai banished him. The two also had shameful pasts and were forced to live with the guilt of disappointing those that they revered the most - and both were forever marked with a symbol of their guilt, as Aang had received his traditional Air Nomad tattoos from the monk, while Zuko's father had burned a scar onto his son's face. As well, the two were fighting for something specific; Aang persevered for the world and the people around him, while Zuko strove for his honor. To some extent, Aang displayed interest in Zuko as a person, but the exiled prince only saw the Avatar as a means to regain his lost honor."
    },
    {
      "body": "While in Ba Sing Se, Aang, attempting to find his lost sky bison, distributed fliers throughout the city. Zuko found one of the fliers and realized the Avatar was within reach. Donning his Blue Spirit mask, he sneaked into the underground Dai Li bunker and found the room in which Appa was being held. After Uncle Iroh confronted him, an extremely confused Zuko finally saw the light and released the Avatar's bison, but upon his return to ${link_0}, he fell into a deep fever, during which he experienced a number of visions, hallucinations and dreams, some of which seemed to allude to future events in his life. In the last of these, Zuko experienced a false awakening in which he saw himself with Aang's tattoos, a shaved head, and no scar. Later, while in the catacombs of the city, he claimed to have changed for the better, but eventually chose to side with Azula, who promised him his honor and his throne, and attempted to capture Aang again.",
      "links": [
        {
          "body": "the apartment",
          "key": "${link_0}",
          "target": {
            "href": "Iroh_and_Zuko%27s_apartment",
            "page": "Iroh_and_Zuko%27s_apartment"
          }
        }
      ],
      "text": "While in Ba Sing Se, Aang, attempting to find his lost sky bison, distributed fliers throughout the city. Zuko found one of the fliers and realized the Avatar was within reach. Donning his Blue Spirit mask, he sneaked into the underground Dai Li bunker and found the room in which Appa was being held. After Uncle Iroh confronted him, an extremely confused Zuko finally saw the light and released the Avatar's bison, but upon his return to the apartment, he fell into a deep fever, during which he experienced a number of visions, hallucinations and dreams, some of which seemed to allude to future events in his life. In the last of these, Zuko experienced a false awakening in which he saw himself with Aang's tattoos, a shaved head, and no scar. Later, while in the catacombs of the city, he claimed to have changed for the better, but eventually chose to side with Azula, who promised him his honor and his throne, and attempted to capture Aang again."
    },
    {
      "body": "Once he had returned to the Fire Nation and reclaimed his place as the Crown Prince, Zuko, under the belief that Aang was still alive, hired an ${link_0} to \"end\" the Avatar.",
      "links": [
        {
          "body": "assassin",
          "key": "${link_0}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        }
      ],
      "text": "Once he had returned to the Fire Nation and reclaimed his place as the Crown Prince, Zuko, under the belief that Aang was still alive, hired an assassin to \"end\" the Avatar."
    },
    {
      "body": "Zuko's mother Ursa was in fact Avatar Roku's descendant, consequently, Aang was the reincarnation of one of Zuko's maternal great-grandfather, making the Avatar and the Fire Prince spiritual relatives. After confronting his father on the ${link_0}, Zuko defected from the Fire Nation in order to join Team Avatar. Aang, who was not comfortable with any sort of responsibility at the moment, watched for cues among the rest of the team as to how to respond; when Katara, who had been hurt by him in the catacombs, reacted negatively, the Avatar did likewise. Afterward, he revealed how Zuko had rescued him at ${link_1}; Aang himself believed that Zuko had some good in him, but when the firebender burned Toph's feet, the Avatar was forced to agree with the others: Zuko could not have been allowed to join the group. However, Zuko later defended the group from ${link_2} and gave them enough time to defeat him. He subsequently apologized to Toph for burning her, claiming it was an accident and that he needs to control his bending so he did not hurt people unintentionally. After remembering when he first tried learning firebending and accidently burned Katara's hands, Aang accepted Zuko as his ${link_3}.",
      "links": [
        {
          "body": "Day of Black Sun",
          "key": "${link_0}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "Pohuai Stronghold",
          "key": "${link_1}",
          "target": {
            "href": "Pohuai_Stronghold",
            "page": "Pohuai_Stronghold"
          }
        },
        {
          "body": "Combustion Man",
          "key": "${link_2}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        },
        {
          "body": "firebending teacher",
          "key": "${link_3}",
          "target": {
            "href": "Firebending_training",
            "page": "Firebending_training"
          }
        }
      ],
      "text": "Zuko's mother Ursa was in fact Avatar Roku's descendant, consequently, Aang was the reincarnation of one of Zuko's maternal great-grandfather, making the Avatar and the Fire Prince spiritual relatives. After confronting his father on the Day of Black Sun, Zuko defected from the Fire Nation in order to join Team Avatar. Aang, who was not comfortable with any sort of responsibility at the moment, watched for cues among the rest of the team as to how to respond; when Katara, who had been hurt by him in the catacombs, reacted negatively, the Avatar did likewise. Afterward, he revealed how Zuko had rescued him at Pohuai Stronghold; Aang himself believed that Zuko had some good in him, but when the firebender burned Toph's feet, the Avatar was forced to agree with the others: Zuko could not have been allowed to join the group. However, Zuko later defended the group from Combustion Man and gave them enough time to defeat him. He subsequently apologized to Toph for burning her, claiming it was an accident and that he needs to control his bending so he did not hurt people unintentionally. After remembering when he first tried learning firebending and accidently burned Katara's hands, Aang accepted Zuko as his firebending teacher."
    },
    {
      "body": "${link_0} and ${link_1} later became friends and allies.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Aang and Zuko later became friends and allies."
    },
    {
      "body": "With the Avatar's capture no longer driving him, Zuko appeared to have lost the ability to firebend and so he and Aang traveled to the ${link_0} in the hopes of finding something that would restore Zuko's bending. Here, they met the ${link_1}, whose ${link_2} decided that they would be judged by the masters, ${link_3}, who turned out to be ${link_4}. After Aang and Zuko worked together to perform the ${link_5}, Ran and Shaw deemed them worthy and they were shown the true meaning of firebending as life itself. Despite Zuko's past misdeeds, Aang seemed to have developed a fair degree of respect and admiration for him, even giving him the nickname \"Sifu Hotman\", much to the prince's annoyance.",
      "links": [
        {
          "body": "Sun Warrior ruins",
          "key": "${link_0}",
          "target": {
            "href": "Sun_Warriors%27_ancient_city",
            "page": "Sun_Warriors%27_ancient_city"
          }
        },
        {
          "body": "Sun Warriors",
          "key": "${link_1}",
          "target": {
            "href": "Sun_Warriors",
            "page": "Sun_Warriors"
          }
        },
        {
          "body": "chief",
          "key": "${link_2}",
          "target": {
            "href": "Sun_Warrior_chief",
            "page": "Sun_Warrior_chief"
          }
        },
        {
          "body": "Ran and Shaw",
          "key": "${link_3}",
          "target": {
            "href": "Ran_and_Shaw",
            "page": "Ran_and_Shaw"
          }
        },
        {
          "body": "dragons",
          "key": "${link_4}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        },
        {
          "body": "Dancing Dragon",
          "key": "${link_5}",
          "target": {
            "href": "Dancing_Dragon",
            "page": "Dancing_Dragon"
          }
        }
      ],
      "text": "With the Avatar's capture no longer driving him, Zuko appeared to have lost the ability to firebend and so he and Aang traveled to the Sun Warrior ruins in the hopes of finding something that would restore Zuko's bending. Here, they met the Sun Warriors, whose chief decided that they would be judged by the masters, Ran and Shaw, who turned out to be dragons. After Aang and Zuko worked together to perform the Dancing Dragon, Ran and Shaw deemed them worthy and they were shown the true meaning of firebending as life itself. Despite Zuko's past misdeeds, Aang seemed to have developed a fair degree of respect and admiration for him, even giving him the nickname \"Sifu Hotman\", much to the prince's annoyance."
    },
    {
      "body": "Three days prior to the arrival of Sozin's Comet, Zuko berated Aang for his failure to focus on his firebending training. When the Avatar decided have a beach party with all his friends, excluding Zuko on Ember Island, the former Fire Prince attacked him in a brazen attempt to force Aang to understand that he had to defeat Fire Lord Ozai before the comet arrived. When Zuko told the group of Ozai's malicious plot to raze the Earth Kingdom to the ground, the young Avatar finally realized the severity of his inevitable task. Zuko proceeded to train Aang in the art of lightning redirection for protection against Ozai, and he explained the danger of redirecting from his own experience against his father. As the monk understood that there would be no \"spirit water action\" if something went wrong, his firebending teacher bluntly stated, \"You'll have to take the Fire Lord's life before he takes yours.\" Several hours later, Aang, still undecided, contemplated whether he should take Ozai's life or not, as the monks taught him to value all life, and when Zuko and the rest of the team declared that it had to be done, the Avatar became frustrated and enraged, and he left to meditate on the decision. The next day, Aang disappeared without a trace, even from the bounty hunter ${link_0} and her ${link_1}, ${link_2}.",
      "links": [
        {
          "body": "June",
          "key": "${link_0}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "shirshu",
          "key": "${link_1}",
          "target": {
            "href": "Shirshu",
            "page": "Shirshu"
          }
        },
        {
          "body": "Nyla",
          "key": "${link_2}",
          "target": {
            "href": "Nyla",
            "page": "Nyla"
          }
        }
      ],
      "text": "Three days prior to the arrival of Sozin's Comet, Zuko berated Aang for his failure to focus on his firebending training. When the Avatar decided have a beach party with all his friends, excluding Zuko on Ember Island, the former Fire Prince attacked him in a brazen attempt to force Aang to understand that he had to defeat Fire Lord Ozai before the comet arrived. When Zuko told the group of Ozai's malicious plot to raze the Earth Kingdom to the ground, the young Avatar finally realized the severity of his inevitable task. Zuko proceeded to train Aang in the art of lightning redirection for protection against Ozai, and he explained the danger of redirecting from his own experience against his father. As the monk understood that there would be no \"spirit water action\" if something went wrong, his firebending teacher bluntly stated, \"You'll have to take the Fire Lord's life before he takes yours.\" Several hours later, Aang, still undecided, contemplated whether he should take Ozai's life or not, as the monks taught him to value all life, and when Zuko and the rest of the team declared that it had to be done, the Avatar became frustrated and enraged, and he left to meditate on the decision. The next day, Aang disappeared without a trace, even from the bounty hunter June and her shirshu, Nyla."
    },
    {
      "body": "After being called away onto a mysterious island, Aang ended up on the back of a lion turtle and was taught a new ability, energybending, which he used to triumph over Ozai by stripping the Phoenix King of his bending. With this victory, as well as Zuko and Katara's victory over Azula, Zuko became the new Fire Lord, and he swore that he and Aang would work together to restore peace and unity to the war-torn nations. The Avatar and the Fire Lord embraced each other in a warm hug, affirming their deep friendship.",
      "links": [],
      "text": "After being called away onto a mysterious island, Aang ended up on the back of a lion turtle and was taught a new ability, energybending, which he used to triumph over Ozai by stripping the Phoenix King of his bending. With this victory, as well as Zuko and Katara's victory over Azula, Zuko became the new Fire Lord, and he swore that he and Aang would work together to restore peace and unity to the war-torn nations. The Avatar and the Fire Lord embraced each other in a warm hug, affirming their deep friendship."
    },
    {
      "body": "As the ${link_0} was kicked off, and the team was flying on board Appa, Zuko asked Aang to promise that if the former ever became like his father, he would kill him, to which Aang reluctantly agreed.",
      "links": [
        {
          "body": "Harmony Restoration Movement",
          "key": "${link_0}",
          "target": {
            "href": "Harmony_Restoration_Movement",
            "page": "Harmony_Restoration_Movement"
          }
        }
      ],
      "text": "As the Harmony Restoration Movement was kicked off, and the team was flying on board Appa, Zuko asked Aang to promise that if the former ever became like his father, he would kill him, to which Aang reluctantly agreed."
    },
    {
      "body": "A year later, Aang and Zuko's friendship became strained after the Fire Nation pulled out of the Harmony Restoration Movement. When Aang and Katara arrived to see that ${link_0} was locked down and that the Fire Nation guards would not allow them to Zuko, Aang was attacked, but Katara attacked back. Zuko restrained Katara, to which Aang reacted by attacking the Fire Lord and even engaging the Avatar State, until Katara pulled him out.",
      "links": [
        {
          "body": "Yu Dao",
          "key": "${link_0}",
          "target": {
            "href": "Yu_Dao",
            "page": "Yu_Dao"
          }
        }
      ],
      "text": "A year later, Aang and Zuko's friendship became strained after the Fire Nation pulled out of the Harmony Restoration Movement. When Aang and Katara arrived to see that Yu Dao was locked down and that the Fire Nation guards would not allow them to Zuko, Aang was attacked, but Katara attacked back. Zuko restrained Katara, to which Aang reacted by attacking the Fire Lord and even engaging the Avatar State, until Katara pulled him out."
    },
    {
      "body": "Zuko and Aang fell into a verbal altercation as they explored Yu Dao, with Zuko arguing that he would not allow Aang to destroy all the Fire Nation had built up in all the colonies, Yu Dao included. Aang argued that harmony required four separate nations, with peace being impossible if one nation occupied another. The verbal sparring ended when Katara suggested a meeting with the ${link_0}, to which the two agreed.",
      "links": [
        {
          "body": "Earth King",
          "key": "${link_0}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "Zuko and Aang fell into a verbal altercation as they explored Yu Dao, with Zuko arguing that he would not allow Aang to destroy all the Fire Nation had built up in all the colonies, Yu Dao included. Aang argued that harmony required four separate nations, with peace being impossible if one nation occupied another. The verbal sparring ended when Katara suggested a meeting with the Earth King, to which the two agreed."
    },
    {
      "body": "Prior to the battle in Yu Dao, the two had a similar dream where they stood over the battle scene, Ozai's spirit behind the Fire Lord and Roku's behind the Avatar. Zuko believed he was \"lost\" and told Aang to finish him. Aang went into the Avatar State and attempted to carry out his promise before Ursa appeared to Zuko. He quickly tried to tell Aang to stop before each of them awoke in a state of panic.",
      "links": [],
      "text": "Prior to the battle in Yu Dao, the two had a similar dream where they stood over the battle scene, Ozai's spirit behind the Fire Lord and Roku's behind the Avatar. Zuko believed he was \"lost\" and told Aang to finish him. Aang went into the Avatar State and attempted to carry out his promise before Ursa appeared to Zuko. He quickly tried to tell Aang to stop before each of them awoke in a state of panic."
    },
    {
      "body": "The two encountered on the battlefield, and seeing the Fire Nation troops charge toward Yu Dao, Aang engaged the Avatar State, intent on finishing the Fire Lord, but Katara pulled the Avatar away in an attempt to calm him. Aang meditated away from the battlefield at his girlfriend's urging, and, in talking to Roku, was shocked to learn that Zuko was the old Avatar's great-grandson. Aang returned to the battlefield in the Avatar State, opening up a fissure in the ground below which Zuko fell into. However, Aang saved his friend from his death, only for him to collapse a short time after.",
      "links": [],
      "text": "The two encountered on the battlefield, and seeing the Fire Nation troops charge toward Yu Dao, Aang engaged the Avatar State, intent on finishing the Fire Lord, but Katara pulled the Avatar away in an attempt to calm him. Aang meditated away from the battlefield at his girlfriend's urging, and, in talking to Roku, was shocked to learn that Zuko was the old Avatar's great-grandson. Aang returned to the battlefield in the Avatar State, opening up a fissure in the ground below which Zuko fell into. However, Aang saved his friend from his death, only for him to collapse a short time after."
    },
    {
      "body": "Aang traveled to Ba Sing Se with Zuko in tow, taking him to the Jasmine Dragon and the care of Iroh. Four days later, the Fire Lord awoke, and the two young men spoke in the tea shop. Aang informed Zuko that Kuei agreed to talk about the still-precarious situation over Yu Dao. The two also talked about their simultaneous dream. Zuko apologized to Aang, explaining that his promise was wrong by saying he was making Aang an \"escape hatch\" instead of a \"safety net\", and that as Fire Lord, there is no escape. Aang replied by saying Zuko never gave himself enough credit, and that he was right about the colony in the end. After learning of their spiritual relation, Aang began to view Zuko as family and told the Fire Lord as such, adding that he could not detach himself from those bonds, a flaw he would accept \"in this life\". Zuko finished the conversation by explaining he saw his mother during the dream and would attempt to find her in an attempt to clear up his murky bloodline. Aang encouraged him, saying it was a new world, and that they all needed to take new risks. Zuko and Aang grew to be lifelong, best friends, and Aang regularly looked to Zuko for advice. Zuko, in turn, would always trust the Avatar's instinct.",
      "links": [],
      "text": "Aang traveled to Ba Sing Se with Zuko in tow, taking him to the Jasmine Dragon and the care of Iroh. Four days later, the Fire Lord awoke, and the two young men spoke in the tea shop. Aang informed Zuko that Kuei agreed to talk about the still-precarious situation over Yu Dao. The two also talked about their simultaneous dream. Zuko apologized to Aang, explaining that his promise was wrong by saying he was making Aang an \"escape hatch\" instead of a \"safety net\", and that as Fire Lord, there is no escape. Aang replied by saying Zuko never gave himself enough credit, and that he was right about the colony in the end. After learning of their spiritual relation, Aang began to view Zuko as family and told the Fire Lord as such, adding that he could not detach himself from those bonds, a flaw he would accept \"in this life\". Zuko finished the conversation by explaining he saw his mother during the dream and would attempt to find her in an attempt to clear up his murky bloodline. Aang encouraged him, saying it was a new world, and that they all needed to take new risks. Zuko and Aang grew to be lifelong, best friends, and Aang regularly looked to Zuko for advice. Zuko, in turn, would always trust the Avatar's instinct."
    },
    {
      "body": "Being the Avatar did not mean smooth sailing at all times. Throughout his travels, Aang made many enemies from both the Fire Nation and the Earth Kingdom. The most notable of these were Prince Zuko (formerly), General Iroh (formerly), Admiral Zhao, Fire Lord Ozai, Princess Azula, ${link_0}, and Combustion Man.",
      "links": [
        {
          "body": "Long Feng",
          "key": "${link_0}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        }
      ],
      "text": "Being the Avatar did not mean smooth sailing at all times. Throughout his travels, Aang made many enemies from both the Fire Nation and the Earth Kingdom. The most notable of these were Prince Zuko (formerly), General Iroh (formerly), Admiral Zhao, Fire Lord Ozai, Princess Azula, Long Feng, and Combustion Man."
    },
    {
      "body": "${link_0} was also targeted by ${link_1} ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Princess",
          "key": "${link_1}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Azula",
          "key": "${link_2}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Aang was also targeted by Princess Azula."
    },
    {
      "body": "Azula was Zuko's younger sister, a princess of the Fire Nation, and the heir to the throne, considering Zuko's status as an exile and a traitor. Cruel, ruthless, and cunning, this firebending prodigy, having mastered firebending in her youth, was a formidable opponent for Aang.",
      "links": [],
      "text": "Azula was Zuko's younger sister, a princess of the Fire Nation, and the heir to the throne, considering Zuko's status as an exile and a traitor. Cruel, ruthless, and cunning, this firebending prodigy, having mastered firebending in her youth, was a formidable opponent for Aang."
    },
    {
      "body": "After Zhao's failure, Azula had taken over the Fire Nation's attempts to capture the Avatar. He first met her in ${link_0} during his attempts to rescue King Bumi. After a chase along the delivery chutes across the city, Aang managed to escape with Bumi's help, though the latter allowed himself to be recaptured.",
      "links": [
        {
          "body": "New Ozai",
          "key": "${link_0}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        }
      ],
      "text": "After Zhao's failure, Azula had taken over the Fire Nation's attempts to capture the Avatar. He first met her in New Ozai during his attempts to rescue King Bumi. After a chase along the delivery chutes across the city, Aang managed to escape with Bumi's help, though the latter allowed himself to be recaptured."
    },
    {
      "body": "The two met again when Azula and her allies, following the trail of Appa's shed fur, relentlessly pursued the group. While Mai and Ty Lee tracked Sokka and Katara, the Avatar and the Fire Princess confronted each other in a small Earth Kingdom town. As they prepared to face off, Zuko arrived, and though both Aang and the exiled prince attempted to fight Azula, the firebending prodigy was more than able to handle the three-way duel; indeed, she would have emerged victorious had it not been for Sokka, Katara, Iroh, and Toph arriving to help.",
      "links": [],
      "text": "The two met again when Azula and her allies, following the trail of Appa's shed fur, relentlessly pursued the group. While Mai and Ty Lee tracked Sokka and Katara, the Avatar and the Fire Princess confronted each other in a small Earth Kingdom town. As they prepared to face off, Zuko arrived, and though both Aang and the exiled prince attempted to fight Azula, the firebending prodigy was more than able to handle the three-way duel; indeed, she would have emerged victorious had it not been for Sokka, Katara, Iroh, and Toph arriving to help."
    },
    {
      "body": "Following the Avatar's arrival to Ba Sing Se, Aang discovered a massive ${link_0} attempting to breach the Outer Wall of the city. Upon realizing that efforts to damage the machine from inside would be futile, he took to the top; however, Azula attacked him in an attempt to protect mechanical weapon. Though Aang was better able to fight the princess due to his new knowledge of earthbending, they were still evenly matched until he managed to destroy the drill.",
      "links": [
        {
          "body": "Fire Nation drill",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        }
      ],
      "text": "Following the Avatar's arrival to Ba Sing Se, Aang discovered a massive Fire Nation drill attempting to breach the Outer Wall of the city. Upon realizing that efforts to damage the machine from inside would be futile, he took to the top; however, Azula attacked him in an attempt to protect mechanical weapon. Though Aang was better able to fight the princess due to his new knowledge of earthbending, they were still evenly matched until he managed to destroy the drill."
    },
    {
      "body": "Aang, with Katara's help, faced off against Azula once more in the crystal catacombs and was gaining the upper hand when Zuko, who was struggling with his inner self, joined the fray.",
      "links": [],
      "text": "Aang, with Katara's help, faced off against Azula once more in the crystal catacombs and was gaining the upper hand when Zuko, who was struggling with his inner self, joined the fray."
    },
    {
      "body": "The arrival of corrupted Dai Li forced Aang to attempt to abandon Katara and open his seventh chakra in order to enter a fully mastered Avatar State. However, just he was about to do so, he was struck in the back by a lightning blast from Azula and fell to the ground, defeated.",
      "links": [],
      "text": "The arrival of corrupted Dai Li forced Aang to attempt to abandon Katara and open his seventh chakra in order to enter a fully mastered Avatar State. However, just he was about to do so, he was struck in the back by a lightning blast from Azula and fell to the ground, defeated."
    },
    {
      "body": "Following Aang's defeat at Ba Sing Se, Azula, along with the rest of the world, assumed that he was dead and the Hundred Year War effectively won. However, when she asked Zuko in regards to the monk's chances of survival, he unintentionally gave her the suspicion that the Avatar might have survived. In order to avoid dishonoring her father, Ozai, the firebending prodigy informed the Fire Lord that Zuko had slain the Avatar, leaving her brother to face punishment should Aang return.",
      "links": [],
      "text": "Following Aang's defeat at Ba Sing Se, Azula, along with the rest of the world, assumed that he was dead and the Hundred Year War effectively won. However, when she asked Zuko in regards to the monk's chances of survival, he unintentionally gave her the suspicion that the Avatar might have survived. In order to avoid dishonoring her father, Ozai, the firebending prodigy informed the Fire Lord that Zuko had slain the Avatar, leaving her brother to face punishment should Aang return."
    },
    {
      "body": "During the invasion, Aang, along with Sokka and Toph, infiltrated a secret Fire Nation bunker; the Avatar planned to defeat the Fire Lord, who would be powerless due to the eclipse. As the Fire Princess had learned of the invasion while masquerading as a Kyoshi Warrior in Ba Sing Se, she was prepared for the team and lay in wait in what was normally the Fire Lord's secret chamber; after the Avatar burst into the room, she deployed a pair of Dai Li agents and proceeded to attempt to escape in order to distract him and his friends from reaching Ozai before the end of the eclipse. Though her agents were defeated, the firebending prodigy continued to torment them even while shackled to the wall; the group realized what she was doing and tried to ignore her diversions until Azula provoked Sokka by informing him that Suki was her prisoner. Though Aang attempted to convince Sokka to cease the fruitless interrogation, the warrior's anger was unquenchable, and the Fire Princess was able to keep the group from successfully finding Ozai until the eclipse ended, at which point she easily escaped. Following the subsequent defeat of the invasion force, Aang and the other children, leaving behind the bulk of their friends and family, left on Appa. As she knew he would return, and because the airships moved more slowly than a sky bison, Azula chose not to pursue them.",
      "links": [],
      "text": "During the invasion, Aang, along with Sokka and Toph, infiltrated a secret Fire Nation bunker; the Avatar planned to defeat the Fire Lord, who would be powerless due to the eclipse. As the Fire Princess had learned of the invasion while masquerading as a Kyoshi Warrior in Ba Sing Se, she was prepared for the team and lay in wait in what was normally the Fire Lord's secret chamber; after the Avatar burst into the room, she deployed a pair of Dai Li agents and proceeded to attempt to escape in order to distract him and his friends from reaching Ozai before the end of the eclipse. Though her agents were defeated, the firebending prodigy continued to torment them even while shackled to the wall; the group realized what she was doing and tried to ignore her diversions until Azula provoked Sokka by informing him that Suki was her prisoner. Though Aang attempted to convince Sokka to cease the fruitless interrogation, the warrior's anger was unquenchable, and the Fire Princess was able to keep the group from successfully finding Ozai until the eclipse ended, at which point she easily escaped. Following the subsequent defeat of the invasion force, Aang and the other children, leaving behind the bulk of their friends and family, left on Appa. As she knew he would return, and because the airships moved more slowly than a sky bison, Azula chose not to pursue them."
    },
    {
      "body": "Azula's final encounter with Aang occurred at the ${link_0} when she tried to destroy the sacred Air Nomad structure and the group with a fleet of airships, causing Team Avatar to once again become separated as some retreated on foot, while the rest fled on Appa and took shelter on a nearby cliffside.",
      "links": [
        {
          "body": "Western Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "text": "Azula's final encounter with Aang occurred at the Western Air Temple when she tried to destroy the sacred Air Nomad structure and the group with a fleet of airships, causing Team Avatar to once again become separated as some retreated on foot, while the rest fled on Appa and took shelter on a nearby cliffside."
    },
    {
      "body": "Though Aang never faced Azula in direct combat again, the firebending prodigy later lost her sanity and, after being defeated by his allies, Katara and Zuko, was sent to a mental health facility.",
      "links": [],
      "text": "Though Aang never faced Azula in direct combat again, the firebending prodigy later lost her sanity and, after being defeated by his allies, Katara and Zuko, was sent to a mental health facility."
    },
    {
      "body": "Aang, being Roku's reincarnation, was Azula's spiritual great-grandfather although it was unclear if either of them was aware of this. Of all Aang's enemies, Azula was the one who came closest to taking his life, as her lightning strike killed him, until Katara was able to revive him thanks to the spirit water, and he would remain in a coma for several weeks. This also temporarily cut off his connection to his past lives and blocked the Avatar State until his battle with Ozai.",
      "links": [],
      "text": "Aang, being Roku's reincarnation, was Azula's spiritual great-grandfather although it was unclear if either of them was aware of this. Of all Aang's enemies, Azula was the one who came closest to taking his life, as her lightning strike killed him, until Katara was able to revive him thanks to the spirit water, and he would remain in a coma for several weeks. This also temporarily cut off his connection to his past lives and blocked the Avatar State until his battle with Ozai."
    },
    {
      "body": "Other than being enemies, Aang and Azula did not have much of a relationship. Azula appeared to regard Aang simply as an opponent to be destroyed and an enemy of the Fire Nation, while the Avatar was not shown to have any opinions regarding the firebending prodigy besides his obvious fear of her prowess.",
      "links": [],
      "text": "Other than being enemies, Aang and Azula did not have much of a relationship. Azula appeared to regard Aang simply as an opponent to be destroyed and an enemy of the Fire Nation, while the Avatar was not shown to have any opinions regarding the firebending prodigy besides his obvious fear of her prowess."
    },
    {
      "body": "When they met again a year after the war's conclusion and Azula's subsequent mental breakdown, Aang was still distrusting about Azula. However, he was willing to give her a chance to find inner peace and agreed to let her accompany Team Avatar on a quest to find her mother. Though he went as far to help her with her luggage, he remained alert around her and was quick to confront her when she caused any kind of trouble.",
      "links": [],
      "text": "When they met again a year after the war's conclusion and Azula's subsequent mental breakdown, Aang was still distrusting about Azula. However, he was willing to give her a chance to find inner peace and agreed to let her accompany Team Avatar on a quest to find her mother. Though he went as far to help her with her luggage, he remained alert around her and was quick to confront her when she caused any kind of trouble."
    },
    {
      "body": "${link_0} was hired to kill ${link_1}.",
      "links": [
        {
          "body": "Combustion Man",
          "key": "${link_0}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Combustion Man was hired to kill Aang."
    },
    {
      "body": "Though they rarely met, Combustion Man, formerly known as \"Sparky Sparky Boom Man\", was one of Aang's deadliest enemies due to his unique ability to superheat the air around him and shoot extremely explosive fire out of his tattooed third eye. Hired by a worried Zuko, Combustion Man never ceased his efforts to kill the Avatar. In their first meeting, he and the rest of Team Avatar was no match for him despite their mastery of bending. In their second meeting, Aang, after saving Sokka, was almost killed but was saved by Katara who froze the Combustion Man's head in an ice cylinder. Afterward, Toph bent a rock at him; the stone hit his third eye, disrupting his ability and caused it to ignite the air around him, allowing the group to escape. Their last meeting was at the Western Air Temple, where Combustion Man tried once again to kill Aang even after Zuko called off the mission, threatening not to pay the assassin and offering more money for him to stop, neither of which had any effect. Zuko managed to push Combustion Man to miss his target twice. This provoked the assassin into attacking Zuko, who managed to protect himself, though he had to grab onto a plant root not to fall down the cliff. Combustion Man was defeated after his ability was once again disrupted, this time by Sokka's well calculated boomerang throw.",
      "links": [],
      "text": "Though they rarely met, Combustion Man, formerly known as \"Sparky Sparky Boom Man\", was one of Aang's deadliest enemies due to his unique ability to superheat the air around him and shoot extremely explosive fire out of his tattooed third eye. Hired by a worried Zuko, Combustion Man never ceased his efforts to kill the Avatar. In their first meeting, he and the rest of Team Avatar was no match for him despite their mastery of bending. In their second meeting, Aang, after saving Sokka, was almost killed but was saved by Katara who froze the Combustion Man's head in an ice cylinder. Afterward, Toph bent a rock at him; the stone hit his third eye, disrupting his ability and caused it to ignite the air around him, allowing the group to escape. Their last meeting was at the Western Air Temple, where Combustion Man tried once again to kill Aang even after Zuko called off the mission, threatening not to pay the assassin and offering more money for him to stop, neither of which had any effect. Zuko managed to push Combustion Man to miss his target twice. This provoked the assassin into attacking Zuko, who managed to protect himself, though he had to grab onto a plant root not to fall down the cliff. Combustion Man was defeated after his ability was once again disrupted, this time by Sokka's well calculated boomerang throw."
    },
    {
      "body": "In the beginning of Aang and his friends' stay in Ba Sing Se, a woman named ${link_0} greeted them and explained that she would be their helper during their visit. After the gang arrived, she showed them around the city, leading them eventually to the ${link_1} in which they would be staying. During the tour, Joo Dee evaded any questions about seeing the Earth King, and when Aang attempted to glean information about Appa's possible location from different citizens of Ba Sing Se, she purposefully motioned for those interrogated not to speak a word. Later, when Team Avatar managed to infiltrate the Earth King's party, Joo Dee lost her characteristic smile as she realized her failure and was subsequently replaced with a new Joo Dee. Upon returning, she attempted to stop Aang from distributing flyers asking for Appa. Becoming angry, he stepped up and said he would do whatever he wanted. There were not many confrontations between the two, and after the group was reunited with Appa, Aang did not meet Joo Dee again.",
      "links": [
        {
          "body": "Joo Dee",
          "key": "${link_0}",
          "target": {
            "href": "Joo_Dee",
            "page": "Joo_Dee"
          }
        },
        {
          "body": "guest house",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar%27s_Upper_Ring_house",
            "page": "Team_Avatar%27s_Upper_Ring_house"
          }
        }
      ],
      "text": "In the beginning of Aang and his friends' stay in Ba Sing Se, a woman named Joo Dee greeted them and explained that she would be their helper during their visit. After the gang arrived, she showed them around the city, leading them eventually to the guest house in which they would be staying. During the tour, Joo Dee evaded any questions about seeing the Earth King, and when Aang attempted to glean information about Appa's possible location from different citizens of Ba Sing Se, she purposefully motioned for those interrogated not to speak a word. Later, when Team Avatar managed to infiltrate the Earth King's party, Joo Dee lost her characteristic smile as she realized her failure and was subsequently replaced with a new Joo Dee. Upon returning, she attempted to stop Aang from distributing flyers asking for Appa. Becoming angry, he stepped up and said he would do whatever he wanted. There were not many confrontations between the two, and after the group was reunited with Appa, Aang did not meet Joo Dee again."
    },
    {
      "body": "${link_0} sought to expose ${link_1}'s ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_1}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        },
        {
          "body": "conspiracy",
          "key": "${link_2}",
          "target": {
            "href": "Conspiracy_of_Ba_Sing_Se",
            "page": "Conspiracy_of_Ba_Sing_Se"
          }
        }
      ],
      "text": "Aang sought to expose Long Feng's conspiracy."
    },
    {
      "body": "Long Feng was quite possibly one of Aang's most hated foes, as he blackmailed the Avatar with a kidnapped Appa, murdered Jet, and almost framed Team Avatar as enemies of the Earth Kingdom.",
      "links": [],
      "text": "Long Feng was quite possibly one of Aang's most hated foes, as he blackmailed the Avatar with a kidnapped Appa, murdered Jet, and almost framed Team Avatar as enemies of the Earth Kingdom."
    },
    {
      "body": "Before even meeting with the members of the group, Long Feng assigned Joo Dee as their tour guide, and she worked diligently to ensure that their attempts to find Appa and meet the Earth King were fruitless.",
      "links": [],
      "text": "Before even meeting with the members of the group, Long Feng assigned Joo Dee as their tour guide, and she worked diligently to ensure that their attempts to find Appa and meet the Earth King were fruitless."
    },
    {
      "body": "Long Feng was first introduced when Katara and Toph attempted to crash a party the Earth King was attending in order to sneak Aang in and allow the Avatar to speak with the king about the coming solar eclipse. When the door guards refused to let them in due to the facts that the two did not have tickets - only Toph's ${link_0} - Katara and Toph, using false names, unwittingly asked the ${link_1} for help in \"finding their parents\".",
      "links": [
        {
          "body": "family document",
          "key": "${link_0}",
          "target": {
            "href": "Toph%27s_passport",
            "page": "Toph%27s_passport"
          }
        },
        {
          "body": "Grand Secretariat",
          "key": "${link_1}",
          "target": {
            "href": "Grand_Secretariat_of_Ba_Sing_Se",
            "page": "Grand_Secretariat_of_Ba_Sing_Se"
          }
        }
      ],
      "text": "Long Feng was first introduced when Katara and Toph attempted to crash a party the Earth King was attending in order to sneak Aang in and allow the Avatar to speak with the king about the coming solar eclipse. When the door guards refused to let them in due to the facts that the two did not have tickets - only Toph's family document - Katara and Toph, using false names, unwittingly asked the Grand Secretariat for help in \"finding their parents\"."
    },
    {
      "body": "Seeing through the disguise, Long Feng subsequently managed to secure all four children, before Team Avatar was able to exchange word with the Earth King. After taking them to his private study, he proceeded to inform them that the Earth King was almost entirely powerless in Ba Sing Se; it was Long Feng, head of the Dai Li agents, who had control over the city. One was not allowed to mention the Hundred Year War within the walls, as Ba Sing Se was striving to stay out of the War, and Long Feng was convinced the city would be able to defend against any attack. Upon realizing the Earth King was little more than Long Feng's \"puppet\", Aang threatened to publicly tell the king, along with the citizens of Ba Sing Se, about the Dai Li conspiracy and the War.",
      "links": [],
      "text": "Seeing through the disguise, Long Feng subsequently managed to secure all four children, before Team Avatar was able to exchange word with the Earth King. After taking them to his private study, he proceeded to inform them that the Earth King was almost entirely powerless in Ba Sing Se; it was Long Feng, head of the Dai Li agents, who had control over the city. One was not allowed to mention the Hundred Year War within the walls, as Ba Sing Se was striving to stay out of the War, and Long Feng was convinced the city would be able to defend against any attack. Upon realizing the Earth King was little more than Long Feng's \"puppet\", Aang threatened to publicly tell the king, along with the citizens of Ba Sing Se, about the Dai Li conspiracy and the War."
    },
    {
      "body": "Long Feng responded in kind, saying, \"I understand you've been looking for your bison. It would be quite a shame if you were not able to complete your quest.\" Understanding that the Grand Secretariat did, indeed, had Appa in custody, Aang became enraged.",
      "links": [],
      "text": "Long Feng responded in kind, saying, \"I understand you've been looking for your bison. It would be quite a shame if you were not able to complete your quest.\" Understanding that the Grand Secretariat did, indeed, had Appa in custody, Aang became enraged."
    },
    {
      "body": "After meeting Jet under suspicious circumstances - circumstances orchestrated by Long Feng himself in an attempt to trick Aang into leaving Ba Sing Se - as well as ${link_0} and ${link_1}, Team Avatar realized something sinister was occurring and that Jet had been ${link_2}. Upon the restoration of his memory, Jet led the team to the Dai Li headquarters under Lake Laogai, where the group discovered with the full extent of the conspiracy, which included the brainwashing of girls to become Joo Dees. Inside the underground bunker, Aang, along with Jet, again confronted Long Feng; the Grand Secretariat, having brainwashed Jet, said the trigger phrase and forced the former ${link_3} to attack the Avatar.",
      "links": [
        {
          "body": "Smellerbee",
          "key": "${link_0}",
          "target": {
            "href": "Smellerbee",
            "page": "Smellerbee"
          }
        },
        {
          "body": "Longshot",
          "key": "${link_1}",
          "target": {
            "href": "Longshot",
            "page": "Longshot"
          }
        },
        {
          "body": "brainwashed",
          "key": "${link_2}",
          "target": {
            "href": "Brainwashing",
            "page": "Brainwashing"
          }
        },
        {
          "body": "Freedom Fighter",
          "key": "${link_3}",
          "target": {
            "href": "Freedom_Fighters",
            "page": "Freedom_Fighters"
          }
        }
      ],
      "text": "After meeting Jet under suspicious circumstances - circumstances orchestrated by Long Feng himself in an attempt to trick Aang into leaving Ba Sing Se - as well as Smellerbee and Longshot, Team Avatar realized something sinister was occurring and that Jet had been brainwashed. Upon the restoration of his memory, Jet led the team to the Dai Li headquarters under Lake Laogai, where the group discovered with the full extent of the conspiracy, which included the brainwashing of girls to become Joo Dees. Inside the underground bunker, Aang, along with Jet, again confronted Long Feng; the Grand Secretariat, having brainwashed Jet, said the trigger phrase and forced the former Freedom Fighter to attack the Avatar."
    },
    {
      "body": "Aang managed to break Jet's trance and allow the former ${link_0} to regain control, but Long Feng used earthbending to eliminate him. Because the Avatar refused to leave his fallen friend, Long Feng was able to escape. Leaving Jet in the care of Smellerbee and Longshot, Team Avatar ventured outside of the bunker and reunited with Appa. With the sky bison's help, the group was able to overcome the Dai Li agents; in the process, Appa bit Long Feng's lower leg.",
      "links": [
        {
          "body": "Freedom Fighter",
          "key": "${link_0}",
          "target": {
            "href": "Freedom_Fighters",
            "page": "Freedom_Fighters"
          }
        }
      ],
      "text": "Aang managed to break Jet's trance and allow the former Freedom Fighter to regain control, but Long Feng used earthbending to eliminate him. Because the Avatar refused to leave his fallen friend, Long Feng was able to escape. Leaving Jet in the care of Smellerbee and Longshot, Team Avatar ventured outside of the bunker and reunited with Appa. With the sky bison's help, the group was able to overcome the Dai Li agents; in the process, Appa bit Long Feng's lower leg."
    },
    {
      "body": "Team Avatar stormed the ${link_0} and, using the bite mark on Long Feng's leg as a prove, was able to convince Earth King ${link_1} to inspect Lake Laogai.",
      "links": [
        {
          "body": "Earth King's palace",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        },
        {
          "body": "Kuei",
          "key": "${link_1}",
          "target": {
            "href": "Kuei",
            "page": "Kuei"
          }
        }
      ],
      "text": "Team Avatar stormed the Earth King's palace and, using the bite mark on Long Feng's leg as a prove, was able to convince Earth King Kuei to inspect Lake Laogai."
    },
    {
      "body": "After a failed attempt to show them the underground headquarters, which had been destroyed by the Dai Li themselves, the Earth King was convinced of Long Feng's treachery by seeing the drill outside of the Outer Wall. Long Feng was arrested and placed into prison, but the Dai Li remained loyal to him.",
      "links": [],
      "text": "After a failed attempt to show them the underground headquarters, which had been destroyed by the Dai Li themselves, the Earth King was convinced of Long Feng's treachery by seeing the drill outside of the Outer Wall. Long Feng was arrested and placed into prison, but the Dai Li remained loyal to him."
    },
    {
      "body": "${link_0} was able to ${link_1} ${link_2} ${link_3}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "energybend",
          "key": "${link_1}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_3}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Aang was able to energybend Fire Lord Ozai."
    },
    {
      "body": "The ruthless leader of the Fire Nation, Ozai, was Aang's greatest foe. It was on his orders that Zuko scoured the world in hopes of finding and capturing the Avatar. In order to stop the Fire Nation and save the world, Aang had to face and defeat Ozai before Sozin's Comet, which would enhance all firebending, arrived at the end of summer. To that end, Aang trained throughout his journey to master the four elements so that he would be able to defeat him.",
      "links": [],
      "text": "The ruthless leader of the Fire Nation, Ozai, was Aang's greatest foe. It was on his orders that Zuko scoured the world in hopes of finding and capturing the Avatar. In order to stop the Fire Nation and save the world, Aang had to face and defeat Ozai before Sozin's Comet, which would enhance all firebending, arrived at the end of summer. To that end, Aang trained throughout his journey to master the four elements so that he would be able to defeat him."
    },
    {
      "body": "When Aang meditated on his fears in order to open his earth chakra, he saw a vision of the Fire Lord shrouded in flames, representing his greatest fear in that moment.",
      "links": [],
      "text": "When Aang meditated on his fears in order to open his earth chakra, he saw a vision of the Fire Lord shrouded in flames, representing his greatest fear in that moment."
    },
    {
      "body": "During the days prior to Sozin's Comet, Aang found himself unwilling to kill Ozai. Aang insisted that he had no reason to defend Ozai, but that as an Air Nomad he had been taught that all life was precious and therefore had to be respected. Aang, in a meditative trance, was attracted to an island, where he confronted this personal conflict and asked the previous Avatars for guidance; however, he became increasingly desperate when each past life told him that, as the Avatar, he would have to resort to extreme measures to protect the world, and he reluctantly agreed to kill Ozai. Shortly after coming to this decision, Aang realized that the island was moving and that it was an animal of some kind; the wise lion turtle informed the young Avatar of an ancient though forgotten art which could be used to defeat Ozai, and Aang regained confidence in his ability to defeat the Fire Lord without taking his life.",
      "links": [],
      "text": "During the days prior to Sozin's Comet, Aang found himself unwilling to kill Ozai. Aang insisted that he had no reason to defend Ozai, but that as an Air Nomad he had been taught that all life was precious and therefore had to be respected. Aang, in a meditative trance, was attracted to an island, where he confronted this personal conflict and asked the previous Avatars for guidance; however, he became increasingly desperate when each past life told him that, as the Avatar, he would have to resort to extreme measures to protect the world, and he reluctantly agreed to kill Ozai. Shortly after coming to this decision, Aang realized that the island was moving and that it was an animal of some kind; the wise lion turtle informed the young Avatar of an ancient though forgotten art which could be used to defeat Ozai, and Aang regained confidence in his ability to defeat the Fire Lord without taking his life."
    },
    {
      "body": "When Ozai and his fleet of airships arrived to burn down the Earth Kingdom, Aang damaged the Fire Lord's personal ship and caused him to recognize the Avatar's presence. Ozai immediately went on the offensive, and though Aang used a combination of all four elements in the ensuing battle, the Fire Lord proved to be a formidable opponent with his enhanced firebending and fighting prowess. During this fight, Aang was able to redirect lighting that Ozai had generated, but the monk chose not to redirect it at the Fire Lord in order to take his life but rather to shoot it harmlessly into the sky. Eventually, Ozai gained the upper hand due to Aang's reluctance toward killing him, and Aang, badly injured, protected himself from further attack within a ball of rock. The Phoenix King continually assaulted the Avatar with flame while Aang attempted to maintain his shield, but the stone sphere finally gave way, and the Avatar slammed into a pillar of rock, inadvertently allowing him to enter the Avatar State. Due to the sheer power of the Avatar State, the Phoenix King was forced on the defensive, and, after a terrible battle, Aang managed to overpower him and pin him down with earthbending. The Avatar State, as well as the past lives controlling him, was intent on taking his life, but Aang managed to regain control and stop at the last minute.",
      "links": [],
      "text": "When Ozai and his fleet of airships arrived to burn down the Earth Kingdom, Aang damaged the Fire Lord's personal ship and caused him to recognize the Avatar's presence. Ozai immediately went on the offensive, and though Aang used a combination of all four elements in the ensuing battle, the Fire Lord proved to be a formidable opponent with his enhanced firebending and fighting prowess. During this fight, Aang was able to redirect lighting that Ozai had generated, but the monk chose not to redirect it at the Fire Lord in order to take his life but rather to shoot it harmlessly into the sky. Eventually, Ozai gained the upper hand due to Aang's reluctance toward killing him, and Aang, badly injured, protected himself from further attack within a ball of rock. The Phoenix King continually assaulted the Avatar with flame while Aang attempted to maintain his shield, but the stone sphere finally gave way, and the Avatar slammed into a pillar of rock, inadvertently allowing him to enter the Avatar State. Due to the sheer power of the Avatar State, the Phoenix King was forced on the defensive, and, after a terrible battle, Aang managed to overpower him and pin him down with earthbending. The Avatar State, as well as the past lives controlling him, was intent on taking his life, but Aang managed to regain control and stop at the last minute."
    },
    {
      "body": "Aang refused to take Ozai's life, stating, \"I'm not going to end it like this.\" When the Avatar's back was turned, Ozai attempted to attack again, but Aang used Toph's technique of seismic sense to sense the Phoenix King's movements and restrained him using earthbending. Remembering what the lion turtle had told him, Aang used energybending to strip Ozai of his firebending, thus sparing his life but rendering him totally powerless. Weak and dazed, Ozai found himself unable to even stand and fell limply to the ground. In the process, it was revealed that Aang had become a fully realized Avatar.",
      "links": [],
      "text": "Aang refused to take Ozai's life, stating, \"I'm not going to end it like this.\" When the Avatar's back was turned, Ozai attempted to attack again, but Aang used Toph's technique of seismic sense to sense the Phoenix King's movements and restrained him using earthbending. Remembering what the lion turtle had told him, Aang used energybending to strip Ozai of his firebending, thus sparing his life but rendering him totally powerless. Weak and dazed, Ozai found himself unable to even stand and fell limply to the ground. In the process, it was revealed that Aang had become a fully realized Avatar."
    },
    {
      "body": "Ozai was later imprisoned for war crimes, and his son Zuko took over as Fire Lord. Avatar Aang had finally fulfilled his destiny to save the world from the treacherous Fire Lord.",
      "links": [],
      "text": "Ozai was later imprisoned for war crimes, and his son Zuko took over as Fire Lord. Avatar Aang had finally fulfilled his destiny to save the world from the treacherous Fire Lord."
    },
    {
      "body": "Aang and Ozai never truly knew each other, as they only met once, but the former Fire Lord seemed to have nothing but disdain for the Avatar, while Aang himself simply regarded him as \"a horrible person\" without whom the world would probably be better off. This however, did not prevent him from sparing Ozai's life, though he did so for his beliefs, not for the Fire Lord.",
      "links": [],
      "text": "Aang and Ozai never truly knew each other, as they only met once, but the former Fire Lord seemed to have nothing but disdain for the Avatar, while Aang himself simply regarded him as \"a horrible person\" without whom the world would probably be better off. This however, did not prevent him from sparing Ozai's life, though he did so for his beliefs, not for the Fire Lord."
    },
    {
      "body": "${link_0} ${link_1} ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "energybent",
          "key": "${link_1}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        },
        {
          "body": "Yakone",
          "key": "${link_2}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        }
      ],
      "text": "Aang energybent Yakone."
    },
    {
      "body": "Aang first encountered Yakone in Republic City in 128 ${link_0}. He met with Chief Toph Beifong and other members of the ${link_1} to arrest Yakone after learning from witnesses that he had used bloodbending to commit a series of crimes. At ${link_2}, the Avatar stood behind him with a focused look throughout. After the verdict was returned, Aang, along with the rest of the crowd in ${link_3}, was bloodbent into unconsciousness by Yakone. As the criminal tried to escape, Aang's Avatar State kicked in, allowing him to awaken and chase Yakone on an air scooter.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Metalbending Police Force",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "Yakone's trial",
          "key": "${link_2}",
          "target": {
            "href": "Yakone%27s_trial",
            "page": "Yakone%27s_trial"
          }
        },
        {
          "body": "City Hall",
          "key": "${link_3}",
          "target": {
            "href": "City_Hall",
            "page": "City_Hall"
          }
        }
      ],
      "text": "Aang first encountered Yakone in Republic City in 128 AG. He met with Chief Toph Beifong and other members of the Metalbending Police Force to arrest Yakone after learning from witnesses that he had used bloodbending to commit a series of crimes. At Yakone's trial, the Avatar stood behind him with a focused look throughout. After the verdict was returned, Aang, along with the rest of the crowd in City Hall, was bloodbent into unconsciousness by Yakone. As the criminal tried to escape, Aang's Avatar State kicked in, allowing him to awaken and chase Yakone on an air scooter."
    },
    {
      "body": "The Avatar cut down Yakone's ${link_0}-drawn carriage and confronted him, only to be bloodbent again to the point of near death. However, Aang again used the Avatar State to snap the bloodbender's hold, bound him in earth, and stripped him of his bending, ending his threat to Republic City for good.",
      "links": [
        {
          "body": "ostrich horse",
          "key": "${link_0}",
          "target": {
            "href": "Ostrich_horse",
            "page": "Ostrich_horse"
          }
        }
      ],
      "text": "The Avatar cut down Yakone's ostrich horse-drawn carriage and confronted him, only to be bloodbent again to the point of near death. However, Aang again used the Avatar State to snap the bloodbender's hold, bound him in earth, and stripped him of his bending, ending his threat to Republic City for good."
    },
    {
      "body": "During the winter of 99-100 ${link_0}, ${link_1} was also hunted by ${link_2}.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_2}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        }
      ],
      "text": "During the winter of 99-100 AG, Aang was also hunted by Zhao."
    },
    {
      "body": "Admiral Zhao was a high ranking, important officer in the Fire Nation ${link_0} and had believed since childhood that he was destined for greatness. After discovering the Avatar's return to the world, Zhao became convinced that capturing Aang would be one of the paths to that greatness. As a result, though their encounters were sparse, Zhao became one of Aang's primary enemies until the latter's departure from the North Pole.",
      "links": [
        {
          "body": "military",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        }
      ],
      "text": "Admiral Zhao was a high ranking, important officer in the Fire Nation military and had believed since childhood that he was destined for greatness. After discovering the Avatar's return to the world, Zhao became convinced that capturing Aang would be one of the paths to that greatness. As a result, though their encounters were sparse, Zhao became one of Aang's primary enemies until the latter's departure from the North Pole."
    },
    {
      "body": "Zhao participated in a number of notable attempts to capture Aang. As the Avatar was seeking advice from the spirit of Avatar Roku, Prince Zuko was able to track him to Crescent Island. Zhao, in charge of the ${link_0}, allowed the exiled prince into Fire Nation waters and followed him. Arriving at the ${link_1}, Zhao attempted to corner and ambush Aang, who was already speaking with Roku, but the firebender's plans were thwarted when Roku himself intervened and caused the volcano beneath the temple to eruption; in the confusion, the team was able to escape. Some time later, the newly promoted Admiral Zhao employed the skills of a ${link_2} to trap Aang, only to watch how the Avatar escaped from imprisonment with help from the Blue Spirit. When Aang was briefly being tutored by renegade firebending master ${link_3}, the admiral let a convoy of ships up the river to the hidden deserts' campsite and proceeded to attack both his former teacher and the Avatar. However, from Jeong Jeong, Aang had learned about Zhao's tremendous temper and lack of control, and the peaceful Avatar decided to use his knowledge against his foe by taunting him on until, careless with rage, Zhao's wild firebending destroyed the ships in his convoy. Aang left the admiral to stew on his defeat, as the monk had effectively defeated Zhao without having thrown a single punch.",
      "links": [
        {
          "body": "blockade",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Navy_blockade",
            "page": "Fire_Navy_blockade"
          }
        },
        {
          "body": "Fire Temple",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Temple",
            "page": "Fire_Temple"
          }
        },
        {
          "body": "legendary squad of archers",
          "key": "${link_2}",
          "target": {
            "href": "Yuyan_Archers",
            "page": "Yuyan_Archers"
          }
        },
        {
          "body": "Jeong Jeong",
          "key": "${link_3}",
          "target": {
            "href": "Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        }
      ],
      "text": "Zhao participated in a number of notable attempts to capture Aang. As the Avatar was seeking advice from the spirit of Avatar Roku, Prince Zuko was able to track him to Crescent Island. Zhao, in charge of the blockade, allowed the exiled prince into Fire Nation waters and followed him. Arriving at the Fire Temple, Zhao attempted to corner and ambush Aang, who was already speaking with Roku, but the firebender's plans were thwarted when Roku himself intervened and caused the volcano beneath the temple to eruption; in the confusion, the team was able to escape. Some time later, the newly promoted Admiral Zhao employed the skills of a legendary squad of archers to trap Aang, only to watch how the Avatar escaped from imprisonment with help from the Blue Spirit. When Aang was briefly being tutored by renegade firebending master Jeong Jeong, the admiral let a convoy of ships up the river to the hidden deserts' campsite and proceeded to attack both his former teacher and the Avatar. However, from Jeong Jeong, Aang had learned about Zhao's tremendous temper and lack of control, and the peaceful Avatar decided to use his knowledge against his foe by taunting him on until, careless with rage, Zhao's wild firebending destroyed the ships in his convoy. Aang left the admiral to stew on his defeat, as the monk had effectively defeated Zhao without having thrown a single punch."
    },
    {
      "body": "Prior to the Avatar's return, Zhao had come across a ${link_0}, where he discovered the mortal forms of the Moon, Tui, and Ocean, ${link_1}, spirits. Having finally received permission from the Fire Lord, the admiral led a huge armada to the North Pole in order to destroy the Northern Water Tribe, where Aang was learning waterbending, and slay the Moon Spirit - the source of waterbending itself. Zhao attacked the Northern Water Tribe, and Aang was quick to retaliate, yet there were far too many Fire Navy ships. Desperate, the Avatar meditated and entered the Spirit World to seek help, but, unbeknownst to him, his physical body was captured by Prince Zuko.",
      "links": [
        {
          "body": "secret library",
          "key": "${link_0}",
          "target": {
            "href": "Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "La",
          "key": "${link_1}",
          "target": {
            "href": "La",
            "page": "La"
          }
        }
      ],
      "text": "Prior to the Avatar's return, Zhao had come across a secret library, where he discovered the mortal forms of the Moon, Tui, and Ocean, La, spirits. Having finally received permission from the Fire Lord, the admiral led a huge armada to the North Pole in order to destroy the Northern Water Tribe, where Aang was learning waterbending, and slay the Moon Spirit - the source of waterbending itself. Zhao attacked the Northern Water Tribe, and Aang was quick to retaliate, yet there were far too many Fire Navy ships. Desperate, the Avatar meditated and entered the Spirit World to seek help, but, unbeknownst to him, his physical body was captured by Prince Zuko."
    },
    {
      "body": "While the rest of Team Avatar searched the outside tundra for the exiled prince, Zhao invaded the Spirit Oasis and bagged the Moon Spirit, whose mortal form was a white koi fish; this caused a lunar eclipse which negated all waterbending abilities. Quickly confronted by the team as well as an angered Iroh, Zhao slayed the Moon Spirit and fled. Enraged, the Ocean Spirit and Aang in the Avatar State combined their powers to form Koizilla and vanquished the entire Fire Navy fleet. Foiled in his escape by the appearance of Zuko, Zhao fought the exiled prince until the Moon Spirit was restored by Princess Yue's sacrifice. Seeing the return of its ally, the Ocean Spirit relinquished its hold on the Avatar and proceeded to down the admiral; Zhao, unwilling to accept help from Zuko even at the cost of his own life, was carried underwater and drowned, a fact of which Aang seemed unaware.",
      "links": [],
      "text": "While the rest of Team Avatar searched the outside tundra for the exiled prince, Zhao invaded the Spirit Oasis and bagged the Moon Spirit, whose mortal form was a white koi fish; this caused a lunar eclipse which negated all waterbending abilities. Quickly confronted by the team as well as an angered Iroh, Zhao slayed the Moon Spirit and fled. Enraged, the Ocean Spirit and Aang in the Avatar State combined their powers to form Koizilla and vanquished the entire Fire Navy fleet. Foiled in his escape by the appearance of Zuko, Zhao fought the exiled prince until the Moon Spirit was restored by Princess Yue's sacrifice. Seeing the return of its ally, the Ocean Spirit relinquished its hold on the Avatar and proceeded to down the admiral; Zhao, unwilling to accept help from Zuko even at the cost of his own life, was carried underwater and drowned, a fact of which Aang seemed unaware."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Aang%27s_relationships",
    "file": "avatar.wikia.com/wiki/Aang's_relationships.html",
    "page": "Aang's_relationships",
    "title": "Aang's relationships"
  }
}