{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "external": false,
        "href": "/wiki/Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Duels",
      "target": {
        "external": false,
        "href": "/wiki/Category_Duels",
        "page": "Category_Duels"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "external": false,
        "href": "/wiki/Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Firebending",
      "target": {
        "external": false,
        "href": "/wiki/Category_Firebending",
        "page": "Category_Firebending"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "An Agni Kai is a traditional ${link_0} ${link_1} that is centuries old. It is a fight for one's honor and is won only when one opponent burns the other. The outcome of an Agni Kai affects the honor of each opponent. These duels are a popular method of resolving conflicts and are a source of entertainment for all spectators. The ${link_2} even houses a special Agni Kai chamber.",
      "links": [
        {
          "body": "firebender",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending#Notable_Firebenders",
            "page": "Firebending"
          }
        },
        {
          "body": "duel",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Duels",
            "page": "Duels"
          }
        },
        {
          "body": "Fire Nation Royal Palace",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_Royal_Palace",
            "page": "Fire_Nation_Royal_Palace"
          }
        }
      ],
      "section": [
        "Agni Kai"
      ],
      "text": "An Agni Kai is a traditional firebender duel that is centuries old. It is a fight for one's honor and is won only when one opponent burns the other. The outcome of an Agni Kai affects the honor of each opponent. These duels are a popular method of resolving conflicts and are a source of entertainment for all spectators. The Fire Nation Royal Palace even houses a special Agni Kai chamber."
    },
    {
      "body": "Any firebender of either gender may participate in an Agni Kai. ${link_0} can also be challenged, but that rarely occurs, as most Fire Lords are among the most powerful firebenders in ${link_1}.",
      "links": [
        {
          "body": "Fire Lords",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "the world",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "Agni Kai"
      ],
      "text": "Any firebender of either gender may participate in an Agni Kai. Fire Lords can also be challenged, but that rarely occurs, as most Fire Lords are among the most powerful firebenders in the world."
    },
    {
      "body": "If one person has a dispute with another person, he or she may challenge the other person to an Agni Kai. If the challenge is accepted, the two combatants move to either an official dueling area or whatever open area is available, such as a parade ground or plaza. The ceremonial opening begins with the two combatants opposite each other with their backs turned. The combatants stand, face each other, shed their shoulder garment, which was used only in formal Agni Kai, such as ${link_0}'s against ${link_1}, or ${link_2}'s against her brother, and begin the duel as soon as the gong sounds. In a proper fire duel, each male combatant fights with a bare torso. The Agni Kai is over when one participant burns the other.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Azula",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "Process"
      ],
      "text": "If one person has a dispute with another person, he or she may challenge the other person to an Agni Kai. If the challenge is accepted, the two combatants move to either an official dueling area or whatever open area is available, such as a parade ground or plaza. The ceremonial opening begins with the two combatants opposite each other with their backs turned. The combatants stand, face each other, shed their shoulder garment, which was used only in formal Agni Kai, such as Zuko's against Zhao, or Azula's against her brother, and begin the duel as soon as the gong sounds. In a proper fire duel, each male combatant fights with a bare torso. The Agni Kai is over when one participant burns the other."
    },
    {
      "body": "The Agni Kai is an ancient ${link_0} tradition. Fire duels have been fought for hundreds of years. However, such a duel is a grave matter, meant to be a last resort when all else fails or is insufficient to settle a dispute. When it comes to an Agni Kai, the duel apparently has some legal or at least \"semi-legal\" power, as the feud ends with the duel and the victor automatically also wins the feud, regardless of whether his opponent is still alive or not. Before ${link_1}'s ascent to power, Agni Kai were rarely fought to the death, but under the new regime, sparing a defeated opponent had become viewed as an act of weakness rather than one of generosity or mercy.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin",
            "page": "Sozin"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "Philosophy and culture"
      ],
      "text": "The Agni Kai is an ancient Fire Nation tradition. Fire duels have been fought for hundreds of years. However, such a duel is a grave matter, meant to be a last resort when all else fails or is insufficient to settle a dispute. When it comes to an Agni Kai, the duel apparently has some legal or at least \"semi-legal\" power, as the feud ends with the duel and the victor automatically also wins the feud, regardless of whether his opponent is still alive or not. Before Sozin's ascent to power, Agni Kai were rarely fought to the death, but under the new regime, sparing a defeated opponent had become viewed as an act of weakness rather than one of generosity or mercy."
    },
    {
      "body": "During the time of ${link_0} ${link_1}, the world was at peace, so he filled his days looking for opponents to duel, both in the physical as well as the ${link_2}. In his quest to find benders to test their strength, he even ended up challenging a bewildered Fire Nation civilian as he was going to the store.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Kuruk",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kuruk",
            "page": "Kuruk"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "Known duels"
      ],
      "text": "During the time of Avatar Kuruk, the world was at peace, so he filled his days looking for opponents to duel, both in the physical as well as the Spirit World. In his quest to find benders to test their strength, he even ended up challenging a bewildered Fire Nation civilian as he was going to the store."
    },
    {
      "body": "Centuries later, two and a half years before Avatar ${link_0} awoke from the iceberg, a thirteen-year-old ${link_1} Zuko attended a war meeting along with his father, ${link_2}, and his uncle, ${link_3}. When one of the generals present suggested sacrificing a division of novice soldiers to lure ${link_4} ${link_5} into a trap, Zuko protested, prompting Ozai to challenge him to an Agni Kai as a means to settle the matter. Zuko wrongly assumed he would face the general whom he had spoken out against, when in reality he was facing his father because although he had spoken against the general, he had dishonored his father in doing so. Zuko fell to his hands and knees pleading forgiveness from his father without striking a single blow. Ozai took this as an insult, a sign of unforgivable weakness, and burned his son's face, banishing him soon after. This Agni Kai left Zuko dishonored in the eyes of his father and the Fire Nation.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Prince",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "soldiers",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Earth_Kingdom",
            "page": "Military_of_the_Earth_Kingdom"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "Known duels"
      ],
      "text": "Centuries later, two and a half years before Avatar Aang awoke from the iceberg, a thirteen-year-old Prince Zuko attended a war meeting along with his father, Ozai, and his uncle, Iroh. When one of the generals present suggested sacrificing a division of novice soldiers to lure Earth Kingdom soldiers into a trap, Zuko protested, prompting Ozai to challenge him to an Agni Kai as a means to settle the matter. Zuko wrongly assumed he would face the general whom he had spoken out against, when in reality he was facing his father because although he had spoken against the general, he had dishonored his father in doing so. Zuko fell to his hands and knees pleading forgiveness from his father without striking a single blow. Ozai took this as an insult, a sign of unforgivable weakness, and burned his son's face, banishing him soon after. This Agni Kai left Zuko dishonored in the eyes of his father and the Fire Nation."
    },
    {
      "body": "Three years later, Zuko and Zhao fought an Agni Kai at the ${link_0}. Zuko had improved since his last match and successfully defeated Zhao, but refused to deliver the final blow. Zhao refused to concede and prepared to fight back, but was prevented from doing so by Iroh.",
      "links": [
        {
          "body": "Earth Kingdom harbor",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom_harbor",
            "page": "Earth_Kingdom_harbor"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "Known duels"
      ],
      "text": "Three years later, Zuko and Zhao fought an Agni Kai at the Earth Kingdom harbor. Zuko had improved since his last match and successfully defeated Zhao, but refused to deliver the final blow. Zhao refused to concede and prepared to fight back, but was prevented from doing so by Iroh."
    },
    {
      "body": "After Prince Zuko and Lieutenant ${link_0} got into an argument about Zuko's lack of respect for the crew of his ${link_1}, the two intended to duel, but the fight was broken up by Iroh before it could start.",
      "links": [
        {
          "body": "Jee",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jee",
            "page": "Jee"
          }
        },
        {
          "body": "ship",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko%27s_ship",
            "page": "Zuko%27s_ship"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "Known duels"
      ],
      "text": "After Prince Zuko and Lieutenant Jee got into an argument about Zuko's lack of respect for the crew of his ship, the two intended to duel, but the fight was broken up by Iroh before it could start."
    },
    {
      "body": "The most notable Agni Kai was that between Prince Zuko and his sister, Princess Azula, during the passing of ${link_0} in 100 ${link_1}. During Azula's coronation as the new Fire Lord, Zuko showed up to claim his birthright, prompting Azula to challenge him to an ${link_2} for the crown.",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "AG",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#War_years_.280_.E2.80.93_100_AG.29",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "Known duels"
      ],
      "text": "The most notable Agni Kai was that between Prince Zuko and his sister, Princess Azula, during the passing of Sozin's Comet in 100 AG. During Azula's coronation as the new Fire Lord, Zuko showed up to claim his birthright, prompting Azula to challenge him to an Agni Kai for the crown."
    },
    {
      "body": "Due to Sozin's Comet increasing their firebending to incredible levels and Azula's near-insanity, the two were stuck in stalemate for a while. While Azula seemed desperate and frantic in her attacks, Zuko remained attentive and calm. The pair caused major damage to many nearby buildings due to the augmented firebending from Sozin's Comet. Azula eventually targeted a third person, ${link_0}, by shooting lightning at her instead of Zuko, her direct opponent. However, Zuko intervened, shielding Katara from the attack, but ended up mortally wounded himself because of the lightning's passage dangerously close to his heart. Katara subsequently dueled Azula and managed to chain her to a storm drain, effectively defeating her and claiming the title of Fire Lord for Zuko.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "Known duels"
      ],
      "text": "Due to Sozin's Comet increasing their firebending to incredible levels and Azula's near-insanity, the two were stuck in stalemate for a while. While Azula seemed desperate and frantic in her attacks, Zuko remained attentive and calm. The pair caused major damage to many nearby buildings due to the augmented firebending from Sozin's Comet. Azula eventually targeted a third person, Katara, by shooting lightning at her instead of Zuko, her direct opponent. However, Zuko intervened, shielding Katara from the attack, but ended up mortally wounded himself because of the lightning's passage dangerously close to his heart. Katara subsequently dueled Azula and managed to chain her to a storm drain, effectively defeating her and claiming the title of Fire Lord for Zuko."
    },
    {
      "body": "Agni Kai are traditionally fought at sunset.",
      "links": [],
      "section": [
        "Agni Kai",
        "Trivia"
      ],
      "text": "Agni Kai are traditionally fought at sunset."
    },
    {
      "body": "The term \"Agni Kai\" was created by using two already existing words.\n The Sanskrit term agniḥ (अग्निः) means both fire and the deity which presides over fire. It can be found in many other Indo-Iranian languages as well.\n Kai (会, かい) is the Japanese word for \"meeting\". It is most commonly used in the sense of a business meeting, but it can also mean a general meeting of two or more people.",
      "links": [],
      "section": [
        "Agni Kai",
        "Trivia"
      ],
      "text": "The term \"Agni Kai\" was created by using two already existing words.\n The Sanskrit term agniḥ (अग्निः) means both fire and the deity which presides over fire. It can be found in many other Indo-Iranian languages as well.\n Kai (会, かい) is the Japanese word for \"meeting\". It is most commonly used in the sense of a business meeting, but it can also mean a general meeting of two or more people."
    },
    {
      "body": "The Sanskrit term agniḥ (अग्निः) means both fire and the deity which presides over fire. It can be found in many other Indo-Iranian languages as well.",
      "links": [],
      "section": [
        "Agni Kai",
        "Trivia"
      ],
      "text": "The Sanskrit term agniḥ (अग्निः) means both fire and the deity which presides over fire. It can be found in many other Indo-Iranian languages as well."
    },
    {
      "body": "Kai (会, かい) is the Japanese word for \"meeting\". It is most commonly used in the sense of a business meeting, but it can also mean a general meeting of two or more people.",
      "links": [],
      "section": [
        "Agni Kai",
        "Trivia"
      ],
      "text": "Kai (会, かい) is the Japanese word for \"meeting\". It is most commonly used in the sense of a business meeting, but it can also mean a general meeting of two or more people."
    },
    {
      "body": "Agni Kai is also the name of the track that was used when Zuko and Zhao dueled each other.",
      "links": [],
      "section": [
        "Agni Kai",
        "Trivia"
      ],
      "text": "Agni Kai is also the name of the track that was used when Zuko and Zhao dueled each other."
    },
    {
      "body": "In ${link_0}, the boy with whom ${link_1} spoke used the term \"Agni kī Duel\" instead of \"Agni Kai\". This can be written in Hindi as अग्नि की डूएल्, which literally translates to \"Duel of Fire\".",
      "links": [
        {
          "body": "The Last Airbender",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Film_The_Last_Airbender",
            "page": "Film_The_Last_Airbender"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Zuko",
            "page": "Film_Zuko"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "Trivia"
      ],
      "text": "In The Last Airbender, the boy with whom Zuko spoke used the term \"Agni kī Duel\" instead of \"Agni Kai\". This can be written in Hindi as अग्नि की डूएल्, which literally translates to \"Duel of Fire\"."
    },
    {
      "body": "Three Agni Kai have been depicted in ${link_0} and Zuko was a participant in each one: he dueled his father, Fire Lord Ozai; ${link_1} Zhao; and Princess Azula.",
      "links": [
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        },
        {
          "body": "Admiral",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "Trivia"
      ],
      "text": "Three Agni Kai have been depicted in Avatar: The Last Airbender and Zuko was a participant in each one: he dueled his father, Fire Lord Ozai; Admiral Zhao; and Princess Azula."
    },
    {
      "body": "The traditional attire for male firebenders during an Agni Kai is a belt, pants, and two arm rings between the deltoids and biceps, while also being bare chested and barefooted.",
      "links": [],
      "section": [
        "Agni Kai",
        "Trivia"
      ],
      "text": "The traditional attire for male firebenders during an Agni Kai is a belt, pants, and two arm rings between the deltoids and biceps, while also being bare chested and barefooted."
    },
    {
      "body": "${link_0} earned his fearsome reputation from a number of very quick Agni Kai.",
      "links": [
        {
          "body": "Combustion Man",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Combustion_Man",
            "page": "Combustion_Man"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "Trivia"
      ],
      "text": "Combustion Man earned his fearsome reputation from a number of very quick Agni Kai."
    },
    {
      "body": "In ${link_0}, there is a ${link_1} named after the ancient duel.",
      "links": [
        {
          "body": "Republic City",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "triad of firebenders",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Agni_Kai_Triad",
            "page": "Agni_Kai_Triad"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "Trivia"
      ],
      "text": "In Republic City, there is a triad of firebenders named after the ancient duel."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Comet-Enhanced Agni Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "See also"
      ],
      "text": "Comet-Enhanced Agni Kai"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Duels",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Duels",
            "page": "Duels"
          }
        }
      ],
      "section": [
        "Agni Kai",
        "See also"
      ],
      "text": "Duels"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Agni_Kai",
    "file": "avatar.wikia.com/wiki/Agni_Kai.html",
    "page": "Agni_Kai",
    "title": "Agni Kai"
  }
}