{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Air Nomads",
      "target": {
        "external": false,
        "href": "/wiki/Category_Air_Nomads",
        "page": "Category_Air_Nomads"
      }
    },
    {
      "body": "Airbending",
      "target": {
        "external": false,
        "href": "/wiki/Category_Airbending",
        "page": "Category_Airbending"
      }
    },
    {
      "body": "Equipment",
      "target": {
        "external": false,
        "href": "/wiki/Category_Equipment",
        "page": "Category_Equipment"
      }
    },
    {
      "body": "Objects",
      "target": {
        "external": false,
        "href": "/wiki/Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Vehicles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Vehicles",
        "page": "Category_Vehicles"
      }
    },
    {
      "body": "Weapons",
      "target": {
        "external": false,
        "href": "/wiki/Category_Weapons",
        "page": "Category_Weapons"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "An airbender staff is a wooden stave used primarily by ${link_0} to augment their ${link_1}. These versatile instruments were a major part of ${link_2} culture and used in the execution of several complex airbending techniques. Staffs were constructed to unfold into fan-like gliders, which enabled airbenders to fly while manipulating the air currents around them.",
      "links": [
        {
          "body": "airbenders",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "bending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Air Nomad",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "section": [
        "Airbender staff"
      ],
      "text": "An airbender staff is a wooden stave used primarily by airbenders to augment their bending. These versatile instruments were a major part of Air Nomad culture and used in the execution of several complex airbending techniques. Staffs were constructed to unfold into fan-like gliders, which enabled airbenders to fly while manipulating the air currents around them."
    },
    {
      "body": "Sometime before 0 ${link_0}, airbender staffs were used by young Air Nomads during ${link_1} in order to take flight. ${link_2} ${link_3} demonstrated several air loops to a young ${link_4}, who, in turn, attempted to airsurf. However, the young nomad fell off his glider, prompting Roku to catch him. With Gyatso lying atop his glider, Roku was unable to stabilize his glider staff, which resulted in both of them making a crash-landing to the ground.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "airbending training",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending_training",
            "page": "Airbending_training"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Roku",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Gyatso",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Gyatso",
            "page": "Gyatso"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "History",
        "Prior to the Hundred Year War"
      ],
      "text": "Sometime before 0 AG, airbender staffs were used by young Air Nomads during airbending training in order to take flight. Avatar Roku demonstrated several air loops to a young Gyatso, who, in turn, attempted to airsurf. However, the young nomad fell off his glider, prompting Roku to catch him. With Gyatso lying atop his glider, Roku was unable to stabilize his glider staff, which resulted in both of them making a crash-landing to the ground."
    },
    {
      "body": "While he was young, ${link_0} was presented with an airbender staff handcrafted by the monks for use in his training. After overhearing a discussion between the monks which culminated to Monk ${link_1}'s decision to send Aang to complete his training in the ${link_2}, Aang ran away with ${link_3}, bringing the airbender staff among his possessions.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Pasang",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pasang",
            "page": "Pasang"
          }
        },
        {
          "body": "Eastern Air Temple",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        },
        {
          "body": "Appa",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Appa",
            "page": "Appa"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "History",
        "Prior to the Hundred Year War"
      ],
      "text": "While he was young, Aang was presented with an airbender staff handcrafted by the monks for use in his training. After overhearing a discussion between the monks which culminated to Monk Pasang's decision to send Aang to complete his training in the Eastern Air Temple, Aang ran away with Appa, bringing the airbender staff among his possessions."
    },
    {
      "body": "Following his discovery in the ${link_0} in 99 AG, Aang used his staff extensively during his travels. On several occasions, the young Avatar demonstrated the instrument's capabilities as a weapon by using it to augment his bending. Aang was able to send powerful blasts of wind toward his enemies by triggering a small wing on his staff that acted similar to a miniature fan. He was also able to conjure compressed air swipes to deflect projectiles and attack enemies, as well as generate vortexes by using the staff as a fixed point of origin. The staff's dual purpose as a functional glider also benefited Aang in many combat situations, as it provided him with an aerial advantage and a convenient means of escape.",
      "links": [
        {
          "body": "Southern Water Tribe",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "History",
        "During the Hundred Year War",
        "Prior to the Coup of Ba Sing Se"
      ],
      "text": "Following his discovery in the Southern Water Tribe in 99 AG, Aang used his staff extensively during his travels. On several occasions, the young Avatar demonstrated the instrument's capabilities as a weapon by using it to augment his bending. Aang was able to send powerful blasts of wind toward his enemies by triggering a small wing on his staff that acted similar to a miniature fan. He was also able to conjure compressed air swipes to deflect projectiles and attack enemies, as well as generate vortexes by using the staff as a fixed point of origin. The staff's dual purpose as a functional glider also benefited Aang in many combat situations, as it provided him with an aerial advantage and a convenient means of escape."
    },
    {
      "body": "After partially recovering from an injury he sustained during the ${link_0}, Aang decided to take his staff to travel to the Fire Nation and defeat ${link_1} ${link_2} directly. Taking advantage of strong winds brought about by a fierce storm, Aang used a piece of driftwood and his staff to windsurf across the ${link_3}. However, as he was still not fully recuperated, Aang was unable to finish his journey and lost the staff at sea. The young Avatar survived the storm and was eventually found by the other members of ${link_4} on ${link_5}. Shortly after, the staff washed up on shore, damaged beyond repair. Realizing that he needed to remain concealed and that the staff would reveal his identity, Aang left the wooden stave to burn in a nearby river of lava.",
      "links": [
        {
          "body": "Coup of Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Mo Ce Sea",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Mo_Ce_Sea",
            "page": "Mo_Ce_Sea"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Crescent Island",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Crescent_Island",
            "page": "Crescent_Island"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "History",
        "During the Hundred Year War",
        "Prior to the Coup of Ba Sing Se"
      ],
      "text": "After partially recovering from an injury he sustained during the Coup of Ba Sing Se, Aang decided to take his staff to travel to the Fire Nation and defeat Fire Lord Ozai directly. Taking advantage of strong winds brought about by a fierce storm, Aang used a piece of driftwood and his staff to windsurf across the Mo Ce Sea. However, as he was still not fully recuperated, Aang was unable to finish his journey and lost the staff at sea. The young Avatar survived the storm and was eventually found by the other members of Team Avatar on Crescent Island. Shortly after, the staff washed up on shore, damaged beyond repair. Realizing that he needed to remain concealed and that the staff would reveal his identity, Aang left the wooden stave to burn in a nearby river of lava."
    },
    {
      "body": "Aang traveled through the Fire Nation without a staff until the ${link_0}, when the invasion force arrived to the ${link_1}. The ${link_2} created a brand new staff for Aang, which was considerably thinner compared to the staffs used by Air Nomads. The wooden instrument also came with blue wings and fins deployed through spring-loaded mechanisms, as well as a built-in snack compartment to provide the user with energy during flight. Although he originally considered the feature as trivial and frivolous, Aang eventually found it useful while flying alone to confront ${link_3} ${link_4} in the ${link_5}. Aang's new staff functioned similarly to his old staff during the invasion, although it produced slightly less powerful blasts of air. However, the new instrument was considerably more resilient, as Aang was able to bend it back to fling himself forward and blast Azula with air.",
      "links": [
        {
          "body": "Day of Black Sun",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "Black Cliffs",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Black_Cliffs",
            "page": "Black_Cliffs"
          }
        },
        {
          "body": "mechanist",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Mechanist",
            "page": "Mechanist"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Fire Nation Capital",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "History",
        "During the Hundred Year War",
        "Following the Coup of Ba Sing Se"
      ],
      "text": "Aang traveled through the Fire Nation without a staff until the Day of Black Sun, when the invasion force arrived to the Black Cliffs. The mechanist created a brand new staff for Aang, which was considerably thinner compared to the staffs used by Air Nomads. The wooden instrument also came with blue wings and fins deployed through spring-loaded mechanisms, as well as a built-in snack compartment to provide the user with energy during flight. Although he originally considered the feature as trivial and frivolous, Aang eventually found it useful while flying alone to confront Fire Lord Ozai in the Fire Nation Capital. Aang's new staff functioned similarly to his old staff during the invasion, although it produced slightly less powerful blasts of air. However, the new instrument was considerably more resilient, as Aang was able to bend it back to fling himself forward and blast Azula with air."
    },
    {
      "body": "After Aang disappeared shortly before the arrival of Sozin's Comet, ${link_0} used his staff as a reference for ${link_1}'s ${link_2}, ${link_3}, to track. The search attempt was unsuccessful, however, as the scent of the ${link_4} masked Aang, making it appear as though he did not exist.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "June",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/June",
            "page": "June"
          }
        },
        {
          "body": "shirshu",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Shirshu",
            "page": "Shirshu"
          }
        },
        {
          "body": "Nyla",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Nyla",
            "page": "Nyla"
          }
        },
        {
          "body": "lion turtle",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Lion_turtle#Era_of_the_Avatar",
            "page": "Lion_turtle"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "History",
        "During the Hundred Year War",
        "Following the Coup of Ba Sing Se"
      ],
      "text": "After Aang disappeared shortly before the arrival of Sozin's Comet, Katara used his staff as a reference for June's shirshu, Nyla, to track. The search attempt was unsuccessful, however, as the scent of the lion turtle masked Aang, making it appear as though he did not exist."
    },
    {
      "body": "During the ${link_0}, Aang used his staff to fly with Katara over ${link_1}'s walls in order to avoid ${link_2} guards, who only allowed individuals to enter with Fire Lord ${link_3}'s permission. While searching for ${link_4} along with the other members of Team Avatar, Aang used his staff to pursue Azula, who had jumped off Appa during flight. The staff was singed, however, when it was shot with fire by the young ${link_5}.",
      "links": [
        {
          "body": "Harmony Restoration Movement",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Harmony_Restoration_Movement",
            "page": "Harmony_Restoration_Movement"
          }
        },
        {
          "body": "Yu Dao",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Yu_Dao",
            "page": "Yu_Dao"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Ursa",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Ursa",
            "page": "Ursa"
          }
        },
        {
          "body": "princess",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "History",
        "Following the Hundred Year War"
      ],
      "text": "During the Harmony Restoration Movement, Aang used his staff to fly with Katara over Yu Dao's walls in order to avoid Fire Nation guards, who only allowed individuals to enter with Fire Lord Zuko's permission. While searching for Ursa along with the other members of Team Avatar, Aang used his staff to pursue Azula, who had jumped off Appa during flight. The staff was singed, however, when it was shot with fire by the young princess."
    },
    {
      "body": "After ${link_0} and ${link_1} gave birth to three airbending children, ${link_2}, ${link_3}, and ${link_4}, Tenzin taught them airbending, part of which involved using authentic airbender staffs to develop their gliding abilities. In 170 AG, Tenzin flew to the docks of ${link_5} in an attempt to convince ${link_6} to abandon her plan to confront ${link_7}. Later that year, Jinora used her staff to fend off ${link_8} during the invasion of ${link_9}.",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Pema",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pema",
            "page": "Pema"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Ikki",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ikki",
            "page": "Ikki"
          }
        },
        {
          "body": "Meelo",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Meelo",
            "page": "Meelo"
          }
        },
        {
          "body": "Air Temple Island",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Korra",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Amon",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Air Temple Island",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "History",
        "Following the Hundred Year War"
      ],
      "text": "After Tenzin and Pema gave birth to three airbending children, Jinora, Ikki, and Meelo, Tenzin taught them airbending, part of which involved using authentic airbender staffs to develop their gliding abilities. In 170 AG, Tenzin flew to the docks of Air Temple Island in an attempt to convince Korra to abandon her plan to confront Amon. Later that year, Jinora used her staff to fend off Equalists during the invasion of Air Temple Island."
    },
    {
      "body": "Following the ${link_0} of 171 AG, Korra came into possession of an airbender staff of her own, which was similar in design to the glider created by the mechanist for Aang. She used the staff to navigate through ${link_1} after it had become overrun by vines. Jinora used her staff once more in the ${link_2} during an \"airbending show\" held to recruit new airbenders, demonstrating its use through a series of maneuvers meant to captivate the audience.",
      "links": [
        {
          "body": "Harmonic Convergence",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "History",
        "Following the Hundred Year War"
      ],
      "text": "Following the Harmonic Convergence of 171 AG, Korra came into possession of an airbender staff of her own, which was similar in design to the glider created by the mechanist for Aang. She used the staff to navigate through Republic City after it had become overrun by vines. Jinora used her staff once more in the Earth Kingdom during an \"airbending show\" held to recruit new airbenders, demonstrating its use through a series of maneuvers meant to captivate the audience."
    },
    {
      "body": "After he was discovered by ${link_0} on Air Temple Island, ${link_1} took an airbender staff from Tenzin's study and used it to defend himself against the ${link_2}'s attacks and to augment his airbending. He eventually managed to subdue Kya and two ${link_3} stationed at the island, before using the staff as a glider to flee the scene.",
      "links": [
        {
          "body": "Kya",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kya",
            "page": "Kya"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "waterbender",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "White Lotus sentries",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/White_Lotus_sentries",
            "page": "White_Lotus_sentries"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "History",
        "Following the Hundred Year War"
      ],
      "text": "After he was discovered by Kya on Air Temple Island, Zaheer took an airbender staff from Tenzin's study and used it to defend himself against the waterbender's attacks and to augment his airbending. He eventually managed to subdue Kya and two White Lotus sentries stationed at the island, before using the staff as a glider to flee the scene."
    },
    {
      "body": "Jinora and ${link_0} used their gliders to observe a herd of ${link_1} near the ${link_2}. Shortly after encountering a number of calves, Jinora used her staff to fly both herself and Kai away from a protective mother bison, who charged toward Kai for getting too close to her offspring. During an altercation with ${link_3} shortly after, Kai used his glider to pursue the lead poacher and retracted the tool back into a staff to augment his airbending attacks, effectively subduing the rustler.",
      "links": [
        {
          "body": "Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kai",
            "page": "Kai"
          }
        },
        {
          "body": "flying bison",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "Northern Air Temple",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        },
        {
          "body": "bison rustlers",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Bison_rustlers",
            "page": "Bison_rustlers"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "History",
        "Following the Hundred Year War"
      ],
      "text": "Jinora and Kai used their gliders to observe a herd of flying bison near the Northern Air Temple. Shortly after encountering a number of calves, Jinora used her staff to fly both herself and Kai away from a protective mother bison, who charged toward Kai for getting too close to her offspring. During an altercation with bison rustlers shortly after, Kai used his glider to pursue the lead poacher and retracted the tool back into a staff to augment his airbending attacks, effectively subduing the rustler."
    },
    {
      "body": "By 174 AG, the airbender staffs had fallen out of widespread use in favor of gliding with the use of ${link_0}, though Avatar Korra continued to use hers.",
      "links": [
        {
          "body": "wingsuits",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Airbender_wingsuit",
            "page": "Airbender_wingsuit"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "History",
        "Following the Hundred Year War"
      ],
      "text": "By 174 AG, the airbender staffs had fallen out of widespread use in favor of gliding with the use of wingsuits, though Avatar Korra continued to use hers."
    },
    {
      "body": "Airbender staffs are delicate instruments that are handcrafted by monks. The shaft of the staff is made of a single piece of lightweight wood, which is hollowed down the center. Two wider, diamond-shaped pieces are located at the quarters near the top and bottom, into which a pair of brass rods are inserted. These rods form the hinges for the fan-like wings which transform the staff into a glider for flight. The ${link_0}'s variation of the staff is similar to that of its authentic counterpart, except with a rounded shaft, blue, rectangular wings, handle bars, and an added snack compartment.",
      "links": [
        {
          "body": "mechanist",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mechanist",
            "page": "Mechanist"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "Construction"
      ],
      "text": "Airbender staffs are delicate instruments that are handcrafted by monks. The shaft of the staff is made of a single piece of lightweight wood, which is hollowed down the center. Two wider, diamond-shaped pieces are located at the quarters near the top and bottom, into which a pair of brass rods are inserted. These rods form the hinges for the fan-like wings which transform the staff into a glider for flight. The mechanist's variation of the staff is similar to that of its authentic counterpart, except with a rounded shaft, blue, rectangular wings, handle bars, and an added snack compartment."
    },
    {
      "body": "Each wing is made of four thin shafts of the same kind of wood, fitted exactly to ascertain that they lie flush with the side when rotated back into the body of the staff. Across these shafts is a thick wax surface that gives the staff a similar appearance to a large fan. There are four wings on the staff, two of which are located in the center that provide principal lift and two at the base that are used for stabilization. All four wings fold back into the body with a snap, and fit so precisely that the staff feels like a singular piece of wood.",
      "links": [],
      "section": [
        "Airbender staff",
        "Construction"
      ],
      "text": "Each wing is made of four thin shafts of the same kind of wood, fitted exactly to ascertain that they lie flush with the side when rotated back into the body of the staff. Across these shafts is a thick wax surface that gives the staff a similar appearance to a large fan. There are four wings on the staff, two of which are located in the center that provide principal lift and two at the base that are used for stabilization. All four wings fold back into the body with a snap, and fit so precisely that the staff feels like a singular piece of wood."
    },
    {
      "body": "The staff is a small unpowered device which requires airbending to use as a glider. In order to ride it, users grasp hold of the two leading spars of the lift wings and loop their feet over the spars of the stabilizers. Airbenders use their bending to manipulate the air around the staff and provide lift, as the staff generates only minimal lift by itself. Generally, airbenders will create a small burst of wind to lift themselves off the ground in order to get the staff into the air.",
      "links": [],
      "section": [
        "Airbender staff",
        "Usage"
      ],
      "text": "The staff is a small unpowered device which requires airbending to use as a glider. In order to ride it, users grasp hold of the two leading spars of the lift wings and loop their feet over the spars of the stabilizers. Airbenders use their bending to manipulate the air around the staff and provide lift, as the staff generates only minimal lift by itself. Generally, airbenders will create a small burst of wind to lift themselves off the ground in order to get the staff into the air."
    },
    {
      "body": "Despite its delicacy, an airbender staff can be used like a regular quarterstaff and employed to augment a variety of defensive and offensive airbending maneuvers. As it extends the airbender's reach, a staff can create more powerful gusts of wind due to the longer arm motion used in performing a technique. However, direct physical contact between the staff and an object is discouraged due to the instrument's aforementioned delicacy, as evidenced by Aang's discomfort when Toph used his staff to crack nuts. When spun in front of the body, an airbender staff will help create an air shield capable of deflecting direct ${link_0} attacks. If lifted over the head, the spinning staff will allow for short periods of vertical or hovering flight.",
      "links": [
        {
          "body": "firebending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "Usage"
      ],
      "text": "Despite its delicacy, an airbender staff can be used like a regular quarterstaff and employed to augment a variety of defensive and offensive airbending maneuvers. As it extends the airbender's reach, a staff can create more powerful gusts of wind due to the longer arm motion used in performing a technique. However, direct physical contact between the staff and an object is discouraged due to the instrument's aforementioned delicacy, as evidenced by Aang's discomfort when Toph used his staff to crack nuts. When spun in front of the body, an airbender staff will help create an air shield capable of deflecting direct firebending attacks. If lifted over the head, the spinning staff will allow for short periods of vertical or hovering flight."
    },
    {
      "body": "Skilled airbenders can also use airbending staffs to perform variations of surfing. Gyatso demonstrated airsurfing by standing on his glider and gliding through the air. Conversely, Aang traveled across the Mo Ce Sea by windsurfing, through the use of his staff as a sail and a piece of driftwood as a board. Although windsurfing requires less energy than flying, it is less efficient over longer distances.",
      "links": [],
      "section": [
        "Airbender staff",
        "Usage"
      ],
      "text": "Skilled airbenders can also use airbending staffs to perform variations of surfing. Gyatso demonstrated airsurfing by standing on his glider and gliding through the air. Conversely, Aang traveled across the Mo Ce Sea by windsurfing, through the use of his staff as a sail and a piece of driftwood as a board. Although windsurfing requires less energy than flying, it is less efficient over longer distances."
    },
    {
      "body": "An airbender's signature tool is their staff.",
      "links": [],
      "section": [
        "Airbender staff",
        "Trivia"
      ],
      "text": "An airbender's signature tool is their staff."
    },
    {
      "body": "The original Air Nomad staffs were the inspiration for the mechanist's ${link_0}, which he created to allow his paraplegic son, ${link_1}, to fly.",
      "links": [
        {
          "body": "gliders",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Glider",
            "page": "Glider"
          }
        },
        {
          "body": "Teo",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Teo",
            "page": "Teo"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "Trivia"
      ],
      "text": "The original Air Nomad staffs were the inspiration for the mechanist's gliders, which he created to allow his paraplegic son, Teo, to fly."
    },
    {
      "body": "The only bending arts Aang did not incorporate his staff with were firebending and energybending.",
      "links": [],
      "section": [
        "Airbender staff",
        "Trivia"
      ],
      "text": "The only bending arts Aang did not incorporate his staff with were firebending and energybending."
    },
    {
      "body": "While the new airbenders after Harmonic Convergence in 171 AG used staffs akin to those of the original Air Nomads, Korra's staff and the one Zaheer stole from Tenzin's study resembled the one the mechanist made for Aang, although Zaheer's had orange wings instead of blue.",
      "links": [],
      "section": [
        "Airbender staff",
        "Trivia"
      ],
      "text": "While the new airbenders after Harmonic Convergence in 171 AG used staffs akin to those of the original Air Nomads, Korra's staff and the one Zaheer stole from Tenzin's study resembled the one the mechanist made for Aang, although Zaheer's had orange wings instead of blue."
    },
    {
      "body": "While intended for use by airbenders, Aang has also used his staff to augment his ${link_0}.",
      "links": [
        {
          "body": "earthbending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "Trivia"
      ],
      "text": "While intended for use by airbenders, Aang has also used his staff to augment his earthbending."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Airbender wingsuit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Airbender_wingsuit",
            "page": "Airbender_wingsuit"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "See also"
      ],
      "text": "Airbender wingsuit"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Gliders",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Glider",
            "page": "Glider"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "See also"
      ],
      "text": "Gliders"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Transportation in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Transportation_in_the_World_of_Avatar",
            "page": "Transportation_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "See also"
      ],
      "text": "Transportation in the World of Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Weaponry in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Weaponry_in_the_World_of_Avatar",
            "page": "Weaponry_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Airbender staff",
        "See also"
      ],
      "text": "Weaponry in the World of Avatar"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Airbender_staff",
    "file": "avatar.wikia.com/wiki/Airbender_staff.html",
    "page": "Airbender_staff",
    "title": "Airbender staff"
  }
}