{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "external": false,
        "href": "/wiki/Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Featured articles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Featured_articles",
        "page": "Category_Featured_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Airbending",
      "target": {
        "external": false,
        "href": "/wiki/Category_Airbending",
        "page": "Category_Airbending"
      }
    },
    {
      "body": "Bending arts",
      "target": {
        "external": false,
        "href": "/wiki/Category_Bending_arts",
        "page": "Category_Bending_arts"
      }
    }
  ],
  "facts": [
    {
      "key": "Source",
      "value": [
        {
          "body": "Air",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Air",
          "value": "Air",
          "value_text": "Air"
        }
      ]
    },
    {
      "key": "Learned from",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Flying bison",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Flying_bison",
                "page": "Flying_bison"
              }
            }
          ],
          "text": "Flying bison",
          "value": "${link_0}",
          "value_text": "Flying bison"
        }
      ]
    },
    {
      "key": "Alternate styles",
      "value": [
        {
          "body": "Flight",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Flight",
          "value": "Flight",
          "value_text": "Flight"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Spiritual projection",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Spiritual_projection",
                "page": "Spiritual_projection"
              }
            }
          ],
          "text": "Spiritual projection",
          "value": "${link_0}",
          "value_text": "Spiritual projection"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Airbending, one of the four elemental ${link_0}, is the aerokinetic ability to control and manipulate air. The peaceful ${link_1} utilized this type of bending in their everyday lives.",
      "links": [
        {
          "body": "bending arts",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "section": [
        "Airbending"
      ],
      "text": "Airbending, one of the four elemental bending arts, is the aerokinetic ability to control and manipulate air. The peaceful Air Nomads utilized this type of bending in their everyday lives."
    },
    {
      "body": "Air is the element of freedom. The Air Nomads detached themselves from worldly problems and concerns; finding peace and freedom was the key to solving their difficulties in life. Airbenders continually sought spiritual enlightenment, and, as a result, all children born into the Air Nomads were benders. The first airbenders learned their art from the ${link_0}.",
      "links": [
        {
          "body": "flying bison",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Flying_bison",
            "page": "Flying_bison"
          }
        }
      ],
      "section": [
        "Airbending"
      ],
      "text": "Air is the element of freedom. The Air Nomads detached themselves from worldly problems and concerns; finding peace and freedom was the key to solving their difficulties in life. Airbenders continually sought spiritual enlightenment, and, as a result, all children born into the Air Nomads were benders. The first airbenders learned their art from the flying bison."
    },
    {
      "body": "The key to airbending is flexibility and finding and following the path of least resistance. Airbending is notable for being almost purely defensive, as well as the most dynamic of the four bending arts. Airbenders can overwhelm many opponents at once with large and powerful attacks that could prove fatal; however, due to the pacifist nature of the Air Nomads, such attacks are rarely used. Due to their aforementioned spirituality, they often adapt to the situation surrounding them and employ negative ${link_0}, preferring evasive maneuvers as opposed to direct confrontation.",
      "links": [
        {
          "body": "jing",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jing",
            "page": "Jing"
          }
        }
      ],
      "section": [
        "Airbending"
      ],
      "text": "The key to airbending is flexibility and finding and following the path of least resistance. Airbending is notable for being almost purely defensive, as well as the most dynamic of the four bending arts. Airbenders can overwhelm many opponents at once with large and powerful attacks that could prove fatal; however, due to the pacifist nature of the Air Nomads, such attacks are rarely used. Due to their aforementioned spirituality, they often adapt to the situation surrounding them and employ negative jing, preferring evasive maneuvers as opposed to direct confrontation."
    },
    {
      "body": "During the ${link_0}, the power of air was temporarily bestowed on the inhabitants who lived on a ${link_1} while they left the village to stock up on food. After permanently leaving the care of the lion turtle, the former inhabitants eventually learned airbending from the flying bison, a sacred creature in the Air Nomad culture. The bison typically use their massive beaver-like tail to create gusts of wind and, as the name suggests, can fly without any visible means of propulsion. It is also said that the airbenders borrowed the arrow mark from the flying bison for the design of their traditional ${link_2}. These markings symbolize one's mastery of the airbending art and are given to a practitioner once their training is complete. Unlike other nations, all Air Nomads were born as airbenders due to the culture's strong ties to spirituality.",
      "links": [
        {
          "body": "era of Raava",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Era_of_Raava",
            "page": "Era_of_Raava"
          }
        },
        {
          "body": "giant lion turtle",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lion_turtle",
            "page": "Lion_turtle"
          }
        },
        {
          "body": "tattoos",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Body_markings_in_the_World_of_Avatar#Airbending_master_tattoos",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Airbending",
        "Origin"
      ],
      "text": "During the era of Raava, the power of air was temporarily bestowed on the inhabitants who lived on a giant lion turtle while they left the village to stock up on food. After permanently leaving the care of the lion turtle, the former inhabitants eventually learned airbending from the flying bison, a sacred creature in the Air Nomad culture. The bison typically use their massive beaver-like tail to create gusts of wind and, as the name suggests, can fly without any visible means of propulsion. It is also said that the airbenders borrowed the arrow mark from the flying bison for the design of their traditional tattoos. These markings symbolize one's mastery of the airbending art and are given to a practitioner once their training is complete. Unlike other nations, all Air Nomads were born as airbenders due to the culture's strong ties to spirituality."
    },
    {
      "body": "Air ball: An airbender can create a compressed ball of air by moving their hands together in a circular motion. This technique has many applications such as levitating small objects or trapping opponents. ${link_0} demonstrated this technique while playing with flying bison calves, giving them something to chase.",
      "links": [
        {
          "body": "Ikki",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ikki",
            "page": "Ikki"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Air ball: An airbender can create a compressed ball of air by moving their hands together in a circular motion. This technique has many applications such as levitating small objects or trapping opponents. Ikki demonstrated this technique while playing with flying bison calves, giving them something to chase."
    },
    {
      "body": "Air blast: A more offensive maneuver involving a direct pulse or jet of compressed air shot from the hands, feet, or mouth. The force of the attack is generated more from the bender's own power rather than assisted by momentum. The blast can reach further distances with greater accuracy and is used to inflict greater damage. Aang once used this technique to completely shatter one of the Fire Navy's projectile rocks in mid-air with a single powerful kick. He was also able to use two air blasts at once to defend against Combustion Man's unique firebending ability. The blasts can also be maintained for prolonged periods in order to push objects back. The airbenders of the new Air Nation demonstrated this by simultaneously attacking ${link_0}'s enormous ${link_1}.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "mecha suit",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_suit",
            "page": "Mecha_suit"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Air blast: A more offensive maneuver involving a direct pulse or jet of compressed air shot from the hands, feet, or mouth. The force of the attack is generated more from the bender's own power rather than assisted by momentum. The blast can reach further distances with greater accuracy and is used to inflict greater damage. Aang once used this technique to completely shatter one of the Fire Navy's projectile rocks in mid-air with a single powerful kick. He was also able to use two air blasts at once to defend against Combustion Man's unique firebending ability. The blasts can also be maintained for prolonged periods in order to push objects back. The airbenders of the new Air Nation demonstrated this by simultaneously attacking Kuvira's enormous mecha suit."
    },
    {
      "body": "Air bomb: A technique which creates a powerful, outward-moving air current in all directions around the bender. Usually performed after landing on the ground from above, this airbending form has great concussive force, and the capacity to completely blow away anything within its radius.",
      "links": [],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Air bomb: A technique which creates a powerful, outward-moving air current in all directions around the bender. Usually performed after landing on the ground from above, this airbending form has great concussive force, and the capacity to completely blow away anything within its radius."
    },
    {
      "body": "Air cushion: Airbenders can make a cushion out of air to break anyone's fall, including their own. ${link_0} used this to cushion his own fall after an ${link_1} ${link_2} knocked him roughly against the side of a building. ${link_3} made use of this technique to secure the safe landing of three thieves, who were flung out of their car by ${link_4}'s attack during their patrol.",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "mecha tank",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "Opal",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Opal",
            "page": "Opal"
          }
        },
        {
          "body": "Kai",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Kai",
            "page": "Kai"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Air cushion: Airbenders can make a cushion out of air to break anyone's fall, including their own. Tenzin used this to cushion his own fall after an Equalist mecha tank knocked him roughly against the side of a building. Opal made use of this technique to secure the safe landing of three thieves, who were flung out of their car by Kai's attack during their patrol."
    },
    {
      "body": "Air funnel: Similar to an air vortex but on a smaller scale, Aang inventively used this technique as a cannon by creating a small air funnel through which small coal projectiles could be loaded and fired out of the opposite end.",
      "links": [],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Air funnel: Similar to an air vortex but on a smaller scale, Aang inventively used this technique as a cannon by creating a small air funnel through which small coal projectiles could be loaded and fired out of the opposite end."
    },
    {
      "body": "Air manipulation: By using circular, evasive movements, airbenders build up a large amount of energy and momentum, which is released through powerful moves. It also allows for wind-based counter-attacks that knock opponents off-balance, mimicking the sudden directional shifts of air currents. Attacks vary from simple gusts of wind to miniature tornadoes and cyclones, maintaining the circular theme. Even a simple movement can create an air gust and airbenders increase the power of their moves by performing larger sweeps and spins, using the momentum of their movement to produce larger gusts. This is also demonstrated with their use of staffs or fans to increase or create precision within the air currents. Similarly, airbenders can also augment the momentum of thrown objects.",
      "links": [],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Air manipulation: By using circular, evasive movements, airbenders build up a large amount of energy and momentum, which is released through powerful moves. It also allows for wind-based counter-attacks that knock opponents off-balance, mimicking the sudden directional shifts of air currents. Attacks vary from simple gusts of wind to miniature tornadoes and cyclones, maintaining the circular theme. Even a simple movement can create an air gust and airbenders increase the power of their moves by performing larger sweeps and spins, using the momentum of their movement to produce larger gusts. This is also demonstrated with their use of staffs or fans to increase or create precision within the air currents. Similarly, airbenders can also augment the momentum of thrown objects."
    },
    {
      "body": "Air punch/kick: Another more offensive move than is typical of airbending discipline, air punches or air kicks are small, compressed formations of air that can be fired off the fists or feet of an airbender. This is similar to many firebending abilities and the air blast, in the sense that it involves the firing of compressed or solidified air at an enemy in a disjunct fashion i.e. the bender does not create a single great stream of air. This move was seen when Aang produced several air punches in rapid succession toward a practice-${link_0} dummy. ${link_1} ${link_2} was able to use two pairs of air punches in rapid succession and an air kick to knock ${link_3} off his feet. Korra used the air punch technique on the ground, spewing the bent air within a radius. She also used an air kick when fighting the police officers who were tracking down Kai.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Amon",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Air punch/kick: Another more offensive move than is typical of airbending discipline, air punches or air kicks are small, compressed formations of air that can be fired off the fists or feet of an airbender. This is similar to many firebending abilities and the air blast, in the sense that it involves the firing of compressed or solidified air at an enemy in a disjunct fashion i.e. the bender does not create a single great stream of air. This move was seen when Aang produced several air punches in rapid succession toward a practice-Fire Lord dummy. Avatar Korra was able to use two pairs of air punches in rapid succession and an air kick to knock Amon off his feet. Korra used the air punch technique on the ground, spewing the bent air within a radius. She also used an air kick when fighting the police officers who were tracking down Kai."
    },
    {
      "body": "Air shield: The most common defensive tactic for an airbender involves circling enemies, suddenly changing direction when attacked and evading by physical movement rather than bending. However, an airbender can still deflect attacks as needed by throwing up gusts of air close to their bodies as a shield. This is rarely to stop attacks directly and more often to push the attack aside, conserving energy and allowing them to turn the movement into an attack at the same moment. Kai used an air shield in 171 AG to protect himself from P'Li's combustion beams; he was able to deflect enough of the blast to prevent it from killing him, though the close proximity of the detonation knocked him out.",
      "links": [],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Air shield: The most common defensive tactic for an airbender involves circling enemies, suddenly changing direction when attacked and evading by physical movement rather than bending. However, an airbender can still deflect attacks as needed by throwing up gusts of air close to their bodies as a shield. This is rarely to stop attacks directly and more often to push the attack aside, conserving energy and allowing them to turn the movement into an attack at the same moment. Kai used an air shield in 171 AG to protect himself from P'Li's combustion beams; he was able to deflect enough of the blast to prevent it from killing him, though the close proximity of the detonation knocked him out."
    },
    {
      "body": "Air swipe: The air swipe is both a defensive and offensive technique in which an airbender conjures a crescent-shaped wave of compressed air capable of deflecting colossal projectiles, such as the catapulted flaming rocks often used by the ${link_0}, or redirecting them back to the attacker. Aang used this technique while battling with ${link_1} during the ${link_2}. ${link_3} also used this technique to knock back the ${link_4} when he invaded Air Temple Island and Korra used the Avatar State to enhance the power of this technique to take down ${link_5}'s ${link_6}.",
      "links": [
        {
          "body": "Fire Navy",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        },
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Lieutenant",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "dark spirits",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Air swipe: The air swipe is both a defensive and offensive technique in which an airbender conjures a crescent-shaped wave of compressed air capable of deflecting colossal projectiles, such as the catapulted flaming rocks often used by the Fire Navy, or redirecting them back to the attacker. Aang used this technique while battling with Azula during the invasion of the Fire Nation. Jinora also used this technique to knock back the Lieutenant when he invaded Air Temple Island and Korra used the Avatar State to enhance the power of this technique to take down Unalaq's dark spirits."
    },
    {
      "body": "Air wheel: This is a modified version of the air scooter invented by Tenzin. Air is rapidly spun around the airbender and carries the person inside the wheel of air. It is also able to cut through solid objects. Tenzin used this technique during the ${link_0}.",
      "links": [
        {
          "body": "battle at the Equalist factory",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Battle_at_the_Equalist_factory",
            "page": "Battle_at_the_Equalist_factory"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Air wheel: This is a modified version of the air scooter invented by Tenzin. Air is rapidly spun around the airbender and carries the person inside the wheel of air. It is also able to cut through solid objects. Tenzin used this technique during the battle at the Equalist factory."
    },
    {
      "body": "Breath of wind: Similar to the standard air jet, but created from the mouth and lungs. It requires extremely good breath control to employ effectively. Size and focus are easily controlled, from narrow jets that can strike targets as small as insects, to large gale-force gusts capable of cooling magma into solidified rock. This has been exhibited by both Aang and ${link_0}. By using this technique, the airbender can also magnify the sound waves generated by a whistle or another instrument. Aang demonstrated this technique while he was trying to lead a number of animals to the ${link_1} of ${link_2}, as he used airbending to blow his ${link_3}, sending massive sound waves throughout the city to call all the animals. His son Tenzin later performed a similar feat in an attempt to wake up the new airbenders for an early morning hike.",
      "links": [
        {
          "body": "Roku",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Agrarian Zone",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se#Agrarian_Zone",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "bison whistle",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Bison_whistle",
            "page": "Bison_whistle"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Breath of wind: Similar to the standard air jet, but created from the mouth and lungs. It requires extremely good breath control to employ effectively. Size and focus are easily controlled, from narrow jets that can strike targets as small as insects, to large gale-force gusts capable of cooling magma into solidified rock. This has been exhibited by both Aang and Roku. By using this technique, the airbender can also magnify the sound waves generated by a whistle or another instrument. Aang demonstrated this technique while he was trying to lead a number of animals to the Agrarian Zone of Ba Sing Se, as he used airbending to blow his bison whistle, sending massive sound waves throughout the city to call all the animals. His son Tenzin later performed a similar feat in an attempt to wake up the new airbenders for an early morning hike."
    },
    {
      "body": "Enhanced agility: Air movements can also be used as a levitation aid. Airbenders are able to jump high and far by riding on strong gusts of wind and can also slow or deflect falls by creating cushions of air. The constant movement required by this art makes airbenders naturally flexible and agile, making masters of the art difficult to hit. Even without the use of bending they can easily maneuver around an opponent by ducking, jumping, and side stepping, appearing to flow around their opponents without expending any energy at all, letting the opponent tire themselves out and thus creating exploitable openings. This conservation of energy combined with high stamina gives them an advantage in prolonged combat. ${link_0}, a blind ${link_1} who used her bending to tell where people were walking or running in relation to her, once told Aang that she could easily identify his walk by the fact that he had a light step.",
      "links": [
        {
          "body": "Toph Beifong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "earthbender",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Enhanced agility: Air movements can also be used as a levitation aid. Airbenders are able to jump high and far by riding on strong gusts of wind and can also slow or deflect falls by creating cushions of air. The constant movement required by this art makes airbenders naturally flexible and agile, making masters of the art difficult to hit. Even without the use of bending they can easily maneuver around an opponent by ducking, jumping, and side stepping, appearing to flow around their opponents without expending any energy at all, letting the opponent tire themselves out and thus creating exploitable openings. This conservation of energy combined with high stamina gives them an advantage in prolonged combat. Toph Beifong, a blind earthbender who used her bending to tell where people were walking or running in relation to her, once told Aang that she could easily identify his walk by the fact that he had a light step."
    },
    {
      "body": "Enhanced speed: Airbenders enhance their movement in battle; they can run swiftly by decreasing air resistance around them and even sprint across or run up vertical surfaces by generating a wind current behind themselves to propel them forward. Aang used this to run many times faster than an average human and maintain this for long periods, allowing him to travel long distances without gliding or jumping. When used by a skilled airbender, this technique can enable the airbender using it to travel at a speed almost too swift for the naked eye to be able to see properly. A master airbender can use this technique to briefly run across water.",
      "links": [],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Enhanced speed: Airbenders enhance their movement in battle; they can run swiftly by decreasing air resistance around them and even sprint across or run up vertical surfaces by generating a wind current behind themselves to propel them forward. Aang used this to run many times faster than an average human and maintain this for long periods, allowing him to travel long distances without gliding or jumping. When used by a skilled airbender, this technique can enable the airbender using it to travel at a speed almost too swift for the naked eye to be able to see properly. A master airbender can use this technique to briefly run across water."
    },
    {
      "body": "Heat regulation: Airbenders are able to warm themselves using proper breathing technique, allowing them to thrive in frigid environments with relative ease. Aang first demonstrated this in the ${link_0}, maintaining his body heat without the need of a parka or any additional layers of clothing.",
      "links": [
        {
          "body": "Southern Water Tribe",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Heat regulation: Airbenders are able to warm themselves using proper breathing technique, allowing them to thrive in frigid environments with relative ease. Aang first demonstrated this in the Southern Water Tribe, maintaining his body heat without the need of a parka or any additional layers of clothing."
    },
    {
      "body": "Suction: A technique used to bring people or objects toward the airbender. It was used by Aang many times, such as when he took up the fans dropped on the ground to fight ${link_0} on ${link_1} and pulled Professor ${link_2} out of harm's way in ${link_3}, as well as by ${link_4}, who used this technique to steal cabbages from an ${link_5} while his back was turned. Tenzin too demonstrated it when he tried to save ${link_6} from a mecha tank outfitted with a magnet and, although new to the art, ${link_7} was also capable of this technique, as he used it to bring his ${link_8} toward him in his fight with ${link_9}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "Zei",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Zei",
            "page": "Zei"
          }
        },
        {
          "body": "Wan Shi Tong's Library",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "Appa",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Appa",
            "page": "Appa"
          }
        },
        {
          "body": "animal trainer",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Circus_trainer",
            "page": "Circus_trainer"
          }
        },
        {
          "body": "Saikhan",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Saikhan",
            "page": "Saikhan"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "staff",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Airbender_staff",
            "page": "Airbender_staff"
          }
        },
        {
          "body": "Kya",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Kya",
            "page": "Kya"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities"
      ],
      "text": "Suction: A technique used to bring people or objects toward the airbender. It was used by Aang many times, such as when he took up the fans dropped on the ground to fight Zuko on Kyoshi Island and pulled Professor Zei out of harm's way in Wan Shi Tong's Library, as well as by Appa, who used this technique to steal cabbages from an animal trainer while his back was turned. Tenzin too demonstrated it when he tried to save Saikhan from a mecha tank outfitted with a magnet and, although new to the art, Zaheer was also capable of this technique, as he used it to bring his staff toward him in his fight with Kya."
    },
    {
      "body": "Air blades: A more offensive move than is typically used in airbending, this involves a focused, slicing air current that can cut through stone or timber with relative ease. This is frequently conjured with a staff rather than the body, using the narrow profile of the object to create a more focused and precise air movement.",
      "links": [],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Airbending master level"
      ],
      "text": "Air blades: A more offensive move than is typically used in airbending, this involves a focused, slicing air current that can cut through stone or timber with relative ease. This is frequently conjured with a staff rather than the body, using the narrow profile of the object to create a more focused and precise air movement."
    },
    {
      "body": "Air cocoon: A master airbender can rotate while jumping to wrap themselves in a cocoon of wind. This was demonstrated by Tenzin to dodge one of ${link_0}'s ice spikes and protected him from a potentially fatal combustion blast from ${link_1}. This technique utilizes an airbender's trademark fluid and dynamic movement style.",
      "links": [
        {
          "body": "Ming-Hua",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ming-Hua",
            "page": "Ming-Hua"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/P%27Li",
            "page": "P%27Li"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Airbending master level"
      ],
      "text": "Air cocoon: A master airbender can rotate while jumping to wrap themselves in a cocoon of wind. This was demonstrated by Tenzin to dodge one of Ming-Hua's ice spikes and protected him from a potentially fatal combustion blast from P'Li. This technique utilizes an airbender's trademark fluid and dynamic movement style."
    },
    {
      "body": "Air propulsion: A skilled airbender can propel themselves forward at great speed by negating the effect of wind resistance. Avatar Korra used this in the Avatar State during her battle with Kuvira.",
      "links": [],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Airbending master level"
      ],
      "text": "Air propulsion: A skilled airbender can propel themselves forward at great speed by negating the effect of wind resistance. Avatar Korra used this in the Avatar State during her battle with Kuvira."
    },
    {
      "body": "Air spout: Similar to the water spout, master airbenders are able to rotate and control the direction of an air spout enough to levitate themselves off the ground and remain in the air for as long as they wish to or can maintain it. The first known use of this technique was by Avatar Wan during the ${link_0}, when he generated an air spout shortly after fusing with Raava in an attempt to mediate the escalating conflict. Avatar Wan would later use the technique to mediate the warring human factions after ${link_1} by rising himself into the air while bending the other three elements. Avatar Roku used this technique in order to speak face-to-face with Fire Lord Sozin, who was suspended in the air by an earth column. In 170 AG, Tenzin used an air spout when he fought several Equalists who tried to abduct him at City Hall during the battle for Republic City. Avatar Korra later used this technique while in the Avatar State at the South Pole and again during her duel with Kuvira.",
      "links": [
        {
          "body": "battle in the Spirit Wilds",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Battle_in_the_Spirit_Wilds",
            "page": "Battle_in_the_Spirit_Wilds"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Airbending master level"
      ],
      "text": "Air spout: Similar to the water spout, master airbenders are able to rotate and control the direction of an air spout enough to levitate themselves off the ground and remain in the air for as long as they wish to or can maintain it. The first known use of this technique was by Avatar Wan during the battle in the Spirit Wilds, when he generated an air spout shortly after fusing with Raava in an attempt to mediate the escalating conflict. Avatar Wan would later use the technique to mediate the warring human factions after Harmonic Convergence by rising himself into the air while bending the other three elements. Avatar Roku used this technique in order to speak face-to-face with Fire Lord Sozin, who was suspended in the air by an earth column. In 170 AG, Tenzin used an air spout when he fought several Equalists who tried to abduct him at City Hall during the battle for Republic City. Avatar Korra later used this technique while in the Avatar State at the South Pole and again during her duel with Kuvira."
    },
    {
      "body": "Air vortex: A spinning funnel of air of varying size, the air vortex can be used to trap or disorient opponents as well as to deflect any objects thrown at it. Aang used this technique to form an air column during his duel with ${link_0} to throw aside a large boulder.",
      "links": [
        {
          "body": "Bumi",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Airbending master level"
      ],
      "text": "Air vortex: A spinning funnel of air of varying size, the air vortex can be used to trap or disorient opponents as well as to deflect any objects thrown at it. Aang used this technique to form an air column during his duel with Bumi to throw aside a large boulder."
    },
    {
      "body": "Air wake: By running in a circle and instantly building massive momentum, a master airbender can shoot a blast of highly compressed air shaped like the user's body at a target. This move seems to have extremely high concussive force. It was first used by Aang in the ${link_0} against Zuko.",
      "links": [
        {
          "body": "Crystal Catacombs",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Airbending master level"
      ],
      "text": "Air wake: By running in a circle and instantly building massive momentum, a master airbender can shoot a blast of highly compressed air shaped like the user's body at a target. This move seems to have extremely high concussive force. It was first used by Aang in the Crystal Catacombs against Zuko."
    },
    {
      "body": "Asphyxiation: A rather sinister technique of airbending, whereby an airbender manipulates the flow of air within a person's respiratory system, extracting it from the lungs via the nostrils and mouth, and prevents any new intake of breath by forming a ball of air around the head, thus eventually killing the victim by suffocation. The technique was first demonstrated by Zaheer on ${link_0} ${link_1} to lethal effect, and he later used it on Avatar Korra, though it was interrupted before she could suffocate.",
      "links": [
        {
          "body": "Earth Queen",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hou-Ting",
            "page": "Hou-Ting"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Airbending master level"
      ],
      "text": "Asphyxiation: A rather sinister technique of airbending, whereby an airbender manipulates the flow of air within a person's respiratory system, extracting it from the lungs via the nostrils and mouth, and prevents any new intake of breath by forming a ball of air around the head, thus eventually killing the victim by suffocation. The technique was first demonstrated by Zaheer on Earth Queen Hou-Ting to lethal effect, and he later used it on Avatar Korra, though it was interrupted before she could suffocate."
    },
    {
      "body": "Levitation: In the same way flying bison can fly and stay aloft for extended periods of time, a master airbender can achieve this same feat by generating and controlling air to form a cloud-like board under their feet and surf through the air, thereby emulating flight.",
      "links": [],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Airbending master level"
      ],
      "text": "Levitation: In the same way flying bison can fly and stay aloft for extended periods of time, a master airbender can achieve this same feat by generating and controlling air to form a cloud-like board under their feet and surf through the air, thereby emulating flight."
    },
    {
      "body": "Tornado: This is a smaller scaled version of the air vortex which airbending masters can use as a means of both combat and transport. By encircling themselves in a spiraling air current, masters can travel at high speeds and even ascend near-vertical drops as demonstrated by Aang during the battle of ${link_0}, where he narrowly avoided a lightning blast from ${link_1} ${link_2} by creating a mini-tornado and moving to the top of a rock column. Aang was also seen wielding this maneuver on the offensive against ${link_3} at the ${link_4}, where he summoned the tornado with a kick in mid-air to conjure a powerful ranged attack. When several airbenders work together, this technique can also be used to create a much larger and more powerful tornado, such as when ${link_5} and the new airbenders used it to save Korra from Zaheer.",
      "links": [
        {
          "body": "Wulong Forest",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wulong_Forest",
            "page": "Wulong_Forest"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Combustion Man",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Combustion_Man",
            "page": "Combustion_Man"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Airbending master level"
      ],
      "text": "Tornado: This is a smaller scaled version of the air vortex which airbending masters can use as a means of both combat and transport. By encircling themselves in a spiraling air current, masters can travel at high speeds and even ascend near-vertical drops as demonstrated by Aang during the battle of Wulong Forest, where he narrowly avoided a lightning blast from Fire Lord Ozai by creating a mini-tornado and moving to the top of a rock column. Aang was also seen wielding this maneuver on the offensive against Combustion Man at the Western Air Temple, where he summoned the tornado with a kick in mid-air to conjure a powerful ranged attack. When several airbenders work together, this technique can also be used to create a much larger and more powerful tornado, such as when Jinora and the new airbenders used it to save Korra from Zaheer."
    },
    {
      "body": "Air sphere: With this technique, the Avatar creates a sphere of air around them, allowing them to hover for extended periods of time or fly at high speeds. The sphere also acts as a barrier to protect the Avatar, strong enough to withstand a high velocity impact with rock. Aang was also able to use this technique under water, forming a protective pocket of air around several people and a flying bison. Roku used a variation of this technique when defending his island from the volcano, and Wan and Korra both used it to restrain ${link_0} in their respective battles against him.",
      "links": [
        {
          "body": "Vaatu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Vaatu",
            "page": "Vaatu"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Avatar level airbending"
      ],
      "text": "Air sphere: With this technique, the Avatar creates a sphere of air around them, allowing them to hover for extended periods of time or fly at high speeds. The sphere also acts as a barrier to protect the Avatar, strong enough to withstand a high velocity impact with rock. Aang was also able to use this technique under water, forming a protective pocket of air around several people and a flying bison. Roku used a variation of this technique when defending his island from the volcano, and Wan and Korra both used it to restrain Vaatu in their respective battles against him."
    },
    {
      "body": "Strong winds: It is possible for the Avatar to unleash extremely powerful winds. During the ${link_0}, while extinguishing three enormous fire whips, Aang unleashed a straightforward wind attack at Ozai. While Ozai seemingly did not take much damage from the hit, a nearby rock pillar crumbled and collapsed in a matter of seconds. This move was also used by Avatar ${link_1} to create Kyoshi Island, using the powerful winds to push the landmass into sea.",
      "links": [
        {
          "body": "battle at Wulong Forest",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Battle_at_Wulong_Forest",
            "page": "Battle_at_Wulong_Forest"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi",
            "page": "Kyoshi"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Avatar level airbending"
      ],
      "text": "Strong winds: It is possible for the Avatar to unleash extremely powerful winds. During the battle at Wulong Forest, while extinguishing three enormous fire whips, Aang unleashed a straightforward wind attack at Ozai. While Ozai seemingly did not take much damage from the hit, a nearby rock pillar crumbled and collapsed in a matter of seconds. This move was also used by Avatar Kyoshi to create Kyoshi Island, using the powerful winds to push the landmass into sea."
    },
    {
      "body": "Tornadoes/hurricanes: In addition to large and powerful air movements, an Avatar level airbender can create massive tornadoes and hurricanes at will. Yangchen demonstrated this as part of showing the power the Avatar State had.",
      "links": [],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Avatar level airbending"
      ],
      "text": "Tornadoes/hurricanes: In addition to large and powerful air movements, an Avatar level airbender can create massive tornadoes and hurricanes at will. Yangchen demonstrated this as part of showing the power the Avatar State had."
    },
    {
      "body": "Air scooter: The air scooter is a form of transportation invented by Aang in 2 ${link_0}. It is a spherical \"ball\" of air that can be ridden balancing on it like a top. He used the technique in many episodes, usually to provide quick bursts of speed as well as to overcome vertical surfaces, including during the battle on the ${link_1} in order to scale the wall of Ba Sing Se. The air scooter also allowed levitation for short periods, about five to ten seconds in a stationary position. The air scooter was seen in the opening credits of every episode except the first, and it first appeared in an actual episode when Aang used it to escape Zuko's ship. It was Aang's invention of this technique that subsequently earned him his tattoos and title of a master at such a young age. He taught the move to his airbending friends and, despite initial failure, they eventually mastered the art well enough to develop a game that requires the use of the air scooter. Aang is also capable of conjuring an air scooter from little balls of air. As an adult, he could create air scooters that were larger than those he conjured as a child and could ride them while standing upright. Air scooters are not restricted to holding a single rider, as they can be used to transport others as well.",
      "links": [
        {
          "body": "BG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Fire Nation drill",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Special techniques"
      ],
      "text": "Air scooter: The air scooter is a form of transportation invented by Aang in 2 BG. It is a spherical \"ball\" of air that can be ridden balancing on it like a top. He used the technique in many episodes, usually to provide quick bursts of speed as well as to overcome vertical surfaces, including during the battle on the Fire Nation drill in order to scale the wall of Ba Sing Se. The air scooter also allowed levitation for short periods, about five to ten seconds in a stationary position. The air scooter was seen in the opening credits of every episode except the first, and it first appeared in an actual episode when Aang used it to escape Zuko's ship. It was Aang's invention of this technique that subsequently earned him his tattoos and title of a master at such a young age. He taught the move to his airbending friends and, despite initial failure, they eventually mastered the art well enough to develop a game that requires the use of the air scooter. Aang is also capable of conjuring an air scooter from little balls of air. As an adult, he could create air scooters that were larger than those he conjured as a child and could ride them while standing upright. Air scooters are not restricted to holding a single rider, as they can be used to transport others as well."
    },
    {
      "body": "Cloud manipulation: Since clouds are made from air and water, a skilled airbender can easily manipulate them into various shapes. Aang, with assistance from Katara, demonstrated this technique during Team Avatar's stay in ${link_0} to provide a message to the nearby villagers, and he later did the same to disguise their flights on Appa while moving about the Fire Nation. During the era of Raava, citizens of air lion turtles were able to create cloud platforms on which they could stand and fly around.",
      "links": [
        {
          "body": "Makapu Village",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Makapu_Village",
            "page": "Makapu_Village"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Special techniques"
      ],
      "text": "Cloud manipulation: Since clouds are made from air and water, a skilled airbender can easily manipulate them into various shapes. Aang, with assistance from Katara, demonstrated this technique during Team Avatar's stay in Makapu Village to provide a message to the nearby villagers, and he later did the same to disguise their flights on Appa while moving about the Fire Nation. During the era of Raava, citizens of air lion turtles were able to create cloud platforms on which they could stand and fly around."
    },
    {
      "body": "Hypersensitivity: Due to being capable of perceiving subtle shifts and vibrations in the surrounding air currents, airbenders can detect approaching threats, which gives them a split-second increase in their reaction time, similar to how ${link_0} use ${link_1}. Because of this, Air Nomads traditionally shaved their heads as to \"free themselves\" and have a stronger connection with the wind around them. Tenzin demonstrated this technique when he was able to detect and evade an ambush by Equalists on the roof of ${link_2} during the ${link_3}. ${link_4} also demonstrated it during a battle with ${link_5} when he perceived and evaded an attack behind him by sensing the oncoming threat.",
      "links": [
        {
          "body": "earthbenders",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "seismic sense",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Seismic_sense",
            "page": "Seismic_sense"
          }
        },
        {
          "body": "City Hall",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/City_Hall",
            "page": "City_Hall"
          }
        },
        {
          "body": "battle for Republic City",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Battle_for_Republic_City",
            "page": "Battle_for_Republic_City"
          }
        },
        {
          "body": "Daw",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Daw",
            "page": "Daw"
          }
        },
        {
          "body": "bison rustlers",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Bison_rustlers",
            "page": "Bison_rustlers"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Special techniques"
      ],
      "text": "Hypersensitivity: Due to being capable of perceiving subtle shifts and vibrations in the surrounding air currents, airbenders can detect approaching threats, which gives them a split-second increase in their reaction time, similar to how earthbenders use seismic sense. Because of this, Air Nomads traditionally shaved their heads as to \"free themselves\" and have a stronger connection with the wind around them. Tenzin demonstrated this technique when he was able to detect and evade an ambush by Equalists on the roof of City Hall during the battle for Republic City. Daw also demonstrated it during a battle with bison rustlers when he perceived and evaded an attack behind him by sensing the oncoming threat."
    },
    {
      "body": "Flight: The ability to fly was originally exclusive to the flying bison and air lion turtles; however, Guru ${link_0} was able to unlock the ability by releasing himself of all his earthly tethers, achieving true and complete freedom. The technique is so rare that he was the only airbender in history to have ever achieved it until Zaheer, a student of Laghima's teachings, also unlocked the ability four thousand years later, by letting go of his last earthly connection, namely his girlfriend ${link_1}, following her death. Being able to fly without an aid, such as a glider, grants the practitioner more stability and freedom in the sky, while also permitting easier use of bending mid-flight. It is also an energy efficient technique, as it allowed Laghima to live the last forty years of his life without ever touching the ground. Although a powerful technique, the ability is hindered by additional weight and the currents of the wind.",
      "links": [
        {
          "body": "Laghima",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Laghima",
            "page": "Laghima"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/P%27Li",
            "page": "P%27Li"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Special techniques"
      ],
      "text": "Flight: The ability to fly was originally exclusive to the flying bison and air lion turtles; however, Guru Laghima was able to unlock the ability by releasing himself of all his earthly tethers, achieving true and complete freedom. The technique is so rare that he was the only airbender in history to have ever achieved it until Zaheer, a student of Laghima's teachings, also unlocked the ability four thousand years later, by letting go of his last earthly connection, namely his girlfriend P'Li, following her death. Being able to fly without an aid, such as a glider, grants the practitioner more stability and freedom in the sky, while also permitting easier use of bending mid-flight. It is also an energy efficient technique, as it allowed Laghima to live the last forty years of his life without ever touching the ground. Although a powerful technique, the ability is hindered by additional weight and the currents of the wind."
    },
    {
      "body": "Gliding: Although all airbenders can levitate or extend jumps via airbending, most if not all airbenders possess a ${link_0} for mid-range flight. These hand-crafted portable wood and canvas structures can collapse into a staff for storage and as an aid when bending. In glider form, it is used in conjunction with bending to fly as long as the bender has the strength to maintain the air currents. With stronger winds, multiple people can be carried for short distances. As a normal staff, it can be used as a weapon in battle, to aid in bending, and even as a levitation aid when spun above the head like a helicopter propeller. By 174 AG, these glider staffs had been replaced by ${link_1}.",
      "links": [
        {
          "body": "glider",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Airbender_staff",
            "page": "Airbender_staff"
          }
        },
        {
          "body": "wingsuits",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Airbender_wingsuit",
            "page": "Airbender_wingsuit"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Special techniques"
      ],
      "text": "Gliding: Although all airbenders can levitate or extend jumps via airbending, most if not all airbenders possess a glider for mid-range flight. These hand-crafted portable wood and canvas structures can collapse into a staff for storage and as an aid when bending. In glider form, it is used in conjunction with bending to fly as long as the bender has the strength to maintain the air currents. With stronger winds, multiple people can be carried for short distances. As a normal staff, it can be used as a weapon in battle, to aid in bending, and even as a levitation aid when spun above the head like a helicopter propeller. By 174 AG, these glider staffs had been replaced by wingsuits."
    },
    {
      "body": "Aang used his glider for windsurfing, but later destroyed his damaged glider, though it was replaced at the beginning of the invasion of the Fire Nation by a more advanced version created by the ${link_0} and his son ${link_1}, which can also dispense snacks when the handle is twisted.",
      "links": [
        {
          "body": "mechanist",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mechanist",
            "page": "Mechanist"
          }
        },
        {
          "body": "Teo",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Teo",
            "page": "Teo"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Special techniques"
      ],
      "text": "Aang used his glider for windsurfing, but later destroyed his damaged glider, though it was replaced at the beginning of the invasion of the Fire Nation by a more advanced version created by the mechanist and his son Teo, which can also dispense snacks when the handle is twisted."
    },
    {
      "body": "When visiting Roku's past during the ${link_0}, Aang saw a younger version of his old mentor, Monk ${link_1}, using a variation of the usual flying, utilizing the glider as a makeshift board to surf on air.",
      "links": [
        {
          "body": "summer solstice",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Summer_solstice",
            "page": "Summer_solstice"
          }
        },
        {
          "body": "Gyatso",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Gyatso",
            "page": "Gyatso"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Special techniques"
      ],
      "text": "When visiting Roku's past during the summer solstice, Aang saw a younger version of his old mentor, Monk Gyatso, using a variation of the usual flying, utilizing the glider as a makeshift board to surf on air."
    },
    {
      "body": "${link_0}: Master airbenders who have a strong connection with their spiritual side are capable of projecting their spirits into other locations. Through projection, an airbender is able to explore underground or sealed locations by passing through solid matter. Airbenders can also use this technique to find individuals with whom they have a strong bond. During Harmonic Convergence, Jinora used an amplified variation of this ability to assist Avatar Korra during her battle with the ${link_1}. She used the technique once more to find where the Dai Li imprisoned airbenders in Ba Sing Se and later again to try to find a way to escape the Red Lotus.",
      "links": [
        {
          "body": "Spiritual projection",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spiritual_projection",
            "page": "Spiritual_projection"
          }
        },
        {
          "body": "Dark Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_Avatar",
            "page": "Dark_Avatar"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Special techniques"
      ],
      "text": "Spiritual projection: Master airbenders who have a strong connection with their spiritual side are capable of projecting their spirits into other locations. Through projection, an airbender is able to explore underground or sealed locations by passing through solid matter. Airbenders can also use this technique to find individuals with whom they have a strong bond. During Harmonic Convergence, Jinora used an amplified variation of this ability to assist Avatar Korra during her battle with the Dark Avatar. She used the technique once more to find where the Dai Li imprisoned airbenders in Ba Sing Se and later again to try to find a way to escape the Red Lotus."
    },
    {
      "body": "Airbending is the most passive of the four arts, as many of its techniques center around mobility, evading and eluding the opponent. Along with this, the Air Nomads also taught pacifism. ${link_0} is the direct opposite of this. While the airbenders avoid or deflect oncoming attacks, earthbenders absorb them or overwhelm them with superior force. Airbenders are constantly moving in circles, while earthbenders require a firm root in one place to effectively bend. However, firebending is the spiritual opposite of airbending. Airbenders are passive and peaceful, while firebenders are aggressive and passionate.",
      "links": [
        {
          "body": "Earthbending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Opposing bending art"
      ],
      "text": "Airbending is the most passive of the four arts, as many of its techniques center around mobility, evading and eluding the opponent. Along with this, the Air Nomads also taught pacifism. Earthbending is the direct opposite of this. While the airbenders avoid or deflect oncoming attacks, earthbenders absorb them or overwhelm them with superior force. Airbenders are constantly moving in circles, while earthbenders require a firm root in one place to effectively bend. However, firebending is the spiritual opposite of airbending. Airbenders are passive and peaceful, while firebenders are aggressive and passionate."
    },
    {
      "body": "Like all of the bending arts, airbending is balanced out as to not be more or less powerful than the other arts, though it is easily the most dynamic and agile of the four. It is the skill and power of the user that determines victory.",
      "links": [],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Opposing bending art"
      ],
      "text": "Like all of the bending arts, airbending is balanced out as to not be more or less powerful than the other arts, though it is easily the most dynamic and agile of the four. It is the skill and power of the user that determines victory."
    },
    {
      "body": "Several objects can be used to help an airbender hone his ability and master the art.",
      "links": [],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Training tools"
      ],
      "text": "Several objects can be used to help an airbender hone his ability and master the art."
    },
    {
      "body": "The ${link_0} court doubles as a field for playing airball, as well as training several skills involved with airbending. Balance and dexterity are especially trained by this game. Accuracy is also trained, because the ball is mostly controlled by airbending as well.",
      "links": [
        {
          "body": "airball",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Airball",
            "page": "Airball"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Training tools"
      ],
      "text": "The airball court doubles as a field for playing airball, as well as training several skills involved with airbending. Balance and dexterity are especially trained by this game. Accuracy is also trained, because the ball is mostly controlled by airbending as well."
    },
    {
      "body": "${link_0} are designed so that one has to trust on one's evasive airbending maneuvers to successfully make one's way through the spinning gates. Those wishing to master the spinning gates have to be like a leaf, flowing with the wind instead of forcing one's way through.",
      "links": [
        {
          "body": "Spinning gates",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island#Airbending_training_area",
            "page": "Air_Temple_Island"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Training tools"
      ],
      "text": "Spinning gates are designed so that one has to trust on one's evasive airbending maneuvers to successfully make one's way through the spinning gates. Those wishing to master the spinning gates have to be like a leaf, flowing with the wind instead of forcing one's way through."
    },
    {
      "body": "Unlike benders of other nations, who rarely use ${link_0} in conjunction with their bending, airbenders commonly use their signature staffs to augment their powers in battle. The increased force generated by swinging the staff transfers more energy to resulting air blasts. With the staff's narrow profile, the currents can be more accurately controlled and even shaped into blade-like crescents of air, capable of cutting through solid objects. Metal fans can also be used in combination with airbending, as demonstrated by Avatars Kyoshi and Aang.",
      "links": [
        {
          "body": "weapons",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Weaponry_in_the_World_of_Avatar",
            "page": "Weaponry_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Weapons"
      ],
      "text": "Unlike benders of other nations, who rarely use weapons in conjunction with their bending, airbenders commonly use their signature staffs to augment their powers in battle. The increased force generated by swinging the staff transfers more energy to resulting air blasts. With the staff's narrow profile, the currents can be more accurately controlled and even shaped into blade-like crescents of air, capable of cutting through solid objects. Metal fans can also be used in combination with airbending, as demonstrated by Avatars Kyoshi and Aang."
    },
    {
      "body": "While ${link_0} browsed a weapons shop in the Fire Nation, Aang proposed the idea of the wind sword; he stated that an airbender could channel air from a sword hilt and swing it about like a blade, similar to a contained air slice.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "section": [
        "Airbending",
        "Airbending abilities",
        "Weapons"
      ],
      "text": "While Team Avatar browsed a weapons shop in the Fire Nation, Aang proposed the idea of the wind sword; he stated that an airbender could channel air from a sword hilt and swing it about like a blade, similar to a contained air slice."
    },
    {
      "body": "Airbender principles regarding fatal moves: Though deemed the most dynamic of the bending arts, the most controversial aspect of airbending is its supposed lack of fatal moves, being a more defense-inclined art. This aspect in itself is a reflection of the principles held by the Air Nomads, which preaches the preciousness of all life and avoidance of violence whenever possible. This does not mean that airbending is non-lethal, as there have been instances where an airbender has resorted to brute and even lethal force during a conflict; for example, Aang used an air slice to knock down a buzzard wasp out of anger, something airbenders were told to avoid. Even Avatar Yangchen herself confessed to deeds that were in direct violation of her Air Nomad teachings, albeit for what she saw as the greater good. Nevertheless, with appropriate application, airbending can be as lethal as any other bending art. Airbending moves such as the air blade and air blast could prove particularly fatal against living creatures, as they can cut through stone/timber and break entire rock-columns in half, respectively. Another example of airbending lethality was when Monk Gyatso battled with the Fire Nation's invasion of the ${link_0}. Although an elderly and gentle person, when confronted with a life-threatening assault on his people, Gyatso's powerful airbending enabled him to eliminate many Fire Nation invaders before succumbing to fatigue or injury and ultimately death. Another example of how dangerous and lethal airbending can be was when Zaheer used his abilities to asphyxiate the ${link_1}, ${link_2}.",
      "links": [
        {
          "body": "Southern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        },
        {
          "body": "Earth Queen",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Hou-Ting",
            "page": "Hou-Ting"
          }
        }
      ],
      "section": [
        "Airbending",
        "Weakness"
      ],
      "text": "Airbender principles regarding fatal moves: Though deemed the most dynamic of the bending arts, the most controversial aspect of airbending is its supposed lack of fatal moves, being a more defense-inclined art. This aspect in itself is a reflection of the principles held by the Air Nomads, which preaches the preciousness of all life and avoidance of violence whenever possible. This does not mean that airbending is non-lethal, as there have been instances where an airbender has resorted to brute and even lethal force during a conflict; for example, Aang used an air slice to knock down a buzzard wasp out of anger, something airbenders were told to avoid. Even Avatar Yangchen herself confessed to deeds that were in direct violation of her Air Nomad teachings, albeit for what she saw as the greater good. Nevertheless, with appropriate application, airbending can be as lethal as any other bending art. Airbending moves such as the air blade and air blast could prove particularly fatal against living creatures, as they can cut through stone/timber and break entire rock-columns in half, respectively. Another example of airbending lethality was when Monk Gyatso battled with the Fire Nation's invasion of the Southern Air Temple. Although an elderly and gentle person, when confronted with a life-threatening assault on his people, Gyatso's powerful airbending enabled him to eliminate many Fire Nation invaders before succumbing to fatigue or injury and ultimately death. Another example of how dangerous and lethal airbending can be was when Zaheer used his abilities to asphyxiate the Earth Queen, Hou-Ting."
    },
    {
      "body": "The symbol of airbending is a closed, counter-clockwise, inverted triple spiral triskele. This symbol was engraved on the pendant of both Monk Gyatso's and Aang's prayer beads.",
      "links": [],
      "section": [
        "Airbending",
        "Elemental symbol"
      ],
      "text": "The symbol of airbending is a closed, counter-clockwise, inverted triple spiral triskele. This symbol was engraved on the pendant of both Monk Gyatso's and Aang's prayer beads."
    },
    {
      "body": "Historically, young airbenders were raised in one of the four ${link_0} at each corner of ${link_1}. Hidden away atop mountain ranges on remote islands, the strong breezes in these area helped with their airbending training. The ${link_2} and Southern Air Temples were exclusively male and staffed by airbender monks, who instructed young benders in their art, while the ${link_3} and ${link_4} were exclusively female. However, the Council of Elders had decided that Aang would finish his training at the Eastern Air Temple, and it was at the same temple where he and several other young boys were first introduced to their animal companions, the flying bison.",
      "links": [
        {
          "body": "air temples",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_temple",
            "page": "Air_temple"
          }
        },
        {
          "body": "the globe",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Northern",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        },
        {
          "body": "Eastern",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        },
        {
          "body": "Western Air Temples",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "section": [
        "Airbending",
        "Spirituality and airbending"
      ],
      "text": "Historically, young airbenders were raised in one of the four air temples at each corner of the globe. Hidden away atop mountain ranges on remote islands, the strong breezes in these area helped with their airbending training. The Northern and Southern Air Temples were exclusively male and staffed by airbender monks, who instructed young benders in their art, while the Eastern and Western Air Temples were exclusively female. However, the Council of Elders had decided that Aang would finish his training at the Eastern Air Temple, and it was at the same temple where he and several other young boys were first introduced to their animal companions, the flying bison."
    },
    {
      "body": "An airbender is declared a master once he or she has fully mastered the thirty-six tiers of airbending and/or when he or she creates a new airbending technique; Aang an exception to the rule, as he had mastered only thirty-five tiers, but his creation of the air scooter technique fulfilled the requirements for mastery. Airbenders who have mastered the element are marked as such by blue tattoos striping along the head and limbs, terminating in an arrow on the forehead, backs of the hands, and the tops of the feet. However, this does not apply to Avatars born outside of the Air Nomads. Male monks sport completely shaven heads, and female airbenders shave their foreheads, but they leave the back of their hair uncut.",
      "links": [],
      "section": [
        "Airbending",
        "Spirituality and airbending"
      ],
      "text": "An airbender is declared a master once he or she has fully mastered the thirty-six tiers of airbending and/or when he or she creates a new airbending technique; Aang an exception to the rule, as he had mastered only thirty-five tiers, but his creation of the air scooter technique fulfilled the requirements for mastery. Airbenders who have mastered the element are marked as such by blue tattoos striping along the head and limbs, terminating in an arrow on the forehead, backs of the hands, and the tops of the feet. However, this does not apply to Avatars born outside of the Air Nomads. Male monks sport completely shaven heads, and female airbenders shave their foreheads, but they leave the back of their hair uncut."
    },
    {
      "body": "Air Nomads generally espouse a philosophy of conflict avoidance and respect for all forms of life; an airbender will never seek a fight, and they will never seek to strike an opponent directly. This accounts for airbending's stress on defensive maneuvers and its apparent lack of fatal finishing attacks. Due to the spirituality of the Air Nomads in accordance to the size of its population, every Air Nomad retains bending abilities. The Air Nomads have the smallest population but the most increased spirituality, while benders in general make up only a small percentage of the larger, more populous nations.",
      "links": [],
      "section": [
        "Airbending",
        "Spirituality and airbending"
      ],
      "text": "Air Nomads generally espouse a philosophy of conflict avoidance and respect for all forms of life; an airbender will never seek a fight, and they will never seek to strike an opponent directly. This accounts for airbending's stress on defensive maneuvers and its apparent lack of fatal finishing attacks. Due to the spirituality of the Air Nomads in accordance to the size of its population, every Air Nomad retains bending abilities. The Air Nomads have the smallest population but the most increased spirituality, while benders in general make up only a small percentage of the larger, more populous nations."
    },
    {
      "body": "Airbenders emphasize intuition and imagination; to an airbender, there is always another path to take, as air flows wherever it can. This makes airbending the most dynamic of all the bending arts, and air itself is considered to be the element of freedom.",
      "links": [],
      "section": [
        "Airbending",
        "Spirituality and airbending"
      ],
      "text": "Airbenders emphasize intuition and imagination; to an airbender, there is always another path to take, as air flows wherever it can. This makes airbending the most dynamic of all the bending arts, and air itself is considered to be the element of freedom."
    },
    {
      "body": "In 0 ${link_0}, the airbenders were the victims of ${link_1} at the hands of the ${link_2}. The temples were invaded, and all the airbender monks slaughtered in an effort to break the Avatar's cycle of reincarnation and ensure the Fire Nation's victory in their imperialist war. A number of airbenders managed to survive the initial massacre and fled into hiding, but they were later lured into mountainous areas with relics from home and killed.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#War_years_.280_.E2.80.93_100_AG.29",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "genocide",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "section": [
        "Airbending",
        "The Air Nomad Genocide"
      ],
      "text": "In 0 AG, the airbenders were the victims of genocide at the hands of the Fire Nation. The temples were invaded, and all the airbender monks slaughtered in an effort to break the Avatar's cycle of reincarnation and ensure the Fire Nation's victory in their imperialist war. A number of airbenders managed to survive the initial massacre and fled into hiding, but they were later lured into mountainous areas with relics from home and killed."
    },
    {
      "body": "Ironically, the only known survivor of the massacre is the same person the Fire Nation sought to kill in its quest for supremacy: The twelve-year-old airbender and Avatar, Aang, had run away from home shortly before the war began in earnest and became trapped in suspended animation, frozen in an iceberg near the South Pole.",
      "links": [],
      "section": [
        "Airbending",
        "The Air Nomad Genocide"
      ],
      "text": "Ironically, the only known survivor of the massacre is the same person the Fire Nation sought to kill in its quest for supremacy: The twelve-year-old airbender and Avatar, Aang, had run away from home shortly before the war began in earnest and became trapped in suspended animation, frozen in an iceberg near the South Pole."
    },
    {
      "body": "The last known vestiges of airbender culture included one surviving flying bison, Appa, and a ${link_0}, ${link_1}, both of whom were Aang's companions. The abandoned Northern Air Temple was colonized by displaced ${link_2} citizens, led by the mechanist. The Eastern Air Temple was inhabited by Guru ${link_3}, who claimed to be an old friend of Monk Gyatso. The Southern Air Temple is the only temple in which bodies of countless Fire Nation soldiers and Monk Gyatso's corpse are present. Years later, Aang found an island filled with healthy flying bison and ${link_4}, which indicated that Appa was not the last surviving flying bison.",
      "links": [
        {
          "body": "winged lemur",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Winged_lemur",
            "page": "Winged_lemur"
          }
        },
        {
          "body": "Momo",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Momo",
            "page": "Momo"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Pathik",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Pathik",
            "page": "Pathik"
          }
        },
        {
          "body": "ring-tailed winged lemurs",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Ring-tailed_winged_lemur",
            "page": "Ring-tailed_winged_lemur"
          }
        }
      ],
      "section": [
        "Airbending",
        "The Air Nomad Genocide"
      ],
      "text": "The last known vestiges of airbender culture included one surviving flying bison, Appa, and a winged lemur, Momo, both of whom were Aang's companions. The abandoned Northern Air Temple was colonized by displaced Earth Kingdom citizens, led by the mechanist. The Eastern Air Temple was inhabited by Guru Pathik, who claimed to be an old friend of Monk Gyatso. The Southern Air Temple is the only temple in which bodies of countless Fire Nation soldiers and Monk Gyatso's corpse are present. Years later, Aang found an island filled with healthy flying bison and ring-tailed winged lemurs, which indicated that Appa was not the last surviving flying bison."
    },
    {
      "body": "Even 170 years after the Air Nomad Genocide, airbending culture survived through Aang's youngest son, Tenzin, and Tenzin's children, of whom the eldest three are known to be airbenders; the ${link_0} were also formed by Aang to carry on the traditions of Air Nomad culture. Tenzin's family and some of the Air Acolytes reside at ${link_1} in ${link_2}, while most of the acolytes live in each of the four ancient Air Temples. Prior to Harmonic Convergence, Tenzin's family were the last airbenders and were thus targeted by ${link_3} in an effort to effectively erase one of the four bending arts from the world permanently. However, after Harmonic Convergence, the ability to airbend reemerged again across the world after several nonbenders obtained the ability.",
      "links": [
        {
          "body": "Air Acolytes",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Acolytes",
            "page": "Air_Acolytes"
          }
        },
        {
          "body": "Air Temple Island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Amon",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        }
      ],
      "section": [
        "Airbending",
        "The Air Nomad Genocide",
        "Aftermath"
      ],
      "text": "Even 170 years after the Air Nomad Genocide, airbending culture survived through Aang's youngest son, Tenzin, and Tenzin's children, of whom the eldest three are known to be airbenders; the Air Acolytes were also formed by Aang to carry on the traditions of Air Nomad culture. Tenzin's family and some of the Air Acolytes reside at Air Temple Island in Republic City, while most of the acolytes live in each of the four ancient Air Temples. Prior to Harmonic Convergence, Tenzin's family were the last airbenders and were thus targeted by Amon in an effort to effectively erase one of the four bending arts from the world permanently. However, after Harmonic Convergence, the ability to airbend reemerged again across the world after several nonbenders obtained the ability."
    },
    {
      "body": "After the Harmonic Convergence of 171 AG, numerous nonbenders across the world suddenly discovered they had airbending abilities. Korra, Tenzin, and the rest of ${link_0} set out to find these people and convince them to train with Tenzin at the Northern Air Temple and help restore the Air Nation. Their quest proved to be largely unsuccessful as nobody wished to give up their existing lives, save for a young boy named Kai.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "section": [
        "Airbending",
        "Rebuilding the Air Nation"
      ],
      "text": "After the Harmonic Convergence of 171 AG, numerous nonbenders across the world suddenly discovered they had airbending abilities. Korra, Tenzin, and the rest of Team Avatar set out to find these people and convince them to train with Tenzin at the Northern Air Temple and help restore the Air Nation. Their quest proved to be largely unsuccessful as nobody wished to give up their existing lives, save for a young boy named Kai."
    },
    {
      "body": "In Ba Sing Se, the ${link_0} had been kidnapping the new airbenders and trained them underneath the ${link_1} to form Earth Queen ${link_2}'s first airbending regiment. After Team Avatar discovered this practice, they freed all the captives, after which the new airbenders all agreed to go to the Northern Air Temple to learn the way of the Air Nomads. Initially, progress was slow as Tenzin struggled to motivate them with his teachings, though after they all banded together to rescue flying bison calves from bison rustlers, Tenzin and the new airbenders found a new dynamic as master and students.",
      "links": [
        {
          "body": "Dai Li",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Earth Queen's Temple",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Queen%27s_Temple",
            "page": "Earth_Queen%27s_Temple"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Hou-Ting",
            "page": "Hou-Ting"
          }
        }
      ],
      "section": [
        "Airbending",
        "Rebuilding the Air Nation"
      ],
      "text": "In Ba Sing Se, the Dai Li had been kidnapping the new airbenders and trained them underneath the Earth Queen's Temple to form Earth Queen Hou-Ting's first airbending regiment. After Team Avatar discovered this practice, they freed all the captives, after which the new airbenders all agreed to go to the Northern Air Temple to learn the way of the Air Nomads. Initially, progress was slow as Tenzin struggled to motivate them with his teachings, though after they all banded together to rescue flying bison calves from bison rustlers, Tenzin and the new airbenders found a new dynamic as master and students."
    },
    {
      "body": "Two weeks after Zaheer was taken down by Korra, Tenzin announced that the Air Nation would reclaim its nomadic roots and roam the earth, promoting peace, balance, and harmony while Korra recuperated from her fight with the Red Lotus. He also anointed Jinora an airbending master, stating she would help them follow their new path.",
      "links": [],
      "section": [
        "Airbending",
        "Rebuilding the Air Nation"
      ],
      "text": "Two weeks after Zaheer was taken down by Korra, Tenzin announced that the Air Nation would reclaim its nomadic roots and roam the earth, promoting peace, balance, and harmony while Korra recuperated from her fight with the Red Lotus. He also anointed Jinora an airbending master, stating she would help them follow their new path."
    },
    {
      "body": "In the ${link_0}, airbending was portrayed much like it was in the cartoons. Its implementation also required sweeping, circular movements from Aang in order to create variable airbending techniques. He was also seen using rapid movements and kicks when creating the mini-tornado in front of the Northern Water Tribe council.",
      "links": [
        {
          "body": "film",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Film_The_Last_Airbender",
            "page": "Film_The_Last_Airbender"
          }
        }
      ],
      "section": [
        "Airbending",
        "The Last Airbender"
      ],
      "text": "In the film, airbending was portrayed much like it was in the cartoons. Its implementation also required sweeping, circular movements from Aang in order to create variable airbending techniques. He was also seen using rapid movements and kicks when creating the mini-tornado in front of the Northern Water Tribe council."
    },
    {
      "body": "Aang was a master of airbending, indicated by his tattoos. He was able to create an invisible wall of air in front or around him with one gesture, enough to repel two Fire Nation soldiers. He was able to jostle a Fire Nation soldier around without hitting the innocent bystander the soldier was holding hostage. He was also able to throw several Fire Nation soldiers into the air while Water Tribe Warriors standing in front of them were unaffected.",
      "links": [],
      "section": [
        "Airbending",
        "The Last Airbender"
      ],
      "text": "Aang was a master of airbending, indicated by his tattoos. He was able to create an invisible wall of air in front or around him with one gesture, enough to repel two Fire Nation soldiers. He was able to jostle a Fire Nation soldier around without hitting the innocent bystander the soldier was holding hostage. He was also able to throw several Fire Nation soldiers into the air while Water Tribe Warriors standing in front of them were unaffected."
    },
    {
      "body": "He also used airbending to augment his agility, as seen when he escaped from ${link_0} near the beginning of the film, as well as for attacking in the Northern Air Temple. He could create a wind strong enough and wide enough to temporarily stun and keep apart two battling armies. Aang was able to manipulate fog while in the Northern Air Temple.",
      "links": [
        {
          "body": "Zuko's ship",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko%27s_ship",
            "page": "Zuko%27s_ship"
          }
        }
      ],
      "section": [
        "Airbending",
        "The Last Airbender"
      ],
      "text": "He also used airbending to augment his agility, as seen when he escaped from Zuko's ship near the beginning of the film, as well as for attacking in the Northern Air Temple. He could create a wind strong enough and wide enough to temporarily stun and keep apart two battling armies. Aang was able to manipulate fog while in the Northern Air Temple."
    },
    {
      "body": "Airbending is based on the Baguazhang style of martial arts, also known as \"circle walking\" or \"Eight Trigram Palm\", along with a small hint of Xingyiquan, also known as \"mind heart boxing\". Baguazhang involves \"smooth coiling and uncoiling actions\". Such moves employ dynamic footwork, throws, and hand techniques. These martial arts feature swift, evasive maneuvers that evoke the intangibility and explosive power of wind; drawing energy from the center of the abdomen.",
      "links": [],
      "section": [
        "Airbending",
        "Connection"
      ],
      "text": "Airbending is based on the Baguazhang style of martial arts, also known as \"circle walking\" or \"Eight Trigram Palm\", along with a small hint of Xingyiquan, also known as \"mind heart boxing\". Baguazhang involves \"smooth coiling and uncoiling actions\". Such moves employ dynamic footwork, throws, and hand techniques. These martial arts feature swift, evasive maneuvers that evoke the intangibility and explosive power of wind; drawing energy from the center of the abdomen."
    },
    {
      "body": "Ba Gua, which utilizes circle walking of the Eight Trigrams, is known for its constant circular movement, which makes it difficult for opponents to attack directly or land a blow, a philosophy that is prevalent within airbending as well. Maneuvers employ the entire body with smooth coiling and uncoiling movements, utilizing dynamic footwork, open-hand techniques, punches, and throws. A common tactic is to maneuver behind an opponent and mirror their movements, preventing them from turning to face the practitioner, similar to the technique Aang used during his fight with ${link_0}. Korra also practiced her airbending moves on a Ba Gua platform on Air Temple Island.",
      "links": [
        {
          "body": "Hide",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hide",
            "page": "Hide"
          }
        }
      ],
      "section": [
        "Airbending",
        "Connection"
      ],
      "text": "Ba Gua, which utilizes circle walking of the Eight Trigrams, is known for its constant circular movement, which makes it difficult for opponents to attack directly or land a blow, a philosophy that is prevalent within airbending as well. Maneuvers employ the entire body with smooth coiling and uncoiling movements, utilizing dynamic footwork, open-hand techniques, punches, and throws. A common tactic is to maneuver behind an opponent and mirror their movements, preventing them from turning to face the practitioner, similar to the technique Aang used during his fight with Hide. Korra also practiced her airbending moves on a Ba Gua platform on Air Temple Island."
    },
    {
      "body": "${link_0} for \"${link_1}\" stated that all Air Nomads are airbenders. This would make the Nomads the only group with every individual being a bender. The creators also explain this is due to bending coming from spirituality.",
      "links": [
        {
          "body": "Avatar Extras",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar_Extras_(Book_One__Water)#.22The_Northern_Air_Temple.22",
            "page": "Avatar_Extras_(Book_One__Water)"
          }
        },
        {
          "body": "The Northern Air Temple",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/The_Northern_Air_Temple",
            "page": "The_Northern_Air_Temple"
          }
        }
      ],
      "section": [
        "Airbending",
        "Trivia"
      ],
      "text": "Avatar Extras for \"The Northern Air Temple\" stated that all Air Nomads are airbenders. This would make the Nomads the only group with every individual being a bender. The creators also explain this is due to bending coming from spirituality."
    },
    {
      "body": "According to Aang's wanted poster, the Chinese word for airbending is 截氣神功, meaning \"the divine art of halting air\".",
      "links": [],
      "section": [
        "Airbending",
        "Trivia"
      ],
      "text": "According to Aang's wanted poster, the Chinese word for airbending is 截氣神功, meaning \"the divine art of halting air\"."
    },
    {
      "body": "In the Greek dub, the word airbending has been translated as windbending, Ανεμοδάμασμα (Anemodamasma), instead of the pure Greek translation of airbending, Αεροδάμασμα (Aerodamasma). In ${link_0}, it is instead translated as Κάμψη αέρα (Kampsi aera), meaning \"bending of air\".\n Airbending is also called windbending in the Finnish dub.",
      "links": [
        {
          "body": "The Legend of Korra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/The_Legend_of_Korra",
            "page": "The_Legend_of_Korra"
          }
        }
      ],
      "section": [
        "Airbending",
        "Trivia"
      ],
      "text": "In the Greek dub, the word airbending has been translated as windbending, Ανεμοδάμασμα (Anemodamasma), instead of the pure Greek translation of airbending, Αεροδάμασμα (Aerodamasma). In The Legend of Korra, it is instead translated as Κάμψη αέρα (Kampsi aera), meaning \"bending of air\".\n Airbending is also called windbending in the Finnish dub."
    },
    {
      "body": "Airbending is also called windbending in the Finnish dub.",
      "links": [],
      "section": [
        "Airbending",
        "Trivia"
      ],
      "text": "Airbending is also called windbending in the Finnish dub."
    },
    {
      "body": "The concept of having thirty-six tiers of airbending and Aang not mastering one is similar to ${link_0}.",
      "links": [
        {
          "body": "The 36th Chamber of Shaolin",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/The_36th_Chamber_of_Shaolin",
            "page": "http://en.wikipedia.org/wiki/The_36th_Chamber_of_Shaolin"
          }
        }
      ],
      "section": [
        "Airbending",
        "Trivia"
      ],
      "text": "The concept of having thirty-six tiers of airbending and Aang not mastering one is similar to The 36th Chamber of Shaolin."
    },
    {
      "body": "An airbender's sneeze can create more propulsion than a modern-day jet engine.",
      "links": [],
      "section": [
        "Airbending",
        "Trivia"
      ],
      "text": "An airbender's sneeze can create more propulsion than a modern-day jet engine."
    },
    {
      "body": "Airbenders are the second loudest snorers in the world, with flying bison being the first.",
      "links": [],
      "section": [
        "Airbending",
        "Trivia"
      ],
      "text": "Airbenders are the second loudest snorers in the world, with flying bison being the first."
    },
    {
      "body": "Airbending is the only bending art in which no Avatar has demonstrated the use of at least one of its sub-skills.\n Additionally, only three people are known to have used an airbending sub-skill: Guru Laghima and Zaheer were capable of flight, and Jinora can project her spirit.",
      "links": [],
      "section": [
        "Airbending",
        "Trivia"
      ],
      "text": "Airbending is the only bending art in which no Avatar has demonstrated the use of at least one of its sub-skills.\n Additionally, only three people are known to have used an airbending sub-skill: Guru Laghima and Zaheer were capable of flight, and Jinora can project her spirit."
    },
    {
      "body": "Additionally, only three people are known to have used an airbending sub-skill: Guru Laghima and Zaheer were capable of flight, and Jinora can project her spirit.",
      "links": [],
      "section": [
        "Airbending",
        "Trivia"
      ],
      "text": "Additionally, only three people are known to have used an airbending sub-skill: Guru Laghima and Zaheer were capable of flight, and Jinora can project her spirit."
    },
    {
      "body": "Airbenders experience an increase in power during autumn.",
      "links": [],
      "section": [
        "Airbending",
        "Trivia"
      ],
      "text": "Airbenders experience an increase in power during autumn."
    },
    {
      "body": "${link_0}, the martial art upon which airbending is primarily based.",
      "links": [
        {
          "body": "Baguazhang",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Baguazhang",
            "page": "http://en.wikipedia.org/wiki/Baguazhang"
          }
        }
      ],
      "section": [
        "Airbending",
        "External links"
      ],
      "text": "Baguazhang, the martial art upon which airbending is primarily based."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Xingyiquan",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Xingyiquan",
            "page": "http://en.wikipedia.org/wiki/Xingyiquan"
          }
        }
      ],
      "section": [
        "Airbending",
        "External links"
      ],
      "text": "Xingyiquan"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Airbending",
    "file": "avatar.wikia.com/wiki/Airbending.html",
    "page": "Airbending",
    "title": "Airbending"
  }
}