{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "href": "Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Amon was a mysterious man who led the ${link_2} in a self-styled war against benders. As the former leader of a revolutionary organization, Amon utilized his abilities of manipulation to achieve great success, subverting nonbenders to his cause and ensuring that his enemies, and at one point ${link_3} ${link_4}, were too immobilized with terror to effectively combat his ${link_5}.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_2}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_4}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "revolution",
          "key": "${link_5}",
          "target": {
            "href": "Anti-bending_Revolution",
            "page": "Anti-bending_Revolution"
          }
        }
      ],
      "text": "This page is comprised of Amon's relationships with other characters in the World of Avatar. Amon was a mysterious man who led the Equalists in a self-styled war against benders. As the former leader of a revolutionary organization, Amon utilized his abilities of manipulation to achieve great success, subverting nonbenders to his cause and ensuring that his enemies, and at one point Avatar Korra, were too immobilized with terror to effectively combat his revolution."
    },
    {
      "body": "${link_0} and ${link_1} as children.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_1}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        }
      ],
      "text": "Amon and Tarrlok as children."
    },
    {
      "body": "Noatak was the older brother of ${link_0}, whom he protected when they were children. Noatak's urge to defend his brother against the world continued to the point where he stood up against their father, ${link_1}, when Tarrlok struggled to learn ${link_2} and later ${link_3}. Tarrlok noted that even as a child, Noatak wanted everyone to be treated equally and fairly. When Yakone forced Noatak and Tarrlok to bloodbend each other, Noatak complied. However, Tarrlok refused to bloodbend after experiencing the pain it caused, for which Yakone called him weak and threatened to beat him. Noatak intervened by bloodbending his father, denouncing him as the true weakling. He insisted that he and Tarrlok run away, but Tarrlok refused out of love for their mother. Noatak called his brother weak and he ran away from his family. Yakone and Tarrlok assumed that Noatak died in the blizzard and never heard from him again.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Yakone",
          "key": "${link_1}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_2}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "bloodbending",
          "key": "${link_3}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        }
      ],
      "text": "Noatak was the older brother of Tarrlok, whom he protected when they were children. Noatak's urge to defend his brother against the world continued to the point where he stood up against their father, Yakone, when Tarrlok struggled to learn waterbending and later bloodbending. Tarrlok noted that even as a child, Noatak wanted everyone to be treated equally and fairly. When Yakone forced Noatak and Tarrlok to bloodbend each other, Noatak complied. However, Tarrlok refused to bloodbend after experiencing the pain it caused, for which Yakone called him weak and threatened to beat him. Noatak intervened by bloodbending his father, denouncing him as the true weakling. He insisted that he and Tarrlok run away, but Tarrlok refused out of love for their mother. Noatak called his brother weak and he ran away from his family. Yakone and Tarrlok assumed that Noatak died in the blizzard and never heard from him again."
    },
    {
      "body": "Many years later, Noatak assumed the identity of Amon. Tarrlok had no knowledge that his brother was the leader of the Equalists and in order to gain power within the ${link_0}, he launched aggressive attacks against the Equalist Revolution and nonbenders. Amon, the ${link_1}, and some ${link_2} encountered Tarrlok as he was about to leave the cabin where he detained Korra. Threatening to take his ${link_3} ${link_4}, Tarrlok laughed at that statement and attempted to bloodbend them all. Albeit successfully subduing all of Amon's henchmen, Amon himself was able to resist Tarrlok's control. Unable to be detained, Amon easily subdued Tarrlok and took away his younger brother's bending.",
      "links": [
        {
          "body": "Council",
          "key": "${link_0}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "Lieutenant",
          "key": "${link_1}",
          "target": {
            "href": "Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "chi blockers",
          "key": "${link_2}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        },
        {
          "body": "bending",
          "key": "${link_3}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "away",
          "key": "${link_4}",
          "target": {
            "href": "Bloodbending#Bending_severing",
            "page": "Bloodbending"
          }
        }
      ],
      "text": "Many years later, Noatak assumed the identity of Amon. Tarrlok had no knowledge that his brother was the leader of the Equalists and in order to gain power within the Council, he launched aggressive attacks against the Equalist Revolution and nonbenders. Amon, the Lieutenant, and some chi blockers encountered Tarrlok as he was about to leave the cabin where he detained Korra. Threatening to take his bending away, Tarrlok laughed at that statement and attempted to bloodbend them all. Albeit successfully subduing all of Amon's henchmen, Amon himself was able to resist Tarrlok's control. Unable to be detained, Amon easily subdued Tarrlok and took away his younger brother's bending."
    },
    {
      "body": "After successfully occupying ${link_0}, Amon imprisoned his brother there so he could keep a close eye on him. While away, Tarrlok disclosed Amon's identity to Avatar Korra and ${link_1} out of disgust at what he and Noatak had become. Tarrlok explained that while Noatak based the revolution on a lie, he believed that Noatak thought bending was the source of the world's suffering based on their shared horrible past. Korra and Mako used this information to expose Amon in front of his supporters, causing him to lose the Revolution.",
      "links": [
        {
          "body": "Air Temple Island",
          "key": "${link_0}",
          "target": {
            "href": "Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "After successfully occupying Air Temple Island, Amon imprisoned his brother there so he could keep a close eye on him. While away, Tarrlok disclosed Amon's identity to Avatar Korra and Mako out of disgust at what he and Noatak had become. Tarrlok explained that while Noatak based the revolution on a lie, he believed that Noatak thought bending was the source of the world's suffering based on their shared horrible past. Korra and Mako used this information to expose Amon in front of his supporters, causing him to lose the Revolution."
    },
    {
      "body": "${link_0} and ${link_1} as adults.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_1}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        }
      ],
      "text": "Amon and Tarrlok as adults."
    },
    {
      "body": "When he escaped, Noatak swiftly returned to his brother and apologized for what he had done to him. Tarrlok apologized as well, saying he should have left with him when they were children. Noatak subsequently asked Tarrlok to escape with him, as he was the only thing he had left, and Tarrlok followed him away from Air Temple Island.",
      "links": [],
      "text": "When he escaped, Noatak swiftly returned to his brother and apologized for what he had done to him. Tarrlok apologized as well, saying he should have left with him when they were children. Noatak subsequently asked Tarrlok to escape with him, as he was the only thing he had left, and Tarrlok followed him away from Air Temple Island."
    },
    {
      "body": "Together, they left Republic City on an Equalist outboard motor boat. Noatak, who was driving the boat, cheerfully spoke of their reunion and future, even commenting that he forgot the sound of his own name. Tarrlok assured him that things would be like \"the old days\", which brought a tear to Noatak's eyes. However, Tarrlok used an ${link_0} he found on the boat to electrocute the fuel tank, killing himself and his brother in the resulting explosion.",
      "links": [
        {
          "body": "electrified glove",
          "key": "${link_0}",
          "target": {
            "href": "Electrified_glove",
            "page": "Electrified_glove"
          }
        }
      ],
      "text": "Together, they left Republic City on an Equalist outboard motor boat. Noatak, who was driving the boat, cheerfully spoke of their reunion and future, even commenting that he forgot the sound of his own name. Tarrlok assured him that things would be like \"the old days\", which brought a tear to Noatak's eyes. However, Tarrlok used an electrified glove he found on the boat to electrocute the fuel tank, killing himself and his brother in the resulting explosion."
    },
    {
      "body": "${link_0} and a young ${link_1}.",
      "links": [
        {
          "body": "Yakone",
          "key": "${link_0}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        },
        {
          "body": "Amon",
          "key": "${link_1}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        }
      ],
      "text": "Yakone and a young Amon."
    },
    {
      "body": "Noatak was the favored son of Yakone, but often disagreed with his father's verbal abuse toward Tarrlok. Yakone brought his sons on many hunting trips and taught them the art of bloodbending. In one incident, Yakone forced his sons to bloodbend each other. Tarrlok refused and Noatak defended him, even bloodbending his own father; this resulted in Noatak running away from the Northern Water Tribe and soon became the leader of the Equalists. Yakone and Tarrlok spent many days looking for Noatak, but they never found him, assuming he died in a blizzard. Yakone died several years later.",
      "links": [],
      "text": "Noatak was the favored son of Yakone, but often disagreed with his father's verbal abuse toward Tarrlok. Yakone brought his sons on many hunting trips and taught them the art of bloodbending. In one incident, Yakone forced his sons to bloodbend each other. Tarrlok refused and Noatak defended him, even bloodbending his own father; this resulted in Noatak running away from the Northern Water Tribe and soon became the leader of the Equalists. Yakone and Tarrlok spent many days looking for Noatak, but they never found him, assuming he died in a blizzard. Yakone died several years later."
    },
    {
      "body": "According to Tarrlok, their mother was a \"warm, caring woman\" who had a deep love for her sons and husband. However, unlike Tarrlok, Noatak did not seem to care about the effect that running away would have on their mother. When Noatak ran away, she was never the same again.",
      "links": [],
      "text": "According to Tarrlok, their mother was a \"warm, caring woman\" who had a deep love for her sons and husband. However, unlike Tarrlok, Noatak did not seem to care about the effect that running away would have on their mother. When Noatak ran away, she was never the same again."
    },
    {
      "body": "${link_0} and his ${link_1}.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_1}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        }
      ],
      "text": "Amon and his Equalists."
    },
    {
      "body": "Amon was the leader of the Equalists, a group of activists who believed that everyone should be equal and wanted to eliminate bending from the world. He commanded them and seemed to have taught them a fighting style known as ${link_0}. They were known to go to extremes for their cause, with Amon blocking bending and attacking Republic City in the name of the Equalists.",
      "links": [
        {
          "body": "chi blocking",
          "key": "${link_0}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        }
      ],
      "text": "Amon was the leader of the Equalists, a group of activists who believed that everyone should be equal and wanted to eliminate bending from the world. He commanded them and seemed to have taught them a fighting style known as chi blocking. They were known to go to extremes for their cause, with Amon blocking bending and attacking Republic City in the name of the Equalists."
    },
    {
      "body": "Amon's reputation was ruined after his supporters witnessed him waterbending after the ${link_0}.",
      "links": [
        {
          "body": "Equalist victory rally",
          "key": "${link_0}",
          "target": {
            "href": "Equalist_victory_rally",
            "page": "Equalist_victory_rally"
          }
        }
      ],
      "text": "Amon's reputation was ruined after his supporters witnessed him waterbending after the Equalist victory rally."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_1}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        }
      ],
      "text": "Amon and Hiroshi Sato."
    },
    {
      "body": "After the murder of ${link_0}, his wife, at the hands of the ${link_1}, ${link_2} developed a hatred toward benders and became a staunch believer of the ideas Amon stood for, pledging his loyalty to Amon's cause. Sato began manufacturing weapons for the Equalist regime in a ${link_3} concealed under his ${link_4}. Due to his ingenuity, the Equalists' weapon arsenal consisted of the electrified gloves, ${link_5}, and ${link_6}.",
      "links": [
        {
          "body": "Yasuko",
          "key": "${link_0}",
          "target": {
            "href": "Yasuko",
            "page": "Yasuko"
          }
        },
        {
          "body": "Agni Kai Triad",
          "key": "${link_1}",
          "target": {
            "href": "Agni_Kai_Triad",
            "page": "Agni_Kai_Triad"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_2}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "secret factory",
          "key": "${link_3}",
          "target": {
            "href": "Equalist_factory",
            "page": "Equalist_factory"
          }
        },
        {
          "body": "private estate",
          "key": "${link_4}",
          "target": {
            "href": "Sato_estate",
            "page": "Sato_estate"
          }
        },
        {
          "body": "mecha tanks",
          "key": "${link_5}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "biplanes",
          "key": "${link_6}",
          "target": {
            "href": "Biplane",
            "page": "Biplane"
          }
        }
      ],
      "text": "After the murder of Yasuko, his wife, at the hands of the Agni Kai Triad, Hiroshi Sato developed a hatred toward benders and became a staunch believer of the ideas Amon stood for, pledging his loyalty to Amon's cause. Sato began manufacturing weapons for the Equalist regime in a secret factory concealed under his private estate. Due to his ingenuity, the Equalists' weapon arsenal consisted of the electrified gloves, mecha tanks, and biplanes."
    },
    {
      "body": "Hiroshi served as one of Amon's right hand men, and Amon perceived Hiroshi to be one of the Equalists' most useful supporters as well as a valuable asset to the Equalist movement. The extent of their relationship with each other was through Amon's assurances that Hiroshi would have his ${link_0} back soon.",
      "links": [
        {
          "body": "daughter",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "text": "Hiroshi served as one of Amon's right hand men, and Amon perceived Hiroshi to be one of the Equalists' most useful supporters as well as a valuable asset to the Equalist movement. The extent of their relationship with each other was through Amon's assurances that Hiroshi would have his daughter back soon."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Lieutenant",
          "key": "${link_0}",
          "target": {
            "href": "Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "Amon",
          "key": "${link_1}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        }
      ],
      "text": "Lieutenant and Amon."
    },
    {
      "body": "As his right hand and the second in command over the Equalist troops, Amon and his lieutenant had a relation of trust with each other. The leader often trusted him to gather certain intel or perform other various tasks that would aid him in his war for equality. The Lieutenant was usually the one in charge of communicating Amon the news about the progress of the mission and their enemies' moves. Like Amon, the Lieutenant had a hatred for benders and believed that there was no longer a place in the world for them. He was willing to follow Amon's orders and did so without question. Like the other Equalists, the Lieutenant accompanied Amon in public appearances as well as fights against his enemies, such as during the ${link_0}.",
      "links": [
        {
          "body": "Attack on the Pro-bending Arena",
          "key": "${link_0}",
          "target": {
            "href": "Attack_on_the_Pro-bending_Arena",
            "page": "Attack_on_the_Pro-bending_Arena"
          }
        }
      ],
      "text": "As his right hand and the second in command over the Equalist troops, Amon and his lieutenant had a relation of trust with each other. The leader often trusted him to gather certain intel or perform other various tasks that would aid him in his war for equality. The Lieutenant was usually the one in charge of communicating Amon the news about the progress of the mission and their enemies' moves. Like Amon, the Lieutenant had a hatred for benders and believed that there was no longer a place in the world for them. He was willing to follow Amon's orders and did so without question. Like the other Equalists, the Lieutenant accompanied Amon in public appearances as well as fights against his enemies, such as during the Attack on the Pro-bending Arena."
    },
    {
      "body": "The Lieutenant found out about Amon's true identity and saw this as a betrayal to him and the Equalists, believing Amon to be nothing more than a liar and a hypocrite. He attempted to attack Amon, but the latter used his bloodbending to hurl the lieutenant into a pile of wooden posts. However, before that, he thanked the Lieutenant for his services.",
      "links": [],
      "text": "The Lieutenant found out about Amon's true identity and saw this as a betrayal to him and the Equalists, believing Amon to be nothing more than a liar and a hypocrite. He attempted to attack Amon, but the latter used his bloodbending to hurl the lieutenant into a pile of wooden posts. However, before that, he thanked the Lieutenant for his services."
    },
    {
      "body": "${link_0} removing ${link_1}'s ${link_2}.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Lightning Bolt Zolt",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_Bolt_Zolt",
            "page": "Lightning_Bolt_Zolt"
          }
        },
        {
          "body": "bending",
          "key": "${link_2}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "Amon removing Lightning Bolt Zolt's bending."
    },
    {
      "body": "Amon had an intense hatred for benders that first developed from his antagonistic feelings toward his father, who forced him and his brother to bloodbend animals and eventually each other. Years later, Amon had become the leader of the Equalists and, after gathering enough members, launched an Anti-bending Revolution to rid Republic City and eventually the world of all benders. When Avatar Korra came to Republic City, Amon unveiled his ability to take away a person's bending, forever striking fear into the heart of all benders in Republic City. Amon would have stopped at nothing to ensure that all benders were removed from the world in the name of equality. Amon's desire for equality was reflected in his methods, as he never killed anyone, he only removed their bending.",
      "links": [],
      "text": "Amon had an intense hatred for benders that first developed from his antagonistic feelings toward his father, who forced him and his brother to bloodbend animals and eventually each other. Years later, Amon had become the leader of the Equalists and, after gathering enough members, launched an Anti-bending Revolution to rid Republic City and eventually the world of all benders. When Avatar Korra came to Republic City, Amon unveiled his ability to take away a person's bending, forever striking fear into the heart of all benders in Republic City. Amon would have stopped at nothing to ensure that all benders were removed from the world in the name of equality. Amon's desire for equality was reflected in his methods, as he never killed anyone, he only removed their bending."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Amon and Korra."
    },
    {
      "body": "Since Amon felt the Avatar had failed humanity and that bending was the ultimate cause of suffering in the world, Korra, as the Avatar and the ultimate bender, was his natural opponent in his strife for a world deprived of benders. Amon met Korra for the first time when he ambushed her at ${link_0} after she challenged him to a duel. Although he had her right where he wanted her, he decided not to take away her bending, reasoning that would effectively make her a martyr for the other benders of the world, though nonetheless threatened to destroy her another time. Despite his animosity toward her, Amon acknowledged Korra's bending abilities, as he warned the Lieutenant and the other Equalists not to underestimate her when attempting to retrieve her from the metal box in which Tarrlok imprisoned her.",
      "links": [
        {
          "body": "Aang Memorial Island",
          "key": "${link_0}",
          "target": {
            "href": "Aang_Memorial_Island",
            "page": "Aang_Memorial_Island"
          }
        }
      ],
      "text": "Since Amon felt the Avatar had failed humanity and that bending was the ultimate cause of suffering in the world, Korra, as the Avatar and the ultimate bender, was his natural opponent in his strife for a world deprived of benders. Amon met Korra for the first time when he ambushed her at Aang Memorial Island after she challenged him to a duel. Although he had her right where he wanted her, he decided not to take away her bending, reasoning that would effectively make her a martyr for the other benders of the world, though nonetheless threatened to destroy her another time. Despite his animosity toward her, Amon acknowledged Korra's bending abilities, as he warned the Lieutenant and the other Equalists not to underestimate her when attempting to retrieve her from the metal box in which Tarrlok imprisoned her."
    },
    {
      "body": "${link_0} utilizing ${link_1} against ${link_2}.",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "lightning",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "Amon",
          "key": "${link_2}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        }
      ],
      "text": "Mako utilizing lightning against Amon."
    },
    {
      "body": "Mako is a firebender, and as a result, was an enemy of Amon. After Amon took Korra's bending away at the Equalist victory rally, he proceeded to take Mako's bending as well. However, Mako quickly blasted Amon with ${link_0}, knocking him back long enough for Mako to grab Korra and attempt to run away. Mako was quickly caught again by Amon, who stated that the firebender's quick thinking impressed him, and that it was \"almost a shame to take the bending of someone so talented.\" After Amon was knocked out the window and exposed as a waterbender by Korra, he dodged Mako's firebending and quickly escaped.",
      "links": [
        {
          "body": "lightning",
          "key": "${link_0}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        }
      ],
      "text": "Mako is a firebender, and as a result, was an enemy of Amon. After Amon took Korra's bending away at the Equalist victory rally, he proceeded to take Mako's bending as well. However, Mako quickly blasted Amon with lightning, knocking him back long enough for Mako to grab Korra and attempt to run away. Mako was quickly caught again by Amon, who stated that the firebender's quick thinking impressed him, and that it was \"almost a shame to take the bending of someone so talented.\" After Amon was knocked out the window and exposed as a waterbender by Korra, he dodged Mako's firebending and quickly escaped."
    },
    {
      "body": "As the city's main guard, ${link_0} and her ${link_1} tried to stop all threats in Republic City. Being one of Amon's natural enemies, they tried to stop Amon at all costs. After being captured in the ${link_2}, the Equalists mentioned that the officers would be taken to Amon. However, after the escape, Lin Beifong decided to resign from her duty as ${link_3} in order to pursue Amon without the law restraining her actions. The captured officers' bending were all stripped before Lin Beifong broke them out.",
      "links": [
        {
          "body": "Lin Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "officers",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "battle at the Equalist factory",
          "key": "${link_2}",
          "target": {
            "href": "Battle_at_the_Equalist_factory",
            "page": "Battle_at_the_Equalist_factory"
          }
        },
        {
          "body": "Chief of Police",
          "key": "${link_3}",
          "target": {
            "href": "Chief_of_Police",
            "page": "Chief_of_Police"
          }
        }
      ],
      "text": "As the city's main guard, Lin Beifong and her officers tried to stop all threats in Republic City. Being one of Amon's natural enemies, they tried to stop Amon at all costs. After being captured in the battle at the Equalist factory, the Equalists mentioned that the officers would be taken to Amon. However, after the escape, Lin Beifong decided to resign from her duty as Chief of Police in order to pursue Amon without the law restraining her actions. The captured officers' bending were all stripped before Lin Beifong broke them out."
    },
    {
      "body": "${link_0} removing ${link_1}'s bending.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Tahno",
          "key": "${link_1}",
          "target": {
            "href": "Tahno",
            "page": "Tahno"
          }
        }
      ],
      "text": "Amon removing Tahno's bending."
    },
    {
      "body": "As a pro-bending team, the Wolfbats were enemies of Amon. During the ${link_0}, Amon and several Equalists appeared before the Wolfbats. The Wolfbats tried to fight them off, but were effortlessly defeated. Tahno attempted to beg for Amon not take his bending away, even going as far as to offer the championship winnings. After taking their bending, Amon dumped the Wolfbats into the drink. During Amon's speech, he spoke about the Wolfbats, claiming that it was fitting that the benders in the audience celebrated \"three bullies who cheated their way to victory,\" since they threatened and abused nonbenders every single day. He also mentioned that \"cleansing them of their impurity\" only took him mere moments, even though they were considered the best in the bending world. He used this as a warning to all other benders, threatening to do the same to them if they stood in his way.",
      "links": [
        {
          "body": "Attack on the Pro-bending Arena",
          "key": "${link_0}",
          "target": {
            "href": "Attack_on_the_Pro-bending_Arena",
            "page": "Attack_on_the_Pro-bending_Arena"
          }
        }
      ],
      "text": "As a pro-bending team, the Wolfbats were enemies of Amon. During the Attack on the Pro-bending Arena, Amon and several Equalists appeared before the Wolfbats. The Wolfbats tried to fight them off, but were effortlessly defeated. Tahno attempted to beg for Amon not take his bending away, even going as far as to offer the championship winnings. After taking their bending, Amon dumped the Wolfbats into the drink. During Amon's speech, he spoke about the Wolfbats, claiming that it was fitting that the benders in the audience celebrated \"three bullies who cheated their way to victory,\" since they threatened and abused nonbenders every single day. He also mentioned that \"cleansing them of their impurity\" only took him mere moments, even though they were considered the best in the bending world. He used this as a warning to all other benders, threatening to do the same to them if they stood in his way."
    },
    {
      "body": "As the city's number one public enemy, Amon viewed the Council as a threat to his plans. When he demanded to close down the Pro-bending Arena, the Council almost complied to his demand, but, after Lin Beifong's intervention, the councilors changed their minds and brushed his warning aside. However, this move played right into Amon's hands as it allowed him to publicly demonstrate his power to take bending away. The council was powerless to stop him and failed to apprehend him afterward.",
      "links": [],
      "text": "As the city's number one public enemy, Amon viewed the Council as a threat to his plans. When he demanded to close down the Pro-bending Arena, the Council almost complied to his demand, but, after Lin Beifong's intervention, the councilors changed their minds and brushed his warning aside. However, this move played right into Amon's hands as it allowed him to publicly demonstrate his power to take bending away. The council was powerless to stop him and failed to apprehend him afterward."
    },
    {
      "body": "Later, Amon began his attack to take over Republic City, commanding Equalists to take out the members of the Council. The Equalists only failed to capture Tenzin and, for a time, he was the only remaining Council member. Later, however, Tenzin attempted to escape with his family, and Lin Beifong sacrificed herself to save the ${link_0}. However, this was not enough, as the family was eventually captured. Amon later showed his intent to remove Tenzin and his children's bending during an Equalist rally, but was interrupted by Korra and Mako, who freed the Council member and his family.",
      "links": [
        {
          "body": "airbenders",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Later, Amon began his attack to take over Republic City, commanding Equalists to take out the members of the Council. The Equalists only failed to capture Tenzin and, for a time, he was the only remaining Council member. Later, however, Tenzin attempted to escape with his family, and Lin Beifong sacrificed herself to save the airbenders. However, this was not enough, as the family was eventually captured. Amon later showed his intent to remove Tenzin and his children's bending during an Equalist rally, but was interrupted by Korra and Mako, who freed the Council member and his family."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Amon%27s_relationships",
    "file": "avatar.wikia.com/wiki/Amon's_relationships.html",
    "page": "Amon's_relationships",
    "title": "Amon's relationships"
  }
}