{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "href": "Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "This page is comprised of Appa's relationships with other characters in the World of Avatar."
    },
    {
      "body": "A young ${link_0} took flight with ${link_1} and siblings.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "his mother",
          "key": "${link_1}",
          "target": {
            "href": "Appa%27s_mother",
            "page": "Appa%27s_mother"
          }
        }
      ],
      "text": "A young Appa took flight with his mother and siblings."
    },
    {
      "body": "When Appa was young, he seemed to have a close bond with ${link_0} and siblings. They would fly in the sky, eat, and play together frequently. However, he never saw his family again after he escaped with his lifelong companion, ${link_1}, and was encased in an iceberg for a century, as they were among the many victims of the ${link_2}.",
      "links": [
        {
          "body": "his mother",
          "key": "${link_0}",
          "target": {
            "href": "Appa%27s_mother",
            "page": "Appa%27s_mother"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Air Nomad Genocide",
          "key": "${link_2}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        }
      ],
      "text": "When Appa was young, he seemed to have a close bond with his mother and siblings. They would fly in the sky, eat, and play together frequently. However, he never saw his family again after he escaped with his lifelong companion, Aang, and was encased in an iceberg for a century, as they were among the many victims of the Air Nomad Genocide."
    },
    {
      "body": "Having only known ${link_0} for a short period of time, Appa was widely unfamiliar with him. When ${link_1} and Aang left to find ${link_2} and ${link_3} in ${link_4}, Sokka ordered Appa to take command of affairs that occurred around camp. Taking this position seriously, Appa settled an argument between Hawky and ${link_5}. The two never formally interacted with each other afterward following Hawky's leave of absence from the team.",
      "links": [
        {
          "body": "Hawky",
          "key": "${link_0}",
          "target": {
            "href": "Hawky",
            "page": "Hawky"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Toph",
          "key": "${link_2}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Fire Fountain City",
          "key": "${link_4}",
          "target": {
            "href": "Fire_Fountain_City",
            "page": "Fire_Fountain_City"
          }
        },
        {
          "body": "Momo",
          "key": "${link_5}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "Having only known Hawky for a short period of time, Appa was widely unfamiliar with him. When Sokka and Aang left to find Toph and Katara in Fire Fountain City, Sokka ordered Appa to take command of affairs that occurred around camp. Taking this position seriously, Appa settled an argument between Hawky and Momo. The two never formally interacted with each other afterward following Hawky's leave of absence from the team."
    },
    {
      "body": "${link_0} dreamt of ${link_1} during their separation after Appa's kidnapping.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Momo dreamt of Appa during their separation after Appa's kidnapping."
    },
    {
      "body": "Appa and Momo shared a strong animal bond and companionship with one another, despite an occasional squabble over who got the largest piece of food. They took an immediate liking to each other from the moment they met, a bond that only intensified throughout their journey together. Their close relationship was emphasized when they got separated from each other in the ${link_0}: when they managed to escape the maze of tunnels, Momo and Appa immediately reconnected with each other and regaled, in their own way, their adventure to the other.",
      "links": [
        {
          "body": "Cave of Two Lovers",
          "key": "${link_0}",
          "target": {
            "href": "Cave_of_Two_Lovers",
            "page": "Cave_of_Two_Lovers"
          }
        }
      ],
      "text": "Appa and Momo shared a strong animal bond and companionship with one another, despite an occasional squabble over who got the largest piece of food. They took an immediate liking to each other from the moment they met, a bond that only intensified throughout their journey together. Their close relationship was emphasized when they got separated from each other in the Cave of Two Lovers: when they managed to escape the maze of tunnels, Momo and Appa immediately reconnected with each other and regaled, in their own way, their adventure to the other."
    },
    {
      "body": "${link_0} and ${link_1} reunited during ${link_2}'s search for ${link_3}.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Nyla",
          "key": "${link_1}",
          "target": {
            "href": "Nyla",
            "page": "Nyla"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_2}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_3}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Appa and Nyla reunited during Zuko's search for Iroh."
    },
    {
      "body": "Upon their first encounter, Appa and ${link_0} were natural enemies, battling each other intensely in the ${link_1}. The ${link_2} repeatedly lashed out, using the paralyzing neurotoxins within his tongue to immobilize the bison. Appa retaliated by sending powerful gusts of ${link_3} at his opponent. They eventually became friendlier with each other, even nuzzling together and licking each other.",
      "links": [
        {
          "body": "Nyla",
          "key": "${link_0}",
          "target": {
            "href": "Nyla",
            "page": "Nyla"
          }
        },
        {
          "body": "abbey",
          "key": "${link_1}",
          "target": {
            "href": "Abbey",
            "page": "Abbey"
          }
        },
        {
          "body": "shirshu",
          "key": "${link_2}",
          "target": {
            "href": "Shirshu",
            "page": "Shirshu"
          }
        },
        {
          "body": "air",
          "key": "${link_3}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Upon their first encounter, Appa and Nyla were natural enemies, battling each other intensely in the abbey. The shirshu repeatedly lashed out, using the paralyzing neurotoxins within his tongue to immobilize the bison. Appa retaliated by sending powerful gusts of air at his opponent. They eventually became friendlier with each other, even nuzzling together and licking each other."
    },
    {
      "body": "${link_0} was ${link_1}'s close friend.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Appa was Aang's close friend."
    },
    {
      "body": "Aang viewed Appa not merely as a pet sky bison and primary means of transportation but as a close friend as well. The two shared a bond that traced back to Appa's years as a calf, where Aang and several other children were told \"a sky bison is a companion for life.\" Appa quickly bonded with Aang, showing his affection by nuzzling and licking him. Aang promised Appa they would always be together. After escaping from the sandbenders, Appa wished immensely to be reunited with Aang. When they were finally reunited after weeks apart, both were overjoyed to see each other.",
      "links": [],
      "text": "Aang viewed Appa not merely as a pet sky bison and primary means of transportation but as a close friend as well. The two shared a bond that traced back to Appa's years as a calf, where Aang and several other children were told \"a sky bison is a companion for life.\" Appa quickly bonded with Aang, showing his affection by nuzzling and licking him. Aang promised Appa they would always be together. After escaping from the sandbenders, Appa wished immensely to be reunited with Aang. When they were finally reunited after weeks apart, both were overjoyed to see each other."
    },
    {
      "body": "Appa's loyalty and obedience to Aang was evidenced through his actions; he responded quickly when summoned and never hesitated to battle anyone who attempted to attack Aang.",
      "links": [],
      "text": "Appa's loyalty and obedience to Aang was evidenced through his actions; he responded quickly when summoned and never hesitated to battle anyone who attempted to attack Aang."
    },
    {
      "body": "Appa was the first member of ${link_0} that ${link_1} ever laid eyes on, besides his two children. Hakoda sighted Appa when the lone bison was flying in the air in search of Aang. Not knowing the identity of Appa, Hakoda merely gazed in awe at the sight of the giant flying bison.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Hakoda",
          "key": "${link_1}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        }
      ],
      "text": "Appa was the first member of Team Avatar that Hakoda ever laid eyes on, besides his two children. Hakoda sighted Appa when the lone bison was flying in the air in search of Aang. Not knowing the identity of Appa, Hakoda merely gazed in awe at the sight of the giant flying bison."
    },
    {
      "body": "Hakoda briefly met Appa as a member of Team Avatar when Aang arrived to Chameleon Bay after seeing his vision of Katara in trouble.",
      "links": [],
      "text": "Hakoda briefly met Appa as a member of Team Avatar when Aang arrived to Chameleon Bay after seeing his vision of Katara in trouble."
    },
    {
      "body": "${link_0} believed ${link_1} was capable of flight from the beginning.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Katara believed Appa was capable of flight from the beginning."
    },
    {
      "body": "From when she first first met him, Katara and Appa shared a strong relationship, with the ${link_0} expressing little doubt of Appa's flying skills, despite Sokka's claims. When Aang was later captured by Zuko, she trusted in Appa's capabilities to fly and help them rescue Aang. When Aang and Sokka were about to leave with Appa, separating the group, Katara hugged Appa, before being approached by Aang. Their relationship remained firm with Appa deeming Katara a kind caretaker, specifically exemplified when he allowed her and Zuko to ride him even with Aang absent. She showed concern for Appa upon learning of his capture by the sandbenders and joy once reunited with him.",
      "links": [
        {
          "body": "waterbender",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "From when she first first met him, Katara and Appa shared a strong relationship, with the waterbender expressing little doubt of Appa's flying skills, despite Sokka's claims. When Aang was later captured by Zuko, she trusted in Appa's capabilities to fly and help them rescue Aang. When Aang and Sokka were about to leave with Appa, separating the group, Katara hugged Appa, before being approached by Aang. Their relationship remained firm with Appa deeming Katara a kind caretaker, specifically exemplified when he allowed her and Zuko to ride him even with Aang absent. She showed concern for Appa upon learning of his capture by the sandbenders and joy once reunited with him."
    },
    {
      "body": "${link_0} and ${link_1} eventually grew close.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Sokka and Appa eventually grew close."
    },
    {
      "body": "Sokka disliked Appa upon first meeting him, calling him a \"fluffy snot monster\" after the bison sneezed on him. He was skeptical of Appa's flying abilities until he himself witnessed the bison's abilities and was amazed by them. Over time, Appa and Sokka bonded considerably to the extent where Sokka impressed ${link_0} by showing off the bison. Although sometimes critical of Appa's flying skills, the two shared a firm bond. Like the other members of Team Avatar, Sokka was elated when reuniting with the bison outside ${link_1}. When Aang disappeared under mysterious circumstances, Sokka and Appa searched the skies for Aang.",
      "links": [
        {
          "body": "Yue",
          "key": "${link_0}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Lake Laogai",
          "key": "${link_1}",
          "target": {
            "href": "Lake_Laogai",
            "page": "Lake_Laogai"
          }
        }
      ],
      "text": "Sokka disliked Appa upon first meeting him, calling him a \"fluffy snot monster\" after the bison sneezed on him. He was skeptical of Appa's flying abilities until he himself witnessed the bison's abilities and was amazed by them. Over time, Appa and Sokka bonded considerably to the extent where Sokka impressed Yue by showing off the bison. Although sometimes critical of Appa's flying skills, the two shared a firm bond. Like the other members of Team Avatar, Sokka was elated when reuniting with the bison outside Lake Laogai. When Aang disappeared under mysterious circumstances, Sokka and Appa searched the skies for Aang."
    },
    {
      "body": "${link_0} tended to ${link_1}.",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Suki tended to Appa."
    },
    {
      "body": "Appa first met ${link_0} when he, Aang, Sokka, and Katara visited ${link_1}. Later, Suki discovered Appa in a shelter after he had run off from the ${link_2}. She gently and carefully presented him with berries and reassured him that she would come right back with help. A few minutes later, she brought along her fellow ${link_3} to tend to Appa. Gaining his trust, the warriors bathed Appa shortly after approaching him. They washed him and pampered him until he was rid of the needles embedded in his skin and the dirt covering his fur. Minutes later, ${link_4}, ${link_5}, and ${link_6} presented themselves, riding on ${link_7}. The ${link_8} ${link_9} and her team began to battle the warriors attempting to capture them. Appa tried to assist Suki and her warriors, but the fire that Azula produced frightened him. Suki shouted and yelled at Appa to fly away and escape, chasing him off with a burning branch. Torn between helping Suki and finding Aang, the bison flew off into the distance.",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "circus",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation_circus",
            "page": "Fire_Nation_circus"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_3}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Azula",
          "key": "${link_4}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_5}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Mai",
          "key": "${link_6}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "mongoose lizards",
          "key": "${link_7}",
          "target": {
            "href": "Mongoose_lizard",
            "page": "Mongoose_lizard"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_8}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "princess",
          "key": "${link_9}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "text": "Appa first met Suki when he, Aang, Sokka, and Katara visited Kyoshi Island. Later, Suki discovered Appa in a shelter after he had run off from the circus. She gently and carefully presented him with berries and reassured him that she would come right back with help. A few minutes later, she brought along her fellow Kyoshi Warriors to tend to Appa. Gaining his trust, the warriors bathed Appa shortly after approaching him. They washed him and pampered him until he was rid of the needles embedded in his skin and the dirt covering his fur. Minutes later, Azula, Ty Lee, and Mai presented themselves, riding on mongoose lizards. The Fire Nation princess and her team began to battle the warriors attempting to capture them. Appa tried to assist Suki and her warriors, but the fire that Azula produced frightened him. Suki shouted and yelled at Appa to fly away and escape, chasing him off with a burning branch. Torn between helping Suki and finding Aang, the bison flew off into the distance."
    },
    {
      "body": "${link_0} and ${link_1} waited outside ${link_2} for the rest of ${link_3}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Wan Shi Tong's Library",
          "key": "${link_2}",
          "target": {
            "href": "Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Toph and Appa waited outside Wan Shi Tong's Library for the rest of Team Avatar."
    },
    {
      "body": "Toph and Appa's relationship got off to a rough start after Toph angrily, though correctly, blamed Appa for their situation when they were being tracked: Appa's shed fur was leaving a distinct trail, allowing Azula to track the team's precise location. Toph also had a natural dislike for flying, preferring instead to remain rooted to the earth. Their relationship improved over time, however, and upon visiting ${link_0}'s ${link_1}, Toph attempted to engage the bison in conversation when the two of them remained outside; she was also deeply upset after his capture by the sandbenders. Toph and Appa's relationship improved further after Appa's return to the group in Lake Laogai.",
      "links": [
        {
          "body": "Wan Shi Tong",
          "key": "${link_0}",
          "target": {
            "href": "Wan_Shi_Tong",
            "page": "Wan_Shi_Tong"
          }
        },
        {
          "body": "Library",
          "key": "${link_1}",
          "target": {
            "href": "Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        }
      ],
      "text": "Toph and Appa's relationship got off to a rough start after Toph angrily, though correctly, blamed Appa for their situation when they were being tracked: Appa's shed fur was leaving a distinct trail, allowing Azula to track the team's precise location. Toph also had a natural dislike for flying, preferring instead to remain rooted to the earth. Their relationship improved over time, however, and upon visiting Wan Shi Tong's Library, Toph attempted to engage the bison in conversation when the two of them remained outside; she was also deeply upset after his capture by the sandbenders. Toph and Appa's relationship improved further after Appa's return to the group in Lake Laogai."
    },
    {
      "body": "${link_0} licked the ${link_1}'s face in gratitude.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "young boy",
          "key": "${link_1}",
          "target": {
            "href": "Unnamed_Fire_Nation_boy",
            "page": "Unnamed_Fire_Nation_boy"
          }
        }
      ],
      "text": "Appa licked the young boy's face in gratitude."
    },
    {
      "body": "After being captured by sandbenders in the ${link_0}, Appa was sold to the Fire Nation circus by ${link_1}. The circus trainer brutalized Appa, refusing to feed him and threatening him using merciless displays of ${link_2}. On one occasion, when the circus trainer left briefly, a ${link_3} secretly entered the circus tent and fed Appa a bale of hay. Appa licked him to show his appreciation. The boy fled the circus tent upon the return of the circus trainer. During a circus performance that evening, Appa was dressed in a ridiculous costume and cruelly forced to obey the trainer's commands. Seeing the torture the bison was forced to endure, the young boy encouraged Appa to escape. The boy reminded Appa of Aang, and the sky bison followed his advice, flying away from the circus.",
      "links": [
        {
          "body": "Si Wong Desert",
          "key": "${link_0}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        },
        {
          "body": "beetle-headed merchants",
          "key": "${link_1}",
          "target": {
            "href": "Beetle-headed_merchants",
            "page": "Beetle-headed_merchants"
          }
        },
        {
          "body": "firebending",
          "key": "${link_2}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "young boy",
          "key": "${link_3}",
          "target": {
            "href": "Unnamed_Fire_Nation_boy",
            "page": "Unnamed_Fire_Nation_boy"
          }
        }
      ],
      "text": "After being captured by sandbenders in the Si Wong Desert, Appa was sold to the Fire Nation circus by beetle-headed merchants. The circus trainer brutalized Appa, refusing to feed him and threatening him using merciless displays of firebending. On one occasion, when the circus trainer left briefly, a young boy secretly entered the circus tent and fed Appa a bale of hay. Appa licked him to show his appreciation. The boy fled the circus tent upon the return of the circus trainer. During a circus performance that evening, Appa was dressed in a ridiculous costume and cruelly forced to obey the trainer's commands. Seeing the torture the bison was forced to endure, the young boy encouraged Appa to escape. The boy reminded Appa of Aang, and the sky bison followed his advice, flying away from the circus."
    },
    {
      "body": "${link_0} licked ${link_1}, recognizing him as the one who rescued him from ${link_2}.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Lake Laogai",
          "key": "${link_2}",
          "target": {
            "href": "Lake_Laogai",
            "page": "Lake_Laogai"
          }
        }
      ],
      "text": "Appa licked Zuko, recognizing him as the one who rescued him from Lake Laogai."
    },
    {
      "body": "Having previously been an enemy of Team Avatar, Zuko was originally a natural enemy of Appa. In ${link_0}, Zuko freed Appa from the ${link_1} headquarters, gaining the bison's trust. Appa was the first to approve of Zuko's acceptance into Team Avatar, expressing this approval through licking him. Appa's approval of Zuko was one reason why Aang and the others accepted him into the group. Prior to the arrival of ${link_2}, Appa grew comfortable with Zuko's presence to the extent where he permitted Zuko to steer him along their travels.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_1}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_2}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "text": "Having previously been an enemy of Team Avatar, Zuko was originally a natural enemy of Appa. In Ba Sing Se, Zuko freed Appa from the Dai Li headquarters, gaining the bison's trust. Appa was the first to approve of Zuko's acceptance into Team Avatar, expressing this approval through licking him. Appa's approval of Zuko was one reason why Aang and the others accepted him into the group. Prior to the arrival of Sozin's Comet, Appa grew comfortable with Zuko's presence to the extent where he permitted Zuko to steer him along their travels."
    },
    {
      "body": "The ${link_0} threatened a caged ${link_1}.",
      "links": [
        {
          "body": "circus trainer",
          "key": "${link_0}",
          "target": {
            "href": "Circus_trainer",
            "page": "Circus_trainer"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "The circus trainer threatened a caged Appa."
    },
    {
      "body": "After determining that Appa's perceived ferocious nature would prove to be too much of a burden to handle, the beetle-headed merchants sold him to a traveling circus. There, Appa was placed under the care of a cruel and merciless circus trainer who promised to break the bison to his will. The trainer was abusive toward Appa, keeping him locked in a tight cage with his legs chained together, refusing to feed him and threatening him with firebending. On the night of a circus performance, the trainer dressed him in a ridiculous outfit and once again displayed his abusive nature, frequently striking the bison with a fire whip. Appa was able to escape the circus that evening. His treatment at the circus caused him to become pyrophobic.",
      "links": [],
      "text": "After determining that Appa's perceived ferocious nature would prove to be too much of a burden to handle, the beetle-headed merchants sold him to a traveling circus. There, Appa was placed under the care of a cruel and merciless circus trainer who promised to break the bison to his will. The trainer was abusive toward Appa, keeping him locked in a tight cage with his legs chained together, refusing to feed him and threatening him with firebending. On the night of a circus performance, the trainer dressed him in a ridiculous outfit and once again displayed his abusive nature, frequently striking the bison with a fire whip. Appa was able to escape the circus that evening. His treatment at the circus caused him to become pyrophobic."
    },
    {
      "body": "${link_0} was captured by ${link_1} and other ${link_2}.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Ghashiun",
          "key": "${link_1}",
          "target": {
            "href": "Ghashiun",
            "page": "Ghashiun"
          }
        },
        {
          "body": "sandbenders",
          "key": "${link_2}",
          "target": {
            "href": "Sandbender_Tribes",
            "page": "Sandbender_Tribes"
          }
        }
      ],
      "text": "Appa was captured by Ghashiun and other sandbenders."
    },
    {
      "body": "The ${link_0} of the Si Wong Desert seemingly viewed Appa as valuable from early on, surrounding him outside the ${link_1} before being chased off by Professor ${link_2}. Later on, while all of Team Avatar, except for Toph, and the professor were in an underground library, the sandbenders arrived at the scene, riding in on sand-sailers. There, they proceeded to use ropes to try and subdue the bison in a clear attempt to capture him. Toph tried to hinder their progress, but was unable to launch effective attacks due to her vision being impaired by the shifty sand. After a long struggle with Appa putting up a good fight against the sandbenders, who were led by a young man called ${link_3}, the tribe members were finally able to pin him down and capture him.",
      "links": [
        {
          "body": "Sandbender Tribes",
          "key": "${link_0}",
          "target": {
            "href": "Sandbender_Tribes",
            "page": "Sandbender_Tribes"
          }
        },
        {
          "body": "Misty Palms Oasis",
          "key": "${link_1}",
          "target": {
            "href": "Misty_Palms_Oasis",
            "page": "Misty_Palms_Oasis"
          }
        },
        {
          "body": "Zei",
          "key": "${link_2}",
          "target": {
            "href": "Zei",
            "page": "Zei"
          }
        },
        {
          "body": "Ghashiun",
          "key": "${link_3}",
          "target": {
            "href": "Ghashiun",
            "page": "Ghashiun"
          }
        }
      ],
      "text": "The Sandbender Tribes of the Si Wong Desert seemingly viewed Appa as valuable from early on, surrounding him outside the Misty Palms Oasis before being chased off by Professor Zei. Later on, while all of Team Avatar, except for Toph, and the professor were in an underground library, the sandbenders arrived at the scene, riding in on sand-sailers. There, they proceeded to use ropes to try and subdue the bison in a clear attempt to capture him. Toph tried to hinder their progress, but was unable to launch effective attacks due to her vision being impaired by the shifty sand. After a long struggle with Appa putting up a good fight against the sandbenders, who were led by a young man called Ghashiun, the tribe members were finally able to pin him down and capture him."
    },
    {
      "body": "Appa was driven away deep into the desert where ${link_0} was ransacked for any valuable possessions. He displayed a fierce attitude toward the sandbenders both during and after the fight, continually growling at them in anger. He was eventually sold to the beetle-headed merchants.",
      "links": [
        {
          "body": "his saddle",
          "key": "${link_0}",
          "target": {
            "href": "Appa%27s_saddle",
            "page": "Appa%27s_saddle"
          }
        }
      ],
      "text": "Appa was driven away deep into the desert where his saddle was ransacked for any valuable possessions. He displayed a fierce attitude toward the sandbenders both during and after the fight, continually growling at them in anger. He was eventually sold to the beetle-headed merchants."
    },
    {
      "body": "${link_0} caught ${link_1} by his foot.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_1}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        }
      ],
      "text": "Appa caught Long Feng by his foot."
    },
    {
      "body": "${link_0} was a fierce enemy of Appa, having been directly responsible for his capture in Ba Sing Se. When Long Feng and the Dai Li discovered Appa searching for Aang, they imprisoned the bison and harbored him in their secret underground base beneath Lake Laogai until Zuko liberated him. When a battle ensued between Team Avatar and the Dai Li, Appa bit Long Feng on the leg and tossed him into the lake. Appa and Long Feng encountered each other later in ${link_1} ${link_2}'s throne room when the team was trying to alert the king of the secret ${link_3}; the bite marks on Long Feng's leg were used as evidence and convinced the Earth King to investigate further.",
      "links": [
        {
          "body": "Long Feng",
          "key": "${link_0}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_1}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Kuei",
          "key": "${link_2}",
          "target": {
            "href": "Kuei",
            "page": "Kuei"
          }
        },
        {
          "body": "conspiracy",
          "key": "${link_3}",
          "target": {
            "href": "Conspiracy_of_Ba_Sing_Se",
            "page": "Conspiracy_of_Ba_Sing_Se"
          }
        }
      ],
      "text": "Long Feng was a fierce enemy of Appa, having been directly responsible for his capture in Ba Sing Se. When Long Feng and the Dai Li discovered Appa searching for Aang, they imprisoned the bison and harbored him in their secret underground base beneath Lake Laogai until Zuko liberated him. When a battle ensued between Team Avatar and the Dai Li, Appa bit Long Feng on the leg and tossed him into the lake. Appa and Long Feng encountered each other later in Earth King Kuei's throne room when the team was trying to alert the king of the secret conspiracy; the bite marks on Long Feng's leg were used as evidence and convinced the Earth King to investigate further."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Appa%27s_relationships",
    "file": "avatar.wikia.com/wiki/Appa's_relationships.html",
    "page": "Appa's_relationships",
    "title": "Appa's relationships"
  }
}