{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "href": "Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Asami is an elegant, intrepid young woman with unwavering loyalty to her allies.",
      "links": [
        {
          "body": "Asami Sato",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "This page is comprised of Asami Sato's relationships with other characters in the World of Avatar. Asami is an elegant, intrepid young woman with unwavering loyalty to her allies."
    },
    {
      "body": "${link_0} initially stood by her ${link_1} when he was accused of having ${link_2} ties.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "father",
          "key": "${link_1}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_2}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        }
      ],
      "text": "Asami initially stood by her father when he was accused of having Equalist ties."
    },
    {
      "body": "Although a businessman and entrepreneur, ${link_0} made sure that Asami always had everything she needed and enrolled her in self-defense classes when she was of a young age to ensure she would be able to protect herself. Living a life of luxury at the ${link_1}, Asami and her father had a close relationship with each other after the death of her mother, as he was now all she had left. Due to this, she was able to get a lot past her father.",
      "links": [
        {
          "body": "Hiroshi",
          "key": "${link_0}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Sato estate",
          "key": "${link_1}",
          "target": {
            "href": "Sato_estate",
            "page": "Sato_estate"
          }
        }
      ],
      "text": "Although a businessman and entrepreneur, Hiroshi made sure that Asami always had everything she needed and enrolled her in self-defense classes when she was of a young age to ensure she would be able to protect herself. Living a life of luxury at the Sato estate, Asami and her father had a close relationship with each other after the death of her mother, as he was now all she had left. Due to this, she was able to get a lot past her father."
    },
    {
      "body": "When she learned of ${link_0}'s monetary issues, she convinced her father to sponsor the ${link_1} for the amount of thirty-thousand ${link_2}, and she was allowed to invite Mako and ${link_3} to reside at the mansion without letting him know first. When Asami learned that ${link_4} was accusing her father of having ties with the ${link_5}, she immediately rushed to his side to support him, even defying ${link_6} and ${link_7}. When evidence of Hiroshi's affiliation with the Equalists surfaced, she still refused to believe that her father had anything to do with them. However, when she witnessed the truth herself, she was crushed. Hiroshi attempted to persuade her to join him and trustingly offered her one of the ${link_8} he was using to threaten her friends. Even after learning that her father was an Equalist, Asami continued to care deeply for him, as she told him she loved him before electroshocking him with the glove, though that did not stop her from acting against him.",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Fire Ferrets",
          "key": "${link_1}",
          "target": {
            "href": "Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        },
        {
          "body": "yuans",
          "key": "${link_2}",
          "target": {
            "href": "Currency#United_Republic_of_Nations",
            "page": "Currency"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_3}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Korra",
          "key": "${link_4}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_5}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_6}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_7}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "electrified gloves",
          "key": "${link_8}",
          "target": {
            "href": "Electrified_glove",
            "page": "Electrified_glove"
          }
        }
      ],
      "text": "When she learned of Mako's monetary issues, she convinced her father to sponsor the Fire Ferrets for the amount of thirty-thousand yuans, and she was allowed to invite Mako and Bolin to reside at the mansion without letting him know first. When Asami learned that Korra was accusing her father of having ties with the Equalists, she immediately rushed to his side to support him, even defying Lin Beifong and Tenzin. When evidence of Hiroshi's affiliation with the Equalists surfaced, she still refused to believe that her father had anything to do with them. However, when she witnessed the truth herself, she was crushed. Hiroshi attempted to persuade her to join him and trustingly offered her one of the electrified gloves he was using to threaten her friends. Even after learning that her father was an Equalist, Asami continued to care deeply for him, as she told him she loved him before electroshocking him with the glove, though that did not stop her from acting against him."
    },
    {
      "body": "From her arrival at ${link_0} onward, Asami wanted to distance herself from anything that reminded her of or had anything to do with her father.",
      "links": [
        {
          "body": "Air Temple Island",
          "key": "${link_0}",
          "target": {
            "href": "Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        }
      ],
      "text": "From her arrival at Air Temple Island onward, Asami wanted to distance herself from anything that reminded her of or had anything to do with her father."
    },
    {
      "body": "${link_0} imprisoned ${link_1} for aiding ${link_2}.",
      "links": [
        {
          "body": "Hiroshi Sato",
          "key": "${link_0}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "benders",
          "key": "${link_2}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "Hiroshi Sato imprisoned Asami for aiding benders."
    },
    {
      "body": "During the ${link_0}, she set out to stop her father, though was captured by Equalists. When she woke up in a cell, her father again asked her to join him, though she became angered, saying that she never would and that his anger had consumed him.",
      "links": [
        {
          "body": "battle for Republic City",
          "key": "${link_0}",
          "target": {
            "href": "Battle_for_Republic_City",
            "page": "Battle_for_Republic_City"
          }
        }
      ],
      "text": "During the battle for Republic City, she set out to stop her father, though was captured by Equalists. When she woke up in a cell, her father again asked her to join him, though she became angered, saying that she never would and that his anger had consumed him."
    },
    {
      "body": "Asami later faced off against her father in the ${link_0}, with Hiroshi finally severing his ties to Asami after she told him that he no longer loved her mother, and that the anger he felt for benders had completely taken him over. However, Hiroshi, seeing his daughter as unmovable, saw no choice left but to kill her. Assisted by Bolin, Asami marginally escaped death by the hands of her own father, but she still hesitated to kill him. Asami electrocuted him once more after he tried to escape on foot, but not before regretfully agreeing with Bolin's earlier statement of Hiroshi being a horrible father.",
      "links": [
        {
          "body": "mecha tanks",
          "key": "${link_0}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        }
      ],
      "text": "Asami later faced off against her father in the mecha tanks, with Hiroshi finally severing his ties to Asami after she told him that he no longer loved her mother, and that the anger he felt for benders had completely taken him over. However, Hiroshi, seeing his daughter as unmovable, saw no choice left but to kill her. Assisted by Bolin, Asami marginally escaped death by the hands of her own father, but she still hesitated to kill him. Asami electrocuted him once more after he tried to escape on foot, but not before regretfully agreeing with Bolin's earlier statement of Hiroshi being a horrible father."
    },
    {
      "body": "${link_0} teared up upon hearing ${link_1} admitting that he was proud of her and desired to make amends.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "her father",
          "key": "${link_1}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        }
      ],
      "text": "Asami teared up upon hearing her father admitting that he was proud of her and desired to make amends."
    },
    {
      "body": "Although her father was imprisoned, Asami continued to carry the burden of his betrayal, both on a personal and business level, as he had tainted their past and destroyed the good Sato name. In 174 AG, she traveled down to ${link_0} in order to return all the letters he had ever written to her, none of which she had opened. She ordered him to never contact her again, as she did not want to hear or see him ever again. Despite this, she was convinced to hear him out under the promise that he would leave her alone for good afterward, though she could not bear to look at him. Hiroshi admitted that he could not forgive himself for what he had done, nor hope to ever be forgiven, though he wanted Asami to know that she was the only thing in his life he took pride in and praised her for being his greatest achievement.",
      "links": [
        {
          "body": "Republic City prison",
          "key": "${link_0}",
          "target": {
            "href": "Republic_City_prison",
            "page": "Republic_City_prison"
          }
        }
      ],
      "text": "Although her father was imprisoned, Asami continued to carry the burden of his betrayal, both on a personal and business level, as he had tainted their past and destroyed the good Sato name. In 174 AG, she traveled down to Republic City prison in order to return all the letters he had ever written to her, none of which she had opened. She ordered him to never contact her again, as she did not want to hear or see him ever again. Despite this, she was convinced to hear him out under the promise that he would leave her alone for good afterward, though she could not bear to look at him. Hiroshi admitted that he could not forgive himself for what he had done, nor hope to ever be forgiven, though he wanted Asami to know that she was the only thing in his life he took pride in and praised her for being his greatest achievement."
    },
    {
      "body": "Needing some time to process that new information, Asami left the prison, though returned later on to make her own confessions. She admitted to initially have come to hurt Hiroshi with her words as much as he had hurt her, though when she faced him, she could only feel sadness for everything that had been lost and destroyed. While she was uncertain if she could ever forgive him, she was certain that she needed to try to give their family another chance.",
      "links": [],
      "text": "Needing some time to process that new information, Asami left the prison, though returned later on to make her own confessions. She admitted to initially have come to hurt Hiroshi with her words as much as he had hurt her, though when she faced him, she could only feel sadness for everything that had been lost and destroyed. While she was uncertain if she could ever forgive him, she was certain that she needed to try to give their family another chance."
    },
    {
      "body": "${link_0} was able to finally forgive ${link_1} before the two left to attack ${link_2}'s giant ${link_3}.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "her father",
          "key": "${link_1}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_2}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "mecha suit",
          "key": "${link_3}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        }
      ],
      "text": "Asami was able to finally forgive her father before the two left to attack Kuvira's giant mecha suit."
    },
    {
      "body": "When Lin later freed Hiroshi to assist Team Avatar against Kuvira, he and Asami had a loving moment before going into battle. In the end, Hiroshi sacrificed himself to save Asami and to allow their allies to get inside Kuvira's giant mecha suit, though his death deeply affected Asami. She later expressed her thankfulness that she was at least able to forgive her father before his death.",
      "links": [],
      "text": "When Lin later freed Hiroshi to assist Team Avatar against Kuvira, he and Asami had a loving moment before going into battle. In the end, Hiroshi sacrificed himself to save Asami and to allow their allies to get inside Kuvira's giant mecha suit, though his death deeply affected Asami. She later expressed her thankfulness that she was at least able to forgive her father before his death."
    },
    {
      "body": "${link_0}, ${link_1}, and ${link_2} posed for a family photo when Asami was young.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "her mother",
          "key": "${link_1}",
          "target": {
            "href": "Yasuko",
            "page": "Yasuko"
          }
        },
        {
          "body": "her father",
          "key": "${link_2}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        }
      ],
      "text": "Asami, her mother, and her father posed for a family photo when Asami was young."
    },
    {
      "body": "Asami was very close to her mother. However, when she was six years old, a member of the ${link_0} murdered Yasuko during a break-in and robbery at the Sato estate. From that point on, Hiroshi sent Asami to take self-defense classes for her own protection. Despite losing her mother to a ${link_1}, she holds no grudges against benders, unlike her father. Asami bears a strong physical resemblance to her mother.",
      "links": [
        {
          "body": "Agni Kai Triad",
          "key": "${link_0}",
          "target": {
            "href": "Agni_Kai_Triad",
            "page": "Agni_Kai_Triad"
          }
        },
        {
          "body": "firebender",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Asami was very close to her mother. However, when she was six years old, a member of the Agni Kai Triad murdered Yasuko during a break-in and robbery at the Sato estate. From that point on, Hiroshi sent Asami to take self-defense classes for her own protection. Despite losing her mother to a firebender, she holds no grudges against benders, unlike her father. Asami bears a strong physical resemblance to her mother."
    },
    {
      "body": "${link_0} and ${link_1} became friends after the ${link_2} overcame her jealousy.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Asami and Korra became friends after the Avatar overcame her jealousy."
    },
    {
      "body": "Asami initially had little contact with Korra directly, leaving the Avatar to develop unfair assumptions on her personality. Asami, nonetheless, continued to act friendly toward Korra, complimenting her fervently after the Avatar's comeback in the ${link_0} semifinals.",
      "links": [
        {
          "body": "pro-bending",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending",
            "page": "Pro-bending"
          }
        }
      ],
      "text": "Asami initially had little contact with Korra directly, leaving the Avatar to develop unfair assumptions on her personality. Asami, nonetheless, continued to act friendly toward Korra, complimenting her fervently after the Avatar's comeback in the pro-bending semifinals."
    },
    {
      "body": "After Asami invited Korra to race with her at the Sato estate, the two bonded and Korra finally warmed up to Asami, even stating that she \"had her pegged wrong\". However, Asami was frustrated with Korra when she accused her father of having ties to the Equalists, putting a damper on their newfound friendship. When Asami found that the Avatar was telling the truth, she retracted her aggressive attitude and Korra even invited her to live on Air Temple Island alongside Mako and Bolin. After ${link_0} told Asami that Korra liked Mako, the nonbender reacted with surprise before being dragged away by a panic-stricken Korra.",
      "links": [
        {
          "body": "Ikki",
          "key": "${link_0}",
          "target": {
            "href": "Ikki",
            "page": "Ikki"
          }
        }
      ],
      "text": "After Asami invited Korra to race with her at the Sato estate, the two bonded and Korra finally warmed up to Asami, even stating that she \"had her pegged wrong\". However, Asami was frustrated with Korra when she accused her father of having ties to the Equalists, putting a damper on their newfound friendship. When Asami found that the Avatar was telling the truth, she retracted her aggressive attitude and Korra even invited her to live on Air Temple Island alongside Mako and Bolin. After Ikki told Asami that Korra liked Mako, the nonbender reacted with surprise before being dragged away by a panic-stricken Korra."
    },
    {
      "body": "When finding Korra doubting herself, stating she was the \"worst Avatar ever\", Asami was quick to help cheer her up, refuting Korra's statement by saying that she \"was amazing\". Bolin proceeded to emphasize that even though the Pro-bending Arena was shut down, they were still a team, something to which Asami eagerly agreed.",
      "links": [],
      "text": "When finding Korra doubting herself, stating she was the \"worst Avatar ever\", Asami was quick to help cheer her up, refuting Korra's statement by saying that she \"was amazing\". Bolin proceeded to emphasize that even though the Pro-bending Arena was shut down, they were still a team, something to which Asami eagerly agreed."
    },
    {
      "body": "${link_0} realized there was a possible relationship between ${link_1} and ${link_2}.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Asami realized there was a possible relationship between Mako and Korra."
    },
    {
      "body": "While patrolling the city as the new found Team Avatar, Asami started to realize that Mako maybe did have feelings for Korra. When Republic City's power was turned off, and the residents took to the streets of Dragon Flat's borough demanding that their power to be turned back on, Team Avatar went to the site of the rally. While getting in the ${link_0}, Mako requested that Korra get in first, with her in turn saying, \"What a gentleman\". As Asami started up the automobile, she looked in the mirror at Mako and Korra, with a suspicious look.",
      "links": [
        {
          "body": "automobile",
          "key": "${link_0}",
          "target": {
            "href": "Motor_vehicle",
            "page": "Motor_vehicle"
          }
        }
      ],
      "text": "While patrolling the city as the new found Team Avatar, Asami started to realize that Mako maybe did have feelings for Korra. When Republic City's power was turned off, and the residents took to the streets of Dragon Flat's borough demanding that their power to be turned back on, Team Avatar went to the site of the rally. While getting in the automobile, Mako requested that Korra get in first, with her in turn saying, \"What a gentleman\". As Asami started up the automobile, she looked in the mirror at Mako and Korra, with a suspicious look."
    },
    {
      "body": "When searching for a kidnapped Korra, Asami questioned Bolin whether Mako had ever displayed any further affections toward the Avatar. Bolin, forced to confess, told Asami of the kiss the two of them had shared during the Pro-bending Tournament. Despite the romantic issues, however, Asami never showed hatred toward Korra and even stated that she still liked her, blaming only Mako for keeping his feelings a secret from her. They still remained friends despite the romantic triangle they had with Mako, with Asami never hesitating to come to Korra's aid.",
      "links": [],
      "text": "When searching for a kidnapped Korra, Asami questioned Bolin whether Mako had ever displayed any further affections toward the Avatar. Bolin, forced to confess, told Asami of the kiss the two of them had shared during the Pro-bending Tournament. Despite the romantic issues, however, Asami never showed hatred toward Korra and even stated that she still liked her, blaming only Mako for keeping his feelings a secret from her. They still remained friends despite the romantic triangle they had with Mako, with Asami never hesitating to come to Korra's aid."
    },
    {
      "body": "When ${link_0} was badly injured due to ${link_1} poisoning, ${link_2} remained by her side to support her in any way she could.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "mercury",
          "key": "${link_1}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "text": "When Korra was badly injured due to mercury poisoning, Asami remained by her side to support her in any way she could."
    },
    {
      "body": "Two weeks after Harmonic Convergence, Korra and Asami's friendship deepened to the point of them being best friends. Both had gotten over their former love triangle with Mako and Asami began to teach Korra how to drive. She also supported her and encouraged her in her efforts of trying to bring the city back to normal. She later aided Korra and Tenzin in their quest to find the new ${link_0} who were appearing all over the world, which enabled the two women to grow more together as friends. They spent more time together, whether it was training or simply hanging out, and when Korra was still recuperating from her fight with Zaheer, Asami took care of her, comforting her when needed, and offered her a sympathetic ear if she would ever require one. In the subsequent two years apart, Korra confided in Asami about her recovery and her fears, most notably, her inability to enter the Avatar State. It was during this time that Asami realized the true nature of her feelings for Korra. She almost wrote Korra about them but ultimately held back, fearing that Korra may never return if her feelings were not reciprocated.",
      "links": [
        {
          "body": "airbenders",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Two weeks after Harmonic Convergence, Korra and Asami's friendship deepened to the point of them being best friends. Both had gotten over their former love triangle with Mako and Asami began to teach Korra how to drive. She also supported her and encouraged her in her efforts of trying to bring the city back to normal. She later aided Korra and Tenzin in their quest to find the new airbenders who were appearing all over the world, which enabled the two women to grow more together as friends. They spent more time together, whether it was training or simply hanging out, and when Korra was still recuperating from her fight with Zaheer, Asami took care of her, comforting her when needed, and offered her a sympathetic ear if she would ever require one. In the subsequent two years apart, Korra confided in Asami about her recovery and her fears, most notably, her inability to enter the Avatar State. It was during this time that Asami realized the true nature of her feelings for Korra. She almost wrote Korra about them but ultimately held back, fearing that Korra may never return if her feelings were not reciprocated."
    },
    {
      "body": "${link_0} and ${link_1} shared a kiss while on a romantic getaway in the ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Korra and Asami shared a kiss while on a romantic getaway in the Spirit World."
    },
    {
      "body": "When Korra finally returned to Republic City after three years, she and Asami reunited warmly, but things grew cold after Asami mentioned her reunion with her father. The heiress snapped at the Avatar after the latter suggested that he may still be untrustworthy, to which Asami told Korra not to decide what was best for her. Nonetheless, the two showed they trusted each other more when Prince ${link_0} had been captured by Kuvira's spies, working in perfect sync while Mako was one step behind them. The two had grown so close they instinctively tried comforting each other. After Kuvira's defeat and the loss of her father, Asami confessed to Korra that she was just glad Korra was still around, unable to bear the thought of losing her as well. In need of a vacation, the two retreated to the ${link_1} together, where they officially started their relationship. Traveling around the Spirit World together, the couple strengthened their relationship, and Asami finally confessed to Korra how she felt during the time the Avatar was absent. She was hesitant about going public with their relationship, though it was only because she desired to have Korra to herself, thinking of their relationship as special and rare, without having the public's eye focused on their every move.",
      "links": [
        {
          "body": "Wu",
          "key": "${link_0}",
          "target": {
            "href": "Wu",
            "page": "Wu"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "When Korra finally returned to Republic City after three years, she and Asami reunited warmly, but things grew cold after Asami mentioned her reunion with her father. The heiress snapped at the Avatar after the latter suggested that he may still be untrustworthy, to which Asami told Korra not to decide what was best for her. Nonetheless, the two showed they trusted each other more when Prince Wu had been captured by Kuvira's spies, working in perfect sync while Mako was one step behind them. The two had grown so close they instinctively tried comforting each other. After Kuvira's defeat and the loss of her father, Asami confessed to Korra that she was just glad Korra was still around, unable to bear the thought of losing her as well. In need of a vacation, the two retreated to the Spirit World together, where they officially started their relationship. Traveling around the Spirit World together, the couple strengthened their relationship, and Asami finally confessed to Korra how she felt during the time the Avatar was absent. She was hesitant about going public with their relationship, though it was only because she desired to have Korra to herself, thinking of their relationship as special and rare, without having the public's eye focused on their every move."
    },
    {
      "body": "Despite being back among the people, Korra and Asami continued to be naturally drawn to each other and worked together flawlessly, supporting and protecting each other when necessary. When they felt the time was right, they made their relationship public to their friends. Three weeks after Asami was rescued, Korra admitted she is in love with Asami, a feeling which Asami reciprocated.",
      "links": [],
      "text": "Despite being back among the people, Korra and Asami continued to be naturally drawn to each other and worked together flawlessly, supporting and protecting each other when necessary. When they felt the time was right, they made their relationship public to their friends. Three weeks after Asami was rescued, Korra admitted she is in love with Asami, a feeling which Asami reciprocated."
    },
    {
      "body": "${link_0} initially dated ${link_1}.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "Asami initially dated Mako."
    },
    {
      "body": "Asami met Mako after she crashed into him while riding on her moped as he crossed the street. Initially, she was apologetic until she realized he was the captain of the Fire Ferrets. Being embarrassed for hitting him, Asami invited Mako to go out to dinner as an apology for the incident, which he accepted. Their relationship hit off immediately, and she had her father offer Mako to solve the Fire Ferrets' financial issues. They spent a considerable amount of time together in the following weeks, during which Asami bought Mako a new silk scarf. While enjoying a romantic carriage ride through ${link_0}, Asami noticed Mako was still wearing his old red scarf, and he informed her that it was the only memento he still had of his deceased father. After Asami told him that she had lost her mother at a young age as well, they locked in an intimate embrace, with Asami saying she felt safe with Mako.",
      "links": [
        {
          "body": "Republic City Park",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Korra_Park",
            "page": "Avatar_Korra_Park"
          }
        }
      ],
      "text": "Asami met Mako after she crashed into him while riding on her moped as he crossed the street. Initially, she was apologetic until she realized he was the captain of the Fire Ferrets. Being embarrassed for hitting him, Asami invited Mako to go out to dinner as an apology for the incident, which he accepted. Their relationship hit off immediately, and she had her father offer Mako to solve the Fire Ferrets' financial issues. They spent a considerable amount of time together in the following weeks, during which Asami bought Mako a new silk scarf. While enjoying a romantic carriage ride through Republic City Park, Asami noticed Mako was still wearing his old red scarf, and he informed her that it was the only memento he still had of his deceased father. After Asami told him that she had lost her mother at a young age as well, they locked in an intimate embrace, with Asami saying she felt safe with Mako."
    },
    {
      "body": "For the following weeks, Asami and Mako began referring to each other by affectionate nicknames such as \"sweetie\". She would visit Mako during practice as well as before and after pro-bending matches. She would watch the Fire Ferrets' games from the stands, from where, before the final match of the tournament, Asami and Mako blew kisses to each other. Asami invited Mako and Bolin to stay in the Sato estate after the ${link_0} was closed down following the ${link_1}, displaying her care for Mako. When the Sato mansion was investigated based on Korra's suspicions, Mako defended Asami against the allegations against her father, even going so far as threatening to end his friendship with Korra if she continued to berate his girlfriend. After it was proven that Hiroshi was working with the Equalists, Mako comforted the distraught Asami as they left the Sato estate.",
      "links": [
        {
          "body": "Pro-bending Arena",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "Equalists' attack",
          "key": "${link_1}",
          "target": {
            "href": "Attack_on_the_Pro-bending_Arena",
            "page": "Attack_on_the_Pro-bending_Arena"
          }
        }
      ],
      "text": "For the following weeks, Asami and Mako began referring to each other by affectionate nicknames such as \"sweetie\". She would visit Mako during practice as well as before and after pro-bending matches. She would watch the Fire Ferrets' games from the stands, from where, before the final match of the tournament, Asami and Mako blew kisses to each other. Asami invited Mako and Bolin to stay in the Sato estate after the Pro-bending Arena was closed down following the Equalists' attack, displaying her care for Mako. When the Sato mansion was investigated based on Korra's suspicions, Mako defended Asami against the allegations against her father, even going so far as threatening to end his friendship with Korra if she continued to berate his girlfriend. After it was proven that Hiroshi was working with the Equalists, Mako comforted the distraught Asami as they left the Sato estate."
    },
    {
      "body": "When Asami was informed about Korra's crush on Mako, she started watching them interact, first glancing suspiciously at them from her car's rear-view mirror as Mako helped Korra into the back seat. After the Avatar was abducted, her suspicions grew upon witnessing Mako's sudden overwhelming worry following her disappearance. She had an angry and upset reaction once an irked Mako coldly told her off while leading the search for Korra. Questioning Bolin over the nature of Mako and Korra's relationship, she found out the two had kissed sometime prior to the finals of the ${link_0} and was visibly upset and angry over this new development. Later, as Mako lovingly carried Korra to ${link_1}, Asami looked toward them, bearing a crestfallen look.",
      "links": [
        {
          "body": "Pro-bending Tournament",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending#Pro-bending_Tournament",
            "page": "Pro-bending"
          }
        },
        {
          "body": "Oogi",
          "key": "${link_1}",
          "target": {
            "href": "Oogi",
            "page": "Oogi"
          }
        }
      ],
      "text": "When Asami was informed about Korra's crush on Mako, she started watching them interact, first glancing suspiciously at them from her car's rear-view mirror as Mako helped Korra into the back seat. After the Avatar was abducted, her suspicions grew upon witnessing Mako's sudden overwhelming worry following her disappearance. She had an angry and upset reaction once an irked Mako coldly told her off while leading the search for Korra. Questioning Bolin over the nature of Mako and Korra's relationship, she found out the two had kissed sometime prior to the finals of the Pro-bending Tournament and was visibly upset and angry over this new development. Later, as Mako lovingly carried Korra to Oogi, Asami looked toward them, bearing a crestfallen look."
    },
    {
      "body": "${link_0} confronted ${link_1} about his kiss with ${link_2}.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Asami confronted Mako about his kiss with Korra."
    },
    {
      "body": "After returning to Air Temple Island, Asami and Mako started to drift apart; she watched from a doorway with a dejected expression as Mako sat at the bedside of an unconscious and injured Korra, holding her hand. She continued to be bothered by his attentive behavior toward Korra, like when he entered the kitchen asking for hot water so he could give Korra tea. She snapped at him, telling him that, as a firebender, he should boil it himself. She drilled him about his feelings for Korra, stating that she noticed his constant doting on her and that she knew he had shared a kiss with her during the Pro-bending Tournament. Mako was unable to give her an answer regarding his feelings for Korra and placed a hand on hers, saying that they should concentrate on their own relationship. Enraged and feeling betrayed, she yanked her hand away and stormed out of the kitchen, stating that there \"might not be any relationship to worry about\" by then.",
      "links": [],
      "text": "After returning to Air Temple Island, Asami and Mako started to drift apart; she watched from a doorway with a dejected expression as Mako sat at the bedside of an unconscious and injured Korra, holding her hand. She continued to be bothered by his attentive behavior toward Korra, like when he entered the kitchen asking for hot water so he could give Korra tea. She snapped at him, telling him that, as a firebender, he should boil it himself. She drilled him about his feelings for Korra, stating that she noticed his constant doting on her and that she knew he had shared a kiss with her during the Pro-bending Tournament. Mako was unable to give her an answer regarding his feelings for Korra and placed a hand on hers, saying that they should concentrate on their own relationship. Enraged and feeling betrayed, she yanked her hand away and stormed out of the kitchen, stating that there \"might not be any relationship to worry about\" by then."
    },
    {
      "body": "Asami barely kept her alliance with Mako, begrudging him even during the attack on Republic City. For example, when he tried to sit in the front seat of her ${link_0} next to her, she told him irritably to sit behind with Korra. As ${link_1} watched the invasion of Air Temple Island from afar, she looked at Mako, vexed, who had his arm around Korra and was comforting her. Afterward, before Mako left with Korra to track down Amon, he apologized to Asami about how their relationship got out of hand. He admitted that he would always care about her. She pecked his cheek and admitted she cared about him too, implying that she trusts Mako. Although not explicitly shown, it is heavily implied that the two broke up before the team traveled to the ${link_2} in an attempt to restore Korra's bending.",
      "links": [
        {
          "body": "Satomobile",
          "key": "${link_0}",
          "target": {
            "href": "Satomobile",
            "page": "Satomobile"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "Asami barely kept her alliance with Mako, begrudging him even during the attack on Republic City. For example, when he tried to sit in the front seat of her Satomobile next to her, she told him irritably to sit behind with Korra. As Team Avatar watched the invasion of Air Temple Island from afar, she looked at Mako, vexed, who had his arm around Korra and was comforting her. Afterward, before Mako left with Korra to track down Amon, he apologized to Asami about how their relationship got out of hand. He admitted that he would always care about her. She pecked his cheek and admitted she cared about him too, implying that she trusts Mako. Although not explicitly shown, it is heavily implied that the two broke up before the team traveled to the Southern Water Tribe in an attempt to restore Korra's bending."
    },
    {
      "body": "Although now ex-partners, Asami and Mako managed to remain good friends, able to talk to each other about their worries and rely on each other when needed. After discovering her shipment of mecha tanks had been stolen, she turned to Mako for help, who calmed her down and assured her he would find the people responsible, even going as far as setting up a sting operation behind Chief Beifong's back.",
      "links": [],
      "text": "Although now ex-partners, Asami and Mako managed to remain good friends, able to talk to each other about their worries and rely on each other when needed. After discovering her shipment of mecha tanks had been stolen, she turned to Mako for help, who calmed her down and assured her he would find the people responsible, even going as far as setting up a sting operation behind Chief Beifong's back."
    },
    {
      "body": "Overpowered by emotion, ${link_0} kissed ${link_1}.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "Overpowered by emotion, Asami kissed Mako."
    },
    {
      "body": "During the operation, the two spent some time talking together, and Asami was shocked to learn that Mako and Korra had broken up. When Mako later told her that they needed to leave the ship, she trusted him blindly, following his lead. It was only after they had shaken their pursuers that she inquired the reason. When she found her warehouse completely empty, she lost all hope and gave up on her company. However, she found herself consoled by Mako, who stated that he would not give up on her. Overpowered by emotion, she impulsively kissed him though quickly apologized afterward. About a week later, despite not believing Mako's allegations that Varrick was behind the attack on her shipments, Asami and Mako grew closer yet again. She visited him in his apartment, concerned about his stressful day and even suggested they go to Kwong's Cuisine, like they had in their first date. Unlike before, Mako was the one who now instigated a kiss, returning her affections. However, when he was arrested and the police implied that she had been used by him, Asami grew doubtful despite his claims that he would never do something to hurt her. Their relationship never blossomed to a real romantic relationship, however, as Mako grew to be awkward around her and Korra during the two weeks following ${link_0}.",
      "links": [
        {
          "body": "Harmonic Convergence",
          "key": "${link_0}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        }
      ],
      "text": "During the operation, the two spent some time talking together, and Asami was shocked to learn that Mako and Korra had broken up. When Mako later told her that they needed to leave the ship, she trusted him blindly, following his lead. It was only after they had shaken their pursuers that she inquired the reason. When she found her warehouse completely empty, she lost all hope and gave up on her company. However, she found herself consoled by Mako, who stated that he would not give up on her. Overpowered by emotion, she impulsively kissed him though quickly apologized afterward. About a week later, despite not believing Mako's allegations that Varrick was behind the attack on her shipments, Asami and Mako grew closer yet again. She visited him in his apartment, concerned about his stressful day and even suggested they go to Kwong's Cuisine, like they had in their first date. Unlike before, Mako was the one who now instigated a kiss, returning her affections. However, when he was arrested and the police implied that she had been used by him, Asami grew doubtful despite his claims that he would never do something to hurt her. Their relationship never blossomed to a real romantic relationship, however, as Mako grew to be awkward around her and Korra during the two weeks following Harmonic Convergence."
    },
    {
      "body": "${link_0} found out through ${link_1} that ${link_2} had kissed ${link_3}.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_2}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Korra",
          "key": "${link_3}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Asami found out through Bolin that Mako had kissed Korra."
    },
    {
      "body": "Asami first met Bolin when her father became the Fire Ferrets' official sponsor and later invited him and Mako to stay at the Sato estate after the Pro-bending Arena was shut down, both of which Bolin was extremely grateful for.",
      "links": [],
      "text": "Asami first met Bolin when her father became the Fire Ferrets' official sponsor and later invited him and Mako to stay at the Sato estate after the Pro-bending Arena was shut down, both of which Bolin was extremely grateful for."
    },
    {
      "body": "Albeit friendly toward one another, Bolin and Asami never interacted significantly until they set out to find Korra who had been supposedly abducted by the Equalists. Worried about Mako's overprotective behavior and eagerness to find Korra, she asked Bolin if her boyfriend liked Korra as more than a friend. Seeing right through his evasive answers, she told him flat out to say what he knew and learned that Korra and Mako had once shared a kiss during the Pro-bending Tournament.",
      "links": [],
      "text": "Albeit friendly toward one another, Bolin and Asami never interacted significantly until they set out to find Korra who had been supposedly abducted by the Equalists. Worried about Mako's overprotective behavior and eagerness to find Korra, she asked Bolin if her boyfriend liked Korra as more than a friend. Seeing right through his evasive answers, she told him flat out to say what he knew and learned that Korra and Mako had once shared a kiss during the Pro-bending Tournament."
    },
    {
      "body": "After Asami told Mako that she knew about the kiss Mako and Korra had shared during the Pro-bending Tournament, Mako angrily asked if Bolin had told her, but Asami shot back that he should not be angry at Bolin for being truthful to her. Bolin later saved Asami's life when Hiroshi was attacking her, hurling rocks at her father's mecha tank to defeat him.",
      "links": [],
      "text": "After Asami told Mako that she knew about the kiss Mako and Korra had shared during the Pro-bending Tournament, Mako angrily asked if Bolin had told her, but Asami shot back that he should not be angry at Bolin for being truthful to her. Bolin later saved Asami's life when Hiroshi was attacking her, hurling rocks at her father's mecha tank to defeat him."
    },
    {
      "body": "${link_0} ruffled ${link_1}'s hair and called him a \"natural assistant\" after he helped her get a deal with ${link_2}.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_2}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "text": "Asami ruffled Bolin's hair and called him a \"natural assistant\" after he helped her get a deal with Varrick."
    },
    {
      "body": "After the Anti-bending revolution, Asami and Bolin appeared to be much closer to each other, as Asami asked Bolin to be her assistant while she was attempting to make a deal with ${link_0}. Although Asami initially thought that Bolin had messed up by revealing that Varrick was being scammed, he actually wound up helping her to get the deal she wanted to have. Upon leaving, Asami hugged Bolin and declared that he was a natural assistant.",
      "links": [
        {
          "body": "Varrick",
          "key": "${link_0}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "text": "After the Anti-bending revolution, Asami and Bolin appeared to be much closer to each other, as Asami asked Bolin to be her assistant while she was attempting to make a deal with Varrick. Although Asami initially thought that Bolin had messed up by revealing that Varrick was being scammed, he actually wound up helping her to get the deal she wanted to have. Upon leaving, Asami hugged Bolin and declared that he was a natural assistant."
    },
    {
      "body": "Upon witnessing Bolin and Eska's interactions, she urged him not to let Eska treat him badly and suggested he be honest with Eska and tell her what he truly felt. Later, the two spent time together at ${link_0} and the ${link_1}' trial. Upon realizing that Bolin had given the money they had intended to use to bribe the judge to random civilians, Asami sighed and placed her head into her palm, something she tended to do when she believed Bolin had done something unwise. When Bolin discovered Mako and Asami had been growing closer again, especially so soon after Mako broke up with Korra, he was reproachful of them.",
      "links": [
        {
          "body": "Tonraq",
          "key": "${link_0}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Southern Water Tribe rebels",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe_rebels",
            "page": "Southern_Water_Tribe_rebels"
          }
        }
      ],
      "text": "Upon witnessing Bolin and Eska's interactions, she urged him not to let Eska treat him badly and suggested he be honest with Eska and tell her what he truly felt. Later, the two spent time together at Tonraq and the Southern Water Tribe rebels' trial. Upon realizing that Bolin had given the money they had intended to use to bribe the judge to random civilians, Asami sighed and placed her head into her palm, something she tended to do when she believed Bolin had done something unwise. When Bolin discovered Mako and Asami had been growing closer again, especially so soon after Mako broke up with Korra, he was reproachful of them."
    },
    {
      "body": "${link_0} attempted to console ${link_1}, who was saddened about the state of their ${link_2}.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "team",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "text": "Asami attempted to console Bolin, who was saddened about the state of their team."
    },
    {
      "body": "During the finale of ${link_0}, Asami noticed a dejected Bolin leave the ${link_1} in the middle of the mover. Curious as to why he was feeling so down, she followed soon after him. While initially believing he was upset due to Juji's apparent death in the mover, Bolin revealed that he was saddened due to ${link_2} having grown so far apart. Asami agreed, stating that things had changed drastically since they had first met. When Asami offered Bolin to come back inside and finish watching the mover with her, he refused, desiring to have some more time by himself.",
      "links": [
        {
          "body": "The Adventures of Nuktuk: Hero of the South",
          "key": "${link_0}",
          "target": {
            "href": "The_Adventures_of_Nuktuk__Hero_of_the_South",
            "page": "The_Adventures_of_Nuktuk__Hero_of_the_South"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_1}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "text": "During the finale of The Adventures of Nuktuk: Hero of the South, Asami noticed a dejected Bolin leave the Pro-bending Arena in the middle of the mover. Curious as to why he was feeling so down, she followed soon after him. While initially believing he was upset due to Juji's apparent death in the mover, Bolin revealed that he was saddened due to Team Avatar having grown so far apart. Asami agreed, stating that things had changed drastically since they had first met. When Asami offered Bolin to come back inside and finish watching the mover with her, he refused, desiring to have some more time by himself."
    },
    {
      "body": "After Bolin had defeated the four waterbenders tasked with ${link_0}, Asami was elated by his accomplishment.",
      "links": [
        {
          "body": "kidnapping President Raiko",
          "key": "${link_0}",
          "target": {
            "href": "Attempted_kidnapping_of_President_Raiko",
            "page": "Attempted_kidnapping_of_President_Raiko"
          }
        }
      ],
      "text": "After Bolin had defeated the four waterbenders tasked with kidnapping President Raiko, Asami was elated by his accomplishment."
    },
    {
      "body": "The friendship between the two continued to grow as they spent even more time together while tracking down airbenders or the ${link_0}. They were capable of playing games with each other on a friendly basis while trading jabs.",
      "links": [
        {
          "body": "Red Lotus",
          "key": "${link_0}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        }
      ],
      "text": "The friendship between the two continued to grow as they spent even more time together while tracking down airbenders or the Red Lotus. They were capable of playing games with each other on a friendly basis while trading jabs."
    },
    {
      "body": "When the group reunited at the ${link_0}, after Asami and Korra had gotten captured, Asami immediately received a hug from Bolin, while Mako embraced Korra.",
      "links": [
        {
          "body": "Misty Palms Oasis",
          "key": "${link_0}",
          "target": {
            "href": "Misty_Palms_Oasis",
            "page": "Misty_Palms_Oasis"
          }
        }
      ],
      "text": "When the group reunited at the Misty Palms Oasis, after Asami and Korra had gotten captured, Asami immediately received a hug from Bolin, while Mako embraced Korra."
    },
    {
      "body": "${link_0} and ${link_1}'s first encounter resulted in a promise from the businessman to begin finalizing a deal.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_1}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "text": "Asami and Varrick's first encounter resulted in a promise from the businessman to begin finalizing a deal."
    },
    {
      "body": "Asami's relationship with ${link_0} was frequently fluctuating, but she first approached the industrialist, believing he could be a highly valuable and much-needed ally. Six months after the end of the Anti-bending Revolution, Asami headed to the Southern Water Tribe along with the rest of Team Avatar to gain financial backing from Varrick after Future Industries had begun sinking into bankruptcy. She entered the businessman's ${link_1} with Bolin to find Varrick attempting to perform levitation. Though confused, Asami went along with his antics in order to soothe his ego and later tried to strike up a conversation with him before being interrupted and shown a presentation of Varrick's new line of movers, which he stated were big business. Now slightly irritated, Asami again endeavored to finalize a deal with an uncompromising Varrick who eventually gave in after staring the former down.",
      "links": [
        {
          "body": "Varrick",
          "key": "${link_0}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "yacht",
          "key": "${link_1}",
          "target": {
            "href": "Varrick%27s_yacht",
            "page": "Varrick%27s_yacht"
          }
        }
      ],
      "text": "Asami's relationship with Varrick was frequently fluctuating, but she first approached the industrialist, believing he could be a highly valuable and much-needed ally. Six months after the end of the Anti-bending Revolution, Asami headed to the Southern Water Tribe along with the rest of Team Avatar to gain financial backing from Varrick after Future Industries had begun sinking into bankruptcy. She entered the businessman's yacht with Bolin to find Varrick attempting to perform levitation. Though confused, Asami went along with his antics in order to soothe his ego and later tried to strike up a conversation with him before being interrupted and shown a presentation of Varrick's new line of movers, which he stated were big business. Now slightly irritated, Asami again endeavored to finalize a deal with an uncompromising Varrick who eventually gave in after staring the former down."
    },
    {
      "body": "Several days later, Asami awaited the billionaire in his house on the mainland, growing increasingly anxious about Varrick's tardiness and becoming fearful in belief that he may have been reconsidering helping Future Industries out of economic stress. She was surprised when Desna and Eska came in searching for the businessman, and she inquired what he had done. While consoling Bolin over his relationship issues, she was shocked to hear the muffled voice of Varrick who revealed that he was hiding in a stuffed platypus bear along with his assistant, ${link_0}.",
      "links": [
        {
          "body": "Zhu Li",
          "key": "${link_0}",
          "target": {
            "href": "Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        }
      ],
      "text": "Several days later, Asami awaited the billionaire in his house on the mainland, growing increasingly anxious about Varrick's tardiness and becoming fearful in belief that he may have been reconsidering helping Future Industries out of economic stress. She was surprised when Desna and Eska came in searching for the businessman, and she inquired what he had done. While consoling Bolin over his relationship issues, she was shocked to hear the muffled voice of Varrick who revealed that he was hiding in a stuffed platypus bear along with his assistant, Zhu Li."
    },
    {
      "body": "When Team Avatar arrived in Republic City to obtain military backing from ${link_0} ${link_1}, Asami left the rest of the group to check her company's latest figures. Needing a surefire way to make sales, she met up with Varrick and cut right down to business, bringing her company's bankruptcy into view. After pondering several ideas, Varrick suggested she sell mecha tanks to the Southerners and make profit from the brewing civil war. Asami agreed, citing it was a way to help her company and the Southern Water Tribe simultaneously.",
      "links": [
        {
          "body": "President",
          "key": "${link_0}",
          "target": {
            "href": "President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_1}",
          "target": {
            "href": "Raiko",
            "page": "Raiko"
          }
        }
      ],
      "text": "When Team Avatar arrived in Republic City to obtain military backing from President Raiko, Asami left the rest of the group to check her company's latest figures. Needing a surefire way to make sales, she met up with Varrick and cut right down to business, bringing her company's bankruptcy into view. After pondering several ideas, Varrick suggested she sell mecha tanks to the Southerners and make profit from the brewing civil war. Asami agreed, citing it was a way to help her company and the Southern Water Tribe simultaneously."
    },
    {
      "body": "${link_0} sold ${link_1} a controlling interest in ${link_2}, unaware that he was responsible for her warehouse being robbed.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_1}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "Future Industries",
          "key": "${link_2}",
          "target": {
            "href": "Future_Industries",
            "page": "Future_Industries"
          }
        }
      ],
      "text": "Asami sold Varrick a controlling interest in Future Industries, unaware that he was responsible for her warehouse being robbed."
    },
    {
      "body": "The day after her warehouse containing Future Industries equipment was raided, Asami met with Varrick and sold him a controlling share of Future Industries, effectively saving the company from the brink of bankruptcy. Asami was elated and now considered Varrick a business partner, valuable ally, and useful friend. Even when Mako proposed his claims that the businessman was the culprit who stole her merchandise, Asami denied his accusation, remarking that Varrick had saved her company and, furthermore, would not attack his own ships.",
      "links": [],
      "text": "The day after her warehouse containing Future Industries equipment was raided, Asami met with Varrick and sold him a controlling share of Future Industries, effectively saving the company from the brink of bankruptcy. Asami was elated and now considered Varrick a business partner, valuable ally, and useful friend. Even when Mako proposed his claims that the businessman was the culprit who stole her merchandise, Asami denied his accusation, remarking that Varrick had saved her company and, furthermore, would not attack his own ships."
    },
    {
      "body": "As Harmonic Convergence approached, Asami, along with the rest of Team Avatar visited Varrick in his extravagant jail cell. Asami chastised Varrick for stealing her property and attempting to kidnap the President, but she did acknowledge that he had saved her company. Varrick later gave Team Avatar the Zhu Li, the first battleship ever created, to make up for his actions.",
      "links": [],
      "text": "As Harmonic Convergence approached, Asami, along with the rest of Team Avatar visited Varrick in his extravagant jail cell. Asami chastised Varrick for stealing her property and attempting to kidnap the President, but she did acknowledge that he had saved her company. Varrick later gave Team Avatar the Zhu Li, the first battleship ever created, to make up for his actions."
    },
    {
      "body": "Weeks later, while dining with the Metal Clan in Zaofu, Asami was irritated upon Varrick's arrival, asking the fugitive what he was doing there. He avoided the question, and instead inquired about the state of Future Industries. Irritated, Asami explained that the sole control of Future Industries reverted to her after the businessman's plotting to abduct the President.",
      "links": [],
      "text": "Weeks later, while dining with the Metal Clan in Zaofu, Asami was irritated upon Varrick's arrival, asking the fugitive what he was doing there. He avoided the question, and instead inquired about the state of Future Industries. Irritated, Asami explained that the sole control of Future Industries reverted to her after the businessman's plotting to abduct the President."
    },
    {
      "body": "${link_0} placed ${link_1}'s hand in a lock to foreshadow the fate that would befall him if he double-crossed her ever again.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_1}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "text": "Asami placed Varrick's hand in a lock to foreshadow the fate that would befall him if he double-crossed her ever again."
    },
    {
      "body": "Three years later, Asami still had not forgiven Varrick for all he had done, such as taking over her company and bombing the Southern Water Tribe Cultural Center. Hearing him point out to President Raiko that he had only \"allegedly\" tried to kidnap him, she snapped at the eccentric inventor that everything he did was \"allegedly\". On the president's urging, she agreed to put her differences aside and work with him again in order to help Republic City and stop Kuvira, though when she took Varrick's offered hand, she placed it in a painful lock to foreshadow the fate that would befall him if he double-crossed her ever again.",
      "links": [],
      "text": "Three years later, Asami still had not forgiven Varrick for all he had done, such as taking over her company and bombing the Southern Water Tribe Cultural Center. Hearing him point out to President Raiko that he had only \"allegedly\" tried to kidnap him, she snapped at the eccentric inventor that everything he did was \"allegedly\". On the president's urging, she agreed to put her differences aside and work with him again in order to help Republic City and stop Kuvira, though when she took Varrick's offered hand, she placed it in a painful lock to foreshadow the fate that would befall him if he double-crossed her ever again."
    },
    {
      "body": "The two were able to work together to design and manufacture the ${link_0}, which proved to be instrumental in the defeat of Kuvira. Sometime later, Asami attended Varrick and Zhu Li's wedding, signifying the improvement of their relationship.",
      "links": [
        {
          "body": "hummingbird mecha suit",
          "key": "${link_0}",
          "target": {
            "href": "Hummingbird_mecha_suit",
            "page": "Hummingbird_mecha_suit"
          }
        }
      ],
      "text": "The two were able to work together to design and manufacture the hummingbird mecha suit, which proved to be instrumental in the defeat of Kuvira. Sometime later, Asami attended Varrick and Zhu Li's wedding, signifying the improvement of their relationship."
    },
    {
      "body": "${link_0} electroshocked the ${link_1} with ${link_2}.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Lieutenant",
          "key": "${link_1}",
          "target": {
            "href": "Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "his own weapon",
          "key": "${link_2}",
          "target": {
            "href": "Electrified_kali_sticks",
            "page": "Electrified_kali_sticks"
          }
        }
      ],
      "text": "Asami electroshocked the Lieutenant with his own weapon."
    },
    {
      "body": "From the start, Asami was always averse to ${link_0}'s crusade against benders. When her father was accused of having ties with the Equalists by Avatar Korra herself, an angry Asami called them \"awful\" while defending her father. After she discovered her father's affiliation with the Equalists, she turned on him and chose to help the Avatar. Her years of self-defense training made her a worthy opponent and she was able to easily incapacitate the ${link_1}, who attacked after she had electroshocked Hiroshi. Together with Korra, Mako, and Bolin, they formed the new Team Avatar, dedicated to patrolling Republic City and thwarting the Equalists' schemes. During their tenure, Asami served as the driver of the team and fought off the Equalists with one of their own weapons, an electrified glove.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Lieutenant",
          "key": "${link_1}",
          "target": {
            "href": "Lieutenant",
            "page": "Lieutenant"
          }
        }
      ],
      "text": "From the start, Asami was always averse to Amon's crusade against benders. When her father was accused of having ties with the Equalists by Avatar Korra herself, an angry Asami called them \"awful\" while defending her father. After she discovered her father's affiliation with the Equalists, she turned on him and chose to help the Avatar. Her years of self-defense training made her a worthy opponent and she was able to easily incapacitate the Lieutenant, who attacked after she had electroshocked Hiroshi. Together with Korra, Mako, and Bolin, they formed the new Team Avatar, dedicated to patrolling Republic City and thwarting the Equalists' schemes. During their tenure, Asami served as the driver of the team and fought off the Equalists with one of their own weapons, an electrified glove."
    },
    {
      "body": "Following the Harmonic Convergence, Asami accompanied Korra to rebuild the ${link_0}. When the splinter faction of the ${link_1} began to ${link_2} the world again after being incarcerated for thirteen years, Asami did everything she could to stop the Red Lotus from getting to Korra. When the organization did manage to capture the Avatar, Asami electrocuted a ${link_3} to enable the rest of Team Avatar to free the captive airbenders, which were used as leverage against Korra.",
      "links": [
        {
          "body": "Air Nation",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomads#Rebirth_of_a_nation",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Order of the White Lotus",
          "key": "${link_1}",
          "target": {
            "href": "Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        },
        {
          "body": "infiltrate",
          "key": "${link_2}",
          "target": {
            "href": "Insurrection_of_the_Red_Lotus",
            "page": "Insurrection_of_the_Red_Lotus"
          }
        },
        {
          "body": "Red Lotus sentry",
          "key": "${link_3}",
          "target": {
            "href": "Red_Lotus_sentries",
            "page": "Red_Lotus_sentries"
          }
        }
      ],
      "text": "Following the Harmonic Convergence, Asami accompanied Korra to rebuild the Air Nation. When the splinter faction of the Order of the White Lotus began to infiltrate the world again after being incarcerated for thirteen years, Asami did everything she could to stop the Red Lotus from getting to Korra. When the organization did manage to capture the Avatar, Asami electrocuted a Red Lotus sentry to enable the rest of Team Avatar to free the captive airbenders, which were used as leverage against Korra."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Asami_Sato%27s_relationships",
    "file": "avatar.wikia.com/wiki/Asami_Sato's_relationships.html",
    "page": "Asami_Sato's_relationships",
    "title": "Asami Sato's relationships"
  }
}