{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Books",
      "target": {
        "href": "Category_Books",
        "page": "Category_Books"
      }
    },
    {
      "body": "Print publications",
      "target": {
        "href": "Category_Print_publications",
        "page": "Category_Print_publications"
      }
    },
    {
      "body": "Real world",
      "target": {
        "href": "Category_Real_world",
        "page": "Category_Real_world"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Cover art for the book.",
      "links": [],
      "text": "Cover art for the book."
    },
    {
      "body": "Avatar: The Last Airbender—The Art of the Animated Series (ISBN 978-1-59582-504-9) is an artbook based on the animated series ${link_0}. The book contains concept art, design works, behind-the-scenes commentary by series founders ${link_1} and ${link_2}, along with other pieces of production artwork.",
      "links": [
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_0}",
          "target": {
            "href": "Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        },
        {
          "body": "Michael Dante DiMartino",
          "key": "${link_1}",
          "target": {
            "href": "Michael_Dante_DiMartino",
            "page": "Michael_Dante_DiMartino"
          }
        },
        {
          "body": "Bryan Konietzko",
          "key": "${link_2}",
          "target": {
            "href": "Bryan_Konietzko",
            "page": "Bryan_Konietzko"
          }
        }
      ],
      "text": "Avatar: The Last Airbender—The Art of the Animated Series (ISBN 978-1-59582-504-9) is an artbook based on the animated series Avatar: The Last Airbender. The book contains concept art, design works, behind-the-scenes commentary by series founders Michael Dante DiMartino and Bryan Konietzko, along with other pieces of production artwork."
    },
    {
      "body": "The book was released in stores on June 2, 2010. It consists of 184 pages, split into five chapters of the aforementioned material, most of which had never been revealed to the public before.",
      "links": [],
      "text": "The book was released in stores on June 2, 2010. It consists of 184 pages, split into five chapters of the aforementioned material, most of which had never been revealed to the public before."
    },
    {
      "body": "The book, combined with ${link_0}, has sold around thirty thousand copies.",
      "links": [
        {
          "body": "The Lost Adventures",
          "key": "${link_0}",
          "target": {
            "href": "List_of_Avatar__The_Last_Airbender_comics",
            "page": "List_of_Avatar__The_Last_Airbender_comics"
          }
        }
      ],
      "text": "The book, combined with The Lost Adventures, has sold around thirty thousand copies."
    },
    {
      "body": "The book contains five chapters:",
      "links": [],
      "text": "The book contains five chapters:"
    },
    {
      "body": "It also includes a foreword by the director of ${link_0}, ${link_1} (page six), and an introduction by Avatar creators Bryan Konietzko and Michael Dante DiMartino (page seven). The very last page contains a conclusion, which is again written by the creators.",
      "links": [
        {
          "body": "The Last Airbender",
          "key": "${link_0}",
          "target": {
            "href": "Film_The_Last_Airbender",
            "page": "Film_The_Last_Airbender"
          }
        },
        {
          "body": "M. Night Shyamalan",
          "key": "${link_1}",
          "target": {
            "href": "Film_M",
            "page": "Film_M"
          }
        }
      ],
      "text": "It also includes a foreword by the director of The Last Airbender, M. Night Shyamalan (page six), and an introduction by Avatar creators Bryan Konietzko and Michael Dante DiMartino (page seven). The very last page contains a conclusion, which is again written by the creators."
    },
    {
      "body": "The book explains how the series was created and gives one an idea of the efforts that went into such an endeavor. Thanks to the many beautiful illustrations, the book also lets the reader go a step further into the deep World of Avatar.",
      "links": [],
      "text": "The book explains how the series was created and gives one an idea of the efforts that went into such an endeavor. Thanks to the many beautiful illustrations, the book also lets the reader go a step further into the deep World of Avatar."
    },
    {
      "body": "Early concept art of ${link_0}, ${link_1}, and ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Momo",
          "key": "${link_2}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "Early concept art of Aang, Appa, and Momo."
    },
    {
      "body": "The pre- and early developmental stages were different to the series created. The two creators, Bryan Konietzko and Michael Dante DiMartino, brainstormed ideas on how to make an animation series, and not only made incredible progress with their dream to make a television show, but also began a journey that would lead them to a lifelong friendship. In the beginning, the show had a futuristic setting; ${link_0} was not an ${link_1} from a hundred years ago, but rather a boy from a lost civilization from over a thousand years prior. He had a robotic sidekick named Momo-3, who later became Aang's lemur ${link_2}, and a bear-dog that, while not making it into the series' cut, later became the inspiration for ${link_3} ${link_4}'s animal companion. According to Konietzko, Aang was originally \"a farmer kid, shepherding mammoth floating livestock like huge manatees ...\" He also goes on to state the original idea behind the arrow was to get the herd to trust him through imitation. This idea was later dropped, much to Bryan Konietzko's dislike, as there was no place for all of them in every episode. Nevertheless, they too played their part in the series, having inspired the idea of ${link_5}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Air Nomad",
          "key": "${link_1}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Momo",
          "key": "${link_2}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_4}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Appa",
          "key": "${link_5}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "The pre- and early developmental stages were different to the series created. The two creators, Bryan Konietzko and Michael Dante DiMartino, brainstormed ideas on how to make an animation series, and not only made incredible progress with their dream to make a television show, but also began a journey that would lead them to a lifelong friendship. In the beginning, the show had a futuristic setting; Aang was not an Air Nomad from a hundred years ago, but rather a boy from a lost civilization from over a thousand years prior. He had a robotic sidekick named Momo-3, who later became Aang's lemur Momo, and a bear-dog that, while not making it into the series' cut, later became the inspiration for Avatar Korra's animal companion. According to Konietzko, Aang was originally \"a farmer kid, shepherding mammoth floating livestock like huge manatees ...\" He also goes on to state the original idea behind the arrow was to get the herd to trust him through imitation. This idea was later dropped, much to Bryan Konietzko's dislike, as there was no place for all of them in every episode. Nevertheless, they too played their part in the series, having inspired the idea of Appa."
    },
    {
      "body": "An early sketch of ${link_0} and ${link_1} to emphasise the \"epic spirit of the series\".",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "An early sketch of Appa and Aang to emphasise the \"epic spirit of the series\"."
    },
    {
      "body": "As soon as the series had progressed to the point where Aang was going to be a child frozen in an iceberg for a hundred years, and the last hope for world peace, the characters of ${link_0} and ${link_1} were developed. Even though their designs at the time were still different, Bryan and Mike both knew that Katara and Sokka were going to become a major part of the show.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "As soon as the series had progressed to the point where Aang was going to be a child frozen in an iceberg for a hundred years, and the last hope for world peace, the characters of Katara and Sokka were developed. Even though their designs at the time were still different, Bryan and Mike both knew that Katara and Sokka were going to become a major part of the show."
    },
    {
      "body": "According to the two co-creators, in the very beginning the ${link_0} was the only villain planned for the show. Soon however, Eric Coleman, one of the members of the Avatar team, suggested an idea which gave birth to ${link_1}, the banished prince. With their idea finally ready, Bryan and Mike decided that it was time to make ${link_2}.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "the pilot",
          "key": "${link_2}",
          "target": {
            "href": "Unaired_pilot",
            "page": "Unaired_pilot"
          }
        }
      ],
      "text": "According to the two co-creators, in the very beginning the Fire Lord was the only villain planned for the show. Soon however, Eric Coleman, one of the members of the Avatar team, suggested an idea which gave birth to Zuko, the banished prince. With their idea finally ready, Bryan and Mike decided that it was time to make the pilot."
    },
    {
      "body": "The page dedicated to ${link_0}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "The page dedicated to Iroh."
    },
    {
      "body": "After the pilot and the series were accepted by Nickelodeon, Bryan and Mike started recruiting a larger team to make the series. After succeeding in finding a studio in South Korea, the team began work on the two-episode season premiere. ${link_0} was added while making the first episode; he was at first going to be Zuko's sifu, but later on became his uncle to make the story more personal. According to Bryan, ${link_1} made Iroh's character complete by adding a sense of humor to the character.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako_Iwamatsu",
            "page": "Mako_Iwamatsu"
          }
        }
      ],
      "text": "After the pilot and the series were accepted by Nickelodeon, Bryan and Mike started recruiting a larger team to make the series. After succeeding in finding a studio in South Korea, the team began work on the two-episode season premiere. Iroh was added while making the first episode; he was at first going to be Zuko's sifu, but later on became his uncle to make the story more personal. According to Bryan, Mako made Iroh's character complete by adding a sense of humor to the character."
    },
    {
      "body": "At first, only thirteen episodes were scheduled by Nickelodeon, thus making \"${link_0}\" the last episode. However, Nickelodeon's reaction to the thirteen episodes made was highly positive, and they let the show continue and expand. By the end of the first season, the series had connected with a wide audience, both male and female; the creators themselves admitted that they had never expected such a positive reaction and such a large audience.",
      "links": [
        {
          "body": "The Blue Spirit",
          "key": "${link_0}",
          "target": {
            "href": "The_Blue_Spirit",
            "page": "The_Blue_Spirit"
          }
        }
      ],
      "text": "At first, only thirteen episodes were scheduled by Nickelodeon, thus making \"The Blue Spirit\" the last episode. However, Nickelodeon's reaction to the thirteen episodes made was highly positive, and they let the show continue and expand. By the end of the first season, the series had connected with a wide audience, both male and female; the creators themselves admitted that they had never expected such a positive reaction and such a large audience."
    },
    {
      "body": "A visual comparison between the Great Wall of China, and the Outer Wall of ${link_0}.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "A visual comparison between the Great Wall of China, and the Outer Wall of Ba Sing Se."
    },
    {
      "body": "In forming the second season, the creators traveled to China to gain inspiration - particularly the architecture. Sites such as the Great Wall and the Forbidden City provided the scale used to inspire ${link_0}. After stumbling upon an architecture park, the duo found in an \"inspirational goldmine\", which happened to feature a vast array of Chinese architectural styles from a variety of ethnicities and eras.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "In forming the second season, the creators traveled to China to gain inspiration - particularly the architecture. Sites such as the Great Wall and the Forbidden City provided the scale used to inspire Ba Sing Se. After stumbling upon an architecture park, the duo found in an \"inspirational goldmine\", which happened to feature a vast array of Chinese architectural styles from a variety of ethnicities and eras."
    },
    {
      "body": "This chapter shows several of these pictures, alongside the artwork from the series that was inspired by each one. The influences of these images can be seen throughout the ${link_0}; the Great Wall can be directly related to the Outer Wall of Ba Sing Se.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "This chapter shows several of these pictures, alongside the artwork from the series that was inspired by each one. The influences of these images can be seen throughout the Earth Kingdom; the Great Wall can be directly related to the Outer Wall of Ba Sing Se."
    },
    {
      "body": "The third chapter goes into some detail of the episodes of the second series; however, it also explains and elaborates on the designs and personalities of newly introduced characters, such as ${link_0}, ${link_1} and ${link_2}, and ${link_3}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Mai",
          "key": "${link_1}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_2}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Toph",
          "key": "${link_3}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "The third chapter goes into some detail of the episodes of the second series; however, it also explains and elaborates on the designs and personalities of newly introduced characters, such as Azula, Mai and Ty Lee, and Toph."
    },
    {
      "body": "Concept art of the ${link_0} sequence performed by ${link_1} on ${link_2}.",
      "links": [
        {
          "body": "energybending",
          "key": "${link_0}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_2}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Concept art of the energybending sequence performed by Aang on Ozai."
    },
    {
      "body": "The fourth chapter goes into some detail how the third and final series developed, from the introduction of new characters, such as ${link_0} and ${link_1}, and the inspiration behind the unique landscape of the Fire Nation.",
      "links": [
        {
          "body": "Combustion Man",
          "key": "${link_0}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        },
        {
          "body": "Hama",
          "key": "${link_1}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        }
      ],
      "text": "The fourth chapter goes into some detail how the third and final series developed, from the introduction of new characters, such as Combustion Man and Hama, and the inspiration behind the unique landscape of the Fire Nation."
    },
    {
      "body": "This chapter showcases a significant number of background sketches and drawings, from ${link_0}, the ${link_1}, ${link_2} and ${link_3}, and the sunset over ${link_4}.",
      "links": [
        {
          "body": "Piandao's castle",
          "key": "${link_0}",
          "target": {
            "href": "Piandao%27s_castle",
            "page": "Piandao%27s_castle"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_1}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        },
        {
          "body": "Wulong Forest",
          "key": "${link_2}",
          "target": {
            "href": "Wulong_Forest",
            "page": "Wulong_Forest"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_3}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Iroh's tea shop",
          "key": "${link_4}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "text": "This chapter showcases a significant number of background sketches and drawings, from Piandao's castle, the Western Air Temple, Wulong Forest and Sozin's Comet, and the sunset over Iroh's tea shop."
    },
    {
      "body": "${link_0} Ozai is also showcased, given several pages to show the different character designs during different parts of the season. Great detail went onto explaining the four part finale, and how it transferred from the minds of the creators to the animation. It features sketches of the ${link_1} and ${link_2}, and the full sequence of Aang ${link_3}.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "lion turtle",
          "key": "${link_1}",
          "target": {
            "href": "Lion_turtle#Era_of_the_Avatar",
            "page": "Lion_turtle"
          }
        },
        {
          "body": "Fire Nation airships",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        },
        {
          "body": "energybending",
          "key": "${link_3}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        }
      ],
      "text": "Fire Lord Ozai is also showcased, given several pages to show the different character designs during different parts of the season. Great detail went onto explaining the four part finale, and how it transferred from the minds of the creators to the animation. It features sketches of the lion turtle and Fire Nation airships, and the full sequence of Aang energybending."
    },
    {
      "body": "An early example of the chibi-style artwork used in the ${link_0}.",
      "links": [
        {
          "body": "Super Deformed Shorts",
          "key": "${link_0}",
          "target": {
            "href": "Super_Deformed_Shorts",
            "page": "Super_Deformed_Shorts"
          }
        }
      ],
      "text": "An early example of the chibi-style artwork used in the Super Deformed Shorts."
    },
    {
      "body": "The last chapter features several additional pieces of artwork, such as promotional poster drawings, the DVD and volume covers. A birthday card, drawn by DiMartino for a girl who \"wanted [him] to make Aang alive\", and several caricatures of other storyboard artists are also shown. It also explains how the first 'super deformed' (SD) version of the characters came to be and gives a detailed page of the different expressions used for the characters in the three shorts. The end of the chapter is a simple thank-you note, acknowledging both their team and the reader.",
      "links": [],
      "text": "The last chapter features several additional pieces of artwork, such as promotional poster drawings, the DVD and volume covers. A birthday card, drawn by DiMartino for a girl who \"wanted [him] to make Aang alive\", and several caricatures of other storyboard artists are also shown. It also explains how the first 'super deformed' (SD) version of the characters came to be and gives a detailed page of the different expressions used for the characters in the three shorts. The end of the chapter is a simple thank-you note, acknowledging both their team and the reader."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Avatar:_The_Last_Airbender%E2%80%94The_Art_of_the_Animated_Series",
    "file": "avatar.wikia.com/wiki/Avatar__The_Last_Airbender—The_Art_of_the_Animated_Series.html",
    "page": "Avatar__The_Last_Airbender—The_Art_of_the_Animated_Series",
    "title": "Avatar: The Last Airbender—The Art of the Animated Series"
  }
}