{
  "categories": [
    {
      "body": "Articles with unsourced information",
      "target": {
        "external": false,
        "href": "/wiki/Category_Articles_with_unsourced_information",
        "page": "Category_Articles_with_unsourced_information"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Real world",
      "target": {
        "external": false,
        "href": "/wiki/Category_Real_world",
        "page": "Category_Real_world"
      }
    },
    {
      "body": "Trading Card Game",
      "target": {
        "external": false,
        "href": "/wiki/Category_Trading_Card_Game",
        "page": "Category_Trading_Card_Game"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The Avatar: The Last Airbender Trading Card Game is a collectible card game developed and produced by the ${link_0} and released in February 2006. In the game, the player takes on the role of one of the main or secondary characters from ${link_1} and duels another player in a match testing strength and abilities determined by the game's cards. The overall objective is to earn three points before the opposing player does; they can be gained when opponents have no further actions available to them. The game is part of the QuickStrike system of trading card games, which means it is compatible with various other card games from different areas of media and fiction.",
      "links": [
        {
          "body": "Upper Deck Company",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Upper_Deck_Company",
            "page": "Upper_Deck_Company"
          }
        },
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        }
      ],
      "section": [
        "Avatar: The Last Airbender Trading Card Game"
      ],
      "text": "The Avatar: The Last Airbender Trading Card Game is a collectible card game developed and produced by the Upper Deck Company and released in February 2006. In the game, the player takes on the role of one of the main or secondary characters from Avatar: The Last Airbender and duels another player in a match testing strength and abilities determined by the game's cards. The overall objective is to earn three points before the opposing player does; they can be gained when opponents have no further actions available to them. The game is part of the QuickStrike system of trading card games, which means it is compatible with various other card games from different areas of media and fiction."
    },
    {
      "body": "The original launch is titled Master of Elements and has a spread of 235 cards, including 55 common cards, 55 uncommon cards, 55 rare cards, and 10 Zenementals. These cards are further categorized as strike, ally, advantage, or Chamber, all of which differ in usage and effect. Since the initial release, multiple promotional cards and other additional cards have also been released, some of which come with the series' ${link_0}. Burger King also released eight promo cards, which were sold with Kids Meals between August 28 and September 30 of 2006.",
      "links": [
        {
          "body": "DVD collection",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/List_of_Avatar__The_Last_Airbender_DVDs",
            "page": "List_of_Avatar__The_Last_Airbender_DVDs"
          }
        }
      ],
      "section": [
        "Avatar: The Last Airbender Trading Card Game"
      ],
      "text": "The original launch is titled Master of Elements and has a spread of 235 cards, including 55 common cards, 55 uncommon cards, 55 rare cards, and 10 Zenementals. These cards are further categorized as strike, ally, advantage, or Chamber, all of which differ in usage and effect. Since the initial release, multiple promotional cards and other additional cards have also been released, some of which come with the series' DVD collection. Burger King also released eight promo cards, which were sold with Kids Meals between August 28 and September 30 of 2006."
    },
    {
      "body": "The Avatar Trading Card Game was idealized long before the show began to air on television. Upon the success of the ${link_0} in February 2004, Avatar: The Last Airbender was picked up for an order of thirteen episodes. Not long after the series was approved, ${link_1}, a small artistic design company, agreed to produce all of the card designs with the assistance of a few associates, only a year before the show would be televised. As time went on the VUDUBERI team was given a few more episodes to work with, allowing them use reference material separate from the pilot. Both ${link_2} and Upper Deck supervised every illustration and held each to a high standard, often sending cards back to VUDUBERI for revisions. Also, Upper Deck met with Avatar creators ${link_3} and ${link_4} as well as with Nickelodeon while this process was taking place in order to assure the \"best treatment\" was afforded to the property.",
      "links": [
        {
          "body": "series pilot",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Unaired_pilot",
            "page": "Unaired_pilot"
          }
        },
        {
          "body": "VUDUBERI",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/VUDUBERI",
            "page": "VUDUBERI"
          }
        },
        {
          "body": "Nickelodeon",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Nickelodeon",
            "page": "Nickelodeon"
          }
        },
        {
          "body": "Mike DiMartino",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Michael_Dante_DiMartino",
            "page": "Michael_Dante_DiMartino"
          }
        },
        {
          "body": "Bryan Konietzko",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Bryan_Konietzko",
            "page": "Bryan_Konietzko"
          }
        }
      ],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "History",
        "Conception"
      ],
      "text": "The Avatar Trading Card Game was idealized long before the show began to air on television. Upon the success of the series pilot in February 2004, Avatar: The Last Airbender was picked up for an order of thirteen episodes. Not long after the series was approved, VUDUBERI, a small artistic design company, agreed to produce all of the card designs with the assistance of a few associates, only a year before the show would be televised. As time went on the VUDUBERI team was given a few more episodes to work with, allowing them use reference material separate from the pilot. Both Nickelodeon and Upper Deck supervised every illustration and held each to a high standard, often sending cards back to VUDUBERI for revisions. Also, Upper Deck met with Avatar creators Mike DiMartino and Bryan Konietzko as well as with Nickelodeon while this process was taking place in order to assure the \"best treatment\" was afforded to the property."
    },
    {
      "body": "In February 2006, two years after the TCG project began, the Master of Elements starter sets finally went on the market. Joan Grasso, an executive in the toy department of Nickelodeon & Viacom Consumer Products at the time of the TCG's release, cited that \"Avatar has emerged as one of the most popular new shows for kids today with a deeply loyal and growing fan base that has been clamoring for Avatar merchandise ever since the show debuted,\" the TCG having been one of the answers to such high demand. Despite all expectations the game did not sell well, and by 2008 the TCG had been discontinued.[source?]",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "History",
        "Release and failure"
      ],
      "text": "In February 2006, two years after the TCG project began, the Master of Elements starter sets finally went on the market. Joan Grasso, an executive in the toy department of Nickelodeon & Viacom Consumer Products at the time of the TCG's release, cited that \"Avatar has emerged as one of the most popular new shows for kids today with a deeply loyal and growing fan base that has been clamoring for Avatar merchandise ever since the show debuted,\" the TCG having been one of the answers to such high demand. Despite all expectations the game did not sell well, and by 2008 the TCG had been discontinued.[source?]"
    },
    {
      "body": "The Avatar: The Last Airbender Master of Elements Official Rulebook is the compilation of all the TCG's guidelines and regulations. The rulebook includes directions for how to play the game, limitations for formal play, detailed descriptions of card types, and many other gameplay necessities. Named for the initial TCG starter pack release, this rulebook was included in every Master of Elements Starter Pack as the definitive set of Avatar TCG rules and principles for all modes of play. Due to the discontinuation of the card series, it remains the only source for such information.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Master of Elements Official Rulebook"
      ],
      "text": "The Avatar: The Last Airbender Master of Elements Official Rulebook is the compilation of all the TCG's guidelines and regulations. The rulebook includes directions for how to play the game, limitations for formal play, detailed descriptions of card types, and many other gameplay necessities. Named for the initial TCG starter pack release, this rulebook was included in every Master of Elements Starter Pack as the definitive set of Avatar TCG rules and principles for all modes of play. Due to the discontinuation of the card series, it remains the only source for such information."
    },
    {
      "body": "The Avatar: The Last Airbender Trading Card Game is played between two people, each of whom controls his or her own play mat. A play mat has three zones where, as the game progresses, each player comes to place his or her cards. Each player chooses his or her Chamber Card before the game begins. The Chamber Card (alternatively called simply the Chamber) is the player's character representation in the game, and the plot of the game makes it so that the characters on each Chamber are battling each other, with the other card types being some form of the Chamber character's allies, abilities, or skills. The Chamber also has a double-sided card hidden within it, called the character's signature move. Of the three zones on the play mat, the green zone contains the Chamber Card, the yellow zone the deck, and the red zone the discard pile.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Introductory overview"
      ],
      "text": "The Avatar: The Last Airbender Trading Card Game is played between two people, each of whom controls his or her own play mat. A play mat has three zones where, as the game progresses, each player comes to place his or her cards. Each player chooses his or her Chamber Card before the game begins. The Chamber Card (alternatively called simply the Chamber) is the player's character representation in the game, and the plot of the game makes it so that the characters on each Chamber are battling each other, with the other card types being some form of the Chamber character's allies, abilities, or skills. The Chamber also has a double-sided card hidden within it, called the character's signature move. Of the three zones on the play mat, the green zone contains the Chamber Card, the yellow zone the deck, and the red zone the discard pile."
    },
    {
      "body": "There are other card types in the game besides the Chamber Card: strike, advantage, and ally. Strike cards will usually make up the bulk of a player's deck. They are the \"front line\" components of any game, containing offensive and defensive values called force and intercept that determine the viability of the card to stand against another strike card. For example, a strike with intercept value 3 does not have enough defensive capabilities to stand against an opposing strike with force value 5, so it would be defeated if attacked by the opposing strike. A strike defeated by an opposing player's strike is placed in the discard pile or focused into the energy of the zone in which it lost. An advantage card has the ability to aid the player who draws it in predetermined ways based on its ability outlined in the respective card's description. An ally card represents a character from the series who comes to assist the Chamber character. The zone in which an ally is played becomes known by the name of that ally, e.g. \"Sokka's Zone\" if the Sokka ally card is played. Otherwise, the ally often has similar effects to those of advantage cards.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Introductory overview"
      ],
      "text": "There are other card types in the game besides the Chamber Card: strike, advantage, and ally. Strike cards will usually make up the bulk of a player's deck. They are the \"front line\" components of any game, containing offensive and defensive values called force and intercept that determine the viability of the card to stand against another strike card. For example, a strike with intercept value 3 does not have enough defensive capabilities to stand against an opposing strike with force value 5, so it would be defeated if attacked by the opposing strike. A strike defeated by an opposing player's strike is placed in the discard pile or focused into the energy of the zone in which it lost. An advantage card has the ability to aid the player who draws it in predetermined ways based on its ability outlined in the respective card's description. An ally card represents a character from the series who comes to assist the Chamber character. The zone in which an ally is played becomes known by the name of that ally, e.g. \"Sokka's Zone\" if the Sokka ally card is played. Otherwise, the ally often has similar effects to those of advantage cards."
    },
    {
      "body": "Throughout the game, cards are flipped onto the play mat by that mat's owner from the deck. Depending on the card type, the flipped card goes into a designated area of the respective zone. A strike remains in the \"Flip Here\" area of the zone after being flipped from the deck; an ally is moved to the \"Ally\" area of the zone; and an advantage is moved to the \"Advantage Area\", only one of which is on a single play mat, unlike the other areas for which there is one per zone. However, in order to put a flipped card in play, it must be paid for with green, yellow, and/or red energies, three of which are placed in each respective zone at the beginning of the game, chosen from the top of the deck and placed face-down. Energies can be created throughout the game by methods including replenishment and focusing. The amount and color of the energies necessary for card payment are found in the sidebar of each strike, ally, and advantage card.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Introductory overview"
      ],
      "text": "Throughout the game, cards are flipped onto the play mat by that mat's owner from the deck. Depending on the card type, the flipped card goes into a designated area of the respective zone. A strike remains in the \"Flip Here\" area of the zone after being flipped from the deck; an ally is moved to the \"Ally\" area of the zone; and an advantage is moved to the \"Advantage Area\", only one of which is on a single play mat, unlike the other areas for which there is one per zone. However, in order to put a flipped card in play, it must be paid for with green, yellow, and/or red energies, three of which are placed in each respective zone at the beginning of the game, chosen from the top of the deck and placed face-down. Energies can be created throughout the game by methods including replenishment and focusing. The amount and color of the energies necessary for card payment are found in the sidebar of each strike, ally, and advantage card."
    },
    {
      "body": "Each player begins the game in his or her green zone. Each time a player's strike card is defeated by the opponent's strike card, that strike can either become an energy of that zone by being placed face-down in the energy portion of the zone, which is one form of focusing, or it can be discarded, pending the discretion of the player. From here, since the player was defeated in the green zone, he or she begins to flip cards into the yellow zone instead. Once defeated in the yellow zone, cards are subsequently flipped into the red zone. However, if in this chain of defeats the losing player manages to flip a strike card that has sufficient intercept to ward off the opponent's winning strike card, the opponent must begin to defend his or her own zones against the counterattack by flipping cards. Before beginning this new chain of flips, cleanup must be initiated on the part of the defendant (see the glossary for details) followed by other stipulations pertaining to energy replenishment (see \"How to play\"). If defeated in the red zone, the newly vanquished player has lost the round and the opposite player earns a point. The first player to earn three points wins the game.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Introductory overview"
      ],
      "text": "Each player begins the game in his or her green zone. Each time a player's strike card is defeated by the opponent's strike card, that strike can either become an energy of that zone by being placed face-down in the energy portion of the zone, which is one form of focusing, or it can be discarded, pending the discretion of the player. From here, since the player was defeated in the green zone, he or she begins to flip cards into the yellow zone instead. Once defeated in the yellow zone, cards are subsequently flipped into the red zone. However, if in this chain of defeats the losing player manages to flip a strike card that has sufficient intercept to ward off the opponent's winning strike card, the opponent must begin to defend his or her own zones against the counterattack by flipping cards. Before beginning this new chain of flips, cleanup must be initiated on the part of the defendant (see the glossary for details) followed by other stipulations pertaining to energy replenishment (see \"How to play\"). If defeated in the red zone, the newly vanquished player has lost the round and the opposite player earns a point. The first player to earn three points wins the game."
    },
    {
      "body": "Any game of this TCG begins with each player shuffling his or her deck without including the Chamber Card in the deck. There are two play mats, one per player, which are placed on a level surface in a fashion so that the top of one mat overlaps with the top of the other mat, enough so that there becomes only one advantage area per player. The Chamber Card, with the image of an Avatar character adorning the front, represents the character who the player will act as during the game and is placed trait symbol-side up on the \"Chamber\" area of the play mat. The deck is placed in its titular space as well.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Early setup"
      ],
      "text": "Any game of this TCG begins with each player shuffling his or her deck without including the Chamber Card in the deck. There are two play mats, one per player, which are placed on a level surface in a fashion so that the top of one mat overlaps with the top of the other mat, enough so that there becomes only one advantage area per player. The Chamber Card, with the image of an Avatar character adorning the front, represents the character who the player will act as during the game and is placed trait symbol-side up on the \"Chamber\" area of the play mat. The deck is placed in its titular space as well."
    },
    {
      "body": "Unlike the vast majority of trading card games, the QuickStrike system of gameplay, which as mentioned earlier is the system used for the Avatar TCG, does not have the players hold a hand of cards from which they choose what to put into play. Instead, the players flip cards from the tops of their decks. Since the deck of cards is presented in a face-down position, the player does not know what cards he or she will flip over onto the playing mat. The areas onto which the player flips the cards are marked \"Flip Here\". Both players should be able to see any flipped card – there is no concealment from the opposite player in concern to cards that have been flipped. Once a card has been flipped onto the green \"Flip Here\" area of the mat, the player should take care to examine which card he or she has flipped. It may be a strike card.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Inexact overview and brief explanation of strike system"
      ],
      "text": "Unlike the vast majority of trading card games, the QuickStrike system of gameplay, which as mentioned earlier is the system used for the Avatar TCG, does not have the players hold a hand of cards from which they choose what to put into play. Instead, the players flip cards from the tops of their decks. Since the deck of cards is presented in a face-down position, the player does not know what cards he or she will flip over onto the playing mat. The areas onto which the player flips the cards are marked \"Flip Here\". Both players should be able to see any flipped card – there is no concealment from the opposite player in concern to cards that have been flipped. Once a card has been flipped onto the green \"Flip Here\" area of the mat, the player should take care to examine which card he or she has flipped. It may be a strike card."
    },
    {
      "body": "A strike card consists of two vital-to-understand values: an intercept number and a force number. The intercept number is a measure of the defensive strength of the card. A high intercept number means strong defense against an enemy attack, and a low number means a weak and possibly vulnerable defense stat. Oftentimes a lower intercept number is balanced by a higher force number, which is a measure of the offensive strength of the card. A force number works in the same way that an Intercept number does: high means strong offense, low means weak offense.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Inexact overview and brief explanation of strike system"
      ],
      "text": "A strike card consists of two vital-to-understand values: an intercept number and a force number. The intercept number is a measure of the defensive strength of the card. A high intercept number means strong defense against an enemy attack, and a low number means a weak and possibly vulnerable defense stat. Oftentimes a lower intercept number is balanced by a higher force number, which is a measure of the offensive strength of the card. A force number works in the same way that an Intercept number does: high means strong offense, low means weak offense."
    },
    {
      "body": "As mentioned above and visible in the first image of this subsection, the play mat has three colored zones. Each zone represents a chance for the player to put a stop to an opponent's strike card, otherwise known as an opponent's strike, and the zone's color represents the level of danger: an opponent's attack into the green zone is not extremely troublesome or unsafe for the player being attacked; an opponent's attack into the yellow zone is a bit more risky, and an attack into the red zone is very unsafe and dangerous for the player being attacked. All of this is because the green zone is each player's first line of defense, the yellow zone is the second, and the red zone is the last. If any player runs out of zones (has each zone attacked) without being able to stop any of the strikes, the opposite player scores one point.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Inexact overview and brief explanation of strike system"
      ],
      "text": "As mentioned above and visible in the first image of this subsection, the play mat has three colored zones. Each zone represents a chance for the player to put a stop to an opponent's strike card, otherwise known as an opponent's strike, and the zone's color represents the level of danger: an opponent's attack into the green zone is not extremely troublesome or unsafe for the player being attacked; an opponent's attack into the yellow zone is a bit more risky, and an attack into the red zone is very unsafe and dangerous for the player being attacked. All of this is because the green zone is each player's first line of defense, the yellow zone is the second, and the red zone is the last. If any player runs out of zones (has each zone attacked) without being able to stop any of the strikes, the opposite player scores one point."
    },
    {
      "body": "In order to stop an opponent's strike, the player being attacked must flip one card with a higher intercept number than the attacking card's force number. If the card that has been flipped does not have a higher intercept value than the attacking Force value, the attacking player strikes down the card, which was in the green zone, bringing the defeated player into the yellow zone. If this happens in the yellow and red zones as well, the opponent has broken the player's defenses and scored a point. If either player earns three points, the game is won by he or she who earned the three points.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Inexact overview and brief explanation of strike system"
      ],
      "text": "In order to stop an opponent's strike, the player being attacked must flip one card with a higher intercept number than the attacking card's force number. If the card that has been flipped does not have a higher intercept value than the attacking Force value, the attacking player strikes down the card, which was in the green zone, bringing the defeated player into the yellow zone. If this happens in the yellow and red zones as well, the opponent has broken the player's defenses and scored a point. If either player earns three points, the game is won by he or she who earned the three points."
    },
    {
      "body": "Payment powers are optional abilities available only in cards designated with a → symbol. Found in the rules text of some cards, payment powers are capable of supplying additional \"perks\" to a card that may make the game turn in the favor of the player who chooses to enact them. A payment power must always be paid for with whatever is listed as the cost. Unless otherwise noted on the card, a payment power may be paid for and the effect may thus be reused as many times as the player chooses. In the case of a strike card, the cost of the payment power must be covered before the overall sidebar cost of the strike is bought (see below for further details on payment).",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Inexact overview and brief explanation of strike system",
        "Payment powers"
      ],
      "text": "Payment powers are optional abilities available only in cards designated with a → symbol. Found in the rules text of some cards, payment powers are capable of supplying additional \"perks\" to a card that may make the game turn in the favor of the player who chooses to enact them. A payment power must always be paid for with whatever is listed as the cost. Unless otherwise noted on the card, a payment power may be paid for and the effect may thus be reused as many times as the player chooses. In the case of a strike card, the cost of the payment power must be covered before the overall sidebar cost of the strike is bought (see below for further details on payment)."
    },
    {
      "body": "There are certain stipulations for using payment powers in the cases of some cards with unusual payment powers. For example, sometimes a payment power's cost is not paid for in energies, but in the intercept value of the card. One must be careful when considering the use of this such payment power: if this power is paid for enough so that the intercept of the card is not high enough to withstand the force of an opponent card's attack, then that strike becomes unable to counterattack. Furthermore, a strike's intercept is not allowed to be lowered beyond zero through payment of the cost of payment powers.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Inexact overview and brief explanation of strike system",
        "Payment powers"
      ],
      "text": "There are certain stipulations for using payment powers in the cases of some cards with unusual payment powers. For example, sometimes a payment power's cost is not paid for in energies, but in the intercept value of the card. One must be careful when considering the use of this such payment power: if this power is paid for enough so that the intercept of the card is not high enough to withstand the force of an opponent card's attack, then that strike becomes unable to counterattack. Furthermore, a strike's intercept is not allowed to be lowered beyond zero through payment of the cost of payment powers."
    },
    {
      "body": "Any game of the Avatar TCG begins with each player placing starting energy on his or her side of the mat. A starting energy is represented by whatever amount of face-down cards are on the right-hand side of a respective player's zones. At the beginning of the game, before either player flips cards into the \"Flip Here\" areas and begins to use strike attacks, one should take nine cards from the top of one's deck without looking at what they are and place them in the designated starting energy areas (see illustration to the right). Each card is considered to be one starting energy. Energies in the green zone are called \"green energies\", energies in the yellow zone \"yellow energies\", and energies in the red zone \"red energies\".",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Further setup information and the opening attack"
      ],
      "text": "Any game of the Avatar TCG begins with each player placing starting energy on his or her side of the mat. A starting energy is represented by whatever amount of face-down cards are on the right-hand side of a respective player's zones. At the beginning of the game, before either player flips cards into the \"Flip Here\" areas and begins to use strike attacks, one should take nine cards from the top of one's deck without looking at what they are and place them in the designated starting energy areas (see illustration to the right). Each card is considered to be one starting energy. Energies in the green zone are called \"green energies\", energies in the yellow zone \"yellow energies\", and energies in the red zone \"red energies\"."
    },
    {
      "body": "After the starting energies have been placed, it is time to determine who will make the first move in the game. Each player draws four cards from the top of his or her deck and puts them onto the \"Discard Area\" of his or her playing mat, henceforth known as the discard pile. Unlike with the energies, cards in the discard are placed face-up. The players add up the force values from those four cards, and whichever player has the higher force value total goes first. Ally and advantage cards, which will be detailed later, are worth zero and add nothing to the player's force total.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Further setup information and the opening attack"
      ],
      "text": "After the starting energies have been placed, it is time to determine who will make the first move in the game. Each player draws four cards from the top of his or her deck and puts them onto the \"Discard Area\" of his or her playing mat, henceforth known as the discard pile. Unlike with the energies, cards in the discard are placed face-up. The players add up the force values from those four cards, and whichever player has the higher force value total goes first. Ally and advantage cards, which will be detailed later, are worth zero and add nothing to the player's force total."
    },
    {
      "body": "The player who goes first shall be known from now on as Player 1, who shall be male. For the purposes of this outline, Player 1 has earned the opening attack, forcing his opponent (Player 2, female) to defend. The opening attack always has a force number of 4 and executes its offense just as a normal strike would, except the opening attack is not represented on a card like all other strikes will be. Before Player 1 can execute an opening attack, however, Player 2 should add another energy to the green zone (that is, add a green energy) as consolation for having to defend against the opening attack. Aside from the energies that are added at the beginning of the game, all further energies come from the discard pile. Therefore, a player who is to defend against an opening attack will take whatever card is on top of his or her discard pile and bring it to the green zone, where he or she will place the card face-down. Doing so adds one more energy to the green zone, which can aid the player in his or her defense.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Further setup information and the opening attack"
      ],
      "text": "The player who goes first shall be known from now on as Player 1, who shall be male. For the purposes of this outline, Player 1 has earned the opening attack, forcing his opponent (Player 2, female) to defend. The opening attack always has a force number of 4 and executes its offense just as a normal strike would, except the opening attack is not represented on a card like all other strikes will be. Before Player 1 can execute an opening attack, however, Player 2 should add another energy to the green zone (that is, add a green energy) as consolation for having to defend against the opening attack. Aside from the energies that are added at the beginning of the game, all further energies come from the discard pile. Therefore, a player who is to defend against an opening attack will take whatever card is on top of his or her discard pile and bring it to the green zone, where he or she will place the card face-down. Doing so adds one more energy to the green zone, which can aid the player in his or her defense."
    },
    {
      "body": "With the above accomplished, Player 2 flips one card from her deck into the green zone's \"Flip Here\" area. Whatever is on the front of this card must have a higher intercept number than the opening attack's force number (which is 4), lest it be struck down and defeated. For example, if Player 2 draws a card with a value 7 intercept, it is strong enough to hold off the opening strike of value 4 Force. There is a catch to this, however: in order to use the flipped card, one must pay for it with the energies in one's zones.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Further setup information and the opening attack"
      ],
      "text": "With the above accomplished, Player 2 flips one card from her deck into the green zone's \"Flip Here\" area. Whatever is on the front of this card must have a higher intercept number than the opening attack's force number (which is 4), lest it be struck down and defeated. For example, if Player 2 draws a card with a value 7 intercept, it is strong enough to hold off the opening strike of value 4 Force. There is a catch to this, however: in order to use the flipped card, one must pay for it with the energies in one's zones."
    },
    {
      "body": "The cost of using a flipped card can be seen on the side of the card (see illustration to the right) and is termed the sidebar cost. Using the above example, if the card with a value 7 intercept has a 2 in the red color and a 1 in the yellow color, the player must take the appropriate number of cards from the respective energy zones and place them in the discard pile face-up. By \"paying\" for the card with the energies, it becomes officially in-play. After being paid for, a flipped strike card gets turned sideways (placed horizontally with the top side of the card pointing to the left side of the mat and the bottom side pointing to the right) to illustrate its counterattack stance, meaning that it is now the opponent who must defend against the value 7 Intercept card. We will say that Player 2 flips the value 7 Intercept card and pays for it, thereby performing a counterattack on Player 1 and forcing Player 1 to go on the defensive.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Further setup information and the opening attack"
      ],
      "text": "The cost of using a flipped card can be seen on the side of the card (see illustration to the right) and is termed the sidebar cost. Using the above example, if the card with a value 7 intercept has a 2 in the red color and a 1 in the yellow color, the player must take the appropriate number of cards from the respective energy zones and place them in the discard pile face-up. By \"paying\" for the card with the energies, it becomes officially in-play. After being paid for, a flipped strike card gets turned sideways (placed horizontally with the top side of the card pointing to the left side of the mat and the bottom side pointing to the right) to illustrate its counterattack stance, meaning that it is now the opponent who must defend against the value 7 Intercept card. We will say that Player 2 flips the value 7 Intercept card and pays for it, thereby performing a counterattack on Player 1 and forcing Player 1 to go on the defensive."
    },
    {
      "body": "Having flipped a card with more intercept than her opponent's opening attack force, Player 2 gets to perform a counterattack. A counterattack is the result of an attacking player's card being too weak to strike down the defending player's card. When this occurs, the player who was on the defensive switches his or her card to an offensive stance, as explained at the end of the above subsection, and the opposite player must defend his or her zone.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Replenishing energy, focusing, and defending from counterattacks"
      ],
      "text": "Having flipped a card with more intercept than her opponent's opening attack force, Player 2 gets to perform a counterattack. A counterattack is the result of an attacking player's card being too weak to strike down the defending player's card. When this occurs, the player who was on the defensive switches his or her card to an offensive stance, as explained at the end of the above subsection, and the opposite player must defend his or her zone."
    },
    {
      "body": "Before flipping a card into the green zone, Player 1, who is now defending his green zone just as Player 2 had done for hers, must replenish his energy. To replenish means to collect energies from the discard pile and place them into the colored zones. In which zones the energies are placed depends on the zone that the now attacking player (in this case, Player 2) defended in the last turn. To use the previous example, since Player 2 flipped the value 7 intercept card into the green zone, she was defending her green zone. Therefore, the now defending player (in this case, Player 1) replenishes his energy by taking one card from the discard pile and placing it into the green zone face-down as an energy. If Player 2 had made the counterattack from her yellow zone, Player 1 would add one energy to the green zone and one to the yellow zone. If Player 2 had been defending her red zone, Player 1 would add one energy to the green zone, one to the yellow, and one to the red.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Replenishing energy, focusing, and defending from counterattacks"
      ],
      "text": "Before flipping a card into the green zone, Player 1, who is now defending his green zone just as Player 2 had done for hers, must replenish his energy. To replenish means to collect energies from the discard pile and place them into the colored zones. In which zones the energies are placed depends on the zone that the now attacking player (in this case, Player 2) defended in the last turn. To use the previous example, since Player 2 flipped the value 7 intercept card into the green zone, she was defending her green zone. Therefore, the now defending player (in this case, Player 1) replenishes his energy by taking one card from the discard pile and placing it into the green zone face-down as an energy. If Player 2 had made the counterattack from her yellow zone, Player 1 would add one energy to the green zone and one to the yellow zone. If Player 2 had been defending her red zone, Player 1 would add one energy to the green zone, one to the yellow, and one to the red."
    },
    {
      "body": "Once Player 1 has replenished his energy, it is time for him to flip a card into his green zone. If Player 1's flipped card has a higher intercept than the counterattacking card's force, Player 1's card takes on the stance of a counterattack and Player 2 must replenish energy, flip a card, and so on. However, if Player 1's flipped card has less intercept than the opposing card's force, Player 1 may either discard the flipped card or focus it into the green zone. Focusing is the act of converting a flipped card into an energy. If the flipped card has less intercept than the opposing card's force, that card should be moved into the energy area of whichever zone it was flipped, which is focusing, or it should simply be discarded if the player so chooses. Either of these options may also be taken if the player does not wish to use the card he or she has flipped, even if it has adequate defenses to stand.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Replenishing energy, focusing, and defending from counterattacks"
      ],
      "text": "Once Player 1 has replenished his energy, it is time for him to flip a card into his green zone. If Player 1's flipped card has a higher intercept than the counterattacking card's force, Player 1's card takes on the stance of a counterattack and Player 2 must replenish energy, flip a card, and so on. However, if Player 1's flipped card has less intercept than the opposing card's force, Player 1 may either discard the flipped card or focus it into the green zone. Focusing is the act of converting a flipped card into an energy. If the flipped card has less intercept than the opposing card's force, that card should be moved into the energy area of whichever zone it was flipped, which is focusing, or it should simply be discarded if the player so chooses. Either of these options may also be taken if the player does not wish to use the card he or she has flipped, even if it has adequate defenses to stand."
    },
    {
      "body": "For this example, we will say that the card Player 1 flips has an insufficient intercept value to defend. Since it was defending the green zone and was unable to stand against the strike, Player 2 decides to focus the card by placing it in the green energy zone face-down. Now that the card has been struck down, Player 1 has lost his or her green zone and must defend the yellow zone from this point forward. Anytime a player is forced to focus or discard a strike, unless otherwise noted, the next step is to begin defending the next zone down. Player 1 now flips a card into his yellow zone. If it has too little intercept to defend against the already-in-play opposing card, it also must be focused or discarded. If focused, it would this time be placed in the yellow zone. This process will repeat until the player flips a card with sufficient intercept to counterattack against the opponent; if a card with sufficient intercept is not flipped in the red zone, Player 2 would earn a point (further details of points will come later). For this outline, we will presume that the first card Player 1 flips into the yellow zone has sufficient intercept and that he or she performs an counterattack, thereby forcing Player 2 to defend once again; next time Player 1 is made to defend his zones, the cycle of zones begins anew, meaning that he will flip cards into his green zone once again.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Replenishing energy, focusing, and defending from counterattacks"
      ],
      "text": "For this example, we will say that the card Player 1 flips has an insufficient intercept value to defend. Since it was defending the green zone and was unable to stand against the strike, Player 2 decides to focus the card by placing it in the green energy zone face-down. Now that the card has been struck down, Player 1 has lost his or her green zone and must defend the yellow zone from this point forward. Anytime a player is forced to focus or discard a strike, unless otherwise noted, the next step is to begin defending the next zone down. Player 1 now flips a card into his yellow zone. If it has too little intercept to defend against the already-in-play opposing card, it also must be focused or discarded. If focused, it would this time be placed in the yellow zone. This process will repeat until the player flips a card with sufficient intercept to counterattack against the opponent; if a card with sufficient intercept is not flipped in the red zone, Player 2 would earn a point (further details of points will come later). For this outline, we will presume that the first card Player 1 flips into the yellow zone has sufficient intercept and that he or she performs an counterattack, thereby forcing Player 2 to defend once again; next time Player 1 is made to defend his zones, the cycle of zones begins anew, meaning that he will flip cards into his green zone once again."
    },
    {
      "body": "A new turn begins whenever a player performs a counterattack and, if applicable, any effects of the counterattack have been carried out; whoever is defending from this counterattack initiates the new turn. The only time this procedure is not followed is in the case of the opening attack, at which early point in the game none of the new turn formalities can possibly be carried out. Since Player 1 has initiated the new turn by relaying a counterattach, Player 2 has just been delegated to continue the new turn by flipping a new card into her green zone. Before she does this, however, she must clean up her side of the board. The process of cleanup takes place before starting a turn and executes like so: the player now defending from a counterattack should take all of the cards that he or she employed for the last turn's defense except for energy and ally cards and place them face-up into his or her discard pile (the function of an ally card will be detailed later). For this outline, Player 2 will now remove the card that previously attacked Player 1 from the green zone and put it into her discard pile; there are no other cards on her play mat that she has to clean up.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "New turns, cleanup, advantage cards, and charges"
      ],
      "text": "A new turn begins whenever a player performs a counterattack and, if applicable, any effects of the counterattack have been carried out; whoever is defending from this counterattack initiates the new turn. The only time this procedure is not followed is in the case of the opening attack, at which early point in the game none of the new turn formalities can possibly be carried out. Since Player 1 has initiated the new turn by relaying a counterattach, Player 2 has just been delegated to continue the new turn by flipping a new card into her green zone. Before she does this, however, she must clean up her side of the board. The process of cleanup takes place before starting a turn and executes like so: the player now defending from a counterattack should take all of the cards that he or she employed for the last turn's defense except for energy and ally cards and place them face-up into his or her discard pile (the function of an ally card will be detailed later). For this outline, Player 2 will now remove the card that previously attacked Player 1 from the green zone and put it into her discard pile; there are no other cards on her play mat that she has to clean up."
    },
    {
      "body": "As shown in the previous subsection, Player 2 now replenishes energy from the discard pile into her green and yellow zones, one energy each, as Player 1 counterattacked from the yellow zone in the last turn. After this, Player 2 flips a card from her deck into the green zone. If it is a strike card, the game continues as has already been outlined above. There are other cards besides strike cards, however. One possible draw from the deck is an advantage card. An advantage card is not an offense- or defense-based card in the vein of strikes, instead being used to aid or assist the player who draws it in a number of different ways. Some advantage cards allow the player to scan through his or her deck, while others strengthen a strike's force or alter the amount of a player's energy.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "New turns, cleanup, advantage cards, and charges"
      ],
      "text": "As shown in the previous subsection, Player 2 now replenishes energy from the discard pile into her green and yellow zones, one energy each, as Player 1 counterattacked from the yellow zone in the last turn. After this, Player 2 flips a card from her deck into the green zone. If it is a strike card, the game continues as has already been outlined above. There are other cards besides strike cards, however. One possible draw from the deck is an advantage card. An advantage card is not an offense- or defense-based card in the vein of strikes, instead being used to aid or assist the player who draws it in a number of different ways. Some advantage cards allow the player to scan through his or her deck, while others strengthen a strike's force or alter the amount of a player's energy."
    },
    {
      "body": "Just like strikes, the cost for playing an advantage is determined by the sidebar, which shows how many energies must be paid and from what zones they must come. If the player does not choose to pay for the advantage card, he or she flips another card from the deck and the advantage is focused into an energy or, in the player so chooses, is discarded, just as would a strike. Unlike with strikes, however, choosing not to pay for an advantage card does not force the player to begin defending in his or her next zone down.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "New turns, cleanup, advantage cards, and charges"
      ],
      "text": "Just like strikes, the cost for playing an advantage is determined by the sidebar, which shows how many energies must be paid and from what zones they must come. If the player does not choose to pay for the advantage card, he or she flips another card from the deck and the advantage is focused into an energy or, in the player so chooses, is discarded, just as would a strike. Unlike with strikes, however, choosing not to pay for an advantage card does not force the player to begin defending in his or her next zone down."
    },
    {
      "body": "On the other hand, paying for the advantage makes use of the card until the player performs the next cleanup. For example, the card in the image is Open-Hand Form. If paid for, it will remain in play for the remainder of the turn, raising the force value of each strike card by one. Assuming the player pays for the advantage card, the card is placed in the advantage area of the play mat. This procedure goes for all advantage cards, not just Open-Hand Form. The advantage area is located just above the green zone. When placed in the advantage area, the card is officially in play. To continue the outline, Player 2 will pay for Open-Hand Form and put it in her advantage area, thereby activating the card and its ability.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "New turns, cleanup, advantage cards, and charges"
      ],
      "text": "On the other hand, paying for the advantage makes use of the card until the player performs the next cleanup. For example, the card in the image is Open-Hand Form. If paid for, it will remain in play for the remainder of the turn, raising the force value of each strike card by one. Assuming the player pays for the advantage card, the card is placed in the advantage area of the play mat. This procedure goes for all advantage cards, not just Open-Hand Form. The advantage area is located just above the green zone. When placed in the advantage area, the card is officially in play. To continue the outline, Player 2 will pay for Open-Hand Form and put it in her advantage area, thereby activating the card and its ability."
    },
    {
      "body": "Having played the advantage, Player 2 has charged her green zone. A charge occurs in the zone a player was defending when he or she played an advantage card, among other charge methods (if this player was in the yellow zone when he or she played the advantage, the charge would occur there, not in the green zone). The three zones of both participants are uncharged at the beginning of every game. However, by employing advantage cards or using specific abilities, some or all of the zones have the chance of becoming charged.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "New turns, cleanup, advantage cards, and charges"
      ],
      "text": "Having played the advantage, Player 2 has charged her green zone. A charge occurs in the zone a player was defending when he or she played an advantage card, among other charge methods (if this player was in the yellow zone when he or she played the advantage, the charge would occur there, not in the green zone). The three zones of both participants are uncharged at the beginning of every game. However, by employing advantage cards or using specific abilities, some or all of the zones have the chance of becoming charged."
    },
    {
      "body": "To illustrate the change of the green zone's status from uncharged to charged, a player turns the Chamber Card in the green zone from vertically inclined to horizontally inclined, with the top of the card pointing to the left side of the mat and the bottom pointing to the right, similar to putting a strike card into the counterattack position. For the yellow and red zones, one simply turns the deck stack and discard pile respectively into this position as well. Managing to charge all three zones results in the possibility for a player to perform a signature move (details below).",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "New turns, cleanup, advantage cards, and charges"
      ],
      "text": "To illustrate the change of the green zone's status from uncharged to charged, a player turns the Chamber Card in the green zone from vertically inclined to horizontally inclined, with the top of the card pointing to the left side of the mat and the bottom pointing to the right, similar to putting a strike card into the counterattack position. For the yellow and red zones, one simply turns the deck stack and discard pile respectively into this position as well. Managing to charge all three zones results in the possibility for a player to perform a signature move (details below)."
    },
    {
      "body": "The Chamber Card is the card that the players chose at the beginning of the game to represent them as their characters. As seen throughout this tutorial, Player 2 chose the ${link_0} Chamber Card.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        }
      ],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Chamber Card details and signature moves"
      ],
      "text": "The Chamber Card is the card that the players chose at the beginning of the game to represent them as their characters. As seen throughout this tutorial, Player 2 chose the Aang Chamber Card."
    },
    {
      "body": "Within every Chamber Card is a hidden surprise meant to be employed later in the game. This surprise is a hidden, double-sided strike card, each side of which has a different signature move of a character (since the Chamber Card represents a character, the two strikes on the card within the Chamber Card are that character's signature moves). They act just like any other card within the deck, except for one difference: neither signature move can be used unless certain conditions are met. First, all three of a player's zones must be charged, and second, even when the zones are charged, the player is only able to use a signature move before beginning to defend a zone, or more specifically, is only able to use a signature move before flipping a card into a zone. Despite the unusual strength of signature moves, they act just like any other strike cards in that if their force number is too low to overtake an opponent card's intercept number, the strike would fail against that card and should not be played.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Chamber Card details and signature moves"
      ],
      "text": "Within every Chamber Card is a hidden surprise meant to be employed later in the game. This surprise is a hidden, double-sided strike card, each side of which has a different signature move of a character (since the Chamber Card represents a character, the two strikes on the card within the Chamber Card are that character's signature moves). They act just like any other card within the deck, except for one difference: neither signature move can be used unless certain conditions are met. First, all three of a player's zones must be charged, and second, even when the zones are charged, the player is only able to use a signature move before beginning to defend a zone, or more specifically, is only able to use a signature move before flipping a card into a zone. Despite the unusual strength of signature moves, they act just like any other strike cards in that if their force number is too low to overtake an opponent card's intercept number, the strike would fail against that card and should not be played."
    },
    {
      "body": "After playing the advantage card and charging the green zone, it is time for Player 2 to flip another card into her green zone. If this card is a strike with a higher intercept than the opponent strike's force, it can perform a counterattack, but we will assume it does not have a high enough intercept and Player 2 decides to focus the card into a green energy. This leads Player 2 into her yellow zone, where he or she flips another card. A strike card would continue the previously established format of the game, but let us say that she flips another advantage card, this time marked \"Immediate\". An immediate advantage is recognizable by boldface notice on the card and means that unlike normal advantage cards, it goes to the discard pile not when the turn is completed, but when its ability has been used. To put it another way, an immediate advantage would not be placed in the advantage area, but just used automatically. Like normal advantages, however, it must be paid for with energy before anything can be done with its ability.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Chamber Card details and signature moves"
      ],
      "text": "After playing the advantage card and charging the green zone, it is time for Player 2 to flip another card into her green zone. If this card is a strike with a higher intercept than the opponent strike's force, it can perform a counterattack, but we will assume it does not have a high enough intercept and Player 2 decides to focus the card into a green energy. This leads Player 2 into her yellow zone, where he or she flips another card. A strike card would continue the previously established format of the game, but let us say that she flips another advantage card, this time marked \"Immediate\". An immediate advantage is recognizable by boldface notice on the card and means that unlike normal advantage cards, it goes to the discard pile not when the turn is completed, but when its ability has been used. To put it another way, an immediate advantage would not be placed in the advantage area, but just used automatically. Like normal advantages, however, it must be paid for with energy before anything can be done with its ability."
    },
    {
      "body": "Assuming the advantage card drawn is Sustenance, Player 2 enacts its ability by adding a red energy immediately upon paying for it, subsequently moving Sustenance to the discard pile. Thus, having used an advantage, Player 2 gets to charge her yellow zone, as that is the zone she played it from. If the next card flipped is a sufficient strike to counterattack against the opponent's card, things proceed to the other side of the playing mat, but for this outline's purposes, Player 2 will once again flip an insufficient strike card, focus it this time into the yellow zone, and move down to defend the red zone.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Chamber Card details and signature moves"
      ],
      "text": "Assuming the advantage card drawn is Sustenance, Player 2 enacts its ability by adding a red energy immediately upon paying for it, subsequently moving Sustenance to the discard pile. Thus, having used an advantage, Player 2 gets to charge her yellow zone, as that is the zone she played it from. If the next card flipped is a sufficient strike to counterattack against the opponent's card, things proceed to the other side of the playing mat, but for this outline's purposes, Player 2 will once again flip an insufficient strike card, focus it this time into the yellow zone, and move down to defend the red zone."
    },
    {
      "body": "By drawing an insufficient strike card at this point, or more appropriately by drawing an insufficient strike card in her red zone, Player 1 will have lost all of her zones. This would result in a point being earned by Player 1 (more details in the following subsection), which is the least desirable route for Player 2 at this point. Therefore, if not a substantial strike, Player 2 should hope to receive assistance from a different type of card, possibly by drawing an ally.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Ally cards and overpayment"
      ],
      "text": "By drawing an insufficient strike card at this point, or more appropriately by drawing an insufficient strike card in her red zone, Player 1 will have lost all of her zones. This would result in a point being earned by Player 1 (more details in the following subsection), which is the least desirable route for Player 2 at this point. Therefore, if not a substantial strike, Player 2 should hope to receive assistance from a different type of card, possibly by drawing an ally."
    },
    {
      "body": "An ally card represents a friend or counterpart to the player's Chamber Card who can assist in defeating an opponent. Before considering its use, a player should know that it must be paid for with energy just like any other card. Usually these cards have similar effects to those of advantage cards: aiding in the strength of strikes, having special effects occur on the playing field, etc. There is an added bonus to paying for allies, though: when placed in the appropriate space on the play mat, the zone in which it is placed may be known by two names. One of the names would simply be \"X zone\" based on the color of the zone, or it could be referred to by the name of the ally who resides in the zone, e.g. \"${link_0}'s zone\".",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        }
      ],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Ally cards and overpayment"
      ],
      "text": "An ally card represents a friend or counterpart to the player's Chamber Card who can assist in defeating an opponent. Before considering its use, a player should know that it must be paid for with energy just like any other card. Usually these cards have similar effects to those of advantage cards: aiding in the strength of strikes, having special effects occur on the playing field, etc. There is an added bonus to paying for allies, though: when placed in the appropriate space on the play mat, the zone in which it is placed may be known by two names. One of the names would simply be \"X zone\" based on the color of the zone, or it could be referred to by the name of the ally who resides in the zone, e.g. \"Katara's zone\"."
    },
    {
      "body": "Assuming that after flipping a card from her deck the card turns out to be the ${link_0} ally, Player 2 places the ally in the appropriate area on the play mat. An ally card has a designated area in each zone because the zone into which the ally is flipped decides in which ally area it will be placed. An ally card flipped into the green zone would be placed in the green ally area, an ally flipped into the yellow zone in the yellow ally area, etc. Once activated, an ally remains in play for the rest of the game (not for the rest of the turn) and affects only the cards that are flipped into that ally's zone. There are ways to get rid of allies, however, like discarding them or other special cases.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        }
      ],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Ally cards and overpayment"
      ],
      "text": "Assuming that after flipping a card from her deck the card turns out to be the Katara ally, Player 2 places the ally in the appropriate area on the play mat. An ally card has a designated area in each zone because the zone into which the ally is flipped decides in which ally area it will be placed. An ally card flipped into the green zone would be placed in the green ally area, an ally flipped into the yellow zone in the yellow ally area, etc. Once activated, an ally remains in play for the rest of the game (not for the rest of the turn) and affects only the cards that are flipped into that ally's zone. There are ways to get rid of allies, however, like discarding them or other special cases."
    },
    {
      "body": "Let us say that Player 1's attacking card has a value 6 force and Player 2, after having placed her ally card in the appropriate area, flips a strike with only value 4 intercept. However, lucky for Player 2, the card she just flipped is Pummel, which has a notice: \"Green → +1 Intercept. Use only once.\" Notice that \"Green →\" designates this card as including a payment power, meaning that if the player pays for the +1 intercept (which costs one green energy) and pays for the card (which costs two green energies), the intercept will have been raised to value 5 instead of value 4. Yes, this is still too low to defend against value 6 force, but earlier this turn, the player drew Open-Hand Form, whose effect is that all strike cards are raised +1 intercept. Therefore, if all of these things can be paid for, Pummel will have a sufficient defense against the value 6 force card.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Ally cards and overpayment"
      ],
      "text": "Let us say that Player 1's attacking card has a value 6 force and Player 2, after having placed her ally card in the appropriate area, flips a strike with only value 4 intercept. However, lucky for Player 2, the card she just flipped is Pummel, which has a notice: \"Green → +1 Intercept. Use only once.\" Notice that \"Green →\" designates this card as including a payment power, meaning that if the player pays for the +1 intercept (which costs one green energy) and pays for the card (which costs two green energies), the intercept will have been raised to value 5 instead of value 4. Yes, this is still too low to defend against value 6 force, but earlier this turn, the player drew Open-Hand Form, whose effect is that all strike cards are raised +1 intercept. Therefore, if all of these things can be paid for, Pummel will have a sufficient defense against the value 6 force card."
    },
    {
      "body": "The Katara ally card now has a very important purpose. Katara's ability is \"Yellow → When you counterattack from Katara's zone, charge this zone. Use only once per turn.\" So, if Player 2 uses Pummel to counterattack against the value 6 Force card and pays a yellow energy to bring Katara into effect, the green, yellow, and red zones will be charged and ready to support a signature move.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Ally cards and overpayment"
      ],
      "text": "The Katara ally card now has a very important purpose. Katara's ability is \"Yellow → When you counterattack from Katara's zone, charge this zone. Use only once per turn.\" So, if Player 2 uses Pummel to counterattack against the value 6 Force card and pays a yellow energy to bring Katara into effect, the green, yellow, and red zones will be charged and ready to support a signature move."
    },
    {
      "body": "Another problem has arisen for Player 2, however: having paid for Pummel's special ability with a green energy, she is left with only one green energy in the green zone, and Pummel costs two green energies at its base cost. The method of working around this issue is to overpay for the card. Overpayment is the action of using differently colored energies to compensate for the absence of other, normally necessary energies. In the case of an absence of necessary green energy, yellow or red energies can be used to compensate. For example, if a player pays four green energies to play a card that requires five green energies to be played, a yellow energy or a red energy can be used in place of another green energy to compensate. A yellow energy cost can be compensated by red energy (but not by green energy), and a red energy cost cannot be compensated at all. Overpayment is only allowed to take place when there is an insufficient number of other energies, not for other purposes such as to preserve one energy more than another, etc.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Ally cards and overpayment"
      ],
      "text": "Another problem has arisen for Player 2, however: having paid for Pummel's special ability with a green energy, she is left with only one green energy in the green zone, and Pummel costs two green energies at its base cost. The method of working around this issue is to overpay for the card. Overpayment is the action of using differently colored energies to compensate for the absence of other, normally necessary energies. In the case of an absence of necessary green energy, yellow or red energies can be used to compensate. For example, if a player pays four green energies to play a card that requires five green energies to be played, a yellow energy or a red energy can be used in place of another green energy to compensate. A yellow energy cost can be compensated by red energy (but not by green energy), and a red energy cost cannot be compensated at all. Overpayment is only allowed to take place when there is an insufficient number of other energies, not for other purposes such as to preserve one energy more than another, etc."
    },
    {
      "body": "With the help of overpayment, Player 2 may now play Pummel by paying one green energy for the payment power, one green energy for the sidebar cost, and one yellow energy, also for the sidebar cost of two green energies, as compensation for the other green energy. Therefore, Pummel can now counterattack and be placed in the offensive position. Finally, since the player paid for Katara's ally card ability, the red zone can now be charged by turning the discard pile into the charged position. At this point, Player 1 cleans up and replenishes his play mat in compliance with the rules of beginning a new turn after a counterattack, before flipping a new card into his green zone.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Chamber Card/signature move mechanics, earning a point, and celebration"
      ],
      "text": "With the help of overpayment, Player 2 may now play Pummel by paying one green energy for the payment power, one green energy for the sidebar cost, and one yellow energy, also for the sidebar cost of two green energies, as compensation for the other green energy. Therefore, Pummel can now counterattack and be placed in the offensive position. Finally, since the player paid for Katara's ally card ability, the red zone can now be charged by turning the discard pile into the charged position. At this point, Player 1 cleans up and replenishes his play mat in compliance with the rules of beginning a new turn after a counterattack, before flipping a new card into his green zone."
    },
    {
      "body": "Let us say that the flipped card has a number 4 force and a number 8 intercept, for which Player 1 pays and puts into position for a counterattack. Having flipped a new card onto the field, it is now Player 2's turn to clean up and replenish, thus beginning a new turn. The only cards for her to clean up this turn are Open-Hand Form and Pummel, so they both go into the discard pile, and her opponent having attacked from the green zone, she replenishes a green energy. It is necessary for a player to replenish (as Player 2 just did) in order to employ a Chamber Card and its signature move.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Chamber Card/signature move mechanics, earning a point, and celebration"
      ],
      "text": "Let us say that the flipped card has a number 4 force and a number 8 intercept, for which Player 1 pays and puts into position for a counterattack. Having flipped a new card onto the field, it is now Player 2's turn to clean up and replenish, thus beginning a new turn. The only cards for her to clean up this turn are Open-Hand Form and Pummel, so they both go into the discard pile, and her opponent having attacked from the green zone, she replenishes a green energy. It is necessary for a player to replenish (as Player 2 just did) in order to employ a Chamber Card and its signature move."
    },
    {
      "body": "With the formalities handled, Player 2 may once again notice that her zones are all charged, meaning that on this turn, she may use her Chamber Card. The first strike on the card within the Aang Chamber is Penguin Sledding, which costs one green energy. Before paying for it, however, Player 2 must uncharge all of her zones by placing them in their upward-pointing positions, as they appeared at the beginning of the game.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Chamber Card/signature move mechanics, earning a point, and celebration"
      ],
      "text": "With the formalities handled, Player 2 may once again notice that her zones are all charged, meaning that on this turn, she may use her Chamber Card. The first strike on the card within the Aang Chamber is Penguin Sledding, which costs one green energy. Before paying for it, however, Player 2 must uncharge all of her zones by placing them in their upward-pointing positions, as they appeared at the beginning of the game."
    },
    {
      "body": "By paying for Penguin Sledding, the Chamber Card, with Penguin Sledding facing upward, is placed on the forefront of the play mat's space, atop the Avatar: The Last Airbender logo. As with all signature moves, Penguin Sledding is used before Player 2 begins to defend her zone, so Player 1 does not have the right to replenish any energy. However, the Chamber Card is in play, so Player 1 still has to defend against it by flipping cards into his zones. One downside to Penguin Sledding is its effect: each time an opponent focuses an energy, it goes down one force value, starting with a relatively high value 7 force.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Chamber Card/signature move mechanics, earning a point, and celebration"
      ],
      "text": "By paying for Penguin Sledding, the Chamber Card, with Penguin Sledding facing upward, is placed on the forefront of the play mat's space, atop the Avatar: The Last Airbender logo. As with all signature moves, Penguin Sledding is used before Player 2 begins to defend her zone, so Player 1 does not have the right to replenish any energy. However, the Chamber Card is in play, so Player 1 still has to defend against it by flipping cards into his zones. One downside to Penguin Sledding is its effect: each time an opponent focuses an energy, it goes down one force value, starting with a relatively high value 7 force."
    },
    {
      "body": "Let us assume that Player 1 now flips a value 6 intercept card into his green zone. This is not enough, and Player 1 moves down to defend the yellow zone while Penguin Sledding goes down one force value to 6. Next Player 1 flips a value 5 intercept card, and even that is not enough to defeat Penguin Sledding. Finally, Player 1 flips a card into the red zone of value 3 intercept, which cannot stand against Penguin Sledding and earns Player 2 one point.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Chamber Card/signature move mechanics, earning a point, and celebration"
      ],
      "text": "Let us assume that Player 1 now flips a value 6 intercept card into his green zone. This is not enough, and Player 1 moves down to defend the yellow zone while Penguin Sledding goes down one force value to 6. Next Player 1 flips a value 5 intercept card, and even that is not enough to defeat Penguin Sledding. Finally, Player 1 flips a card into the red zone of value 3 intercept, which cannot stand against Penguin Sledding and earns Player 2 one point."
    },
    {
      "body": "Before the second chapter of the game begins, Player 2 (or to be more general, the point-earning player) gets to celebrate. To celebrate means to add one energy to each zone containing an ally card. To benefit Player 1 (or generally, the player who did not earn a point), that player gets to choose who receives the opening attack for the next round. Lastly, the Chamber Card of Player 2 is now placed back in its area, this time with the back of the Chamber facing upward. This means that next time Player 2 gets the chance to use her Chamber, the signature move will be that on the back of the card. The signature move on the back of a Chamber Card is stronger than the one on the front of a Chamber Cards, balancing out the fact that Player 1 received the handicap of choosing the opening attack mechanics. Whoever gets to three points first wins the overall game.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "How to play",
        "Chamber Card/signature move mechanics, earning a point, and celebration"
      ],
      "text": "Before the second chapter of the game begins, Player 2 (or to be more general, the point-earning player) gets to celebrate. To celebrate means to add one energy to each zone containing an ally card. To benefit Player 1 (or generally, the player who did not earn a point), that player gets to choose who receives the opening attack for the next round. Lastly, the Chamber Card of Player 2 is now placed back in its area, this time with the back of the Chamber facing upward. This means that next time Player 2 gets the chance to use her Chamber, the signature move will be that on the back of the card. The signature move on the back of a Chamber Card is stronger than the one on the front of a Chamber Cards, balancing out the fact that Player 1 received the handicap of choosing the opening attack mechanics. Whoever gets to three points first wins the overall game."
    },
    {
      "body": "If at any point in the game either player should use all of the cards in his or her deck so that there are no more in the deck pile to be flipped, the following steps should be taken:",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Running out of cards"
      ],
      "text": "If at any point in the game either player should use all of the cards in his or her deck so that there are no more in the deck pile to be flipped, the following steps should be taken:"
    },
    {
      "body": "Enumerate how many cards are currently in use as energies in which zones and note which zones of the play mat are charged.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Running out of cards"
      ],
      "text": "Enumerate how many cards are currently in use as energies in which zones and note which zones of the play mat are charged."
    },
    {
      "body": "Take the cards in the energy areas and in the discard pile and shuffle them together. Do not take the Chamber Card or, if in play, any ally or advantage cards to be shuffled.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Running out of cards"
      ],
      "text": "Take the cards in the energy areas and in the discard pile and shuffle them together. Do not take the Chamber Card or, if in play, any ally or advantage cards to be shuffled."
    },
    {
      "body": "Replace the number of energies that were present before shuffling in their proper places and deposit four cards into the discard pile. When putting the deck and the discard pile back into their respective areas, place them sideways if they were charged before being shuffled.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Running out of cards"
      ],
      "text": "Replace the number of energies that were present before shuffling in their proper places and deposit four cards into the discard pile. When putting the deck and the discard pile back into their respective areas, place them sideways if they were charged before being shuffled."
    },
    {
      "body": "In the case of running out of discard pile cards, four cards from the top of the deck should be allotted for the discard pile.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Running out of cards"
      ],
      "text": "In the case of running out of discard pile cards, four cards from the top of the deck should be allotted for the discard pile."
    },
    {
      "body": "An ally can be paid for even if there is already an ally in play in that zone. Depending on whether or not the player decides to pay for the newly flipped ally card, one of two consequences can occur:",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Paying for an ally in a zone where another ally is already in play"
      ],
      "text": "An ally can be paid for even if there is already an ally in play in that zone. Depending on whether or not the player decides to pay for the newly flipped ally card, one of two consequences can occur:"
    },
    {
      "body": "A. If the player pays for the new ally, the original ally is placed in the discard pile. The player remains in defense of the same zone.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Paying for an ally in a zone where another ally is already in play"
      ],
      "text": "A. If the player pays for the new ally, the original ally is placed in the discard pile. The player remains in defense of the same zone."
    },
    {
      "body": "B. If the player does not pay for the new ally, the original ally remains in the ally area and the new ally is placed in the discard pile. The player remains in defense of the same zone.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Paying for an ally in a zone where another ally is already in play"
      ],
      "text": "B. If the player does not pay for the new ally, the original ally remains in the ally area and the new ally is placed in the discard pile. The player remains in defense of the same zone."
    },
    {
      "body": "There is no limit to the number of non-immediate advantage cards that can be placed in a player's advantage area. Furthermore, any number of advantages can be played in a single turn.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Retaining multiple advantage cards"
      ],
      "text": "There is no limit to the number of non-immediate advantage cards that can be placed in a player's advantage area. Furthermore, any number of advantages can be played in a single turn."
    },
    {
      "body": "Exclusive cards are cards that can only be added to a player's deck if the player plans to use a corresponding Chamber Card. That is to say, a Chamber Card has certain cards to its name, whether they be strikes, advantages, or allies, that can only be used when that Chamber is being used as well. Exclusives are generally rare and powerful cards and can be distinguished by the wording in the rules text and by \"special foil treatment\" (\"Avatar: The Last Airbender Master of Elements Official Rulebook\", p. 21). For example, the card Sokka, Big Brother is an exclusive that can only be employed in a deck with a Katara Chamber Card.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Exclusive cards"
      ],
      "text": "Exclusive cards are cards that can only be added to a player's deck if the player plans to use a corresponding Chamber Card. That is to say, a Chamber Card has certain cards to its name, whether they be strikes, advantages, or allies, that can only be used when that Chamber is being used as well. Exclusives are generally rare and powerful cards and can be distinguished by the wording in the rules text and by \"special foil treatment\" (\"Avatar: The Last Airbender Master of Elements Official Rulebook\", p. 21). For example, the card Sokka, Big Brother is an exclusive that can only be employed in a deck with a Katara Chamber Card."
    },
    {
      "body": "Keywords are technical terms that are found in the rules text of some trading cards. The following are three keywords:",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Keywords"
      ],
      "text": "Keywords are technical terms that are found in the rules text of some trading cards. The following are three keywords:"
    },
    {
      "body": "Eliminate: If a card has the eliminate ability, and if the ability is paid for (supposing payment is required), then the eliminated card is placed in the appropriate discard pile.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Keywords"
      ],
      "text": "Eliminate: If a card has the eliminate ability, and if the ability is paid for (supposing payment is required), then the eliminated card is placed in the appropriate discard pile."
    },
    {
      "body": "Reflip: Cards marked with the reflip ability can be replaced if the player chooses. This is an especially helpful ability if the card flipped has too low an intercept to withstand an opponent strike's force. If this is the case and the flipped card has the reflip ability, then the card must simply have its reflip cost paid and must be placed in the discard pile. After this a new card is flipped, and the player does not have to move into the next zone. The cost of using a reflip ability does not include the sidebar cost.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Keywords"
      ],
      "text": "Reflip: Cards marked with the reflip ability can be replaced if the player chooses. This is an especially helpful ability if the card flipped has too low an intercept to withstand an opponent strike's force. If this is the case and the flipped card has the reflip ability, then the card must simply have its reflip cost paid and must be placed in the discard pile. After this a new card is flipped, and the player does not have to move into the next zone. The cost of using a reflip ability does not include the sidebar cost."
    },
    {
      "body": "Pitch: As mentioned earlier, there are a few payment powers unique from the necessity to pay simple energies. The pitch is one such cost for payment powers. If one chooses to pay for a pitch instead of defending with that card, then the card is placed in the discard pile and the player who pitched his or her card is defending in the next zone. As such, if the player pitches a card in the red zone, then his or her opponent scores a point. Although pitching cards can have dire consequences such as a lost point, the reason for paying the pitch cost usually outweighs these, like receiving a charged zone or other perks.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Keywords"
      ],
      "text": "Pitch: As mentioned earlier, there are a few payment powers unique from the necessity to pay simple energies. The pitch is one such cost for payment powers. If one chooses to pay for a pitch instead of defending with that card, then the card is placed in the discard pile and the player who pitched his or her card is defending in the next zone. As such, if the player pitches a card in the red zone, then his or her opponent scores a point. Although pitching cards can have dire consequences such as a lost point, the reason for paying the pitch cost usually outweighs these, like receiving a charged zone or other perks."
    },
    {
      "body": "The fourth keyword is immediate, which is a note found in the rules text of some advantage cards that has already been described.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Other possible situations",
        "Keywords"
      ],
      "text": "The fourth keyword is immediate, which is a note found in the rules text of some advantage cards that has already been described."
    },
    {
      "body": "Casual gaming permits players to disregard a multitude of the rules and regulations outlined in the official rulebook, but formal play is slightly more complicated, involving the previously unmentioned areas of traits, Chamber-trait mechanics, and deck limitations.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play"
      ],
      "text": "Casual gaming permits players to disregard a multitude of the rules and regulations outlined in the official rulebook, but formal play is slightly more complicated, involving the previously unmentioned areas of traits, Chamber-trait mechanics, and deck limitations."
    },
    {
      "body": "Although in casual play any number of cards with any number of duplicates (recurrent copies of the same card throughout the deck) no matter the Chamber Card may compose a deck if the owner of the deck so chooses, formal play sets out regulations for all of these variables:",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Card and deck limitations"
      ],
      "text": "Although in casual play any number of cards with any number of duplicates (recurrent copies of the same card throughout the deck) no matter the Chamber Card may compose a deck if the owner of the deck so chooses, formal play sets out regulations for all of these variables:"
    },
    {
      "body": "Decks must have at least sixty (60) cards.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Card and deck limitations"
      ],
      "text": "Decks must have at least sixty (60) cards."
    },
    {
      "body": "No more than four (4) copies of the same card may be played.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Card and deck limitations"
      ],
      "text": "No more than four (4) copies of the same card may be played."
    },
    {
      "body": "All cards in the deck must share a trait with the deck's Chamber Card. Cards without any trait symbol may be placed in any deck regardless of Chamber.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Card and deck limitations"
      ],
      "text": "All cards in the deck must share a trait with the deck's Chamber Card. Cards without any trait symbol may be placed in any deck regardless of Chamber."
    },
    {
      "body": "This is to say, there may be more than sixty cards in a deck, but not less, and more than four copies of the same card may be in one deck, but not all of them may be played.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Card and deck limitations"
      ],
      "text": "This is to say, there may be more than sixty cards in a deck, but not less, and more than four copies of the same card may be in one deck, but not all of them may be played."
    },
    {
      "body": "As established in other subsections, most everything in the Avatar TCG is representative of an aspect of the card's television inspiration. Chamber Cards are representative of the character from the show as whom the player acts. Strike cards represent this character's offensive and defensive capabilities. Allies represent the character's friends who come to aid him or her in the fight, and advantages demonstrate the unique training and tactical intelligence of the character.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits"
      ],
      "text": "As established in other subsections, most everything in the Avatar TCG is representative of an aspect of the card's television inspiration. Chamber Cards are representative of the character from the show as whom the player acts. Strike cards represent this character's offensive and defensive capabilities. Allies represent the character's friends who come to aid him or her in the fight, and advantages demonstrate the unique training and tactical intelligence of the character."
    },
    {
      "body": "Another representative feature prominent on many of the TCG's cards is the trait. A trait represents the \"special styles and skills\" of the player's chosen character (\"Avatar: The Last Airbender Master of Elements Official Rulebook\", p. 23). In the game, the trait of a card determines whether it may be in the same deck as a specified Chamber. The trait of a card must match one of the traits on a Chamber Card in order to be allowed in the same deck. However, there are also many cards (called generics) that are void of traits. These may be added to any deck regardless of Chamber traits. There are thirteen traits in all: three that can be found in strikes, three that can be found in allies, and three that can be found in advantages, plus the four elemental traits, one of which can be found in any card type.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits"
      ],
      "text": "Another representative feature prominent on many of the TCG's cards is the trait. A trait represents the \"special styles and skills\" of the player's chosen character (\"Avatar: The Last Airbender Master of Elements Official Rulebook\", p. 23). In the game, the trait of a card determines whether it may be in the same deck as a specified Chamber. The trait of a card must match one of the traits on a Chamber Card in order to be allowed in the same deck. However, there are also many cards (called generics) that are void of traits. These may be added to any deck regardless of Chamber traits. There are thirteen traits in all: three that can be found in strikes, three that can be found in allies, and three that can be found in advantages, plus the four elemental traits, one of which can be found in any card type."
    },
    {
      "body": "For example, on any Chamber Card, there are three traits in a column akin to the location of the sidebar cost on other cards, as well as one more trait in the lower right corner. The three traits in the sidebar are the character's basic traits. One of these basic traits corresponds to a trait of the strike demographic, one to the ally, and one to the advantage. The fourth trait in the corner is the special elemental trait, which designates which of the four elements the character bends. So, if this Chamber is used in a deck, then all strikes in the deck must share the same strike trait, all allies the same ally trait, all advantages the same advantage trait, and all elemental-trait cards the same element as the Chamber, or else have no trait at all.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits"
      ],
      "text": "For example, on any Chamber Card, there are three traits in a column akin to the location of the sidebar cost on other cards, as well as one more trait in the lower right corner. The three traits in the sidebar are the character's basic traits. One of these basic traits corresponds to a trait of the strike demographic, one to the ally, and one to the advantage. The fourth trait in the corner is the special elemental trait, which designates which of the four elements the character bends. So, if this Chamber is used in a deck, then all strikes in the deck must share the same strike trait, all allies the same ally trait, all advantages the same advantage trait, and all elemental-trait cards the same element as the Chamber, or else have no trait at all."
    },
    {
      "body": "This group of traits represents a character's fighting style. These traits appear as animal symbols.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits",
        "Strike group"
      ],
      "text": "This group of traits represents a character's fighting style. These traits appear as animal symbols."
    },
    {
      "body": "Bull: Bull strikes are destructive to both the owner and to his or her opponent. They tend to give up resources for immediate gain, or they can punish the opponent for his or her weaknesses.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits",
        "Strike group"
      ],
      "text": "Bull: Bull strikes are destructive to both the owner and to his or her opponent. They tend to give up resources for immediate gain, or they can punish the opponent for his or her weaknesses."
    },
    {
      "body": "Fox: Fox strikes are tricky, relying more on cunning than brute force. Fox strikes wear down an opponent over time rather than bashing through his or her defenses.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits",
        "Strike group"
      ],
      "text": "Fox: Fox strikes are tricky, relying more on cunning than brute force. Fox strikes wear down an opponent over time rather than bashing through his or her defenses."
    },
    {
      "body": "Lion: Lion strikes are often protective or help build up to something big. Lion strikes are more about helping the player than hurting his or her opponent.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits",
        "Strike group"
      ],
      "text": "Lion: Lion strikes are often protective or help build up to something big. Lion strikes are more about helping the player than hurting his or her opponent."
    },
    {
      "body": "This group of traits makes up a character's personality and how he or she relates to others and the world at large.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits",
        "Advantage group"
      ],
      "text": "This group of traits makes up a character's personality and how he or she relates to others and the world at large."
    },
    {
      "body": "Mind: A character who has the Mind trait likes to plan before acting. Long-term strategy is important to a mindful character.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits",
        "Advantage group"
      ],
      "text": "Mind: A character who has the Mind trait likes to plan before acting. Long-term strategy is important to a mindful character."
    },
    {
      "body": "Body: A character who has the Body trait is focused on the physical nature of the world.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits",
        "Advantage group"
      ],
      "text": "Body: A character who has the Body trait is focused on the physical nature of the world."
    },
    {
      "body": "Spirit: A character who has the Spirit trait can call on hidden depths such as heart, gumption, toughness, and charisma to achieve his or her goals.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits",
        "Advantage group"
      ],
      "text": "Spirit: A character who has the Spirit trait can call on hidden depths such as heart, gumption, toughness, and charisma to achieve his or her goals."
    },
    {
      "body": "This group of traits shows the player a character's friends and characters with a similar outlook on life.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits",
        "Ally group"
      ],
      "text": "This group of traits shows the player a character's friends and characters with a similar outlook on life."
    },
    {
      "body": "Light: A character with the Light trait has a positive outlook on the world.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits",
        "Ally group"
      ],
      "text": "Light: A character with the Light trait has a positive outlook on the world."
    },
    {
      "body": "Shadow: A character with the Shadow trait values his or her independence.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits",
        "Ally group"
      ],
      "text": "Shadow: A character with the Shadow trait values his or her independence."
    },
    {
      "body": "Dark: A character with the Dark trait seeks to dominate, or at least he or she enjoys conquest. Dark characters will often stop at nothing to achieve their goals.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits",
        "Ally group"
      ],
      "text": "Dark: A character with the Dark trait seeks to dominate, or at least he or she enjoys conquest. Dark characters will often stop at nothing to achieve their goals."
    },
    {
      "body": "The elemental group displays the bending status a character holds, the four traits being water, earth, fire, and air.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Caveats of formal play",
        "Traits",
        "Elemental group"
      ],
      "text": "The elemental group displays the bending status a character holds, the four traits being water, earth, fire, and air."
    },
    {
      "body": "All Avatar trading cards are marked with a certain number of specially-colored diamonds that designate the rarity of the cards. A card with a single black diamond is common. Two white diamonds denote uncommon, and three yellow diamonds denote rare. Additionally, there are also foil-treated \"Zenemental\" cards, which is another name for the aforementioned exclusive cards, that are termed ultra-rare (\"Avatar: The Last Airbender Master of Elements Official Rulebook\", p. 28). Generally, the greater the rarity, the more powerful and coveted the card.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Rarity"
      ],
      "text": "All Avatar trading cards are marked with a certain number of specially-colored diamonds that designate the rarity of the cards. A card with a single black diamond is common. Two white diamonds denote uncommon, and three yellow diamonds denote rare. Additionally, there are also foil-treated \"Zenemental\" cards, which is another name for the aforementioned exclusive cards, that are termed ultra-rare (\"Avatar: The Last Airbender Master of Elements Official Rulebook\", p. 28). Generally, the greater the rarity, the more powerful and coveted the card."
    },
    {
      "body": "Advantage (card type) – Advantage cards represent the tactics and mindset of a character. Advantage cards have gold borders, and they are the main way to charge a player's zones. There are three basic advantage traits: Body, Mind, and Spirit.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Advantage (card type) – Advantage cards represent the tactics and mindset of a character. Advantage cards have gold borders, and they are the main way to charge a player's zones. There are three basic advantage traits: Body, Mind, and Spirit."
    },
    {
      "body": "Advantage Area – The advantage area is where a player places advantages when he or she plays them. At the beginning of a player's turn or whenever a point is scored, he or she cleans up all the cards in his or her advantage area.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Advantage Area – The advantage area is where a player places advantages when he or she plays them. At the beginning of a player's turn or whenever a point is scored, he or she cleans up all the cards in his or her advantage area."
    },
    {
      "body": "Ally (card type) – Ally cards represent the friends of the Chamber character as well as anyone who is helping that character in a duel. When the player flips and pays for an ally card, it goes into the ally space to the left of the flip space. Ally cards are active only when the player is defending in that ally's zone. There are three basic ally traits: Light, Shadow, and Dark.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Ally (card type) – Ally cards represent the friends of the Chamber character as well as anyone who is helping that character in a duel. When the player flips and pays for an ally card, it goes into the ally space to the left of the flip space. Ally cards are active only when the player is defending in that ally's zone. There are three basic ally traits: Light, Shadow, and Dark."
    },
    {
      "body": "Celebration – When a player score a point, he or she gets to celebrate. This means that the player adds an energy to each of the zones where an ally is stationed.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Celebration – When a player score a point, he or she gets to celebrate. This means that the player adds an energy to each of the zones where an ally is stationed."
    },
    {
      "body": "Chamber Card – This represents the character whose role the player takes in the duel. They are characters from all parts of the Avatar: The Last Airbender universe, so any player can choose which side of the battle he or she is fighting on. Each Chamber Card has a character's traits on the front, and his or her special signature moves are inside the card.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Chamber Card – This represents the character whose role the player takes in the duel. They are characters from all parts of the Avatar: The Last Airbender universe, so any player can choose which side of the battle he or she is fighting on. Each Chamber Card has a character's traits on the front, and his or her special signature moves are inside the card."
    },
    {
      "body": "Charge – Charging is the way that each character builds up to play his or her signature moves. A player charges a zone by turning the cards in the charge space sideways.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Charge – Charging is the way that each character builds up to play his or her signature moves. A player charges a zone by turning the cards in the charge space sideways."
    },
    {
      "body": "Clean up – When a player cleans up, he or she puts all of the cards in his or her advantage area and any strikes into the discard pile.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Clean up – When a player cleans up, he or she puts all of the cards in his or her advantage area and any strikes into the discard pile."
    },
    {
      "body": "Cleanup step – This is the first step of each turn. A player cleans up his or her cards during this step.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Cleanup step – This is the first step of each turn. A player cleans up his or her cards during this step."
    },
    {
      "body": "Counterattack – A counterattack happens when a player pays for the sidebar cost of a strike and turn it sideways. A counterattack usually ends a player's turn.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Counterattack – A counterattack happens when a player pays for the sidebar cost of a strike and turn it sideways. A counterattack usually ends a player's turn."
    },
    {
      "body": "Eliminate – When a card is eliminated, the card is put into its owner's discard pile.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Eliminate – When a card is eliminated, the card is put into its owner's discard pile."
    },
    {
      "body": "Energy – The player must pay energy to play cards. Energy is represented by face-down cards in the right-hand side of a zone.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Energy – The player must pay energy to play cards. Energy is represented by face-down cards in the right-hand side of a zone."
    },
    {
      "body": "Exclusive – [Chamber Character Name] – Cards that have this keyword can only be put into decks that are using the Chamber Card of the same name.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Exclusive – [Chamber Character Name] – Cards that have this keyword can only be put into decks that are using the Chamber Card of the same name."
    },
    {
      "body": "Flip – When a player flips a card, he or she takes a card from the top of his or her deck places it face-up in the zone's flip space.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Flip – When a player flips a card, he or she takes a card from the top of his or her deck places it face-up in the zone's flip space."
    },
    {
      "body": "Flip step – This is the last step of a turn. At the start of a player's flip step, he or she begins to defend in the green zone.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Flip step – This is the last step of a turn. At the start of a player's flip step, he or she begins to defend in the green zone."
    },
    {
      "body": "Focus – A player focuses a card when he or she cannot or chooses not to play that card. Focusing is a prominent way for a player to increase his or her energy. To focus a card, a player turns it face-down and puts it into the energy area of the zone where he or she was defending.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Focus – A player focuses a card when he or she cannot or chooses not to play that card. Focusing is a prominent way for a player to increase his or her energy. To focus a card, a player turns it face-down and puts it into the energy area of the zone where he or she was defending."
    },
    {
      "body": "Force – This is a number on a strike that indicates the strike's attack strength. The force value is located halfway down on the right-hand side of a strike card. It is a gold number that is located next to a lightning bolt icon.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Force – This is a number on a strike that indicates the strike's attack strength. The force value is located halfway down on the right-hand side of a strike card. It is a gold number that is located next to a lightning bolt icon."
    },
    {
      "body": "Generic - A generic card does not have any traits and can be used by any character. A generic card does not have any trait symbols in the top left-hand corner.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Generic - A generic card does not have any traits and can be used by any character. A generic card does not have any trait symbols in the top left-hand corner."
    },
    {
      "body": "Immediate – This is a keyword on advantage cards. If one chooses to pay for an advantage with the \"Immediate\" keyword, it is put into the player's discard pile instead of the advantage area right after its ability is activated.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Immediate – This is a keyword on advantage cards. If one chooses to pay for an advantage with the \"Immediate\" keyword, it is put into the player's discard pile instead of the advantage area right after its ability is activated."
    },
    {
      "body": "Intercept – This is a number on a strike that indicates the strike's ability to defend against an attack. The intercept value is located on the top right-hand corner of a strike card. It is a white number next to a shield icon.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Intercept – This is a number on a strike that indicates the strike's ability to defend against an attack. The intercept value is located on the top right-hand corner of a strike card. It is a white number next to a shield icon."
    },
    {
      "body": "Opening attack – The opening attack is the first strike of the game and the first strike sent after a player has scored a point. It always has 4 force. The player who defends against the opening attack adds one green energy.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Opening attack – The opening attack is the first strike of the game and the first strike sent after a player has scored a point. It always has 4 force. The player who defends against the opening attack adds one green energy."
    },
    {
      "body": "Payment powers – These are special abilities on cards. Payment powers are marked with the → symbol. A player can receive the ability of a payment power if he or she pays the cost before the → symbol.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Payment powers – These are special abilities on cards. Payment powers are marked with the → symbol. A player can receive the ability of a payment power if he or she pays the cost before the → symbol."
    },
    {
      "body": "Pitch – Pitch is a keyword on cards that allows them to be put into the discard pile to pay for the cost of an ability. Whenever a player pitches a card, he or she begins to defend in the next zone.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Pitch – Pitch is a keyword on cards that allows them to be put into the discard pile to pay for the cost of an ability. Whenever a player pitches a card, he or she begins to defend in the next zone."
    },
    {
      "body": "Rarity – There are three card rarities. A card's rarity is indicated by the number and color of diamonds just below the picture box of that card. One black diamond means the card is common. Two white diamonds means the card is uncommon, and three gold diamonds means the card is rare. Exclusive cards are ultra rare and have a special foil treatment.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Rarity – There are three card rarities. A card's rarity is indicated by the number and color of diamonds just below the picture box of that card. One black diamond means the card is common. Two white diamonds means the card is uncommon, and three gold diamonds means the card is rare. Exclusive cards are ultra rare and have a special foil treatment."
    },
    {
      "body": "Reflip: [Cost] – Reflip is a keyword ability. If a player pays the reflip cost, he or she can put the card into his or her discard pile and flip another card into the same zone.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Reflip: [Cost] – Reflip is a keyword ability. If a player pays the reflip cost, he or she can put the card into his or her discard pile and flip another card into the same zone."
    },
    {
      "body": "Replenish – A player replenishes when he or she adds energy based on the zone from which the opponent counterattacked.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Replenish – A player replenishes when he or she adds energy based on the zone from which the opponent counterattacked."
    },
    {
      "body": "Replenish step – This is the second step of a turn, when a player replenishes his or her energy.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Replenish step – This is the second step of a turn, when a player replenishes his or her energy."
    },
    {
      "body": "Scoring a point – A player scores a point when an opponent fails to defend against that player's strike in all of his or her zones. When a player scores three points, that player wins the game.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Scoring a point – A player scores a point when an opponent fails to defend against that player's strike in all of his or her zones. When a player scores three points, that player wins the game."
    },
    {
      "body": "Sidebar cost – The sidebar cost is a feature of all cards, appearing on the left-hand side of each strike, advantage, and ally card. The sidebar cost is made up of three colored sections: green, yellow, and red. Each section indicates how much of that colored energy the card costs to play.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Sidebar cost – The sidebar cost is a feature of all cards, appearing on the left-hand side of each strike, advantage, and ally card. The sidebar cost is made up of three colored sections: green, yellow, and red. Each section indicates how much of that colored energy the card costs to play."
    },
    {
      "body": "Signature move – The signature move is a character's (a Chamber Card's) special attack that a player can only play if all of his or her zones are charged.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Signature move – The signature move is a character's (a Chamber Card's) special attack that a player can only play if all of his or her zones are charged."
    },
    {
      "body": "Signature move step – This is the third step of a turn, when a player can choose whether to defend with a signature move. This step is skipped altogether if all of the zones are not charged, in which case it is impossible to defend with a signature move and the step is rendered inapplicable.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Signature move step – This is the third step of a turn, when a player can choose whether to defend with a signature move. This step is skipped altogether if all of the zones are not charged, in which case it is impossible to defend with a signature move and the step is rendered inapplicable."
    },
    {
      "body": "Strike (card type) – Strike cards are the main way to battle against an opponent. Each strike card has a force and an intercept. Some strike cards have special abilities or effects that can make them more powerful. There are three basic strike traits: Bull, Fox, and Lion.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Strike (card type) – Strike cards are the main way to battle against an opponent. Each strike card has a force and an intercept. Some strike cards have special abilities or effects that can make them more powerful. There are three basic strike traits: Bull, Fox, and Lion."
    },
    {
      "body": "Traits – Cards are divided by traits, which appear as symbols on the top left-hand corner of each card. There are nine basic traits and four special elemental traits. A player's deck can only have cards that share a trait with his or her Chamber Card. However, there are some cards that have no traits at all that fall under different guidelines (see generic).",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Traits – Cards are divided by traits, which appear as symbols on the top left-hand corner of each card. There are nine basic traits and four special elemental traits. A player's deck can only have cards that share a trait with his or her Chamber Card. However, there are some cards that have no traits at all that fall under different guidelines (see generic)."
    },
    {
      "body": "Uncharge – When a player uses a signature move, or when a card says to uncharge a zone, that player turns the cards in the respective zone's charge space upright.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Uncharge – When a player uses a signature move, or when a card says to uncharge a zone, that player turns the cards in the respective zone's charge space upright."
    },
    {
      "body": "Zones – There are three colored zones: green, yellow, and red. Zones represent opportunities to stop the opponent's attack. Each zone has four sections: the ally space, the flip space, the charge space, and the energy space.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Glossary"
      ],
      "text": "Zones – There are three colored zones: green, yellow, and red. Zones represent opportunities to stop the opponent's attack. Each zone has four sections: the ally space, the flip space, the charge space, and the energy space."
    },
    {
      "body": "One of the illustrators for the cards, VUDUBERI, attests that there are 280 cards, while other sources state 235. The sources that claim there to be only 235 cards do not take into account the eight cards released with Burger King kids meals, the two cards included in volumes ${link_0} and ${link_1} of the DVD series, or the three cards packaged with Avatar ${link_2}, bringing the total to a minimum of 248.",
      "links": [
        {
          "body": "one",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Book_1__Water%2c_Volume_1",
            "page": "Book_1__Water%2c_Volume_1"
          }
        },
        {
          "body": "two",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Book_1__Water%2c_Volume_2",
            "page": "Book_1__Water%2c_Volume_2"
          }
        },
        {
          "body": "action figures",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar__The_Last_Airbender_toyline-2",
            "page": "Avatar__The_Last_Airbender_toyline-2"
          }
        }
      ],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Trivia"
      ],
      "text": "One of the illustrators for the cards, VUDUBERI, attests that there are 280 cards, while other sources state 235. The sources that claim there to be only 235 cards do not take into account the eight cards released with Burger King kids meals, the two cards included in volumes one and two of the DVD series, or the three cards packaged with Avatar action figures, bringing the total to a minimum of 248."
    },
    {
      "body": "In the Master of Elements Starter Packs, there are two separate, thirty-card decks in a plastic carrying case, each of which has a single Chamber Card on top of it. Each of these decks is arranged meticulously so that the Chamber Card heads the deck, followed by one rare card, eight uncommon cards, and twenty-one common cards.",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "Trivia"
      ],
      "text": "In the Master of Elements Starter Packs, there are two separate, thirty-card decks in a plastic carrying case, each of which has a single Chamber Card on top of it. Each of these decks is arranged meticulously so that the Chamber Card heads the deck, followed by one rare card, eight uncommon cards, and twenty-one common cards."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Alternate Avatar TCG formats for two players",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Alternate_Avatar_TCG_formats_for_two_players",
            "page": "Alternate_Avatar_TCG_formats_for_two_players"
          }
        }
      ],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "See also"
      ],
      "text": "Alternate Avatar TCG formats for two players"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Avatar Trading Card Game Demo",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar_Trading_Card_Game_Demo",
            "page": "Avatar_Trading_Card_Game_Demo"
          }
        }
      ],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "See also"
      ],
      "text": "Avatar Trading Card Game Demo"
    },
    {
      "body": "Wayback Machine archives of the original Avatar TCG Website, its downloadable files, and other URLs include:\n ${link_0}\n ${link_1} (otherwise found by using the above launcher)\n ${link_2} (PDF)\n ${link_3} (PDF)\n ${link_4} (PDF)\n ${link_5} (PDF)\n ${link_6}, stating that there are 235 cards (PDF)\n ${link_7}",
      "links": [
        {
          "body": "Website launcher",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://web.archive.org/web/20080815225627/http://entertainment.upperdeck.com/avatar/en/",
            "page": "http://web.archive.org/web/20080815225627/http://entertainment.upperdeck.com/avatar/en/"
          }
        },
        {
          "body": "Website interface",
          "key": "${link_1}",
          "target": {
            "external": true,
            "href": "http://web.archive.org/web/20100214165300/http://entertainment.upperdeck.com/avatar/en/interface.aspx",
            "page": "http://web.archive.org/web/20100214165300/http://entertainment.upperdeck.com/avatar/en/interface.aspx"
          }
        },
        {
          "body": "Avatar: The Last Airbender Master of Elements Official Rulebook",
          "key": "${link_2}",
          "target": {
            "external": true,
            "href": "http://web.archive.org/web/20081209064021/http://entertainment.upperdeck.com/avatar/en/avatar_rulebook.pdf",
            "page": "http://web.archive.org/web/20081209064021/http://entertainment.upperdeck.com/avatar/en/avatar_rulebook.pdf"
          }
        },
        {
          "body": "Beginner Mistakes and How To Avoid Them",
          "key": "${link_3}",
          "target": {
            "external": true,
            "href": "http://web.archive.org/web/20081209064158/http://entertainment.upperdeck.com/avatar/en/beginnererrors.pdf",
            "page": "http://web.archive.org/web/20081209064158/http://entertainment.upperdeck.com/avatar/en/beginnererrors.pdf"
          }
        },
        {
          "body": "Alternate Formats For Two Players",
          "key": "${link_4}",
          "target": {
            "external": true,
            "href": "http://web.archive.org/web/20081209064218/http://entertainment.upperdeck.com/avatar/en/alternateformats.pdf",
            "page": "http://web.archive.org/web/20081209064218/http://entertainment.upperdeck.com/avatar/en/alternateformats.pdf"
          }
        },
        {
          "body": "FAQ",
          "key": "${link_5}",
          "target": {
            "external": true,
            "href": "http://web.archive.org/web/20081209064135/http://entertainment.upperdeck.com/avatar/en/FAQ.pdf",
            "page": "http://web.archive.org/web/20081209064135/http://entertainment.upperdeck.com/avatar/en/FAQ.pdf"
          }
        },
        {
          "body": "Official list of cards",
          "key": "${link_6}",
          "target": {
            "external": true,
            "href": "http://web.archive.org/web/20081209064113/http://entertainment.upperdeck.com/avatar/en/spoilerlist.pdf",
            "page": "http://web.archive.org/web/20081209064113/http://entertainment.upperdeck.com/avatar/en/spoilerlist.pdf"
          }
        },
        {
          "body": "Avatar Trading Card Game Demo",
          "key": "${link_7}",
          "target": {
            "external": true,
            "href": "http://web.archive.org/web/20100131075636/http://entertainment.upperdeck.com/avatar/en/demo.aspx",
            "page": "http://web.archive.org/web/20100131075636/http://entertainment.upperdeck.com/avatar/en/demo.aspx"
          }
        }
      ],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "External links"
      ],
      "text": "Wayback Machine archives of the original Avatar TCG Website, its downloadable files, and other URLs include:\n Website launcher\n Website interface (otherwise found by using the above launcher)\n Avatar: The Last Airbender Master of Elements Official Rulebook (PDF)\n Beginner Mistakes and How To Avoid Them (PDF)\n Alternate Formats For Two Players (PDF)\n FAQ (PDF)\n Official list of cards, stating that there are 235 cards (PDF)\n Avatar Trading Card Game Demo"
    },
    {
      "body": "${link_0}",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "External links"
      ],
      "text": "${link_0}"
    },
    {
      "body": "${link_1} (otherwise found by using the above launcher)",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "External links"
      ],
      "text": "${link_1} (otherwise found by using the above launcher)"
    },
    {
      "body": "${link_2} (PDF)",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "External links"
      ],
      "text": "${link_2} (PDF)"
    },
    {
      "body": "${link_3} (PDF)",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "External links"
      ],
      "text": "${link_3} (PDF)"
    },
    {
      "body": "${link_4} (PDF)",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "External links"
      ],
      "text": "${link_4} (PDF)"
    },
    {
      "body": "${link_5} (PDF)",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "External links"
      ],
      "text": "${link_5} (PDF)"
    },
    {
      "body": "${link_6}, stating that there are 235 cards (PDF)",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "External links"
      ],
      "text": "${link_6}, stating that there are 235 cards (PDF)"
    },
    {
      "body": "${link_7}",
      "links": [],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "External links"
      ],
      "text": "${link_7}"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "TCG comprehensive database at Distant Horizon",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://www.musogato.com/avatar/tcg/",
            "page": "http://www.musogato.com/avatar/tcg/"
          }
        }
      ],
      "section": [
        "Avatar: The Last Airbender Trading Card Game",
        "External links"
      ],
      "text": "TCG comprehensive database at Distant Horizon"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Avatar:_The_Last_Airbender_Trading_Card_Game",
    "file": "avatar.wikia.com/wiki/Avatar__The_Last_Airbender_Trading_Card_Game.html",
    "page": "Avatar__The_Last_Airbender_Trading_Card_Game",
    "title": "Avatar: The Last Airbender Trading Card Game"
  }
}