{
  "categories": [],
  "facts": [],
  "paragraphs": [
    {
      "body": "Yes. But only under a 'Fanon:' namespace. Visit our ${link_0} for more information.",
      "links": [
        {
          "body": "Fanon portal",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Wiki_Avatar_fanon",
            "page": "Avatar_Wiki_Avatar_fanon"
          }
        }
      ],
      "text": "Yes. But only under a 'Fanon:' namespace. Visit our Fanon portal for more information."
    },
    {
      "body": "Usually yes. Most general fan sites, image sites, boards and forums are accepted. However, links may be removed if the site is deemed inappropriate or offensive. You can only post links on ${link_0}, or alternatively, you could ${link_1}.",
      "links": [
        {
          "body": "Avatar Fan Sites",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Fan_Sites",
            "page": "Avatar_Fan_Sites"
          }
        },
        {
          "body": "affiliate with Avatar Wiki",
          "key": "${link_1}",
          "target": {
            "href": "Avatar_Wiki_Affiliate_with_Avatar_Wiki",
            "page": "Avatar_Wiki_Affiliate_with_Avatar_Wiki"
          }
        }
      ],
      "text": "Usually yes. Most general fan sites, image sites, boards and forums are accepted. However, links may be removed if the site is deemed inappropriate or offensive. You can only post links on Avatar Fan Sites, or alternatively, you could affiliate with Avatar Wiki."
    },
    {
      "body": "Don't worry, we don't discriminate against newcomers. If you don't know how to edit, feel free to ask an ${link_0} or post on the forums. While you're at it, you can read the help pages, the ${link_1} and the ${link_2}.",
      "links": [
        {
          "body": "admin",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Wiki_Administrators",
            "page": "Avatar_Wiki_Administrators"
          }
        },
        {
          "body": "policy page",
          "key": "${link_1}",
          "target": {
            "href": "Avatar_Wiki_Policy",
            "page": "Avatar_Wiki_Policy"
          }
        },
        {
          "body": "manual of style",
          "key": "${link_2}",
          "target": {
            "href": "Avatar_Wiki_Manual_of_Style",
            "page": "Avatar_Wiki_Manual_of_Style"
          }
        }
      ],
      "text": "Don't worry, we don't discriminate against newcomers. If you don't know how to edit, feel free to ask an admin or post on the forums. While you're at it, you can read the help pages, the policy page and the manual of style."
    },
    {
      "body": "Technically yes, but we would not be very happy about it. Avatar Wiki is intended to be a wiki covering all aspects of the ${link_0}. Your new wiki will probably be boycotted by most editors, and nearly all admins here. Besides, one bureaucrat has stolen all the good Wikia wiki addresses for Avatar.",
      "links": [
        {
          "body": "Avatar World",
          "key": "${link_0}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "Technically yes, but we would not be very happy about it. Avatar Wiki is intended to be a wiki covering all aspects of the Avatar World. Your new wiki will probably be boycotted by most editors, and nearly all admins here. Besides, one bureaucrat has stolen all the good Wikia wiki addresses for Avatar."
    },
    {
      "body": "Admins are promoted on this wiki based on merit. Admins will have made a large range of constructive contributions to the wiki and will be respected members of the community. Prepare to do a lot of work beforehand if you aim for adminship! Please be aware however that all ${link_0} are currently closed.",
      "links": [
        {
          "body": "nominations for adminship",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Wiki_Nominations_for_adminship",
            "page": "Avatar_Wiki_Nominations_for_adminship"
          }
        }
      ],
      "text": "Admins are promoted on this wiki based on merit. Admins will have made a large range of constructive contributions to the wiki and will be respected members of the community. Prepare to do a lot of work beforehand if you aim for adminship! Please be aware however that all nominations for adminship are currently closed."
    },
    {
      "body": "Drop a note to us on the ${link_0}. It will be dealt with soon, usually within the hour. We would thank anyone who reports a vandal.",
      "links": [
        {
          "body": "Administrator noticeboard",
          "key": "${link_0}",
          "target": {
            "href": "Board_Admin_noticeboard",
            "page": "Board_Admin_noticeboard"
          }
        }
      ],
      "text": "Drop a note to us on the Administrator noticeboard. It will be dealt with soon, usually within the hour. We would thank anyone who reports a vandal."
    },
    {
      "body": "If you do believe you were blocked unfairly, reply on your own talk page, which you can still edit while blocked. An admin will consider your reasoning. If the block was a mistake, an admin will unblock you and everyone can continue on their merry way.",
      "links": [],
      "text": "If you do believe you were blocked unfairly, reply on your own talk page, which you can still edit while blocked. An admin will consider your reasoning. If the block was a mistake, an admin will unblock you and everyone can continue on their merry way."
    },
    {
      "body": "There can be software bugs associated with \"autoblocks\". If you see \"autoblock\" mentioned in your block and you know you are not the user the block was intended to exile, then please ${link_0} with the details of the block, including the full text of your block.",
      "links": [
        {
          "body": "email an admin",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Wiki_Administrators",
            "page": "Avatar_Wiki_Administrators"
          }
        }
      ],
      "text": "There can be software bugs associated with \"autoblocks\". If you see \"autoblock\" mentioned in your block and you know you are not the user the block was intended to exile, then please email an admin with the details of the block, including the full text of your block."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Avatar_Wiki:FAQ",
    "file": "avatar.wikia.com/wiki/Avatar_Wiki_FAQ.html",
    "page": "Avatar_Wiki_FAQ",
    "title": "Avatar Wiki:FAQ"
  }
}