{
  "categories": [
    {
      "body": "A-class articles",
      "target": {
        "external": false,
        "href": "/wiki/Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "Featured articles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Featured_articles",
        "page": "Category_Featured_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Establishments",
      "target": {
        "external": false,
        "href": "/wiki/Category_Establishments",
        "page": "Category_Establishments"
      }
    },
    {
      "body": "Locations",
      "target": {
        "external": false,
        "href": "/wiki/Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "An Avatar Temple is a shrine built in honor of the ${link_0}. Each building bears a spiritual connection with the Avatar Spirit and all of its past incarnations, and as such is regarded as a sacrosanct dwelling. Some ${link_1} take this reverence for the Avatar Temple to an extreme, only permitting their respective religious authority to have regular access. For example, the Avatar Temple of the ${link_2} was open exclusively to the elder monks, and only ${link_3} resided in the ${link_4}. However, the Avatar is exempt from these restrictions.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "nations",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Four_nations",
            "page": "Four_nations"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Fire Sages",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Fire Temple",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Temple",
            "page": "Fire_Temple"
          }
        }
      ],
      "section": [
        "Avatar Temple"
      ],
      "text": "An Avatar Temple is a shrine built in honor of the Avatar. Each building bears a spiritual connection with the Avatar Spirit and all of its past incarnations, and as such is regarded as a sacrosanct dwelling. Some nations take this reverence for the Avatar Temple to an extreme, only permitting their respective religious authority to have regular access. For example, the Avatar Temple of the Air Nomads was open exclusively to the elder monks, and only Fire Sages resided in the Fire Temple. However, the Avatar is exempt from these restrictions."
    },
    {
      "body": "Each of the original nations had at least one Avatar Temple, though ${link_0} destroyed the Fire Temple while manifesting himself in the body of ${link_1} in order to save his young reincarnation.",
      "links": [
        {
          "body": "Roku",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        }
      ],
      "section": [
        "Avatar Temple"
      ],
      "text": "Each of the original nations had at least one Avatar Temple, though Roku destroyed the Fire Temple while manifesting himself in the body of Aang in order to save his young reincarnation."
    },
    {
      "body": "Around the winter of 58 ${link_0}, Roku spent five months on ${link_1}'s Fire Temple when he was attempting to master the ${link_2} with the help of the Fire Sages. Under the guidance of Fire Sage ${link_3}, Roku tried a variety of meditation exercises in an attempt to develop control over the state. However, despite his efforts, the Avatar struggled to concentrate and exclaimed that mastery over the state through meditation was impossible.",
      "links": [
        {
          "body": "BG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Crescent Island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Crescent_Island",
            "page": "Crescent_Island"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Kaja",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Kaja",
            "page": "Kaja"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "History",
        "Avatar Roku's recession"
      ],
      "text": "Around the winter of 58 BG, Roku spent five months on Crescent Island's Fire Temple when he was attempting to master the Avatar State with the help of the Fire Sages. Under the guidance of Fire Sage Kaja, Roku tried a variety of meditation exercises in an attempt to develop control over the state. However, despite his efforts, the Avatar struggled to concentrate and exclaimed that mastery over the state through meditation was impossible."
    },
    {
      "body": "In hopes of hastening the process, Roku decided to use the spiritual energy from the sun on the ${link_0} to push himself into the state. He triggered it immediately, but only to find himself unable to control his abilities; he ended up destroying the upper portions of the temple and accidentally sparked the eruption of a nearby volcano before Kaja managed to free him from the Avatar State.",
      "links": [
        {
          "body": "winter solstice",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Winter_solstice",
            "page": "Winter_solstice"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "History",
        "Avatar Roku's recession"
      ],
      "text": "In hopes of hastening the process, Roku decided to use the spiritual energy from the sun on the winter solstice to push himself into the state. He triggered it immediately, but only to find himself unable to control his abilities; he ended up destroying the upper portions of the temple and accidentally sparked the eruption of a nearby volcano before Kaja managed to free him from the Avatar State."
    },
    {
      "body": "Roku eventually mastered the Avatar State and rebuilt the temple pagodas. He went on to carve passageways in the island's magma underneath the temple.",
      "links": [],
      "section": [
        "Avatar Temple",
        "History",
        "Avatar Roku's recession"
      ],
      "text": "Roku eventually mastered the Avatar State and rebuilt the temple pagodas. He went on to carve passageways in the island's magma underneath the temple."
    },
    {
      "body": "After being encased in an iceberg for a century, Avatar Aang returned to the ${link_0} with ${link_1} and ${link_2} late in 99 AG. Aang and his friends were able to reach and enter the temple's ${link_3}. Inside were statues of all the past Avatars, aligned in a circular pattern which extended to the ceiling. Aang felt a sense of familiarity with the statues, especially to the statue of Avatar Roku, his immediate predecessor. Though the two had never met and there was no inscription identifying the statue, Aang immediately stated Roku's name, mentioning that he \"just knew it somehow\".",
      "links": [
        {
          "body": "Southern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "sanctuary",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Air_temple_sanctuaries#Southern_Sanctuary",
            "page": "Air_temple_sanctuaries"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "History",
        "The return of Avatar Aang"
      ],
      "text": "After being encased in an iceberg for a century, Avatar Aang returned to the Southern Air Temple with Katara and Sokka late in 99 AG. Aang and his friends were able to reach and enter the temple's sanctuary. Inside were statues of all the past Avatars, aligned in a circular pattern which extended to the ceiling. Aang felt a sense of familiarity with the statues, especially to the statue of Avatar Roku, his immediate predecessor. Though the two had never met and there was no inscription identifying the statue, Aang immediately stated Roku's name, mentioning that he \"just knew it somehow\"."
    },
    {
      "body": "The group later came across a part of the temple that sustained severe damage during the ${link_0} ${link_1} nearly a century prior. Inside, Aang discovered the corpse of ${link_2}, his airbending mentor, the sight of which triggered the Avatar State. Simultaneously, the eyes of the statues in the inner sanctum began to glow, as well as those of the statues and tapestries in the other Avatar Temples around the ${link_3}, signaling the return of the Avatar.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "attacks",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "Gyatso",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Gyatso",
            "page": "Gyatso"
          }
        },
        {
          "body": "world",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "History",
        "The return of Avatar Aang"
      ],
      "text": "The group later came across a part of the temple that sustained severe damage during the Fire Nation attacks nearly a century prior. Inside, Aang discovered the corpse of Gyatso, his airbending mentor, the sight of which triggered the Avatar State. Simultaneously, the eyes of the statues in the inner sanctum began to glow, as well as those of the statues and tapestries in the other Avatar Temples around the world, signaling the return of the Avatar."
    },
    {
      "body": "Later that year, Aang accidentally entered the ${link_0} for the first time and was greeted by Avatar Roku's ${link_1}, ${link_2}. Fang had been sent by Roku to lead Aang on a spirit journey to Crescent Island, in order to convey the message that the young airbender had to travel there in order to communicate with Roku during the winter solstice.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "dragon",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon",
            "page": "Dragon"
          }
        },
        {
          "body": "Fang",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fang",
            "page": "Fang"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "History",
        "The winter solstice"
      ],
      "text": "Later that year, Aang accidentally entered the Spirit World for the first time and was greeted by Avatar Roku's dragon, Fang. Fang had been sent by Roku to lead Aang on a spirit journey to Crescent Island, in order to convey the message that the young airbender had to travel there in order to communicate with Roku during the winter solstice."
    },
    {
      "body": "Aang arrived at the temple on time but was surprised to find that the Fire Sages were attempting to apprehend him. ${link_0}, who was the last to abide by the Sages' original purpose of serving the Avatar, aided Aang and his friends by guiding them through the temple's secret passageways and explained that Aang's apparent disappearance prompted the sages to pledge allegiance only to the ${link_1}. The sages, with the help of ${link_2} ${link_3}, endeavored to stop Aang from meeting with Roku, though their efforts ultimately failed as Aang was able to enter the ${link_4}, prompting Avatar Roku to instantaneously seal the doors shut.",
      "links": [
        {
          "body": "Fire Sage Shyu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Shyu",
            "page": "Shyu"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Prince",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "sanctuary",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Temple#Sanctuary",
            "page": "Fire_Temple"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "History",
        "The winter solstice"
      ],
      "text": "Aang arrived at the temple on time but was surprised to find that the Fire Sages were attempting to apprehend him. Fire Sage Shyu, who was the last to abide by the Sages' original purpose of serving the Avatar, aided Aang and his friends by guiding them through the temple's secret passageways and explained that Aang's apparent disappearance prompted the sages to pledge allegiance only to the Fire Lord. The sages, with the help of Prince Zuko, endeavored to stop Aang from meeting with Roku, though their efforts ultimately failed as Aang was able to enter the sanctuary, prompting Avatar Roku to instantaneously seal the doors shut."
    },
    {
      "body": "Inside the sanctuary stood a statue of Avatar Roku, and as the light of the winter solstice reached its eyes, Aang was able to communicate with his predecessor. Roku explained to Aang that he must end the ${link_0} before the arrival of ${link_1}, as the consequences of Aang's failure to do so would be devastating to the world's balance.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "History",
        "The winter solstice"
      ],
      "text": "Inside the sanctuary stood a statue of Avatar Roku, and as the light of the winter solstice reached its eyes, Aang was able to communicate with his predecessor. Roku explained to Aang that he must end the Hundred Year War before the arrival of Sozin's Comet, as the consequences of Aang's failure to do so would be devastating to the world's balance."
    },
    {
      "body": "Meanwhile, ${link_0} ${link_1} arrived and readied himself to apprehend the young Avatar with the help of his ${link_2} and the Fire Sages the moment Aang emerged from the sanctuary. However, Avatar Roku had sensed the looming danger and provided protection for Aang; the doors of the sanctuary opened to reveal Avatar Roku manifested through Aang's body. Roku exhibited his ${link_3} prowess, defeating the opposing forces and freeing Sokka, Katara, Shyu, and Zuko from the chains that bound them. The Avatar destroyed the temple permanently by bending the magma from underneath the structure. As the winter solstice passed, the connection between Aang and Roku was broken, and ${link_4} escaped while the temple was consumed by the lava.",
      "links": [
        {
          "body": "Commander",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Commander",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "soldiers",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "firebending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "History",
        "The winter solstice"
      ],
      "text": "Meanwhile, Commander Zhao arrived and readied himself to apprehend the young Avatar with the help of his soldiers and the Fire Sages the moment Aang emerged from the sanctuary. However, Avatar Roku had sensed the looming danger and provided protection for Aang; the doors of the sanctuary opened to reveal Avatar Roku manifested through Aang's body. Roku exhibited his firebending prowess, defeating the opposing forces and freeing Sokka, Katara, Shyu, and Zuko from the chains that bound them. The Avatar destroyed the temple permanently by bending the magma from underneath the structure. As the winter solstice passed, the connection between Aang and Roku was broken, and Team Avatar escaped while the temple was consumed by the lava."
    },
    {
      "body": "Avatar ${link_0} and several of her friends and allies visited the ${link_1} Avatar Temple after the end of the ${link_2} in 170 AG. In front of the stairs to the sanctuary, Korra used ${link_3} for the first time to restore ${link_4}'s ${link_5}. After Lin showcased her reacquired bending by levitating all the menhirs surrounding the temple, ${link_6} recognized Korra to be a fully realized Avatar.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Anti-bending Revolution",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Anti-bending_Revolution",
            "page": "Anti-bending_Revolution"
          }
        },
        {
          "body": "energybending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Energybending",
            "page": "Energybending"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "History",
        "Southern Water Tribe Avatar Temple"
      ],
      "text": "Avatar Korra and several of her friends and allies visited the Southern Water Tribe Avatar Temple after the end of the Anti-bending Revolution in 170 AG. In front of the stairs to the sanctuary, Korra used energybending for the first time to restore Lin Beifong's earthbending. After Lin showcased her reacquired bending by levitating all the menhirs surrounding the temple, Tenzin recognized Korra to be a fully realized Avatar."
    },
    {
      "body": "In the two years that she stayed at the South Pole to recover from her ${link_0} poisoning in 171 AG, Korra meditated at the temple in an attempt to enter the Avatar State, as Katara believed her inability to do such stemmed from a mental block.",
      "links": [
        {
          "body": "mercury",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mercury",
            "page": "Mercury"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "History",
        "Southern Water Tribe Avatar Temple"
      ],
      "text": "In the two years that she stayed at the South Pole to recover from her mercury poisoning in 171 AG, Korra meditated at the temple in an attempt to enter the Avatar State, as Katara believed her inability to do such stemmed from a mental block."
    },
    {
      "body": "The Southern Water Tribe Avatar Temple is based on the ${link_0} of Bhutan and the Carnac stones in western France.",
      "links": [
        {
          "body": "stupas",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Stupa",
            "page": "Stupa"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "Trivia"
      ],
      "text": "The Southern Water Tribe Avatar Temple is based on the stupas of Bhutan and the Carnac stones in western France."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Air temple sanctuaries",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_temple_sanctuaries",
            "page": "Air_temple_sanctuaries"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "See also"
      ],
      "text": "Air temple sanctuaries"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Architecture in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Architecture_in_the_World_of_Avatar",
            "page": "Architecture_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "See also"
      ],
      "text": "Architecture in the World of Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "See also"
      ],
      "text": "Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Fire Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Temple",
            "page": "Fire_Temple"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "See also"
      ],
      "text": "Fire Temple"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Southern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        }
      ],
      "section": [
        "Avatar Temple",
        "See also"
      ],
      "text": "Southern Air Temple"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Avatar_Temple",
    "file": "avatar.wikia.com/wiki/Avatar_Temple.html",
    "page": "Avatar_Temple",
    "title": "Avatar Temple"
  }
}