{
  "categories": [],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} | Featured fanon series | ${link_1}",
      "links": [
        {
          "body": "Featured fanon articles",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Wiki_Featured_fanon_articles",
            "page": "Avatar_Wiki_Featured_fanon_articles"
          }
        },
        {
          "body": "Nominate one",
          "key": "${link_1}",
          "target": {
            "href": "Avatar_Wiki_Featured_fanon_series_and_article_nominations",
            "page": "Avatar_Wiki_Featured_fanon_series_and_article_nominations"
          }
        }
      ],
      "text": "Featured fanon articles | Featured fanon series | Nominate one"
    },
    {
      "body": "Featured fanon series on Avatar Wiki",
      "links": [],
      "text": "Featured fanon series on Avatar Wiki"
    },
    {
      "body": "",
      "links": [],
      "text": ""
    },
    {
      "body": "Break the Cycle is the working title for another fan project that the author, M1O, conceived of while writing up an article for another project. It uses elements from dystopian futuristic fiction with the Avatar world to... well, because the author thinks it's cool.",
      "links": [],
      "text": "Break the Cycle is the working title for another fan project that the author, M1O, conceived of while writing up an article for another project. It uses elements from dystopian futuristic fiction with the Avatar world to... well, because the author thinks it's cool."
    },
    {
      "body": "This page serves as a general overview; ensuing pages may contain spoilers and self-depreciation for this work and others. (read more...)",
      "links": [],
      "text": "This page serves as a general overview; ensuing pages may contain spoilers and self-depreciation for this work and others. (read more...)"
    },
    {
      "body": "GanXingba Theater Presents Avatar: The Abridged Series is an abridged parody of Avatar: The Last Airbender. The show is made by Youtube user GanXingba. The series makes jokes, such as running gags, plot spoilers, and little things like what/the way the person says. The most famous joke of the series is nicknaming Aang Kung Fu Action Jesus. (read more...)",
      "links": [],
      "text": "GanXingba Theater Presents Avatar: The Abridged Series is an abridged parody of Avatar: The Last Airbender. The show is made by Youtube user GanXingba. The series makes jokes, such as running gags, plot spoilers, and little things like what/the way the person says. The most famous joke of the series is nicknaming Aang Kung Fu Action Jesus. (read more...)"
    },
    {
      "body": "Inspector Iroh is a round robin comic and an alternative universe that takes place in modern-age Ba Sing Se. The story revolves around Iroh, who works at the Dai Li Murder Investigation department, and his assistant Zuko. The concept was born in May 2007, when ASN user The Artrix created a concept sketch of Iroh and Zuko driving around in Ba Sing Se. After adding more content to the concept, he initiated the Inspector Iroh round robin comic. According to The Artrix, Inspector Iroh was initially based off Baantjer, a Dutch television series about an old murder investigator and his assistant that takes place in Amsterdam.",
      "links": [],
      "text": "Inspector Iroh is a round robin comic and an alternative universe that takes place in modern-age Ba Sing Se. The story revolves around Iroh, who works at the Dai Li Murder Investigation department, and his assistant Zuko. The concept was born in May 2007, when ASN user The Artrix created a concept sketch of Iroh and Zuko driving around in Ba Sing Se. After adding more content to the concept, he initiated the Inspector Iroh round robin comic. According to The Artrix, Inspector Iroh was initially based off Baantjer, a Dutch television series about an old murder investigator and his assistant that takes place in Amsterdam."
    },
    {
      "body": "Currently, the comic is 22 pages long and still in production. The franchise receives a fair share of fan-generated content and has a dedicated DeviantART account. (read more...)",
      "links": [],
      "text": "Currently, the comic is 22 pages long and still in production. The franchise receives a fair share of fan-generated content and has a dedicated DeviantART account. (read more...)"
    },
    {
      "body": "Kyoshi Revolts is a story about what could have happened if Aang hadn't defeated Ozai, and the World was thrown into chaos. It is written, edited, and supervised by users, Waterkai and Vaznock.",
      "links": [],
      "text": "Kyoshi Revolts is a story about what could have happened if Aang hadn't defeated Ozai, and the World was thrown into chaos. It is written, edited, and supervised by users, Waterkai and Vaznock."
    },
    {
      "body": "Originally thought up by Waterkai, the project was quickly adapted into a story. However, Waterkai was busy with his original story, \"Avatar: The Chronicles of Kai\", so the production for the series was very slow. Nonetheless, the story grew to the liking of certain users, and one user, Vaznock, decided to help Waterkai create a simple page, Azula (Kyoshi Revolts).",
      "links": [],
      "text": "Originally thought up by Waterkai, the project was quickly adapted into a story. However, Waterkai was busy with his original story, \"Avatar: The Chronicles of Kai\", so the production for the series was very slow. Nonetheless, the story grew to the liking of certain users, and one user, Vaznock, decided to help Waterkai create a simple page, Azula (Kyoshi Revolts)."
    },
    {
      "body": "What was at first just a little helping hand soon became a co-creator, as Vaznock created many of Waterkai's characters and added new ones. After a discussion between the users over the outcome of the entire story, a storm of articles was made by the two users, including past battle pages and other character pages. The story had gotten so many articles that Category:Kyoshi Revolts was given subcategories. (read more...)",
      "links": [],
      "text": "What was at first just a little helping hand soon became a co-creator, as Vaznock created many of Waterkai's characters and added new ones. After a discussion between the users over the outcome of the entire story, a storm of articles was made by the two users, including past battle pages and other character pages. The story had gotten so many articles that Category:Kyoshi Revolts was given subcategories. (read more...)"
    },
    {
      "body": "Avatar: Better World is an action/adventure fan fiction story created by SuperFlash101 based on the animated television series ${link_0}. The series takes place after the show's conclusion, with the world being free from the chaos of the Fire Nation and reconstruction beginning to take place in the four nations. Despite this however, peace seems to not last as a series of events begin to spiral out of control once the rogue league \"Wind Killers\" try to assassinate Aang.",
      "links": [
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_0}",
          "target": {
            "href": "Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        }
      ],
      "text": "Avatar: Better World is an action/adventure fan fiction story created by SuperFlash101 based on the animated television series Avatar: The Last Airbender. The series takes place after the show's conclusion, with the world being free from the chaos of the Fire Nation and reconstruction beginning to take place in the four nations. Despite this however, peace seems to not last as a series of events begin to spiral out of control once the rogue league \"Wind Killers\" try to assassinate Aang."
    },
    {
      "body": "Better World' borrows heavily in it's literary style from Japanese anime, Western films, music, and novels. SuperFlash intended to make an Avatar spin-off that would not be held back by it's usage of violence or thematic elements, and the ensuing design led the series to become an intense, surprising, and thematic thriller. This is generally opposite to that of it's predecessor (written by Flash and entitled Sokka's Days) which was a dry-humor story that was mainly based on satire, slapstick, and dialogue.",
      "links": [],
      "text": "Better World' borrows heavily in it's literary style from Japanese anime, Western films, music, and novels. SuperFlash intended to make an Avatar spin-off that would not be held back by it's usage of violence or thematic elements, and the ensuing design led the series to become an intense, surprising, and thematic thriller. This is generally opposite to that of it's predecessor (written by Flash and entitled Sokka's Days) which was a dry-humor story that was mainly based on satire, slapstick, and dialogue."
    },
    {
      "body": "The series was published regularly on two different websites: FanFiction.net and ${link_0}. It was previously published on ${link_1} before a merge occurred between it and the latter. Despite being a rather undiscovered and lowly reviewed story on FanFiction.net, it has met praise on Avatar Wiki from its reviewers and is considered on a popular story on the website, garnering the title of \"Featured fanon\" in 2009. ((read more...)",
      "links": [
        {
          "body": "Avatar Wiki",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Wiki_About",
            "page": "Avatar_Wiki_About"
          }
        },
        {
          "body": "Avatar Fanon Wiki",
          "key": "${link_1}",
          "target": {
            "href": "Avatar_Fanon_Wiki",
            "page": "Avatar_Fanon_Wiki"
          }
        }
      ],
      "text": "The series was published regularly on two different websites: FanFiction.net and Avatar Wiki. It was previously published on Avatar Fanon Wiki before a merge occurred between it and the latter. Despite being a rather undiscovered and lowly reviewed story on FanFiction.net, it has met praise on Avatar Wiki from its reviewers and is considered on a popular story on the website, garnering the title of \"Featured fanon\" in 2009. ((read more...)"
    },
    {
      "body": "Enemies and Traitors is an AU fanon story by Manzai about the lives of major players in the initiation of ${link_0} and how that initiation was actually carried out. It was written in the spring and summer of 2007 and completed in September 2007, between Books 2 and 3 of the actual series. It was written before Avatar: The Heir of Ban and as an AU story it takes place in a different continuity. The name derives from Azula's line in Episode 208, \"${link_1}.\" (read more...)",
      "links": [
        {
          "body": "the War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "The Chase",
          "key": "${link_1}",
          "target": {
            "href": "The_Chase",
            "page": "The_Chase"
          }
        }
      ],
      "text": "Enemies and Traitors is an AU fanon story by Manzai about the lives of major players in the initiation of the War and how that initiation was actually carried out. It was written in the spring and summer of 2007 and completed in September 2007, between Books 2 and 3 of the actual series. It was written before Avatar: The Heir of Ban and as an AU story it takes place in a different continuity. The name derives from Azula's line in Episode 208, \"The Chase.\" (read more...)"
    },
    {
      "body": "Avatar: The Legacy of Fire is a fanon story created by Zukofan123. It is set two years after events that took place in Avatar: The Last Airbender, when the act of reconditioning the world is an issue due to the war that remained active for a whole century. The story is centered around a 13 year-old boy named Takushi Sagara, whose purpose is to defeat the evil organization known as The Black Scorchers, led by the villainous Black Master. (read more...)",
      "links": [],
      "text": "Avatar: The Legacy of Fire is a fanon story created by Zukofan123. It is set two years after events that took place in Avatar: The Last Airbender, when the act of reconditioning the world is an issue due to the war that remained active for a whole century. The story is centered around a 13 year-old boy named Takushi Sagara, whose purpose is to defeat the evil organization known as The Black Scorchers, led by the villainous Black Master. (read more...)"
    },
    {
      "body": "Avatar: Wanted is a fanon story created by Twilitlink, taking place three years after the original series. It circles about one of the Fire nation generals not liking the outcome of the war, and deciding to send some assassins after Team Avatar. The assassins soon experience that it isn't an easy task to carry out, and that not only Team Avatar, but people in their own organization are working against them as well. The story is divided into four books, each one carrying the name of the bending style of its main assassin. The series has become a very popular story on the wiki, having many followers and being praised for it's action scenes. (read more...)",
      "links": [],
      "text": "Avatar: Wanted is a fanon story created by Twilitlink, taking place three years after the original series. It circles about one of the Fire nation generals not liking the outcome of the war, and deciding to send some assassins after Team Avatar. The assassins soon experience that it isn't an easy task to carry out, and that not only Team Avatar, but people in their own organization are working against them as well. The story is divided into four books, each one carrying the name of the bending style of its main assassin. The series has become a very popular story on the wiki, having many followers and being praised for it's action scenes. (read more...)"
    },
    {
      "body": "The Phoenix Chronicles is a fanon written by The avatar. It follows the adventures of the new avatar, Mian and his friends. A new country, known as the Phoenix Islands, has declared war on the Southern Water Tribe. Mian, and his team, must stop their insane dictator before he gets too powerful. However, there hopes are defeated when they find out that the King wants to do more than defeat the water tribe. Will they be able to stop him in time, or will the world fall into chaos? (read more...)",
      "links": [],
      "text": "The Phoenix Chronicles is a fanon written by The avatar. It follows the adventures of the new avatar, Mian and his friends. A new country, known as the Phoenix Islands, has declared war on the Southern Water Tribe. Mian, and his team, must stop their insane dictator before he gets too powerful. However, there hopes are defeated when they find out that the King wants to do more than defeat the water tribe. Will they be able to stop him in time, or will the world fall into chaos? (read more...)"
    },
    {
      "body": "Avatar: Guardian is a fanon series written by The Bos. It chronicles Team Avatar's attempts to guard their hard earned peace after ${link_0}. This story takes place almost a year after the final battle of the war. Since then, Aang has energybent some of the people at the Northern Air Temple into becoming Airbenders, but has not done all of them since it is physically exhausting. Toph went to Omashu and helped Bumi clean up the city since the occupation and began to teach him ${link_1} (He taught her to bend rock candy so it was an even trade). Sokka went back to train with Piandao and to make a new sword. Iroh has been seen as a hero in the Earth Kingdom and opened up a new tea shop in Omashu. Zuko married Mai and has begun to usher a new era of peace to the world. Unfortunately that peace would not go unchallenged. Factions in the Water Tribes and the Earth Kingdom wish to punish the Fire Nation, while there are some in the Fire Nation that believe that the War should continue since the Firebenders are so far superior to the other nations. These factions will resort to any means necessary to achieve their goals. (read more...)",
      "links": [
        {
          "body": "the war",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Metalbending",
          "key": "${link_1}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        }
      ],
      "text": "Avatar: Guardian is a fanon series written by The Bos. It chronicles Team Avatar's attempts to guard their hard earned peace after the war. This story takes place almost a year after the final battle of the war. Since then, Aang has energybent some of the people at the Northern Air Temple into becoming Airbenders, but has not done all of them since it is physically exhausting. Toph went to Omashu and helped Bumi clean up the city since the occupation and began to teach him Metalbending (He taught her to bend rock candy so it was an even trade). Sokka went back to train with Piandao and to make a new sword. Iroh has been seen as a hero in the Earth Kingdom and opened up a new tea shop in Omashu. Zuko married Mai and has begun to usher a new era of peace to the world. Unfortunately that peace would not go unchallenged. Factions in the Water Tribes and the Earth Kingdom wish to punish the Fire Nation, while there are some in the Fire Nation that believe that the War should continue since the Firebenders are so far superior to the other nations. These factions will resort to any means necessary to achieve their goals. (read more...)"
    },
    {
      "body": "Sokka's Days is the title of a dry-comedy story that was published on Fan Fiction.net by SuperFlash101 in 2008. The story features one-shot chapters, taking place across different plot lines and locations in ${link_0}, detailing Sokka in different ironic situations. Flash canceled production on the series after four chapters in order to work on a much more serious sequel, Avatar: Better World. Its tagline was \"Irony; see also Sokka.\" (read more...)",
      "links": [
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_0}",
          "target": {
            "href": "Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        }
      ],
      "text": "Sokka's Days is the title of a dry-comedy story that was published on Fan Fiction.net by SuperFlash101 in 2008. The story features one-shot chapters, taking place across different plot lines and locations in Avatar: The Last Airbender, detailing Sokka in different ironic situations. Flash canceled production on the series after four chapters in order to work on a much more serious sequel, Avatar: Better World. Its tagline was \"Irony; see also Sokka.\" (read more...)"
    },
    {
      "body": "Avatar: The Spirit War, is a fanon sequel to Avatar: The Last Airbender, written by Henhouse. For 100 years after the world celebrated a great age of prosperity and peace after Avatar Aang defeated the Fire Nation. Some time after Aang’s natural death at age 100, strange things began to happen worldwide. Twice a year during the Winter and Summer Solstices, enraged spirits cross over into the world of mortals and cause great devastation. The spirits blame humanity for a dark calamity which for 100 years has been quietly befalling the Spirit World. It is up to the new Avatar, an unsuspecting girl named Sura to act as the bridge between the spirits and humanity. She must leave the safety of the Water Tribe to master the other three elements, along the way making friends and all the while trying to discover the culprit manipulating the spirits. Can she live up to the heavy burden of ending the unrest of the deities and stop the destruction of both worlds? (read more...)",
      "links": [],
      "text": "Avatar: The Spirit War, is a fanon sequel to Avatar: The Last Airbender, written by Henhouse. For 100 years after the world celebrated a great age of prosperity and peace after Avatar Aang defeated the Fire Nation. Some time after Aang’s natural death at age 100, strange things began to happen worldwide. Twice a year during the Winter and Summer Solstices, enraged spirits cross over into the world of mortals and cause great devastation. The spirits blame humanity for a dark calamity which for 100 years has been quietly befalling the Spirit World. It is up to the new Avatar, an unsuspecting girl named Sura to act as the bridge between the spirits and humanity. She must leave the safety of the Water Tribe to master the other three elements, along the way making friends and all the while trying to discover the culprit manipulating the spirits. Can she live up to the heavy burden of ending the unrest of the deities and stop the destruction of both worlds? (read more...)"
    },
    {
      "body": "Avatar: The Last Energybender, is a fanon prequel written by Wanted author, Twilitlink. The story chronicles the time before the avatar, when people bent the energy within themselves. But once people learnt to bend the elements, energybenders grew rarer and rarer. Eventually a great war broke out between the Four Nations in which the Air Nomads and Water Tribes united and fought against the Earth Kingdom and the Fire Nation. The two forces lacked an ace in the hole however so the recruiting of the neutral energybenders began shortly after. Unfortunately the energybenders refused to become involved, but neither side was willing to give up such a powerful ally so the two sides began hunting the energybenders down and forced them to fight.",
      "links": [],
      "text": "Avatar: The Last Energybender, is a fanon prequel written by Wanted author, Twilitlink. The story chronicles the time before the avatar, when people bent the energy within themselves. But once people learnt to bend the elements, energybenders grew rarer and rarer. Eventually a great war broke out between the Four Nations in which the Air Nomads and Water Tribes united and fought against the Earth Kingdom and the Fire Nation. The two forces lacked an ace in the hole however so the recruiting of the neutral energybenders began shortly after. Unfortunately the energybenders refused to become involved, but neither side was willing to give up such a powerful ally so the two sides began hunting the energybenders down and forced them to fight."
    },
    {
      "body": "The energybenders were hunted to near extinction until only one energybender remained, a young man named Genesis. Both sides want Genesis on their side and neither are willing to let the other have him. The race is on. Which side will claim him, or will he escape from the hunters and reach the one place safe for him? (read more...)",
      "links": [],
      "text": "The energybenders were hunted to near extinction until only one energybender remained, a young man named Genesis. Both sides want Genesis on their side and neither are willing to let the other have him. The race is on. Which side will claim him, or will he escape from the hunters and reach the one place safe for him? (read more...)"
    },
    {
      "body": "Avatar: Clash of Worlds is an original crossover story of several well-known fanons. The fanons that were included were: \"Avatar: Better World\", \"Kyoshi Revolts\", \"The Phoenix Chronicles\", \"Avatar: Wanted\", and \"Avatar: The Legacy of Fire\". The story mainly centers around humorous and bizarre interactions between the original characters of each story. The Clash was conceived by three fanon administrators during July of 2009, and eventually developed into a five part series. The story became so popular that it has often won \"Best Comedy Story\" and has induced two sequels. (read more...)",
      "links": [],
      "text": "Avatar: Clash of Worlds is an original crossover story of several well-known fanons. The fanons that were included were: \"Avatar: Better World\", \"Kyoshi Revolts\", \"The Phoenix Chronicles\", \"Avatar: Wanted\", and \"Avatar: The Legacy of Fire\". The story mainly centers around humorous and bizarre interactions between the original characters of each story. The Clash was conceived by three fanon administrators during July of 2009, and eventually developed into a five part series. The story became so popular that it has often won \"Best Comedy Story\" and has induced two sequels. (read more...)"
    },
    {
      "body": "Gaang Junior Adventures is a fan-made expanded universe for Avatar: The Last Airbender, written by Maritova, that takes place about twenty years after the TV show. Five kids, children of the original Gaang, ran away from home and now travel the world, sailing the high seas in search of ADVENTURE!",
      "links": [],
      "text": "Gaang Junior Adventures is a fan-made expanded universe for Avatar: The Last Airbender, written by Maritova, that takes place about twenty years after the TV show. Five kids, children of the original Gaang, ran away from home and now travel the world, sailing the high seas in search of ADVENTURE!"
    },
    {
      "body": "Along the way, the kids meet both new and familiar faces, some driven by lust for riches or power, others by the thrill of adventures and the open sky, and some just trying to make their way in the relative peace of this new post-War world. (read more...)",
      "links": [],
      "text": "Along the way, the kids meet both new and familiar faces, some driven by lust for riches or power, others by the thrill of adventures and the open sky, and some just trying to make their way in the relative peace of this new post-War world. (read more...)"
    },
    {
      "body": "My Own Savior is a dark drama series which is a spinoff/subseries of Twilitlink's Avatar: Wanted story, written by Dragon of The West. The series occurs during the final years of The Great War. The series attempts to cover Tengu's story from his early childhood years as an Earth Kingdom colonial, through his troubled teenage years in Gaoling, his tenure with the Black Lotus, and finally, his joining of the New Airbender Nomads. The series was met with enormous praise, including many awards such as Outstanding New Series and Outstanding Writing in a Drama Series. (read more...)",
      "links": [],
      "text": "My Own Savior is a dark drama series which is a spinoff/subseries of Twilitlink's Avatar: Wanted story, written by Dragon of The West. The series occurs during the final years of The Great War. The series attempts to cover Tengu's story from his early childhood years as an Earth Kingdom colonial, through his troubled teenage years in Gaoling, his tenure with the Black Lotus, and finally, his joining of the New Airbender Nomads. The series was met with enormous praise, including many awards such as Outstanding New Series and Outstanding Writing in a Drama Series. (read more...)"
    },
    {
      "body": "Child of Destiny is a fanfiction story depicting the future of the world ten years after the end of Sozin's War, written by MightyBrit. The story revolves around Aang's search for Diyi, the first airbending child to be born in over one hundred years, who has been kidnapped by an unknown party. It also chronicles Zuko's struggles against the Cult of Sozin, a group of Fire Nation rebels who still eagerly pursue the goal of Fire Nation supremacy and are led by Admiral Zhao, who was believed to be dead. The relatively new series has been greatly praised, espiecally in being asked to participate in Clash of Worlds 3. (read more...)",
      "links": [],
      "text": "Child of Destiny is a fanfiction story depicting the future of the world ten years after the end of Sozin's War, written by MightyBrit. The story revolves around Aang's search for Diyi, the first airbending child to be born in over one hundred years, who has been kidnapped by an unknown party. It also chronicles Zuko's struggles against the Cult of Sozin, a group of Fire Nation rebels who still eagerly pursue the goal of Fire Nation supremacy and are led by Admiral Zhao, who was believed to be dead. The relatively new series has been greatly praised, espiecally in being asked to participate in Clash of Worlds 3. (read more...)"
    },
    {
      "body": "Past, Present, and Future is a story detailing the histories and futures of many main Avatar characters, written mainly by Dudewaldo4. Currently being featured are stories on the pasts of Kanna, Pathik, and Bumi. Present stories to be written include Iroh and Ursa, while Future include the main characters such as Aang, Katara, etc. This story is ever expanding, as users can offer their ideas for a story. (read more...)",
      "links": [],
      "text": "Past, Present, and Future is a story detailing the histories and futures of many main Avatar characters, written mainly by Dudewaldo4. Currently being featured are stories on the pasts of Kanna, Pathik, and Bumi. Present stories to be written include Iroh and Ursa, while Future include the main characters such as Aang, Katara, etc. This story is ever expanding, as users can offer their ideas for a story. (read more...)"
    },
    {
      "body": "Avatar: Choices is a fanon crosssover story written by Evatar114. It contains characters from Avatar: The Last Airbender one year after the war, and from the British dystopian series, Chaos Walking. After the war ended, Zuko and Mai went back to the Fire Nation to help rebuild their relationships with the other nations. They also got married and Mai is pregnant with their first child. Iroh became sick and came back to live in the Fire Nation Capital for awhile. Sokka and Suki went to Kyoshi Island to start a school where all warriors of all genders, nations, and age could gather together to learn, practice and teach. Aang, Toph, and Katara started to travel around the world, helping anyone they came across and looking for airbenders that might have survived the genocide. (read more...)",
      "links": [],
      "text": "Avatar: Choices is a fanon crosssover story written by Evatar114. It contains characters from Avatar: The Last Airbender one year after the war, and from the British dystopian series, Chaos Walking. After the war ended, Zuko and Mai went back to the Fire Nation to help rebuild their relationships with the other nations. They also got married and Mai is pregnant with their first child. Iroh became sick and came back to live in the Fire Nation Capital for awhile. Sokka and Suki went to Kyoshi Island to start a school where all warriors of all genders, nations, and age could gather together to learn, practice and teach. Aang, Toph, and Katara started to travel around the world, helping anyone they came across and looking for airbenders that might have survived the genocide. (read more...)"
    },
    {
      "body": "Rise of an Avatar is a new fanon written by the new user Carloso. It tells the tragic story of Shinn Fey, a young boy wandering the world alone. Not knowing he is Avatar, Shinn travels to the Earth Kingdom to escape his corrupt homeland. However as his birthright is revealed, he must fight for his life while coming to terms with the fact the world now rests on his shoulders. Will Shinn prevail or fail? The series have been met with great reception, including Honorable Mention and of course, featured fanon. (read more...)",
      "links": [],
      "text": "Rise of an Avatar is a new fanon written by the new user Carloso. It tells the tragic story of Shinn Fey, a young boy wandering the world alone. Not knowing he is Avatar, Shinn travels to the Earth Kingdom to escape his corrupt homeland. However as his birthright is revealed, he must fight for his life while coming to terms with the fact the world now rests on his shoulders. Will Shinn prevail or fail? The series have been met with great reception, including Honorable Mention and of course, featured fanon. (read more...)"
    },
    {
      "body": "Eyes of Katara is a fanon series written by Vulmen. Via Katara's perspective the series follows A:TLA canon, yet offers new content introducing her thoughts as well as events to capture off-screen time. The series has been praised by multiple users, saying it was a great idea from the beginning and a good way to fill in any misunderstandings about Katara. (read more...)",
      "links": [],
      "text": "Eyes of Katara is a fanon series written by Vulmen. Via Katara's perspective the series follows A:TLA canon, yet offers new content introducing her thoughts as well as events to capture off-screen time. The series has been praised by multiple users, saying it was a great idea from the beginning and a good way to fill in any misunderstandings about Katara. (read more...)"
    },
    {
      "body": "Avatar: The Last Airbender Book 4: Air is a fanon series written by FrodoTheHutt. Originally starting on FanFiction.net, this highly praised fanon was moved to Avatar Fanon Wiki. It continues the story of Avatar Aang after the resolution of the War, and the difficulties he faces as the Avatar, keeping balance between the war torn Four Nations. (read more...)",
      "links": [],
      "text": "Avatar: The Last Airbender Book 4: Air is a fanon series written by FrodoTheHutt. Originally starting on FanFiction.net, this highly praised fanon was moved to Avatar Fanon Wiki. It continues the story of Avatar Aang after the resolution of the War, and the difficulties he faces as the Avatar, keeping balance between the war torn Four Nations. (read more...)"
    },
    {
      "body": "Alone is a fanon series written by Millennia2. This story is different from others in that it doesn't take place in the Avatar World; it takes place on Earth in our time. Alone details the story of Leah Sanchez, the current Avatar, who is fighting against an agency bent on controlling or exterminating benders. (read more...)",
      "links": [],
      "text": "Alone is a fanon series written by Millennia2. This story is different from others in that it doesn't take place in the Avatar World; it takes place on Earth in our time. Alone details the story of Leah Sanchez, the current Avatar, who is fighting against an agency bent on controlling or exterminating benders. (read more...)"
    },
    {
      "body": "Sozin's Blood is a fanon series written by French Froglegs. This fanon tells the story of Iroh's and eventual Fire Lord Ozai's life, from Ozai's very birth to his coronation and the scarring of Zuko. The series is a tragical tale following the events that shaped the two brothers into the men they are today.",
      "links": [],
      "text": "Sozin's Blood is a fanon series written by French Froglegs. This fanon tells the story of Iroh's and eventual Fire Lord Ozai's life, from Ozai's very birth to his coronation and the scarring of Zuko. The series is a tragical tale following the events that shaped the two brothers into the men they are today."
    },
    {
      "body": "The new series has become very popular amongst the community, to the extent of the author winning a Fanonbender Award. Five chapters have been aired on Avatar Wiki, with the sixth expected in the coming weeks. (read more...)",
      "links": [],
      "text": "The new series has become very popular amongst the community, to the extent of the author winning a Fanonbender Award. Five chapters have been aired on Avatar Wiki, with the sixth expected in the coming weeks. (read more...)"
    },
    {
      "body": "Honor Thy Father is a fanon series written and created by Dragon of The West. This fanon is a story that provides a dramatic segue between books 2 and 3 of Twilitlink's Avatar: Wanted story, following the decade long conflict between Team Avatar and the malevolent Black Lotus Assassins.",
      "links": [],
      "text": "Honor Thy Father is a fanon series written and created by Dragon of The West. This fanon is a story that provides a dramatic segue between books 2 and 3 of Twilitlink's Avatar: Wanted story, following the decade long conflict between Team Avatar and the malevolent Black Lotus Assassins."
    },
    {
      "body": "The highly popular series takes a more dramatic approach to story telling, in contrast to Wanted's more action like themes. Half way through Book 2: Daughter, Dragon of The West is still running strong with his stories and brilliant ideas, along with the successful collaboration with Twilitlink. (read more...)",
      "links": [],
      "text": "The highly popular series takes a more dramatic approach to story telling, in contrast to Wanted's more action like themes. Half way through Book 2: Daughter, Dragon of The West is still running strong with his stories and brilliant ideas, along with the successful collaboration with Twilitlink. (read more...)"
    },
    {
      "body": "Daughter of Ashes and Air was a fanon series written by Theavatardemotivator. This fanon chronicled the riveting tale of Hai Mu Baila, a twelve year-old Firebender living in the world after the War who is forced to leave her family and become an Airbender. It is only the beginning of a whole new adventure for her.",
      "links": [],
      "text": "Daughter of Ashes and Air was a fanon series written by Theavatardemotivator. This fanon chronicled the riveting tale of Hai Mu Baila, a twelve year-old Firebender living in the world after the War who is forced to leave her family and become an Airbender. It is only the beginning of a whole new adventure for her."
    },
    {
      "body": "This much-praised epic series follows a newer, younger set of characters as they form into a new team of reluctant heroes. With eighteen chapters published so far – nineteen including the prologue – Theavatardemotivator continues to amaze us all with her phenomenal writing and unyielding creativity. Theavatardemotivator, eventually growing dissatisfied with the series, requested that it be deleted in October of 2011.",
      "links": [],
      "text": "This much-praised epic series follows a newer, younger set of characters as they form into a new team of reluctant heroes. With eighteen chapters published so far – nineteen including the prologue – Theavatardemotivator continues to amaze us all with her phenomenal writing and unyielding creativity. Theavatardemotivator, eventually growing dissatisfied with the series, requested that it be deleted in October of 2011."
    },
    {
      "body": "Avatar: The World's Fate is a fanon series written by AvatarFreak21. This fanon starts with Team Avatar after the end of ${link_0} when they are living at the ${link_1}. They all live a peaceful life, but things soon change when a stranger arrives at their doorstep.",
      "links": [
        {
          "body": "The War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_1}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "text": "Avatar: The World's Fate is a fanon series written by AvatarFreak21. This fanon starts with Team Avatar after the end of The War when they are living at the Western Air Temple. They all live a peaceful life, but things soon change when a stranger arrives at their doorstep."
    },
    {
      "body": "This up-and-coming fanon series follows the familiar set of characters from the canon show as they confront new sets of enemies, discover new sides to older characters (such as Hama) and discover a new form of bending known as Willbending. With this fanon, the one thing you can expect is the unexpected.  (read more...)",
      "links": [],
      "text": "This up-and-coming fanon series follows the familiar set of characters from the canon show as they confront new sets of enemies, discover new sides to older characters (such as Hama) and discover a new form of bending known as Willbending. With this fanon, the one thing you can expect is the unexpected.  (read more...)"
    },
    {
      "body": "A:TLAR is an Alternate Universe series written by Lovelyb0nes; it is intended as the author's own interpretation of the universe and storyline of the original series and as a tribute to the original's writers. The plot is centered on Katara Jai, the former chieftess of the Southern Peak tribe, and her efforts to incite a revolution against the Fire Nation and its conquering military. (read more...)",
      "links": [],
      "text": "A:TLAR is an Alternate Universe series written by Lovelyb0nes; it is intended as the author's own interpretation of the universe and storyline of the original series and as a tribute to the original's writers. The plot is centered on Katara Jai, the former chieftess of the Southern Peak tribe, and her efforts to incite a revolution against the Fire Nation and its conquering military. (read more...)"
    },
    {
      "body": "Mysteries of My Past is a relatively new fanon series written by veteran writer The Bos. It takes place during the final decade of The War and revolves around the adventures of Shenji, an Earth Kingdom soldier who is suffering from amnesia. Throughout his eventual quest, he attempts to discover his identity from his constant dreams and nightmares.",
      "links": [],
      "text": "Mysteries of My Past is a relatively new fanon series written by veteran writer The Bos. It takes place during the final decade of The War and revolves around the adventures of Shenji, an Earth Kingdom soldier who is suffering from amnesia. Throughout his eventual quest, he attempts to discover his identity from his constant dreams and nightmares."
    },
    {
      "body": "Using unique characters with their own personalities, Mysteries of My Past is an action-packed fanon which centers around a deep character with an unknown history and draws inspiration from war movies. With a wide variety of themes and surprises in every chapter, this is a fanon that can be appealing to a diverse group of readers. (read more...)",
      "links": [],
      "text": "Using unique characters with their own personalities, Mysteries of My Past is an action-packed fanon which centers around a deep character with an unknown history and draws inspiration from war movies. With a wide variety of themes and surprises in every chapter, this is a fanon that can be appealing to a diverse group of readers. (read more...)"
    },
    {
      "body": "Avatar: Energy Saga is an epic fanon series written by former fanon admin and author AvatarRokusGhost. It takes place after the Hundred Years' War and follows Aang as he delves into the mysteries of Energybending, travels to new places and confronts fearsome enemies – both new and old alike. In the end, Aang finds himself torn between his self and his purpose in this world as the Avatar.",
      "links": [],
      "text": "Avatar: Energy Saga is an epic fanon series written by former fanon admin and author AvatarRokusGhost. It takes place after the Hundred Years' War and follows Aang as he delves into the mysteries of Energybending, travels to new places and confronts fearsome enemies – both new and old alike. In the end, Aang finds himself torn between his self and his purpose in this world as the Avatar."
    },
    {
      "body": "This is a unique series which keeps the viewer reading from chapter to chapter and where you literally have no idea what is going to happen next. While raising a younger generation, the characters from the original show we all know and love – along with some new additions – face new trials and are put to difficult tests. With action, suspense, drama and romance, this fanon is able to appeal to a wide variety of readers. (read more...)",
      "links": [],
      "text": "This is a unique series which keeps the viewer reading from chapter to chapter and where you literally have no idea what is going to happen next. While raising a younger generation, the characters from the original show we all know and love – along with some new additions – face new trials and are put to difficult tests. With action, suspense, drama and romance, this fanon is able to appeal to a wide variety of readers. (read more...)"
    },
    {
      "body": "When Air Nomads Walked the Earth is a fanon series that sprung forth from the talented hands of The Ultimate Waterbender. The story is set in the months before the outbreak of the century long War, where it follows the lives of two adolescents, an Air Nomad girl named Syra and a Fire Nation resident named Siro, in a world that is secretly on the verge of warfare.",
      "links": [],
      "text": "When Air Nomads Walked the Earth is a fanon series that sprung forth from the talented hands of The Ultimate Waterbender. The story is set in the months before the outbreak of the century long War, where it follows the lives of two adolescents, an Air Nomad girl named Syra and a Fire Nation resident named Siro, in a world that is secretly on the verge of warfare."
    },
    {
      "body": "Using vivid and descriptive words, this widely praised series pulls the reader in the story to view the world through its characters' eyes. Introducing almost all new characters, the unknown way of life in the flourishing Air Temples, and world still oblivious to the hardships of war, this fanon has the unique ability to be appealing to all. (read more...)",
      "links": [],
      "text": "Using vivid and descriptive words, this widely praised series pulls the reader in the story to view the world through its characters' eyes. Introducing almost all new characters, the unknown way of life in the flourishing Air Temples, and world still oblivious to the hardships of war, this fanon has the unique ability to be appealing to all. (read more...)"
    },
    {
      "body": "Avatar: The Legend of Rokan is a fanon series created by fanon author Firebender896 that has swiftly taken the fanon portal by storm ever since its inception. It takes place throughout the Avatar world, starting in the Earth Kingdom. It follows the exploits of Rokan, sometimes known as Zoai, a teenager from the Fire Nation during the final stages of ${link_0}.",
      "links": [
        {
          "body": "the war",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "Avatar: The Legend of Rokan is a fanon series created by fanon author Firebender896 that has swiftly taken the fanon portal by storm ever since its inception. It takes place throughout the Avatar world, starting in the Earth Kingdom. It follows the exploits of Rokan, sometimes known as Zoai, a teenager from the Fire Nation during the final stages of the war."
    },
    {
      "body": "With riveting description and a plot that hooks readers right off the bat, it is no wonder that this series has earned the distinction of becoming the third fanon in Avatar Wiki history to be double-featured (Better World and Wanted were the first two to attain featured fanon series and article in the same month.) But what makes this fanon what so unique is Firebender896’s artistic talents, which complement her writing skill and breathe life into her pages. (read more...)",
      "links": [],
      "text": "With riveting description and a plot that hooks readers right off the bat, it is no wonder that this series has earned the distinction of becoming the third fanon in Avatar Wiki history to be double-featured (Better World and Wanted were the first two to attain featured fanon series and article in the same month.) But what makes this fanon what so unique is Firebender896’s artistic talents, which complement her writing skill and breathe life into her pages. (read more...)"
    },
    {
      "body": "Avatar Brek is set sixteen years after ${link_0} passed away, when Brek of the ${link_1} is revealed as the new Avatar, the chosen one who is responsible for keeping balance for the world. Unfortunately, Brek is about to inherit a world of problems. His predecessor, Korra, successfully ceased anti-bender revolts, but now a group of bender supremacists, called the Isha, plan to destroy all non-benders leaving only the \"genetically superior\" to remain. Read as the story of Brek unfolds!",
      "links": [
        {
          "body": "Avatar Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Avatar Brek is set sixteen years after Avatar Korra passed away, when Brek of the Earth Kingdom is revealed as the new Avatar, the chosen one who is responsible for keeping balance for the world. Unfortunately, Brek is about to inherit a world of problems. His predecessor, Korra, successfully ceased anti-bender revolts, but now a group of bender supremacists, called the Isha, plan to destroy all non-benders leaving only the \"genetically superior\" to remain. Read as the story of Brek unfolds!"
    },
    {
      "body": "This fanon is relatively new, but has been an original storyline from the very beginning. While the original Team Avatar is not seen, the world that they built is present – and inhabited by a new rag-tag group of young adventurers surrounding a new Avatar and his journey. Brek and his companions must face new enemies, tackle new challenges, as well as cope with political complexities in an ever-changing world in their adventure. The twists and vivid background of the story keep fans of Avatar Brek wanting more. (read more...)",
      "links": [],
      "text": "This fanon is relatively new, but has been an original storyline from the very beginning. While the original Team Avatar is not seen, the world that they built is present – and inhabited by a new rag-tag group of young adventurers surrounding a new Avatar and his journey. Brek and his companions must face new enemies, tackle new challenges, as well as cope with political complexities in an ever-changing world in their adventure. The twists and vivid background of the story keep fans of Avatar Brek wanting more. (read more...)"
    },
    {
      "body": "The Avatar Rhythm is BlackMonkey's current fanon about a teenage boy named Shirou who is born 224 years after Avatar: The Last Airbender, when the war ends. After Shirou runs away from his saddening life of royalty in the Northern Water Tribe, everything around him starts taking some mysterious turns as he tries to find and kill the Avatar, destined on getting revenge after the last Avatar accidentally killed his grandfather in war. Corrupted and lost, he befriends the young daughter of a Fire Nation governor who has a similar goal as his.",
      "links": [],
      "text": "The Avatar Rhythm is BlackMonkey's current fanon about a teenage boy named Shirou who is born 224 years after Avatar: The Last Airbender, when the war ends. After Shirou runs away from his saddening life of royalty in the Northern Water Tribe, everything around him starts taking some mysterious turns as he tries to find and kill the Avatar, destined on getting revenge after the last Avatar accidentally killed his grandfather in war. Corrupted and lost, he befriends the young daughter of a Fire Nation governor who has a similar goal as his."
    },
    {
      "body": "Numerous plot twists keep Shirou's journey in motion as he endlessly pursues his goal of killing the Avatar. The protagonist is thrown into conspiracies, curses, tax collectors and bands of rebels, leaving only a few wise souls left that can shape his true destiny. The Avatar Rhythm has attracted a multitude of readers with its unique story line and well-planned execution. It is obvious that a lot of hard work has gone into making this popular series what it is. (read more...)",
      "links": [],
      "text": "Numerous plot twists keep Shirou's journey in motion as he endlessly pursues his goal of killing the Avatar. The protagonist is thrown into conspiracies, curses, tax collectors and bands of rebels, leaving only a few wise souls left that can shape his true destiny. The Avatar Rhythm has attracted a multitude of readers with its unique story line and well-planned execution. It is obvious that a lot of hard work has gone into making this popular series what it is. (read more...)"
    },
    {
      "body": "Avatar- Aftermath and Burning Earth is a completed fanon story by Mageddon725. As an \"after-the-war\" fanon, Avatar- Aftermath and Burning Earth begins with the journey of Yun Zhen, an earthbender with a disability which prevents him from lifting large rocks. With the help of Bumi, he learns to overcome this by using other techniques, such as rock gloves. Later, Yun joins the cast of Team Avatar as they all embark on an epic new adventure, to combat a new uprising by Yuan Chong, the 51st Earth King, who many thought dead.",
      "links": [],
      "text": "Avatar- Aftermath and Burning Earth is a completed fanon story by Mageddon725. As an \"after-the-war\" fanon, Avatar- Aftermath and Burning Earth begins with the journey of Yun Zhen, an earthbender with a disability which prevents him from lifting large rocks. With the help of Bumi, he learns to overcome this by using other techniques, such as rock gloves. Later, Yun joins the cast of Team Avatar as they all embark on an epic new adventure, to combat a new uprising by Yuan Chong, the 51st Earth King, who many thought dead."
    },
    {
      "body": "Mageddon captivates readers of all types with his well-written and well-planned story of adventure, suspense, action and romance. This series has received well-deserved praise on its way to popularity - and for good reason. The thrills of this story are impossible to resist, with new characters that integrate perfectly with the traditional ATLA cast, who are all portrayed very much in-character. (read more...)",
      "links": [],
      "text": "Mageddon captivates readers of all types with his well-written and well-planned story of adventure, suspense, action and romance. This series has received well-deserved praise on its way to popularity - and for good reason. The thrills of this story are impossible to resist, with new characters that integrate perfectly with the traditional ATLA cast, who are all portrayed very much in-character. (read more...)"
    },
    {
      "body": "A Bird Could Love a Fish is a completed fanon series by renowned fanon author Theavatardemotivator. It’s a collection of a hundred and one Kataang one-shots that capture the depth and character of one of Avatar: The Last Airbender’s most popular relationships. It took the writer just under three months to compose this masterpiece, with each chapter being approximately 500 words in length.",
      "links": [],
      "text": "A Bird Could Love a Fish is a completed fanon series by renowned fanon author Theavatardemotivator. It’s a collection of a hundred and one Kataang one-shots that capture the depth and character of one of Avatar: The Last Airbender’s most popular relationships. It took the writer just under three months to compose this masterpiece, with each chapter being approximately 500 words in length."
    },
    {
      "body": "The remarkable prose and poetic detail that this masterful crafter of language demonstrates has been spell-binding for passionate Kataang shippers as well as anyone looking to read something worth reading. Both characters of the romance come to life, memorable of how they did in the canon show. The praise that this fanon series is well-deserved, as is its being featured fanon series for this month. (read more...)",
      "links": [],
      "text": "The remarkable prose and poetic detail that this masterful crafter of language demonstrates has been spell-binding for passionate Kataang shippers as well as anyone looking to read something worth reading. Both characters of the romance come to life, memorable of how they did in the canon show. The praise that this fanon series is well-deserved, as is its being featured fanon series for this month. (read more...)"
    },
    {
      "body": "To BE but Not to BE is a relatively new fanon series by Omar067 which offers the reader an original, unorthodox plot for an Avatar fanon. It tells the tale of Avatar Korra’s successor, an Earth Kingdom boy named Elquiorra. Unlike a lot of Avatars, Elquiorra harbors a nihilistic viewpoint on life. His journey leads him to face a powerful foe called the Death God who has taken over Republic City and whose followers use a new form of bending called Biobending.",
      "links": [],
      "text": "To BE but Not to BE is a relatively new fanon series by Omar067 which offers the reader an original, unorthodox plot for an Avatar fanon. It tells the tale of Avatar Korra’s successor, an Earth Kingdom boy named Elquiorra. Unlike a lot of Avatars, Elquiorra harbors a nihilistic viewpoint on life. His journey leads him to face a powerful foe called the Death God who has taken over Republic City and whose followers use a new form of bending called Biobending."
    },
    {
      "body": "Although fairly new, the series has already attracted a good amount of attention and many of the regular readers are now recommending the series to others looking for an enticing work of Avatar fan fiction to delve into. It should appeal to those who seek a new type of story with a new type of journey not found in the canon show and showing another side of the Avatar universe. (read more...)",
      "links": [],
      "text": "Although fairly new, the series has already attracted a good amount of attention and many of the regular readers are now recommending the series to others looking for an enticing work of Avatar fan fiction to delve into. It should appeal to those who seek a new type of story with a new type of journey not found in the canon show and showing another side of the Avatar universe. (read more...)"
    },
    {
      "body": "Air is a fanon series by Wordbender. Avatar Aang and Fire Lord Zuko have worked hard to maintain the long lasting -if at times unsteady- world peace. And for twelve years, despite skirmishes and trials, they have succeeded. Until now. Rebels stir. Allies are questioned. Spies and assassins skulk the halls of the Royal Fire Palace, and a shadow haunts the heart of Avatar Aang. Any peace the world has gained is quickly dissolving into a dangerous game of disguise and deception.",
      "links": [],
      "text": "Air is a fanon series by Wordbender. Avatar Aang and Fire Lord Zuko have worked hard to maintain the long lasting -if at times unsteady- world peace. And for twelve years, despite skirmishes and trials, they have succeeded. Until now. Rebels stir. Allies are questioned. Spies and assassins skulk the halls of the Royal Fire Palace, and a shadow haunts the heart of Avatar Aang. Any peace the world has gained is quickly dissolving into a dangerous game of disguise and deception."
    },
    {
      "body": "Over its time on the wiki \nAir has found a number of fans. The story is known for its suspense and story that builds up with every chapter. Users will be amazed at the quality of how Wordbender dazzles us with exciting twists and strong characters that show us her writing expertise. (read more...)",
      "links": [],
      "text": "Over its time on the wiki \nAir has found a number of fans. The story is known for its suspense and story that builds up with every chapter. Users will be amazed at the quality of how Wordbender dazzles us with exciting twists and strong characters that show us her writing expertise. (read more...)"
    },
    {
      "body": "Child of the War is a fanon series by Annawantimes. The series describes the life of a boy named Jenju who's life has been severely uprooted by the war of Avatar Aang's epoch. One day, his entire life is burned to the ground. He is unsure whether or not his parents survived the attacked, and he must go after the group of enemies. What dangers will he face along the way, and will devastation await him when he catches them?",
      "links": [],
      "text": "Child of the War is a fanon series by Annawantimes. The series describes the life of a boy named Jenju who's life has been severely uprooted by the war of Avatar Aang's epoch. One day, his entire life is burned to the ground. He is unsure whether or not his parents survived the attacked, and he must go after the group of enemies. What dangers will he face along the way, and will devastation await him when he catches them?"
    },
    {
      "body": "Garnering a handful of subscribers and praising comments from those who supported its nomination for Featured Fanon Series, Child of the War has shown to be a well-written and appealing tale, which those looking for an Avatar fanfic would do good to notice. (read more...)",
      "links": [],
      "text": "Garnering a handful of subscribers and praising comments from those who supported its nomination for Featured Fanon Series, Child of the War has shown to be a well-written and appealing tale, which those looking for an Avatar fanfic would do good to notice. (read more...)"
    },
    {
      "body": "Silent Hero in Emerald is a new fanon series by Minnichi that explores the life of Yuhan, a quirky but talented agent of the Dai Li. He works under the principle that those who threaten the balance of Ba Sing Se must be eliminated at once...until the day his organization decides that \"those\" include the love of his life.",
      "links": [],
      "text": "Silent Hero in Emerald is a new fanon series by Minnichi that explores the life of Yuhan, a quirky but talented agent of the Dai Li. He works under the principle that those who threaten the balance of Ba Sing Se must be eliminated at once...until the day his organization decides that \"those\" include the love of his life."
    },
    {
      "body": "Known for its vivid descriptions and powerful character development, Minnichi's award-winning fanon has attracted enthusiastic readers from both Fanfiction.net and Avatar Wiki alike. In addition to winning its own character illustrations, the writing quality has gained exceptional reviews and a variety of achievements on the wiki. The story comes to life as readers feel each raw emotion, and the intense journey proves to be much more than a romance. (read more...)",
      "links": [],
      "text": "Known for its vivid descriptions and powerful character development, Minnichi's award-winning fanon has attracted enthusiastic readers from both Fanfiction.net and Avatar Wiki alike. In addition to winning its own character illustrations, the writing quality has gained exceptional reviews and a variety of achievements on the wiki. The story comes to life as readers feel each raw emotion, and the intense journey proves to be much more than a romance. (read more...)"
    },
    {
      "body": "Scarf is one of the latest fanon creations of Theavatardemotivator, and is a highly-praised background story going all the way back to Mako and Bolin’s childhood. Starting on Bolin’s sixth birthday, their happy family life filled with love is shaken up and the two young brothers must rely on one another. This is the story about how the well-known characters from ${link_0} became how they were when fans first met them.",
      "links": [
        {
          "body": "The Legend of Korra",
          "key": "${link_0}",
          "target": {
            "href": "The_Legend_of_Korra",
            "page": "The_Legend_of_Korra"
          }
        }
      ],
      "text": "Scarf is one of the latest fanon creations of Theavatardemotivator, and is a highly-praised background story going all the way back to Mako and Bolin’s childhood. Starting on Bolin’s sixth birthday, their happy family life filled with love is shaken up and the two young brothers must rely on one another. This is the story about how the well-known characters from The Legend of Korra became how they were when fans first met them."
    },
    {
      "body": "Unwavering in her powerful style and riveting creativity, the author of this story has poured her writing spirit and lightning-struck inspiration into this masterpiece, which has captured the hearts and minds of many frequenters of the great stories that the Avatar Wiki Fanon Portal has to offer. So few stories can stir the emotions of a reader with such compelling setting and the right selection of moments to tell such a vast tale without the highest word count.\n(read more...)",
      "links": [],
      "text": "Unwavering in her powerful style and riveting creativity, the author of this story has poured her writing spirit and lightning-struck inspiration into this masterpiece, which has captured the hearts and minds of many frequenters of the great stories that the Avatar Wiki Fanon Portal has to offer. So few stories can stir the emotions of a reader with such compelling setting and the right selection of moments to tell such a vast tale without the highest word count.\n(read more...)"
    },
    {
      "body": "Heiress of the Nile is a fanon story originating from the creative mind of Lady Lostris, a non-native English speaker. Through astonishingly beautiful descriptions, Ancient Egypt blends wonderfully together with the Avatar universe. After the tragic loss of both her mother and younger sister, Crown Princess Lostris is at the brink of being devoured by the insatiable hunger for power of her vicious legal guardian, Naja. In order to reclaim her rightful place as heiress to the Fire Nation, she will have to learn more about the shadowy maze of her past, the tangled connections of the present and the depths of her own character than she could ever imagine, to unleash her power within.",
      "links": [],
      "text": "Heiress of the Nile is a fanon story originating from the creative mind of Lady Lostris, a non-native English speaker. Through astonishingly beautiful descriptions, Ancient Egypt blends wonderfully together with the Avatar universe. After the tragic loss of both her mother and younger sister, Crown Princess Lostris is at the brink of being devoured by the insatiable hunger for power of her vicious legal guardian, Naja. In order to reclaim her rightful place as heiress to the Fire Nation, she will have to learn more about the shadowy maze of her past, the tangled connections of the present and the depths of her own character than she could ever imagine, to unleash her power within."
    },
    {
      "body": "Through breathtaking descriptions, witty and vivid dialogues, profound characters and an intriguing storyline, Heiress of the Nile has kept hold of anyone who ever laid eyes on it. Wrapping its readers in the swirling dynamics of this amazing story, each chapter leaves them yearning for only one thing: more. (read more...)",
      "links": [],
      "text": "Through breathtaking descriptions, witty and vivid dialogues, profound characters and an intriguing storyline, Heiress of the Nile has kept hold of anyone who ever laid eyes on it. Wrapping its readers in the swirling dynamics of this amazing story, each chapter leaves them yearning for only one thing: more. (read more...)"
    },
    {
      "body": "Elements of Life is a collection of one-shots written by Typhoonmaster, using characters and places in ${link_0} and ${link_1}. The stories are to be read leisurely and in no particular order, although they are arranged chronologically to make navigation easier. There is no concrete plot, but each story is inspired by a particular experience in the author's life. Regarding the actual content, some stories stand alone with no ties to the canon story, while others explore the thoughts of characters in scenes from the show. Each one-shot varies in genre from drama to humor to romance; some are dark, others are light.",
      "links": [
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_0}",
          "target": {
            "href": "Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        },
        {
          "body": "The Legend of Korra",
          "key": "${link_1}",
          "target": {
            "href": "The_Legend_of_Korra",
            "page": "The_Legend_of_Korra"
          }
        }
      ],
      "text": "Elements of Life is a collection of one-shots written by Typhoonmaster, using characters and places in Avatar: The Last Airbender and The Legend of Korra. The stories are to be read leisurely and in no particular order, although they are arranged chronologically to make navigation easier. There is no concrete plot, but each story is inspired by a particular experience in the author's life. Regarding the actual content, some stories stand alone with no ties to the canon story, while others explore the thoughts of characters in scenes from the show. Each one-shot varies in genre from drama to humor to romance; some are dark, others are light."
    },
    {
      "body": "Already nominated twice for featured fanon series, Elements of Life has achieved strong, consistent scores in every ${link_0} review, and also achieved its first fanonbending award in the middle of September 2012. The author, Typhoonmaster, always gets props from other users for his amazingly poetic and unique style. read more...",
      "links": [
        {
          "body": "Fanon Review Squad",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Wiki_Fanon_Review_Squad",
            "page": "Avatar_Wiki_Fanon_Review_Squad"
          }
        }
      ],
      "text": "Already nominated twice for featured fanon series, Elements of Life has achieved strong, consistent scores in every Fanon Review Squad review, and also achieved its first fanonbending award in the middle of September 2012. The author, Typhoonmaster, always gets props from other users for his amazingly poetic and unique style. read more..."
    },
    {
      "body": "Emblem of the Outlaw is a successful story, had finished by MibuWolf, one of the FRS member. Takes place three years after the death of Avatar Korra, three years after the Avatar was reborn into the Earth Kingdom, a powerful bender opened a portal into the spirit realm. An imbalance between the worlds came, causing several more portals were torn open: one in the Earth Kingdom, one in the Fire Nation, one in the Northern Air Temple, one in the Southern Water Tribe, and one in the middle of Republic City.",
      "links": [],
      "text": "Emblem of the Outlaw is a successful story, had finished by MibuWolf, one of the FRS member. Takes place three years after the death of Avatar Korra, three years after the Avatar was reborn into the Earth Kingdom, a powerful bender opened a portal into the spirit realm. An imbalance between the worlds came, causing several more portals were torn open: one in the Earth Kingdom, one in the Fire Nation, one in the Northern Air Temple, one in the Southern Water Tribe, and one in the middle of Republic City."
    },
    {
      "body": "Spirits poured into the human world through these portals. Most of the spirits who passed through were lesser spirits, but some malignant spirits came through and wreaked havoc on the humans. Likewise, some humans would stumble into the spirit realm and disturb the more powerful spirits--most humans never came back from the spirit realm. Overall, the result of these portals was that humans suffered more than spirits. The humans cast all the blame for these incidents upon the spirits, and being blamed for an incident that was obviously the humans' fault irritated the spirits. Thus tensions began to rise. (read more...)",
      "links": [],
      "text": "Spirits poured into the human world through these portals. Most of the spirits who passed through were lesser spirits, but some malignant spirits came through and wreaked havoc on the humans. Likewise, some humans would stumble into the spirit realm and disturb the more powerful spirits--most humans never came back from the spirit realm. Overall, the result of these portals was that humans suffered more than spirits. The humans cast all the blame for these incidents upon the spirits, and being blamed for an incident that was obviously the humans' fault irritated the spirits. Thus tensions began to rise. (read more...)"
    },
    {
      "body": "Phantoms is a magnificent story written by Aritiane, a non-English speaker. The realistic story and the vivid description turn from a nothing become a superb, wonderful fanon that have received the \"9\" and above in all of its reviews! The author, Aritiane is not a native English speaker, but his works in literature is amazing! Come and ask him about the Phantoms update, if you dare. . . Aritiane begun his work as writer in Avatar Wiki since July 12, 2012. The story was planned to be divided onto 10 episodes, and until right now there are 4 episodes written.",
      "links": [],
      "text": "Phantoms is a magnificent story written by Aritiane, a non-English speaker. The realistic story and the vivid description turn from a nothing become a superb, wonderful fanon that have received the \"9\" and above in all of its reviews! The author, Aritiane is not a native English speaker, but his works in literature is amazing! Come and ask him about the Phantoms update, if you dare. . . Aritiane begun his work as writer in Avatar Wiki since July 12, 2012. The story was planned to be divided onto 10 episodes, and until right now there are 4 episodes written."
    },
    {
      "body": "Phantoms. It's about the repercussions of the anti-bender revolution and a follow-up of Korra's adventures. Takes place in the Republic City, heals its wounds after Amon's death, but even now it is not at peace: the Equalists' philosophy has thrived as new movements and their various leaders continue to demand an equal treatment to non-benders. The Council is under a continuous political siege and it seems that the current status quo will not last any longer. And new dangers — phantoms from the past — await Korra who is trying to adapt to the new reality. If you are, yes, YOU are looking for a complex story, much intense and wonderfully-written fanon, come here and click. . . (read more...)",
      "links": [],
      "text": "Phantoms. It's about the repercussions of the anti-bender revolution and a follow-up of Korra's adventures. Takes place in the Republic City, heals its wounds after Amon's death, but even now it is not at peace: the Equalists' philosophy has thrived as new movements and their various leaders continue to demand an equal treatment to non-benders. The Council is under a continuous political siege and it seems that the current status quo will not last any longer. And new dangers — phantoms from the past — await Korra who is trying to adapt to the new reality. If you are, yes, YOU are looking for a complex story, much intense and wonderfully-written fanon, come here and click. . . (read more...)"
    },
    {
      "body": "Dragons, Sieges and Volcanoes is the newest project of AvatarRokusGhost. Though relatively new, the fame he gathered as a writer on this wiki carried on to his newest story and it is quickly taking the fanon portal by storm.",
      "links": [],
      "text": "Dragons, Sieges and Volcanoes is the newest project of AvatarRokusGhost. Though relatively new, the fame he gathered as a writer on this wiki carried on to his newest story and it is quickly taking the fanon portal by storm."
    },
    {
      "body": "When the granddaughter of Avatar Aang mentioned the historical saga in passing conversation with current Avatar Korra, the ghost of Avatar Roku was happy that she counted it amongst her favorite stories, for it was one of his favorite stories as well. It involves suspense, adventure, war, conspiracy, deception, action and, of course – romance. However, the ghost of Avatar Roku was not fully-satisfied by Jinora’s telling. While she touched in on some of the best bits in her brief overview, she also skipped over a lot of important parts in between and she may have left her audience with the wrong impression. Dragons, Sieges and Volcanoes thus sets out to fill in the blanks and properly tell the historical saga where the heroine fell in love with the enemy general's son, who was supposed to marry the princess, and thus rode a dragon into battle and burned down the entire country, before jumping into a volcano. (read more...)",
      "links": [],
      "text": "When the granddaughter of Avatar Aang mentioned the historical saga in passing conversation with current Avatar Korra, the ghost of Avatar Roku was happy that she counted it amongst her favorite stories, for it was one of his favorite stories as well. It involves suspense, adventure, war, conspiracy, deception, action and, of course – romance. However, the ghost of Avatar Roku was not fully-satisfied by Jinora’s telling. While she touched in on some of the best bits in her brief overview, she also skipped over a lot of important parts in between and she may have left her audience with the wrong impression. Dragons, Sieges and Volcanoes thus sets out to fill in the blanks and properly tell the historical saga where the heroine fell in love with the enemy general's son, who was supposed to marry the princess, and thus rode a dragon into battle and burned down the entire country, before jumping into a volcano. (read more...)"
    },
    {
      "body": "Political Animals is a project from the superb fanon author, Omashu Rocks, who successfully manages to blend complex politics with the well-known Avatar Universe.",
      "links": [],
      "text": "Political Animals is a project from the superb fanon author, Omashu Rocks, who successfully manages to blend complex politics with the well-known Avatar Universe."
    },
    {
      "body": "Only a naive fool would honestly believe that Ba Sing Se simply reinstalled Kuei as their leader and moved on peacefully. No, that wouldn't be possible in the most politically corrupt and morally bankrupt city in the world. Immediately after Ozai's defeat, cries for a change in government shot throughout the entire Earth Kingdom. While a few did favor Kuei to remain as ruler, most became addicted to the concept of holding a free Democratic election to determine who would become the President of the Earth Nation. Avatar Aang, believing it was not his role to use his influence to elect his preferred President, declared that candidates with similar ideas would form parties and a clear platform that the people could use to make their decision. Out of the genuine belief that he was best for the position and nothing else, General How immediately joins the Liberal Party along with Lao Beifong and others. To How's dismay, General Fong and General Sung form the Military Party and vie for the nomination, vowing for a strong militaristic rule over the nation. To make matters much worse, Long Feng establishes the Communist Party, and began to run on a platform of \"standing up for the people\". (read more...)",
      "links": [],
      "text": "Only a naive fool would honestly believe that Ba Sing Se simply reinstalled Kuei as their leader and moved on peacefully. No, that wouldn't be possible in the most politically corrupt and morally bankrupt city in the world. Immediately after Ozai's defeat, cries for a change in government shot throughout the entire Earth Kingdom. While a few did favor Kuei to remain as ruler, most became addicted to the concept of holding a free Democratic election to determine who would become the President of the Earth Nation. Avatar Aang, believing it was not his role to use his influence to elect his preferred President, declared that candidates with similar ideas would form parties and a clear platform that the people could use to make their decision. Out of the genuine belief that he was best for the position and nothing else, General How immediately joins the Liberal Party along with Lao Beifong and others. To How's dismay, General Fong and General Sung form the Military Party and vie for the nomination, vowing for a strong militaristic rule over the nation. To make matters much worse, Long Feng establishes the Communist Party, and began to run on a platform of \"standing up for the people\". (read more...)"
    },
    {
      "body": "The Journey of Tala is a recently completed fanon story by the talented writer known as The Snowbold. Born of Earth Kingdom heritage, Tala is the successor of Avatar Korra and is forced to face challenges that neither of the two famous Avatars preceding her did. Peace is widespread, but it is an illusion. Republic City has taken actions that threaten and insult the sovereignty of the Fire Nation. Fear has spread around the world that war will break out again. Tala is nineteen years old when the story begins. Choices must be made, as an individual called the Black Dragon orchestrates a world war, Tala must find a way to end it. But in a world of power and greed, nothing is as it seems. Even Tala will be rocked by her choices, and the past shall decide the future. Can Tala fulfill her destiny? What will her journey bring?",
      "links": [],
      "text": "The Journey of Tala is a recently completed fanon story by the talented writer known as The Snowbold. Born of Earth Kingdom heritage, Tala is the successor of Avatar Korra and is forced to face challenges that neither of the two famous Avatars preceding her did. Peace is widespread, but it is an illusion. Republic City has taken actions that threaten and insult the sovereignty of the Fire Nation. Fear has spread around the world that war will break out again. Tala is nineteen years old when the story begins. Choices must be made, as an individual called the Black Dragon orchestrates a world war, Tala must find a way to end it. But in a world of power and greed, nothing is as it seems. Even Tala will be rocked by her choices, and the past shall decide the future. Can Tala fulfill her destiny? What will her journey bring?"
    },
    {
      "body": "With its dedicated fan base and consistent quality, The Journey of Tala has been deservedly selected as June 2013's featured fanon series. The Snowbold's engaging writing and creative expansion of the Avatarverse on many layers will keep any reader interested from the moment they delve into this tale. (read more...)",
      "links": [],
      "text": "With its dedicated fan base and consistent quality, The Journey of Tala has been deservedly selected as June 2013's featured fanon series. The Snowbold's engaging writing and creative expansion of the Avatarverse on many layers will keep any reader interested from the moment they delve into this tale. (read more...)"
    },
    {
      "body": "When Past Meets Present is an excellently written story by the talented Fruipit. The story plays on the idea of 'what would happen if Toph was plagued by a Spirit after going home?', an idea developed after the author read some of the Toph/Ummi Theory, and when she realized that while Toph is strong like a rock, she can break like one too. And rocks don't really break; they shatter.",
      "links": [],
      "text": "When Past Meets Present is an excellently written story by the talented Fruipit. The story plays on the idea of 'what would happen if Toph was plagued by a Spirit after going home?', an idea developed after the author read some of the Toph/Ummi Theory, and when she realized that while Toph is strong like a rock, she can break like one too. And rocks don't really break; they shatter."
    },
    {
      "body": "No-one really knows what happened to Toph in the years succeeding the end of the war - it's as though she disappeared from the face of the earth. For those four years, Aang has blamed her, but felt at fault; what if it wasn't his fault, though? Toph is keeping secrets of her own, and even the Avatar cannot fathom the reach of a hungry spirit who wants to play.",
      "links": [],
      "text": "No-one really knows what happened to Toph in the years succeeding the end of the war - it's as though she disappeared from the face of the earth. For those four years, Aang has blamed her, but felt at fault; what if it wasn't his fault, though? Toph is keeping secrets of her own, and even the Avatar cannot fathom the reach of a hungry spirit who wants to play."
    },
    {
      "body": "As the masterpieces from Fruipit spread over the Fanon Portal, people can easily find and read poems nowadays. (read more...)",
      "links": [],
      "text": "As the masterpieces from Fruipit spread over the Fanon Portal, people can easily find and read poems nowadays. (read more...)"
    },
    {
      "body": "Nirvana is the latest and greatest series by the proclaimed author and reviewer, Typhoonmaster. Unleashing all his potential, this story has the perfect balance of powerful wording and mysterious intrigue to get you hooked and on the edge of your seat for more.",
      "links": [],
      "text": "Nirvana is the latest and greatest series by the proclaimed author and reviewer, Typhoonmaster. Unleashing all his potential, this story has the perfect balance of powerful wording and mysterious intrigue to get you hooked and on the edge of your seat for more."
    },
    {
      "body": "A young boy, orphaned as an infant, has no knowledge of who he is or what he will become. Strange dreams plague him, setting off a chain of events that will lead him to discovering who he truly is, and what truly matters in life. (read more...)",
      "links": [],
      "text": "A young boy, orphaned as an infant, has no knowledge of who he is or what he will become. Strange dreams plague him, setting off a chain of events that will lead him to discovering who he truly is, and what truly matters in life. (read more...)"
    },
    {
      "body": "Inheritance is the praised fanon from new author ByBray.",
      "links": [],
      "text": "Inheritance is the praised fanon from new author ByBray."
    },
    {
      "body": "Following the backstory of Tenzin, Inheritance delves into the past of Aang and Katara's third son, and the struggles he faces to come to terms with his heritage, and what it means for his future. The adventures and challenges described in this story mold the young airbender into the wise, respected man we know to be Korra's mentor.",
      "links": [],
      "text": "Following the backstory of Tenzin, Inheritance delves into the past of Aang and Katara's third son, and the struggles he faces to come to terms with his heritage, and what it means for his future. The adventures and challenges described in this story mold the young airbender into the wise, respected man we know to be Korra's mentor."
    },
    {
      "body": "ByBray's beautiful writing sucks readers in and keeps them interested all the way through. Every word is carefully thought out to enrich the reading experience of this \"rising star\" fanon. Go ahead and check out the fanon by recipient of the Outstanding New Author fanon award! (read more...)",
      "links": [],
      "text": "ByBray's beautiful writing sucks readers in and keeps them interested all the way through. Every word is carefully thought out to enrich the reading experience of this \"rising star\" fanon. Go ahead and check out the fanon by recipient of the Outstanding New Author fanon award! (read more...)"
    },
    {
      "body": "Crossfire is the intriguing fanon from Omashu Rocks, an author who knows exactly what he's doing with words, and isn't afraid to show you.",
      "links": [],
      "text": "Crossfire is the intriguing fanon from Omashu Rocks, an author who knows exactly what he's doing with words, and isn't afraid to show you."
    },
    {
      "body": "This story follows the life of Nalia, a firebender born in the Fire Nation, and trained to kill without batting an eye. When her father is murdered, and her life — and the life of her sister — is put at stake, she chooses not to die, instead joining the Fire Nation's most elite group of killers. Only this way will she be able to earn her freedom. She will kill, or die trying.",
      "links": [],
      "text": "This story follows the life of Nalia, a firebender born in the Fire Nation, and trained to kill without batting an eye. When her father is murdered, and her life — and the life of her sister — is put at stake, she chooses not to die, instead joining the Fire Nation's most elite group of killers. Only this way will she be able to earn her freedom. She will kill, or die trying."
    },
    {
      "body": "An edgy story, full of violence and action, anyone who is a fan of any type of darker story should definitely not miss out on this one. (read more...)",
      "links": [],
      "text": "An edgy story, full of violence and action, anyone who is a fan of any type of darker story should definitely not miss out on this one. (read more...)"
    },
    {
      "body": "The Gunfighter is one of the hidden gems of the fanon portal, written by one of the most dedicated authors we have on the wiki, Jacob13Kyle!",
      "links": [],
      "text": "The Gunfighter is one of the hidden gems of the fanon portal, written by one of the most dedicated authors we have on the wiki, Jacob13Kyle!"
    },
    {
      "body": "This story follows the tale of John Rider, a Gunslinger from our world who also has the ability to firebend. When betrayed by those he once believed to be his friends and allies, he has but one choice; escape into the world of Avatar. Here, he finds himself fighting to stop a war he shouldn't even be a part of, and along the way making new friends and uncovering dark secrets about his past, and the people he once allied himself with.",
      "links": [],
      "text": "This story follows the tale of John Rider, a Gunslinger from our world who also has the ability to firebend. When betrayed by those he once believed to be his friends and allies, he has but one choice; escape into the world of Avatar. Here, he finds himself fighting to stop a war he shouldn't even be a part of, and along the way making new friends and uncovering dark secrets about his past, and the people he once allied himself with."
    },
    {
      "body": "Danger, intrigue, and just enough romance to keep you on your seat for more are all featured in this fantastic story. Don't believe me? Take a look. (read more...)",
      "links": [],
      "text": "Danger, intrigue, and just enough romance to keep you on your seat for more are all featured in this fantastic story. Don't believe me? Take a look. (read more...)"
    },
    {
      "body": "The Kyoshi Chronicles is one of the few stories to focus on a past Avatar, but with a love for Kyoshi that words can't define, Kyoshidude really takes history to a whole new level!",
      "links": [],
      "text": "The Kyoshi Chronicles is one of the few stories to focus on a past Avatar, but with a love for Kyoshi that words can't define, Kyoshidude really takes history to a whole new level!"
    },
    {
      "body": "What happens if the Earth King doesn't want an Avatar? Seventeen year old Kyoshi has to face danger like she never has before, all the while trying to learn, not just the other three elements, but her native earthbending; she didn't even realize she was a bender at first. With the help of her two friends and a shirshu, Kyoshi must evade almost everyone if she wants to survive long enough to bring balance back. Can she do it?",
      "links": [],
      "text": "What happens if the Earth King doesn't want an Avatar? Seventeen year old Kyoshi has to face danger like she never has before, all the while trying to learn, not just the other three elements, but her native earthbending; she didn't even realize she was a bender at first. With the help of her two friends and a shirshu, Kyoshi must evade almost everyone if she wants to survive long enough to bring balance back. Can she do it?"
    },
    {
      "body": "Kyoshidude really takes his writing seriously, and it's obvious from the effort he puts into it that he loves his writing. I can guarantee that you'll love it too. (read more...)",
      "links": [],
      "text": "Kyoshidude really takes his writing seriously, and it's obvious from the effort he puts into it that he loves his writing. I can guarantee that you'll love it too. (read more...)"
    },
    {
      "body": "Avatar: Neo Revolution is the fantastic ongoing series by Jtwin1. For such an interesting topic, two boys who grew up together being potential Avatars, this idea isn't nearly explored enough (although when you're up against this story, would you bother, either?)",
      "links": [],
      "text": "Avatar: Neo Revolution is the fantastic ongoing series by Jtwin1. For such an interesting topic, two boys who grew up together being potential Avatars, this idea isn't nearly explored enough (although when you're up against this story, would you bother, either?)"
    },
    {
      "body": "Dover and Sedgely are just two average waterbending orphans. There's nothing mystical about them at all, really... except for the fact that one of them may be the Avatar. The world needs an Avatar, and they must journey to the appropriately-named Haven to try and return peace. With danger lurking around every corner, can the two boys manage it?",
      "links": [],
      "text": "Dover and Sedgely are just two average waterbending orphans. There's nothing mystical about them at all, really... except for the fact that one of them may be the Avatar. The world needs an Avatar, and they must journey to the appropriately-named Haven to try and return peace. With danger lurking around every corner, can the two boys manage it?"
    },
    {
      "body": "One of those hidden gems of the fanon portal, this story really deserves such a title as 'featured fanon'; with brilliant action scenes, suspense and mystery, this is a story for everyone. Don't believe me? (read more...)",
      "links": [],
      "text": "One of those hidden gems of the fanon portal, this story really deserves such a title as 'featured fanon'; with brilliant action scenes, suspense and mystery, this is a story for everyone. Don't believe me? (read more...)"
    },
    {
      "body": "There are few stories here that are designed to stop and make you think—few stories that are written for the author, rather than the audience—and yet Sparkstoaflame is one of those people who will always have a story to tell. A story to share. And, she'll be absolutely fantastic at it.",
      "links": [],
      "text": "There are few stories here that are designed to stop and make you think—few stories that are written for the author, rather than the audience—and yet Sparkstoaflame is one of those people who will always have a story to tell. A story to share. And, she'll be absolutely fantastic at it."
    },
    {
      "body": "Excelsior has the title of a triumphant story, however the reality is really something else. An AU that almost isn't, the intriguing characters and the depths to their lives really push this story; coupled with an intensity that is hard to rival, this story is one of the most poetic, gorgeous pieces of art the wiki is lucky to host.",
      "links": [],
      "text": "Excelsior has the title of a triumphant story, however the reality is really something else. An AU that almost isn't, the intriguing characters and the depths to their lives really push this story; coupled with an intensity that is hard to rival, this story is one of the most poetic, gorgeous pieces of art the wiki is lucky to host."
    },
    {
      "body": "Sparkstoaflame has been praised for her excellent poetic style—her near-mastery of the style—and this story shows you just why. (read more...)",
      "links": [],
      "text": "Sparkstoaflame has been praised for her excellent poetic style—her near-mastery of the style—and this story shows you just why. (read more...)"
    },
    {
      "body": "AtkaSura has begun what promises to be one of the most creative and compelling stories on the fanon portal yet. With the strange, non-linear releases of chapters and unusual plot, this fanon will prove to be one of the most interesting when finally it's finished.",
      "links": [],
      "text": "AtkaSura has begun what promises to be one of the most creative and compelling stories on the fanon portal yet. With the strange, non-linear releases of chapters and unusual plot, this fanon will prove to be one of the most interesting when finally it's finished."
    },
    {
      "body": "The Hunt: Survivors of the Air Nomad Genocide is different to most other stories that feature the Air Nomads after the destruction of their temples. This story is not about people being happy because they survived—they are destroyed because no one else did. It offers a realistic look into the thing dubbed 'Survivor's Guilt', but also shows what honest companionship can do to help.",
      "links": [],
      "text": "The Hunt: Survivors of the Air Nomad Genocide is different to most other stories that feature the Air Nomads after the destruction of their temples. This story is not about people being happy because they survived—they are destroyed because no one else did. It offers a realistic look into the thing dubbed 'Survivor's Guilt', but also shows what honest companionship can do to help."
    },
    {
      "body": "Anyone who hasn't yet read this jumble of chapters, regardless of completion of the story, is missing out on an epic tale. (read more...)",
      "links": [],
      "text": "Anyone who hasn't yet read this jumble of chapters, regardless of completion of the story, is missing out on an epic tale. (read more...)"
    },
    {
      "body": "It's rare to find authors capable of writing an AU that deviates by only one point from canon, but LightningStrike24 is just about the best of them.",
      "links": [],
      "text": "It's rare to find authors capable of writing an AU that deviates by only one point from canon, but LightningStrike24 is just about the best of them."
    },
    {
      "body": "Fire World looks at the seemingly innocuous idea of 'what would happen if Aang died at Azula's hands?', and takes the reader on an epic journey as the aftermath of such an incident is explored. With 66 chapters planned, readers can already see just how much detail is expected to be featured in this story—one of the greatest aspects.",
      "links": [],
      "text": "Fire World looks at the seemingly innocuous idea of 'what would happen if Aang died at Azula's hands?', and takes the reader on an epic journey as the aftermath of such an incident is explored. With 66 chapters planned, readers can already see just how much detail is expected to be featured in this story—one of the greatest aspects."
    },
    {
      "body": "With four chapters released—and an author who has every intention of coming back to finish it—now is the time to take a look at this gorgeous story. (read more...)",
      "links": [],
      "text": "With four chapters released—and an author who has every intention of coming back to finish it—now is the time to take a look at this gorgeous story. (read more...)"
    },
    {
      "body": "There are few authors who focus on shipping stories on the wiki, and even fewer who write for Zutara, however Harpalyce is one of those people. The best part? She does it fantastically.",
      "links": [],
      "text": "There are few authors who focus on shipping stories on the wiki, and even fewer who write for Zutara, however Harpalyce is one of those people. The best part? She does it fantastically."
    },
    {
      "body": "Set eight years after the Hundred Year War, The Book of Primal Illusion is a thrilling tale of adventure and subterfuge, with secret societies and deadly illnesses, this story is sure to have you on the edge of your seat! Despite being discontinued, the 23 released chapters are brilliant enough to make any user groan in disappointment. And hey, if you don't like the shipping, you'll love the illustrations.",
      "links": [],
      "text": "Set eight years after the Hundred Year War, The Book of Primal Illusion is a thrilling tale of adventure and subterfuge, with secret societies and deadly illnesses, this story is sure to have you on the edge of your seat! Despite being discontinued, the 23 released chapters are brilliant enough to make any user groan in disappointment. And hey, if you don't like the shipping, you'll love the illustrations."
    },
    {
      "body": "Despite disappearing from the wiki, an anonymous source can confirm that the author is still floating out there, still writing. All that's left now is for her to come back. (read more...)",
      "links": [],
      "text": "Despite disappearing from the wiki, an anonymous source can confirm that the author is still floating out there, still writing. All that's left now is for her to come back. (read more...)"
    },
    {
      "body": "With an ever-diminishing percentage of ATLA-based fanfics on the wiki, it's lovely to see new ones still popping up. Legendgrass might be new, but don't let that stop you from taking a look at this wonderful story.",
      "links": [],
      "text": "With an ever-diminishing percentage of ATLA-based fanfics on the wiki, it's lovely to see new ones still popping up. Legendgrass might be new, but don't let that stop you from taking a look at this wonderful story."
    },
    {
      "body": "Conspiracy, set a few years after the War, intends on delving into everyday, average issues that the leaders of nations have. Things like one of their best friends being accused of plotting against him, their mother disappearing (after having only just been found, thank you very much), and assassination attempts. That's all normal, right?",
      "links": [],
      "text": "Conspiracy, set a few years after the War, intends on delving into everyday, average issues that the leaders of nations have. Things like one of their best friends being accused of plotting against him, their mother disappearing (after having only just been found, thank you very much), and assassination attempts. That's all normal, right?"
    },
    {
      "body": "With 7 chapters out of a predicted 11, this story is almost at its end, though it's worth every second spent reading. I strong encourage everyone to take a look at this story. (read more...)",
      "links": [],
      "text": "With 7 chapters out of a predicted 11, this story is almost at its end, though it's worth every second spent reading. I strong encourage everyone to take a look at this story. (read more...)"
    },
    {
      "body": "The featured fanon series this month is one of Fruipit's distinguished short series centered around characters that are based in the Avatar universe, and with the overarching theme of the \"Seven Deadly Sins\". Although the story has a handful of chapters that have been published already, not all of the sins have been represented yet, so it's clear that there are more entries to look forward to in the future!",
      "links": [],
      "text": "The featured fanon series this month is one of Fruipit's distinguished short series centered around characters that are based in the Avatar universe, and with the overarching theme of the \"Seven Deadly Sins\". Although the story has a handful of chapters that have been published already, not all of the sins have been represented yet, so it's clear that there are more entries to look forward to in the future!"
    },
    {
      "body": "Seven has captured the attention of a variety of readers on the fanon portal, and represents an always-growing genre as a collection of one-shots. Taking us below the surface level of each character and their drive and troubles, Fruipit's story allows us to get a feel for their pain and what makes them human. A recommended read for anyone looking for something new and refreshing. (read more...)",
      "links": [],
      "text": "Seven has captured the attention of a variety of readers on the fanon portal, and represents an always-growing genre as a collection of one-shots. Taking us below the surface level of each character and their drive and troubles, Fruipit's story allows us to get a feel for their pain and what makes them human. A recommended read for anyone looking for something new and refreshing. (read more...)"
    },
    {
      "body": "The first featured fanon series of 2015 is a unique, thought-provoking, and emotional story from Katherine Rebekah. Set in a modern-day alternate universe of the Avatar world, it follows Katara as she struggles with loss, depression, and a faltering faith in God. Real, modern-day religions are not a common subject of Avatar fan fiction and that element truly makes Ghosts of the Past special.",
      "links": [],
      "text": "The first featured fanon series of 2015 is a unique, thought-provoking, and emotional story from Katherine Rebekah. Set in a modern-day alternate universe of the Avatar world, it follows Katara as she struggles with loss, depression, and a faltering faith in God. Real, modern-day religions are not a common subject of Avatar fan fiction and that element truly makes Ghosts of the Past special."
    },
    {
      "body": "Read as the characters deal with their own emotions and each other after the Hundred Year War in a world known to them but not too far from our own, and learn how Katara's inner turmoil can challenge both her faith and her very identity. (read more...)",
      "links": [],
      "text": "Read as the characters deal with their own emotions and each other after the Hundred Year War in a world known to them but not too far from our own, and learn how Katara's inner turmoil can challenge both her faith and her very identity. (read more...)"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Avatar_Wiki:Featured_fanon_series",
    "file": "avatar.wikia.com/wiki/Avatar_Wiki_Featured_fanon_series.html",
    "page": "Avatar_Wiki_Featured_fanon_series",
    "title": "Avatar Wiki:Featured fanon series"
  }
}