{
  "categories": [],
  "facts": [],
  "paragraphs": [
    {
      "body": "Featured fanon articles | ${link_0} | ${link_1}",
      "links": [
        {
          "body": "Featured fanon series",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Wiki_Featured_fanon_series",
            "page": "Avatar_Wiki_Featured_fanon_series"
          }
        },
        {
          "body": "Nominate one",
          "key": "${link_1}",
          "target": {
            "href": "Avatar_Wiki_Featured_fanon_series_and_article_nominations",
            "page": "Avatar_Wiki_Featured_fanon_series_and_article_nominations"
          }
        }
      ],
      "text": "Featured fanon articles | Featured fanon series | Nominate one"
    },
    {
      "body": "Featured fanon articles on Avatar Wiki",
      "links": [],
      "text": "Featured fanon articles on Avatar Wiki"
    },
    {
      "body": "",
      "links": [],
      "text": ""
    },
    {
      "body": "Er Shi Wu--more commonly known as \"One-Eyed\" Wu because of the eye patch over his right eye--was the leader of the Ban clan, the largest clan in the Hei Chaoliu criminal organization, in the years leading up to the Earth Kingdom Civil War (1200 years before Avatar Aang). He was known for his use of violent tactics to gain control of the largest portion of the illegal dai zhiwu market in Ba Sing Se. Although Wu's clan participated in several illegal activities, it was mainly dai zhiwu distribution that earned him his money. Eventually, Wu became the richest man in Ba Sing Se, save only the Earth King himself. Not only a master of earthbending, but also of politics and manipulation, Wu created a public persona of a wealthy merchant, and even gained access to the Earth King's court. But rival Hei Chaoliu clans knew who he really was: the most dangerous criminal of the age. (read more...)",
      "links": [],
      "text": "Er Shi Wu--more commonly known as \"One-Eyed\" Wu because of the eye patch over his right eye--was the leader of the Ban clan, the largest clan in the Hei Chaoliu criminal organization, in the years leading up to the Earth Kingdom Civil War (1200 years before Avatar Aang). He was known for his use of violent tactics to gain control of the largest portion of the illegal dai zhiwu market in Ba Sing Se. Although Wu's clan participated in several illegal activities, it was mainly dai zhiwu distribution that earned him his money. Eventually, Wu became the richest man in Ba Sing Se, save only the Earth King himself. Not only a master of earthbending, but also of politics and manipulation, Wu created a public persona of a wealthy merchant, and even gained access to the Earth King's court. But rival Hei Chaoliu clans knew who he really was: the most dangerous criminal of the age. (read more...)"
    },
    {
      "body": "Lee Koisho was a fierce and feared bounty hunter from the Fire Nation. Throughout his life, Lee killed several people, utilizing weapons and corruption. Lee was malicious and cruel, due his life living alone and abandoned, and cared for no one but himself. His hunts became famous and was hired by several people; eventually, he even formed an elite team to carry out the acts, though after he was humiliated by ${link_0} and ${link_1}, they abandoned him, leaving his life in the ruts.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Lee Koisho was a fierce and feared bounty hunter from the Fire Nation. Throughout his life, Lee killed several people, utilizing weapons and corruption. Lee was malicious and cruel, due his life living alone and abandoned, and cared for no one but himself. His hunts became famous and was hired by several people; eventually, he even formed an elite team to carry out the acts, though after he was humiliated by Toph and Sokka, they abandoned him, leaving his life in the ruts."
    },
    {
      "body": "Despite this, Lee bounced up, eventually regaining his honor and title as a bounty hunter. In his final hunt, he faced Avatar Aang in ${link_0} after being hired by a seedy group called the \"Wind Killers.\" Though due to being overpowered and unfocused, he was defeated; the Wind Killers therefore had him drowned and killed. (read more...)",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "Despite this, Lee bounced up, eventually regaining his honor and title as a bounty hunter. In his final hunt, he faced Avatar Aang in Ba Sing Se after being hired by a seedy group called the \"Wind Killers.\" Though due to being overpowered and unfocused, he was defeated; the Wind Killers therefore had him drowned and killed. (read more...)"
    },
    {
      "body": "The Hei Chaoliu is a term referring to several organized crime societies which operate mainly out of Ba Sing Se and certain other areas of the Eastern Earth Kingdom. Their history dates back thousands of years, and are considered by some to be so entrenched in the day-to-day commerce of Ba Sing Se as to be an integral part of the city's economy. They have shifted and adapted over the years, but over that time their activities include or have included several forms of racketeering, drug trafficking, gambling, extortion, contract murder, money laundering, smuggling, counterfeiting and distribution of bootleg intoxicants. (read more...)",
      "links": [],
      "text": "The Hei Chaoliu is a term referring to several organized crime societies which operate mainly out of Ba Sing Se and certain other areas of the Eastern Earth Kingdom. Their history dates back thousands of years, and are considered by some to be so entrenched in the day-to-day commerce of Ba Sing Se as to be an integral part of the city's economy. They have shifted and adapted over the years, but over that time their activities include or have included several forms of racketeering, drug trafficking, gambling, extortion, contract murder, money laundering, smuggling, counterfeiting and distribution of bootleg intoxicants. (read more...)"
    },
    {
      "body": "\"Eruption\" is the fourth chapter of the Action/Suspense fanon series Avatar: Better World. It was published on June 7th, 2009, on FanFiction.net. In it, Aang and Yino finish their climactic duel in an intense and violent brawl, as Sokka and Toph scramble through the ring trying to save citizens. (read more...)",
      "links": [],
      "text": "\"Eruption\" is the fourth chapter of the Action/Suspense fanon series Avatar: Better World. It was published on June 7th, 2009, on FanFiction.net. In it, Aang and Yino finish their climactic duel in an intense and violent brawl, as Sokka and Toph scramble through the ring trying to save citizens. (read more...)"
    },
    {
      "body": "\"Battle at Kein Forest, Part 2\" is the twentieth and final chapter in the first of the three books in the fanon series, Kyoshi Revolts. Unlike most chapters, this chapter was carefully plotted out and written and contributed to by both writers of the series, with the same going for Part 1. The chapter was also awarded by being August's featured fanon article, as well as being highly praised by users from all sides of the Avatar Wiki Fanon Community. (read more...)",
      "links": [],
      "text": "\"Battle at Kein Forest, Part 2\" is the twentieth and final chapter in the first of the three books in the fanon series, Kyoshi Revolts. Unlike most chapters, this chapter was carefully plotted out and written and contributed to by both writers of the series, with the same going for Part 1. The chapter was also awarded by being August's featured fanon article, as well as being highly praised by users from all sides of the Avatar Wiki Fanon Community. (read more...)"
    },
    {
      "body": "In 100 ASC, the Earth Kingdom Rebellion declared their rebellion to the Fire Nation in a documentation on a parchment. Directed to Fire Lord Ozai, it was delivered to current Ba Sing Se deligator Brigadier Han by Takushi Sagara. In the Declaration, the rebels informed the Fire Nation that they would not allow the occupation of their country any further, and that they would oppose any and all acts on the part of the Empire. (read more...)",
      "links": [],
      "text": "In 100 ASC, the Earth Kingdom Rebellion declared their rebellion to the Fire Nation in a documentation on a parchment. Directed to Fire Lord Ozai, it was delivered to current Ba Sing Se deligator Brigadier Han by Takushi Sagara. In the Declaration, the rebels informed the Fire Nation that they would not allow the occupation of their country any further, and that they would oppose any and all acts on the part of the Empire. (read more...)"
    },
    {
      "body": "Nero was the first assassin to be sent after Team Avatar in the fanon story, Avatar: Wanted. He was a firbender who pursued his targets without mercy, being able to generate lightning and firebend his trademark black flames. At the end, it appeared Nero wasn't all that cruel, but a smart and cunning young man, having manipulated and tricked everyone, and actually having planned his whole hunt and death. He appeared a few times later in the series after his death, once during the Winter Solstice and once in the Spirit World, and had a great influence on every character later in the story. (read more...)",
      "links": [],
      "text": "Nero was the first assassin to be sent after Team Avatar in the fanon story, Avatar: Wanted. He was a firbender who pursued his targets without mercy, being able to generate lightning and firebend his trademark black flames. At the end, it appeared Nero wasn't all that cruel, but a smart and cunning young man, having manipulated and tricked everyone, and actually having planned his whole hunt and death. He appeared a few times later in the series after his death, once during the Winter Solstice and once in the Spirit World, and had a great influence on every character later in the story. (read more...)"
    },
    {
      "body": "\"Sokka's Training\" is the fourth chapter of the fanon series Avatar: Guardian. This chapter chronicles Sokka completing his training with his master, Piandao. Sokka returns to Piandao's mansion and begins learning different forms of attacking based on different jings. Sokka also makes a new sword, allowing him to continue in his battling. Before he leaves, Piandao also gives him a new sword, asking him to use it for thinking about his place in the world. (read more...)",
      "links": [],
      "text": "\"Sokka's Training\" is the fourth chapter of the fanon series Avatar: Guardian. This chapter chronicles Sokka completing his training with his master, Piandao. Sokka returns to Piandao's mansion and begins learning different forms of attacking based on different jings. Sokka also makes a new sword, allowing him to continue in his battling. Before he leaves, Piandao also gives him a new sword, asking him to use it for thinking about his place in the world. (read more...)"
    },
    {
      "body": "Ban Zhengyi was an Earthbending Avatar born approximately 955 years prior to Aang's awakening. He was the Earthbending Avatar prior to Kyoshi and the 6th Avatar prior to Aang. Zhengyi's family, the Ban, were a leading crime family in the Hei Chaoliu at the time of his birth, and afterward, when control of the Ban clan was usurped by Er Shi \"One-Eyed\" Wu. He is sometimes called \"Ba Sing Se's Avatar\" because he was born there and the most dramatic events of his career took place there. Even today, police and criminals hoping to go straight will pray to him to intercede to the spirits on their behalf. (read more...)",
      "links": [],
      "text": "Ban Zhengyi was an Earthbending Avatar born approximately 955 years prior to Aang's awakening. He was the Earthbending Avatar prior to Kyoshi and the 6th Avatar prior to Aang. Zhengyi's family, the Ban, were a leading crime family in the Hei Chaoliu at the time of his birth, and afterward, when control of the Ban clan was usurped by Er Shi \"One-Eyed\" Wu. He is sometimes called \"Ba Sing Se's Avatar\" because he was born there and the most dramatic events of his career took place there. Even today, police and criminals hoping to go straight will pray to him to intercede to the spirits on their behalf. (read more...)"
    },
    {
      "body": "The Battle of the Rebellion Bunker was a sneak attack on the Earth Kingdom Rebellion by the Fire Nation Army. Most of the time, rebellion leaders Sazuki Yuro and Mogra along with heads Takeshi Sagara and Sakire Yuna rallied rebels to escape from the burned and collapsing bunker. General Shun and his men deceitfully burned it down all through, and killed a few rebels. Casualties were heavy for to the Fire Nation, but losses on the Rebellion side were still at a number. (read more...)",
      "links": [],
      "text": "The Battle of the Rebellion Bunker was a sneak attack on the Earth Kingdom Rebellion by the Fire Nation Army. Most of the time, rebellion leaders Sazuki Yuro and Mogra along with heads Takeshi Sagara and Sakire Yuna rallied rebels to escape from the burned and collapsing bunker. General Shun and his men deceitfully burned it down all through, and killed a few rebels. Casualties were heavy for to the Fire Nation, but losses on the Rebellion side were still at a number. (read more...)"
    },
    {
      "body": "Ambush of the South Pt. Two - Counterstrike is the twentieth chapter of Avatar: Guardian. As the last chapter of Book 1, it puts an end to the Firefighters as a major threat in the Guardian continuity. It chronicles about the duels between Pakku and Mitros, and Aang and Zuko against Katas. (read more...)",
      "links": [],
      "text": "Ambush of the South Pt. Two - Counterstrike is the twentieth chapter of Avatar: Guardian. As the last chapter of Book 1, it puts an end to the Firefighters as a major threat in the Guardian continuity. It chronicles about the duels between Pakku and Mitros, and Aang and Zuko against Katas. (read more...)"
    },
    {
      "body": "\"The Greatest Earthbender\" is the ninth chapter of Avatar: The Spirit War. This chapter tells the story of Toph's travels after the end of the War. After travelling around the world and defeating many different benders, she decides that there is only one bender besides the Avatar for her to defeat. The two square off in an epic battle, shaking the very ground they stood on. (read more...)",
      "links": [],
      "text": "\"The Greatest Earthbender\" is the ninth chapter of Avatar: The Spirit War. This chapter tells the story of Toph's travels after the end of the War. After travelling around the world and defeating many different benders, she decides that there is only one bender besides the Avatar for her to defeat. The two square off in an epic battle, shaking the very ground they stood on. (read more...)"
    },
    {
      "body": "\"Operation Eternity, Part 2:Eternal Blaze\" is the 19th chapter of Book 1: Phoenix, of The Phoenix Chronicles and the Season Finale. The previous chapter left Zura thinking of a plan on how to get out of the enemy ship, Team Strike had infiltrated. Team Strike must now defeat the invading Islanders to keep peace. (read more...)",
      "links": [],
      "text": "\"Operation Eternity, Part 2:Eternal Blaze\" is the 19th chapter of Book 1: Phoenix, of The Phoenix Chronicles and the Season Finale. The previous chapter left Zura thinking of a plan on how to get out of the enemy ship, Team Strike had infiltrated. Team Strike must now defeat the invading Islanders to keep peace. (read more...)"
    },
    {
      "body": "War is Kind is the 5th chapter of Avatar: The Last Energybender the chapter shows Genesis as he travels through a war torn battlefield and sees first hand the horrors of war. (read more...)",
      "links": [],
      "text": "War is Kind is the 5th chapter of Avatar: The Last Energybender the chapter shows Genesis as he travels through a war torn battlefield and sees first hand the horrors of war. (read more...)"
    },
    {
      "body": "\"Ursa's Story\" is the 32th chapter of Avatar: Guardian, and is the 12th chapter of the second Book. This chapter deals with the new appearance of Ursa, and also where she has been in the past several years. (read more...)",
      "links": [],
      "text": "\"Ursa's Story\" is the 32th chapter of Avatar: Guardian, and is the 12th chapter of the second Book. This chapter deals with the new appearance of Ursa, and also where she has been in the past several years. (read more...)"
    },
    {
      "body": "\"The Wall, Part 3: Apollo\" is the tenth chapter of the series My Own Savior. In this chapter, Tengu witnesses the end of the ${link_0}, at the death of his beloved friend and target: Lu Ten. The emotion in this chapter is breathtaking, Itoh's reactions are flawlessly in character. The chapter is a must read. (read more...)",
      "links": [
        {
          "body": "Siege of Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Siege_of_Ba_Sing_Se",
            "page": "Siege_of_Ba_Sing_Se"
          }
        }
      ],
      "text": "\"The Wall, Part 3: Apollo\" is the tenth chapter of the series My Own Savior. In this chapter, Tengu witnesses the end of the Siege of Ba Sing Se, at the death of his beloved friend and target: Lu Ten. The emotion in this chapter is breathtaking, Itoh's reactions are flawlessly in character. The chapter is a must read. (read more...)"
    },
    {
      "body": "\"The Conspiracy Within, Part 2: Capture\" is the thirty-first chapter of the fanon series Kyoshi Revolts. The chapter acts as a follow-up to Part 1, and focuses on Mina, Kaila, Chen, Ray, and Giu's efforts to stop Mitsuki from claiming the Rebel City in the name of Azula and the Fire Nation. Matters worsen for the rebels as Yi and his army invade the weakened city, leading to a climactic battle determining the entire fate of the rebellion. (read more...)",
      "links": [],
      "text": "\"The Conspiracy Within, Part 2: Capture\" is the thirty-first chapter of the fanon series Kyoshi Revolts. The chapter acts as a follow-up to Part 1, and focuses on Mina, Kaila, Chen, Ray, and Giu's efforts to stop Mitsuki from claiming the Rebel City in the name of Azula and the Fire Nation. Matters worsen for the rebels as Yi and his army invade the weakened city, leading to a climactic battle determining the entire fate of the rebellion. (read more...)"
    },
    {
      "body": "Bathe With the Dogs is the 12th chapter of the fanon drama series Avatar: Better World, and the seventh chapter of the New Politics Chronicles. In this chapter, Aang is sent to the secluded village of Da by the ${link_0} after a war veteran and friend of the council is murdered by The Dogs. Meanwhile, Zuko seeks advice about the Council situation from Iroh. (read more...)",
      "links": [
        {
          "body": "Council of Five",
          "key": "${link_0}",
          "target": {
            "href": "Council_of_Five",
            "page": "Council_of_Five"
          }
        }
      ],
      "text": "Bathe With the Dogs is the 12th chapter of the fanon drama series Avatar: Better World, and the seventh chapter of the New Politics Chronicles. In this chapter, Aang is sent to the secluded village of Da by the Council of Five after a war veteran and friend of the council is murdered by The Dogs. Meanwhile, Zuko seeks advice about the Council situation from Iroh. (read more...)"
    },
    {
      "body": "Payback is the 12th chapter of the fourth book of Avatar: Wanted.  Written by the well-known author, Twilitlink, it follows the continuation of Gao's final fight. (read more...)",
      "links": [],
      "text": "Payback is the 12th chapter of the fourth book of Avatar: Wanted.  Written by the well-known author, Twilitlink, it follows the continuation of Gao's final fight. (read more...)"
    },
    {
      "body": "Keith is the twenty sixth chapter of the fanon series Alone. It is the sixth chapter of the second book of the series, following Leah and Sierra on their quest to help a Waterbender defend his town from Elite. Reviews for the chapter have been positive, with Evatar114 saying that the chapter was \"insanely good\" while Dragon of the West agreed. (read more...)",
      "links": [],
      "text": "Keith is the twenty sixth chapter of the fanon series Alone. It is the sixth chapter of the second book of the series, following Leah and Sierra on their quest to help a Waterbender defend his town from Elite. Reviews for the chapter have been positive, with Evatar114 saying that the chapter was \"insanely good\" while Dragon of the West agreed. (read more...)"
    },
    {
      "body": "\"The Dai Li Part 2 - Kyoshi's Revenge\" is the Book 2 finale of the fanon series Avatar: Guardian. This chapter chronicles the Dai Li's advance into Ba Sing Se as Team Avatar attempts to stop them. Eventually, a past leader of the Dai Li comes forward to stop them. Reviews for the chapter have been overwhelmingly positive, with Dragon of The West saying he was \"At a loss for words\" initially, later comparing the chapter to an action movie. Many other users have agreed, saying the chapter was \"intense\", \"an epic end to Book 2\", \"PHENOMENAL\", and much more. (read more...)",
      "links": [],
      "text": "\"The Dai Li Part 2 - Kyoshi's Revenge\" is the Book 2 finale of the fanon series Avatar: Guardian. This chapter chronicles the Dai Li's advance into Ba Sing Se as Team Avatar attempts to stop them. Eventually, a past leader of the Dai Li comes forward to stop them. Reviews for the chapter have been overwhelmingly positive, with Dragon of The West saying he was \"At a loss for words\" initially, later comparing the chapter to an action movie. Many other users have agreed, saying the chapter was \"intense\", \"an epic end to Book 2\", \"PHENOMENAL\", and much more. (read more...)"
    },
    {
      "body": "\"Timeless Security Part 2 - Future Peace\" is the fifty first chapter of Avatar: Guardian, and the eleventh chapter of its third book. It follows the struggles of Team Avatar, the new Air Nomads, and select members of the Fire Nation military to defend the Northern Air Temple from the rebelling Phoenix Warriors. The Phoenix Warriors seem to advance uninhibited until a discovery by Sokka helps finalize the temple's defense. The chapter has been hailed as \"a prime example of why The Bos is such a well-loved author in the Wiki.\" When nominated, Dragon of The West nominated both it along with its first part. Millennia2 agreed, unable to decide between the chapters. (read more...)",
      "links": [],
      "text": "\"Timeless Security Part 2 - Future Peace\" is the fifty first chapter of Avatar: Guardian, and the eleventh chapter of its third book. It follows the struggles of Team Avatar, the new Air Nomads, and select members of the Fire Nation military to defend the Northern Air Temple from the rebelling Phoenix Warriors. The Phoenix Warriors seem to advance uninhibited until a discovery by Sokka helps finalize the temple's defense. The chapter has been hailed as \"a prime example of why The Bos is such a well-loved author in the Wiki.\" When nominated, Dragon of The West nominated both it along with its first part. Millennia2 agreed, unable to decide between the chapters. (read more...)"
    },
    {
      "body": "\"Famous Monsters\" is a short side story in the Wanted Universe. It takes place during chapters 1-3 of Book 1. As the title suggests the short revolves around key characters in the Black Lotus Order.",
      "links": [],
      "text": "\"Famous Monsters\" is a short side story in the Wanted Universe. It takes place during chapters 1-3 of Book 1. As the title suggests the short revolves around key characters in the Black Lotus Order."
    },
    {
      "body": "This chapter in particular, which is the last of a three-part series, centers on my interpretation of a reunion between Lady Sa and Iroh. People have expressed a particularly strong reaction to the ending, since it is quite unconventional.",
      "links": [],
      "text": "This chapter in particular, which is the last of a three-part series, centers on my interpretation of a reunion between Lady Sa and Iroh. People have expressed a particularly strong reaction to the ending, since it is quite unconventional."
    },
    {
      "body": "A special caveat: This is not meant to be \"Wanted Canon\", although Twilitlink has been thoroughly involved in the consulting process. This is a speculative version of how things could have happened. The final say on this work's fit within the \"WantedVerse\" lies with Twilitlink. (read more...)",
      "links": [],
      "text": "A special caveat: This is not meant to be \"Wanted Canon\", although Twilitlink has been thoroughly involved in the consulting process. This is a speculative version of how things could have happened. The final say on this work's fit within the \"WantedVerse\" lies with Twilitlink. (read more...)"
    },
    {
      "body": "\"Triumph and Tragedy\" is the second chapter of the fanon series, When Air Nomads Walked the Earth. Like every other chapter, it revolves around the stories of both the Air Nomad, Syra, and Fire Nation civilian, Siro.",
      "links": [],
      "text": "\"Triumph and Tragedy\" is the second chapter of the fanon series, When Air Nomads Walked the Earth. Like every other chapter, it revolves around the stories of both the Air Nomad, Syra, and Fire Nation civilian, Siro."
    },
    {
      "body": "As the name suggests, both the main characters in this chapter encounter both pleasant surprises and disappointments. This chapter continues the storyline of the previous chapter of Syra's experience competing in the annual Airbending tournaments held at her school and of Siro's difficulties at school.",
      "links": [],
      "text": "As the name suggests, both the main characters in this chapter encounter both pleasant surprises and disappointments. This chapter continues the storyline of the previous chapter of Syra's experience competing in the annual Airbending tournaments held at her school and of Siro's difficulties at school."
    },
    {
      "body": "Although somewhat shorter than other chapters written, both previous and subsequent, I'm happy to say that reception to this one was quite positive. (read more...)",
      "links": [],
      "text": "Although somewhat shorter than other chapters written, both previous and subsequent, I'm happy to say that reception to this one was quite positive. (read more...)"
    },
    {
      "body": "\"The True Heart\" is the sixty-first, and last chapter in the highly acclaimed series Avatar: Guardian, written by The Bos. It is the fourth and final part of the series finale, \"The Capitol\".",
      "links": [],
      "text": "\"The True Heart\" is the sixty-first, and last chapter in the highly acclaimed series Avatar: Guardian, written by The Bos. It is the fourth and final part of the series finale, \"The Capitol\"."
    },
    {
      "body": "Zuko encounters Zhian for the final time, as the two decide to put an end to their struggle. Jiang attempts treason, though he is stopped by the last person on his mind.",
      "links": [],
      "text": "Zuko encounters Zhian for the final time, as the two decide to put an end to their struggle. Jiang attempts treason, though he is stopped by the last person on his mind."
    },
    {
      "body": "The success of the series and its' finale was felt by the entire community, and even sparked a tribute blog, written by long time reader and fan, Dragon of The West. The series is completed, and is available to read on Avatar Wiki. (read more...)",
      "links": [],
      "text": "The success of the series and its' finale was felt by the entire community, and even sparked a tribute blog, written by long time reader and fan, Dragon of The West. The series is completed, and is available to read on Avatar Wiki. (read more...)"
    },
    {
      "body": "\"Introduction\" is the first chapter of the new series, A Bird Could Love a Fish written by new author Theavatardemotivator. The fan fiction is a series of ${link_0} one-shots, following and further exploring the nature of the relationship between ${link_1} and ${link_2}. Interestingly, Theavatardemotivator chose not to write the series in chronological order.",
      "links": [
        {
          "body": "Kataang",
          "key": "${link_0}",
          "target": {
            "href": "Shipping",
            "page": "Shipping"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "\"Introduction\" is the first chapter of the new series, A Bird Could Love a Fish written by new author Theavatardemotivator. The fan fiction is a series of Kataang one-shots, following and further exploring the nature of the relationship between Aang and Katara. Interestingly, Theavatardemotivator chose not to write the series in chronological order."
    },
    {
      "body": "The fan fiction has become highly popular amongst fans of \"Kataang\", and general fans of ${link_0}. In its' earliest days, the series was featured in an issue of the Ba Sing Se Times, commended for, \"[creating] a beautiful spin on the romance between Aang and Katara, presenting it in the best way possible, and [Theavatardemotivator] has done a fantastic job...\" (read more...)",
      "links": [
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_0}",
          "target": {
            "href": "Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        }
      ],
      "text": "The fan fiction has become highly popular amongst fans of \"Kataang\", and general fans of Avatar: The Last Airbender. In its' earliest days, the series was featured in an issue of the Ba Sing Se Times, commended for, \"[creating] a beautiful spin on the romance between Aang and Katara, presenting it in the best way possible, and [Theavatardemotivator] has done a fantastic job...\" (read more...)"
    },
    {
      "body": "\"Interlude: Cixi Alone\" is a shorter chapter of Sozin's Blood taking place between chapters 7 and 8 focusing on the character Cixi. French Froglegs shows us a look at Iroh's love interest and give a deeper look into the life of one of the supporting characters. It makes a great addition to French Froglegs tragic tale following Iroh's life and eventually Ozai's life.",
      "links": [],
      "text": "\"Interlude: Cixi Alone\" is a shorter chapter of Sozin's Blood taking place between chapters 7 and 8 focusing on the character Cixi. French Froglegs shows us a look at Iroh's love interest and give a deeper look into the life of one of the supporting characters. It makes a great addition to French Froglegs tragic tale following Iroh's life and eventually Ozai's life."
    },
    {
      "body": "This fanon has garnered great popularity, having previously been featured itself. So far it is said to be a very entertaining and well thought out look into Iroh's early years and shows great promise in the future. (read more...)",
      "links": [],
      "text": "This fanon has garnered great popularity, having previously been featured itself. So far it is said to be a very entertaining and well thought out look into Iroh's early years and shows great promise in the future. (read more...)"
    },
    {
      "body": "\"Twin Towers, Part 3: The Burden of Atlas\" is the final chapter of the second book of the fanon story Alone. Millennia2 shows us the emotions of his characters as powerful as the very atmosphere of tension and strife, all bound together with a slim undercurrent of hope and drowned in waves of tragedy and sacrifice.",
      "links": [],
      "text": "\"Twin Towers, Part 3: The Burden of Atlas\" is the final chapter of the second book of the fanon story Alone. Millennia2 shows us the emotions of his characters as powerful as the very atmosphere of tension and strife, all bound together with a slim undercurrent of hope and drowned in waves of tragedy and sacrifice."
    },
    {
      "body": "This fanon, which has already been featured, continues to delight its audience and espouses a unique perspective among Avatar fanons. It depicts the tale of Leah Sanchez, an Avatar in our world standing up for the freedom of benders. (read more...)",
      "links": [],
      "text": "This fanon, which has already been featured, continues to delight its audience and espouses a unique perspective among Avatar fanons. It depicts the tale of Leah Sanchez, an Avatar in our world standing up for the freedom of benders. (read more...)"
    },
    {
      "body": "\"It All Comes Together\" is the final chapter of Katara and Aang in the series Engagements. By PSUAvatar14. Taking place four years after the end of ${link_0}, it shows us how \"Kataang\" evolved from the relationship we saw in the show to further romance and marriage.",
      "links": [
        {
          "body": "the War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "\"It All Comes Together\" is the final chapter of Katara and Aang in the series Engagements. By PSUAvatar14. Taking place four years after the end of the War, it shows us how \"Kataang\" evolved from the relationship we saw in the show to further romance and marriage."
    },
    {
      "body": "This chapter fits right in with the other chapters of Engagements as well as the rest of PSUAvatar14's fanons. The descriptions of emotions typical of a romance fanon are prevalent and portrayed in beautiful detail. Aang proposes in a most creative way and just like the title says, it all comes together. (read more...)",
      "links": [],
      "text": "This chapter fits right in with the other chapters of Engagements as well as the rest of PSUAvatar14's fanons. The descriptions of emotions typical of a romance fanon are prevalent and portrayed in beautiful detail. Aang proposes in a most creative way and just like the title says, it all comes together. (read more...)"
    },
    {
      "body": "\"The Winds of Destruction: Part 2\" is the final chapter of The Air Saga, the second book in BlackMonkey's fanon The Avatar Rhythm.  It takes place at the Western Air Temple where the protagonist Shirou and his companion Shinji have come for their own reasons: Shirou to kill the Avatar and Shinji to escape the Quadrination Bandits, a group of benders from all four nations hunting him down because of his family's curse.",
      "links": [],
      "text": "\"The Winds of Destruction: Part 2\" is the final chapter of The Air Saga, the second book in BlackMonkey's fanon The Avatar Rhythm.  It takes place at the Western Air Temple where the protagonist Shirou and his companion Shinji have come for their own reasons: Shirou to kill the Avatar and Shinji to escape the Quadrination Bandits, a group of benders from all four nations hunting him down because of his family's curse."
    },
    {
      "body": "This makes for a good conclusion to the Air Saga with lots of action, character development, uncertainty and multi-sided conflict.  The author continues to dazzle us all with his complex characters and remarkable story-crafting.  The end of the second book will leave you satisfied with the outcome and also yearning for what is to come in The Water Saga. (read more...)",
      "links": [],
      "text": "This makes for a good conclusion to the Air Saga with lots of action, character development, uncertainty and multi-sided conflict.  The author continues to dazzle us all with his complex characters and remarkable story-crafting.  The end of the second book will leave you satisfied with the outcome and also yearning for what is to come in The Water Saga. (read more...)"
    },
    {
      "body": "\"The Stars\" is the third chapter of The Water Saga, the third book in BlackMonkey's popular fanon The Avatar Rhythm.  It takes place in the Northern Water Tribe as Shirou revisits his old home with his companion Shinji.  In the chapters preceding this, Shirou has gone through some difficult trials in his journey.  Now that he is close to his roots, he is able to reflect on what he has done and rediscover his reasons for taking his journey.",
      "links": [],
      "text": "\"The Stars\" is the third chapter of The Water Saga, the third book in BlackMonkey's popular fanon The Avatar Rhythm.  It takes place in the Northern Water Tribe as Shirou revisits his old home with his companion Shinji.  In the chapters preceding this, Shirou has gone through some difficult trials in his journey.  Now that he is close to his roots, he is able to reflect on what he has done and rediscover his reasons for taking his journey."
    },
    {
      "body": "As an “in-between” chapter, this is especially well-written and well-crafted to keep the reader interested in learning more about the main character as he learns about himself.  It reminds us that Shirou has come so far in his quest and yet has so far to go.  This chapter is a recommended read for anyone who appreciates character depth and development and likes new adventures with new characters. (read more...)",
      "links": [],
      "text": "As an “in-between” chapter, this is especially well-written and well-crafted to keep the reader interested in learning more about the main character as he learns about himself.  It reminds us that Shirou has come so far in his quest and yet has so far to go.  This chapter is a recommended read for anyone who appreciates character depth and development and likes new adventures with new characters. (read more...)"
    },
    {
      "body": "\"Fugitive Part 2\" is the sixth chapter of The Bos’s all-new fanon series Mysteries of My Past.  The Earth Kingdom soldier Shenji, who is the protagonist of the adventure, must escape from his supposedly inescapable prison in the Fire Nation Army camp, where he is trapped with fellow prisonmates Gahn and Kuan.  Meanwhile Shenji’s faithful friend Kuro tries to bust him out from the outside.",
      "links": [],
      "text": "\"Fugitive Part 2\" is the sixth chapter of The Bos’s all-new fanon series Mysteries of My Past.  The Earth Kingdom soldier Shenji, who is the protagonist of the adventure, must escape from his supposedly inescapable prison in the Fire Nation Army camp, where he is trapped with fellow prisonmates Gahn and Kuan.  Meanwhile Shenji’s faithful friend Kuro tries to bust him out from the outside."
    },
    {
      "body": "This chapter, which is written by one of the seasoned veterans of the fanon portal, takes the characters’ paths in new directions and gives the reader the action, intensity and conflict that keeps the reader wanting more when they finish.  New sides to the characters are seen and new things about them are revealed.  Fugitive Part 2 is an enjoyable read for anyone who appreciates creative stories and likes epic adventures that show the “darker” side of the Avatar universe. (read more...)",
      "links": [],
      "text": "This chapter, which is written by one of the seasoned veterans of the fanon portal, takes the characters’ paths in new directions and gives the reader the action, intensity and conflict that keeps the reader wanting more when they finish.  New sides to the characters are seen and new things about them are revealed.  Fugitive Part 2 is an enjoyable read for anyone who appreciates creative stories and likes epic adventures that show the “darker” side of the Avatar universe. (read more...)"
    },
    {
      "body": "Rokan is the title character and heroine of Firebender896's promising and popular fanon, Avatar: The Legend of Rokan. Growing up in the Fire Nation, Rokan has an unorthodox journey ahead of her as she has many adventures and rediscovers herself through creative twists and character development.",
      "links": [],
      "text": "Rokan is the title character and heroine of Firebender896's promising and popular fanon, Avatar: The Legend of Rokan. Growing up in the Fire Nation, Rokan has an unorthodox journey ahead of her as she has many adventures and rediscovers herself through creative twists and character development."
    },
    {
      "body": "As the reader gets to know her, it becomes obvious that Firebender896 has put a lot of thought into making her character. The impulsive side of her personality is part of what makes her an extraordinary character in an extraordinary fanon. Ultimately, it is Rokan herself that makes Avatar: The Legend of Rokan such an intriguing story. (read more...)",
      "links": [],
      "text": "As the reader gets to know her, it becomes obvious that Firebender896 has put a lot of thought into making her character. The impulsive side of her personality is part of what makes her an extraordinary character in an extraordinary fanon. Ultimately, it is Rokan herself that makes Avatar: The Legend of Rokan such an intriguing story. (read more...)"
    },
    {
      "body": "\"The Last Hope, Part 2\" is the second part of the finale of Around the World (Again), by Aang20791. This chapter chronicles Team Avatar taking on the enemies that have followed them on their trek around the world one year after the War.",
      "links": [],
      "text": "\"The Last Hope, Part 2\" is the second part of the finale of Around the World (Again), by Aang20791. This chapter chronicles Team Avatar taking on the enemies that have followed them on their trek around the world one year after the War."
    },
    {
      "body": "This chapter contains a very suspenseful battle as Team Avatar battles Long Feng and the Dai Li, along with an enemy they never expected. The reader can expect to be kept on the edge of their seat as the battle goes through several ups and downs and tense moments leading up to its conclusion. (read more...)",
      "links": [],
      "text": "This chapter contains a very suspenseful battle as Team Avatar battles Long Feng and the Dai Li, along with an enemy they never expected. The reader can expect to be kept on the edge of their seat as the battle goes through several ups and downs and tense moments leading up to its conclusion. (read more...)"
    },
    {
      "body": "Cave of the Ancients, Part 2 is the second part of a revealing chapter in \"Avatar: Energy Saga\", by AvatarRokusGhost. This chapter shows Aang discovering new things about his past lives and finding new spiritual forces at work inside this mysterious location that holds a significant part of the distant past. As Aang learns energybending in order to bring back the Air Nomads from extinction, he learns that things are not always as they seem.",
      "links": [],
      "text": "Cave of the Ancients, Part 2 is the second part of a revealing chapter in \"Avatar: Energy Saga\", by AvatarRokusGhost. This chapter shows Aang discovering new things about his past lives and finding new spiritual forces at work inside this mysterious location that holds a significant part of the distant past. As Aang learns energybending in order to bring back the Air Nomads from extinction, he learns that things are not always as they seem."
    },
    {
      "body": "This chapter was very well received by its readers. The plot twists were many and unexpected at every turn. As Team Avatar marvels at the wonder around them, a potentially deadly enemy follows them on their journey, posing a looming threat. From this chapter the reader can expect a lot of good surprises that broaden things and tie things together at the same time. Ultimately, it foreshadows a lot of what is to come later in Energy Saga. (read more...)",
      "links": [],
      "text": "This chapter was very well received by its readers. The plot twists were many and unexpected at every turn. As Team Avatar marvels at the wonder around them, a potentially deadly enemy follows them on their journey, posing a looming threat. From this chapter the reader can expect a lot of good surprises that broaden things and tie things together at the same time. Ultimately, it foreshadows a lot of what is to come later in Energy Saga. (read more...)"
    },
    {
      "body": "The Final Showdown, Part 2 is the second part of the series finale for The Weatherbenders, by acclaimed fanon writer KataraFanboy. The Final Showdown, Part 2 takes the reader into an action-packed world of plot twists and fast-paced combat as the \"Tri-National Showdown\" occurs, with members of Team Avatar - equipped with weatherbending training - doing battle with the Meteorologists, who want to use the lost art to take over the world. The chapter takes place in the Fire Nation, the Southern Water Tribe and the Earth Kingdom.",
      "links": [],
      "text": "The Final Showdown, Part 2 is the second part of the series finale for The Weatherbenders, by acclaimed fanon writer KataraFanboy. The Final Showdown, Part 2 takes the reader into an action-packed world of plot twists and fast-paced combat as the \"Tri-National Showdown\" occurs, with members of Team Avatar - equipped with weatherbending training - doing battle with the Meteorologists, who want to use the lost art to take over the world. The chapter takes place in the Fire Nation, the Southern Water Tribe and the Earth Kingdom."
    },
    {
      "body": "KataraFanboy revitalizes the personalities and abilities of Team Avatar from Avatar: The Last Airbender, including their strengths, and their weaknesses. This finale chapter also has great character fulfillment from Reeaki, an original character. Reeaki is a real-world crossover who learned of weatherbending and its capabilities, bringing with him an understanding perspective from the \"real world.\" Courageous struggle and inner turmoil, supplemented by high-quality writing, make this chapter deserving of featured fanon article for the month. (read more...)",
      "links": [],
      "text": "KataraFanboy revitalizes the personalities and abilities of Team Avatar from Avatar: The Last Airbender, including their strengths, and their weaknesses. This finale chapter also has great character fulfillment from Reeaki, an original character. Reeaki is a real-world crossover who learned of weatherbending and its capabilities, bringing with him an understanding perspective from the \"real world.\" Courageous struggle and inner turmoil, supplemented by high-quality writing, make this chapter deserving of featured fanon article for the month. (read more...)"
    },
    {
      "body": "A Promise Kept is a one-shot fanon by Firebender896, who has become well-known around the wiki for her fanon writing as well as her illustrating, serving as artist for her own work and also for a handful of stories by other authors.  This particular story paints an interesting and emotional characterization of the relationship between Sokka and Katara in the heat of battle against an unknown enemy.  With plenty of action, the performance of the characters says just as much as the words themselves.",
      "links": [],
      "text": "A Promise Kept is a one-shot fanon by Firebender896, who has become well-known around the wiki for her fanon writing as well as her illustrating, serving as artist for her own work and also for a handful of stories by other authors.  This particular story paints an interesting and emotional characterization of the relationship between Sokka and Katara in the heat of battle against an unknown enemy.  With plenty of action, the performance of the characters says just as much as the words themselves."
    },
    {
      "body": "The readers who come across this story find themselves touched by the emotional string in the heat of the moment.  A powerful piece like A Promise Kept should not be overlooked by anyone who comes to the fanon portal looking for a new, original and captivating story that will stay ringing in their minds long after they’ve finished reading it. (read more...)",
      "links": [],
      "text": "The readers who come across this story find themselves touched by the emotional string in the heat of the moment.  A powerful piece like A Promise Kept should not be overlooked by anyone who comes to the fanon portal looking for a new, original and captivating story that will stay ringing in their minds long after they’ve finished reading it. (read more...)"
    },
    {
      "body": "My Last Breath is a one-shot fanon by the fanon author Vulmen, who has already been featured for his award-winning Eyes of Katara.  My Last Breath is the touching, emotional story of Aang’s death at the South Pole, after many years of happy marriage to Katara.  The deathbed scene, family reunion and funeral tie Katara’s emotions, which are the focal point of most of the story, with those of Aang and others close to him.  By the end of this piece, the readers may very well include themselves in that.",
      "links": [],
      "text": "My Last Breath is a one-shot fanon by the fanon author Vulmen, who has already been featured for his award-winning Eyes of Katara.  My Last Breath is the touching, emotional story of Aang’s death at the South Pole, after many years of happy marriage to Katara.  The deathbed scene, family reunion and funeral tie Katara’s emotions, which are the focal point of most of the story, with those of Aang and others close to him.  By the end of this piece, the readers may very well include themselves in that."
    },
    {
      "body": "This story has drawn universal acclaim from a diverse group of readers who normally prefer different kinds of stories.  In short, this means that it can appeal to everyone in the same, powerful way and that anyone who reads Avatar fanons should not pass this one up.  Even if one is not in the habit of reading Avatar fan fiction, this would be worth their time to immerse themselves in.  It’s one that once reading, one will surely not forget. (read more...)",
      "links": [],
      "text": "This story has drawn universal acclaim from a diverse group of readers who normally prefer different kinds of stories.  In short, this means that it can appeal to everyone in the same, powerful way and that anyone who reads Avatar fanons should not pass this one up.  Even if one is not in the habit of reading Avatar fan fiction, this would be worth their time to immerse themselves in.  It’s one that once reading, one will surely not forget. (read more...)"
    },
    {
      "body": "Horizon Part 2: Farewell is the final action packed chapter in Part 1 of BlueDagger's Dancing Shadows, a story that tells the tale of two growing assassins in Ba Sing Se and their story of eventually becoming a major influence in The War and shady organizations that lurk the lands. BlueDagger is known for his incredible action writing that is put in full use in this story, where in every chapter there are battles, murders, or streetfights.",
      "links": [],
      "text": "Horizon Part 2: Farewell is the final action packed chapter in Part 1 of BlueDagger's Dancing Shadows, a story that tells the tale of two growing assassins in Ba Sing Se and their story of eventually becoming a major influence in The War and shady organizations that lurk the lands. BlueDagger is known for his incredible action writing that is put in full use in this story, where in every chapter there are battles, murders, or streetfights."
    },
    {
      "body": "In the finale of Part 1, the main characters Feng, Wei, and Nekku escape the walls of Ba Sing Se from the Dai Li and the mysterious organization known as The Shroud, who call Feng the \"Shadowborn\". On their way out, they are attacked by one of The Shroud, and after an intense flashback, we learn why. The chapter is also praised for its insanely tragic orphanage scene, which may just be the darkest thing in the whole fanon portal. As a whole, this literally packed with action chapter leaves us both satisfied and hanging for Part 2 of Dancing Shadows. (read more...)",
      "links": [],
      "text": "In the finale of Part 1, the main characters Feng, Wei, and Nekku escape the walls of Ba Sing Se from the Dai Li and the mysterious organization known as The Shroud, who call Feng the \"Shadowborn\". On their way out, they are attacked by one of The Shroud, and after an intense flashback, we learn why. The chapter is also praised for its insanely tragic orphanage scene, which may just be the darkest thing in the whole fanon portal. As a whole, this literally packed with action chapter leaves us both satisfied and hanging for Part 2 of Dancing Shadows. (read more...)"
    },
    {
      "body": "Prologue: Birth of a Woodbender is the beginning of Henryjh98's adventure series, Avatar: The Sole Woodbender. It starts off the tale of the only woodbender on Earth and his story in the beginning of Avatar Era. In this chapter, an unknown woman with a child runs through the forest while being attacked by firebenders. The prologue also introduces the origins of woodbending and its power source, the Great Tsuri.",
      "links": [],
      "text": "Prologue: Birth of a Woodbender is the beginning of Henryjh98's adventure series, Avatar: The Sole Woodbender. It starts off the tale of the only woodbender on Earth and his story in the beginning of Avatar Era. In this chapter, an unknown woman with a child runs through the forest while being attacked by firebenders. The prologue also introduces the origins of woodbending and its power source, the Great Tsuri."
    },
    {
      "body": "Henryjh98 is a well-known and successful new writer, having already won a number of awards on the wiki. He never fails to keep things exciting with his numerous action scenes. The author leads his viewers with his amazingly-written chapters and sets the stage for his new story well. There's a definite reason that this was chosen as featured fanon article for September, and the several readers this series has gained in the time since it was posted on here have been pleased with the content that they have seen. (read more...)",
      "links": [],
      "text": "Henryjh98 is a well-known and successful new writer, having already won a number of awards on the wiki. He never fails to keep things exciting with his numerous action scenes. The author leads his viewers with his amazingly-written chapters and sets the stage for his new story well. There's a definite reason that this was chosen as featured fanon article for September, and the several readers this series has gained in the time since it was posted on here have been pleased with the content that they have seen. (read more...)"
    },
    {
      "body": "Chapter 1: The Mountain Master's Son is the whirlwind introduction to Manzai's fanon, Avatar: The Heir of Ban. The world in which this story takes place focuses on Zhengi, a conflicted young man who must choose between his role as the Avatar and as the heir of the most ruthless criminal in Ba Sing Se. In this chapter, he experiences his first trial when his identity as the master of all four elements is revealed.",
      "links": [],
      "text": "Chapter 1: The Mountain Master's Son is the whirlwind introduction to Manzai's fanon, Avatar: The Heir of Ban. The world in which this story takes place focuses on Zhengi, a conflicted young man who must choose between his role as the Avatar and as the heir of the most ruthless criminal in Ba Sing Se. In this chapter, he experiences his first trial when his identity as the master of all four elements is revealed."
    },
    {
      "body": "Manzai has accomplished a rare feat for fanons, detailing a vivid battle from the very beginning while staying true to the flow of the story. What the characters treat as a simple sparring match springs to life before readers with its breathtaking details. The author presents this in the midst of the deep, treacherous schemes interwoven into his plot, which shows off his remarkable ability to craft an exciting, yet intricate tale for all to enjoy. (read more...)",
      "links": [],
      "text": "Manzai has accomplished a rare feat for fanons, detailing a vivid battle from the very beginning while staying true to the flow of the story. What the characters treat as a simple sparring match springs to life before readers with its breathtaking details. The author presents this in the midst of the deep, treacherous schemes interwoven into his plot, which shows off his remarkable ability to craft an exciting, yet intricate tale for all to enjoy. (read more...)"
    },
    {
      "body": "Heartless is one of the one-shots fanon series written by Humble Imaginations. Taking place during \"Endgame\", it has drawn some of the most support and praise of any one-shot chapter of Helping One Another so far. It really touches upon the characters' actions and feelings in a way that the reader can feel captivated by.",
      "links": [],
      "text": "Heartless is one of the one-shots fanon series written by Humble Imaginations. Taking place during \"Endgame\", it has drawn some of the most support and praise of any one-shot chapter of Helping One Another so far. It really touches upon the characters' actions and feelings in a way that the reader can feel captivated by."
    },
    {
      "body": "With Iroh, Asami and Hiroshi captured in-character, this was a delightful addition to an already well-thought of fanon series. It's a recommended read for anyone coming to the Avatar Wiki Fanon Portal looking for a good dosage of flavorful Korra-related work. (read more...)",
      "links": [],
      "text": "With Iroh, Asami and Hiroshi captured in-character, this was a delightful addition to an already well-thought of fanon series. It's a recommended read for anyone coming to the Avatar Wiki Fanon Portal looking for a good dosage of flavorful Korra-related work. (read more...)"
    },
    {
      "body": "'Deck the Halls! is a comedy one-shot written by Omashu Rocks, following Team Avatar as they celebrate Christmas. Despite being full of comedy and pop culture references, it is amazingly well-written, understandable, and very unique; just a few of the reasons it was nominated to be the featured fanon article. This author demonstrates a very high level of writing, by maintaining that delicate balance between quality and tear-inducing laughter. If you can't wait to read it, what's stopping you? Just make sure that no one's around when you do, lest they question your well-being because of your suffocating, uncontrollable laughing! (read more...)",
      "links": [],
      "text": "'Deck the Halls! is a comedy one-shot written by Omashu Rocks, following Team Avatar as they celebrate Christmas. Despite being full of comedy and pop culture references, it is amazingly well-written, understandable, and very unique; just a few of the reasons it was nominated to be the featured fanon article. This author demonstrates a very high level of writing, by maintaining that delicate balance between quality and tear-inducing laughter. If you can't wait to read it, what's stopping you? Just make sure that no one's around when you do, lest they question your well-being because of your suffocating, uncontrollable laughing! (read more...)"
    },
    {
      "body": "Peasant Meets Royalty is one of the first ten chapters of Silent Hero in Emerald, written by the successful author, Minnichi. Chronicles about tales of the secret and elite police force of Ba Sing Se, the chapter contains romance, angst, and adventure. It tells about Riya, a peasant girl from Lower Ring of Ba Sing Se who goes to the Upper Ring to meet her old friend and love-interest, Yuhan. But the Dai Li headquarters is infiltrated by the Avatar's group after Jet regains his memories. Yuhan feels ashamed that he'd avoided brainwashing him since he might've had a better chance at creating a stronger memory block than Hiroshu. The agents lose badly to Team Avatar, and Yuhan stays behind to convert Jet's remaining friends. (read more...)",
      "links": [],
      "text": "Peasant Meets Royalty is one of the first ten chapters of Silent Hero in Emerald, written by the successful author, Minnichi. Chronicles about tales of the secret and elite police force of Ba Sing Se, the chapter contains romance, angst, and adventure. It tells about Riya, a peasant girl from Lower Ring of Ba Sing Se who goes to the Upper Ring to meet her old friend and love-interest, Yuhan. But the Dai Li headquarters is infiltrated by the Avatar's group after Jet regains his memories. Yuhan feels ashamed that he'd avoided brainwashing him since he might've had a better chance at creating a stronger memory block than Hiroshu. The agents lose badly to Team Avatar, and Yuhan stays behind to convert Jet's remaining friends. (read more...)"
    },
    {
      "body": "Colours is a masterpiece written by an amazing author, Fruipit. Fruipit is nothing more than a regular user but she has the miracle to write awesome stories. Famously-known as one-shot writer, Fruipit has her own style with her Learning series. Her \"Learning\" chapters hold a strong words and meaningful, written in-depth with Toph and Aang as her favorite characters to write. Colours follows Aang and Toph as the former tries to explain the concept of colors to Toph, who just happens to be blind. Now picture the color green in your mind. Now picture the same thing with only feelings. No other things to use as reference. Now try. Hard right? But Fruipit did it right. So if your ever looking for a Taang fanon, seek no further. It's right here!\n(read more...)",
      "links": [],
      "text": "Colours is a masterpiece written by an amazing author, Fruipit. Fruipit is nothing more than a regular user but she has the miracle to write awesome stories. Famously-known as one-shot writer, Fruipit has her own style with her Learning series. Her \"Learning\" chapters hold a strong words and meaningful, written in-depth with Toph and Aang as her favorite characters to write. Colours follows Aang and Toph as the former tries to explain the concept of colors to Toph, who just happens to be blind. Now picture the color green in your mind. Now picture the same thing with only feelings. No other things to use as reference. Now try. Hard right? But Fruipit did it right. So if your ever looking for a Taang fanon, seek no further. It's right here!\n(read more...)"
    },
    {
      "body": "Tension is the prologue of Moon Drops, a shining new story on the fanon portal. Meg Lindsey has set the tone for a twisted love story with only the first few sentences of her introductory chapter.",
      "links": [],
      "text": "Tension is the prologue of Moon Drops, a shining new story on the fanon portal. Meg Lindsey has set the tone for a twisted love story with only the first few sentences of her introductory chapter."
    },
    {
      "body": "Bouncing between two timelines that are set twenty years apart, the author has managed to give her readers a glimpse of a controversial future for Korra's children and has contrasted it to Korra's own conflict: an uncomfortable situation regarding feuding Water Tribes, an unexpected suitor, and a marriage decision she can't retract. (read more...)",
      "links": [],
      "text": "Bouncing between two timelines that are set twenty years apart, the author has managed to give her readers a glimpse of a controversial future for Korra's children and has contrasted it to Korra's own conflict: an uncomfortable situation regarding feuding Water Tribes, an unexpected suitor, and a marriage decision she can't retract. (read more...)"
    },
    {
      "body": "Cake is the first chapter of the poetic masterpiece, Scarf, the newest project from esteemed writer, Theavatardemotivator.",
      "links": [],
      "text": "Cake is the first chapter of the poetic masterpiece, Scarf, the newest project from esteemed writer, Theavatardemotivator."
    },
    {
      "body": "Beginning on the birthday of the now six-year-old Bolin, the chapter sets the pace for the dramatic background story of the bending brothers, starting with the loss of their parents. Through imaginative and flowing language, Theavatardemotivator manages to submerge the reader in the whirlpool of emotions that young children feel when confronted with loss. \"Cake\" is overflowing with heavy emotions, though TAD's brilliant writing style combines it masterfully with lighter scenes. With several metaphors, \"Cake\" paints a unique picture, showing rather than telling the readers from Mako's point of view of how two young benders manage to survive in a cold world as the only stability in their lives is taken, forcing them to fight in order to remain together.",
      "links": [],
      "text": "Beginning on the birthday of the now six-year-old Bolin, the chapter sets the pace for the dramatic background story of the bending brothers, starting with the loss of their parents. Through imaginative and flowing language, Theavatardemotivator manages to submerge the reader in the whirlpool of emotions that young children feel when confronted with loss. \"Cake\" is overflowing with heavy emotions, though TAD's brilliant writing style combines it masterfully with lighter scenes. With several metaphors, \"Cake\" paints a unique picture, showing rather than telling the readers from Mako's point of view of how two young benders manage to survive in a cold world as the only stability in their lives is taken, forcing them to fight in order to remain together."
    },
    {
      "body": "The excellent writing style and deep emotions make this a must read for any lover of literature. (read more...)",
      "links": [],
      "text": "The excellent writing style and deep emotions make this a must read for any lover of literature. (read more...)"
    },
    {
      "body": "Avatar Rong Yan is the main protagonist of Avatar: The Legacy of Rong Yan, the masterpiece of a hardworking author, King Bumis Heir.  Play the role as the successor of Avatar Ku Tei and preceding before Avatar Yangchen, Rong Yan has to keep his fate as the Avatar to keep the world in balance.  The Fire Nation-born Avatar was born in a small village, began his struggle as the only person in the world that has to master the four elements and protect the whole world – when he was not ready yet.",
      "links": [],
      "text": "Avatar Rong Yan is the main protagonist of Avatar: The Legacy of Rong Yan, the masterpiece of a hardworking author, King Bumis Heir.  Play the role as the successor of Avatar Ku Tei and preceding before Avatar Yangchen, Rong Yan has to keep his fate as the Avatar to keep the world in balance.  The Fire Nation-born Avatar was born in a small village, began his struggle as the only person in the world that has to master the four elements and protect the whole world – when he was not ready yet."
    },
    {
      "body": "The author of the amazing story, King Bumis Heir put all of his effort to create his own \"encyclopedia\" of the said story with no exaggeration, while no one seems care of the extraordinary style of writing.  In the whole Fanon Portal, there are only less than hundreds saga and serial that have such detailed character pages, and Avatar: The Legacy of Rong Yan is the one.",
      "links": [],
      "text": "The author of the amazing story, King Bumis Heir put all of his effort to create his own \"encyclopedia\" of the said story with no exaggeration, while no one seems care of the extraordinary style of writing.  In the whole Fanon Portal, there are only less than hundreds saga and serial that have such detailed character pages, and Avatar: The Legacy of Rong Yan is the one."
    },
    {
      "body": "The massive and solid writing and detailed information make this article is one of the best in the Fanon Portal. (read more...)",
      "links": [],
      "text": "The massive and solid writing and detailed information make this article is one of the best in the Fanon Portal. (read more...)"
    },
    {
      "body": "Horoscopes is a short one-shot written by the dedicated  author, Originalavatarnerdling, which takes a humorous look into the lives of the adult Team Avatar.",
      "links": [],
      "text": "Horoscopes is a short one-shot written by the dedicated  author, Originalavatarnerdling, which takes a humorous look into the lives of the adult Team Avatar."
    },
    {
      "body": "When Aang mysteriously receives a letter from Aunt Wu, coupled with a brand new prediction technique she has devised, Katara becomes a little too invested in them. For reasons unknown, she is desperate to disprove it, providing a hilarious short story about living up to people's expectations",
      "links": [],
      "text": "When Aang mysteriously receives a letter from Aunt Wu, coupled with a brand new prediction technique she has devised, Katara becomes a little too invested in them. For reasons unknown, she is desperate to disprove it, providing a hilarious short story about living up to people's expectations"
    },
    {
      "body": "One of the more hilarious shorts available, OAN once again proves her talent as an author. Anyone looking for a more mellow story  should definitely give this one a look! (read more...)",
      "links": [],
      "text": "One of the more hilarious shorts available, OAN once again proves her talent as an author. Anyone looking for a more mellow story  should definitely give this one a look! (read more...)"
    },
    {
      "body": "A Minute is a gorgeous one-shot, written by the esteemed author and admin, Lady Lostris. This short story shows just how versatile Lady Lostris is, and gives an  entirely new meaning to the word 'romance'.",
      "links": [],
      "text": "A Minute is a gorgeous one-shot, written by the esteemed author and admin, Lady Lostris. This short story shows just how versatile Lady Lostris is, and gives an  entirely new meaning to the word 'romance'."
    },
    {
      "body": "A fanon take on the finale of Book One, A Minute invokes such emotion that it's hard to believe it isn't canon. This sweet story follows Asami as Korra, as locked in their own battles, it's only the thought of being reunited with each other once again.",
      "links": [],
      "text": "A fanon take on the finale of Book One, A Minute invokes such emotion that it's hard to believe it isn't canon. This sweet story follows Asami as Korra, as locked in their own battles, it's only the thought of being reunited with each other once again."
    },
    {
      "body": "\"We're not doing this. We're not doing anything 'just in case'. All I want to hear from you now is a promise that you'll come back to me safely.\" (read more...)",
      "links": [],
      "text": "\"We're not doing this. We're not doing anything 'just in case'. All I want to hear from you now is a promise that you'll come back to me safely.\" (read more...)"
    },
    {
      "body": "Some chapters make you laugh so hard you can no longer focus on the words. Others make you think about the world, and what you can do to change it for the better. Chapter Thirteen of Typhoonmaster's amazing fanon, Nirvana, does none of these. No, it makes you want to curl up into a little ball and weep for a few hours. Once you think you're done crying, you'll remember this chapter and want to cry all over again.",
      "links": [],
      "text": "Some chapters make you laugh so hard you can no longer focus on the words. Others make you think about the world, and what you can do to change it for the better. Chapter Thirteen of Typhoonmaster's amazing fanon, Nirvana, does none of these. No, it makes you want to curl up into a little ball and weep for a few hours. Once you think you're done crying, you'll remember this chapter and want to cry all over again."
    },
    {
      "body": "The entire story, it seems, was building up to this moment. Ty has a wonderful, if not slightly sadistic skill, of making you absolutely fall in love with his world before wrenching it away. It's not just the characters you love; it's the setting and animals. It's the beautiful imagery and the way he can draw out emotions you didn't even realize you had. And then he manages to completely turn it on its head and destroy it right before your very eyes. He has pulled a 'Chapter Thirteen', and there's nothing you can do about it.",
      "links": [],
      "text": "The entire story, it seems, was building up to this moment. Ty has a wonderful, if not slightly sadistic skill, of making you absolutely fall in love with his world before wrenching it away. It's not just the characters you love; it's the setting and animals. It's the beautiful imagery and the way he can draw out emotions you didn't even realize you had. And then he manages to completely turn it on its head and destroy it right before your very eyes. He has pulled a 'Chapter Thirteen', and there's nothing you can do about it."
    },
    {
      "body": "If you haven't already read this story, do it. You will regret not reading it just as much as you will regret it by reading it. Ty is.... he's just that good. read more...",
      "links": [],
      "text": "If you haven't already read this story, do it. You will regret not reading it just as much as you will regret it by reading it. Ty is.... he's just that good. read more..."
    },
    {
      "body": "This chapter of Lady Lostris' was due to be featured some time ago, if only for the sheer amount of effort and skill that went into the descriptions and action scenes.",
      "links": [],
      "text": "This chapter of Lady Lostris' was due to be featured some time ago, if only for the sheer amount of effort and skill that went into the descriptions and action scenes."
    },
    {
      "body": "The readers truly get inside the head of Seraphine in this chapter, and her moral conundrum at the beginning, coupled with her actions and the result of those actions, this chapter has more characterisation than most full-fledged stories. Lostris has proved, time and time again, what a capable writer she is, and this chapter was just the icing on the cake.",
      "links": [],
      "text": "The readers truly get inside the head of Seraphine in this chapter, and her moral conundrum at the beginning, coupled with her actions and the result of those actions, this chapter has more characterisation than most full-fledged stories. Lostris has proved, time and time again, what a capable writer she is, and this chapter was just the icing on the cake."
    },
    {
      "body": "If you want action and violence and a bit of swearing to boot, this chapter is good for that. But, it's not the best part of it. It's the emotions and the eloquence that, really, only Lostris can pull off for such a scene. read more...",
      "links": [],
      "text": "If you want action and violence and a bit of swearing to boot, this chapter is good for that. But, it's not the best part of it. It's the emotions and the eloquence that, really, only Lostris can pull off for such a scene. read more..."
    },
    {
      "body": "Kyoshidude is one of the most under-appreciated users on the wiki, with his writing popping up almost randomly, but never something you want to miss.",
      "links": [],
      "text": "Kyoshidude is one of the most under-appreciated users on the wiki, with his writing popping up almost randomly, but never something you want to miss."
    },
    {
      "body": "The Avatar and The Crane is one such story. A glimpse into Aang and Katara's future, it shows just a short moment between the two as Aang tries to come to terms with the fact that, though he has everything, he's still alone—the Air Nomads are gone. But, things aren't meant to be sad, and Katara always knows what to say or do to give him hope again.",
      "links": [],
      "text": "The Avatar and The Crane is one such story. A glimpse into Aang and Katara's future, it shows just a short moment between the two as Aang tries to come to terms with the fact that, though he has everything, he's still alone—the Air Nomads are gone. But, things aren't meant to be sad, and Katara always knows what to say or do to give him hope again."
    },
    {
      "body": "This short little 'shot, written by one of the most dedicated and under-appreciated writers, is a perfect rendition of a scene that every Kataang fan has envisioned at least one. read more...",
      "links": [],
      "text": "This short little 'shot, written by one of the most dedicated and under-appreciated writers, is a perfect rendition of a scene that every Kataang fan has envisioned at least one. read more..."
    },
    {
      "body": "Jtwin1 is the best kind of writer out there; he's good at writing, and he loves doing it. Any user who has spent even a second on one of his story pages can see the depth of detail and work he's put into his stories, and chapter 8 or Avatar: Neo Revolution is no exception.",
      "links": [],
      "text": "Jtwin1 is the best kind of writer out there; he's good at writing, and he loves doing it. Any user who has spent even a second on one of his story pages can see the depth of detail and work he's put into his stories, and chapter 8 or Avatar: Neo Revolution is no exception."
    },
    {
      "body": "The Weeds of Wealth is a beautifully written (and titled) chapter—though that's to be expected from the author by now. The vivid descriptions are completely immersive, and it feels like no time at all before you've devoured all 7,000 words.",
      "links": [],
      "text": "The Weeds of Wealth is a beautifully written (and titled) chapter—though that's to be expected from the author by now. The vivid descriptions are completely immersive, and it feels like no time at all before you've devoured all 7,000 words."
    },
    {
      "body": "To anyone who has ever thought about reading some of Jtwin's work but hasn't, this is just the push you need. read more...",
      "links": [],
      "text": "To anyone who has ever thought about reading some of Jtwin's work but hasn't, this is just the push you need. read more..."
    },
    {
      "body": "Once again, Sparkstoaflame manages to write something completely out of the ballpark, but completely and utterly brilliant at the same time.",
      "links": [],
      "text": "Once again, Sparkstoaflame manages to write something completely out of the ballpark, but completely and utterly brilliant at the same time."
    },
    {
      "body": "In Pursuit of Perfection is a masterpiece of a story—fitting, considering the subject matter. Azula is a painter, Aang is her muse, and together, everything goes absolutely horribly wrong. But, then again, that doesn't really matter when everything is so completely perfect at the same time, too.",
      "links": [],
      "text": "In Pursuit of Perfection is a masterpiece of a story—fitting, considering the subject matter. Azula is a painter, Aang is her muse, and together, everything goes absolutely horribly wrong. But, then again, that doesn't really matter when everything is so completely perfect at the same time, too."
    },
    {
      "body": "A one-shot that will make even the most seasoned readers take a step back and re-evaluate their lives, this story cannot get any higher praise. read more...",
      "links": [],
      "text": "A one-shot that will make even the most seasoned readers take a step back and re-evaluate their lives, this story cannot get any higher praise. read more..."
    },
    {
      "body": "Shí Miàn Mái Fú is the enticing sixteenth chapter of Fruipit's long-running fanon series Drive-ins, an AU Tokka story set in a modern setting.  The events of this particular chapter were long-anticipated and the setting and the overall atmosphere of this chapter were handled beautifully and executed well by the author, making it very much worthy of this month's feature.",
      "links": [],
      "text": "Shí Miàn Mái Fú is the enticing sixteenth chapter of Fruipit's long-running fanon series Drive-ins, an AU Tokka story set in a modern setting.  The events of this particular chapter were long-anticipated and the setting and the overall atmosphere of this chapter were handled beautifully and executed well by the author, making it very much worthy of this month's feature."
    },
    {
      "body": "Readers found great writing in the comprehensive descriptions and the sound plot development and action that was coordinated together here.  Definitely worthy of the praise that it has received, it's clear that this chapter will not leave those who choose to read it disappointed. read more...",
      "links": [],
      "text": "Readers found great writing in the comprehensive descriptions and the sound plot development and action that was coordinated together here.  Definitely worthy of the praise that it has received, it's clear that this chapter will not leave those who choose to read it disappointed. read more..."
    },
    {
      "body": "\"Chapter 1: Darkest Hour (DSV)\" is the first chapter of the second book of AvatarRokusGhost's iconic series, Dragons, Sieges and Volcanoes. To begin the book that will show readers the Fire Nation's most famous siege on Ba Sing Se through the eyes of the now-popular Terra Team soldier, Ratana, the author treats his readers with a beautiful narration to recap his first book and set the time and place in which the story's beloved characters will begin the next chapter of their journeys. Earthbenders and firebenders alike prepare for a battle that will mark a crucial point in the Hundred Year War.",
      "links": [],
      "text": "\"Chapter 1: Darkest Hour (DSV)\" is the first chapter of the second book of AvatarRokusGhost's iconic series, Dragons, Sieges and Volcanoes. To begin the book that will show readers the Fire Nation's most famous siege on Ba Sing Se through the eyes of the now-popular Terra Team soldier, Ratana, the author treats his readers with a beautiful narration to recap his first book and set the time and place in which the story's beloved characters will begin the next chapter of their journeys. Earthbenders and firebenders alike prepare for a battle that will mark a crucial point in the Hundred Year War."
    },
    {
      "body": "After the success of the story's first book, there should be no doubt that Sieges will be just as enjoyable. If this first chapter is any indication, ARG is about to wow the portal yet again. read more...",
      "links": [],
      "text": "After the success of the story's first book, there should be no doubt that Sieges will be just as enjoyable. If this first chapter is any indication, ARG is about to wow the portal yet again. read more..."
    },
    {
      "body": "\"The Lost and the Found\" is the well-enjoyed third chapter of Katherine Rebekah's The Legend of Kyo, recently a nominee in the Fanon Awards. The author displays in this chapter that she's not only capable of thinking out a captivating storyline, but that's she's also more than capable of backing it up with some vivid descriptions that pull the reader right in. Her pacing and displayed emotions are right on, making this worthy of the first featured articled spot of 2016.  (read more...)",
      "links": [],
      "text": "\"The Lost and the Found\" is the well-enjoyed third chapter of Katherine Rebekah's The Legend of Kyo, recently a nominee in the Fanon Awards. The author displays in this chapter that she's not only capable of thinking out a captivating storyline, but that's she's also more than capable of backing it up with some vivid descriptions that pull the reader right in. Her pacing and displayed emotions are right on, making this worthy of the first featured articled spot of 2016.  (read more...)"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Avatar_Wiki:Featured_fanon_articles",
    "file": "avatar.wikia.com/wiki/Avatar_Wiki_Featured_fanon_articles.html",
    "page": "Avatar_Wiki_Featured_fanon_articles",
    "title": "Avatar Wiki:Featured fanon articles"
  }
}