{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Azula",
      "target": {
        "href": "Category_Azula",
        "page": "Category_Azula"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "href": "Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}, all of which, with the exception of her relationship with her ${link_2}, were jeopardized through her cruel, manipulative, and selfish personality.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "father",
          "key": "${link_2}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "This page is comprised of Azula's relationships with other characters in the World of Avatar, all of which, with the exception of her relationship with her father, were jeopardized through her cruel, manipulative, and selfish personality."
    },
    {
      "body": "${link_0} showed no remorse over the loss of her ${link_1}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "grandfather",
          "key": "${link_1}",
          "target": {
            "href": "Azulon",
            "page": "Azulon"
          }
        }
      ],
      "text": "Azula showed no remorse over the loss of her grandfather."
    },
    {
      "body": "Azula was named by Ozai after her grandfather, ${link_0}. The relationship between Azula and her grandfather remains a mystery. Ozai has mentioned that both of them were ${link_1} prodigies, however, Azulon seemed to be unimpressed with his granddaughter's abilities. The feeling seems mutual, however, as she appeared to be unimpressed with him due to his old age and moments of compassion for Iroh. She was, for the most part, not saddened or even the slightest bit fazed by Azulon's death.",
      "links": [
        {
          "body": "Azulon",
          "key": "${link_0}",
          "target": {
            "href": "Azulon",
            "page": "Azulon"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Azula was named by Ozai after her grandfather, Azulon. The relationship between Azula and her grandfather remains a mystery. Ozai has mentioned that both of them were firebending prodigies, however, Azulon seemed to be unimpressed with his granddaughter's abilities. The feeling seems mutual, however, as she appeared to be unimpressed with him due to his old age and moments of compassion for Iroh. She was, for the most part, not saddened or even the slightest bit fazed by Azulon's death."
    },
    {
      "body": "${link_0} refused to let ${link_1} join him on his quest to burn down the ${link_2}.",
      "links": [
        {
          "body": "Ozai",
          "key": "${link_0}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Ozai refused to let Azula join him on his quest to burn down the Earth Kingdom."
    },
    {
      "body": "Ozai seemed to be the only person whom Azula viewed as her equal. Explicitly stated by ${link_0}, Azula was favored by their father, ${link_1} Ozai; Azula's cruelty and sadism was only matched by her father's. As a firebending prodigy and the favored sibling, everyone, apart from ${link_2}, Zuko, and ${link_3}, adored her and, judging by her ${link_4} and ${link_5}, she was given better treatment than her brother. Soon after the ${link_6} ${link_7} defeat at the ${link_8}, Fire Lord Ozai gave her the task of capturing Zuko and Iroh. Soon after returning to the Fire Nation with Zuko after the supposed defeat of the ${link_9}, Azula demonstrated her lack of loyalty to even her own father; she was willing to lie, even to him, for her own ends.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_2}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Ursa",
          "key": "${link_3}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        },
        {
          "body": "ship",
          "key": "${link_4}",
          "target": {
            "href": "Royal_barge",
            "page": "Royal_barge"
          }
        },
        {
          "body": "soldiers",
          "key": "${link_5}",
          "target": {
            "href": "Royal_Procession",
            "page": "Royal_Procession"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_6}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Navy",
          "key": "${link_7}",
          "target": {
            "href": "Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_8}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_9}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Ozai seemed to be the only person whom Azula viewed as her equal. Explicitly stated by Zuko, Azula was favored by their father, Fire Lord Ozai; Azula's cruelty and sadism was only matched by her father's. As a firebending prodigy and the favored sibling, everyone, apart from Iroh, Zuko, and Ursa, adored her and, judging by her ship and soldiers, she was given better treatment than her brother. Soon after the Fire Nation Navy defeat at the Northern Water Tribe, Fire Lord Ozai gave her the task of capturing Zuko and Iroh. Soon after returning to the Fire Nation with Zuko after the supposed defeat of the Avatar, Azula demonstrated her lack of loyalty to even her own father; she was willing to lie, even to him, for her own ends."
    },
    {
      "body": "During the ${link_0}, Zuko revealed to his father that it was Azula who \"killed\" the Avatar at ${link_1} and that he survived the attack. Ozai was clearly infuriated at his daughter's failure to kill the Avatar and Zuko's traitorous behavior, but it appeared Ozai had not lost his trust in Azula. In his self-appointment as ${link_2}, Ozai appointed Azula his successor as Fire Lord, though the title had become meaningless in the face of the Phoenix King, a higher rank than Fire Lord.",
      "links": [
        {
          "body": "eclipse",
          "key": "${link_0}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Phoenix King",
          "key": "${link_2}",
          "target": {
            "href": "Phoenix_King",
            "page": "Phoenix_King"
          }
        }
      ],
      "text": "During the eclipse, Zuko revealed to his father that it was Azula who \"killed\" the Avatar at Ba Sing Se and that he survived the attack. Ozai was clearly infuriated at his daughter's failure to kill the Avatar and Zuko's traitorous behavior, but it appeared Ozai had not lost his trust in Azula. In his self-appointment as Phoenix King, Ozai appointed Azula his successor as Fire Lord, though the title had become meaningless in the face of the Phoenix King, a higher rank than Fire Lord."
    },
    {
      "body": "Prior to this, Ozai told Azula that she was not to participate in the ${link_0} attack that she had suggested to him earlier, and she immediately felt belittled and dishonored and was evidently hurt by what she felt was neglect from her father.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Prior to this, Ozai told Azula that she was not to participate in the Earth Kingdom attack that she had suggested to him earlier, and she immediately felt belittled and dishonored and was evidently hurt by what she felt was neglect from her father."
    },
    {
      "body": "However, it is evident that Ozai was incapable of true, unconditional love and dispensed affection and favor to shape his two children as tools that would respond to his will, even for his daughter. This shaped Azula's fears that she could not count on love or affection from anyone, no matter how close they seemed. Unable to trust others, she instead tried to dominate them through fear - a paranoia that ultimately drove her insane following both the betrayal of her closest friends and her own father abandoning her in the now-meaningless role of Fire Lord.",
      "links": [],
      "text": "However, it is evident that Ozai was incapable of true, unconditional love and dispensed affection and favor to shape his two children as tools that would respond to his will, even for his daughter. This shaped Azula's fears that she could not count on love or affection from anyone, no matter how close they seemed. Unable to trust others, she instead tried to dominate them through fear - a paranoia that ultimately drove her insane following both the betrayal of her closest friends and her own father abandoning her in the now-meaningless role of Fire Lord."
    },
    {
      "body": "Ozai and Azula were both defeated by the Avatar and his ${link_0} during the arrival of ${link_1} and, while Ozai was imprisoned in the ${link_2}, Azula was sent to a secret mental facility elsewhere in the Fire Nation.",
      "links": [
        {
          "body": "allies",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_1}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Capital City Prison",
          "key": "${link_2}",
          "target": {
            "href": "Capital_City_Prison",
            "page": "Capital_City_Prison"
          }
        }
      ],
      "text": "Ozai and Azula were both defeated by the Avatar and his allies during the arrival of Sozin's Comet and, while Ozai was imprisoned in the Capital City Prison, Azula was sent to a secret mental facility elsewhere in the Fire Nation."
    },
    {
      "body": "A year later, Azula and her father were placed in adjoining cells by Zuko in order to facilitate a conversation between the two. During the first half hour, they said nothing to each other, knowing that they were being watched. When Zuko entered with tea, Azula made him trip, much to Ozai's delight. However, when they were left to have a conversation in private, Azula and Ozai's bond of trust was still great enough for him to trust her with information regarding her mother's fate.",
      "links": [],
      "text": "A year later, Azula and her father were placed in adjoining cells by Zuko in order to facilitate a conversation between the two. During the first half hour, they said nothing to each other, knowing that they were being watched. When Zuko entered with tea, Azula made him trip, much to Ozai's delight. However, when they were left to have a conversation in private, Azula and Ozai's bond of trust was still great enough for him to trust her with information regarding her mother's fate."
    },
    {
      "body": "Despite this, Azula later on appeared to have lost interest in Ozai and instead decided to start molding Zuko into her image of a better Fire Lord.",
      "links": [],
      "text": "Despite this, Azula later on appeared to have lost interest in Ozai and instead decided to start molding Zuko into her image of a better Fire Lord."
    },
    {
      "body": "${link_0} and ${link_1} fought against each other during the ${link_2}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "confrontation at Tu Zin",
          "key": "${link_2}",
          "target": {
            "href": "Confrontation_at_Tu_Zin",
            "page": "Confrontation_at_Tu_Zin"
          }
        }
      ],
      "text": "Iroh and Azula fought against each other during the confrontation at Tu Zin."
    },
    {
      "body": "Despite the fact that they were family, Azula never cared about Iroh and was constantly disrespectful toward him. Even as a child, Azula had a considerably low opinion of her uncle; she referred to him as \"His Royal Tea-loving Kookiness\", as well as promptly torching a doll he had sent her from an Earth Kingdom city and called him a \"quitter and loser\" for failing to capture Ba Sing Se after the death of his son, ${link_0} caused him to become too despondent to carry on with the ${link_1}. Years later when Iroh ended up accidentally poisoning himself by consuming a ${link_2} (mistaking it for the ${link_3}), he and Zuko considered their options as to where they should go to find an antidote. Their options were either to journey to the Earth Kingdom, where they risk having their identities and connections to the Fire Nation exposed, captured and possibly killed; or back to the Fire Nation, were they were currently viewed as traitors. With the strong possibility of being immediately handed to Azula should they choose the latter, the duo opted to the Earth Kingdom instead, indicating death was a more favored option than facing Azula. She also called him \"Uncle Fatso\" and \"Old Fuddy-Duddy Uncle\". Azula expressed excitement at the idea that he might die in battle, which would put Ozai next in line for the throne. She once attacked Iroh with a fire blast - after she had, as she put it, \"surrendered with honor\" - and severely wounded him.",
      "links": [
        {
          "body": "Lu Ten",
          "key": "${link_0}",
          "target": {
            "href": "Lu_Ten",
            "page": "Lu_Ten"
          }
        },
        {
          "body": "siege",
          "key": "${link_1}",
          "target": {
            "href": "Siege_of_Ba_Sing_Se",
            "page": "Siege_of_Ba_Sing_Se"
          }
        },
        {
          "body": "White Jade Flower",
          "key": "${link_2}",
          "target": {
            "href": "White_jade_bush",
            "page": "White_jade_bush"
          }
        },
        {
          "body": "White Dragon Flower",
          "key": "${link_3}",
          "target": {
            "href": "White_dragon_bush",
            "page": "White_dragon_bush"
          }
        }
      ],
      "text": "Despite the fact that they were family, Azula never cared about Iroh and was constantly disrespectful toward him. Even as a child, Azula had a considerably low opinion of her uncle; she referred to him as \"His Royal Tea-loving Kookiness\", as well as promptly torching a doll he had sent her from an Earth Kingdom city and called him a \"quitter and loser\" for failing to capture Ba Sing Se after the death of his son, Lu Ten caused him to become too despondent to carry on with the siege. Years later when Iroh ended up accidentally poisoning himself by consuming a White Jade Flower (mistaking it for the White Dragon Flower), he and Zuko considered their options as to where they should go to find an antidote. Their options were either to journey to the Earth Kingdom, where they risk having their identities and connections to the Fire Nation exposed, captured and possibly killed; or back to the Fire Nation, were they were currently viewed as traitors. With the strong possibility of being immediately handed to Azula should they choose the latter, the duo opted to the Earth Kingdom instead, indicating death was a more favored option than facing Azula. She also called him \"Uncle Fatso\" and \"Old Fuddy-Duddy Uncle\". Azula expressed excitement at the idea that he might die in battle, which would put Ozai next in line for the throne. She once attacked Iroh with a fire blast - after she had, as she put it, \"surrendered with honor\" - and severely wounded him."
    },
    {
      "body": "Unlike Zuko, Iroh was not blinded by emotion and could see through Azula's lies. He was skeptical when Azula claimed her father wanted them home in the Fire Nation while Zuko eagerly awaited his return home. Iroh's suspicions were confirmed when ${link_0} accidentally revealed they were prisoners. He attempted to act politely toward Azula regardless of his distrust, but Azula did not respond kindly and interrupted him while he was talking, demanding for him to be silent.",
      "links": [
        {
          "body": "Azula's ship captain",
          "key": "${link_0}",
          "target": {
            "href": "Azula%27s_ship_captain",
            "page": "Azula%27s_ship_captain"
          }
        }
      ],
      "text": "Unlike Zuko, Iroh was not blinded by emotion and could see through Azula's lies. He was skeptical when Azula claimed her father wanted them home in the Fire Nation while Zuko eagerly awaited his return home. Iroh's suspicions were confirmed when Azula's ship captain accidentally revealed they were prisoners. He attempted to act politely toward Azula regardless of his distrust, but Azula did not respond kindly and interrupted him while he was talking, demanding for him to be silent."
    },
    {
      "body": "Despite Iroh's tendencies to avoid unnecessary conflict, he did teach Zuko more difficult bending techniques in order to help him defeat her. In his own words, he said, \"She's crazy and needs to go down.\" Iroh was one of the few other characters who possesses the ability to ${link_0} and has demonstrated the technique of ${link_1}, a technique Azula had not mastered. When Azula tried to manipulate Zuko into taking over Ba Sing Se, Iroh tried to convince him to let go of his quest to restore his honor and \"choose good\".",
      "links": [
        {
          "body": "generate lightning",
          "key": "${link_0}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "redirecting lightning",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "text": "Despite Iroh's tendencies to avoid unnecessary conflict, he did teach Zuko more difficult bending techniques in order to help him defeat her. In his own words, he said, \"She's crazy and needs to go down.\" Iroh was one of the few other characters who possesses the ability to generate lightning and has demonstrated the technique of redirecting lightning, a technique Azula had not mastered. When Azula tried to manipulate Zuko into taking over Ba Sing Se, Iroh tried to convince him to let go of his quest to restore his honor and \"choose good\"."
    },
    {
      "body": "After ${link_0}, Azula captured Iroh, brought him home in chains and used him as a ploy to force Zuko to return home as well.",
      "links": [
        {
          "body": "Ba Sing Se fell",
          "key": "${link_0}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        }
      ],
      "text": "After Ba Sing Se fell, Azula captured Iroh, brought him home in chains and used him as a ploy to force Zuko to return home as well."
    },
    {
      "body": "Upon the arrival of Sozin's Comet, Iroh reversed his niece's victory and ${link_0}. Like Ursa, Iroh favored Zuko over Azula, though he did encourage her role in the search for Ursa one year later, helping Team Avatar to accept her by pointing out that finding Ursa could perhaps bring peace to her as well.",
      "links": [
        {
          "body": "liberated Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Liberation_of_Ba_Sing_Se",
            "page": "Liberation_of_Ba_Sing_Se"
          }
        }
      ],
      "text": "Upon the arrival of Sozin's Comet, Iroh reversed his niece's victory and liberated Ba Sing Se. Like Ursa, Iroh favored Zuko over Azula, though he did encourage her role in the search for Ursa one year later, helping Team Avatar to accept her by pointing out that finding Ursa could perhaps bring peace to her as well."
    },
    {
      "body": "Kiyi was Azula's half-sister, although the princess was unaware of this the first time they met. Kiyi attempted to befriend both Zuko and Azula by showing them her doll. However, Azula, not wanting to be bothered by this child, scared her by saying that she used to give her dolls \"headcuts\" instead of haircuts, asking if Kiyi would like to see a demonstration.",
      "links": [],
      "text": "Kiyi was Azula's half-sister, although the princess was unaware of this the first time they met. Kiyi attempted to befriend both Zuko and Azula by showing them her doll. However, Azula, not wanting to be bothered by this child, scared her by saying that she used to give her dolls \"headcuts\" instead of haircuts, asking if Kiyi would like to see a demonstration."
    },
    {
      "body": "When Azula returned to the house intent on killing Noriko, whom she learned was truly Ursa, she glared at the terrified Kiyi and asked her mother if the girl was meant to be her replacement, since she turned out to be a monster.",
      "links": [],
      "text": "When Azula returned to the house intent on killing Noriko, whom she learned was truly Ursa, she glared at the terrified Kiyi and asked her mother if the girl was meant to be her replacement, since she turned out to be a monster."
    },
    {
      "body": "Some time later, Azula did acknowledge Kiyi as family, saying that she was strong-willed, as it was \"in her blood\".",
      "links": [],
      "text": "Some time later, Azula did acknowledge Kiyi as family, saying that she was strong-willed, as it was \"in her blood\"."
    },
    {
      "body": "Little is known about Azula's relationship with her cousin, Lu Ten. When Ursa informed her children that \"Iroh [had] lost his son. Your cousin, Lu Ten, did not survive the battle\", Zuko was clearly shocked and saddened by the news, while Azula was shown in the background with an unclear expression and was entirely unsympathetic to Iroh's reaction to his death.",
      "links": [],
      "text": "Little is known about Azula's relationship with her cousin, Lu Ten. When Ursa informed her children that \"Iroh [had] lost his son. Your cousin, Lu Ten, did not survive the battle\", Zuko was clearly shocked and saddened by the news, while Azula was shown in the background with an unclear expression and was entirely unsympathetic to Iroh's reaction to his death."
    },
    {
      "body": "On the brink of insanity, ${link_0} hallucinated about ${link_1}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "her mother",
          "key": "${link_1}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        }
      ],
      "text": "On the brink of insanity, Azula hallucinated about her mother."
    },
    {
      "body": "Little is known about the relationship between Azula and her mother, Ursa, granddaughter of Avatar ${link_0}. It is known that she cared deeply for the neglected Zuko, despite her daughter, ${link_1} Azula, possessing more superior firebending abilities. This was in direct contrast to her husband Ozai's feelings toward his children, who stated Azula was \"born lucky\" while Zuko was \"lucky to be born\".",
      "links": [
        {
          "body": "Roku",
          "key": "${link_0}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Princess",
          "key": "${link_1}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "text": "Little is known about the relationship between Azula and her mother, Ursa, granddaughter of Avatar Roku. It is known that she cared deeply for the neglected Zuko, despite her daughter, Princess Azula, possessing more superior firebending abilities. This was in direct contrast to her husband Ozai's feelings toward his children, who stated Azula was \"born lucky\" while Zuko was \"lucky to be born\"."
    },
    {
      "body": "It was seen that Azula was often scolded by Ursa for the unkind and disrespectful remarks she made about her brother, uncle, or grandfather.",
      "links": [],
      "text": "It was seen that Azula was often scolded by Ursa for the unkind and disrespectful remarks she made about her brother, uncle, or grandfather."
    },
    {
      "body": "After overhearing a conflict between Fire Lord Azulon and Ozai, Azula mockingly informed Zuko that their father was going to carry out the orders given be Azulon to kill his son. Zuko told himself \"Azula always lies,\" but when his mom gave him her final goodbyes, she stated that everything she had done had been to protect him. It was eventually revealed that she did \"vicious, treasonous\" actions that night in order to save Zuko, resulting in Azulon's death and her banishment. It is noted, however, that Azula seems to show no concern or sadness at all over the death of her grandfather or the disappearance of her own mother, especially when it becomes known that Ozai would be crowned Fire Lord. As with her father, family pales to her desire for power.",
      "links": [],
      "text": "After overhearing a conflict between Fire Lord Azulon and Ozai, Azula mockingly informed Zuko that their father was going to carry out the orders given be Azulon to kill his son. Zuko told himself \"Azula always lies,\" but when his mom gave him her final goodbyes, she stated that everything she had done had been to protect him. It was eventually revealed that she did \"vicious, treasonous\" actions that night in order to save Zuko, resulting in Azulon's death and her banishment. It is noted, however, that Azula seems to show no concern or sadness at all over the death of her grandfather or the disappearance of her own mother, especially when it becomes known that Ozai would be crowned Fire Lord. As with her father, family pales to her desire for power."
    },
    {
      "body": "Years later, as she and her friends discussed their pasts during a vacation on Ember Island, Azula remarked that she was well aware Ursa loved Zuko more, but unlike her brother, does not obsess over it. She did however reveal how it hurt that her own mother thought she was a monster, albeit halfheartedly, as she goes on to state it was true. It is interesting to note that when Azula made her revelation, she stared into a fire pit of burning embers, suggesting there were deep-rooted issues of anger, resentment and pain toward Ursa, perhaps a glimpse as well of the inner turmoil in Azula's mind that would later manifest itself outwardly as she descended into madness.",
      "links": [],
      "text": "Years later, as she and her friends discussed their pasts during a vacation on Ember Island, Azula remarked that she was well aware Ursa loved Zuko more, but unlike her brother, does not obsess over it. She did however reveal how it hurt that her own mother thought she was a monster, albeit halfheartedly, as she goes on to state it was true. It is interesting to note that when Azula made her revelation, she stared into a fire pit of burning embers, suggesting there were deep-rooted issues of anger, resentment and pain toward Ursa, perhaps a glimpse as well of the inner turmoil in Azula's mind that would later manifest itself outwardly as she descended into madness."
    },
    {
      "body": "Upon the arrival of Sozin's Comet, Ursa appeared before Azula in a hallucination. Azula is quick to remind her mother that she had no reason to see her since her mother thought she was a monster. Ursa rejected this accusation, saying she loved her daughter and she feared that Azula was committing her various crimes out of confusion. Enraged, Azula threw her hairbrush at her mirror, breaking the glass and ending the hallucination. Azula was left in her bedroom breaking down in tears, this incident further exposing the enormous turmoil, and possible self-loathing, going on inside Azula's mind as she descended into insanity.",
      "links": [],
      "text": "Upon the arrival of Sozin's Comet, Ursa appeared before Azula in a hallucination. Azula is quick to remind her mother that she had no reason to see her since her mother thought she was a monster. Ursa rejected this accusation, saying she loved her daughter and she feared that Azula was committing her various crimes out of confusion. Enraged, Azula threw her hairbrush at her mirror, breaking the glass and ending the hallucination. Azula was left in her bedroom breaking down in tears, this incident further exposing the enormous turmoil, and possible self-loathing, going on inside Azula's mind as she descended into insanity."
    },
    {
      "body": "Seeing the hallucination of Ursa had a deep impact on Azula, even a year later. She agreed at that time to help Zuko find Ursa, though she did so with her own agenda, as her paranoia led her to blame Ursa for every bad thing that had occurred in her life, and to conspire with her enemies. Throughout her journey to ${link_0}, where Team Avatar was hoping to find some more leads about Ursa's whereabouts, Azula was often plagued by delusional thoughts of Ursa's treacherous conspiracies against her and hallucinations that declared her mother's love for her, something Azula still could not comprehend. Accusing her mother of setting everyone against her, even her own mind, Azula revealed her plans to Ursa's mirage that she would find and kill her, in order to be free of her interventions forever.",
      "links": [
        {
          "body": "Hira'a",
          "key": "${link_0}",
          "target": {
            "href": "Hira%27a",
            "page": "Hira%27a"
          }
        }
      ],
      "text": "Seeing the hallucination of Ursa had a deep impact on Azula, even a year later. She agreed at that time to help Zuko find Ursa, though she did so with her own agenda, as her paranoia led her to blame Ursa for every bad thing that had occurred in her life, and to conspire with her enemies. Throughout her journey to Hira'a, where Team Avatar was hoping to find some more leads about Ursa's whereabouts, Azula was often plagued by delusional thoughts of Ursa's treacherous conspiracies against her and hallucinations that declared her mother's love for her, something Azula still could not comprehend. Accusing her mother of setting everyone against her, even her own mind, Azula revealed her plans to Ursa's mirage that she would find and kill her, in order to be free of her interventions forever."
    },
    {
      "body": "When Azula learned that Ursa had given up her old face, she attacked her in a fit of rage. She was particularly upset that, under the identity of Noriko, Ursa had had another daughter with Ikem, Kiyi. Azula asked if Kiyi was a replacement for her since she turned out to be such a monster. Noriko, realizing that she, as Ursa, did indeed not love Azula properly, apologized to Azula for this, stroking her face with tears in her eyes. This gave Azula pause, tears welling up in her own eyes, allowing Zuko to intervene and stop Azula's attack. After Zuko revealed that he would love Azula as a sister no matter what, Azula gave up her goal to kill Ursa, running away and leaving her alive instead.",
      "links": [],
      "text": "When Azula learned that Ursa had given up her old face, she attacked her in a fit of rage. She was particularly upset that, under the identity of Noriko, Ursa had had another daughter with Ikem, Kiyi. Azula asked if Kiyi was a replacement for her since she turned out to be such a monster. Noriko, realizing that she, as Ursa, did indeed not love Azula properly, apologized to Azula for this, stroking her face with tears in her eyes. This gave Azula pause, tears welling up in her own eyes, allowing Zuko to intervene and stop Azula's attack. After Zuko revealed that he would love Azula as a sister no matter what, Azula gave up her goal to kill Ursa, running away and leaving her alive instead."
    },
    {
      "body": "${link_0} told ${link_1} about some of the past ${link_2} while they were in the ${link_3}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Fire Lords",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Royal Gallery",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation_Royal_Palace#Royal_Gallery",
            "page": "Fire_Nation_Royal_Palace"
          }
        }
      ],
      "text": "Azula told Zuko about some of the past Fire Lords while they were in the Royal Gallery."
    },
    {
      "body": "Zuko, also referred to as Zuzu by Azula, is Azula's older brother. The two siblings seemingly have little appreciation of one another. Even being the younger sibling, Azula has been known to lie to Zuko and take pleasure in torturing him; though Zuko knew that \"Azula always lies\" (as he repeatedly chants, seemingly to convince himself), she was often able to manipulate him. This is most notable when she used his hope of redemption to prompt him to betray Iroh and join her in attacking the Avatar in the conquering Ba Sing Se.",
      "links": [],
      "text": "Zuko, also referred to as Zuzu by Azula, is Azula's older brother. The two siblings seemingly have little appreciation of one another. Even being the younger sibling, Azula has been known to lie to Zuko and take pleasure in torturing him; though Zuko knew that \"Azula always lies\" (as he repeatedly chants, seemingly to convince himself), she was often able to manipulate him. This is most notable when she used his hope of redemption to prompt him to betray Iroh and join her in attacking the Avatar in the conquering Ba Sing Se."
    },
    {
      "body": "However, following their alliance, Azula's relationship with her brother gradually began to take a drastic change. She expressed concern over Zuko after discovering that he had been secretly visiting an imprisoned Iroh, warning him that if it were to be discovered that he was meeting with their uncle, it could be misinterpreted as conspiracy. Azula condescendingly instructed Zuko to be more careful in regards to Iroh, ending her warning with the use of his old nickname of \"dum-dum\" for effect. During their vacation to ${link_0}, Azula shared nostalgia and depression with her brother as they paid a visit to their family's decrepit summer ${link_1}. After Azula found Zuko within the old house, she told him to leave, noting that she understands his feelings toward the place. Along with Mai and Ty Lee, Azula later helps Zuko realize why he was feeling angered, assuming the role of interpreter as they each shared revelations of their life experiences that shaped them into who they are. When her turn came, Azula admitted to her awareness that their mother loved Zuko more, but unlike her brother, did not feel the need to care or spend her time complaining about it. Although, with each act of compassion toward her brother, Azula ensured to couple it with her usual cold-heartedness, a performance reminiscent to that of a love-hate relationship. At one point Zuko finally brought himself to confide his feelings of uncertainty and confusion toward Azula. While faintly sympathetic toward him, she impulsively deemed him pathetic, albeit in a somewhat playful tone.",
      "links": [
        {
          "body": "Ember Island",
          "key": "${link_0}",
          "target": {
            "href": "Ember_Island",
            "page": "Ember_Island"
          }
        },
        {
          "body": "beach house",
          "key": "${link_1}",
          "target": {
            "href": "Ozai%27s_beach_house",
            "page": "Ozai%27s_beach_house"
          }
        }
      ],
      "text": "However, following their alliance, Azula's relationship with her brother gradually began to take a drastic change. She expressed concern over Zuko after discovering that he had been secretly visiting an imprisoned Iroh, warning him that if it were to be discovered that he was meeting with their uncle, it could be misinterpreted as conspiracy. Azula condescendingly instructed Zuko to be more careful in regards to Iroh, ending her warning with the use of his old nickname of \"dum-dum\" for effect. During their vacation to Ember Island, Azula shared nostalgia and depression with her brother as they paid a visit to their family's decrepit summer beach house. After Azula found Zuko within the old house, she told him to leave, noting that she understands his feelings toward the place. Along with Mai and Ty Lee, Azula later helps Zuko realize why he was feeling angered, assuming the role of interpreter as they each shared revelations of their life experiences that shaped them into who they are. When her turn came, Azula admitted to her awareness that their mother loved Zuko more, but unlike her brother, did not feel the need to care or spend her time complaining about it. Although, with each act of compassion toward her brother, Azula ensured to couple it with her usual cold-heartedness, a performance reminiscent to that of a love-hate relationship. At one point Zuko finally brought himself to confide his feelings of uncertainty and confusion toward Azula. While faintly sympathetic toward him, she impulsively deemed him pathetic, albeit in a somewhat playful tone."
    },
    {
      "body": "During the eclipse, Zuko confessed to Ozai that it was Azula who failed to kill the Avatar and that she lied to him to avoid punishment. Afterward, Azula confronted Zuko again while he was assisting a prison escape at the ${link_0}. Despite her ingenious tactics and attacks, she failed to land a single blow on Zuko, who easily deflected her attacks, although it should be noted that Azula was fighting both Zuko and ${link_1}, who at that point was an able swordsman, at the same time. After she and Ty Lee abandoned the battle scene and left the others for dead, her friend Mai betrayed her by saving Zuko's life, a reflection that she still loved him. Zuko escaped successfully along with his allies, leaving Azula enraged. As Mai officially renounced her loyalty to Azula, prompting her to fight Mai, Azula was attacked by Ty Lee, who came to Mai's defense. Although she masked the effects of the incident with anger, Azula was devastated by the betrayal of her two friends.",
      "links": [
        {
          "body": "Boiling Rock",
          "key": "${link_0}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "During the eclipse, Zuko confessed to Ozai that it was Azula who failed to kill the Avatar and that she lied to him to avoid punishment. Afterward, Azula confronted Zuko again while he was assisting a prison escape at the Boiling Rock. Despite her ingenious tactics and attacks, she failed to land a single blow on Zuko, who easily deflected her attacks, although it should be noted that Azula was fighting both Zuko and Sokka, who at that point was an able swordsman, at the same time. After she and Ty Lee abandoned the battle scene and left the others for dead, her friend Mai betrayed her by saving Zuko's life, a reflection that she still loved him. Zuko escaped successfully along with his allies, leaving Azula enraged. As Mai officially renounced her loyalty to Azula, prompting her to fight Mai, Azula was attacked by Ty Lee, who came to Mai's defense. Although she masked the effects of the incident with anger, Azula was devastated by the betrayal of her two friends."
    },
    {
      "body": "Azula attacked Zuko and his friends at the ${link_0}. At this point, it was clear that she wished to kill her own brother. She engaged in a battle with Zuko at the top of her airship, while his friends escaped. Azula attempted to launch a devastating attack on Zuko; however, as he countered with an equally powerful move, they were both flung off the airship by the powerful explosion that followed the collision of their attacks. This sent Azula falling to what would have been certain death had she not saved herself by using her firebending to propel herself toward a cliff and used her hair pin to anchor herself there safely. She watched Zuko fly off with a sinister look on her face, clearly ready to pursue her brother once again.",
      "links": [
        {
          "body": "Western Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "text": "Azula attacked Zuko and his friends at the Western Air Temple. At this point, it was clear that she wished to kill her own brother. She engaged in a battle with Zuko at the top of her airship, while his friends escaped. Azula attempted to launch a devastating attack on Zuko; however, as he countered with an equally powerful move, they were both flung off the airship by the powerful explosion that followed the collision of their attacks. This sent Azula falling to what would have been certain death had she not saved herself by using her firebending to propel herself toward a cliff and used her hair pin to anchor herself there safely. She watched Zuko fly off with a sinister look on her face, clearly ready to pursue her brother once again."
    },
    {
      "body": "It is important to note that while Azula was falling, Zuko showed genuine regret as he believed she would really die. This, coupled with Azula's affection for Zuko during their time together, proves that at best they did care for one another, but due to their different views on life and the nature of their upbringing (Zuko through Ursa and Iroh, and Azula through Ozai), they cannot coexist. While initially vague, it soon became clearer where Azula's rage toward her brother came from as she impulsively felt the need to berate and belittle him and rub their father's favoritism of her in his face, even when the situation did not call for it and even after Zuko made it clear he no longer cared for his father's approval. This apparently stems from a massive and subconscious jealousy of her mother favoring Zuko.",
      "links": [],
      "text": "It is important to note that while Azula was falling, Zuko showed genuine regret as he believed she would really die. This, coupled with Azula's affection for Zuko during their time together, proves that at best they did care for one another, but due to their different views on life and the nature of their upbringing (Zuko through Ursa and Iroh, and Azula through Ozai), they cannot coexist. While initially vague, it soon became clearer where Azula's rage toward her brother came from as she impulsively felt the need to berate and belittle him and rub their father's favoritism of her in his face, even when the situation did not call for it and even after Zuko made it clear he no longer cared for his father's approval. This apparently stems from a massive and subconscious jealousy of her mother favoring Zuko."
    },
    {
      "body": "Zuko and Azula finally battled for the last time on the day Sozin's Comet arrived. Zuko and ${link_0} arrived at Azula's coronation where Zuko declared to his sister that he would become Fire Lord rather than her. Azula responded to this by immediately challenging Zuko to an ${link_1} for the crown, which he eagerly accepted. It is not clear if she did because she realized she would probably be unable to successfully fight both Zuko and Katara, or because of her mounting desire to kill Zuko and overcome her crumbling mental state. When Katara pointed out to Zuko that he had previously admitted to not being able to defeat Azula by himself, he simply stated that Azula was \"off\" and \"slipping\", indicating that he sensed Azula's mental instability which he hoped would give him an advantage, enable him to defeat her and keep Katara out of harm's way. The two fought a ${link_2} with Zuko equally matching Azula blow-for-blow. When Zuko finally succeeded in knocking Azula off her feet, Azula seemingly became more outraged. When Zuko taunted her about her failure to utilize lightning generation, believing her to be afraid he would redirect the bolt at her, she immediately charged up a powerful lightning attack. She appeared to target Zuko, however, aimed the attack at Katara instead, who was anxiously watching the battle from the sidelines. Zuko leapt in front of the lightning, redirecting enough of the attack to prevent immediate death, but was still badly injured in the process. Azula laughed maniacally and proceeded to fight Katara, who eventually tricked her by freezing them both in a block of ice and liquefying it to the extent where she was able to bind Azula's hands together and secure her to the ground. After defeating Azula, Katara went to ${link_3} Zuko. Seeing Zuko alive and standing after her attack finally caused Azula's mentality to collapse. She began screaming wildly and breathing fire, until she ended up on her side screaming, struggling, crying uncontrollably and mumbling incoherently as her emotions spun out of control. Zuko watched sadly as his sister fell apart.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_1}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        },
        {
          "body": "vicious duel",
          "key": "${link_2}",
          "target": {
            "href": "Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        },
        {
          "body": "heal",
          "key": "${link_3}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "Zuko and Azula finally battled for the last time on the day Sozin's Comet arrived. Zuko and Katara arrived at Azula's coronation where Zuko declared to his sister that he would become Fire Lord rather than her. Azula responded to this by immediately challenging Zuko to an Agni Kai for the crown, which he eagerly accepted. It is not clear if she did because she realized she would probably be unable to successfully fight both Zuko and Katara, or because of her mounting desire to kill Zuko and overcome her crumbling mental state. When Katara pointed out to Zuko that he had previously admitted to not being able to defeat Azula by himself, he simply stated that Azula was \"off\" and \"slipping\", indicating that he sensed Azula's mental instability which he hoped would give him an advantage, enable him to defeat her and keep Katara out of harm's way. The two fought a vicious duel with Zuko equally matching Azula blow-for-blow. When Zuko finally succeeded in knocking Azula off her feet, Azula seemingly became more outraged. When Zuko taunted her about her failure to utilize lightning generation, believing her to be afraid he would redirect the bolt at her, she immediately charged up a powerful lightning attack. She appeared to target Zuko, however, aimed the attack at Katara instead, who was anxiously watching the battle from the sidelines. Zuko leapt in front of the lightning, redirecting enough of the attack to prevent immediate death, but was still badly injured in the process. Azula laughed maniacally and proceeded to fight Katara, who eventually tricked her by freezing them both in a block of ice and liquefying it to the extent where she was able to bind Azula's hands together and secure her to the ground. After defeating Azula, Katara went to heal Zuko. Seeing Zuko alive and standing after her attack finally caused Azula's mentality to collapse. She began screaming wildly and breathing fire, until she ended up on her side screaming, struggling, crying uncontrollably and mumbling incoherently as her emotions spun out of control. Zuko watched sadly as his sister fell apart."
    },
    {
      "body": "Azula was imprisoned in a mental health facility elsewhere in the Fire Nation after the battle is lost. One year later, Zuko, now as Fire Lord, visited Azula. He had tried numerous times to get their father to confess the whereabouts of their mother, Ursa, but had gotten nowhere. He knew that Azula was the only one who could get Ozai to talk. Despite their differences, Azula agreed to help him, needing no reward, saying that the \"satisfaction of helping the Fire Lord in some small way [would] be compensation enough\", and that ever since she was institutionalized, she had wondered every single day what had happened to their mother.",
      "links": [],
      "text": "Azula was imprisoned in a mental health facility elsewhere in the Fire Nation after the battle is lost. One year later, Zuko, now as Fire Lord, visited Azula. He had tried numerous times to get their father to confess the whereabouts of their mother, Ursa, but had gotten nowhere. He knew that Azula was the only one who could get Ozai to talk. Despite their differences, Azula agreed to help him, needing no reward, saying that the \"satisfaction of helping the Fire Lord in some small way [would] be compensation enough\", and that ever since she was institutionalized, she had wondered every single day what had happened to their mother."
    },
    {
      "body": "When Zuko subsequently arranged the meeting between her and Ozai in prison, she acted hostile toward him, knocking him over when he brought tea in order to dignify the unpleasant situation and accusing him of wanting to watch her lap at the beverage like an animal. Ty Lee immediately chi blocked the angry Azula, but Zuko called her off, gently placing the now paralyzed Azula back in her wheelchair. When Zuko stated that all he wanted was to bring a little dignity to them, she promptly stated that the only way to do that was to leave her and their father to talk in private.",
      "links": [],
      "text": "When Zuko subsequently arranged the meeting between her and Ozai in prison, she acted hostile toward him, knocking him over when he brought tea in order to dignify the unpleasant situation and accusing him of wanting to watch her lap at the beverage like an animal. Ty Lee immediately chi blocked the angry Azula, but Zuko called her off, gently placing the now paralyzed Azula back in her wheelchair. When Zuko stated that all he wanted was to bring a little dignity to them, she promptly stated that the only way to do that was to leave her and their father to talk in private."
    },
    {
      "body": "Azula held up her end of the deal and coaxed the wanted information out of Ozai, but her manipulative side prompted her to seemingly destroy the letter that could lead to Ursa's whereabouts in front of Zuko's eyes, thus ensuring her own place on the quest to find her as Zuko needed what she knew. She was released from the mental institution and allowed to accompany her brother unbound and with dignity. Even though her brother had complied to her requests, he remained focused and alert to her every move, even inviting his friends to keep an eye on her during their trip.",
      "links": [],
      "text": "Azula held up her end of the deal and coaxed the wanted information out of Ozai, but her manipulative side prompted her to seemingly destroy the letter that could lead to Ursa's whereabouts in front of Zuko's eyes, thus ensuring her own place on the quest to find her as Zuko needed what she knew. She was released from the mental institution and allowed to accompany her brother unbound and with dignity. Even though her brother had complied to her requests, he remained focused and alert to her every move, even inviting his friends to keep an eye on her during their trip."
    },
    {
      "body": "Zuko and Azula's relationship reached a defining point when Zuko fought his sister to prevent her from killing their mother. Azula asked her brother why he was fighting, considering he did not want to be Fire Lord, and also why he did not kill her when he had the chance, unless he needed her to \"set him free\" of that burden. Zuko replied that he knew the throne, burden and all, was his destiny, before replying that he did not kill her for one simple fact: no matter how messy their relationship was and may always be, she would never stop being his sister whom he cared about.",
      "links": [],
      "text": "Zuko and Azula's relationship reached a defining point when Zuko fought his sister to prevent her from killing their mother. Azula asked her brother why he was fighting, considering he did not want to be Fire Lord, and also why he did not kill her when he had the chance, unless he needed her to \"set him free\" of that burden. Zuko replied that he knew the throne, burden and all, was his destiny, before replying that he did not kill her for one simple fact: no matter how messy their relationship was and may always be, she would never stop being his sister whom he cared about."
    },
    {
      "body": "Azula, having realized at last that somebody loved her unconditionally, dropped the incriminating letter against Zuko before running away, leaving Ursa alive. Zuko chased after her, pleading for her to come back so that he could help her. With tears in her eyes, Azula responded \"Same as always, Zu-Zu ... even when you're strong, you're weak,\" before running off into the Forgetful Valley.",
      "links": [],
      "text": "Azula, having realized at last that somebody loved her unconditionally, dropped the incriminating letter against Zuko before running away, leaving Ursa alive. Zuko chased after her, pleading for her to come back so that he could help her. With tears in her eyes, Azula responded \"Same as always, Zu-Zu ... even when you're strong, you're weak,\" before running off into the Forgetful Valley."
    },
    {
      "body": "Azula eventually returned as the leader of the ${link_0}, who disguised themselves as the ${link_1}. She stated that she had eventually accepted Zuko as the Fire Lord but tried to mold him into her image of a proper, more ruthless ruler.",
      "links": [
        {
          "body": "Fire Warriors",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Warriors",
            "page": "Fire_Warriors"
          }
        },
        {
          "body": "Kemurikage",
          "key": "${link_1}",
          "target": {
            "href": "Kemurikage",
            "page": "Kemurikage"
          }
        }
      ],
      "text": "Azula eventually returned as the leader of the Fire Warriors, who disguised themselves as the Kemurikage. She stated that she had eventually accepted Zuko as the Fire Lord but tried to mold him into her image of a proper, more ruthless ruler."
    },
    {
      "body": "${link_0} and ${link_1} shared a kiss at his beach party.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Chan",
          "key": "${link_1}",
          "target": {
            "href": "Chan",
            "page": "Chan"
          }
        }
      ],
      "text": "Azula and Chan shared a kiss at his beach party."
    },
    {
      "body": "${link_0} and Azula had only a brief relationship. Upon arriving at Chan's party, Azula gave him a surprisingly long and confusing compliment on his suit which Chan seemed to find odd. Nonetheless, the two later shared a romantic evening while stargazing on Chan's porch. They kissed with Chan remarking afterward that Azula was pretty. Azula, being inexperienced with romance, went back to her comfort zone of manipulation and domination of others and stated, \"Together, you and I will be the strongest couple in the entire world! We will dominate the Earth!\" This statement, coupled by a display of Azula's blue fire, frightened Chan and he went sheepishly back in the house, leaving behind a disappointed Azula. After some time with her friends on the beach, Azula exacted revenge on Chan by ransacking his house along with the others, leaving Chan sobbing. Azula did not meet Chan again afterward.",
      "links": [
        {
          "body": "Chan",
          "key": "${link_0}",
          "target": {
            "href": "Chan",
            "page": "Chan"
          }
        }
      ],
      "text": "Chan and Azula had only a brief relationship. Upon arriving at Chan's party, Azula gave him a surprisingly long and confusing compliment on his suit which Chan seemed to find odd. Nonetheless, the two later shared a romantic evening while stargazing on Chan's porch. They kissed with Chan remarking afterward that Azula was pretty. Azula, being inexperienced with romance, went back to her comfort zone of manipulation and domination of others and stated, \"Together, you and I will be the strongest couple in the entire world! We will dominate the Earth!\" This statement, coupled by a display of Azula's blue fire, frightened Chan and he went sheepishly back in the house, leaving behind a disappointed Azula. After some time with her friends on the beach, Azula exacted revenge on Chan by ransacking his house along with the others, leaving Chan sobbing. Azula did not meet Chan again afterward."
    },
    {
      "body": "${link_0} and ${link_1} frequently faced off against each other.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Azula and Aang frequently faced off against each other."
    },
    {
      "body": "${link_0}, being the Avatar, had, along with Azula's brother and uncle, become the princess' target. In early encounters, she nearly managed to defeat him, typically forcing him to flee. Later on, however, he proved that, with his newly learned ${link_1}, he could stand a chance against her. Aang defeated her in a battle atop the ${link_2} with some aid from ${link_3}, though the victory was hard-fought. In the ${link_4}, she, alongside Zuko, faced Aang again, who was aided by Katara. After a long battle and being outnumbered with the recent arrival of the ${link_5}, Aang attempted to enter the Avatar State only to be struck by a lightning bolt fired by Azula before he could complete the transformation.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "bending skills",
          "key": "${link_1}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Fire Nation drill",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        },
        {
          "body": "Momo",
          "key": "${link_3}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        },
        {
          "body": "Crystal Catacombs",
          "key": "${link_4}",
          "target": {
            "href": "Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_5}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "Aang, being the Avatar, had, along with Azula's brother and uncle, become the princess' target. In early encounters, she nearly managed to defeat him, typically forcing him to flee. Later on, however, he proved that, with his newly learned bending skills, he could stand a chance against her. Aang defeated her in a battle atop the Fire Nation drill with some aid from Momo, though the victory was hard-fought. In the Crystal Catacombs, she, alongside Zuko, faced Aang again, who was aided by Katara. After a long battle and being outnumbered with the recent arrival of the Dai Li, Aang attempted to enter the Avatar State only to be struck by a lightning bolt fired by Azula before he could complete the transformation."
    },
    {
      "body": "When Azula and Zuko returned home, Azula informed Fire Lord Ozai that it was Zuko who killed the Avatar, shielding herself in the event that the Avatar survived the attack.",
      "links": [],
      "text": "When Azula and Zuko returned home, Azula informed Fire Lord Ozai that it was Zuko who killed the Avatar, shielding herself in the event that the Avatar survived the attack."
    },
    {
      "body": "During the eclipse, Azula battled Aang once again, revealing her knowledge of his survival from the attack. She ordered her Dai Li agents to assail Aang and his group, stalling them during the eclipse. Aang eventually ceased to chase Azula, wishing to face the Fire Lord. His attempts end in failure, however, when Azula distracted Sokka during the last moments of the eclipse, ruining the attack and forcing them to abandon the mission.",
      "links": [],
      "text": "During the eclipse, Azula battled Aang once again, revealing her knowledge of his survival from the attack. She ordered her Dai Li agents to assail Aang and his group, stalling them during the eclipse. Aang eventually ceased to chase Azula, wishing to face the Fire Lord. His attempts end in failure, however, when Azula distracted Sokka during the last moments of the eclipse, ruining the attack and forcing them to abandon the mission."
    },
    {
      "body": "Azula did not meet Aang again until her assault of the Western Air Temple, however, her prime focus lay in eliminating Zuko who had indirectly caused her former friends, Mai and Ty Lee, to betray her. Zuko held off Azula long enough for Aang to escape.",
      "links": [],
      "text": "Azula did not meet Aang again until her assault of the Western Air Temple, however, her prime focus lay in eliminating Zuko who had indirectly caused her former friends, Mai and Ty Lee, to betray her. Zuko held off Azula long enough for Aang to escape."
    },
    {
      "body": "This was the last time Aang and Azula would face each other before the end of the War. While Aang fought Fire Lord Ozai upon the arrival of Sozin's Comet, Azula was finally defeated by Zuko and Katara. Of all Aang's enemies, Azula was the only one who was successful in killing him. Azula's bolt of lightning cut off Aang's connection with his past lives, blocking his connection to the Avatar State until it was later accidentally restored during his fight with Ozai. Azula proved a competent opponent for Aang in their few face-to-face battles, even forcing Aang on the defensive when he used two elements at once, a testament to her level of skill.",
      "links": [],
      "text": "This was the last time Aang and Azula would face each other before the end of the War. While Aang fought Fire Lord Ozai upon the arrival of Sozin's Comet, Azula was finally defeated by Zuko and Katara. Of all Aang's enemies, Azula was the only one who was successful in killing him. Azula's bolt of lightning cut off Aang's connection with his past lives, blocking his connection to the Avatar State until it was later accidentally restored during his fight with Ozai. Azula proved a competent opponent for Aang in their few face-to-face battles, even forcing Aang on the defensive when he used two elements at once, a testament to her level of skill."
    },
    {
      "body": "The two encountered each other again a year after the War's conclusion, when Zuko summoned Team Avatar to the Royal Palace to announce his intention to search for his mother ${link_0}. When Azula entered the room, Aang was immediately alarmed and adapted a defensive stance, warning Azula that he did not want to harm her. Azula was not impressed by the Avatar at all and stood by uninterested as Zuko explained the situation to his friends. Following that little scuffle, Azula completely brushed off Aang's efforts to get along with her, commanding him to be careful with her luggage and mocking the group at every opportunity.",
      "links": [
        {
          "body": "Ursa",
          "key": "${link_0}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        }
      ],
      "text": "The two encountered each other again a year after the War's conclusion, when Zuko summoned Team Avatar to the Royal Palace to announce his intention to search for his mother Ursa. When Azula entered the room, Aang was immediately alarmed and adapted a defensive stance, warning Azula that he did not want to harm her. Azula was not impressed by the Avatar at all and stood by uninterested as Zuko explained the situation to his friends. Following that little scuffle, Azula completely brushed off Aang's efforts to get along with her, commanding him to be careful with her luggage and mocking the group at every opportunity."
    },
    {
      "body": "During their journey toward Hira'a, Aang remained on guard in her presence in case she tried to attack them in any way, but still was willing to give her chance to find peace with herself by finding Ursa. When the group encountered a wolf spirit, Azula leaped off of Appa to forge on by herself, prompting Aang to glide in and rescue her only for her to torch his glider in mid-flight. Even though Azula later saved the team from a swarm of moth wasps, relations between Aang and Azula remained tense with her routinely rejecting his attempts to make peace with her and forcing him to remain on guard as they proceeded closer to Ursa's hometown.",
      "links": [],
      "text": "During their journey toward Hira'a, Aang remained on guard in her presence in case she tried to attack them in any way, but still was willing to give her chance to find peace with herself by finding Ursa. When the group encountered a wolf spirit, Azula leaped off of Appa to forge on by herself, prompting Aang to glide in and rescue her only for her to torch his glider in mid-flight. Even though Azula later saved the team from a swarm of moth wasps, relations between Aang and Azula remained tense with her routinely rejecting his attempts to make peace with her and forcing him to remain on guard as they proceeded closer to Ursa's hometown."
    },
    {
      "body": "After Azula ran away and vanished into Forgetful Valley, Aang voiced his optimism that Azula could change, citing her leaving behind the letter incriminating Zuko as illegitimate as proof. Sokka thought she just dropped it by accident, but Aang insisted that he believed she meant to do it.",
      "links": [],
      "text": "After Azula ran away and vanished into Forgetful Valley, Aang voiced his optimism that Azula could change, citing her leaving behind the letter incriminating Zuko as illegitimate as proof. Sokka thought she just dropped it by accident, but Aang insisted that he believed she meant to do it."
    },
    {
      "body": "Aang, being the reincarnation of Azula's maternal great-grandfather Avatar Roku, is Azula's spiritual relative.",
      "links": [],
      "text": "Aang, being the reincarnation of Azula's maternal great-grandfather Avatar Roku, is Azula's spiritual relative."
    },
    {
      "body": "${link_0} was defeated by ${link_1} during the ${link_2}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Comet-Enhanced Agni Kai",
          "key": "${link_2}",
          "target": {
            "href": "Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        }
      ],
      "text": "Azula was defeated by Katara during the Comet-Enhanced Agni Kai."
    },
    {
      "body": "Katara and Azula's relationship was limited to them being enemies and interactions limited to fights. During the ${link_0}, Azula attempted to strike her when Katara prevented her from capturing Aang. Shortly before the Coup of Ba Sing Se, Katara realized that the woman who was allegedly ${link_1} was actually Azula in disguise after seeing the color of her eyes. The two battled in the crystal catacombs of Ba Sing Se; in the first part of the battle, Azula was outmatched by Katara, who managed to briefly subdue Azula with water tentacles, until Zuko freed his sister from Katara's grasp and started fighting her instead.",
      "links": [
        {
          "body": "Confrontation at Tu Zin",
          "key": "${link_0}",
          "target": {
            "href": "Confrontation_at_Tu_Zin",
            "page": "Confrontation_at_Tu_Zin"
          }
        },
        {
          "body": "Suki",
          "key": "${link_1}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        }
      ],
      "text": "Katara and Azula's relationship was limited to them being enemies and interactions limited to fights. During the Confrontation at Tu Zin, Azula attempted to strike her when Katara prevented her from capturing Aang. Shortly before the Coup of Ba Sing Se, Katara realized that the woman who was allegedly Suki was actually Azula in disguise after seeing the color of her eyes. The two battled in the crystal catacombs of Ba Sing Se; in the first part of the battle, Azula was outmatched by Katara, who managed to briefly subdue Azula with water tentacles, until Zuko freed his sister from Katara's grasp and started fighting her instead."
    },
    {
      "body": "When Zuko decided to face Azula in an final battle to decide who would be Fire Lord, he asked Katara to join him to which she happily complied. When Zuko and Azula battled at the ${link_0}, Azula attempted to shoot Katara with lightning after Zuko taunted her, however, Zuko threw himself in the lightning's path and Katara escaped uninjured. Azula relentlessly pursued Katara in an attempt to strike her down with the waterbender proving to be an even foe. Azula was eventually frozen in a block of ice, which enabled Katara to chain her down to the grid below. As Katara liquidated the water, Azula was rendered defenseless; her defeat driving her entirely into madness. Katara watched sadly alongside Zuko as Azula thrashed around, screaming and crying, indicating that Katara did have sympathy, or at least pity, for Azula in the end.",
      "links": [
        {
          "body": "Fire Nation Capital",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        }
      ],
      "text": "When Zuko decided to face Azula in an final battle to decide who would be Fire Lord, he asked Katara to join him to which she happily complied. When Zuko and Azula battled at the Fire Nation Capital, Azula attempted to shoot Katara with lightning after Zuko taunted her, however, Zuko threw himself in the lightning's path and Katara escaped uninjured. Azula relentlessly pursued Katara in an attempt to strike her down with the waterbender proving to be an even foe. Azula was eventually frozen in a block of ice, which enabled Katara to chain her down to the grid below. As Katara liquidated the water, Azula was rendered defenseless; her defeat driving her entirely into madness. Katara watched sadly alongside Zuko as Azula thrashed around, screaming and crying, indicating that Katara did have sympathy, or at least pity, for Azula in the end."
    },
    {
      "body": "A year later, tensions between the two girls were still high, as Katara did not hesitate to attack Azula the moment she showed up at the Fire Nation palace, not awaiting Zuko's explanation for why his sister was there. Katara eventually agreed to let Azula come on the quest for Ursa with them, though expressed her severe concerns nonetheless and was constantly on guard around the Fire Nation princess. The moment Azula stepped out of line, Katara would act fiercely and decisively, not hesitating to immobilize her with her waterbending. When Azula singed Aang's glider, causing him to crash, Katara berated the princess, though Azula never seemed to care much as she saw Katara to be a \"snow peasant\", and an \"uneducated coconspirator\" of Ursa, there to take her down.",
      "links": [],
      "text": "A year later, tensions between the two girls were still high, as Katara did not hesitate to attack Azula the moment she showed up at the Fire Nation palace, not awaiting Zuko's explanation for why his sister was there. Katara eventually agreed to let Azula come on the quest for Ursa with them, though expressed her severe concerns nonetheless and was constantly on guard around the Fire Nation princess. The moment Azula stepped out of line, Katara would act fiercely and decisively, not hesitating to immobilize her with her waterbending. When Azula singed Aang's glider, causing him to crash, Katara berated the princess, though Azula never seemed to care much as she saw Katara to be a \"snow peasant\", and an \"uneducated coconspirator\" of Ursa, there to take her down."
    },
    {
      "body": "Azula and Katara engaged each other in shouting matches on the way to Forgetful Valley, arguments which prompted Zuko to say that the journey would end once they reached the valley. After Azula ran away and disappeared into Forgetful Valley, while Aang and Sokka disagreed on whether or not Azula was starting to change her ways, Katara stayed neutral in the matter.",
      "links": [],
      "text": "Azula and Katara engaged each other in shouting matches on the way to Forgetful Valley, arguments which prompted Zuko to say that the journey would end once they reached the valley. After Azula ran away and disappeared into Forgetful Valley, while Aang and Sokka disagreed on whether or not Azula was starting to change her ways, Katara stayed neutral in the matter."
    },
    {
      "body": "During the Hundred Year War, Azula never referred to Katara by name, but did so for the first time on the way to Hira'a when she was distracted by a hallucination of her mother.",
      "links": [],
      "text": "During the Hundred Year War, Azula never referred to Katara by name, but did so for the first time on the way to Hira'a when she was distracted by a hallucination of her mother."
    },
    {
      "body": "${link_0} and ${link_1} encountered the ${link_2}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "her friends",
          "key": "${link_1}",
          "target": {
            "href": "Azula%27s_team",
            "page": "Azula%27s_team"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_2}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        }
      ],
      "text": "Azula and her friends encountered the Kyoshi Warriors."
    },
    {
      "body": "Azula and her team of friends encountered the ${link_0} in a forest; the band of warriors, at that time, were caring for ${link_1}. The warriors took fighting stances, preparing to defend themselves and Appa to which Azula mockingly asked whether they were the Avatar's \"fangirls\". Although their leader, Suki, tried to deter them by saying the Avatar was not with them, Azula refused to back off, claiming that any friend of the Avatar's was an enemy of hers. She, Mai and Ty Lee briefly engaged in a fight with the Kyoshi Warriors.",
      "links": [
        {
          "body": "Kyoshi Warriors",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Azula and her team of friends encountered the Kyoshi Warriors in a forest; the band of warriors, at that time, were caring for Appa. The warriors took fighting stances, preparing to defend themselves and Appa to which Azula mockingly asked whether they were the Avatar's \"fangirls\". Although their leader, Suki, tried to deter them by saying the Avatar was not with them, Azula refused to back off, claiming that any friend of the Avatar's was an enemy of hers. She, Mai and Ty Lee briefly engaged in a fight with the Kyoshi Warriors."
    },
    {
      "body": "With Mai's knife-throwing skills, Ty Lee's ${link_0} skills and Azula's prodigious firebending, all the warriors were quickly defeated until Suki remained the last one standing. She was momentarily distracted by Appa's escape from the fight until Azula resumed attacking her once more. Suki withdrew one of her fans, however, Azula calmly stated, \"Don't you know fans just make flames stronger?\" and the two began to fight. Suki was finally defeated and captured while Azula's team stole some of their clothing, using it to disguise themselves as Kyoshi Warriors and infiltrate Ba Sing Se.",
      "links": [
        {
          "body": "chi blocking",
          "key": "${link_0}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        }
      ],
      "text": "With Mai's knife-throwing skills, Ty Lee's chi blocking skills and Azula's prodigious firebending, all the warriors were quickly defeated until Suki remained the last one standing. She was momentarily distracted by Appa's escape from the fight until Azula resumed attacking her once more. Suki withdrew one of her fans, however, Azula calmly stated, \"Don't you know fans just make flames stronger?\" and the two began to fight. Suki was finally defeated and captured while Azula's team stole some of their clothing, using it to disguise themselves as Kyoshi Warriors and infiltrate Ba Sing Se."
    },
    {
      "body": "During the eclipse, Sokka, ${link_0} and Aang managed to corner Azula. Powerless because of the eclipse, Azula used her knowledge of Sokka's relationship with Suki to goad him in to attacking her by saying she was alive and imprisoned, but had given up any hope of Sokka rescuing her. Sokka's reaction provided enough time for the eclipse to end, thus foiling Team Avatar's plans.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "During the eclipse, Sokka, Toph and Aang managed to corner Azula. Powerless because of the eclipse, Azula used her knowledge of Sokka's relationship with Suki to goad him in to attacking her by saying she was alive and imprisoned, but had given up any hope of Sokka rescuing her. Sokka's reaction provided enough time for the eclipse to end, thus foiling Team Avatar's plans."
    },
    {
      "body": "Suki, while wary of Azula when she was released to join Zuko, Aang, Katara, and Sokka on the search for Ursa, did not seem to have any great fear of her, as indicated when she verbally scolded Azula for being insensitive toward Appa.",
      "links": [],
      "text": "Suki, while wary of Azula when she was released to join Zuko, Aang, Katara, and Sokka on the search for Ursa, did not seem to have any great fear of her, as indicated when she verbally scolded Azula for being insensitive toward Appa."
    },
    {
      "body": "${link_0} zapped ${link_1} after he pulled out his ${link_2} on her.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "boomerang",
          "key": "${link_2}",
          "target": {
            "href": "Sokka%27s_weapons#Boomerang",
            "page": "Sokka%27s_weapons"
          }
        }
      ],
      "text": "Azula zapped Sokka after he pulled out his boomerang on her."
    },
    {
      "body": "Sokka and Azula's relationship was limited to their status as enemies, though she finds him annoying. The two first met in ${link_0}; when they encountered each other again, Sokka engaged her in a fight. The two have rarely conversed, however, that changed when Azula hindered Team Avatar's efforts to find the Fire Lord. She decided to further her efforts by taking advantage of Sokka's emotions, revealing that she knew his name and that her \"favorite prisoner\", being Suki, talked about him consistently. She falsely claimed that Suki gave up on the chance of Sokka ever coming to rescue her, prompting him to attack the princess in a blind and emotional rage. She attempted to injure/kill him with a concealed shuriken knife, however, Toph intervened and pinned her to the wall. Sokka demanded to know where Suki was being held captive, however, Azula said nothing and escaped once the eclipse ended. This incident left the two even more bitter toward each other than before.",
      "links": [
        {
          "body": "Omashu",
          "key": "${link_0}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        }
      ],
      "text": "Sokka and Azula's relationship was limited to their status as enemies, though she finds him annoying. The two first met in Omashu; when they encountered each other again, Sokka engaged her in a fight. The two have rarely conversed, however, that changed when Azula hindered Team Avatar's efforts to find the Fire Lord. She decided to further her efforts by taking advantage of Sokka's emotions, revealing that she knew his name and that her \"favorite prisoner\", being Suki, talked about him consistently. She falsely claimed that Suki gave up on the chance of Sokka ever coming to rescue her, prompting him to attack the princess in a blind and emotional rage. She attempted to injure/kill him with a concealed shuriken knife, however, Toph intervened and pinned her to the wall. Sokka demanded to know where Suki was being held captive, however, Azula said nothing and escaped once the eclipse ended. This incident left the two even more bitter toward each other than before."
    },
    {
      "body": "Azula attempted to stop Sokka and Zuko from fleeing the Boiling Rock Prison. During this engagement, Sokka freed Suki and proved an equal match for Azula, evenly taking on her firebending with his swordsmanship and additional support from Zuko.",
      "links": [],
      "text": "Azula attempted to stop Sokka and Zuko from fleeing the Boiling Rock Prison. During this engagement, Sokka freed Suki and proved an equal match for Azula, evenly taking on her firebending with his swordsmanship and additional support from Zuko."
    },
    {
      "body": "Sokka's last encounter with Azula before the War's end was during her ambush on the Western Air Temple.",
      "links": [],
      "text": "Sokka's last encounter with Azula before the War's end was during her ambush on the Western Air Temple."
    },
    {
      "body": "A year after the War ended, Sokka still harbored resentment toward the princess, as he was quick to draw his boomerang to attack her when he saw her. Since she constantly belittled him, Sokka was opposed to the idea of letting her come on their journey to Hira'a, though complied for Zuko's sake. Azula zapped Sokka's boomerang with a small, quick lightning bolt, knocking him over, when he tried to assert his authority on the princess, threatening her with the weapon. During the journey, Sokka was especially wary of Azula's presence, with the princess routinely mocking him and the team and accusing them of conspiring with Ursa to destroy her.",
      "links": [],
      "text": "A year after the War ended, Sokka still harbored resentment toward the princess, as he was quick to draw his boomerang to attack her when he saw her. Since she constantly belittled him, Sokka was opposed to the idea of letting her come on their journey to Hira'a, though complied for Zuko's sake. Azula zapped Sokka's boomerang with a small, quick lightning bolt, knocking him over, when he tried to assert his authority on the princess, threatening her with the weapon. During the journey, Sokka was especially wary of Azula's presence, with the princess routinely mocking him and the team and accusing them of conspiring with Ursa to destroy her."
    },
    {
      "body": "After Azula dropped Ursa's letter to Ikem and vanished into Forgetful Valley, Sokka believed that she only did so on accident, believing Azula to be incapable of caring for Zuko, unlike Aang and Zuko himself.",
      "links": [],
      "text": "After Azula dropped Ursa's letter to Ikem and vanished into Forgetful Valley, Sokka believed that she only did so on accident, believing Azula to be incapable of caring for Zuko, unlike Aang and Zuko himself."
    },
    {
      "body": "${link_0} fought ${link_1} during the ${link_2}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "text": "Azula fought Toph during the invasion of the Fire Nation."
    },
    {
      "body": "Azula first encountered Toph when she and her friends, Mai and Ty Lee, were following Team Avatar. Later, at the ghost town of ${link_0}, Toph helped the team by knocking Azula down with ${link_1}. After being cornered by Aang, Katara, Sokka, Toph, Zuko, and Iroh, she shot a bolt of lightning at Iroh, distracting the others for a brief moment, thus managing to escape.",
      "links": [
        {
          "body": "Tu Zin",
          "key": "${link_0}",
          "target": {
            "href": "Tu_Zin",
            "page": "Tu_Zin"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Azula first encountered Toph when she and her friends, Mai and Ty Lee, were following Team Avatar. Later, at the ghost town of Tu Zin, Toph helped the team by knocking Azula down with earthbending. After being cornered by Aang, Katara, Sokka, Toph, Zuko, and Iroh, she shot a bolt of lightning at Iroh, distracting the others for a brief moment, thus managing to escape."
    },
    {
      "body": "During the eclipse, Aang, Sokka and Toph traveled together to find Fire Lord Ozai in order to defeat him and end the war. They infiltrated a large metal bunker, thought to conceal Ozai, only to discover Azula waiting for them. Azula's immunity to sending a bodily reaction when lying rendered Toph's ability to detect fibs useless during their interrogation of Azula as to Ozai's whereabouts. At one point, Azula prompted Sokka to charge at her in blind rage and prepared to strike him with a shuriken dagger. Toph sensed the hidden danger, however, and intervened, pinning Azula's hands to the wall. She, along with the others, abandoned their search for Ozai after the eclipse ended and Azula escaped.",
      "links": [],
      "text": "During the eclipse, Aang, Sokka and Toph traveled together to find Fire Lord Ozai in order to defeat him and end the war. They infiltrated a large metal bunker, thought to conceal Ozai, only to discover Azula waiting for them. Azula's immunity to sending a bodily reaction when lying rendered Toph's ability to detect fibs useless during their interrogation of Azula as to Ozai's whereabouts. At one point, Azula prompted Sokka to charge at her in blind rage and prepared to strike him with a shuriken dagger. Toph sensed the hidden danger, however, and intervened, pinning Azula's hands to the wall. She, along with the others, abandoned their search for Ozai after the eclipse ended and Azula escaped."
    },
    {
      "body": "The last time Toph encountered Azula was during the latter's assault on the Western Air Temple. However, Azula was primarily targeting Zuko and did not attack nor interact with any of the other members of the group.",
      "links": [],
      "text": "The last time Toph encountered Azula was during the latter's assault on the Western Air Temple. However, Azula was primarily targeting Zuko and did not attack nor interact with any of the other members of the group."
    },
    {
      "body": "One of ${link_0} was banished by ${link_1}.",
      "links": [
        {
          "body": "Lo and Li",
          "key": "${link_0}",
          "target": {
            "href": "Lo_and_Li",
            "page": "Lo_and_Li"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "One of Lo and Li was banished by Azula."
    },
    {
      "body": "The twins, ${link_0}, had earned Azula's respect, trust and consideration. The sisters often helped Azula by offering her advice on a situation, such as when they gave her advice on the pursuit of her brother and uncle. Being Azula's ${link_1} they often evaluated her bending abilities, such as during her lightning generation practice",
      "links": [
        {
          "body": "Lo and Li",
          "key": "${link_0}",
          "target": {
            "href": "Lo_and_Li",
            "page": "Lo_and_Li"
          }
        },
        {
          "body": "firebending teachers",
          "key": "${link_1}",
          "target": {
            "href": "Firebending_training",
            "page": "Firebending_training"
          }
        }
      ],
      "text": "The twins, Lo and Li, had earned Azula's respect, trust and consideration. The sisters often helped Azula by offering her advice on a situation, such as when they gave her advice on the pursuit of her brother and uncle. Being Azula's firebending teachers they often evaluated her bending abilities, such as during her lightning generation practice"
    },
    {
      "body": "While on Ember Island, Azula stayed at the sisters' cottage, along with Zuko, Mai and Ty Lee. While there, Lo and Li both behaved in a more relaxed manner, while still offering advice on personal matters. During Azula's descent to madness, the sisters approached her, concerned for her mental state. Azula believed her father had ordered them to keep an eye on her and stated she would be the greatest Fire Lord in history. When the sisters both suggested she postpone her coronation due to recent events, Azula lashed at them, demanding to know which of the two suggested that. When neither took a stand, Azula ordered them to fight an Agni Kai, forgetting that neither of them were firebenders. She proceeded to banish Lo, while pointing to Li and stated Li, pointing to Lo, could stay. Azula left, leaving the sisters confused as to who was banished.",
      "links": [],
      "text": "While on Ember Island, Azula stayed at the sisters' cottage, along with Zuko, Mai and Ty Lee. While there, Lo and Li both behaved in a more relaxed manner, while still offering advice on personal matters. During Azula's descent to madness, the sisters approached her, concerned for her mental state. Azula believed her father had ordered them to keep an eye on her and stated she would be the greatest Fire Lord in history. When the sisters both suggested she postpone her coronation due to recent events, Azula lashed at them, demanding to know which of the two suggested that. When neither took a stand, Azula ordered them to fight an Agni Kai, forgetting that neither of them were firebenders. She proceeded to banish Lo, while pointing to Li and stated Li, pointing to Lo, could stay. Azula left, leaving the sisters confused as to who was banished."
    },
    {
      "body": "${link_0} joined ${link_1} for the possible exchange of ${link_2} in ${link_3}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Mai",
          "key": "${link_1}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_2}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "New Ozai",
          "key": "${link_3}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        }
      ],
      "text": "Azula joined Mai for the possible exchange of Bumi in New Ozai."
    },
    {
      "body": "Mai and Azula were friends from a young age, much like Azula and Ty Lee. However, Azula seemingly treated Mai with as little concern as she did Ty Lee, taking every opportunity to embarrass her about her crush on Zuko. Throughout their childhood, Azula was known for trickery, causing Zuko and Mai to fall into a fountain together for the sole purpose of embarrassing them. In their teenage years, however, Azula treated Mai with slightly more respect, greeting one another with familiarity and humor when the princess met up with Mai in Omashu to start her hunt for Iroh, Zuko and later Aang.",
      "links": [],
      "text": "Mai and Azula were friends from a young age, much like Azula and Ty Lee. However, Azula seemingly treated Mai with as little concern as she did Ty Lee, taking every opportunity to embarrass her about her crush on Zuko. Throughout their childhood, Azula was known for trickery, causing Zuko and Mai to fall into a fountain together for the sole purpose of embarrassing them. In their teenage years, however, Azula treated Mai with slightly more respect, greeting one another with familiarity and humor when the princess met up with Mai in Omashu to start her hunt for Iroh, Zuko and later Aang."
    },
    {
      "body": "While respecting the princess for her battlefield prowess and cunning, Mai often demonstrated her lack of fear for Azula, shown when she refused an order from Azula to chase Sokka and Katara in the drill's waste system. She openly defied the command and nonchalantly stated, \"She can shoot all the lightning she wants at me - I am not going in that wall sludge juice.\" During the Coup of Ba Sing Se, she allowed Sokka, Toph and the ${link_0} to escape with the ${link_1}'s pet bear, ${link_2}, due to a lack of commitment in tending to the bear's needs. However, these incidents had occurred in the absence of Azula; it is not known how Mai would have acted if the princess was present. Mai was seemingly hesitant to defy the princess outright, although still gave Azula dark looks when the princess's back was turned.",
      "links": [
        {
          "body": "Earth King",
          "key": "${link_0}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Kuei",
          "key": "${link_1}",
          "target": {
            "href": "Kuei",
            "page": "Kuei"
          }
        },
        {
          "body": "Bosco",
          "key": "${link_2}",
          "target": {
            "href": "Bosco",
            "page": "Bosco"
          }
        }
      ],
      "text": "While respecting the princess for her battlefield prowess and cunning, Mai often demonstrated her lack of fear for Azula, shown when she refused an order from Azula to chase Sokka and Katara in the drill's waste system. She openly defied the command and nonchalantly stated, \"She can shoot all the lightning she wants at me - I am not going in that wall sludge juice.\" During the Coup of Ba Sing Se, she allowed Sokka, Toph and the Earth King to escape with the Kuei's pet bear, Bosco, due to a lack of commitment in tending to the bear's needs. However, these incidents had occurred in the absence of Azula; it is not known how Mai would have acted if the princess was present. Mai was seemingly hesitant to defy the princess outright, although still gave Azula dark looks when the princess's back was turned."
    },
    {
      "body": "Their friendship ended when Mai chose to aid Zuko's prison escape by restarting his gondola and defeating the guards that were attempting to cut its line. Azula questioned her intently as to why she aided him, telling her, \"You know the consequences.\" When Mai coolly suggested that Azula miscalculated and declared she loved Zuko more than she feared Azula, the princess lost herself in a rage, attempting to murder Mai with her firebending. However, Ty Lee saved Mai, in turn betraying Azula as well. Azula promptly had them both arrested, severing her friendship with them. After the war, Ty Lee and Mai were released from prison. Mai reunited with Zuko and they became a happy couple.",
      "links": [],
      "text": "Their friendship ended when Mai chose to aid Zuko's prison escape by restarting his gondola and defeating the guards that were attempting to cut its line. Azula questioned her intently as to why she aided him, telling her, \"You know the consequences.\" When Mai coolly suggested that Azula miscalculated and declared she loved Zuko more than she feared Azula, the princess lost herself in a rage, attempting to murder Mai with her firebending. However, Ty Lee saved Mai, in turn betraying Azula as well. Azula promptly had them both arrested, severing her friendship with them. After the war, Ty Lee and Mai were released from prison. Mai reunited with Zuko and they became a happy couple."
    },
    {
      "body": "Mai's betrayal of Azula might be seen as the catalyst for Azula's downfall, as it was her actions that led to Ty Lee's betrayal and Azula's fall into insanity, although it was Ozai's abandonment of her that gave the final push.",
      "links": [],
      "text": "Mai's betrayal of Azula might be seen as the catalyst for Azula's downfall, as it was her actions that led to Ty Lee's betrayal and Azula's fall into insanity, although it was Ozai's abandonment of her that gave the final push."
    },
    {
      "body": "In the year following the War's end, Azula had not seen Mai again, though in her madness, she accused Mai, along with Ty Lee and Zuko, to be co-conspirators of Ursa, all having plotted to destroy her.",
      "links": [],
      "text": "In the year following the War's end, Azula had not seen Mai again, though in her madness, she accused Mai, along with Ty Lee and Zuko, to be co-conspirators of Ursa, all having plotted to destroy her."
    },
    {
      "body": "${link_0} reunited with ${link_1} at the ${link_2}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_1}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Fire Nation circus",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation_circus",
            "page": "Fire_Nation_circus"
          }
        }
      ],
      "text": "Azula reunited with Ty Lee at the Fire Nation circus."
    },
    {
      "body": "Ty Lee regarded Azula as a friend and even openly displayed admiration for her. However, even since they were children, she had not treated Ty Lee as such. Because Azula could not stand to be secondary in skill, even as a child, she shoved Ty Lee to the ground when she was outdone by her friend in acrobatics. Azula also pressured an unwilling Ty Lee into joining her search for the Avatar, her brother, and uncle during her friend's performance, forcing the ${link_0} to set fire to the net underneath her and releasing the most dangerous animals the ${link_1} had. She laughed when Zuko called Ty Lee a \"circus freak\", although later displayed some concern about Ty Lee's unpleasant childhood. Despite this, Azula was known to be occasionally respectful and somewhat caring toward Ty Lee. When she made Ty Lee cry by telling her that no boy cared for her as a person, she apologized quickly and admitted it was her own insecurity that shaped that comment.",
      "links": [
        {
          "body": "ringmaster",
          "key": "${link_0}",
          "target": {
            "href": "Circus_master",
            "page": "Circus_master"
          }
        },
        {
          "body": "circus",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_circus",
            "page": "Fire_Nation_circus"
          }
        }
      ],
      "text": "Ty Lee regarded Azula as a friend and even openly displayed admiration for her. However, even since they were children, she had not treated Ty Lee as such. Because Azula could not stand to be secondary in skill, even as a child, she shoved Ty Lee to the ground when she was outdone by her friend in acrobatics. Azula also pressured an unwilling Ty Lee into joining her search for the Avatar, her brother, and uncle during her friend's performance, forcing the ringmaster to set fire to the net underneath her and releasing the most dangerous animals the circus had. She laughed when Zuko called Ty Lee a \"circus freak\", although later displayed some concern about Ty Lee's unpleasant childhood. Despite this, Azula was known to be occasionally respectful and somewhat caring toward Ty Lee. When she made Ty Lee cry by telling her that no boy cared for her as a person, she apologized quickly and admitted it was her own insecurity that shaped that comment."
    },
    {
      "body": "Like her friendship with Mai, Azula's relationship with Ty Lee also came to an end. In the midst of Mai saving Zuko and in turn, betraying Azula, Ty Lee saved Mai from being struck down by Azula by attacking Azula's pressure points, temporarily paralyzing her.",
      "links": [],
      "text": "Like her friendship with Mai, Azula's relationship with Ty Lee also came to an end. In the midst of Mai saving Zuko and in turn, betraying Azula, Ty Lee saved Mai from being struck down by Azula by attacking Azula's pressure points, temporarily paralyzing her."
    },
    {
      "body": "Ty Lee and Azula would meet face to face once again a year later when Ty Lee and Suki were assigned to guard the princess during her conversation with Ozai about Ursa's whereabouts. When Azula instead knocked Zuko over, Ty Lee did not hesitate to chi block her former friend. Azula immediately recognized her and in her madness called her a \"co-conspirator\" of Ursa, wondering how Ursa had been able to overturn the fear for her that Ty Lee used to feel, something Ty Lee immediately declared to be nonsense. The two no longer held any real affection for each other, with Ty Lee stating that she still feared Azula even now, and later openly asking Azula why she was so mean all the time.",
      "links": [],
      "text": "Ty Lee and Azula would meet face to face once again a year later when Ty Lee and Suki were assigned to guard the princess during her conversation with Ozai about Ursa's whereabouts. When Azula instead knocked Zuko over, Ty Lee did not hesitate to chi block her former friend. Azula immediately recognized her and in her madness called her a \"co-conspirator\" of Ursa, wondering how Ursa had been able to overturn the fear for her that Ty Lee used to feel, something Ty Lee immediately declared to be nonsense. The two no longer held any real affection for each other, with Ty Lee stating that she still feared Azula even now, and later openly asking Azula why she was so mean all the time."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Azula%27s_relationships",
    "file": "avatar.wikia.com/wiki/Azula's_relationships.html",
    "page": "Azula's_relationships",
    "title": "Azula's relationships"
  }
}