{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Flora",
      "target": {
        "href": "Category_Flora",
        "page": "Category_Flora"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "href": "Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The banyan-grove tree looms over the ${link_0}.",
      "links": [
        {
          "body": "Foggy Swamp",
          "key": "${link_0}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        }
      ],
      "text": "The banyan-grove tree looms over the Foggy Swamp."
    },
    {
      "body": "The ancient banyan-grove tree is a single, enormous ${link_0} that stands in the middle of the ${link_1} with a root system stretching for many miles. Over time, the tree's roots have spread across the entirety of the swamp and created shoots which have propagated an entire forest of new trees. The banyan-grove tree and the swamp are protected by ${link_2}, a ${link_3} who claimed to have attained enlightenment beneath its branches.",
      "links": [
        {
          "body": "tree",
          "key": "${link_0}",
          "target": {
            "href": "Flora_in_the_World_of_Avatar",
            "page": "Flora_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Foggy Swamp",
          "key": "${link_1}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "Huu",
          "key": "${link_2}",
          "target": {
            "href": "Huu",
            "page": "Huu"
          }
        },
        {
          "body": "waterbender",
          "key": "${link_3}",
          "target": {
            "href": "Waterbending#Notable_waterbenders",
            "page": "Waterbending"
          }
        }
      ],
      "text": "The ancient banyan-grove tree is a single, enormous tree that stands in the middle of the Foggy Swamp with a root system stretching for many miles. Over time, the tree's roots have spread across the entirety of the swamp and created shoots which have propagated an entire forest of new trees. The banyan-grove tree and the swamp are protected by Huu, a waterbender who claimed to have attained enlightenment beneath its branches."
    },
    {
      "body": "After a tornado spontaneously formed and caused ${link_0} to crash into the swamp, ${link_1}, ${link_2}, and ${link_3} were separated from their animal companions. At night, ${link_4}'s search for Appa and ${link_5} was disrupted by moving vines, causing them to be separated from each other as well. Wandering through the mysterious swamp, they each started to hallucinate. Following their hallucinations, they all reunited at the heart of the swamp, directly by the main canopy of the banyan-grove tree and its trunk.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_2}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_4}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Momo",
          "key": "${link_5}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "After a tornado spontaneously formed and caused Appa to crash into the swamp, Aang, Sokka, and Katara were separated from their animal companions. At night, Team Avatar's search for Appa and Momo was disrupted by moving vines, causing them to be separated from each other as well. Wandering through the mysterious swamp, they each started to hallucinate. Following their hallucinations, they all reunited at the heart of the swamp, directly by the main canopy of the banyan-grove tree and its trunk."
    },
    {
      "body": "${link_0} located ${link_1} and ${link_2} by using the banyan-grove tree's connection to the swamp.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Momo",
          "key": "${link_2}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "Aang located Appa and Momo by using the banyan-grove tree's connection to the swamp."
    },
    {
      "body": "When Sokka's logical viewpoint caused him to contradict Aang's statement that it was the tree that had called them to the center, they were attacked by moving vines in the guise of a giant humanoid shape with a mask at the center. After defeating this monster, it turned out that the vines were controlled by a waterbender named Huu. When Huu learned that Aang was the ${link_0}, he invited the kids to follow him to the base of the banyan-grove tree. During their walk, Huu explained that the swamp was a sacred, mystical place and that he had reached enlightenment right under the banyan-grove tree. He told Team Avatar that the swamp was actually just one large tree that had spread out over miles, sank, and took root, a process that repeated for an extended period of time. He used the tree as an example to teach them that the ${link_1}, just like the swamp, was one living organism where everything was connected.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "world",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "When Sokka's logical viewpoint caused him to contradict Aang's statement that it was the tree that had called them to the center, they were attacked by moving vines in the guise of a giant humanoid shape with a mask at the center. After defeating this monster, it turned out that the vines were controlled by a waterbender named Huu. When Huu learned that Aang was the Avatar, he invited the kids to follow him to the base of the banyan-grove tree. During their walk, Huu explained that the swamp was a sacred, mystical place and that he had reached enlightenment right under the banyan-grove tree. He told Team Avatar that the swamp was actually just one large tree that had spread out over miles, sank, and took root, a process that repeated for an extended period of time. He used the tree as an example to teach them that the world, just like the swamp, was one living organism where everything was connected."
    },
    {
      "body": "Using this newly acquired knowledge, Aang used the connection of the tree with the swamp around it to find Appa and Momo. The young ${link_0} placed his hand on the tree's root and focused; his ${link_1} glowed and a bolt of energy traveled through the root system, allowing Aang to metaphysically connect with his surroundings and locate Appa in the swamp.",
      "links": [
        {
          "body": "airbender",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "tattoos",
          "key": "${link_1}",
          "target": {
            "href": "Body_markings_in_the_World_of_Avatar#Airbending_masters",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Using this newly acquired knowledge, Aang used the connection of the tree with the swamp around it to find Appa and Momo. The young airbender placed his hand on the tree's root and focused; his tattoos glowed and a bolt of energy traveled through the root system, allowing Aang to metaphysically connect with his surroundings and locate Appa in the swamp."
    },
    {
      "body": "A golden light traveling via the roots of the banyan-grove tree signifies its connection to its surroundings.",
      "links": [],
      "text": "A golden light traveling via the roots of the banyan-grove tree signifies its connection to its surroundings."
    },
    {
      "body": "In 174 ${link_0}, ${link_1} guided ${link_2} to the tree in order to help her move on from her past enemies. As they arrived at the base of the tree and climbed its root, Korra commented on how beautiful the tree was. Toph explained that the roots spanned out for miles in every direction, connecting the entire swamp. Deducing that Korra's problem stemmed from being disconnected too long from the people who loved her and herself, she figured the Avatar could benefit from the tree's connection to everything. As Aang did decades before her, Korra placed a hand on a root and focused. A bolt of golden light lit up underneath her hand and traveled through the roots into the swamp, revealing ${link_3}, ${link_4}, and ${link_5}'s presence to her. In turn, Jinora was able to pick up on the tree's spiritual energy, which enabled her to locate Korra, whom they had been looking for.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_3}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Ikki",
          "key": "${link_4}",
          "target": {
            "href": "Ikki",
            "page": "Ikki"
          }
        },
        {
          "body": "Meelo",
          "key": "${link_5}",
          "target": {
            "href": "Meelo",
            "page": "Meelo"
          }
        }
      ],
      "text": "In 174 AG, Toph guided Korra to the tree in order to help her move on from her past enemies. As they arrived at the base of the tree and climbed its root, Korra commented on how beautiful the tree was. Toph explained that the roots spanned out for miles in every direction, connecting the entire swamp. Deducing that Korra's problem stemmed from being disconnected too long from the people who loved her and herself, she figured the Avatar could benefit from the tree's connection to everything. As Aang did decades before her, Korra placed a hand on a root and focused. A bolt of golden light lit up underneath her hand and traveled through the roots into the swamp, revealing Jinora, Ikki, and Meelo's presence to her. In turn, Jinora was able to pick up on the tree's spiritual energy, which enabled her to locate Korra, whom they had been looking for."
    },
    {
      "body": "${link_0}'s ${link_1} started to harvest ${link_2} near the base of the banyan-grove tree.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "mecha suits",
          "key": "${link_1}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        },
        {
          "body": "spirit vines",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        }
      ],
      "text": "Kuvira's mecha suits started to harvest spirit vines near the base of the banyan-grove tree."
    },
    {
      "body": "Not long after, ${link_0} and ${link_1} traveled to the swamp and made their way to the banyan-grove tree. Using a probe, ${link_2} concluded that the roots of the tree were infused with spirit energy, even more powerful than the ${link_3} in ${link_4}. As such, Kuvira ordered her battalion of ${link_5} to harvest the vines until there was nothing left and they promptly started hacking away near the base of the tree. Although the spirit vines fought back, they were no match for the chainsaws of the mecha suits. The spiritual repercussions of the harvesting carried over to Republic City, where the vines in the Spirit Wilds also started to react violently toward people as a result of the attack on the banyan-grove tree.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "her army",
          "key": "${link_1}",
          "target": {
            "href": "Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        },
        {
          "body": "Baatar Jr.",
          "key": "${link_2}",
          "target": {
            "href": "Baatar_Jr",
            "page": "Baatar_Jr"
          }
        },
        {
          "body": "spirit vines",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_4}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "mecha suits",
          "key": "${link_5}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        }
      ],
      "text": "Not long after, Kuvira and her army traveled to the swamp and made their way to the banyan-grove tree. Using a probe, Baatar Jr. concluded that the roots of the tree were infused with spirit energy, even more powerful than the spirit vines in Republic City. As such, Kuvira ordered her battalion of mecha suits to harvest the vines until there was nothing left and they promptly started hacking away near the base of the tree. Although the spirit vines fought back, they were no match for the chainsaws of the mecha suits. The spiritual repercussions of the harvesting carried over to Republic City, where the vines in the Spirit Wilds also started to react violently toward people as a result of the attack on the banyan-grove tree."
    },
    {
      "body": "Banyan trees are a variety of thick-canopied fig trees which grow in tropical regions across the world. While some species grow independently, others require a host tree on which to initially grow, for which they the have acquired the byname, \"strangler-vine\". Older trees drop shoots down from the branches toward the ground, where they take hold and propagate new woody trunks, connected to the original tree; in this way, some species are able to grow across several hectares. In many traditional societies, the banyan tree is used as a meeting spot or a marker for the center of a village, and in parts of Southern Asia, is considered sacred, especially in such Hindu influenced areas as India where Banyan is the national tree as well as Sri Lanka, Bangladesh, and Bali. The Bodhi Tree, the banyan species, Ficus religiosa, is where Buddha is said to have achieved his enlightenment.",
      "links": [],
      "text": "Banyan trees are a variety of thick-canopied fig trees which grow in tropical regions across the world. While some species grow independently, others require a host tree on which to initially grow, for which they the have acquired the byname, \"strangler-vine\". Older trees drop shoots down from the branches toward the ground, where they take hold and propagate new woody trunks, connected to the original tree; in this way, some species are able to grow across several hectares. In many traditional societies, the banyan tree is used as a meeting spot or a marker for the center of a village, and in parts of Southern Asia, is considered sacred, especially in such Hindu influenced areas as India where Banyan is the national tree as well as Sri Lanka, Bangladesh, and Bali. The Bodhi Tree, the banyan species, Ficus religiosa, is where Buddha is said to have achieved his enlightenment."
    },
    {
      "body": "Mangrove trees, such as the genus Rhizophora, are swamp plants known for their tenacity and the complex micro-ecologies created by their widespread root systems.",
      "links": [],
      "text": "Mangrove trees, such as the genus Rhizophora, are swamp plants known for their tenacity and the complex micro-ecologies created by their widespread root systems."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Banyan-grove_tree",
    "file": "avatar.wikia.com/wiki/Banyan-grove_tree.html",
    "page": "Banyan-grove_tree",
    "title": "Banyan-grove tree"
  }
}