{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "external": false,
        "href": "/wiki/Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Firebending",
      "target": {
        "external": false,
        "href": "/wiki/Category_Firebending",
        "page": "Category_Firebending"
      }
    },
    {
      "body": "Military",
      "target": {
        "external": false,
        "href": "/wiki/Category_Military",
        "page": "Category_Military"
      }
    },
    {
      "body": "Objects",
      "target": {
        "external": false,
        "href": "/wiki/Category_Objects",
        "page": "Category_Objects"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} battlements are small tower-like structures that house ${link_1} and ${link_2}, large crossbow-type ${link_3}. There are usually at least two soldiers at each battlement. The crossbows fire spears, which are attached to chains; if they puncture the hull of a boat, the chain is drawn back to pull the vehicle right out of the water, making it vulnerable to attack by soldiers. However, the chains are relatively weak, as ${link_4} was able to cut one of them with just one swipe of water.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "firebenders",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "ballistae",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ballista",
            "page": "Ballista"
          }
        },
        {
          "body": "weapons",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Weaponry_in_the_World_of_Avatar",
            "page": "Weaponry_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Katara",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        }
      ],
      "section": [
        "Battlements"
      ],
      "text": "Fire Nation battlements are small tower-like structures that house firebenders and ballistae, large crossbow-type weapons. There are usually at least two soldiers at each battlement. The crossbows fire spears, which are attached to chains; if they puncture the hull of a boat, the chain is drawn back to pull the vehicle right out of the water, making it vulnerable to attack by soldiers. However, the chains are relatively weak, as Katara was able to cut one of them with just one swipe of water."
    },
    {
      "body": "Battlements flanked the one pathway leading from the beach to the ${link_0}. Some of these structures were supported by triangular platforms, while others rested on unpaved cliffs. Despite being the same structure, they appear to come in different sizes.",
      "links": [
        {
          "body": "Fire Nation Capital",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        }
      ],
      "section": [
        "Battlements"
      ],
      "text": "Battlements flanked the one pathway leading from the beach to the Fire Nation Capital. Some of these structures were supported by triangular platforms, while others rested on unpaved cliffs. Despite being the same structure, they appear to come in different sizes."
    },
    {
      "body": "During his reign, ${link_0} ${link_1} designed a series of switchbacks leading into the Fire Nation Capital, arming the pathway with numerous battlements and watchtowers in order to create one of the most heavily fortified roads in the ${link_2}.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "world",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "Battlements",
        "History"
      ],
      "text": "During his reign, Fire Lord Sozin designed a series of switchbacks leading into the Fire Nation Capital, arming the pathway with numerous battlements and watchtowers in order to create one of the most heavily fortified roads in the world."
    },
    {
      "body": "When the ${link_0} of the ${link_1} force entered the shallow, clear waters of the entrance to the bay of the Fire Nation Capital, they were easily discovered by the guards who sounded the alarm. As a means of defense, the guards shot giant harpoons at the intruding vehicles from their battlements, managing to pierce the hull of one of the submarines. The guards began to hoist it out of the water, but before the submarine could be completely exposed to the attacks of the defenders, Katara intervened by cutting the chain of the harpoon with her ${link_2}.",
      "links": [
        {
          "body": "submarines",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending-powered_submarine",
            "page": "Waterbending-powered_submarine"
          }
        },
        {
          "body": "invasion",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "section": [
        "Battlements",
        "History"
      ],
      "text": "When the submarines of the invasion force entered the shallow, clear waters of the entrance to the bay of the Fire Nation Capital, they were easily discovered by the guards who sounded the alarm. As a means of defense, the guards shot giant harpoons at the intruding vehicles from their battlements, managing to pierce the hull of one of the submarines. The guards began to hoist it out of the water, but before the submarine could be completely exposed to the attacks of the defenders, Katara intervened by cutting the chain of the harpoon with her waterbending."
    },
    {
      "body": "After the troops arrived on the beach, the soldiers manning the battlements started to bombard the invaders with bombs shot from the battlements in an attempt to repel them. The invaders struck back, however, with stones that they had brought with them on ${link_0}. ${link_1}, ${link_2}, and ${link_3} took down the first battlement by ${link_4} the stones at the battlement, rendering it unusable. Huu, fighting as the \"swamp monster\", took down another battlement by throwing one of the Fire Nation's ${link_5} onto the structure, causing it to explode.",
      "links": [
        {
          "body": "supply trucks",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom_supply_truck",
            "page": "Earth_Kingdom_supply_truck"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "The Boulder",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/The_Boulder",
            "page": "The_Boulder"
          }
        },
        {
          "body": "The Big Bad Hippo",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/The_Big_Bad_Hippo",
            "page": "The_Big_Bad_Hippo"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "tundra tanks",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Tundra_tank",
            "page": "Tundra_tank"
          }
        }
      ],
      "section": [
        "Battlements",
        "History"
      ],
      "text": "After the troops arrived on the beach, the soldiers manning the battlements started to bombard the invaders with bombs shot from the battlements in an attempt to repel them. The invaders struck back, however, with stones that they had brought with them on supply trucks. Toph, The Boulder, and The Big Bad Hippo took down the first battlement by earthbending the stones at the battlement, rendering it unusable. Huu, fighting as the \"swamp monster\", took down another battlement by throwing one of the Fire Nation's tundra tanks onto the structure, causing it to explode."
    },
    {
      "body": "The projectiles fired from the battlements proved to be the biggest problem for the invasion force, as the bombs managed to cause a lot of damage to the ${link_0}, the supply trucks carrying stones, and even Huu's swamp monster, whose left arm was blown off by a projectile from these battlements. Realizing that their only chance of a successful invasion was to take down the battlements, ${link_1}, ${link_2}, and Katara boarded ${link_3} and prepared for an aerial attack. As they flew past the first battlement, Sokka disabled the crossbow by cutting it in half with his ${link_4}. Hakoda took down the next one by throwing two bombs in the building and Katara froze the guards and weaponry of a third battlement with her waterbending. The trio landed on a cliff between two battlements and split up. Sokka and Katara took out another battlement with ease: Katara disabled the guards with her bending, granting Sokka the opportunity to slice up the crossbow. Hakoda, however, had more trouble with his. Although he successfully managed to take out the battlement, he was injured in the process.",
      "links": [
        {
          "body": "Earthbending-powered tanks",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending-powered_tank",
            "page": "Earthbending-powered_tank"
          }
        },
        {
          "body": "Hakoda",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Appa",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Appa",
            "page": "Appa"
          }
        },
        {
          "body": "sword",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka%27s_sword",
            "page": "Sokka%27s_sword"
          }
        }
      ],
      "section": [
        "Battlements",
        "History"
      ],
      "text": "The projectiles fired from the battlements proved to be the biggest problem for the invasion force, as the bombs managed to cause a lot of damage to the Earthbending-powered tanks, the supply trucks carrying stones, and even Huu's swamp monster, whose left arm was blown off by a projectile from these battlements. Realizing that their only chance of a successful invasion was to take down the battlements, Hakoda, Sokka, and Katara boarded Appa and prepared for an aerial attack. As they flew past the first battlement, Sokka disabled the crossbow by cutting it in half with his sword. Hakoda took down the next one by throwing two bombs in the building and Katara froze the guards and weaponry of a third battlement with her waterbending. The trio landed on a cliff between two battlements and split up. Sokka and Katara took out another battlement with ease: Katara disabled the guards with her bending, granting Sokka the opportunity to slice up the crossbow. Hakoda, however, had more trouble with his. Although he successfully managed to take out the battlement, he was injured in the process."
    },
    {
      "body": "After destroying the battlements protecting the entrance to the Fire Nation harbor, the invasion force pushed forward and started their ascent of the volcano that contained the Fire Nation capital city. The pathway, however, was lined with many more battlements. These were easily taken down by The Boulder, The Hippo, and other earthbenders by creating an avalanche that caused the battlements to slide down the slope of the volcano.",
      "links": [],
      "section": [
        "Battlements",
        "History"
      ],
      "text": "After destroying the battlements protecting the entrance to the Fire Nation harbor, the invasion force pushed forward and started their ascent of the volcano that contained the Fire Nation capital city. The pathway, however, was lined with many more battlements. These were easily taken down by The Boulder, The Hippo, and other earthbenders by creating an avalanche that caused the battlements to slide down the slope of the volcano."
    },
    {
      "body": "The Fire Nation eventually repaired or replaced many of these battlements immediately after the invasion was repelled, as the capital showed no visible signs of damage later, during ${link_0} ${link_1}'s coronation as ${link_2}.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Phoenix King",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Phoenix_King",
            "page": "Phoenix_King"
          }
        }
      ],
      "section": [
        "Battlements",
        "History"
      ],
      "text": "The Fire Nation eventually repaired or replaced many of these battlements immediately after the invasion was repelled, as the capital showed no visible signs of damage later, during Fire Lord Ozai's coronation as Phoenix King."
    },
    {
      "body": "The battlements positioned besides the pathway leading to the base of the volcano that holds the Fire Nation's capital city are octagonal in shape. They were built from strong, gray stones, leaving no openings with the exception of a single metal door and a peephole facing the pathway. A large metal crossbow partially protrudes from this peephole, allowing it to switch direction to provide the guard with a better aim. The thick walls of the battlements support a red roof with yellow details, giving it a similar appearance to a pagoda or a small pavilion.",
      "links": [],
      "section": [
        "Battlements",
        "Design",
        "Exterior"
      ],
      "text": "The battlements positioned besides the pathway leading to the base of the volcano that holds the Fire Nation's capital city are octagonal in shape. They were built from strong, gray stones, leaving no openings with the exception of a single metal door and a peephole facing the pathway. A large metal crossbow partially protrudes from this peephole, allowing it to switch direction to provide the guard with a better aim. The thick walls of the battlements support a red roof with yellow details, giving it a similar appearance to a pagoda or a small pavilion."
    },
    {
      "body": "The inside of the battlement is fairly dark due to the limited illumination, and consists of a single room with an open first floor made out of wood. The battlement houses no items for the comfort of the soldiers, as it only contains objects used in battle. There are several barrels containing ${link_0} to fuel the bombs, a rack holding extra harpoons, and a small, ballista-like device equipped with a winch used to haul in vehicles that have been captured with the harpoon. Attached to the device is a large, metal crossbow that serves as the battlement's main weapon. In the middle of the single room stands a ladder to allow the soldiers manning the battlement to easily switch levels.",
      "links": [
        {
          "body": "blasting jelly",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Blasting_jelly",
            "page": "Blasting_jelly"
          }
        }
      ],
      "section": [
        "Battlements",
        "Design",
        "Interior"
      ],
      "text": "The inside of the battlement is fairly dark due to the limited illumination, and consists of a single room with an open first floor made out of wood. The battlement houses no items for the comfort of the soldiers, as it only contains objects used in battle. There are several barrels containing blasting jelly to fuel the bombs, a rack holding extra harpoons, and a small, ballista-like device equipped with a winch used to haul in vehicles that have been captured with the harpoon. Attached to the device is a large, metal crossbow that serves as the battlement's main weapon. In the middle of the single room stands a ladder to allow the soldiers manning the battlement to easily switch levels."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "section": [
        "Battlements",
        "See also"
      ],
      "text": "Fire Nation"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Weaponry in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Weaponry_in_the_World_of_Avatar",
            "page": "Weaponry_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Battlements",
        "See also"
      ],
      "text": "Weaponry in the World of Avatar"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Battlements",
    "file": "avatar.wikia.com/wiki/Battlements.html",
    "page": "Battlements",
    "title": "Battlements"
  }
}