{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Bending",
      "target": {
        "href": "Category_Bending",
        "page": "Category_Bending"
      }
    },
    {
      "body": "Bending arts",
      "target": {
        "href": "Category_Bending_arts",
        "page": "Category_Bending_arts"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "href": "Category_Spirituality",
        "page": "Category_Spirituality"
      }
    },
    {
      "body": "World of Avatar",
      "target": {
        "href": "Category_World_of_Avatar",
        "page": "Category_World_of_Avatar"
      }
    }
  ],
  "facts": [
    {
      "key": "Type",
      "value": [
        {
          "body": "Manipulation of the four elements",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Manipulation of the four elements",
          "value": "Manipulation of the four elements",
          "value_text": "Manipulation of the four elements"
        }
      ]
    },
    {
      "key": "Examples",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Airbending",
              "key": "${link_0}",
              "target": {
                "href": "Airbending",
                "page": "Airbending"
              }
            }
          ],
          "text": "Airbending",
          "value": "${link_0}",
          "value_text": "Airbending"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Waterbending",
              "key": "${link_0}",
              "target": {
                "href": "Waterbending",
                "page": "Waterbending"
              }
            }
          ],
          "text": "Waterbending",
          "value": "${link_0}",
          "value_text": "Waterbending"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Earthbending",
              "key": "${link_0}",
              "target": {
                "href": "Earthbending",
                "page": "Earthbending"
              }
            }
          ],
          "text": "Earthbending",
          "value": "${link_0}",
          "value_text": "Earthbending"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Firebending",
              "key": "${link_0}",
              "target": {
                "href": "Firebending",
                "page": "Firebending"
              }
            }
          ],
          "text": "Firebending",
          "value": "${link_0}",
          "value_text": "Firebending"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Energybending",
              "key": "${link_0}",
              "target": {
                "href": "Energybending",
                "page": "Energybending"
              }
            }
          ],
          "text": "Energybending",
          "value": "${link_0}",
          "value_text": "Energybending"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Bending is the ability to manipulate an element and is significant to many aspects of life in the ${link_0}. There are five known bending arts; four of them bend a specific physical element while the fifth bends the energy within the human body itself. The four elemental bending arts are based on the four classical elements, water, earth, fire, and air, and each is manipulated through certain martial art styles which are reminiscent of the qualities of the element itself. While bending is traditionally performed through the motions of one's hands and feet, certain benders are able to effectively manipulate their element with only minimal movement of their body, such as by using just their head or torso. In even rarer cases, benders are able to perform their bending without the aid of any physical movement at all, by instead using sheer focus and force of will, a skill known as psychic bending. Each element is also associated with a particular ${link_1} in the world; the ${link_2} corresponds with ${link_3}, the ${link_4} with ${link_5}, the ${link_6} with ${link_7}, and the ${link_8} with ${link_9}. However, other bending affiliated groups exist, such as the ${link_10} for waterbending and the ${link_11} for firebending.",
      "links": [
        {
          "body": "World of Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "nation",
          "key": "${link_1}",
          "target": {
            "href": "Four_nations",
            "page": "Four_nations"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_3}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_4}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_5}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_6}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "firebending",
          "key": "${link_7}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_8}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "airbending",
          "key": "${link_9}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Foggy Swamp Tribe",
          "key": "${link_10}",
          "target": {
            "href": "Foggy_Swamp_Tribe",
            "page": "Foggy_Swamp_Tribe"
          }
        },
        {
          "body": "Sun Warriors",
          "key": "${link_11}",
          "target": {
            "href": "Sun_Warriors",
            "page": "Sun_Warriors"
          }
        }
      ],
      "text": "Bending is the ability to manipulate an element and is significant to many aspects of life in the World of Avatar. There are five known bending arts; four of them bend a specific physical element while the fifth bends the energy within the human body itself. The four elemental bending arts are based on the four classical elements, water, earth, fire, and air, and each is manipulated through certain martial art styles which are reminiscent of the qualities of the element itself. While bending is traditionally performed through the motions of one's hands and feet, certain benders are able to effectively manipulate their element with only minimal movement of their body, such as by using just their head or torso. In even rarer cases, benders are able to perform their bending without the aid of any physical movement at all, by instead using sheer focus and force of will, a skill known as psychic bending. Each element is also associated with a particular nation in the world; the Water Tribe corresponds with waterbending, the Earth Kingdom with earthbending, the Fire Nation with firebending, and the Air Nomads with airbending. However, other bending affiliated groups exist, such as the Foggy Swamp Tribe for waterbending and the Sun Warriors for firebending."
    },
    {
      "body": "${link_0} drew the symbols of the bending arts in the dirt.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Iroh drew the symbols of the bending arts in the dirt."
    },
    {
      "body": "The fifth bending art, ${link_0}, is unlike the other four in that little physical action is required to direct the bending itself. The four elemental bending arts are all dependent on the energy, or ${link_1}, within the human body, relying on its flow through the body to manipulate a specific element. A person is able to bend when they extend the influence of their chi beyond the body to interact with the environment. Energybending, on the other hand, is concerned with the manipulation of the energy itself and is able to remove or grant bending abilities.",
      "links": [
        {
          "body": "energybending",
          "key": "${link_0}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        },
        {
          "body": "chi",
          "key": "${link_1}",
          "target": {
            "href": "Chi",
            "page": "Chi"
          }
        }
      ],
      "text": "The fifth bending art, energybending, is unlike the other four in that little physical action is required to direct the bending itself. The four elemental bending arts are all dependent on the energy, or chi, within the human body, relying on its flow through the body to manipulate a specific element. A person is able to bend when they extend the influence of their chi beyond the body to interact with the environment. Energybending, on the other hand, is concerned with the manipulation of the energy itself and is able to remove or grant bending abilities."
    },
    {
      "body": "Though each nation is affiliated to a specific bending art, not all citizens from any nation, with the exception of the Air Nomads, are born with the ability to bend an element. In the case of mixed marriages, the children may be benders of either element if they are benders at all; for example, firebender ${link_0} and earthbender ${link_1} are brothers with parents from the Fire Nation and the Earth Kingdom. The only case of any one person being able to bend multiple elements is the ${link_2}, who has the ability to practice all five bending arts.",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Though each nation is affiliated to a specific bending art, not all citizens from any nation, with the exception of the Air Nomads, are born with the ability to bend an element. In the case of mixed marriages, the children may be benders of either element if they are benders at all; for example, firebender Mako and earthbender Bolin are brothers with parents from the Fire Nation and the Earth Kingdom. The only case of any one person being able to bend multiple elements is the Avatar, who has the ability to practice all five bending arts."
    },
    {
      "body": "${link_0} ${link_1}'s native element was ${link_2}.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "air",
          "key": "${link_2}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Avatar Aang's native element was air."
    },
    {
      "body": "${link_0} is the bending art used by the ${link_1}; the ${link_2} were the original airbenders. It concentrates on speed and evasion, forgoing a strong offense for a greater defense. Though apparently lacking fatal finishing moves, it is the most dynamic of all the bending arts. As the element of freedom, airbenders use their capability to bend unencumbered by the ground or any other environmental factors and use their own momentum as a weapon, evading attacks with astounding agility to tire their opponents out or building up massive inertia for explosive gusts of wind to make their counterattacks finishing moves. Airbenders, when resorting to physical confrontation, are able to harness the immense and intangible power of wind. Airbending's opposite is earthbending and the confrontational style that serves as its foundation. Airbenders can use a flight technique by operating a ${link_3} and using the air to provide thrust and lift. After the art was almost ${link_4} from existence, the only airbender left was Avatar ${link_5}, until his son, ${link_6}, and three grandchildren later inherited the ability. Airbending also resurfaced in a number of nonbenders following the ${link_7} of 171 AG, further reviving the almost extinct bending art. The sub-skills of airbending are flight and ${link_8}. Flight has only been achieved by two people in the entire history of airbending, namely Guru ${link_9} and ${link_10}. Airbending is the element of freedom, and its season is autumn.",
      "links": [
        {
          "body": "Airbending",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_1}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "flying bison",
          "key": "${link_2}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "glider",
          "key": "${link_3}",
          "target": {
            "href": "Airbender_staff",
            "page": "Airbender_staff"
          }
        },
        {
          "body": "wiped",
          "key": "${link_4}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "Aang",
          "key": "${link_5}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_6}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_7}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "spiritual projection",
          "key": "${link_8}",
          "target": {
            "href": "Spiritual_projection",
            "page": "Spiritual_projection"
          }
        },
        {
          "body": "Laghima",
          "key": "${link_9}",
          "target": {
            "href": "Laghima",
            "page": "Laghima"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_10}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        }
      ],
      "text": "Airbending is the bending art used by the Air Nomads; the flying bison were the original airbenders. It concentrates on speed and evasion, forgoing a strong offense for a greater defense. Though apparently lacking fatal finishing moves, it is the most dynamic of all the bending arts. As the element of freedom, airbenders use their capability to bend unencumbered by the ground or any other environmental factors and use their own momentum as a weapon, evading attacks with astounding agility to tire their opponents out or building up massive inertia for explosive gusts of wind to make their counterattacks finishing moves. Airbenders, when resorting to physical confrontation, are able to harness the immense and intangible power of wind. Airbending's opposite is earthbending and the confrontational style that serves as its foundation. Airbenders can use a flight technique by operating a glider and using the air to provide thrust and lift. After the art was almost wiped from existence, the only airbender left was Avatar Aang, until his son, Tenzin, and three grandchildren later inherited the ability. Airbending also resurfaced in a number of nonbenders following the Harmonic Convergence of 171 AG, further reviving the almost extinct bending art. The sub-skills of airbending are flight and spiritual projection. Flight has only been achieved by two people in the entire history of airbending, namely Guru Laghima and Zaheer. Airbending is the element of freedom, and its season is autumn."
    },
    {
      "body": "${link_0} is a ${link_1} master.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Katara is a waterbending master."
    },
    {
      "body": "${link_0} is practiced by some people of the ${link_1}. A versatile element, it is unique in the sense that the original bender of the element was not an animal, but rather the ${link_2}. Similar to their element, waterbenders are extremely adaptable and versatile. Waterbending concentrates on the flow of energy and focuses less on strength and more on turning the opponent's own energy against them. While a bender's victory in battle depends on their skill or ingenuity, waterbenders, unlike other benders, gain a serious advantage or disadvantage depending on the amount of water around them, although highly skilled waterbenders can draw water from anywhere; they can draw humidity from the air and bend the water in living things, especially plants. As the element of change, waterbenders can fluidly and quickly alternate from defense to offense, from a wall of ice to a jet of water, turning their opponent's strength against them. The opposite of waterbending is firebending, with its relatively stagnant, direct philosophy. Due to its lunar sympathy, waterbending is stronger at night and ineffective during a ${link_3} or when the Moon Spirit dies. However, to counter waterbending's ineffectiveness during a lunar eclipse, waterbenders gain immense power during the peak of the full moon. The sub-skills for waterbending are ${link_4} and ${link_5}. Waterbending is the element of change, and its season is winter.",
      "links": [
        {
          "body": "Waterbending",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Moon",
          "key": "${link_2}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "lunar eclipse",
          "key": "${link_3}",
          "target": {
            "href": "Astronomy_in_the_World_of_Avatar#Lunar_eclipse",
            "page": "Astronomy_in_the_World_of_Avatar"
          }
        },
        {
          "body": "healing",
          "key": "${link_4}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        },
        {
          "body": "bloodbending",
          "key": "${link_5}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        }
      ],
      "text": "Waterbending is practiced by some people of the Water Tribe. A versatile element, it is unique in the sense that the original bender of the element was not an animal, but rather the Moon. Similar to their element, waterbenders are extremely adaptable and versatile. Waterbending concentrates on the flow of energy and focuses less on strength and more on turning the opponent's own energy against them. While a bender's victory in battle depends on their skill or ingenuity, waterbenders, unlike other benders, gain a serious advantage or disadvantage depending on the amount of water around them, although highly skilled waterbenders can draw water from anywhere; they can draw humidity from the air and bend the water in living things, especially plants. As the element of change, waterbenders can fluidly and quickly alternate from defense to offense, from a wall of ice to a jet of water, turning their opponent's strength against them. The opposite of waterbending is firebending, with its relatively stagnant, direct philosophy. Due to its lunar sympathy, waterbending is stronger at night and ineffective during a lunar eclipse or when the Moon Spirit dies. However, to counter waterbending's ineffectiveness during a lunar eclipse, waterbenders gain immense power during the peak of the full moon. The sub-skills for waterbending are healing and bloodbending. Waterbending is the element of change, and its season is winter."
    },
    {
      "body": "${link_0} is one of the best ${link_1} of her time.",
      "links": [
        {
          "body": "Toph Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "earthbenders",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Toph Beifong is one of the best earthbenders of her time."
    },
    {
      "body": "${link_0} originates in the ${link_1} and it demands a special connection with the earth that is achievable with neutral ${link_2}, listening, though seemingly doing nothing, and waiting for the right moment to strike. The first earthbenders were ${link_3}. Like waterbenders, earthbenders gain an advantage or disadvantage in battle based on the amount of earth around them, though the conditions are not as extreme. Because of their element's stability and its stress on neutral jing, earthbenders stand their ground, absorbing or intercepting attacks until they completely overwhelm their opponents. Unlike the other bending arts, earthbending's strength equally lies in both offense and defense. Earthbending is in stark contrast to airbending as airbending's emphasis is on evasion and mobility while earthbending's emphasis is on fortitude and strength. The sub-skills for earthbending are ${link_4}, ${link_5}, and ${link_6}. Earthbending is the element of substance, and its season is spring.",
      "links": [
        {
          "body": "Earthbending",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "jing",
          "key": "${link_2}",
          "target": {
            "href": "Jing",
            "page": "Jing"
          }
        },
        {
          "body": "badgermoles",
          "key": "${link_3}",
          "target": {
            "href": "Badgermole",
            "page": "Badgermole"
          }
        },
        {
          "body": "seismic sense",
          "key": "${link_4}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        },
        {
          "body": "metalbending",
          "key": "${link_5}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "lavabending",
          "key": "${link_6}",
          "target": {
            "href": "Lavabending",
            "page": "Lavabending"
          }
        }
      ],
      "text": "Earthbending originates in the Earth Kingdom and it demands a special connection with the earth that is achievable with neutral jing, listening, though seemingly doing nothing, and waiting for the right moment to strike. The first earthbenders were badgermoles. Like waterbenders, earthbenders gain an advantage or disadvantage in battle based on the amount of earth around them, though the conditions are not as extreme. Because of their element's stability and its stress on neutral jing, earthbenders stand their ground, absorbing or intercepting attacks until they completely overwhelm their opponents. Unlike the other bending arts, earthbending's strength equally lies in both offense and defense. Earthbending is in stark contrast to airbending as airbending's emphasis is on evasion and mobility while earthbending's emphasis is on fortitude and strength. The sub-skills for earthbending are seismic sense, metalbending, and lavabending. Earthbending is the element of substance, and its season is spring."
    },
    {
      "body": "${link_0} is a strong ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebender",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Zuko is a strong firebender."
    },
    {
      "body": "${link_0} is used by the people of the ${link_1} and is the most aggressive bending art. ${link_2} were the first firebenders; they subsequently taught the Sun Warriors. Unlike other benders who depend on external sources of their elements to bend, firebenders can create fire using their internal heat source in addition to controlling already existent flames. As the element of power, firebenders have to be able to maintain a constant source of energy and balance in battle, unleashing a volley of direct, successive attacks. Firebending's relatively simple and direct style contrasts the complex and changing style of waterbending. Due to its solar affinity, firebending is stronger during the day and at its full power at noon, but completely ineffective during a ${link_3}. When ${link_4} passes close to the planet, the power of a firebender is greatly increased. For a long time, disciplines of firebending were taught to be fueled by hatred, as opposed to the original source. Skilled firebenders are able to fly using powerful jets of flames. A notable feature of special firebenders is an ability to create a hotter, blue fire; ${link_5} was the only known firebender who demonstrated this extra-powerful flame. The sub-skills for firebending are ${link_6}, ${link_7} and ${link_8} lightning. Firebending is the element of power, and its season is summer.",
      "links": [
        {
          "body": "Firebending",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Dragons",
          "key": "${link_2}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        },
        {
          "body": "solar eclipse",
          "key": "${link_3}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "a comet",
          "key": "${link_4}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Azula",
          "key": "${link_5}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "combustionbending",
          "key": "${link_6}",
          "target": {
            "href": "Firebending#Special_techniques",
            "page": "Firebending"
          }
        },
        {
          "body": "generating",
          "key": "${link_7}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "redirecting",
          "key": "${link_8}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "text": "Firebending is used by the people of the Fire Nation and is the most aggressive bending art. Dragons were the first firebenders; they subsequently taught the Sun Warriors. Unlike other benders who depend on external sources of their elements to bend, firebenders can create fire using their internal heat source in addition to controlling already existent flames. As the element of power, firebenders have to be able to maintain a constant source of energy and balance in battle, unleashing a volley of direct, successive attacks. Firebending's relatively simple and direct style contrasts the complex and changing style of waterbending. Due to its solar affinity, firebending is stronger during the day and at its full power at noon, but completely ineffective during a solar eclipse. When a comet passes close to the planet, the power of a firebender is greatly increased. For a long time, disciplines of firebending were taught to be fueled by hatred, as opposed to the original source. Skilled firebenders are able to fly using powerful jets of flames. A notable feature of special firebenders is an ability to create a hotter, blue fire; Azula was the only known firebender who demonstrated this extra-powerful flame. The sub-skills for firebending are combustionbending, generating and redirecting lightning. Firebending is the element of power, and its season is summer."
    },
    {
      "body": "${link_0} ${link_1} ${link_2} ${link_3} to strip him of his bending.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "energybent",
          "key": "${link_2}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_3}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Avatar Aang energybent Ozai to strip him of his bending."
    },
    {
      "body": "${link_0} is the art of bending the energy within one's body. It existed in the ${link_1} and the four bending arts, though was considered lost. It is a highly dangerous technique; if one's own energy is impure and therefore bendable, the practitioner will be consequently destroyed. Few Avatars have learned this bending art, and even fewer have used it. Energybending allows the user to remove other people's bending abilities, such as when Avatar Aang used it to strip ${link_2} and ${link_3} of their abilities, or restore them after a bender had their abilities blocked by ${link_4}, demonstrated when Aang used it to restore Avatar ${link_5}'s bending from ${link_6}'s damage, and Korra used it to restore ${link_7}'s earthbending. Korra also used the art to create a spiritual projection of herself within the ${link_8} and battle the ${link_9}.",
      "links": [
        {
          "body": "Energybending",
          "key": "${link_0}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        },
        {
          "body": "era of Raava",
          "key": "${link_1}",
          "target": {
            "href": "Era_of_Raava",
            "page": "Era_of_Raava"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_2}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Yakone",
          "key": "${link_3}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        },
        {
          "body": "bloodbending",
          "key": "${link_4}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "Korra",
          "key": "${link_5}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Amon",
          "key": "${link_6}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_7}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Tree of Time",
          "key": "${link_8}",
          "target": {
            "href": "Tree_of_Time",
            "page": "Tree_of_Time"
          }
        },
        {
          "body": "Dark Avatar",
          "key": "${link_9}",
          "target": {
            "href": "Dark_Avatar",
            "page": "Dark_Avatar"
          }
        }
      ],
      "text": "Energybending is the art of bending the energy within one's body. It existed in the era of Raava and the four bending arts, though was considered lost. It is a highly dangerous technique; if one's own energy is impure and therefore bendable, the practitioner will be consequently destroyed. Few Avatars have learned this bending art, and even fewer have used it. Energybending allows the user to remove other people's bending abilities, such as when Avatar Aang used it to strip Ozai and Yakone of their abilities, or restore them after a bender had their abilities blocked by bloodbending, demonstrated when Aang used it to restore Avatar Korra's bending from Amon's damage, and Korra used it to restore Lin Beifong's earthbending. Korra also used the art to create a spiritual projection of herself within the Tree of Time and battle the Dark Avatar."
    },
    {
      "body": "The ${link_0} bestowed the ${link_1} to ${link_2}.",
      "links": [
        {
          "body": "lion turtle",
          "key": "${link_0}",
          "target": {
            "href": "Lion_turtle",
            "page": "Lion_turtle"
          }
        },
        {
          "body": "power of fire",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Wan",
          "key": "${link_2}",
          "target": {
            "href": "Wan",
            "page": "Wan"
          }
        }
      ],
      "text": "The lion turtle bestowed the power of fire to Wan."
    },
    {
      "body": "During the ${link_0}, people could request a ${link_1} to grant them control over an element. As the protectors of mankind, the lion turtles bestowed the ability upon those who planned on traveling through the ${link_2}. However, as they returned, they were supposed to return this power to the creature. After ${link_3} became the Avatar by fusing with ${link_4} and closed off the spirit portals at the ${link_5} and ${link_6}, the lion turtles declared their roles as protectors of mankind over and stated that they would no longer bestow humans with the power of the elements.",
      "links": [
        {
          "body": "era of Raava",
          "key": "${link_0}",
          "target": {
            "href": "Era_of_Raava",
            "page": "Era_of_Raava"
          }
        },
        {
          "body": "lion turtle",
          "key": "${link_1}",
          "target": {
            "href": "Lion_turtle",
            "page": "Lion_turtle"
          }
        },
        {
          "body": "Spirit Wilds",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "Wan",
          "key": "${link_3}",
          "target": {
            "href": "Wan",
            "page": "Wan"
          }
        },
        {
          "body": "Raava",
          "key": "${link_4}",
          "target": {
            "href": "Raava",
            "page": "Raava"
          }
        },
        {
          "body": "North",
          "key": "${link_5}",
          "target": {
            "href": "North_Pole",
            "page": "North_Pole"
          }
        },
        {
          "body": "South Poles",
          "key": "${link_6}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        }
      ],
      "text": "During the era of Raava, people could request a lion turtle to grant them control over an element. As the protectors of mankind, the lion turtles bestowed the ability upon those who planned on traveling through the Spirit Wilds. However, as they returned, they were supposed to return this power to the creature. After Wan became the Avatar by fusing with Raava and closed off the spirit portals at the North and South Poles, the lion turtles declared their roles as protectors of mankind over and stated that they would no longer bestow humans with the power of the elements."
    },
    {
      "body": "After the departure of the lion turtles, the acquisition of bending abilities became dependent on a large number of factors and complex variables; inheritance patterns are not well understood by the people of the World of Avatar. One important known factor in determining the likelihood of a person to inherit bending abilities is the genetic history of the family. It can be considered a recessive gene, since it is possible for a person to inherit bending skills even if they have two nonbending parents, as in the cases of Katara and Toph. Likewise, having one or two bending parents is no guarantee to inherit bending skills, as ${link_0} and ${link_1}, Aang and Katara's eldest son, were born a nonbender despite having two bending parents. People who have a greater genetic basis for bending are said to have more \"talent\", or inherent ability, than those who have a weaker genetic basis; however, genetics alone do not entirely account for the actual proficiency of a bender. While an individual with a strong family history in bending is most likely to become skilled in the art, a person with little genetic basis can also become a skilled bender through hard work, though it will require significantly more practice than someone with a good genetic history. On the other hand, it is also possible for someone with a strong genetic basis to go about their entire life without ever developing a true ability in bending, because of a poor spiritual upbringing or lack of fervor in practice. Due to these anomalies, the nature of bending acquisition fluctuates and has prevented the rise of a superior \"bending social class\" in the World of Avatar.",
      "links": [
        {
          "body": "Piandao",
          "key": "${link_0}",
          "target": {
            "href": "Piandao",
            "page": "Piandao"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "href": "Bumi",
            "page": "Bumi"
          }
        }
      ],
      "text": "After the departure of the lion turtles, the acquisition of bending abilities became dependent on a large number of factors and complex variables; inheritance patterns are not well understood by the people of the World of Avatar. One important known factor in determining the likelihood of a person to inherit bending abilities is the genetic history of the family. It can be considered a recessive gene, since it is possible for a person to inherit bending skills even if they have two nonbending parents, as in the cases of Katara and Toph. Likewise, having one or two bending parents is no guarantee to inherit bending skills, as Piandao and Bumi, Aang and Katara's eldest son, were born a nonbender despite having two bending parents. People who have a greater genetic basis for bending are said to have more \"talent\", or inherent ability, than those who have a weaker genetic basis; however, genetics alone do not entirely account for the actual proficiency of a bender. While an individual with a strong family history in bending is most likely to become skilled in the art, a person with little genetic basis can also become a skilled bender through hard work, though it will require significantly more practice than someone with a good genetic history. On the other hand, it is also possible for someone with a strong genetic basis to go about their entire life without ever developing a true ability in bending, because of a poor spiritual upbringing or lack of fervor in practice. Due to these anomalies, the nature of bending acquisition fluctuates and has prevented the rise of a superior \"bending social class\" in the World of Avatar."
    },
    {
      "body": "Spirituality is also an important aspect of bending inheritance. It is for this reason that all Air Nomads, the most spiritual community in the World of Avatar, were airbenders. Another notable variable is the population size of the country: for example, the Earth Kingdom is the most populous nation, but has the smallest percentage of benders relative to total population among the ${link_0}. Generally, people can determine whether or not they are a bender before reaching puberty.",
      "links": [
        {
          "body": "four nations",
          "key": "${link_0}",
          "target": {
            "href": "Four_nations",
            "page": "Four_nations"
          }
        }
      ],
      "text": "Spirituality is also an important aspect of bending inheritance. It is for this reason that all Air Nomads, the most spiritual community in the World of Avatar, were airbenders. Another notable variable is the population size of the country: for example, the Earth Kingdom is the most populous nation, but has the smallest percentage of benders relative to total population among the four nations. Generally, people can determine whether or not they are a bender before reaching puberty."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Bending_arts",
    "file": "avatar.wikia.com/wiki/Bending_arts.html",
    "page": "Bending_arts",
    "title": "Bending arts"
  }
}