{
  "categories": [
    {
      "body": "Featured articles",
      "target": {
        "href": "Category_Featured_articles",
        "page": "Category_Featured_articles"
      }
    },
    {
      "body": "A-class articles",
      "target": {
        "href": "Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Air Nomads",
      "target": {
        "href": "Category_Air_Nomads",
        "page": "Category_Air_Nomads"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Equipment",
      "target": {
        "href": "Category_Equipment",
        "page": "Category_Equipment"
      }
    },
    {
      "body": "Objects",
      "target": {
        "href": "Category_Objects",
        "page": "Category_Objects"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} acquired a bison whistle early in ${link_1}'s travels.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Aang acquired a bison whistle early in Team Avatar's travels."
    },
    {
      "body": "Bison whistles are small wooden instruments used to attract various ${link_0} in the ${link_1}. They are the only known instruments capable of calling ${link_2} from long distances. These antique whistles are thought by many to be worthless, but they were once used by the ${link_3} to herd their bison.",
      "links": [
        {
          "body": "fauna",
          "key": "${link_0}",
          "target": {
            "href": "Fauna_in_the_World_of_Avatar",
            "page": "Fauna_in_the_World_of_Avatar"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "flying bison",
          "key": "${link_2}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_3}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "text": "Bison whistles are small wooden instruments used to attract various fauna in the World of Avatar. They are the only known instruments capable of calling flying bison from long distances. These antique whistles are thought by many to be worthless, but they were once used by the Air Nomads to herd their bison."
    },
    {
      "body": "Bison whistles produce sound waves too high in pitch to be picked up by human ears, and as such, are only noticeable to certain animals who can hear the high frequency and pinpoint its origin. They vary tremendously in design.",
      "links": [],
      "text": "Bison whistles produce sound waves too high in pitch to be picked up by human ears, and as such, are only noticeable to certain animals who can hear the high frequency and pinpoint its origin. They vary tremendously in design."
    },
    {
      "body": "On their journey to the ${link_0}, ${link_1} halted at a ${link_2} where ${link_3} could learn the first steps of ${link_4}. When ${link_5} taught Aang to create a large powerful wave, the young ${link_6} created a large wave that accidentally washed away their supplies, forcing the group to visit the ${link_7} in order to replace the lost items. Here, Aang purchased a supposedly authentic bison whistle for a ${link_8}, much to his companions' dismay.",
      "links": [
        {
          "body": "Northern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "waterfall lagoon",
          "key": "${link_2}",
          "target": {
            "href": "Waterfall_lagoon",
            "page": "Waterfall_lagoon"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_4}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Katara",
          "key": "${link_5}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_6}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "seedy merchants pier",
          "key": "${link_7}",
          "target": {
            "href": "Seedy_merchants_pier",
            "page": "Seedy_merchants_pier"
          }
        },
        {
          "body": "copper piece",
          "key": "${link_8}",
          "target": {
            "href": "Currency",
            "page": "Currency"
          }
        }
      ],
      "text": "On their journey to the Northern Water Tribe, Team Avatar halted at a waterfall lagoon where Aang could learn the first steps of waterbending. When Katara taught Aang to create a large powerful wave, the young Avatar created a large wave that accidentally washed away their supplies, forcing the group to visit the seedy merchants pier in order to replace the lost items. Here, Aang purchased a supposedly authentic bison whistle for a copper piece, much to his companions' dismay."
    },
    {
      "body": "Shortly after buying it, ${link_0} tested the potency of his whistle. ${link_1} was alarmed by the high-pitched frequencies.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Momo",
          "key": "${link_1}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "Shortly after buying it, Aang tested the potency of his whistle. Momo was alarmed by the high-pitched frequencies."
    },
    {
      "body": "When Aang blew into the whistle to test its performance, the team was surprised to find that it did not seem to produce any sound. ${link_0} was quick to declare the trinket a dupe and stated that Aang had been tricked by the merchant who sold it. However, unbeknownst to him and the rest of Team Avatar, the whistle was effective and was able to produce sound waves identifiable to nearby animals, such as ${link_1}. The purchase of the apparently worthless whistle caused Katara to collect the remaining copper pieces from Aang, much to the latter's disappointment.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Momo",
          "key": "${link_1}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "When Aang blew into the whistle to test its performance, the team was surprised to find that it did not seem to produce any sound. Sokka was quick to declare the trinket a dupe and stated that Aang had been tricked by the merchant who sold it. However, unbeknownst to him and the rest of Team Avatar, the whistle was effective and was able to produce sound waves identifiable to nearby animals, such as Momo. The purchase of the apparently worthless whistle caused Katara to collect the remaining copper pieces from Aang, much to the latter's disappointment."
    },
    {
      "body": "While browsing the many stalls in the pier, the team was enticed by a ${link_0} to enter a small ${link_1} ran by pirates that offered a wide selection of \"exotic curios\". Among the merchandise was a stolen ${link_2}, which Katara in turn stole from the pirates. This theft and an alliance with ${link_3} ${link_4} prompted the pirates to hunt down the Avatar.",
      "links": [
        {
          "body": "barker",
          "key": "${link_0}",
          "target": {
            "href": "Oh",
            "page": "Oh"
          }
        },
        {
          "body": "boutique",
          "key": "${link_1}",
          "target": {
            "href": "Pirate_ship_boutique",
            "page": "Pirate_ship_boutique"
          }
        },
        {
          "body": "waterbending scroll",
          "key": "${link_2}",
          "target": {
            "href": "Waterbending_scroll",
            "page": "Waterbending_scroll"
          }
        },
        {
          "body": "Prince",
          "key": "${link_3}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_4}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "While browsing the many stalls in the pier, the team was enticed by a barker to enter a small boutique ran by pirates that offered a wide selection of \"exotic curios\". Among the merchandise was a stolen waterbending scroll, which Katara in turn stole from the pirates. This theft and an alliance with Prince Zuko prompted the pirates to hunt down the Avatar."
    },
    {
      "body": "Amidst the chaos of the ensuing battle, Aang, Katara, and Sokka were able to hijack the pirates' ship. Forced down the river by the pursuing pirates, they were threatened by a waterfall not far ahead. Aang pulled out the bison whistle and blew on it, angering Sokka, who exclaimed that it was not the time to have \"flute practice\". Despite this, the whistle's vibrations were caught by ${link_0}, who arrived just in time to catch the threesome free-falling down the waterfall.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Amidst the chaos of the ensuing battle, Aang, Katara, and Sokka were able to hijack the pirates' ship. Forced down the river by the pursuing pirates, they were threatened by a waterfall not far ahead. Aang pulled out the bison whistle and blew on it, angering Sokka, who exclaimed that it was not the time to have \"flute practice\". Despite this, the whistle's vibrations were caught by Appa, who arrived just in time to catch the threesome free-falling down the waterfall."
    },
    {
      "body": "Brought down by a freak tornado raging over the ${link_0}, Appa and Momo got separated from their human companions. After Momo nibbled through the vines that held Appa suspended in the air, the two animals set out to find their friends. Hitching a ride on ${link_1}, the ${link_2} started snooping through the team's belongings and soon discovered the bison whistle. Much to Appa's dismay, Momo blew on the whistle and the high-pitched sound, emitted from such a close distance, hurt the bison's ears. Appa growled in pain at the sound; however, Momo did not get the hint as he blew on the whistle a second time. This time Appa ended the excruciating noise by slamming Momo unconscious with his tail.",
      "links": [
        {
          "body": "swamp",
          "key": "${link_0}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "Appa's saddle",
          "key": "${link_1}",
          "target": {
            "href": "Appa%27s_saddle",
            "page": "Appa%27s_saddle"
          }
        },
        {
          "body": "lemur",
          "key": "${link_2}",
          "target": {
            "href": "Winged_lemur",
            "page": "Winged_lemur"
          }
        }
      ],
      "text": "Brought down by a freak tornado raging over the swamp, Appa and Momo got separated from their human companions. After Momo nibbled through the vines that held Appa suspended in the air, the two animals set out to find their friends. Hitching a ride on Appa's saddle, the lemur started snooping through the team's belongings and soon discovered the bison whistle. Much to Appa's dismay, Momo blew on the whistle and the high-pitched sound, emitted from such a close distance, hurt the bison's ears. Appa growled in pain at the sound; however, Momo did not get the hint as he blew on the whistle a second time. This time Appa ended the excruciating noise by slamming Momo unconscious with his tail."
    },
    {
      "body": "After meeting Professor ${link_0} at the ${link_1}, Team Avatar decided to launch an expedition to find the ${link_2} in the ${link_3}. ${link_4} refused to go and remained outside with Appa. They were eventually spotted and cornered by ${link_5}, who had expressed interest in Appa earlier because flying bison were thought to be extinct. Toph was unable to adequately protect Appa, as the constant shifting of sand impaired her unique way of ${link_6} and she was restricted in her movements by her efforts to keep the sinking library afloat. Despite Appa's attempts to defend himself, the sandbenders overwhelmed the beast and departed with him on their ${link_7}.",
      "links": [
        {
          "body": "Zei",
          "key": "${link_0}",
          "target": {
            "href": "Zei",
            "page": "Zei"
          }
        },
        {
          "body": "Misty Palms Oasis",
          "key": "${link_1}",
          "target": {
            "href": "Misty_Palms_Oasis",
            "page": "Misty_Palms_Oasis"
          }
        },
        {
          "body": "Wan Shi Tong's Library",
          "key": "${link_2}",
          "target": {
            "href": "Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_3}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        },
        {
          "body": "Toph",
          "key": "${link_4}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "sandbenders",
          "key": "${link_5}",
          "target": {
            "href": "Sandbender_Tribes",
            "page": "Sandbender_Tribes"
          }
        },
        {
          "body": "seeing",
          "key": "${link_6}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        },
        {
          "body": "sand-sailers",
          "key": "${link_7}",
          "target": {
            "href": "Sand-sailer",
            "page": "Sand-sailer"
          }
        }
      ],
      "text": "After meeting Professor Zei at the Misty Palms Oasis, Team Avatar decided to launch an expedition to find the Wan Shi Tong's Library in the Si Wong Desert. Toph refused to go and remained outside with Appa. They were eventually spotted and cornered by sandbenders, who had expressed interest in Appa earlier because flying bison were thought to be extinct. Toph was unable to adequately protect Appa, as the constant shifting of sand impaired her unique way of seeing and she was restricted in her movements by her efforts to keep the sinking library afloat. Despite Appa's attempts to defend himself, the sandbenders overwhelmed the beast and departed with him on their sand-sailers."
    },
    {
      "body": "${link_0} heard the reverberations transmitted by ${link_1}'s whistle.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Appa heard the reverberations transmitted by Aang's whistle."
    },
    {
      "body": "Heartbroken, the ${link_0} set out to scour the desert in search of any trace of his oldest and best friend. During his quest, Aang used his bison whistle as a last-ditch effort to find his companion, though he assumed that Appa was long gone due to a lack of response. However, Appa was able to pick up the whistle's sound while being secured for shipment and began to struggle wildly in an attempt to escape. However, he was soon sedated with ${link_1} by the ${link_2}, which immediately rendered him unconscious and unable to answer Aang's call.",
      "links": [
        {
          "body": "airbender",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "shirshu-spit darts",
          "key": "${link_1}",
          "target": {
            "href": "Shirshu-spit_darts",
            "page": "Shirshu-spit_darts"
          }
        },
        {
          "body": "merchants",
          "key": "${link_2}",
          "target": {
            "href": "Beetle-headed_merchants",
            "page": "Beetle-headed_merchants"
          }
        }
      ],
      "text": "Heartbroken, the airbender set out to scour the desert in search of any trace of his oldest and best friend. During his quest, Aang used his bison whistle as a last-ditch effort to find his companion, though he assumed that Appa was long gone due to a lack of response. However, Appa was able to pick up the whistle's sound while being secured for shipment and began to struggle wildly in an attempt to escape. However, he was soon sedated with shirshu-spit darts by the merchants, which immediately rendered him unconscious and unable to answer Aang's call."
    },
    {
      "body": "Appa regained his freedom after being caged in a ${link_0}, being chased by a ${link_1}, fighting a ${link_2}, meeting ${link_3} and her ${link_4} as well as ${link_5} and ${link_6}, and discovering Guru ${link_7} at the ${link_8}. The bison eventually made his way to the ${link_9} capital, ${link_10}, where he heard the call of a bison whistle and rushed to locate its origin, hoping to find Aang. Instead, he found ${link_11}, using a similar whistle, who trapped him underground not long after.",
      "links": [
        {
          "body": "Fire Nation circus",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_circus",
            "page": "Fire_Nation_circus"
          }
        },
        {
          "body": "farmer and his wife",
          "key": "${link_1}",
          "target": {
            "href": "Farmer_and_wife",
            "page": "Farmer_and_wife"
          }
        },
        {
          "body": "boar-q-pine",
          "key": "${link_2}",
          "target": {
            "href": "Boar-q-pine",
            "page": "Boar-q-pine"
          }
        },
        {
          "body": "Suki",
          "key": "${link_3}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_4}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Azula",
          "key": "${link_5}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "her party",
          "key": "${link_6}",
          "target": {
            "href": "Azula%27s_team",
            "page": "Azula%27s_team"
          }
        },
        {
          "body": "Pathik",
          "key": "${link_7}",
          "target": {
            "href": "Pathik",
            "page": "Pathik"
          }
        },
        {
          "body": "Eastern Air Temple",
          "key": "${link_8}",
          "target": {
            "href": "Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_9}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_10}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_11}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        }
      ],
      "text": "Appa regained his freedom after being caged in a Fire Nation circus, being chased by a farmer and his wife, fighting a boar-q-pine, meeting Suki and her Kyoshi Warriors as well as Azula and her party, and discovering Guru Pathik at the Eastern Air Temple. The bison eventually made his way to the Earth Kingdom capital, Ba Sing Se, where he heard the call of a bison whistle and rushed to locate its origin, hoping to find Aang. Instead, he found Long Feng, using a similar whistle, who trapped him underground not long after."
    },
    {
      "body": "${link_0} created a massive sound wave by using his ${link_1} and whistle.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "airbending",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Aang created a massive sound wave by using his airbending and whistle."
    },
    {
      "body": "After seeing the horrid conditions within ${link_0}, Aang offered to help the establishment's administrator, ${link_1}, in creating a more spacious environment. Kenji expressed doubts about Aang's ability to control all the animals, to which he replied that there was no need to worry, as he was great with animals.",
      "links": [
        {
          "body": "Ba Sing Se Zoo",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se_Zoo",
            "page": "Ba_Sing_Se_Zoo"
          }
        },
        {
          "body": "Kenji",
          "key": "${link_1}",
          "target": {
            "href": "Kenji",
            "page": "Kenji"
          }
        }
      ],
      "text": "After seeing the horrid conditions within Ba Sing Se Zoo, Aang offered to help the establishment's administrator, Kenji, in creating a more spacious environment. Kenji expressed doubts about Aang's ability to control all the animals, to which he replied that there was no need to worry, as he was great with animals."
    },
    {
      "body": "Contrary to this, the zoo's collection of fauna went on a rampage following their release from captivity. In order to herd the animals, Aang used ${link_0} to produce a magnified call from his bison whistle. It was effective and the animals rushed toward Aang, who directed them toward the ${link_1}. Once outside the city, Aang used a combination of airbending and ${link_2} to create artificial landforms such as trenches and mountains, in order to provide the animals with relatively realistic environments similar to what would be found in the wild.",
      "links": [
        {
          "body": "airbending",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Agrarian Zone",
          "key": "${link_1}",
          "target": {
            "href": "Ba_Sing_Se#Agrarian_Zone",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Contrary to this, the zoo's collection of fauna went on a rampage following their release from captivity. In order to herd the animals, Aang used airbending to produce a magnified call from his bison whistle. It was effective and the animals rushed toward Aang, who directed them toward the Agrarian Zone. Once outside the city, Aang used a combination of airbending and earthbending to create artificial landforms such as trenches and mountains, in order to provide the animals with relatively realistic environments similar to what would be found in the wild."
    },
    {
      "body": "Aang's whistle was acquired from the seedy merchants pier for the price of one copper piece. The instrument is generally white in color apart from two silver sections. Aang's bison whistle is designed in the likeness of a sky bison, though only in shape. It is relatively plain in appearance and as such, does not have detailing to outline the bison's fur, nor does it depict the flying bison's arrows.",
      "links": [],
      "text": "Aang's whistle was acquired from the seedy merchants pier for the price of one copper piece. The instrument is generally white in color apart from two silver sections. Aang's bison whistle is designed in the likeness of a sky bison, though only in shape. It is relatively plain in appearance and as such, does not have detailing to outline the bison's fur, nor does it depict the flying bison's arrows."
    },
    {
      "body": "Aang's whistle is capable of producing long-range reverberations that can effectively attract animals in large numbers scattered over a given area of land. In conjunction with airbending, it can prove to be quite potent. The call transmitted by Aang's whistle can only be picked up by animals and is undetectable by humans.",
      "links": [],
      "text": "Aang's whistle is capable of producing long-range reverberations that can effectively attract animals in large numbers scattered over a given area of land. In conjunction with airbending, it can prove to be quite potent. The call transmitted by Aang's whistle can only be picked up by animals and is undetectable by humans."
    },
    {
      "body": "${link_0} used his whistle to lure ${link_1} into ${link_2}.",
      "links": [
        {
          "body": "Long Feng",
          "key": "${link_0}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_2}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "Long Feng used his whistle to lure Appa into Ba Sing Se."
    },
    {
      "body": "Long Feng's whistle is a whistle similar in capabilities to Aang's whistle; however, the two instruments vary greatly in appearance. Long Feng's whistle is considerably longer than Aang's, with a large rectangular gap near the edge where sound escapes. The whistle is fairly angular, with long flat surfaces throughout. The device ends in a circular swirl, reminiscent to components present in various ${link_0} from the ${link_1}.",
      "links": [
        {
          "body": "architectural structures",
          "key": "${link_0}",
          "target": {
            "href": "Architecture_in_the_World_of_Avatar",
            "page": "Architecture_in_the_World_of_Avatar"
          }
        },
        {
          "body": "air temples",
          "key": "${link_1}",
          "target": {
            "href": "Air_temple",
            "page": "Air_temple"
          }
        }
      ],
      "text": "Long Feng's whistle is a whistle similar in capabilities to Aang's whistle; however, the two instruments vary greatly in appearance. Long Feng's whistle is considerably longer than Aang's, with a large rectangular gap near the edge where sound escapes. The whistle is fairly angular, with long flat surfaces throughout. The device ends in a circular swirl, reminiscent to components present in various architectural structures from the air temples."
    },
    {
      "body": "This whistle was only seen once and as such, its capabilities are not certain. It does possess the ability to call flying bison and like Aang's whistle, also produces vibrations too high in pitch for human ears to detect.",
      "links": [],
      "text": "This whistle was only seen once and as such, its capabilities are not certain. It does possess the ability to call flying bison and like Aang's whistle, also produces vibrations too high in pitch for human ears to detect."
    },
    {
      "body": "After bonding with a ${link_0} of her own, ${link_1} carried around her own type of whistle to call the animal to her. The small, wooden device had a handle just long enough to hold in a fist and its end was crafted in the image of a flying bison head, making the air escape through the horns.",
      "links": [
        {
          "body": "flying bison",
          "key": "${link_0}",
          "target": {
            "href": "Juicy",
            "page": "Juicy"
          }
        },
        {
          "body": "Opal",
          "key": "${link_1}",
          "target": {
            "href": "Opal",
            "page": "Opal"
          }
        }
      ],
      "text": "After bonding with a flying bison of her own, Opal carried around her own type of whistle to call the animal to her. The small, wooden device had a handle just long enough to hold in a fist and its end was crafted in the image of a flying bison head, making the air escape through the horns."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Bison_whistle",
    "file": "avatar.wikia.com/wiki/Bison_whistle.html",
    "page": "Bison_whistle",
    "title": "Bison whistle"
  }
}