{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Featured articles",
      "target": {
        "href": "Category_Featured_articles",
        "page": "Category_Featured_articles"
      }
    },
    {
      "body": "A-class articles",
      "target": {
        "href": "Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Specialized bending techniques",
      "target": {
        "href": "Category_Specialized_bending_techniques",
        "page": "Category_Specialized_bending_techniques"
      }
    },
    {
      "body": "Waterbending",
      "target": {
        "href": "Category_Waterbending",
        "page": "Category_Waterbending"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} used bloodbending against ${link_1} ${link_2} in order to capture and imprison her.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Tarrlok used bloodbending against Avatar Korra in order to capture and imprison her."
    },
    {
      "body": "Bloodbending is a ${link_0} of ${link_1} that allows an extremely advanced waterbender to take hold of and manipulate fluids within an organism's body, allowing the bender to move the person's muscles. This technique is referred to as the darkest, most powerful, and most feared of all bending techniques, and it is the only art known to endanger the user's mental state.",
      "links": [
        {
          "body": "sub-skill",
          "key": "${link_0}",
          "target": {
            "href": "Specialized_bending_techniques",
            "page": "Specialized_bending_techniques"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Bloodbending is a sub-skill of waterbending that allows an extremely advanced waterbender to take hold of and manipulate fluids within an organism's body, allowing the bender to move the person's muscles. This technique is referred to as the darkest, most powerful, and most feared of all bending techniques, and it is the only art known to endanger the user's mental state."
    },
    {
      "body": "The technique was discovered by a waterbender named ${link_0} while she was detained in a ${link_1} designed by the ${link_2} specifically to hold waterbenders. During her detainment, she concluded that all life contains water and proceeded to develop the knowledge and skills of the art by practicing on ${link_3}.",
      "links": [
        {
          "body": "Hama",
          "key": "${link_0}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "prison",
          "key": "${link_1}",
          "target": {
            "href": "Waterbender_prison",
            "page": "Waterbender_prison"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "elephant rats",
          "key": "${link_3}",
          "target": {
            "href": "Elephant_rat",
            "page": "Elephant_rat"
          }
        }
      ],
      "text": "The technique was discovered by a waterbender named Hama while she was detained in a prison designed by the Fire Nation specifically to hold waterbenders. During her detainment, she concluded that all life contains water and proceeded to develop the knowledge and skills of the art by practicing on elephant rats."
    },
    {
      "body": "The forms and styles used by bloodbenders resemble how a puppeteer controls a marionette. Whereas waterbending uses flowing motions with the arms, bloodbending seems to require a more rigid and abrupt form of movement, further highlighting how different it is from the primary waterbending forms and its other sub-skill, ${link_0}.",
      "links": [
        {
          "body": "healing",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "The forms and styles used by bloodbenders resemble how a puppeteer controls a marionette. Whereas waterbending uses flowing motions with the arms, bloodbending seems to require a more rigid and abrupt form of movement, further highlighting how different it is from the primary waterbending forms and its other sub-skill, healing."
    },
    {
      "body": "Due to its extreme nature, only a handful of waterbenders have demonstrated the ability to bloodbend. The technique is deemed to be a dark art and is rarely used in combat by most waterbenders. The complexity and sophistication required to perform the art usually only allows for its use during a full moon, when a waterbender's power is at its absolute peak. Only ${link_0}, ${link_1}, and ${link_2} have shown the ability of performing the art without the aid of the full moon. Being naturally talented and having trained vigorously, Yakone and Amon were capable of bloodbending without using their arms, also known as psychic bloodbending.",
      "links": [
        {
          "body": "Yakone",
          "key": "${link_0}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_1}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Amon",
          "key": "${link_2}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        }
      ],
      "text": "Due to its extreme nature, only a handful of waterbenders have demonstrated the ability to bloodbend. The technique is deemed to be a dark art and is rarely used in combat by most waterbenders. The complexity and sophistication required to perform the art usually only allows for its use during a full moon, when a waterbender's power is at its absolute peak. Only Yakone, Tarrlok, and Amon have shown the ability of performing the art without the aid of the full moon. Being naturally talented and having trained vigorously, Yakone and Amon were capable of bloodbending without using their arms, also known as psychic bloodbending."
    },
    {
      "body": "Bloodbending is infrequently applied to daily activities. Knowledge of the art eventually became known to the public, and the practice of bloodbending was outlawed due to the efforts of ${link_0} following the formation of ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "text": "Bloodbending is infrequently applied to daily activities. Knowledge of the art eventually became known to the public, and the practice of bloodbending was outlawed due to the efforts of Katara following the formation of Republic City."
    },
    {
      "body": "After being captured during one of the ${link_0} ${link_1} aimed at weakening the ${link_2}, Hama, along with her fellow waterbenders, was sent to a maximum security prison in the Fire Nation designed specifically to hold benders of her kind. There, the guards were cautious of providing prisoners with any form of bendable substance that they could utilize in making a reprisal, going so far as to chain the limbs of the prisoners before they were allowed to drink and using \"cruel retribution\" at any sign of resistance.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "raids",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "After being captured during one of the Fire Nation raids aimed at weakening the Southern Water Tribe, Hama, along with her fellow waterbenders, was sent to a maximum security prison in the Fire Nation designed specifically to hold benders of her kind. There, the guards were cautious of providing prisoners with any form of bendable substance that they could utilize in making a reprisal, going so far as to chain the limbs of the prisoners before they were allowed to drink and using \"cruel retribution\" at any sign of resistance."
    },
    {
      "body": "Despite the helplessness she faced while imprisoned, Hama was able to feel the enrichment provided to her by the full moon. She began to devise a plan that would lead to her escape and eventually realized that the elephant rats constantly scurrying around the bottom of her cage were filled with bendable water.",
      "links": [],
      "text": "Despite the helplessness she faced while imprisoned, Hama was able to feel the enrichment provided to her by the full moon. She began to devise a plan that would lead to her escape and eventually realized that the elephant rats constantly scurrying around the bottom of her cage were filled with bendable water."
    },
    {
      "body": "${link_0} developed bloodbending in a ${link_1} ${link_2} by subduing an ${link_3}.",
      "links": [
        {
          "body": "Hama",
          "key": "${link_0}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "prison",
          "key": "${link_2}",
          "target": {
            "href": "Waterbender_prison",
            "page": "Waterbender_prison"
          }
        },
        {
          "body": "elephant rat",
          "key": "${link_3}",
          "target": {
            "href": "Elephant_rat",
            "page": "Elephant_rat"
          }
        }
      ],
      "text": "Hama developed bloodbending in a Fire Nation prison by subduing an elephant rat."
    },
    {
      "body": "Upon the arrival of the next full moon, Hama attempted to take hold of the fluids within one of the creatures and succeeded, successfully performing bloodbending for the first time. In the following months, enhanced by the full moon, she continued to develop the technique, mastering it to a point at which she could effectively control the movement of an entire horde of rats.",
      "links": [],
      "text": "Upon the arrival of the next full moon, Hama attempted to take hold of the fluids within one of the creatures and succeeded, successfully performing bloodbending for the first time. In the following months, enhanced by the full moon, she continued to develop the technique, mastering it to a point at which she could effectively control the movement of an entire horde of rats."
    },
    {
      "body": "During the next full moon, Hama used bloodbending to control a passing guard, forcing him to open her cage and allow her to escape. Hama walked free for the first time in many years and eventually settled in a ${link_0} near the outskirts of the Fire Nation archipelago.",
      "links": [
        {
          "body": "village",
          "key": "${link_0}",
          "target": {
            "href": "Hama%27s_village",
            "page": "Hama%27s_village"
          }
        }
      ],
      "text": "During the next full moon, Hama used bloodbending to control a passing guard, forcing him to open her cage and allow her to escape. Hama walked free for the first time in many years and eventually settled in a village near the outskirts of the Fire Nation archipelago."
    },
    {
      "body": "While imprisoned, Hama developed a deep hatred for the Fire Nation, and she vowed to take revenge at every instance possible. She created a ${link_0} underneath a mountain and formulated a plan where she would control unsuspecting Fire Nation villagers and lead them to the prison during a full moon. She used this technique and eventually imprisoned the owner of a quaint little ${link_1}. Hama became the inn's proprietor and was able to repress accusations of being the one responsible for the disappearances by disguising herself as a sweet old innkeeper.",
      "links": [
        {
          "body": "makeshift prison",
          "key": "${link_0}",
          "target": {
            "href": "Mountain_prison",
            "page": "Mountain_prison"
          }
        },
        {
          "body": "inn",
          "key": "${link_1}",
          "target": {
            "href": "Hama%27s_inn",
            "page": "Hama%27s_inn"
          }
        }
      ],
      "text": "While imprisoned, Hama developed a deep hatred for the Fire Nation, and she vowed to take revenge at every instance possible. She created a makeshift prison underneath a mountain and formulated a plan where she would control unsuspecting Fire Nation villagers and lead them to the prison during a full moon. She used this technique and eventually imprisoned the owner of a quaint little inn. Hama became the inn's proprietor and was able to repress accusations of being the one responsible for the disappearances by disguising herself as a sweet old innkeeper."
    },
    {
      "body": "During one of those nights, she planned to imprison an old man, ${link_0}. The plan was initially successful, and Ding felt helpless as he was \"possessed\" by an unknown force. He was slowly led to the top of the mountain, but before he could be imprisoned inside a cave, the sun began to rise, and the power that Hama held over him quickly faded. Regaining control over his body, Ding sprinted away from the scene; he remained the only villager to ever avoid being captured by the bloodbender.",
      "links": [
        {
          "body": "Ding",
          "key": "${link_0}",
          "target": {
            "href": "Ding",
            "page": "Ding"
          }
        }
      ],
      "text": "During one of those nights, she planned to imprison an old man, Ding. The plan was initially successful, and Ding felt helpless as he was \"possessed\" by an unknown force. He was slowly led to the top of the mountain, but before he could be imprisoned inside a cave, the sun began to rise, and the power that Hama held over him quickly faded. Regaining control over his body, Ding sprinted away from the scene; he remained the only villager to ever avoid being captured by the bloodbender."
    },
    {
      "body": "During the summer of 100 ${link_0}, ${link_1} decided to camp near a Fire Nation village. However, Hama overheard them telling horror stories and deducted from Katara's story about ${link_2} that they were from the Southern Water Tribe and offered the group a place in her inn.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Nini",
          "key": "${link_2}",
          "target": {
            "href": "Nini",
            "page": "Nini"
          }
        }
      ],
      "text": "During the summer of 100 AG, Team Avatar decided to camp near a Fire Nation village. However, Hama overheard them telling horror stories and deducted from Katara's story about Nini that they were from the Southern Water Tribe and offered the group a place in her inn."
    },
    {
      "body": "Upon discovering an old ${link_0} in Hama's attic, she revealed herself to be a waterbender from the Southern Water Tribe and proposed to teach Katara some original Southern Tribe waterbending techniques, so that she could pass on the knowledge of the Southern customs before her death, to which Katara happily agreed.",
      "links": [
        {
          "body": "whale tooth comb",
          "key": "${link_0}",
          "target": {
            "href": "Whale_tooth_comb",
            "page": "Whale_tooth_comb"
          }
        }
      ],
      "text": "Upon discovering an old whale tooth comb in Hama's attic, she revealed herself to be a waterbender from the Southern Water Tribe and proposed to teach Katara some original Southern Tribe waterbending techniques, so that she could pass on the knowledge of the Southern customs before her death, to which Katara happily agreed."
    },
    {
      "body": "${link_0} demonstrated to ${link_1} how there is water inside all living beings.",
      "links": [
        {
          "body": "Hama",
          "key": "${link_0}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Hama demonstrated to Katara how there is water inside all living beings."
    },
    {
      "body": "Katara spent the next day learning various techniques from Hama, such as bending moisture from the air and water from within plants, including ${link_0}, when no bodies of water were present. Hama told Katara that she would teach her the ultimate waterbending technique at night, during the full moon, when their powers were at their peak. Katara was hesitant, claiming that villagers had been disappearing during the full moon, though Hama seemed unaffected, stating that two master waterbenders under a full moon had nothing to worry about.",
      "links": [
        {
          "body": "fire lilies",
          "key": "${link_0}",
          "target": {
            "href": "Fire_lily",
            "page": "Fire_lily"
          }
        }
      ],
      "text": "Katara spent the next day learning various techniques from Hama, such as bending moisture from the air and water from within plants, including fire lilies, when no bodies of water were present. Hama told Katara that she would teach her the ultimate waterbending technique at night, during the full moon, when their powers were at their peak. Katara was hesitant, claiming that villagers had been disappearing during the full moon, though Hama seemed unaffected, stating that two master waterbenders under a full moon had nothing to worry about."
    },
    {
      "body": "That night, Hama took Katara to the forest where she explained her imprisonment and discovery of bloodbending. Katara was horrified and refused to learn the art when Hama urged her. This angered Hama, who used bloodbending to control Katara. The young waterbender pleaded for mercy, but Hama refused to release her. Feeling the power of the moon enforce her waterbending as well, Katara honed her energy and broke free, stating that her own bending was more powerful than Hama's. The two began to duel, and Katara almost immediately took the upper hand.",
      "links": [],
      "text": "That night, Hama took Katara to the forest where she explained her imprisonment and discovery of bloodbending. Katara was horrified and refused to learn the art when Hama urged her. This angered Hama, who used bloodbending to control Katara. The young waterbender pleaded for mercy, but Hama refused to release her. Feeling the power of the moon enforce her waterbending as well, Katara honed her energy and broke free, stating that her own bending was more powerful than Hama's. The two began to duel, and Katara almost immediately took the upper hand."
    },
    {
      "body": "${link_0} was ultimately forced to bloodbend ${link_1} to ensure the safety of ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Hama",
          "key": "${link_1}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "her friends",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Katara was ultimately forced to bloodbend Hama to ensure the safety of her friends."
    },
    {
      "body": "Having discovered the truth about Hama from the villagers she imprisoned deep within the mountain, ${link_0} and ${link_1} arrived soon afterward to aid Katara and told Hama to surrender since she was clearly outnumbered. Hama refused and used bloodbending to control them. Like a puppetmaster, she used them to attack Katara, though the young waterbender managed to avoid being hit. Adopting a different approach, Hama maneuvered Aang toward Sokka, who had raised his ${link_2}. Katara, in an attempt to save Aang, used bloodbending to stop her, effectively breaking Hama's hold on the boys. She released the elder following the arrival of ${link_3} and the freed villagers, who escorted Hama away from the scene. Now apprehended, Hama congratulated Katara on becoming a bloodbender, causing the young waterbender to break down into tears.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "sword",
          "key": "${link_2}",
          "target": {
            "href": "Sokka%27s_sword",
            "page": "Sokka%27s_sword"
          }
        },
        {
          "body": "Toph",
          "key": "${link_3}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Having discovered the truth about Hama from the villagers she imprisoned deep within the mountain, Sokka and Aang arrived soon afterward to aid Katara and told Hama to surrender since she was clearly outnumbered. Hama refused and used bloodbending to control them. Like a puppetmaster, she used them to attack Katara, though the young waterbender managed to avoid being hit. Adopting a different approach, Hama maneuvered Aang toward Sokka, who had raised his sword. Katara, in an attempt to save Aang, used bloodbending to stop her, effectively breaking Hama's hold on the boys. She released the elder following the arrival of Toph and the freed villagers, who escorted Hama away from the scene. Now apprehended, Hama congratulated Katara on becoming a bloodbender, causing the young waterbender to break down into tears."
    },
    {
      "body": "Sometime later, when ${link_0} and Katara went to search for the man who killed Katara's mother, Katara, overwhelmed by rage and grief, used bloodbending to subdue the ${link_1} despite her moral objections against using the dark art.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Southern Raiders commander",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Raiders_commander",
            "page": "Southern_Raiders_commander"
          }
        }
      ],
      "text": "Sometime later, when Zuko and Katara went to search for the man who killed Katara's mother, Katara, overwhelmed by rage and grief, used bloodbending to subdue the Southern Raiders commander despite her moral objections against using the dark art."
    },
    {
      "body": "${link_0} bloodbent ${link_1} ${link_2} after having been found guilty during the former's ${link_3}.",
      "links": [
        {
          "body": "Yakone",
          "key": "${link_0}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        },
        {
          "body": "Councilman",
          "key": "${link_1}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_2}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "trial",
          "key": "${link_3}",
          "target": {
            "href": "Yakone%27s_trial",
            "page": "Yakone%27s_trial"
          }
        }
      ],
      "text": "Yakone bloodbent Councilman Sokka after having been found guilty during the former's trial."
    },
    {
      "body": "Following the end of the ${link_0}, knowledge regarding bloodbending became widespread and, with Katara's involvement, the ${link_1} outlawed the bending art sometime before 128 AG. Regardless, a man named Yakone had the unique ability to use bloodbending without the need of a full moon and used this skill to rule Republic City from its \"rotten underbelly\", becoming the city's most notorious criminal malefactor in a matter of years. Following many acquittals in his favor, since it was considered impossible for one to bloodbend without the full moon, Yakone was eventually tried and arrested for multiple counts of bloodbending, for which the ${link_2} found him guilty.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "United Republic of Nations",
          "key": "${link_1}",
          "target": {
            "href": "United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        },
        {
          "body": "United Republic Council",
          "key": "${link_2}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        }
      ],
      "text": "Following the end of the Hundred Year War, knowledge regarding bloodbending became widespread and, with Katara's involvement, the United Republic of Nations outlawed the bending art sometime before 128 AG. Regardless, a man named Yakone had the unique ability to use bloodbending without the need of a full moon and used this skill to rule Republic City from its \"rotten underbelly\", becoming the city's most notorious criminal malefactor in a matter of years. Following many acquittals in his favor, since it was considered impossible for one to bloodbend without the full moon, Yakone was eventually tried and arrested for multiple counts of bloodbending, for which the United Republic Council found him guilty."
    },
    {
      "body": "As he was condemned to life in prison, Yakone subdued the entire courtroom by using psychic bloodbending, rendering every individual unconscious before he escaped. ${link_0} Aang, who was also rendered unconscious Yakone's bloodbending, roused himself by entering the ${link_1} and gave chase to the convict. Forced to defend himself, Yakone took hold of Aang with bloodbending once more with lethal intent, but the Avatar broke free after entering the Avatar State a second time and trapped Yakone in an earth cone. With the criminal unable to move, Aang ${link_2} his bending, ending his reign as head of Republic City's criminal empire.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_1}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "removed",
          "key": "${link_2}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        }
      ],
      "text": "As he was condemned to life in prison, Yakone subdued the entire courtroom by using psychic bloodbending, rendering every individual unconscious before he escaped. Avatar Aang, who was also rendered unconscious Yakone's bloodbending, roused himself by entering the Avatar State and gave chase to the convict. Forced to defend himself, Yakone took hold of Aang with bloodbending once more with lethal intent, but the Avatar broke free after entering the Avatar State a second time and trapped Yakone in an earth cone. With the criminal unable to move, Aang removed his bending, ending his reign as head of Republic City's criminal empire."
    },
    {
      "body": "At some point, Yakone managed to escape successfully and fled from Republic City to the ${link_0}, surgically altering his appearance to conceal his true identity. There, he met and fell in love with a ${link_1}, whom he later married. The two went on to raise two sons, Noatak and Tarrlok, both of whom were waterbenders. Yakone, fueled by hatred for the Avatar for stripping him of his bending abilities, began training his sons in the art of bloodbending through frequent \"hunting trips\". With time, the two waterbenders became increasingly more proficient in the art, eventually learning to use bloodbending without the need of a full moon. Noatak exhibited prodigious skill in the art form and mastered Yakone's psychic bloodbending technique by the age of fourteen.",
      "links": [
        {
          "body": "Northern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "local woman",
          "key": "${link_1}",
          "target": {
            "href": "Yakone%27s_wife",
            "page": "Yakone%27s_wife"
          }
        }
      ],
      "text": "At some point, Yakone managed to escape successfully and fled from Republic City to the Northern Water Tribe, surgically altering his appearance to conceal his true identity. There, he met and fell in love with a local woman, whom he later married. The two went on to raise two sons, Noatak and Tarrlok, both of whom were waterbenders. Yakone, fueled by hatred for the Avatar for stripping him of his bending abilities, began training his sons in the art of bloodbending through frequent \"hunting trips\". With time, the two waterbenders became increasingly more proficient in the art, eventually learning to use bloodbending without the need of a full moon. Noatak exhibited prodigious skill in the art form and mastered Yakone's psychic bloodbending technique by the age of fourteen."
    },
    {
      "body": "After ${link_0} had mastered bloodbending, he turned on his powerless ${link_1}, who was threatening ${link_2}.",
      "links": [
        {
          "body": "Noatak",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "father",
          "key": "${link_1}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_2}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        }
      ],
      "text": "After Noatak had mastered bloodbending, he turned on his powerless father, who was threatening Tarrlok."
    },
    {
      "body": "In order to push their abilities to their peaks, Yakone forced both of his sons to bloodbend one another. Although Noatak willingly complied with his father's orders and bloodbent his younger brother into submission, Tarrlok refused to do the same, repulsed by the idea of controlling his brother and making him feel helpless. Yakone was infuriated, making a move to harm Tarrlok before he was stopped by Noatak, who immobilized him with bloodbending. Noatak asked Tarrlok to run away with him and begin life anew, but the younger refused, prompting Noatak to leave into the wilderness by himself. Sometime later, Noatak discovered how to use bloodbending to block off chi paths and thus disable a person's bending ability permanently.",
      "links": [],
      "text": "In order to push their abilities to their peaks, Yakone forced both of his sons to bloodbend one another. Although Noatak willingly complied with his father's orders and bloodbent his younger brother into submission, Tarrlok refused to do the same, repulsed by the idea of controlling his brother and making him feel helpless. Yakone was infuriated, making a move to harm Tarrlok before he was stopped by Noatak, who immobilized him with bloodbending. Noatak asked Tarrlok to run away with him and begin life anew, but the younger refused, prompting Noatak to leave into the wilderness by himself. Sometime later, Noatak discovered how to use bloodbending to block off chi paths and thus disable a person's bending ability permanently."
    },
    {
      "body": "${link_0} revealed his ability to bloodbend when he employed it on ${link_1} in ${link_2} without the presence of a full moon.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "City Hall",
          "key": "${link_2}",
          "target": {
            "href": "City_Hall",
            "page": "City_Hall"
          }
        }
      ],
      "text": "Tarrlok revealed his ability to bloodbend when he employed it on Korra in City Hall without the presence of a full moon."
    },
    {
      "body": "Though Yakone no longer trained him following Noatak's presumed death, Tarrlok ended up following in his father's footsteps in taking over Republic City, doing so from a political standpoint by becoming a councilman. In 170 AG, Tarrlok revealed his true identity as a bloodbender during an altercation with Avatar ${link_0} in ${link_1}, using the art to subdue her before she could finish him off with fire blasts. Tarrlok knocked Korra out and imprisoned her in a ${link_2} outside of Republic City, covering his tracks by attributing the abduction to an ${link_3} attack. However, his lies about Korra's disappearance were uncovered by ${link_4}, ${link_5}, and ${link_6}, forcing him to use his bloodbending abilities once again to evade arrest.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "City Hall",
          "key": "${link_1}",
          "target": {
            "href": "City_Hall",
            "page": "City_Hall"
          }
        },
        {
          "body": "cabin",
          "key": "${link_2}",
          "target": {
            "href": "Tarrlok%27s_hideout",
            "page": "Tarrlok%27s_hideout"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_3}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_4}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_5}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_6}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        }
      ],
      "text": "Though Yakone no longer trained him following Noatak's presumed death, Tarrlok ended up following in his father's footsteps in taking over Republic City, doing so from a political standpoint by becoming a councilman. In 170 AG, Tarrlok revealed his true identity as a bloodbender during an altercation with Avatar Korra in City Hall, using the art to subdue her before she could finish him off with fire blasts. Tarrlok knocked Korra out and imprisoned her in a cabin outside of Republic City, covering his tracks by attributing the abduction to an Equalist attack. However, his lies about Korra's disappearance were uncovered by Team Avatar, Lin Beifong, and Tenzin, forcing him to use his bloodbending abilities once again to evade arrest."
    },
    {
      "body": "Shortly after fleeing Republic City, Tarrlok was confronted by Noatak in the disguise of Amon, who stated that it was time that Tarrlok was \"equalized\". Declaring that the Equalists had not faced a bender like him, Tarrlok proceeded to use bloodbending to immobilize his assailants, subduing all but Amon himself, much to his surprise. Only slightly affected by Tarrlok's hold, Amon made his way toward Tarrlok before removing his bending. Shortly after, Tarrlok recognized the sensation he felt as Noatak's bloodbending hold and realized that Amon was none other than his brother.",
      "links": [],
      "text": "Shortly after fleeing Republic City, Tarrlok was confronted by Noatak in the disguise of Amon, who stated that it was time that Tarrlok was \"equalized\". Declaring that the Equalists had not faced a bender like him, Tarrlok proceeded to use bloodbending to immobilize his assailants, subduing all but Amon himself, much to his surprise. Only slightly affected by Tarrlok's hold, Amon made his way toward Tarrlok before removing his bending. Shortly after, Tarrlok recognized the sensation he felt as Noatak's bloodbending hold and realized that Amon was none other than his brother."
    },
    {
      "body": "During Korra and Mako's mission to find and confront Amon, the two ran into Tarrlok, who was locked in an attic on ${link_0} due to his knowledge of Amon's identity. Tarrlok proceeded to reveal that Amon was his brother and suggested that he somehow blocked bending through the use of bloodbending. This ability helped him become the leader of the ${link_1}, as he claimed that the spirits granted him with the special ability to take bending away.",
      "links": [
        {
          "body": "Air Temple Island",
          "key": "${link_0}",
          "target": {
            "href": "Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Anti-bending Revolution",
          "key": "${link_1}",
          "target": {
            "href": "Anti-bending_Revolution",
            "page": "Anti-bending_Revolution"
          }
        }
      ],
      "text": "During Korra and Mako's mission to find and confront Amon, the two ran into Tarrlok, who was locked in an attic on Air Temple Island due to his knowledge of Amon's identity. Tarrlok proceeded to reveal that Amon was his brother and suggested that he somehow blocked bending through the use of bloodbending. This ability helped him become the leader of the Anti-bending Revolution, as he claimed that the spirits granted him with the special ability to take bending away."
    },
    {
      "body": "${link_0} bloodbent ${link_1} and ${link_2} to keep them from escaping or attacking him.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_2}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "Amon bloodbent Korra and Mako to keep them from escaping or attacking him."
    },
    {
      "body": "Planning to expose Amon and undermine his revolution, Korra and Mako infiltrated Amon's rally at the ${link_0}, where Amon announced that he would rid the world of ${link_1} forever, revealing he had captured Tenzin's family. Korra and Mako used ${link_2} to free the airbenders and opted to stay behind to create a diversion while Tenzin and his family escaped. Korra hid beneath a table in an abandoned gym, where she was pulled out from hiding by Amon's bloodbending. As she was suspended in midair, Mako emerged and attacked, but was quickly overpowered by Amon's bloodbending as well. Finally having subdued the Avatar, Amon removed her bending.",
      "links": [
        {
          "body": "Pro-bending Arena",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "airbending",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "firebending",
          "key": "${link_2}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Planning to expose Amon and undermine his revolution, Korra and Mako infiltrated Amon's rally at the Pro-bending Arena, where Amon announced that he would rid the world of airbending forever, revealing he had captured Tenzin's family. Korra and Mako used firebending to free the airbenders and opted to stay behind to create a diversion while Tenzin and his family escaped. Korra hid beneath a table in an abandoned gym, where she was pulled out from hiding by Amon's bloodbending. As she was suspended in midair, Mako emerged and attacked, but was quickly overpowered by Amon's bloodbending as well. Finally having subdued the Avatar, Amon removed her bending."
    },
    {
      "body": "Unknown to Amon, the ${link_0} had followed his leader and witnessed his bloodbending. Branding Amon to be a traitor, the Lieutenant attacked but was stopped by bloodbending. Amon told the Lieutenant that he had served him well, before launching him into a pile of timber. The interruption dealt with, he walked past the now weakened Korra to approach Mako and started to bloodbend the firebender into position, but Mako managed to point his fingers toward Amon and fired a lightning attack that electrocuted the Equalist leader and hurled him away, allowing Mako to take Korra into his arms before fleeing out into the corridor.",
      "links": [
        {
          "body": "Lieutenant",
          "key": "${link_0}",
          "target": {
            "href": "Lieutenant",
            "page": "Lieutenant"
          }
        }
      ],
      "text": "Unknown to Amon, the Lieutenant had followed his leader and witnessed his bloodbending. Branding Amon to be a traitor, the Lieutenant attacked but was stopped by bloodbending. Amon told the Lieutenant that he had served him well, before launching him into a pile of timber. The interruption dealt with, he walked past the now weakened Korra to approach Mako and started to bloodbend the firebender into position, but Mako managed to point his fingers toward Amon and fired a lightning attack that electrocuted the Equalist leader and hurled him away, allowing Mako to take Korra into his arms before fleeing out into the corridor."
    },
    {
      "body": "Shortly after, Mako was forced to stop again by Amon, who caught up to them. Amon bloodbent the firebender, slamming him against the ceiling, the floor, and the two walls on his sides, before bloodbending him into position, stating that it was almost a shame to take away the bending of someone so talented. Korra's desperation for Mako to avoid suffering the same fate, in tandem with a strong desire to protect him, allowed her to break through her spiritual block and perform airbending. She began to attack Amon with consecutive air punches, forcing him back to the window at the end of the corridor. Amon retaliated and used bloodbending to subdue Korra, but she was able to resist his hold, launching a powerful air-kick toward Amon, blasting him out the window and into the sea. After his instinctive use of waterbending exposed him as a bender, Amon fled into exile with his brother, only for a repentant Tarrlok to detonate the boat they were on, killing them both and leaving Katara as the last living person known to be capable of bloodbending.",
      "links": [],
      "text": "Shortly after, Mako was forced to stop again by Amon, who caught up to them. Amon bloodbent the firebender, slamming him against the ceiling, the floor, and the two walls on his sides, before bloodbending him into position, stating that it was almost a shame to take away the bending of someone so talented. Korra's desperation for Mako to avoid suffering the same fate, in tandem with a strong desire to protect him, allowed her to break through her spiritual block and perform airbending. She began to attack Amon with consecutive air punches, forcing him back to the window at the end of the corridor. Amon retaliated and used bloodbending to subdue Korra, but she was able to resist his hold, launching a powerful air-kick toward Amon, blasting him out the window and into the sea. After his instinctive use of waterbending exposed him as a bender, Amon fled into exile with his brother, only for a repentant Tarrlok to detonate the boat they were on, killing them both and leaving Katara as the last living person known to be capable of bloodbending."
    },
    {
      "body": "Bloodbenders are capable of levitating their victims in the air in a similar way that waterbenders can lift water. Additionally, it can be used to knock its victims unconscious.",
      "links": [],
      "text": "Bloodbenders are capable of levitating their victims in the air in a similar way that waterbenders can lift water. Additionally, it can be used to knock its victims unconscious."
    },
    {
      "body": "Skilled bloodbenders can lift and hold their victims in the air, as well as launch them across short distances. Bloodbending has also been used to render multiple people unconscious for a period of time and can even be used to crush or disrupt the activity of a victim's internal organs.",
      "links": [],
      "text": "Skilled bloodbenders can lift and hold their victims in the air, as well as launch them across short distances. Bloodbending has also been used to render multiple people unconscious for a period of time and can even be used to crush or disrupt the activity of a victim's internal organs."
    },
    {
      "body": "Psychic bloodbending is the ability to use bloodbending with minimal motion, making its use nearly imperceptible. Yakone once used this ability to control an entire courtroom while his hands were still bound by cuffs. He passed on the knowledge of this technique to his sons, Noatak and Tarrlok. However, only Noatak mastered the ability, doing so at the age of fourteen by practicing to subdue an entire pack of wolves. Later, as Amon, he used this ability in duels to minimally alter the movements of his opponents and give himself the advantage without revealing that he was a bender.",
      "links": [],
      "text": "Psychic bloodbending is the ability to use bloodbending with minimal motion, making its use nearly imperceptible. Yakone once used this ability to control an entire courtroom while his hands were still bound by cuffs. He passed on the knowledge of this technique to his sons, Noatak and Tarrlok. However, only Noatak mastered the ability, doing so at the age of fourteen by practicing to subdue an entire pack of wolves. Later, as Amon, he used this ability in duels to minimally alter the movements of his opponents and give himself the advantage without revealing that he was a bender."
    },
    {
      "body": "${link_0} was stripped of his ${link_1} by ${link_2}.",
      "links": [
        {
          "body": "Lightning Bolt Zolt",
          "key": "${link_0}",
          "target": {
            "href": "Lightning_Bolt_Zolt",
            "page": "Lightning_Bolt_Zolt"
          }
        },
        {
          "body": "bending",
          "key": "${link_1}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Amon",
          "key": "${link_2}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        }
      ],
      "text": "Lightning Bolt Zolt was stripped of his bending by Amon."
    },
    {
      "body": "Bloodbending can be used to sever the connection between a bender and their bending abilities by disrupting their ${link_0} paths, achieving the same effect as ${link_1}. This technique requires direct physical contact between the user's hand and the victim's forehead. The effects of this technique are longstanding, and, unlike ${link_2}, it cannot be easily undone. According to Katara, the technique \"severs\" an individual from his or her bending, making it impervious to all methods of healing. Energybending is the only known method for reversing its effects.",
      "links": [
        {
          "body": "chi",
          "key": "${link_0}",
          "target": {
            "href": "Chi",
            "page": "Chi"
          }
        },
        {
          "body": "energybending",
          "key": "${link_1}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        },
        {
          "body": "chi blocking",
          "key": "${link_2}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        }
      ],
      "text": "Bloodbending can be used to sever the connection between a bender and their bending abilities by disrupting their chi paths, achieving the same effect as energybending. This technique requires direct physical contact between the user's hand and the victim's forehead. The effects of this technique are longstanding, and, unlike chi blocking, it cannot be easily undone. According to Katara, the technique \"severs\" an individual from his or her bending, making it impervious to all methods of healing. Energybending is the only known method for reversing its effects."
    },
    {
      "body": "${link_0} broke free of ${link_1}'s hold due to her more powerful bending abilities.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Hama",
          "key": "${link_1}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        }
      ],
      "text": "Katara broke free of Hama's hold due to her more powerful bending abilities."
    },
    {
      "body": "Despite being one of the most powerful and dangerous techniques in bending, bloodbending can usually be performed only under a full moon, when waterbenders' abilities are at their peak. This is due to the fact that the art requires far more sophistication and precision than conventional waterbending, thus limiting its use to only when a waterbender's capabilities are culminated. Due to their bloodline, Yakone, Tarrlok, and Amon, were the only known waterbenders who have been able to bloodbend in the absence of a full moon.",
      "links": [],
      "text": "Despite being one of the most powerful and dangerous techniques in bending, bloodbending can usually be performed only under a full moon, when waterbenders' abilities are at their peak. This is due to the fact that the art requires far more sophistication and precision than conventional waterbending, thus limiting its use to only when a waterbender's capabilities are culminated. Due to their bloodline, Yakone, Tarrlok, and Amon, were the only known waterbenders who have been able to bloodbend in the absence of a full moon."
    },
    {
      "body": "A bloodbender is only able to manipulate another person's body at the physical level, leaving the victim's mental faculties intact. This restriction was demonstrated when Hama took control of Aang and Sokka, as the two boys were unable to control themselves but still retained an awareness of what was happening. Consequently, a bloodbender is unable to use the bending abilities of the victims, as bending also relies on the mental state of the bender. They can, however, restrict movement to stop an act of bending, as well as reposition attacks in progress by manipulating the user.",
      "links": [],
      "text": "A bloodbender is only able to manipulate another person's body at the physical level, leaving the victim's mental faculties intact. This restriction was demonstrated when Hama took control of Aang and Sokka, as the two boys were unable to control themselves but still retained an awareness of what was happening. Consequently, a bloodbender is unable to use the bending abilities of the victims, as bending also relies on the mental state of the bender. They can, however, restrict movement to stop an act of bending, as well as reposition attacks in progress by manipulating the user."
    },
    {
      "body": "${link_0} resisted ${link_1}'s bloodbending hold.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_1}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        }
      ],
      "text": "Amon resisted Tarrlok's bloodbending hold."
    },
    {
      "body": "The effects of bloodbending can be resisted, and a bloodbender's hold can be broken when applied to a waterbender of similar or superior skill to the user. This is evident when Katara managed to free herself, after an initial struggle, from Hama's hold, and when Tarrlok tried and failed to bloodbend Amon into submission. Bloodbending is also nullified when the ${link_0} channels immense amounts of cosmic energy through the Avatar State, as demonstrated by Aang, who was able to break free of Yakone's hold instantaneously.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "The effects of bloodbending can be resisted, and a bloodbender's hold can be broken when applied to a waterbender of similar or superior skill to the user. This is evident when Katara managed to free herself, after an initial struggle, from Hama's hold, and when Tarrlok tried and failed to bloodbend Amon into submission. Bloodbending is also nullified when the Avatar channels immense amounts of cosmic energy through the Avatar State, as demonstrated by Aang, who was able to break free of Yakone's hold instantaneously."
    },
    {
      "body": "Psychic bloodbending is also limited in that the practice of bending with minimal movement can only accomplish feats such as subduing individuals, but cannot progress to the point of full control without further motion. Furthermore, the use of bending severing can only disrupt active chi pathways, leaving those that are already blocked or dormant completely functional and accessible to the user. More so, its effects are not entirely irreversible, as a bender's connection to their element can be restored by energybending.",
      "links": [],
      "text": "Psychic bloodbending is also limited in that the practice of bending with minimal movement can only accomplish feats such as subduing individuals, but cannot progress to the point of full control without further motion. Furthermore, the use of bending severing can only disrupt active chi pathways, leaving those that are already blocked or dormant completely functional and accessible to the user. More so, its effects are not entirely irreversible, as a bender's connection to their element can be restored by energybending."
    },
    {
      "body": "Characters who ended or resisted a bloodbending grip against themselves:",
      "links": [],
      "text": "Characters who ended or resisted a bloodbending grip against themselves:"
    },
    {
      "body": "${link_0} used bloodbending against the ${link_1} of the ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "commander",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Raiders_commander",
            "page": "Southern_Raiders_commander"
          }
        },
        {
          "body": "Southern Raiders",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Raiders",
            "page": "Southern_Raiders"
          }
        }
      ],
      "text": "Katara used bloodbending against the commander of the Southern Raiders."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Bloodbending",
    "file": "avatar.wikia.com/wiki/Bloodbending.html",
    "page": "Bloodbending",
    "title": "Bloodbending"
  }
}