{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Establishments",
      "target": {
        "external": false,
        "href": "/wiki/Category_Establishments",
        "page": "Category_Establishments"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "external": false,
        "href": "/wiki/Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Islands",
      "target": {
        "external": false,
        "href": "/wiki/Category_Islands",
        "page": "Category_Islands"
      }
    },
    {
      "body": "Locations",
      "target": {
        "external": false,
        "href": "/wiki/Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Prisons",
      "target": {
        "external": false,
        "href": "/wiki/Category_Prisons",
        "page": "Category_Prisons"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "Northern ${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Fire Nation",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Fire_Nation",
                "page": "Fire_Nation"
              }
            }
          ],
          "text": "Northern Fire Nation",
          "value": "Northern ${link_0}",
          "value_text": "Northern Fire Nation"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "Maximum security prison",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Maximum security prison",
          "value": "Maximum security prison",
          "value_text": "Maximum security prison"
        }
      ]
    },
    {
      "key": "Administrator",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "The warden",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Warden_(Boiling_Rock)",
                "page": "Warden_(Boiling_Rock)"
              }
            }
          ],
          "text": "The warden",
          "value": "${link_0}",
          "value_text": "The warden"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "The Boiling Rock, Part 1",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/The_Boiling_Rock%2c_Part_1",
                "page": "The_Boiling_Rock%2c_Part_1"
              }
            }
          ],
          "text": "\"The Boiling Rock, Part 1\"",
          "value": "\"${link_0}\"",
          "value_text": "\"The Boiling Rock, Part 1\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The Boiling Rock is an extremely secure ${link_0} prison known for its history of unsuccessful escape attempts. The prison is ${link_1} on a volcanic island in the middle of a boiling lake, hence its name. The most dangerous criminals, both domestic and foreign alike, are sent here; these prisoners included thieves, traitors, and prisoners of war.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "situated",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Geography_of_the_World_of_Avatar",
            "page": "Geography_of_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Boiling Rock"
      ],
      "text": "The Boiling Rock is an extremely secure Fire Nation prison known for its history of unsuccessful escape attempts. The prison is situated on a volcanic island in the middle of a boiling lake, hence its name. The most dangerous criminals, both domestic and foreign alike, are sent here; these prisoners included thieves, traitors, and prisoners of war."
    },
    {
      "body": "The prison was once run by a cruel ${link_0} who took great pride in the prison's reputation as an inescapable fortress; to maintain this reputation, the Boiling Rock was guarded by an army of ${link_1}, and the only way on and off the volcanic island was by traveling over the boiling water on one of the two ${link_2}.",
      "links": [
        {
          "body": "warden",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Warden_(Boiling_Rock)",
            "page": "Warden_(Boiling_Rock)"
          }
        },
        {
          "body": "firebenders",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "gondolas",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Gondola",
            "page": "Gondola"
          }
        }
      ],
      "section": [
        "Boiling Rock"
      ],
      "text": "The prison was once run by a cruel warden who took great pride in the prison's reputation as an inescapable fortress; to maintain this reputation, the Boiling Rock was guarded by an army of firebenders, and the only way on and off the volcanic island was by traveling over the boiling water on one of the two gondolas."
    },
    {
      "body": "The Boiling Rock was created relatively late in the ${link_0} by ${link_1} ${link_2}, who spared no expense in the construction of the prison. There were hundreds of prisoners there, of whom more than half were convicted firebenders. In all of its years of operation, nobody had ever escaped the prison. Fire Lord Ozai created the prison especially for imprisoning war prisoners from other nations.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "History"
      ],
      "text": "The Boiling Rock was created relatively late in the Hundred Year War by Fire Lord Ozai, who spared no expense in the construction of the prison. There were hundreds of prisoners there, of whom more than half were convicted firebenders. In all of its years of operation, nobody had ever escaped the prison. Fire Lord Ozai created the prison especially for imprisoning war prisoners from other nations."
    },
    {
      "body": "After the failed ${link_0} on the ${link_1}, dozens of prisoners from the ${link_2} and the ${link_3} were captured and imprisoned. However, only their ${link_4}, ${link_5} of the ${link_6}, was sent to the Boiling Rock due to his role as the leader of the invasion. All of the others were imprisoned at the ${link_7}. Hakoda's son, ${link_8}, who had escaped the Fire Nation, was desperate to save his father. He and his new ally, ${link_9} ${link_10}, traveled to the Boiling Rock to save him. They took Zuko's ${link_11}, but had to abandon it after it was wrecked in a failed landing. After penetrating the prison, Sokka and Zuko disguised themselves as guards and searched for Hakoda. They could not find Hakoda, but they did find Sokka's long-lost girlfriend, ${link_12}, leader of the ${link_13}. After they had reunited for the first time since the ${link_14}, they and Zuko planned an escape. They were joined by ${link_15}, a prominent prisoner who was on bad terms with the warden and had overheard their escape plot. He and two of his friends tried to escape with the group by converting one of the coolers into a boat, which would allow them to cross the lake. However, Sokka, Suki, and Zuko stayed behind to find Hakoda as he might have been part of a new shipment of prisoners.",
      "links": [
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        },
        {
          "body": "Day of Black Sun",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "Water Tribes",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "leader",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Hakoda",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Capital City Prison",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Capital_City_Prison",
            "page": "Capital_City_Prison"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Prince",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "war balloon",
          "key": "${link_11}",
          "target": {
            "external": false,
            "href": "/wiki/Hot_air_balloon",
            "page": "Hot_air_balloon"
          }
        },
        {
          "body": "Suki",
          "key": "${link_12}",
          "target": {
            "external": false,
            "href": "/wiki/Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_13}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Serpent's Pass",
          "key": "${link_14}",
          "target": {
            "external": false,
            "href": "/wiki/Serpent%27s_Pass",
            "page": "Serpent%27s_Pass"
          }
        },
        {
          "body": "Chit Sang",
          "key": "${link_15}",
          "target": {
            "external": false,
            "href": "/wiki/Chit_Sang",
            "page": "Chit_Sang"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "History"
      ],
      "text": "After the failed invasion of the Fire Nation on the Day of Black Sun, dozens of prisoners from the Water Tribes and the Earth Kingdom were captured and imprisoned. However, only their leader, Hakoda of the Southern Water Tribe, was sent to the Boiling Rock due to his role as the leader of the invasion. All of the others were imprisoned at the Capital City Prison. Hakoda's son, Sokka, who had escaped the Fire Nation, was desperate to save his father. He and his new ally, Prince Zuko, traveled to the Boiling Rock to save him. They took Zuko's war balloon, but had to abandon it after it was wrecked in a failed landing. After penetrating the prison, Sokka and Zuko disguised themselves as guards and searched for Hakoda. They could not find Hakoda, but they did find Sokka's long-lost girlfriend, Suki, leader of the Kyoshi Warriors. After they had reunited for the first time since the Serpent's Pass, they and Zuko planned an escape. They were joined by Chit Sang, a prominent prisoner who was on bad terms with the warden and had overheard their escape plot. He and two of his friends tried to escape with the group by converting one of the coolers into a boat, which would allow them to cross the lake. However, Sokka, Suki, and Zuko stayed behind to find Hakoda as he might have been part of a new shipment of prisoners."
    },
    {
      "body": "Chit Sang and his friends blew their cover and were promptly rearrested. Zuko posed as a prisoner while Sokka went to find his dad. Much to Sokka's happiness, Hakoda was at the prison, so he reunited with him and planned a new escape. Much to Zuko's shock, his girlfriend ${link_0} was there, as the warden was her uncle. She demanded that Zuko tell her the reason behind his decision to leave her, and Zuko explained without much success. The warden later tortured Chit Sang into revealing that one of their guards helped him escape, endangering Sokka's life. However, Chit Sang framed ${link_1} that had bullied him before instead of Sokka and asked to join in Sokka's second escape in return for protecting him.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mai",
            "page": "Mai"
          }
        },
        {
          "body": "the guard",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bully_guard",
            "page": "Bully_guard"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "History"
      ],
      "text": "Chit Sang and his friends blew their cover and were promptly rearrested. Zuko posed as a prisoner while Sokka went to find his dad. Much to Sokka's happiness, Hakoda was at the prison, so he reunited with him and planned a new escape. Much to Zuko's shock, his girlfriend Mai was there, as the warden was her uncle. She demanded that Zuko tell her the reason behind his decision to leave her, and Zuko explained without much success. The warden later tortured Chit Sang into revealing that one of their guards helped him escape, endangering Sokka's life. However, Chit Sang framed the guard that had bullied him before instead of Sokka and asked to join in Sokka's second escape in return for protecting him."
    },
    {
      "body": "Much to the shock of the warden and the prison staff, Princess ${link_0} and ${link_1} showed up, immediately suspecting that Zuko and the Avatar's friends were the actual culprits. After Sokka freed the prisoners, they started a riot, and the group made their escape. Zuko also managed to escape from Mai and rejoin his group. The group captured the warden in order to use him as a bargaining chip for their escape, before hijacking a gondola and attempting to flee to shore, only to be confronted by Ty Lee and Azula. The group managed to hold them off, but at the warden's insistence, the guards were cutting the gondola lines, which would send the entire group plunging to their death into the lake. While Azula was confident she had foiled the escape, Mai elected to \"save the jerk who dumped [her]\" and attacked the guards, allowing the stalled gondola to reach the outer station so Zuko and his friends could flee. They left the warden in the gondola and proceeded to hijack Azula's ${link_2}, with which they flew to the ${link_3}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "airship",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "History"
      ],
      "text": "Much to the shock of the warden and the prison staff, Princess Azula and Ty Lee showed up, immediately suspecting that Zuko and the Avatar's friends were the actual culprits. After Sokka freed the prisoners, they started a riot, and the group made their escape. Zuko also managed to escape from Mai and rejoin his group. The group captured the warden in order to use him as a bargaining chip for their escape, before hijacking a gondola and attempting to flee to shore, only to be confronted by Ty Lee and Azula. The group managed to hold them off, but at the warden's insistence, the guards were cutting the gondola lines, which would send the entire group plunging to their death into the lake. While Azula was confident she had foiled the escape, Mai elected to \"save the jerk who dumped [her]\" and attacked the guards, allowing the stalled gondola to reach the outer station so Zuko and his friends could flee. They left the warden in the gondola and proceeded to hijack Azula's airship, with which they flew to the Western Air Temple."
    },
    {
      "body": "Azula confronted Mai and demanded an explanation. Mai explained that she still loved Zuko, more than she feared Azula. Enraged, Azula tried to attack Mai, but Ty Lee ${link_0} and paralyzed her before she could even attack. The two girls were arrested on Azula's orders and imprisoned.",
      "links": [
        {
          "body": "blocked her chi energy",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Chi_blocking",
            "page": "Chi_blocking"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "History"
      ],
      "text": "Azula confronted Mai and demanded an explanation. Mai explained that she still loved Zuko, more than she feared Azula. Enraged, Azula tried to attack Mai, but Ty Lee blocked her chi energy and paralyzed her before she could even attack. The two girls were arrested on Azula's orders and imprisoned."
    },
    {
      "body": "However, after the Hundred Year War ended with the defeats of Azula and Ozai, as well as the ${link_0} of ${link_1} by the ${link_2}, Mai and Ty Lee were released and allowed to return home.",
      "links": [
        {
          "body": "liberation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Liberation_of_Ba_Sing_Se",
            "page": "Liberation_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Order of the White Lotus",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "History"
      ],
      "text": "However, after the Hundred Year War ended with the defeats of Azula and Ozai, as well as the liberation of Ba Sing Se by the Order of the White Lotus, Mai and Ty Lee were released and allowed to return home."
    },
    {
      "body": "The Boiling Rock is a maximum-security prison located within a boiling lake in the middle of a seemingly lifeless island. The steam that rises from the lake and accumulates within the sky above it makes it impossible for airborne crafts operating with hot air to maneuver above the prison because the heat eliminates the temperature differential, making it impossible to fly. The prison was constructed during the later months of the War, making it a modern, state of the art facility. Its walls are extremely thick and made of the most up-to-date indestructible metal. Among its features are the gondola system which is the only way on and off the prison island and the isolation chambers called \"coolers\". Prisoners cannot escape by swimming in the lake, as they would be severely burned. Those who try to escape in any other way, or firebend, are thrown into one of the coolers.",
      "links": [],
      "section": [
        "Boiling Rock",
        "Description"
      ],
      "text": "The Boiling Rock is a maximum-security prison located within a boiling lake in the middle of a seemingly lifeless island. The steam that rises from the lake and accumulates within the sky above it makes it impossible for airborne crafts operating with hot air to maneuver above the prison because the heat eliminates the temperature differential, making it impossible to fly. The prison was constructed during the later months of the War, making it a modern, state of the art facility. Its walls are extremely thick and made of the most up-to-date indestructible metal. Among its features are the gondola system which is the only way on and off the prison island and the isolation chambers called \"coolers\". Prisoners cannot escape by swimming in the lake, as they would be severely burned. Those who try to escape in any other way, or firebend, are thrown into one of the coolers."
    },
    {
      "body": "The prison is far more advanced than the Capital City Prison. It is equipped with hundreds of cells that can all be opened simultaneously from a control room located above the cell blocks. The prisoners are all kept behind bars during lockdown hours and let outside when it best suits the prison staff. Anyone who disobeys prison orders or misbehaves is thrown into specially-designed coolers, small one-man chambers designed to chill traitorous firebenders into submission.",
      "links": [],
      "section": [
        "Boiling Rock",
        "Description"
      ],
      "text": "The prison is far more advanced than the Capital City Prison. It is equipped with hundreds of cells that can all be opened simultaneously from a control room located above the cell blocks. The prisoners are all kept behind bars during lockdown hours and let outside when it best suits the prison staff. Anyone who disobeys prison orders or misbehaves is thrown into specially-designed coolers, small one-man chambers designed to chill traitorous firebenders into submission."
    },
    {
      "body": "The warden in charge of the prison was a cruel man who took great pride in the prison's reputation as an impenetrable fortress. He often verbally or physically abused his prisoners and only went easy on them if they did what he demanded. He and his army of guards often resorted to cruel practices to punish the prisoners, such as locking them in coolers and hanging them upside-down to create physical pain.",
      "links": [],
      "section": [
        "Boiling Rock",
        "Description"
      ],
      "text": "The warden in charge of the prison was a cruel man who took great pride in the prison's reputation as an impenetrable fortress. He often verbally or physically abused his prisoners and only went easy on them if they did what he demanded. He and his army of guards often resorted to cruel practices to punish the prisoners, such as locking them in coolers and hanging them upside-down to create physical pain."
    },
    {
      "body": "The Boiling Rock, in the vein of most other top-notch Fire Nation prison complexes, had an interrogation room that the warden wanted the prisoners to fear. To accomplish this, the warden established the first interrogation room in a cooler. That, however, turned out to be a problem, as the room proved to be too small and the extreme cold had a negative effect on the interrogator. Following this, a new interrogation room was devised, which included a dimly lit metal room with metal bars and a chair to restrain the person being interrogated.",
      "links": [],
      "section": [
        "Boiling Rock",
        "Description",
        "Interrogation room"
      ],
      "text": "The Boiling Rock, in the vein of most other top-notch Fire Nation prison complexes, had an interrogation room that the warden wanted the prisoners to fear. To accomplish this, the warden established the first interrogation room in a cooler. That, however, turned out to be a problem, as the room proved to be too small and the extreme cold had a negative effect on the interrogator. Following this, a new interrogation room was devised, which included a dimly lit metal room with metal bars and a chair to restrain the person being interrogated."
    },
    {
      "body": "These isolation chambers were installed to punish prisoners who dared to firebend or step out of line in the Boiling Rock. The coolers were kept at freezing temperatures, with insulation to seal in the cool air. When a prisoner was locked in there, they were not able to feel even a wisp of the warm air outside. Within the cooler, firebending was impossible; after just a day inside, it rendered a person unable to bend for a full week. When Zuko was in the cooler, he stayed warm using his \"breath of fire\" technique, thus allowing him to firebend once he got out. The coolers were integral to Sokka's plans as they were they were perfectly insulated: they would resist the overwhelming heat of the volcano and boiling lake and float away from the prison of its own accord. With Zuko's help, Sokka used a cooler as a makeshift boat to escape the prison. This plan failed because of the involvement and hastiness of Chit Sang, who tried to make the cooler move faster once in the water and burned himself, screaming in pain and alerting the guards.",
      "links": [],
      "section": [
        "Boiling Rock",
        "Description",
        "Coolers"
      ],
      "text": "These isolation chambers were installed to punish prisoners who dared to firebend or step out of line in the Boiling Rock. The coolers were kept at freezing temperatures, with insulation to seal in the cool air. When a prisoner was locked in there, they were not able to feel even a wisp of the warm air outside. Within the cooler, firebending was impossible; after just a day inside, it rendered a person unable to bend for a full week. When Zuko was in the cooler, he stayed warm using his \"breath of fire\" technique, thus allowing him to firebend once he got out. The coolers were integral to Sokka's plans as they were they were perfectly insulated: they would resist the overwhelming heat of the volcano and boiling lake and float away from the prison of its own accord. With Zuko's help, Sokka used a cooler as a makeshift boat to escape the prison. This plan failed because of the involvement and hastiness of Chit Sang, who tried to make the cooler move faster once in the water and burned himself, screaming in pain and alerting the guards."
    },
    {
      "body": "The name and design of the prison is almost certainly a reference to ${link_0}, a real-world island prison, which was nicknamed \"The Rock\". As with the Boiling Rock, Alcatraz boasts a history of no successful escapes, although three criminals did try to escape by swimming and were never found. It is ironic that the point of Alcatraz was that any prisoner who tried to swim away would freeze in the water, while on the Boiling Rock anyone who tried to swim away would be burned to death.",
      "links": [
        {
          "body": "Alcatraz Island",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Alcatraz_Island",
            "page": "http://en.wikipedia.org/wiki/Alcatraz_Island"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Real world connections"
      ],
      "text": "The name and design of the prison is almost certainly a reference to Alcatraz Island, a real-world island prison, which was nicknamed \"The Rock\". As with the Boiling Rock, Alcatraz boasts a history of no successful escapes, although three criminals did try to escape by swimming and were never found. It is ironic that the point of Alcatraz was that any prisoner who tried to swim away would freeze in the water, while on the Boiling Rock anyone who tried to swim away would be burned to death."
    },
    {
      "body": "It also bears some resemblance to Stalag Luft III as depicted in the 1963 film The Great Escape in that its solitary confinement cells are called \"Coolers\" and that Sokka's method for escaping involved going in a blind spot between two guard towers.",
      "links": [],
      "section": [
        "Boiling Rock",
        "Real world connections"
      ],
      "text": "It also bears some resemblance to Stalag Luft III as depicted in the 1963 film The Great Escape in that its solitary confinement cells are called \"Coolers\" and that Sokka's method for escaping involved going in a blind spot between two guard towers."
    },
    {
      "body": "The Alcatraz escapees Frank Morris, John Anglin, and Clarence Anglin's idea was to make a raft from raincoats and make their way to Angel Island or more likely to drift with the current to the Marin Headlands. This resembles Sokka's original plan of taking one of the coolers and drifting with the current to the other side of the lake.",
      "links": [],
      "section": [
        "Boiling Rock",
        "Real world connections"
      ],
      "text": "The Alcatraz escapees Frank Morris, John Anglin, and Clarence Anglin's idea was to make a raft from raincoats and make their way to Angel Island or more likely to drift with the current to the Marin Headlands. This resembles Sokka's original plan of taking one of the coolers and drifting with the current to the other side of the lake."
    },
    {
      "body": "${link_0} (escaped)",
      "links": [
        {
          "body": "Chit Sang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Chit_Sang",
            "page": "Chit_Sang"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable inmates"
      ],
      "text": "Chit Sang (escaped)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Chit Sang's friend",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Chit_Sang%27s_friend",
            "page": "Chit_Sang%27s_friend"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable inmates"
      ],
      "text": "Chit Sang's friend"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Chit Sang's girlfriend",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Chit_Sang%27s_girlfriend",
            "page": "Chit_Sang%27s_girlfriend"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable inmates"
      ],
      "text": "Chit Sang's girlfriend"
    },
    {
      "body": "${link_0} (escaped)",
      "links": [
        {
          "body": "Hakoda",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hakoda",
            "page": "Hakoda"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable inmates"
      ],
      "text": "Hakoda (escaped)"
    },
    {
      "body": "${link_0} (released)",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mai",
            "page": "Mai"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable inmates"
      ],
      "text": "Mai (released)"
    },
    {
      "body": "${link_0} (escaped)",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Suki",
            "page": "Suki"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable inmates"
      ],
      "text": "Suki (escaped)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Tough criminal",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tough_criminal",
            "page": "Tough_criminal"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable inmates"
      ],
      "text": "Tough criminal"
    },
    {
      "body": "${link_0} (released)",
      "links": [
        {
          "body": "Ty Lee",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable inmates"
      ],
      "text": "Ty Lee (released)"
    },
    {
      "body": "${link_0} (escaped)",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable inmates"
      ],
      "text": "Zuko (escaped)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Bully guard",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bully_guard",
            "page": "Bully_guard"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable personnel"
      ],
      "text": "Bully guard"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Gondola guards",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Gondola_guards",
            "page": "Gondola_guards"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable personnel"
      ],
      "text": "Gondola guards"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Lowly guard",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lowly_guard",
            "page": "Lowly_guard"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable personnel"
      ],
      "text": "Lowly guard"
    },
    {
      "body": "${link_0} (incognito)",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable personnel"
      ],
      "text": "Sokka (incognito)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Warden",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Warden_(Boiling_Rock)",
            "page": "Warden_(Boiling_Rock)"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable personnel"
      ],
      "text": "Warden"
    },
    {
      "body": "${link_0} (incognito)",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "Notable personnel"
      ],
      "text": "Zuko (incognito)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Escape from the Boiling Rock",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Escape_from_the_Boiling_Rock",
            "page": "Escape_from_the_Boiling_Rock"
          }
        }
      ],
      "section": [
        "Boiling Rock",
        "See also"
      ],
      "text": "Escape from the Boiling Rock"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Boiling_Rock",
    "file": "avatar.wikia.com/wiki/Boiling_Rock.html",
    "page": "Boiling_Rock",
    "title": "Boiling Rock"
  }
}