{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "external": false,
        "href": "/wiki/Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Bolin is a fun-loving, fiercely loyal young man with a naiveté toward the gray morality of the world.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "Bolin's relationships"
      ],
      "text": "This page is comprised of Bolin's relationships with other characters in the World of Avatar. Bolin is a fun-loving, fiercely loyal young man with a naiveté toward the gray morality of the world."
    },
    {
      "body": "Bolin and his older brother Mako lost their parents at the early ages of six and eight respectively. After the tragedy, they were left homeless and had to fend for themselves. In order to survive, the brothers began working for the ${link_0} by running numbers. One day, ${link_1} observed them fighting on the streets. He decided to invite the brothers to live in the attic of the ${link_2} in exchange for working various odd jobs to pay the rent. The brothers accepted, and together they formed their own pro-bending team, the ${link_3}.",
      "links": [
        {
          "body": "Triple Threat Triad",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "Toza",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Toza",
            "page": "Toza"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "Fire Ferrets",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Relatives",
        "Mako"
      ],
      "text": "Bolin and his older brother Mako lost their parents at the early ages of six and eight respectively. After the tragedy, they were left homeless and had to fend for themselves. In order to survive, the brothers began working for the Triple Threat Triad by running numbers. One day, Toza observed them fighting on the streets. He decided to invite the brothers to live in the attic of the Pro-bending Arena in exchange for working various odd jobs to pay the rent. The brothers accepted, and together they formed their own pro-bending team, the Fire Ferrets."
    },
    {
      "body": "Mako became Bolin's parental figure, taking care of him and always making sure that he was safe from danger. Mako had advised Bolin to avoid the Triple Threats; however, when he returned from work one day, he immediately noticed Bolin's absence. He promptly went looking for him out of concern and was joined by ${link_0} in his search throughout ${link_1}. When they witnessed Bolin's capture by the ${link_2} and the existence and location of the anti-bender rally, Mako and Korra were willing to take the risk and attempt to rescue him. When they found him about to be stripped of his ${link_3} by ${link_4}, Mako quickly formed a plan to rescue him and carried it out despite all odds.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "the city",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Amon",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Relatives",
        "Mako"
      ],
      "text": "Mako became Bolin's parental figure, taking care of him and always making sure that he was safe from danger. Mako had advised Bolin to avoid the Triple Threats; however, when he returned from work one day, he immediately noticed Bolin's absence. He promptly went looking for him out of concern and was joined by Korra in his search throughout the city. When they witnessed Bolin's capture by the Equalists and the existence and location of the anti-bender rally, Mako and Korra were willing to take the risk and attempt to rescue him. When they found him about to be stripped of his earthbending by Amon, Mako quickly formed a plan to rescue him and carried it out despite all odds."
    },
    {
      "body": "Bolin trusts Mako to the extent where he tells him about his feelings, such as his love for Korra. When the earthbender stumbled upon Mako and Korra kissing, he felt hurt and betrayed by his brother and fled in tears. Mako tracked Bolin down to ${link_0} in order to escort him safely home. Bolin was still greatly upset with Mako, to the point of calling him a \"brother-betrayer\" and saying that he was no longer his brother or friend. A frustrated but patient Mako responded by carrying Bolin out of the restaurant, despite his cries and demands to be put down. Later, after both were knocked out of the ring in round three of the ${link_1} semifinals, the brothers apologized and were able to forgive each other, restoring their good relationship and demonstrating their strong bond.",
      "links": [
        {
          "body": "Narook's Seaweed Noodlery",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Narook%27s_Seaweed_Noodlery",
            "page": "Narook%27s_Seaweed_Noodlery"
          }
        },
        {
          "body": "Pro-bending Tournament",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending#Pro-bending_Tournament",
            "page": "Pro-bending"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Relatives",
        "Mako"
      ],
      "text": "Bolin trusts Mako to the extent where he tells him about his feelings, such as his love for Korra. When the earthbender stumbled upon Mako and Korra kissing, he felt hurt and betrayed by his brother and fled in tears. Mako tracked Bolin down to Narook's Seaweed Noodlery in order to escort him safely home. Bolin was still greatly upset with Mako, to the point of calling him a \"brother-betrayer\" and saying that he was no longer his brother or friend. A frustrated but patient Mako responded by carrying Bolin out of the restaurant, despite his cries and demands to be put down. Later, after both were knocked out of the ring in round three of the Pro-bending Tournament semifinals, the brothers apologized and were able to forgive each other, restoring their good relationship and demonstrating their strong bond."
    },
    {
      "body": "Mako is sometimes dismissive of Bolin, such as when Bolin introduced him to Korra, or was eager to help with earning ${link_0} for the tournament, or during the Equalist's ambush of the tournament finals, when he scolded Bolin for chattering at ${link_1} to get him to chew through the ropes with which they were bound.",
      "links": [
        {
          "body": "money",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Currency#United_Republic_of_Nations",
            "page": "Currency"
          }
        },
        {
          "body": "Pabu",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pabu",
            "page": "Pabu"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Relatives",
        "Mako"
      ],
      "text": "Mako is sometimes dismissive of Bolin, such as when Bolin introduced him to Korra, or was eager to help with earning money for the tournament, or during the Equalist's ambush of the tournament finals, when he scolded Bolin for chattering at Pabu to get him to chew through the ropes with which they were bound."
    },
    {
      "body": "Their close, brotherly connection was also present when they were in Asami's pool, playfully dunking each other underwater. Their incredible teamwork is also notable; with a single glance at each other, they were able to coordinate minor attacks in order to restrain ${link_0} so they could go help Korra.",
      "links": [
        {
          "body": "Song",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Song_(officer)",
            "page": "Song_(officer)"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Relatives",
        "Mako"
      ],
      "text": "Their close, brotherly connection was also present when they were in Asami's pool, playfully dunking each other underwater. Their incredible teamwork is also notable; with a single glance at each other, they were able to coordinate minor attacks in order to restrain Song so they could go help Korra."
    },
    {
      "body": "According to Bolin, he has had issues in the past with Mako not being attentive to his problems, suggesting instead that Bolin take care of the issue himself. When Mako needed Bolin's help, Bolin chose to brush his brother off in the same way he had previously employed, much to Mako's annoyance. These issues continued to grow, and Bolin eventually moved out of the ${link_0} he shared with Mako to live on his own. When he discovered Mako and Asami had been growing more intimate once again, he admonished them, pointing out to Mako that it had only been a week since his break-up with Korra.",
      "links": [
        {
          "body": "apartment",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mako_and_Bolin%27s_apartment",
            "page": "Mako_and_Bolin%27s_apartment"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Relatives",
        "Mako"
      ],
      "text": "According to Bolin, he has had issues in the past with Mako not being attentive to his problems, suggesting instead that Bolin take care of the issue himself. When Mako needed Bolin's help, Bolin chose to brush his brother off in the same way he had previously employed, much to Mako's annoyance. These issues continued to grow, and Bolin eventually moved out of the apartment he shared with Mako to live on his own. When he discovered Mako and Asami had been growing more intimate once again, he admonished them, pointing out to Mako that it had only been a week since his break-up with Korra."
    },
    {
      "body": "After Mako's imprisonment, Bolin visited him in jail, offering him a poster of his mover's finale. He still did not believe Mako on his word, though promised that he would make sure Mako had the best defense lawyer money and fame could acquire. However, during the mover, Bolin grew saddened over the absence of his brother, and after he saved ${link_0} ${link_1} from being ${link_2}, Bolin visited Mako again in prison to personally recall his rescue. He delivered the news of his release and apologized for ever having doubted his brother, rekindling their relationship. From their quest to find airbending recruits onward, Bolin spent more time with his big brother, often dragging him into trouble.",
      "links": [
        {
          "body": "President",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "kidnapped",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Attempted_kidnapping_of_President_Raiko",
            "page": "Attempted_kidnapping_of_President_Raiko"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Relatives",
        "Mako"
      ],
      "text": "After Mako's imprisonment, Bolin visited him in jail, offering him a poster of his mover's finale. He still did not believe Mako on his word, though promised that he would make sure Mako had the best defense lawyer money and fame could acquire. However, during the mover, Bolin grew saddened over the absence of his brother, and after he saved President Raiko from being kidnapped, Bolin visited Mako again in prison to personally recall his rescue. He delivered the news of his release and apologized for ever having doubted his brother, rekindling their relationship. From their quest to find airbending recruits onward, Bolin spent more time with his big brother, often dragging him into trouble."
    },
    {
      "body": "Three years later, Bolin had joined ${link_0} to reunite the Earth Kingdom while Mako was assigned to be Prince ${link_1}'s bodyguard. When the brothers reunited, they started disagreeing over whether Kuvira or Wu was better suited to rule, resulting in their relationship becoming sour once more. The brothers once again reconciled after Bolin deserted Kuvira's army.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "Wu",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Wu",
            "page": "Wu"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Relatives",
        "Mako"
      ],
      "text": "Three years later, Bolin had joined Kuvira to reunite the Earth Kingdom while Mako was assigned to be Prince Wu's bodyguard. When the brothers reunited, they started disagreeing over whether Kuvira or Wu was better suited to rule, resulting in their relationship becoming sour once more. The brothers once again reconciled after Bolin deserted Kuvira's army."
    },
    {
      "body": "Bolin was born into a multicultural family and was close to both his parents; his mother, Naoki, was a Fire Nation woman, while his father, ${link_0}, was from the ${link_1}. When he was six, his parents were killed by a firebender mugger, leaving himself and Mako as orphans forced to live on the streets. The death of his parents has had an emotional impact upon Bolin, becoming sad and frustrated whenever he thinks about them.",
      "links": [
        {
          "body": "San",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/San",
            "page": "San"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Relatives",
        "Parents"
      ],
      "text": "Bolin was born into a multicultural family and was close to both his parents; his mother, Naoki, was a Fire Nation woman, while his father, San, was from the Earth Kingdom. When he was six, his parents were killed by a firebender mugger, leaving himself and Mako as orphans forced to live on the streets. The death of his parents has had an emotional impact upon Bolin, becoming sad and frustrated whenever he thinks about them."
    },
    {
      "body": "When Bolin and Mako journeyed to ${link_0} with ${link_1}, Bolin was excited about the prospect of possibly meeting his parental family. After they tried to scam a local fruit salesman, who turned out to be their cousin, ${link_2}, their uncle, ${link_3} recognized them and invited the brothers to come to the family apartment. Bolin was ecstatic about meeting their grandmother, ${link_4}, cousin ${link_5}, and everyone else for the first time and rapidly formed a bond with them.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Tu",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Tu",
            "page": "Tu"
          }
        },
        {
          "body": "Chow",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Chow",
            "page": "Chow"
          }
        },
        {
          "body": "Yin",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Yin",
            "page": "Yin"
          }
        },
        {
          "body": "Tu",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Tu",
            "page": "Tu"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Relatives",
        "Paternal family"
      ],
      "text": "When Bolin and Mako journeyed to Ba Sing Se with Team Avatar, Bolin was excited about the prospect of possibly meeting his parental family. After they tried to scam a local fruit salesman, who turned out to be their cousin, Tu, their uncle, Chow recognized them and invited the brothers to come to the family apartment. Bolin was ecstatic about meeting their grandmother, Yin, cousin Tu, and everyone else for the first time and rapidly formed a bond with them."
    },
    {
      "body": "As the city succumbed to a state of ${link_0} after ${link_1} ${link_2}'s death, Bolin expressed his worry about their family's wellbeing as he noticed the ${link_3} be consumed by flames. In an effort to save them all, Mako landed a ${link_4} on the apartment's roof while Bolin urged their family to enter the ship. When Yin refused to leave the home where she had raised her family, Bolin tried to tell her that a home was not some permanent place somewhere, but the place where one's family resided. When Yin still refused to evacuate, Bolin took matters in his own hands and swung her over his shoulder, ordering every other family member to enter the airship as well.",
      "links": [
        {
          "body": "anarchy",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Anarchy_in_the_Earth_Kingdom",
            "page": "Anarchy_in_the_Earth_Kingdom"
          }
        },
        {
          "body": "Earth Queen",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Hou-Ting",
            "page": "Hou-Ting"
          }
        },
        {
          "body": "Lower Ring",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se#Lower_Ring",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Ba Sing Se airship",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se_airship",
            "page": "Ba_Sing_Se_airship"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Relatives",
        "Paternal family"
      ],
      "text": "As the city succumbed to a state of anarchy after Earth Queen Hou-Ting's death, Bolin expressed his worry about their family's wellbeing as he noticed the Lower Ring be consumed by flames. In an effort to save them all, Mako landed a Ba Sing Se airship on the apartment's roof while Bolin urged their family to enter the ship. When Yin refused to leave the home where she had raised her family, Bolin tried to tell her that a home was not some permanent place somewhere, but the place where one's family resided. When Yin still refused to evacuate, Bolin took matters in his own hands and swung her over his shoulder, ordering every other family member to enter the airship as well."
    },
    {
      "body": "Bolin developed an interest in ${link_0}, Korra's cousin, when she and her twin brother Desna arrived at the Southern Water Tribe for the ${link_1}. However, his attempts to impress her ended up with him obliviously catering to her and her twin brother's every whim. His desperate and numerous attempts to end their relationship just ended up making things worse, as Eska concluded that a marriage would be the only way to salvage their relationship and promptly gave Bolin a betrothal necklace. Eska arranged a sunset wedding the day they got engaged, though Bolin stood her up as he escaped the South Pole with the rest of Team Avatar aboard ${link_2}. Enraged and hurt, Bolin's disappearance prompted Eska to chase after him.",
      "links": [
        {
          "body": "Eska",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "Glacier Spirits Festival",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Glacier_Spirits_Festival",
            "page": "Glacier_Spirits_Festival"
          }
        },
        {
          "body": "Varrick's yacht",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Varrick%27s_yacht",
            "page": "Varrick%27s_yacht"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Eska"
      ],
      "text": "Bolin developed an interest in Eska, Korra's cousin, when she and her twin brother Desna arrived at the Southern Water Tribe for the Glacier Spirits Festival. However, his attempts to impress her ended up with him obliviously catering to her and her twin brother's every whim. His desperate and numerous attempts to end their relationship just ended up making things worse, as Eska concluded that a marriage would be the only way to salvage their relationship and promptly gave Bolin a betrothal necklace. Eska arranged a sunset wedding the day they got engaged, though Bolin stood her up as he escaped the South Pole with the rest of Team Avatar aboard Varrick's yacht. Enraged and hurt, Bolin's disappearance prompted Eska to chase after him."
    },
    {
      "body": "Even after escaping from the South Pole, Bolin was still deeply afraid of Eska, cowering and shrieking in terror at just the sight of her on a short film clip produced by ${link_0}. He had the same reaction even after multiple viewings of the film.",
      "links": [
        {
          "body": "Varrick",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Eska"
      ],
      "text": "Even after escaping from the South Pole, Bolin was still deeply afraid of Eska, cowering and shrieking in terror at just the sight of her on a short film clip produced by Varrick. He had the same reaction even after multiple viewings of the film."
    },
    {
      "body": "When he saw her again at the ${link_0}, a battle ensued, during which Eska managed to encase Bolin in a block of ice in the ${link_1}. However, when Bolin confessed to her that he had always loved her and had merely been too overwhelmed when he had stood her up at the altar before, Eska kissed him, releasing him in the process. Their rekindled love caused Eska to come to Bolin's aid when he was under attack by ${link_2}. Ecstatic to see her, Bolin announced happily that they would face the end of the world together, which Eska deemed to be a romantic statement. After the battle was over, Bolin asked Eska to move to Republic City with him. However, after she declined, he readily stated that Desna was welcome to come along as well, though she also declined that offer. They both agreed that they got caught up in the moment and parted on good grounds. Despite this, Bolin was anxious about encountering Eska again three years later at the ${link_3} hotel.",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "dark spirits",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_spirits",
            "page": "Dark_spirits"
          }
        },
        {
          "body": "Republic City Four Elements",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_Four_Elements",
            "page": "Republic_City_Four_Elements"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Eska"
      ],
      "text": "When he saw her again at the South Pole, a battle ensued, during which Eska managed to encase Bolin in a block of ice in the Spirit World. However, when Bolin confessed to her that he had always loved her and had merely been too overwhelmed when he had stood her up at the altar before, Eska kissed him, releasing him in the process. Their rekindled love caused Eska to come to Bolin's aid when he was under attack by dark spirits. Ecstatic to see her, Bolin announced happily that they would face the end of the world together, which Eska deemed to be a romantic statement. After the battle was over, Bolin asked Eska to move to Republic City with him. However, after she declined, he readily stated that Desna was welcome to come along as well, though she also declined that offer. They both agreed that they got caught up in the moment and parted on good grounds. Despite this, Bolin was anxious about encountering Eska again three years later at the Republic City Four Elements hotel."
    },
    {
      "body": "Bolin first encountered Ginger on Varrick's yacht. A model for the businessman, she immediately did some flashy poses at Varrick's request, quickly catching Bolin's attention. After returning to Republic City with the intention of turning Bolin into a movie star and the face of the Southern Water Tribe rebellion, Varrick cast Ginger as Bolin's girlfriend for the movie. Bolin quickly began trying to replicate the relationship he had with the actor outside the film; Ginger, however, was completely indifferent to his advances, saying that her only interest in Bolin was to his character.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Ginger"
      ],
      "text": "Bolin first encountered Ginger on Varrick's yacht. A model for the businessman, she immediately did some flashy poses at Varrick's request, quickly catching Bolin's attention. After returning to Republic City with the intention of turning Bolin into a movie star and the face of the Southern Water Tribe rebellion, Varrick cast Ginger as Bolin's girlfriend for the movie. Bolin quickly began trying to replicate the relationship he had with the actor outside the film; Ginger, however, was completely indifferent to his advances, saying that her only interest in Bolin was to his character."
    },
    {
      "body": "Bolin and Ginger arrived as a couple to the premiere of the finale of ${link_0} at the Pro-bending Arena. They walked arm in arm past the crowds of people waiting for them, waving as they went. Much to Bolin's pleasure, ${link_1} referred to them as Republic City's most famous couple. However, as soon as they entered the Arena, Ginger dropped back into her usual demeanor, stating Bolin to be \"as dumb as the rocks [he] ben[t]\" and walked off by herself.",
      "links": [
        {
          "body": "The Adventures of Nuktuk: Hero of the South",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/The_Adventures_of_Nuktuk__Hero_of_the_South",
            "page": "The_Adventures_of_Nuktuk__Hero_of_the_South"
          }
        },
        {
          "body": "Shiro Shinobi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Shiro_Shinobi",
            "page": "Shiro_Shinobi"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Ginger"
      ],
      "text": "Bolin and Ginger arrived as a couple to the premiere of the finale of The Adventures of Nuktuk: Hero of the South at the Pro-bending Arena. They walked arm in arm past the crowds of people waiting for them, waving as they went. Much to Bolin's pleasure, Shiro Shinobi referred to them as Republic City's most famous couple. However, as soon as they entered the Arena, Ginger dropped back into her usual demeanor, stating Bolin to be \"as dumb as the rocks [he] ben[t]\" and walked off by herself."
    },
    {
      "body": "However, while Bolin battled the waterbenders who were after President Raiko, Ginger expressed her concern for him. After he had saved the President, she rushed out to where Bolin was having his photo taken and kissed him intensely, proclaiming that she could not believe her \"boyfriend\" was a \"real-life hero\", leaving Bolin somewhat confused after her previous statement. She quickly brushed aside his bafflement and kissed him again, which Bolin gladly returned.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Ginger"
      ],
      "text": "However, while Bolin battled the waterbenders who were after President Raiko, Ginger expressed her concern for him. After he had saved the President, she rushed out to where Bolin was having his photo taken and kissed him intensely, proclaiming that she could not believe her \"boyfriend\" was a \"real-life hero\", leaving Bolin somewhat confused after her previous statement. She quickly brushed aside his bafflement and kissed him again, which Bolin gladly returned."
    },
    {
      "body": "Bolin first met Korra in the Pro-bending Arena gym, when she was caught wandering about the arena by Toza. He bailed her out, saying she was there with him, accidentally implying that they were \"together\". While his brother was initially dismissive of Korra, Bolin was quickly attracted to Korra, stating that he had \"a good feeling, there [was] somethin' special about her\".",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "Bolin first met Korra in the Pro-bending Arena gym, when she was caught wandering about the arena by Toza. He bailed her out, saying she was there with him, accidentally implying that they were \"together\". While his brother was initially dismissive of Korra, Bolin was quickly attracted to Korra, stating that he had \"a good feeling, there [was] somethin' special about her\"."
    },
    {
      "body": "Grateful to Korra for rescuing him from the Equalists, he brought the Avatar a small cake and a rose, much to her surprise but subsequent indifference. When a ${link_0} brought Korra a large gift basket in the name of ${link_1}, Bolin expressed concern, immediately inquiring whether that \"Tarrlok guy\" was bothering her, as he was willing to have a word with him. When Korra laughed it off, saying that Tarrlok was just \"some old guy\" on the council, Bolin expressed relief.",
      "links": [
        {
          "body": "messenger",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Council_page",
            "page": "Council_page"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tarrlok",
            "page": "Tarrlok"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "Grateful to Korra for rescuing him from the Equalists, he brought the Avatar a small cake and a rose, much to her surprise but subsequent indifference. When a messenger brought Korra a large gift basket in the name of Tarrlok, Bolin expressed concern, immediately inquiring whether that \"Tarrlok guy\" was bothering her, as he was willing to have a word with him. When Korra laughed it off, saying that Tarrlok was just \"some old guy\" on the council, Bolin expressed relief."
    },
    {
      "body": "Bolin asked Mako what he thought of Korra as a potential girlfriend, meaning for himself, though Mako mistook the question. When Mako told Bolin dating her was a bad idea, the earthbender stated that he and Korra were perfect for each other, confessing his crush. Eventually, after flattering her to cheer her up, he asked Korra out on a date. They went for food and drinks at Narook's Seaweed Noodlery and visited ${link_0} in the city. Both enjoyed the date, however, Bolin was greatly hurt and disappointed when he brought Korra flowers and accidentally walked in on her kissing his brother. After winning the semifinals of the Pro-bending Tournament, Korra apologized to Bolin, who forgave her, and the two agreed to continue their friendship. Korra called him \"one of a kind\", something Bolin had called her earlier on their date.",
      "links": [
        {
          "body": "Harmony Tower",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Harmony_Tower",
            "page": "Harmony_Tower"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "Bolin asked Mako what he thought of Korra as a potential girlfriend, meaning for himself, though Mako mistook the question. When Mako told Bolin dating her was a bad idea, the earthbender stated that he and Korra were perfect for each other, confessing his crush. Eventually, after flattering her to cheer her up, he asked Korra out on a date. They went for food and drinks at Narook's Seaweed Noodlery and visited Harmony Tower in the city. Both enjoyed the date, however, Bolin was greatly hurt and disappointed when he brought Korra flowers and accidentally walked in on her kissing his brother. After winning the semifinals of the Pro-bending Tournament, Korra apologized to Bolin, who forgave her, and the two agreed to continue their friendship. Korra called him \"one of a kind\", something Bolin had called her earlier on their date."
    },
    {
      "body": "After Korra had returned from chasing the Equalists following their attack on the Pro-bending Arena, Bolin joined his brother in hugging her, showing how much he cares about her. After confiding to Asami that Mako and Korra had kissed, Asami expressed shock, but Bolin claimed he \"was over it\", stating his opinion that the kiss meant nothing.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "After Korra had returned from chasing the Equalists following their attack on the Pro-bending Arena, Bolin joined his brother in hugging her, showing how much he cares about her. After confiding to Asami that Mako and Korra had kissed, Asami expressed shock, but Bolin claimed he \"was over it\", stating his opinion that the kiss meant nothing."
    },
    {
      "body": "Before the final battle, Bolin warned Korra that \"Amon [was] a nasty dude\" and offered her a hug before she left to fight Amon with Mako. As they hugged, he looked on with a worried and upset feeling on his face. Afterward, when Amon had stripped Korra's bending, Bolin attempted to cheer her up by mentioning the fact that she still had her ability to ${link_0}, only to receive glares from everyone, prompting Bolin to keep quiet. He was later alongside Team Avatar and their allies at the ${link_1}, hoping that ${link_2} would be able to restore Korra's bending.",
      "links": [
        {
          "body": "airbend",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "Before the final battle, Bolin warned Korra that \"Amon [was] a nasty dude\" and offered her a hug before she left to fight Amon with Mako. As they hugged, he looked on with a worried and upset feeling on his face. Afterward, when Amon had stripped Korra's bending, Bolin attempted to cheer her up by mentioning the fact that she still had her ability to airbend, only to receive glares from everyone, prompting Bolin to keep quiet. He was later alongside Team Avatar and their allies at the Southern Water Tribe, hoping that Katara would be able to restore Korra's bending."
    },
    {
      "body": "Opal is the daughter of ${link_0} and ${link_1}'s half-niece. Upon meeting Opal, it became clear that the two shared mutual interest in each other. She shyly blushed upon introducing herself after Bolin remarked that Opal was a beautiful name. Later, Bolin approached Opal in flirtatious manner, much to the latter's disgust. As an upset Opal walked away, Bolin got in front of her and apologized, to which she smiled and told him to just be himself. The two shared a moment before they were interrupted by Korra.",
      "links": [
        {
          "body": "Suyin Beifong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "Lin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Opal"
      ],
      "text": "Opal is the daughter of Suyin Beifong and Lin's half-niece. Upon meeting Opal, it became clear that the two shared mutual interest in each other. She shyly blushed upon introducing herself after Bolin remarked that Opal was a beautiful name. Later, Bolin approached Opal in flirtatious manner, much to the latter's disgust. As an upset Opal walked away, Bolin got in front of her and apologized, to which she smiled and told him to just be himself. The two shared a moment before they were interrupted by Korra."
    },
    {
      "body": "The next day, while Bolin attempted metalbending to no avail and became frustrated, Opal approached him. She reminded Bolin that her mother had assistance from Toph, Bolin's greatest idol, and suggested he overcome his fears. Bolin retorted by pointing out that Opal was fearful of leaving her home and going to the Northern Air Temple to begin training. Opal agreed, saying that she was unsure of what to do, and the two embraced, prompting Bolin to happily commend their healthy discussion of their feelings and support for one another.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Opal"
      ],
      "text": "The next day, while Bolin attempted metalbending to no avail and became frustrated, Opal approached him. She reminded Bolin that her mother had assistance from Toph, Bolin's greatest idol, and suggested he overcome his fears. Bolin retorted by pointing out that Opal was fearful of leaving her home and going to the Northern Air Temple to begin training. Opal agreed, saying that she was unsure of what to do, and the two embraced, prompting Bolin to happily commend their healthy discussion of their feelings and support for one another."
    },
    {
      "body": "Later, when Korra was communicating with Tenzin via the radio to inform the latter of Opal's decision to head to the Northern Air Temple to begin official training, Bolin described her as \"wonderful, and pretty, and so smart,\" reaffirming his affection for her.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Opal"
      ],
      "text": "Later, when Korra was communicating with Tenzin via the radio to inform the latter of Opal's decision to head to the Northern Air Temple to begin official training, Bolin described her as \"wonderful, and pretty, and so smart,\" reaffirming his affection for her."
    },
    {
      "body": "On the day of Opal's departure to the Northern Air Temple, Bolin was in the courtyard training with Korra and Wei and Wing when he was informed by Mako and Asami that it was time to get ready for Opal's farewell dinner. Bolin expressed sadness at this, stating that it was \"the worst day ever.\" During the dinner, Bolin and Opal chatted with each other, with the former saying that he would miss Opal and the latter promising they would be together soon. Bolin was later present with the others when Opal took off in an airship, where he waved goodbye and sadly sighed.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Opal"
      ],
      "text": "On the day of Opal's departure to the Northern Air Temple, Bolin was in the courtyard training with Korra and Wei and Wing when he was informed by Mako and Asami that it was time to get ready for Opal's farewell dinner. Bolin expressed sadness at this, stating that it was \"the worst day ever.\" During the dinner, Bolin and Opal chatted with each other, with the former saying that he would miss Opal and the latter promising they would be together soon. Bolin was later present with the others when Opal took off in an airship, where he waved goodbye and sadly sighed."
    },
    {
      "body": "Upon rescuing Opal and the airbenders from the ${link_0}, Bolin was so happy to see her, he shoved Suyin away from her daughter so he could hug her himself. After the defeat of Zaheer, Bolin's crude method of silencing the anarchist made Opal smile and simply state it was his normal antics.",
      "links": [
        {
          "body": "Red Lotus",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Red_Lotus",
            "page": "Red_Lotus"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Opal"
      ],
      "text": "Upon rescuing Opal and the airbenders from the Red Lotus, Bolin was so happy to see her, he shoved Suyin away from her daughter so he could hug her himself. After the defeat of Zaheer, Bolin's crude method of silencing the anarchist made Opal smile and simply state it was his normal antics."
    },
    {
      "body": "At some point in the next three years, they entered in a romantic relationship with each other. By 174 AG, Bolin and Opal were still together, though due to Bolin joining the ${link_0} to bring unity to the Earth Kingdom, the couple was forced to live apart. The long distance and the fact that Opal did not appreciate Kuvira and her immoral methods much put a strain on their relationship, which was something Bolin later came to blame himself for after escaping the Earth Empire.",
      "links": [
        {
          "body": "military of the Earth Empire",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Opal"
      ],
      "text": "At some point in the next three years, they entered in a romantic relationship with each other. By 174 AG, Bolin and Opal were still together, though due to Bolin joining the military of the Earth Empire to bring unity to the Earth Kingdom, the couple was forced to live apart. The long distance and the fact that Opal did not appreciate Kuvira and her immoral methods much put a strain on their relationship, which was something Bolin later came to blame himself for after escaping the Earth Empire."
    },
    {
      "body": "Although he denounced his loyalty to Kuvira and revealed her plan to the world leaders, his apology to Opal came too late, as she blamed him for working for the person that had captured her family. He promised to make it up to her, though she remained indifferent to his grand gestures. However, after he professed his love to her, she gave him the chance to win her back by accompanying her and Lin on a secret and dangerous mission to free their family, an opportunity he gladly accepted, as he was willing to do anything to win back her trust. After they succeeded, Opal forgave Bolin and reconciled with him, kissing his cheek, much to his delight.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Love interests",
        "Opal"
      ],
      "text": "Although he denounced his loyalty to Kuvira and revealed her plan to the world leaders, his apology to Opal came too late, as she blamed him for working for the person that had captured her family. He promised to make it up to her, though she remained indifferent to his grand gestures. However, after he professed his love to her, she gave him the chance to win her back by accompanying her and Lin on a secret and dangerous mission to free their family, an opportunity he gladly accepted, as he was willing to do anything to win back her trust. After they succeeded, Opal forgave Bolin and reconciled with him, kissing his cheek, much to his delight."
    },
    {
      "body": "As the younger brother of Asami's ex-boyfriend, Bolin seems to get along well with her. Both he and Mako were invited to live at the Sato mansion after the attack on the Pro-bending Arena, and Bolin gleefully indulged himself in all the perks of living in luxury. After the formation of the new Team Avatar, Asami began to suspect that Korra was more than just a friend to Mako, and began asking Bolin about his brother's relationship with her. Bolin at first attempted to deflect the questions, but was forced by Asami into revealing that Korra and Mako had once kissed. He immediately tried to comfort Asami by saying that he had gotten over it and that the incident did not mean anything, but to no avail. When ${link_0} fought in a ${link_1} duel against his daughter, Bolin aided her by attacking Hiroshi's machine, utilizing earth boulders to help Asami topple it over, effectively saving her life.",
      "links": [
        {
          "body": "Hiroshi Sato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "mecha tank",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_tank",
            "page": "Mecha_tank"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Asami"
      ],
      "text": "As the younger brother of Asami's ex-boyfriend, Bolin seems to get along well with her. Both he and Mako were invited to live at the Sato mansion after the attack on the Pro-bending Arena, and Bolin gleefully indulged himself in all the perks of living in luxury. After the formation of the new Team Avatar, Asami began to suspect that Korra was more than just a friend to Mako, and began asking Bolin about his brother's relationship with her. Bolin at first attempted to deflect the questions, but was forced by Asami into revealing that Korra and Mako had once kissed. He immediately tried to comfort Asami by saying that he had gotten over it and that the incident did not mean anything, but to no avail. When Hiroshi Sato fought in a mecha tank duel against his daughter, Bolin aided her by attacking Hiroshi's machine, utilizing earth boulders to help Asami topple it over, effectively saving her life."
    },
    {
      "body": "Six months later, their relationship had improved. As per Asami's request, Bolin accompanied her to a meeting with ${link_0}, a billionaire shipping business magnate with whom Asami intended to make a deal to save Future Industries from bankruptcy. Despite Asami's instructions not to say anything, Bolin's interactions with Varrick ultimately helped her get her deal. Asami hugged him and affectionately ruffled his hair, calling him a natural.",
      "links": [
        {
          "body": "Varrick",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Asami"
      ],
      "text": "Six months later, their relationship had improved. As per Asami's request, Bolin accompanied her to a meeting with Varrick, a billionaire shipping business magnate with whom Asami intended to make a deal to save Future Industries from bankruptcy. Despite Asami's instructions not to say anything, Bolin's interactions with Varrick ultimately helped her get her deal. Asami hugged him and affectionately ruffled his hair, calling him a natural."
    },
    {
      "body": "Later, the two spent time at Varrick's mansion together when he told the two that they needed to buy the judge off. However, upon hearing that Bolin had given the money to the wrong person, Asami hit herself on the forehead with her palm. Bolin later disapproved of Asami and Mako growing more intimate again, as it had only been a week since his brother's break-up with Korra.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Asami"
      ],
      "text": "Later, the two spent time at Varrick's mansion together when he told the two that they needed to buy the judge off. However, upon hearing that Bolin had given the money to the wrong person, Asami hit herself on the forehead with her palm. Bolin later disapproved of Asami and Mako growing more intimate again, as it had only been a week since his brother's break-up with Korra."
    },
    {
      "body": "During the finale of The Adventures of Nuktuk: Hero of the South, Bolin stepped outside after feeling lonely and separated from his friends. Curious as to why he was feeling dejected, Asami followed him and consoled him. Bolin explained that he was unhappy with how Team Avatar had grown so far apart and Asami echoed him, stating that things had dramatically changed since their first encounter. She encouraged him to go back and watch the mover, though allowed him to stay and think things over after he refused, desiring more time to himself. Asami was later elated by Bolin's heroics in stopping the attempted kidnapping of Varrick.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Asami"
      ],
      "text": "During the finale of The Adventures of Nuktuk: Hero of the South, Bolin stepped outside after feeling lonely and separated from his friends. Curious as to why he was feeling dejected, Asami followed him and consoled him. Bolin explained that he was unhappy with how Team Avatar had grown so far apart and Asami echoed him, stating that things had dramatically changed since their first encounter. She encouraged him to go back and watch the mover, though allowed him to stay and think things over after he refused, desiring more time to himself. Asami was later elated by Bolin's heroics in stopping the attempted kidnapping of Varrick."
    },
    {
      "body": "The friendship between the two continued to grow as they spent even more time together while tracking down airbenders or the Red Lotus. They were capable of playing games with each other on a friendly basis while trading jabs.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Asami"
      ],
      "text": "The friendship between the two continued to grow as they spent even more time together while tracking down airbenders or the Red Lotus. They were capable of playing games with each other on a friendly basis while trading jabs."
    },
    {
      "body": "When the group reunited at the ${link_0}, after Asami and Korra had gotten captured, Bolin immediately ran up to Asami and gave her a big hug that lifted her off her feet.",
      "links": [
        {
          "body": "Misty Palms Oasis",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Misty_Palms_Oasis",
            "page": "Misty_Palms_Oasis"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Asami"
      ],
      "text": "When the group reunited at the Misty Palms Oasis, after Asami and Korra had gotten captured, Bolin immediately ran up to Asami and gave her a big hug that lifted her off her feet."
    },
    {
      "body": "Bolin met Varrick while accompanying Asami to a business meeting at Varrick's yacht. Varrick quickly took a liking to Bolin when he was the only one in the room to be honest with him and tell him he wasn't levitating, as he believed. Varrick considered Bolin a straight-shooter, just like himself. Later, when Korra was to venture into the South Pole, Varrick supplied Bolin with a snowmobile, and a highly equipped snowsuit. Varrick also supported Bolin's attempts to break up with Eska, especially when she attempted to forcibly marry him, suggesting that he flee. Varrick was more than happy to speed Bolin away from Eska as she approached his yacht. By working together on The Adventures of Nuktuk: Hero of the South, Bolin's trust in Varrick continued to grow, even to the point where he had enough trust in Varrick that he refused to believe Mako when he vehemently suggested that Varrick was behind the recent theft of Future Industries goods. Even though Bolin discovered Varrick's treachery later on and was greatly shocked by this revelation, he still greatly respected him, acknowledging that Varrick had also helped him become an actor.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Iknik Blackstone Varrick"
      ],
      "text": "Bolin met Varrick while accompanying Asami to a business meeting at Varrick's yacht. Varrick quickly took a liking to Bolin when he was the only one in the room to be honest with him and tell him he wasn't levitating, as he believed. Varrick considered Bolin a straight-shooter, just like himself. Later, when Korra was to venture into the South Pole, Varrick supplied Bolin with a snowmobile, and a highly equipped snowsuit. Varrick also supported Bolin's attempts to break up with Eska, especially when she attempted to forcibly marry him, suggesting that he flee. Varrick was more than happy to speed Bolin away from Eska as she approached his yacht. By working together on The Adventures of Nuktuk: Hero of the South, Bolin's trust in Varrick continued to grow, even to the point where he had enough trust in Varrick that he refused to believe Mako when he vehemently suggested that Varrick was behind the recent theft of Future Industries goods. Even though Bolin discovered Varrick's treachery later on and was greatly shocked by this revelation, he still greatly respected him, acknowledging that Varrick had also helped him become an actor."
    },
    {
      "body": "During his journey to the ${link_0}, Bolin even admitted that he missed him, as Varrick \"really knew how to make a long trip interesting\". Weeks later, while Bolin and the rest of Team Avatar were dining with Suyin's family in Zaofu, Varrick showed up, pleasantly surprising the earthbender. When Kuvira decided to take it upon herself to stabilize the Earth Kingdom, both Varrick and Bolin joined her cause, influencing one another that it was one worth fighting for. However, when Bolin became disenchanted of her due to the lengths she was willing to go to in order to unite the Earth Kingdom, he went to see Varrick. After exclaiming together that Kuvira was crazy, they decided to escape together along with ${link_1}, They managed to do so after Varrick blew up his research and their part of the train, leaving the army with the impression that they had perished. Although Bolin liked the inventor, he was not above criticizing him when Varrick was only thinking of himself. Regardless, Bolin and Varrick remained close, to the point where Bolin was trusted to handle the marriage ceremony between the inventor and Zhu Li.",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Zhu Li",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Iknik Blackstone Varrick"
      ],
      "text": "During his journey to the South Pole, Bolin even admitted that he missed him, as Varrick \"really knew how to make a long trip interesting\". Weeks later, while Bolin and the rest of Team Avatar were dining with Suyin's family in Zaofu, Varrick showed up, pleasantly surprising the earthbender. When Kuvira decided to take it upon herself to stabilize the Earth Kingdom, both Varrick and Bolin joined her cause, influencing one another that it was one worth fighting for. However, when Bolin became disenchanted of her due to the lengths she was willing to go to in order to unite the Earth Kingdom, he went to see Varrick. After exclaiming together that Kuvira was crazy, they decided to escape together along with Zhu Li, They managed to do so after Varrick blew up his research and their part of the train, leaving the army with the impression that they had perished. Although Bolin liked the inventor, he was not above criticizing him when Varrick was only thinking of himself. Regardless, Bolin and Varrick remained close, to the point where Bolin was trusted to handle the marriage ceremony between the inventor and Zhu Li."
    },
    {
      "body": "The relationship between ${link_0} and Bolin is complicated, and on some occasions, one-sided. Bolin first met Kai during Team Avatar's search for airbenders in the Earth Kingdom. Bolin was one of the first people who trusted Kai, as he felt a connectedness with the boy due top their shared history. Finding out that his story was embellished to cover his thievery, Bolin still forgave him, going so far as calling him his little brother. The earthbender greatly believed in the young airbender and continued to express concern for him, even though he stole the brothers' money and passports, effectively stranding them in the Lower Ring of Ba Sing Se. Later, when Mako, Bolin, and ${link_1} rescued Kai from the clutches of the ${link_2}, Bolin quickly accepted his apology for his actions and gave him a warm hug. He continued to show his support after Kai and ${link_3} rescued him, Mako, Asami, and Tenzin at the Northern Air Temple by mentioning to everyone present that they could not have escaped without him.",
      "links": [
        {
          "body": "Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kai",
            "page": "Kai"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Lefty",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Lefty",
            "page": "Lefty"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Kai"
      ],
      "text": "The relationship between Kai and Bolin is complicated, and on some occasions, one-sided. Bolin first met Kai during Team Avatar's search for airbenders in the Earth Kingdom. Bolin was one of the first people who trusted Kai, as he felt a connectedness with the boy due top their shared history. Finding out that his story was embellished to cover his thievery, Bolin still forgave him, going so far as calling him his little brother. The earthbender greatly believed in the young airbender and continued to express concern for him, even though he stole the brothers' money and passports, effectively stranding them in the Lower Ring of Ba Sing Se. Later, when Mako, Bolin, and Jinora rescued Kai from the clutches of the Dai Li, Bolin quickly accepted his apology for his actions and gave him a warm hug. He continued to show his support after Kai and Lefty rescued him, Mako, Asami, and Tenzin at the Northern Air Temple by mentioning to everyone present that they could not have escaped without him."
    },
    {
      "body": "Despite a lack of interaction between the two, Naga considers Bolin a trustworthy friend. Any friend of Korra is a friend of hers and the polar bear dog was trusted by Korra to protect Bolin. Not only did she rescue Bolin, Asami, and Iroh from an Equalist holding cell by demolishing the metal bars, she protected Bolin when he was about to be attacked by three mecha tanks, grasping the claws fired at him, ultimately knocking them over and destroying them.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Naga"
      ],
      "text": "Despite a lack of interaction between the two, Naga considers Bolin a trustworthy friend. Any friend of Korra is a friend of hers and the polar bear dog was trusted by Korra to protect Bolin. Not only did she rescue Bolin, Asami, and Iroh from an Equalist holding cell by demolishing the metal bars, she protected Bolin when he was about to be attacked by three mecha tanks, grasping the claws fired at him, ultimately knocking them over and destroying them."
    },
    {
      "body": "Bolin first met Pabu in Republic City, rescued him, and made him his pet. Afterward, he joined Bolin in playing a series of pranks on Mako. When the team needed to raise money for the entry fee into the Pro-bending Tournament, Bolin and Pabu made an attempt at being street performers, with Pabu doing minor circus tricks. They earned a total of one yuan. During Bolin's emotional breakdown, Pabu joined him in overindulging on noodles. Pabu understands Bolin's instructions well, as demonstrated by his performances and when the team was tied up following the Equalists' attack on the Pro-bending Arena. Bolin gestured for Pabu to bite through the rope, which the fire ferret quickly understood, freeing them from their trap.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Pabu"
      ],
      "text": "Bolin first met Pabu in Republic City, rescued him, and made him his pet. Afterward, he joined Bolin in playing a series of pranks on Mako. When the team needed to raise money for the entry fee into the Pro-bending Tournament, Bolin and Pabu made an attempt at being street performers, with Pabu doing minor circus tricks. They earned a total of one yuan. During Bolin's emotional breakdown, Pabu joined him in overindulging on noodles. Pabu understands Bolin's instructions well, as demonstrated by his performances and when the team was tied up following the Equalists' attack on the Pro-bending Arena. Bolin gestured for Pabu to bite through the rope, which the fire ferret quickly understood, freeing them from their trap."
    },
    {
      "body": "While Bolin lived on the street, he and his brother befriended Skoochy, a younger street urchin. Skoochy hangs out around Central City Station, a usual hangout of Bolin's. When Bolin went missing, Mako and Korra came to Skoochy for information, and he helped them, albeit at a \"price\". He revealed that Bolin was recruited to help the Triple Threat Triad.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Skoochy"
      ],
      "text": "While Bolin lived on the street, he and his brother befriended Skoochy, a younger street urchin. Skoochy hangs out around Central City Station, a usual hangout of Bolin's. When Bolin went missing, Mako and Korra came to Skoochy for information, and he helped them, albeit at a \"price\". He revealed that Bolin was recruited to help the Triple Threat Triad."
    },
    {
      "body": "When Hiroshi was discovered to be an Equalist, Bolin, Mako, and Asami took up Korra's offer to live on ${link_0}. Bolin was eternally grateful for the airbenders' help and seemed fond of Ikki and Meelo, seeing Meelo as being sweet and being as fast-paced as Ikki when it came to questions. After the events of ${link_1} resulted in the brothers' apartment being overrun by ${link_2}, Bolin and Mako were invited by Tenzin to stay on Air Temple Island, though only Bolin accepted the airbender's offer.",
      "links": [
        {
          "body": "Air Temple Island",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "spirit vines",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Tenzin and his family"
      ],
      "text": "When Hiroshi was discovered to be an Equalist, Bolin, Mako, and Asami took up Korra's offer to live on Air Temple Island. Bolin was eternally grateful for the airbenders' help and seemed fond of Ikki and Meelo, seeing Meelo as being sweet and being as fast-paced as Ikki when it came to questions. After the events of Harmonic Convergence resulted in the brothers' apartment being overrun by spirit vines, Bolin and Mako were invited by Tenzin to stay on Air Temple Island, though only Bolin accepted the airbender's offer."
    },
    {
      "body": "Since he first became an earthbender, Bolin came to greatly admire Toph as the creator of metalbending, wanting to learn the skill himself, despite failing to do so. When Bolin finally met her, he was shocked and delighted; earning himself an abrasive comment from Toph, who found his excited antics annoying. He further sunk in her eyes when she learned that he had affiliated with Kuvira, though she was willing to answer some of his questions, such as who Lin's father was. Bolin was delighted upon receiving a rare compliment from Toph, namely on his achievement of becoming a lavabender. Toph never truly warmed up to his personality, however, as she directly brushed off his sappy attitude when he hugged her and started to relay his own experiences with family.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Toph Beifong"
      ],
      "text": "Since he first became an earthbender, Bolin came to greatly admire Toph as the creator of metalbending, wanting to learn the skill himself, despite failing to do so. When Bolin finally met her, he was shocked and delighted; earning himself an abrasive comment from Toph, who found his excited antics annoying. He further sunk in her eyes when she learned that he had affiliated with Kuvira, though she was willing to answer some of his questions, such as who Lin's father was. Bolin was delighted upon receiving a rare compliment from Toph, namely on his achievement of becoming a lavabender. Toph never truly warmed up to his personality, however, as she directly brushed off his sappy attitude when he hugged her and started to relay his own experiences with family."
    },
    {
      "body": "Toza is a former pro-bender and is currently the gym manager for the Pro-bending Arena. One day Toza discovered Mako fighting in the streets and invited him and Bolin to live in the attic of the arena. The brothers had to work strange jobs to pay their rent. Overall, he was good toward the brothers.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Toza"
      ],
      "text": "Toza is a former pro-bender and is currently the gym manager for the Pro-bending Arena. One day Toza discovered Mako fighting in the streets and invited him and Bolin to live in the attic of the arena. The brothers had to work strange jobs to pay their rent. Overall, he was good toward the brothers."
    },
    {
      "body": "Bolin worked for the ${link_0} while he and Mako lived on the street. To survive, the brothers usually \"ran numbers\" for the organization. Years later, when the Fire Ferrets needed to ante up thirty thousand yuans for the Pro-bending Tournament, Bolin made his way to ${link_1}, having Pabu do circus tricks for money. Rather by chance ${link_2}, a Triple Threat Triad member and recruiter, passed by. The criminal kindly greeted Bolin and treated him like an old friend, although Bolin had left the group for years. Shin even offered him to provide security detail for the triad, since he apparently still trusted him. Bolin hesitated at first to accept the offer because \"Mako told [him] to stay away from the Triple Threats\". This delay, however, ended quickly when Shin offered him substantial amount of yuans for the job.",
      "links": [
        {
          "body": "Triple Threat Triad",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "Central City Station",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Central_City_Station",
            "page": "Central_City_Station"
          }
        },
        {
          "body": "Shady Shin",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Shady_Shin",
            "page": "Shady_Shin"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Triple Threat Triad"
      ],
      "text": "Bolin worked for the Triple Threat Triad while he and Mako lived on the street. To survive, the brothers usually \"ran numbers\" for the organization. Years later, when the Fire Ferrets needed to ante up thirty thousand yuans for the Pro-bending Tournament, Bolin made his way to Central City Station, having Pabu do circus tricks for money. Rather by chance Shady Shin, a Triple Threat Triad member and recruiter, passed by. The criminal kindly greeted Bolin and treated him like an old friend, although Bolin had left the group for years. Shin even offered him to provide security detail for the triad, since he apparently still trusted him. Bolin hesitated at first to accept the offer because \"Mako told [him] to stay away from the Triple Threats\". This delay, however, ended quickly when Shin offered him substantial amount of yuans for the job."
    },
    {
      "body": "This \"security-work\" was rather short-lived as the ${link_0} raided the triad's ${link_1} shortly thereafter and kidnapped Bolin and the gang members. Later on, Bolin witnessed in terror how ${link_2} ${link_3} the ${link_4} of the mobsters, including Shady Shin. When Bolin was rescued by Korra and Mako, however, he thought not a moment on the Triple Threats or their whereabouts. It therefore seems so that Bolin's relationship with the Triple Threats is friendly and based on trust, but there is, however, not a real friendship that connects him with the mobsters.",
      "links": [
        {
          "body": "Equalists",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "headquarters",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad_headquarters",
            "page": "Triple_Threat_Triad_headquarters"
          }
        },
        {
          "body": "Amon",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        },
        {
          "body": "took",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "bending",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Allies",
        "Triple Threat Triad"
      ],
      "text": "This \"security-work\" was rather short-lived as the Equalists raided the triad's headquarters shortly thereafter and kidnapped Bolin and the gang members. Later on, Bolin witnessed in terror how Amon took the bending of the mobsters, including Shady Shin. When Bolin was rescued by Korra and Mako, however, he thought not a moment on the Triple Threats or their whereabouts. It therefore seems so that Bolin's relationship with the Triple Threats is friendly and based on trust, but there is, however, not a real friendship that connects him with the mobsters."
    },
    {
      "body": "The Equalists conducted a raid on the Triple Threat Triad's headquarters during Bolin's brief security detail. He was abducted alongside the gang members. Amon planned to use the captured benders to demonstrate his ability to take people's bending away permanently. Korra and Mako were able to rescue Bolin before Amon could attack him. He later expressed his fear days after the incident, saying he still could not sleep well.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Enemies",
        "Amon and the Equalists"
      ],
      "text": "The Equalists conducted a raid on the Triple Threat Triad's headquarters during Bolin's brief security detail. He was abducted alongside the gang members. Amon planned to use the captured benders to demonstrate his ability to take people's bending away permanently. Korra and Mako were able to rescue Bolin before Amon could attack him. He later expressed his fear days after the incident, saying he still could not sleep well."
    },
    {
      "body": "Bolin later encountered the Equalists again during their attack on the Pro-bending Arena. He was knocked unconscious when the ${link_0} stunned the Fire Ferrets with his ${link_1}. The team was subsequently tied up to a support post of the ring and left to face the dangerous explosions caused by the Equalists.",
      "links": [
        {
          "body": "Lieutenant",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "electrified kali sticks",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Electrified_kali_sticks",
            "page": "Electrified_kali_sticks"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Enemies",
        "Amon and the Equalists"
      ],
      "text": "Bolin later encountered the Equalists again during their attack on the Pro-bending Arena. He was knocked unconscious when the Lieutenant stunned the Fire Ferrets with his electrified kali sticks. The team was subsequently tied up to a support post of the ring and left to face the dangerous explosions caused by the Equalists."
    },
    {
      "body": "Originally, Hiroshi and Bolin were on good terms when Hiroshi sponsored the Fire Ferrets during the tournament. That all quickly changed, however, once Korra started accusing Hiroshi of working with the Equalists. After discovering that Korra was indeed correct, he was clearly upset about the revelation.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Enemies",
        "Hiroshi Sato"
      ],
      "text": "Originally, Hiroshi and Bolin were on good terms when Hiroshi sponsored the Fire Ferrets during the tournament. That all quickly changed, however, once Korra started accusing Hiroshi of working with the Equalists. After discovering that Korra was indeed correct, he was clearly upset about the revelation."
    },
    {
      "body": "During the attack on ${link_0}'s fleet, the Equalists used a new fast-moving ${link_1} which made the attack easier. Bolin asked himself how Hiroshi finds time to keep making \"new evil machines.\" When Bolin, Iroh, and Asami went to ${link_2} to finish him and stop the planes, they were captured. Bolin became shocked upon hearing that Hiroshi intercepted a message Iroh sent out to Commander ${link_3} and was about to destroy the fleet; thus, he tried to stop the biplanes by destroying them following their escape.",
      "links": [
        {
          "body": "General Iroh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh_(United_Forces_general)",
            "page": "Iroh_(United_Forces_general)"
          }
        },
        {
          "body": "plane",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Biplane",
            "page": "Biplane"
          }
        },
        {
          "body": "Hiroshi's secret airfield",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi%27s_secret_airfield",
            "page": "Hiroshi%27s_secret_airfield"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi",
            "page": "Bumi"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Enemies",
        "Hiroshi Sato"
      ],
      "text": "During the attack on General Iroh's fleet, the Equalists used a new fast-moving plane which made the attack easier. Bolin asked himself how Hiroshi finds time to keep making \"new evil machines.\" When Bolin, Iroh, and Asami went to Hiroshi's secret airfield to finish him and stop the planes, they were captured. Bolin became shocked upon hearing that Hiroshi intercepted a message Iroh sent out to Commander Bumi and was about to destroy the fleet; thus, he tried to stop the biplanes by destroying them following their escape."
    },
    {
      "body": "When Hiroshi was getting ready to finish Asami for good, Bolin intervened, launching boulders at Hiroshi's mecha tank while riding on Naga. It was at that point that Bolin exclaimed to Hiroshi that he was a \"horrible father\".",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Enemies",
        "Hiroshi Sato"
      ],
      "text": "When Hiroshi was getting ready to finish Asami for good, Bolin intervened, launching boulders at Hiroshi's mecha tank while riding on Naga. It was at that point that Bolin exclaimed to Hiroshi that he was a \"horrible father\"."
    },
    {
      "body": "Being an idealist who wants to help people any way he can, Bolin idolized Kuvira and joined her cause, convinced they made lives better wherever they went. Although he was apprehensive about Kuvira's declaration of the establishment of an Earth Empire which would crush everyone standing in its way, his complete belief in their cause allowed him to only see the good in that. He turned a deaf ear to criticism at his commander's address, defending her actions and berating others for simply not understanding her.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Enemies",
        "Kuvira"
      ],
      "text": "Being an idealist who wants to help people any way he can, Bolin idolized Kuvira and joined her cause, convinced they made lives better wherever they went. Although he was apprehensive about Kuvira's declaration of the establishment of an Earth Empire which would crush everyone standing in its way, his complete belief in their cause allowed him to only see the good in that. He turned a deaf ear to criticism at his commander's address, defending her actions and berating others for simply not understanding her."
    },
    {
      "body": "His idealism, bordering on naivety, blindsided him to Kuvira's more sly actions, however, and he could easily be used to do her dirty work, like trying to convince Suyin to give up Zaofu. It was only after Opal pointed it out and Kuvira later acknowledged it that Bolin was made aware of the cost of the help he and the rest of the army gave the citizens, namely forced slave labor and a removal to reeducation camps. Realizing Kuvira's methods did not hold up against his idealism, he deemed her insane and no longer believed that what they were doing for others was right. He eventually managed to escape and his aversion toward Kuvira only grew after learning more of her actions first hand, such as purging the Earth Empire of everyone not from Earth Kingdom origin, and when he realized that siding with Kuvira might have cost him his relationship with Opal.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Enemies",
        "Kuvira"
      ],
      "text": "His idealism, bordering on naivety, blindsided him to Kuvira's more sly actions, however, and he could easily be used to do her dirty work, like trying to convince Suyin to give up Zaofu. It was only after Opal pointed it out and Kuvira later acknowledged it that Bolin was made aware of the cost of the help he and the rest of the army gave the citizens, namely forced slave labor and a removal to reeducation camps. Realizing Kuvira's methods did not hold up against his idealism, he deemed her insane and no longer believed that what they were doing for others was right. He eventually managed to escape and his aversion toward Kuvira only grew after learning more of her actions first hand, such as purging the Earth Empire of everyone not from Earth Kingdom origin, and when he realized that siding with Kuvira might have cost him his relationship with Opal."
    },
    {
      "body": "Zaheer and his team of Red Lotus bending experts attempted to kidnap Korra in order to further their anarchistic world goals, an act which made them a direct enemy of her close friends.",
      "links": [],
      "section": [
        "Bolin's relationships",
        "Enemies",
        "Red Lotus"
      ],
      "text": "Zaheer and his team of Red Lotus bending experts attempted to kidnap Korra in order to further their anarchistic world goals, an act which made them a direct enemy of her close friends."
    },
    {
      "body": "During the Red Lotus' attempted kidnappings of the Avatar, Bolin primarily fought against fellow earthbender, ${link_0}, developing a form of mutual respect. Although fighting over Korra's safety, Bolin and Ghazan would acknowledge each other's talent as an expert bender, as well as express their humorous quirks. While traveling to Ba Sing Se, Ghazan was genuinely impressed with Bolin's made-up scenarios regarding himself and Ming-Hua and happily claimed that two out of his three guesses were true. Bolin and Ghazan could also easily carry on a conversation, as the older man spoke calmly regarding his time spent in prison to Bolin.",
      "links": [
        {
          "body": "Ghazan",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ghazan",
            "page": "Ghazan"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Enemies",
        "Red Lotus",
        "Ghazan"
      ],
      "text": "During the Red Lotus' attempted kidnappings of the Avatar, Bolin primarily fought against fellow earthbender, Ghazan, developing a form of mutual respect. Although fighting over Korra's safety, Bolin and Ghazan would acknowledge each other's talent as an expert bender, as well as express their humorous quirks. While traveling to Ba Sing Se, Ghazan was genuinely impressed with Bolin's made-up scenarios regarding himself and Ming-Hua and happily claimed that two out of his three guesses were true. Bolin and Ghazan could also easily carry on a conversation, as the older man spoke calmly regarding his time spent in prison to Bolin."
    },
    {
      "body": "The two earthbenders faced each other for a last time in a duel within the ${link_0}. Although Ghazan would smile at Bolin while reminiscing about their previous battle at the ${link_1}, he was still trying to kill him. While demonstrating his newly acquired ${link_2} halfway through the fight, Bolin winked at Ghazan, impressing the Red Lotus member. After being defeated by the combined forces of Bolin and Mako, Ghazan angrily refused to be once again incarcerated, collapsing the entire cavern over himself in a last attempt to kill his adversary.",
      "links": [
        {
          "body": "Air Nomad caves",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomad_caves",
            "page": "Air_Nomad_caves"
          }
        },
        {
          "body": "Northern Air Temple",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        },
        {
          "body": "lavabending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Lavabending",
            "page": "Lavabending"
          }
        }
      ],
      "section": [
        "Bolin's relationships",
        "Enemies",
        "Red Lotus",
        "Ghazan"
      ],
      "text": "The two earthbenders faced each other for a last time in a duel within the Air Nomad caves. Although Ghazan would smile at Bolin while reminiscing about their previous battle at the Northern Air Temple, he was still trying to kill him. While demonstrating his newly acquired lavabending halfway through the fight, Bolin winked at Ghazan, impressing the Red Lotus member. After being defeated by the combined forces of Bolin and Mako, Ghazan angrily refused to be once again incarcerated, collapsing the entire cavern over himself in a last attempt to kill his adversary."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Bolin%27s_relationships",
    "file": "avatar.wikia.com/wiki/Bolin's_relationships.html",
    "page": "Bolin's_relationships",
    "title": "Bolin's relationships"
  }
}