{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Featured articles",
      "target": {
        "href": "Category_Featured_articles",
        "page": "Category_Featured_articles"
      }
    },
    {
      "body": "A-class articles",
      "target": {
        "href": "Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "href": "Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Guru ${link_0} used the pools of water along a stream as an analogy for the chakras.",
      "links": [
        {
          "body": "Pathik",
          "key": "${link_0}",
          "target": {
            "href": "Pathik",
            "page": "Pathik"
          }
        }
      ],
      "text": "Guru Pathik used the pools of water along a stream as an analogy for the chakras."
    },
    {
      "body": "Chakras are a series of points throughout the body where ${link_0} energy is heavily concentrated. There are seven chakras in total, all located on a central vertical axis.",
      "links": [
        {
          "body": "chi",
          "key": "${link_0}",
          "target": {
            "href": "Chi",
            "page": "Chi"
          }
        }
      ],
      "text": "Chakras are a series of points throughout the body where chi energy is heavily concentrated. There are seven chakras in total, all located on a central vertical axis."
    },
    {
      "body": "Each chakra has a specific purpose and deals with a different type of emotion. As such, each one can be opened and closed depending on the individual's state of mind. When a chakra is open, energy is free to flow about the body, whereas a sealed chakra restricts this flow of energy. The chakras must be opened in a specific order, or the energy will not be able to flow properly.",
      "links": [],
      "text": "Each chakra has a specific purpose and deals with a different type of emotion. As such, each one can be opened and closed depending on the individual's state of mind. When a chakra is open, energy is free to flow about the body, whereas a sealed chakra restricts this flow of energy. The chakras must be opened in a specific order, or the energy will not be able to flow properly."
    },
    {
      "body": "Guru ${link_0} used a series of connected pools as an analogy to illustrate how chakras worked. These pools were connected by waterfalls and channels, and were initially blocked by algae or muck, representing an individual's own emotional debris. Due to this blockage, the water, representing energy, stagnated and could not pass through the channels. When the clogs of algae were removed, symbolizing the opening of the chakras, it allowed the water to flow smoothly through the channels again, streaming through each pool fresh and clear.",
      "links": [
        {
          "body": "Pathik",
          "key": "${link_0}",
          "target": {
            "href": "Pathik",
            "page": "Pathik"
          }
        }
      ],
      "text": "Guru Pathik used a series of connected pools as an analogy to illustrate how chakras worked. These pools were connected by waterfalls and channels, and were initially blocked by algae or muck, representing an individual's own emotional debris. Due to this blockage, the water, representing energy, stagnated and could not pass through the channels. When the clogs of algae were removed, symbolizing the opening of the chakras, it allowed the water to flow smoothly through the channels again, streaming through each pool fresh and clear."
    },
    {
      "body": "During the spring of 100 ${link_0}, ${link_1} ${link_2} attempted, with Guru Pathik's help, to open his chakras so that he could enter and control the ${link_3} at will. Pathik warned him that once the process had begun, it could not be stopped until all seven chakras were open.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_3}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "During the spring of 100 AG, Avatar Aang attempted, with Guru Pathik's help, to open his chakras so that he could enter and control the Avatar State at will. Pathik warned him that once the process had begun, it could not be stopped until all seven chakras were open."
    },
    {
      "body": "${link_0} was immersed in cosmic energy after meditating upon his seventh chakra.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Aang was immersed in cosmic energy after meditating upon his seventh chakra."
    },
    {
      "body": "Albeit challenging, Aang successfully opened the first six chakras. However, when Pathik told Aang that opening the seventh would mean that he needed to \"let go\" of his love for ${link_0}, he was reluctant to attempt to open up the chakra. When he saw a vision of Katara in need while opening up the chakra, he promptly chose earthly attachments over cosmic energy, a choice that ultimately blocked his chakras, preventing him from entering the Avatar State. ${link_1} commended Aang for his choice later on, stating that it was not worth sacrificing love for the sake of power.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Albeit challenging, Aang successfully opened the first six chakras. However, when Pathik told Aang that opening the seventh would mean that he needed to \"let go\" of his love for Katara, he was reluctant to attempt to open up the chakra. When he saw a vision of Katara in need while opening up the chakra, he promptly chose earthly attachments over cosmic energy, a choice that ultimately blocked his chakras, preventing him from entering the Avatar State. Iroh commended Aang for his choice later on, stating that it was not worth sacrificing love for the sake of power."
    },
    {
      "body": "Nevertheless, when Aang and Katara were attacked by ${link_0}, ${link_1}, and the ${link_2}, Aang made the choice to let Katara go and subsequently opened the seventh chakra. He was able to enter the Avatar State, but was knocked out of it and gravely wounded when Azula struck him in the back with ${link_3}. Although Katara managed to ${link_4} his wounds and bring him back to life, Aang's seventh chakra was locked and he was unable to enter the Avatar State.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_2}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "lightning",
          "key": "${link_3}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "heal",
          "key": "${link_4}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "Nevertheless, when Aang and Katara were attacked by Azula, Zuko, and the Dai Li, Aang made the choice to let Katara go and subsequently opened the seventh chakra. He was able to enter the Avatar State, but was knocked out of it and gravely wounded when Azula struck him in the back with lightning. Although Katara managed to heal his wounds and bring him back to life, Aang's seventh chakra was locked and he was unable to enter the Avatar State."
    },
    {
      "body": "Despite opening his chakras, which allowed him to successfully access the Avatar State before being shot down, Aang continued to display the feelings that blocked them during his journey around the Fire Nation. He also exhibited these emotions during the day before the planned ${link_0} and suffered sleep deprivation and paranoia as a result.",
      "links": [
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "text": "Despite opening his chakras, which allowed him to successfully access the Avatar State before being shot down, Aang continued to display the feelings that blocked them during his journey around the Fire Nation. He also exhibited these emotions during the day before the planned invasion of the Fire Nation and suffered sleep deprivation and paranoia as a result."
    },
    {
      "body": "Aang remained unable to use the Avatar State throughout the entirety of his travels in the Fire Nation archipelago. He eventually regained access to the state during his battle with ${link_0}, when a protruding rock was pressed hard against the lightning's entry wound on his back, releasing all the blocked energy.",
      "links": [
        {
          "body": "Ozai",
          "key": "${link_0}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Aang remained unable to use the Avatar State throughout the entirety of his travels in the Fire Nation archipelago. He eventually regained access to the state during his battle with Ozai, when a protruding rock was pressed hard against the lightning's entry wound on his back, releasing all the blocked energy."
    },
    {
      "body": "These are the chakras in the order one must unlock them.",
      "links": [],
      "text": "These are the chakras in the order one must unlock them."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Chakras",
    "file": "avatar.wikia.com/wiki/Chakras.html",
    "page": "Chakras",
    "title": "Chakras"
  }
}