{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "external": false,
        "href": "/wiki/Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Featured articles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Featured_articles",
        "page": "Category_Featured_articles"
      }
    },
    {
      "body": "A-class articles",
      "target": {
        "external": false,
        "href": "/wiki/Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Chakras are a series of points throughout the body where ${link_0} energy is heavily concentrated. There are seven chakras in total, all located on a central vertical axis.",
      "links": [
        {
          "body": "chi",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Chi",
            "page": "Chi"
          }
        }
      ],
      "section": [
        "Chakras"
      ],
      "text": "Chakras are a series of points throughout the body where chi energy is heavily concentrated. There are seven chakras in total, all located on a central vertical axis."
    },
    {
      "body": "Each chakra has a specific purpose and deals with a different type of emotion. As such, each one can be opened and closed depending on the individual's state of mind. When a chakra is open, energy is free to flow about the body, whereas a sealed chakra restricts this flow of energy. The chakras must be opened in a specific order, or the energy will not be able to flow properly.",
      "links": [],
      "section": [
        "Chakras"
      ],
      "text": "Each chakra has a specific purpose and deals with a different type of emotion. As such, each one can be opened and closed depending on the individual's state of mind. When a chakra is open, energy is free to flow about the body, whereas a sealed chakra restricts this flow of energy. The chakras must be opened in a specific order, or the energy will not be able to flow properly."
    },
    {
      "body": "Guru ${link_0} used a series of connected pools as an analogy to illustrate how chakras worked. These pools were connected by waterfalls and channels, and were initially blocked by algae or muck, representing an individual's own emotional debris. Due to this blockage, the water, representing energy, stagnated and could not pass through the channels. When the clogs of algae were removed, symbolizing the opening of the chakras, it allowed the water to flow smoothly through the channels again, streaming through each pool fresh and clear.",
      "links": [
        {
          "body": "Pathik",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pathik",
            "page": "Pathik"
          }
        }
      ],
      "section": [
        "Chakras"
      ],
      "text": "Guru Pathik used a series of connected pools as an analogy to illustrate how chakras worked. These pools were connected by waterfalls and channels, and were initially blocked by algae or muck, representing an individual's own emotional debris. Due to this blockage, the water, representing energy, stagnated and could not pass through the channels. When the clogs of algae were removed, symbolizing the opening of the chakras, it allowed the water to flow smoothly through the channels again, streaming through each pool fresh and clear."
    },
    {
      "body": "During the spring of 100 ${link_0}, ${link_1} ${link_2} attempted, with Guru Pathik's help, to open his chakras so that he could enter and control the ${link_3} at will. Pathik warned him that once the process had begun, it could not be stopped until all seven chakras were open.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "Chakras",
        "History"
      ],
      "text": "During the spring of 100 AG, Avatar Aang attempted, with Guru Pathik's help, to open his chakras so that he could enter and control the Avatar State at will. Pathik warned him that once the process had begun, it could not be stopped until all seven chakras were open."
    },
    {
      "body": "Albeit challenging, Aang successfully opened the first six chakras. However, when Pathik told Aang that opening the seventh would mean that he needed to \"let go\" of his love for ${link_0}, he was reluctant to attempt to open up the chakra. When he saw a vision of Katara in need while opening up the chakra, he promptly chose earthly attachments over cosmic energy, a choice that ultimately blocked his chakras, preventing him from entering the Avatar State. ${link_1} commended Aang for his choice later on, stating that it was not worth sacrificing love for the sake of power.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        }
      ],
      "section": [
        "Chakras",
        "History"
      ],
      "text": "Albeit challenging, Aang successfully opened the first six chakras. However, when Pathik told Aang that opening the seventh would mean that he needed to \"let go\" of his love for Katara, he was reluctant to attempt to open up the chakra. When he saw a vision of Katara in need while opening up the chakra, he promptly chose earthly attachments over cosmic energy, a choice that ultimately blocked his chakras, preventing him from entering the Avatar State. Iroh commended Aang for his choice later on, stating that it was not worth sacrificing love for the sake of power."
    },
    {
      "body": "Nevertheless, when Aang and Katara were attacked by ${link_0}, ${link_1}, and the ${link_2}, Aang made the choice to let Katara go and subsequently opened the seventh chakra. He was able to enter the Avatar State, but was knocked out of it and gravely wounded when Azula struck him in the back with ${link_3}. Although Katara managed to ${link_4} his wounds and bring him back to life, Aang's seventh chakra was locked and he was unable to enter the Avatar State.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "lightning",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "heal",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Healing",
            "page": "Healing"
          }
        }
      ],
      "section": [
        "Chakras",
        "History"
      ],
      "text": "Nevertheless, when Aang and Katara were attacked by Azula, Zuko, and the Dai Li, Aang made the choice to let Katara go and subsequently opened the seventh chakra. He was able to enter the Avatar State, but was knocked out of it and gravely wounded when Azula struck him in the back with lightning. Although Katara managed to heal his wounds and bring him back to life, Aang's seventh chakra was locked and he was unable to enter the Avatar State."
    },
    {
      "body": "Despite opening his chakras, which allowed him to successfully access the Avatar State before being shot down, Aang continued to display the feelings that blocked them during his journey around the Fire Nation. He also exhibited these emotions during the day before the planned ${link_0} and suffered sleep deprivation and paranoia as a result.",
      "links": [
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "section": [
        "Chakras",
        "History"
      ],
      "text": "Despite opening his chakras, which allowed him to successfully access the Avatar State before being shot down, Aang continued to display the feelings that blocked them during his journey around the Fire Nation. He also exhibited these emotions during the day before the planned invasion of the Fire Nation and suffered sleep deprivation and paranoia as a result."
    },
    {
      "body": "Aang remained unable to use the Avatar State throughout the entirety of his travels in the Fire Nation archipelago. He eventually regained access to the state during his battle with ${link_0}, when a protruding rock was pressed hard against the lightning's entry wound on his back, releasing all the blocked energy.",
      "links": [
        {
          "body": "Ozai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        }
      ],
      "section": [
        "Chakras",
        "History"
      ],
      "text": "Aang remained unable to use the Avatar State throughout the entirety of his travels in the Fire Nation archipelago. He eventually regained access to the state during his battle with Ozai, when a protruding rock was pressed hard against the lightning's entry wound on his back, releasing all the blocked energy."
    },
    {
      "body": "These are the chakras in the order one must unlock them.",
      "links": [],
      "section": [
        "Chakras",
        "Different chakras"
      ],
      "text": "These are the chakras in the order one must unlock them."
    },
    {
      "body": "In real life, the concept of ${link_0} originated in ancient India and forms a part of many philosophical, spiritual, and religious systems.",
      "links": [
        {
          "body": "chakras",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/chakra",
            "page": "http://en.wikipedia.org/wiki/chakra"
          }
        }
      ],
      "section": [
        "Chakras",
        "Connections"
      ],
      "text": "In real life, the concept of chakras originated in ancient India and forms a part of many philosophical, spiritual, and religious systems."
    },
    {
      "body": "The chakra points, specifically where they are located, to what they refer, and by what they are blocked, are somewhat the same according to chakra charts.",
      "links": [],
      "section": [
        "Chakras",
        "Connections"
      ],
      "text": "The chakra points, specifically where they are located, to what they refer, and by what they are blocked, are somewhat the same according to chakra charts."
    },
    {
      "body": "In Hinduism, the second chakra is located in or near the sexual and reproductive organs, as it is related to pleasure. Due to this fact, it is the one chakra whose location is not stated in the show's dialogue.",
      "links": [],
      "section": [
        "Chakras",
        "Trivia"
      ],
      "text": "In Hinduism, the second chakra is located in or near the sexual and reproductive organs, as it is related to pleasure. Due to this fact, it is the one chakra whose location is not stated in the show's dialogue."
    },
    {
      "body": "${link_0}'s third eye is located where the Light Chakra would be, at the center of the forehead between his two eyes. While the location makes his abilities powerful, it later proves to be his undoing, as the chakra was blocked after being impacted first by a pebble from Toph, and later by Sokka's boomerang, resulting in Combustion Man's death.",
      "links": [
        {
          "body": "Combustion Man",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Combustion_Man",
            "page": "Combustion_Man"
          }
        }
      ],
      "section": [
        "Chakras",
        "Trivia"
      ],
      "text": "Combustion Man's third eye is located where the Light Chakra would be, at the center of the forehead between his two eyes. While the location makes his abilities powerful, it later proves to be his undoing, as the chakra was blocked after being impacted first by a pebble from Toph, and later by Sokka's boomerang, resulting in Combustion Man's death."
    },
    {
      "body": "Toph displayed great mastery over the Light Chakra: when she overcame the \"illusion\" that natural earth and refined metals were two completely different things, this insight allowed her to realize that the forging process would always leave small natural impurities, and in doing so created metalbending.",
      "links": [],
      "section": [
        "Chakras",
        "Trivia"
      ],
      "text": "Toph displayed great mastery over the Light Chakra: when she overcame the \"illusion\" that natural earth and refined metals were two completely different things, this insight allowed her to realize that the forging process would always leave small natural impurities, and in doing so created metalbending."
    },
    {
      "body": "Though the flow of energy, otherwise known as chi, within the body is mentioned many times, chakras were not introduced until Avatar Aang's encounter with Guru Pathik at the ${link_0}.",
      "links": [
        {
          "body": "Eastern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        }
      ],
      "section": [
        "Chakras",
        "Trivia"
      ],
      "text": "Though the flow of energy, otherwise known as chi, within the body is mentioned many times, chakras were not introduced until Avatar Aang's encounter with Guru Pathik at the Eastern Air Temple."
    },
    {
      "body": "The main objective of opening the chakras is to detach one's soul from the world, so that, in the case of an Avatar, he or she would have free access to the cosmic powers at his or her disposal. However, Avatar ${link_0} explained to Aang that the reason why the Avatar is a mortal being each time is that the Avatar must experience human life and emotions in order to understand how precious it is, so he or she will do anything to protect it, meaning that it would be never possible for an Avatar to truly detach him or herself from the world.",
      "links": [
        {
          "body": "Yangchen",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Yangchen",
            "page": "Yangchen"
          }
        }
      ],
      "section": [
        "Chakras",
        "Trivia"
      ],
      "text": "The main objective of opening the chakras is to detach one's soul from the world, so that, in the case of an Avatar, he or she would have free access to the cosmic powers at his or her disposal. However, Avatar Yangchen explained to Aang that the reason why the Avatar is a mortal being each time is that the Avatar must experience human life and emotions in order to understand how precious it is, so he or she will do anything to protect it, meaning that it would be never possible for an Avatar to truly detach him or herself from the world."
    },
    {
      "body": "Opening the Fire Chakra appears to have been more difficult for Aang than most of the others, as Guru Patik commented that it opened \"less like a flowing creek and more like a burping bison\".",
      "links": [],
      "section": [
        "Chakras",
        "Trivia"
      ],
      "text": "Opening the Fire Chakra appears to have been more difficult for Aang than most of the others, as Guru Patik commented that it opened \"less like a flowing creek and more like a burping bison\"."
    },
    {
      "body": "Guru Pathik stated that in order for the Avatar to control the Avatar Spirit, he or she must let go of every earthly attachment including those they love. However, it is still possible to love someone without attachment and open the Thought Chakra, as evidenced by the fact that both Avatar ${link_0} and Avatar ${link_1} demonstrated mastery over the Avatar State while being in love with ${link_2} and ${link_3}, respectively.",
      "links": [
        {
          "body": "Kuruk",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuruk",
            "page": "Kuruk"
          }
        },
        {
          "body": "Roku",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Ummi",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ummi",
            "page": "Ummi"
          }
        },
        {
          "body": "Ta Min",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ta_Min",
            "page": "Ta_Min"
          }
        }
      ],
      "section": [
        "Chakras",
        "Trivia"
      ],
      "text": "Guru Pathik stated that in order for the Avatar to control the Avatar Spirit, he or she must let go of every earthly attachment including those they love. However, it is still possible to love someone without attachment and open the Thought Chakra, as evidenced by the fact that both Avatar Kuruk and Avatar Roku demonstrated mastery over the Avatar State while being in love with Ummi and Ta Min, respectively."
    },
    {
      "body": "During Aang's attempts to unlock the chakras, the visions he experienced were filtered through the colors of the visible light spectrum, starting at red and followed by orange, yellow, green, blue, indigo, and finally violet in the order in which he unlocked his chakras.\n Additionally, the physical location of where each attempt was made reflected the nature of the chakra itself: the earth chakra in a cave, the water chakra behind a waterfall, the fire chakra at sunrise, the air chakra in a large open space, the sound chakra in an echoing space, the light chakra when the sun was high in the sky, and the thought chakra atop the temple and open to the heavens.",
      "links": [],
      "section": [
        "Chakras",
        "Trivia"
      ],
      "text": "During Aang's attempts to unlock the chakras, the visions he experienced were filtered through the colors of the visible light spectrum, starting at red and followed by orange, yellow, green, blue, indigo, and finally violet in the order in which he unlocked his chakras.\n Additionally, the physical location of where each attempt was made reflected the nature of the chakra itself: the earth chakra in a cave, the water chakra behind a waterfall, the fire chakra at sunrise, the air chakra in a large open space, the sound chakra in an echoing space, the light chakra when the sun was high in the sky, and the thought chakra atop the temple and open to the heavens."
    },
    {
      "body": "Additionally, the physical location of where each attempt was made reflected the nature of the chakra itself: the earth chakra in a cave, the water chakra behind a waterfall, the fire chakra at sunrise, the air chakra in a large open space, the sound chakra in an echoing space, the light chakra when the sun was high in the sky, and the thought chakra atop the temple and open to the heavens.",
      "links": [],
      "section": [
        "Chakras",
        "Trivia"
      ],
      "text": "Additionally, the physical location of where each attempt was made reflected the nature of the chakra itself: the earth chakra in a cave, the water chakra behind a waterfall, the fire chakra at sunrise, the air chakra in a large open space, the sound chakra in an echoing space, the light chakra when the sun was high in the sky, and the thought chakra atop the temple and open to the heavens."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Spiritual beliefs in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spiritual_beliefs_in_the_World_of_Avatar",
            "page": "Spiritual_beliefs_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Chakras",
        "See also"
      ],
      "text": "Spiritual beliefs in the World of Avatar"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Chakras",
    "file": "avatar.wikia.com/wiki/Chakras.html",
    "page": "Chakras",
    "title": "Chakras"
  }
}