{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Families",
      "target": {
        "href": "Category_Families",
        "page": "Category_Families"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [
    {
      "key": "Leader(s)",
      "value": [
        {
          "body": "Chou the Elder",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Chou the Elder",
          "value": "Chou the Elder",
          "value_text": "Chou the Elder"
        }
      ]
    },
    {
      "key": "Notable members",
      "value": [
        {
          "body": "Chou brothers",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Chou brothers",
          "value": "Chou brothers",
          "value_text": "Chou brothers"
        }
      ]
    },
    {
      "key": "Headquarters",
      "value": [
        {
          "body": "City atop the fire-bestowing ${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "lion turtle",
              "key": "${link_0}",
              "target": {
                "href": "Lion_turtle",
                "page": "Lion_turtle"
              }
            }
          ],
          "text": "City atop the fire-bestowing lion turtle",
          "value": "City atop the fire-bestowing ${link_0}",
          "value_text": "City atop the fire-bestowing lion turtle"
        }
      ]
    },
    {
      "key": "Status",
      "value": [
        {
          "body": "Rulers of the city atop the fire-bestowing lion turtle (formerly)",
          "extra": "(formerly)",
          "extra_text": "(formerly)",
          "links": [],
          "text": "Rulers of the city atop the fire-bestowing lion turtle (formerly)",
          "value": "Rulers of the city atop the fire-bestowing lion turtle",
          "value_text": "Rulers of the city atop the fire-bestowing lion turtle"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\" (vision)",
          "extra": "(vision)",
          "extra_text": "(vision)",
          "links": [
            {
              "body": "Beginnings, Part 1",
              "key": "${link_0}",
              "target": {
                "href": "Beginnings%2c_Part_1",
                "page": "Beginnings%2c_Part_1"
              }
            }
          ],
          "text": "\"Beginnings, Part 1\" (vision)",
          "value": "\"${link_0}\"",
          "value_text": "\"Beginnings, Part 1\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The Chou family was the ruling family of a city built on the back of a fire ${link_0}. Consisting of Chou the Elder and his three sons, the family lived in a fortified palace at the top of the city, hoarding food supplies and keeping the rest of the citizens impoverished.",
      "links": [
        {
          "body": "lion turtle",
          "key": "${link_0}",
          "target": {
            "href": "Lion_turtle",
            "page": "Lion_turtle"
          }
        }
      ],
      "text": "The Chou family was the ruling family of a city built on the back of a fire lion turtle. Consisting of Chou the Elder and his three sons, the family lived in a fortified palace at the top of the city, hoarding food supplies and keeping the rest of the citizens impoverished."
    },
    {
      "body": "The Chou brothers cornered ${link_0} to reclaim the food he stole.",
      "links": [
        {
          "body": "Wan",
          "key": "${link_0}",
          "target": {
            "href": "Wan",
            "page": "Wan"
          }
        }
      ],
      "text": "The Chou brothers cornered Wan to reclaim the food he stole."
    },
    {
      "body": "After discovering that Wan had stolen a bag of rolls from them, the three Chou brothers chased him through the streets of their city. Although Wan initially evaded them, they managed to catch up with him when he stopped to enjoy the food he had taken. Big Chou, the largest, was hit in the face by a roll when Wan tried to escape them again, but the middle brother tripped him, ensuring that he would not get far. The littlest brother reclaimed their food, gloating that, once again, no one was able to steal from the Chous. Big Chou lifted Wan off the ground and tossed him off an escarpment in retribution for his theft and assault.",
      "links": [],
      "text": "After discovering that Wan had stolen a bag of rolls from them, the three Chou brothers chased him through the streets of their city. Although Wan initially evaded them, they managed to catch up with him when he stopped to enjoy the food he had taken. Big Chou, the largest, was hit in the face by a roll when Wan tried to escape them again, but the middle brother tripped him, ensuring that he would not get far. The littlest brother reclaimed their food, gloating that, once again, no one was able to steal from the Chous. Big Chou lifted Wan off the ground and tossed him off an escarpment in retribution for his theft and assault."
    },
    {
      "body": "The Chou brothers arrested ${link_0} for ${link_1} to steal food.",
      "links": [
        {
          "body": "Wan",
          "key": "${link_0}",
          "target": {
            "href": "Wan",
            "page": "Wan"
          }
        },
        {
          "body": "raiding their palace",
          "key": "${link_1}",
          "target": {
            "href": "Raid_on_the_Chou_palace",
            "page": "Raid_on_the_Chou_palace"
          }
        }
      ],
      "text": "The Chou brothers arrested Wan for raiding their palace to steal food."
    },
    {
      "body": "Sometime later, ${link_0} at night to demand some of their food. The Chou brothers volunteered to take care of the mob. Although they were outnumbered, they were confident that they could overpower the peasants, considering they were the only ones who were armed. However, as they charged at the group of peasants, a disguised man stepped forward and used his newly acquired ${link_1} ability to knock them aside. The three brothers recovered and, having called for backup, again charged at the intruders. They were confronted by the masked firebender who had stayed behind to secure the escape of his companions. Wan's fire forced the two taller brothers to jump aside, but Little Chou used this opportunity to jump on Wan's back. After a brief struggle, he was thrown free and pleaded for mercy from his attacker as the firebender loomed over him, ready to strike. When he looked up, however, he was surprised to find that the mysterious firebender, whom he had unmasked, was Wan. Wan's hesitation to shoot at the unarmed brother enabled the guards to capture him. With Wan tightly secured, Little Chou straightened himself and mocked Wan for being too cowardly to even use his newfound power.",
      "links": [
        {
          "body": "a gathering of peasants assembled before the Chou's gates",
          "key": "${link_0}",
          "target": {
            "href": "Raid_on_the_Chou_palace",
            "page": "Raid_on_the_Chou_palace"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Sometime later, a gathering of peasants assembled before the Chou's gates at night to demand some of their food. The Chou brothers volunteered to take care of the mob. Although they were outnumbered, they were confident that they could overpower the peasants, considering they were the only ones who were armed. However, as they charged at the group of peasants, a disguised man stepped forward and used his newly acquired firebending ability to knock them aside. The three brothers recovered and, having called for backup, again charged at the intruders. They were confronted by the masked firebender who had stayed behind to secure the escape of his companions. Wan's fire forced the two taller brothers to jump aside, but Little Chou used this opportunity to jump on Wan's back. After a brief struggle, he was thrown free and pleaded for mercy from his attacker as the firebender loomed over him, ready to strike. When he looked up, however, he was surprised to find that the mysterious firebender, whom he had unmasked, was Wan. Wan's hesitation to shoot at the unarmed brother enabled the guards to capture him. With Wan tightly secured, Little Chou straightened himself and mocked Wan for being too cowardly to even use his newfound power."
    },
    {
      "body": "Chou the Elder decided to banish ${link_0} to the ${link_1} for refusing to identify his co-conspirators.",
      "links": [
        {
          "body": "Wan",
          "key": "${link_0}",
          "target": {
            "href": "Wan",
            "page": "Wan"
          }
        },
        {
          "body": "Spirit Wilds",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        }
      ],
      "text": "Chou the Elder decided to banish Wan to the Spirit Wilds for refusing to identify his co-conspirators."
    },
    {
      "body": "The Chou brothers brought Wan before their father, and together they took him to the fire lion turtle, the guardian of their city. Chou the Elder demanded that Wan identify his co-conspirators; when the young man refused, Chou the Elder concluded that he had no other choice than to banish Wan to the ${link_0} for his crimes. Little Chou requested Wan's firebending be taken away as well, but the lion turtle allowed him to keep it on Wan's request.",
      "links": [
        {
          "body": "Spirit Wilds",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        }
      ],
      "text": "The Chou brothers brought Wan before their father, and together they took him to the fire lion turtle, the guardian of their city. Chou the Elder demanded that Wan identify his co-conspirators; when the young man refused, Chou the Elder concluded that he had no other choice than to banish Wan to the Spirit Wilds for his crimes. Little Chou requested Wan's firebending be taken away as well, but the lion turtle allowed him to keep it on Wan's request."
    },
    {
      "body": "The Chou family palace was situated on the highest point of the ${link_0}'s shell.",
      "links": [
        {
          "body": "lion turtle",
          "key": "${link_0}",
          "target": {
            "href": "Lion_turtle",
            "page": "Lion_turtle"
          }
        }
      ],
      "text": "The Chou family palace was situated on the highest point of the lion turtle's shell."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Chou_family",
    "file": "avatar.wikia.com/wiki/Chou_family.html",
    "page": "Chou_family",
    "title": "Chou family"
  }
}