{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Spirit World",
      "target": {
        "href": "Category_Spirit_World",
        "page": "Category_Spirit_World"
      }
    },
    {
      "body": "Spirits",
      "target": {
        "href": "Category_Spirits",
        "page": "Category_Spirits"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "href": "Category_Spirituality",
        "page": "Category_Spirituality"
      }
    },
    {
      "body": "Titles",
      "target": {
        "href": "Category_Titles",
        "page": "Category_Titles"
      }
    }
  ],
  "facts": [
    {
      "key": "Unalaq",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Northern Water Tribe",
              "key": "${link_0}",
              "target": {
                "href": "Northern_Water_Tribe",
                "page": "Northern_Water_Tribe"
              }
            }
          ],
          "text": "Northern Water Tribe",
          "value": "${link_0}",
          "value_text": "Northern Water Tribe"
        }
      ]
    },
    {
      "key": "Bending",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Waterbending",
              "key": "${link_0}",
              "target": {
                "href": "Waterbending",
                "page": "Waterbending"
              }
            }
          ],
          "text": "Waterbending",
          "value": "${link_0}",
          "value_text": "Waterbending"
        }
      ]
    },
    {
      "key": "Other",
      "value": [
        {
          "body": "Dark Avatar State",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Dark Avatar State",
          "value": "Dark Avatar State",
          "value_text": "Dark Avatar State"
        },
        {
          "body": "Energy beams",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Energy beams",
          "value": "Energy beams",
          "value_text": "Energy beams"
        },
        {
          "body": "Tendrils",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Tendrils",
          "value": "Tendrils",
          "value_text": "Tendrils"
        }
      ]
    },
    {
      "key": "Unalaq",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Darkness Falls",
              "key": "${link_0}",
              "target": {
                "href": "Darkness_Falls",
                "page": "Darkness_Falls"
              }
            }
          ],
          "text": "\"Darkness Falls\"",
          "value": "\"${link_0}\"",
          "value_text": "\"Darkness Falls\""
        }
      ]
    },
    {
      "key": "UnaVaatu",
      "value": [
        {
          "body": "\"${link_0}\" (flashback only)",
          "extra": "(flashback only)",
          "extra_text": "(flashback only)",
          "links": [
            {
              "body": "Remembrances",
              "key": "${link_0}",
              "target": {
                "href": "Remembrances",
                "page": "Remembrances"
              }
            }
          ],
          "text": "\"Remembrances\" (flashback only)",
          "value": "\"${link_0}\"",
          "value_text": "\"Remembrances\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The Dark Avatar, or UnaVaatu in its enlarged form, was the antithesis of the ${link_0} and was created from the fusion of ${link_1} and ${link_2}, forming an embodiment of darkness and chaos. The Dark Avatar aimed to reunite the ${link_3} and ${link_4} realms as well as usher in a new world order of ten thousand years of darkness, but was defeated and killed by ${link_5}, as an astral projection, during the ${link_6} of 171 ${link_7}. With his spirit purified, the Dark Avatar Cycle was ended before it began, although Vaatu will eventually regenerate inside ${link_8}.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_1}",
          "target": {
            "href": "Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_2}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "physical",
          "key": "${link_3}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "spiritual",
          "key": "${link_4}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Korra",
          "key": "${link_5}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_6}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "AG",
          "key": "${link_7}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Raava",
          "key": "${link_8}",
          "target": {
            "href": "Raava",
            "page": "Raava"
          }
        }
      ],
      "text": "The Dark Avatar, or UnaVaatu in its enlarged form, was the antithesis of the Avatar and was created from the fusion of Vaatu and Unalaq, forming an embodiment of darkness and chaos. The Dark Avatar aimed to reunite the physical and spiritual realms as well as usher in a new world order of ten thousand years of darkness, but was defeated and killed by Korra, as an astral projection, during the Harmonic Convergence of 171 AG. With his spirit purified, the Dark Avatar Cycle was ended before it began, although Vaatu will eventually regenerate inside Raava."
    },
    {
      "body": "After joining the ${link_0}, a young Unalaq learned about Raava and Vaatu, and the history of Avatar Wan. At one point later on, Unalaq came up with a plan to free Vaatu during Harmonic Convergence to fuse with him and become a Dark Avatar, contrary to the Red Lotus' goals. He would later betray the organization to pursue this selfish desire, covering his tracks and conspiring with Vaatu to pursue this goal, eventually manipulating Avatar Korra into opening the ${link_1} in order for Vaatu to free himself.",
      "links": [
        {
          "body": "Red Lotus",
          "key": "${link_0}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "spirit portals",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        }
      ],
      "text": "After joining the Red Lotus, a young Unalaq learned about Raava and Vaatu, and the history of Avatar Wan. At one point later on, Unalaq came up with a plan to free Vaatu during Harmonic Convergence to fuse with him and become a Dark Avatar, contrary to the Red Lotus' goals. He would later betray the organization to pursue this selfish desire, covering his tracks and conspiring with Vaatu to pursue this goal, eventually manipulating Avatar Korra into opening the spirit portals in order for Vaatu to free himself."
    },
    {
      "body": "Following Vaatu's escape from the ${link_0} during the Harmonic Convergence of 171 AG, the dark spirit merged with Unalaq and permanently bound himself to the ${link_1}'s spirit using the energy provided by the overlap of the two spirit portals.",
      "links": [
        {
          "body": "Tree of Time",
          "key": "${link_0}",
          "target": {
            "href": "Tree_of_Time",
            "page": "Tree_of_Time"
          }
        },
        {
          "body": "waterbender",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Following Vaatu's escape from the Tree of Time during the Harmonic Convergence of 171 AG, the dark spirit merged with Unalaq and permanently bound himself to the waterbender's spirit using the energy provided by the overlap of the two spirit portals."
    },
    {
      "body": "${link_0} extracted ${link_1} from ${link_2}.",
      "links": [
        {
          "body": "Vaatu",
          "key": "${link_0}",
          "target": {
            "href": "Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Raava",
          "key": "${link_1}",
          "target": {
            "href": "Raava",
            "page": "Raava"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Vaatu extracted Raava from Korra."
    },
    {
      "body": "This process created the Dark Avatar, who promptly began to battle Avatar Korra for the fate of the world. Despite a strong showing from each side, Unalaq managed to subdue Korra, at which point Vaatu emerged from his mouth, latched onto Korra's face and pulled out Raava. With the use of his waterbending, Unalaq destroyed Raava, severing Korra's connection to her past lives in the process. Having defeated Raava, Vaatu's spirit strengthened and the Dark Avatar grew significantly in size.",
      "links": [],
      "text": "This process created the Dark Avatar, who promptly began to battle Avatar Korra for the fate of the world. Despite a strong showing from each side, Unalaq managed to subdue Korra, at which point Vaatu emerged from his mouth, latched onto Korra's face and pulled out Raava. With the use of his waterbending, Unalaq destroyed Raava, severing Korra's connection to her past lives in the process. Having defeated Raava, Vaatu's spirit strengthened and the Dark Avatar grew significantly in size."
    },
    {
      "body": "After declaring the era of the Avatar to be over, the Dark Avatar used the ${link_0} to transport himself to ${link_1}, where he promptly wreaked havoc on the city's infrastructure using vine-like projections. Despite heavy bombardment by the ${link_2}, the Dark Avatar was able to use augmented waterbending to scatter the ${link_3} as well as knock the lead ${link_4} and a formation of ${link_5} from the sky, prompting ${link_6} ${link_7} and ${link_8} ${link_9} to evacuate.",
      "links": [
        {
          "body": "spirit lights",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_lights",
            "page": "Spirit_lights"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "United Forces",
          "key": "${link_2}",
          "target": {
            "href": "United_Forces",
            "page": "United_Forces"
          }
        },
        {
          "body": "battleships",
          "key": "${link_3}",
          "target": {
            "href": "Battleship",
            "page": "Battleship"
          }
        },
        {
          "body": "police airship",
          "key": "${link_4}",
          "target": {
            "href": "Police_airship",
            "page": "Police_airship"
          }
        },
        {
          "body": "biplanes",
          "key": "${link_5}",
          "target": {
            "href": "Biplane",
            "page": "Biplane"
          }
        },
        {
          "body": "President",
          "key": "${link_6}",
          "target": {
            "href": "President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_7}",
          "target": {
            "href": "Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "Chief",
          "key": "${link_8}",
          "target": {
            "href": "Chief_of_Police",
            "page": "Chief_of_Police"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_9}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        }
      ],
      "text": "After declaring the era of the Avatar to be over, the Dark Avatar used the spirit lights to transport himself to Republic City, where he promptly wreaked havoc on the city's infrastructure using vine-like projections. Despite heavy bombardment by the United Forces, the Dark Avatar was able to use augmented waterbending to scatter the battleships as well as knock the lead police airship and a formation of biplanes from the sky, prompting President Raiko and Chief Lin Beifong to evacuate."
    },
    {
      "body": "The Dark Avatar and ${link_0}'s astral projection battled each other using beams of energy.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "The Dark Avatar and Korra's astral projection battled each other using beams of energy."
    },
    {
      "body": "Shortly after, a large astral projection of Korra arrived and began to battle the Dark Avatar. Using cosmic energy, Korra was able to overwhelm the Dark Avatar and attempted to extract light from within Unalaq, to no avail. This setback allowed the Dark Avatar to subdue Korra with a dark variation of ${link_0} and corrupt her soul, until ${link_1}'s spirit appeared to intervene. The young ${link_2}, whose own spiritual powers were augmented by the Convergence, released a beam of light, allowing Korra to find Raava within the Dark Avatar and subsequently remove her, before cleansing Vaatu using her uncle's own purification technique, destroying the Dark Avatar in the process.",
      "links": [
        {
          "body": "spiritbending",
          "key": "${link_0}",
          "target": {
            "href": "Healing#Spiritbending",
            "page": "Healing"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_1}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "airbender",
          "key": "${link_2}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Shortly after, a large astral projection of Korra arrived and began to battle the Dark Avatar. Using cosmic energy, Korra was able to overwhelm the Dark Avatar and attempted to extract light from within Unalaq, to no avail. This setback allowed the Dark Avatar to subdue Korra with a dark variation of spiritbending and corrupt her soul, until Jinora's spirit appeared to intervene. The young airbender, whose own spiritual powers were augmented by the Convergence, released a beam of light, allowing Korra to find Raava within the Dark Avatar and subsequently remove her, before cleansing Vaatu using her uncle's own purification technique, destroying the Dark Avatar in the process."
    },
    {
      "body": "Unlike the Avatar, the Dark Avatar did not have the ability to bend all four ${link_0}, since Unalaq could only waterbend prior to his fusion with Vaatu, unlike Wan, who went to the lion turtles with Raava and received all four elements.",
      "links": [
        {
          "body": "bending arts",
          "key": "${link_0}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "Unlike the Avatar, the Dark Avatar did not have the ability to bend all four bending arts, since Unalaq could only waterbend prior to his fusion with Vaatu, unlike Wan, who went to the lion turtles with Raava and received all four elements."
    },
    {
      "body": "${link_0}'s eyes glowed orange-red when he entered the Dark Avatar State.",
      "links": [
        {
          "body": "Unalaq",
          "key": "${link_0}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        }
      ],
      "text": "Unalaq's eyes glowed orange-red when he entered the Dark Avatar State."
    },
    {
      "body": "Despite this limitation, the Dark Avatar's bending potential could still be significantly augmented by a variation of the ${link_0}, in which Vaatu provided Unalaq an energy surge which allowed him to accomplish great feats of waterbending, such as creating large waves capable of dispersing several battleships. In this state, Unalaq's eyes glowed orange-red, as opposed to the white glow visible when the Avatar enters the Avatar State. Due to being fully aware of his spiritual capabilities, Unalaq had full control over the Dark Avatar State and was able to trigger the mechanism whenever he found it appropriate to use.",
      "links": [
        {
          "body": "Avatar State",
          "key": "${link_0}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "Despite this limitation, the Dark Avatar's bending potential could still be significantly augmented by a variation of the Avatar State, in which Vaatu provided Unalaq an energy surge which allowed him to accomplish great feats of waterbending, such as creating large waves capable of dispersing several battleships. In this state, Unalaq's eyes glowed orange-red, as opposed to the white glow visible when the Avatar enters the Avatar State. Due to being fully aware of his spiritual capabilities, Unalaq had full control over the Dark Avatar State and was able to trigger the mechanism whenever he found it appropriate to use."
    },
    {
      "body": "UnaVaatu was capable of projecting energy beams, using tentacle-like appendages, as well as powerful waterbending.",
      "links": [],
      "text": "UnaVaatu was capable of projecting energy beams, using tentacle-like appendages, as well as powerful waterbending."
    },
    {
      "body": "After vanquishing Raava, the Dark Avatar underwent a physical transformation, becoming significantly larger in size, with powers and attributes present from both Unalaq and Vaatu. Being that the two were so closely connected in this form, this extreme fusion is termed \"UnaVaatu\". In this form, the Dark Avatar's skin was black with Vaatu's red markings, and despite his humanoid appearance, also bore resemblance to Vaatu's spiritual form, retaining tentacle-like appendages and a triangular projection from his forehead. Unalaq's waterbending was far more powerful in this form, with UnaVaatu able to create a giant wave proportionate to his size that easily defeated the United Forces fleet. UnaVaatu was also able to spiritbend on a larger scale, which he used against Korra's astral projection. Furthermore, UnaVaatu possessed several abilities that the Avatar has never demonstrated, including tendrils and energy beams. These were all skills that Vaatu had prior to becoming fused with a human host.",
      "links": [],
      "text": "After vanquishing Raava, the Dark Avatar underwent a physical transformation, becoming significantly larger in size, with powers and attributes present from both Unalaq and Vaatu. Being that the two were so closely connected in this form, this extreme fusion is termed \"UnaVaatu\". In this form, the Dark Avatar's skin was black with Vaatu's red markings, and despite his humanoid appearance, also bore resemblance to Vaatu's spiritual form, retaining tentacle-like appendages and a triangular projection from his forehead. Unalaq's waterbending was far more powerful in this form, with UnaVaatu able to create a giant wave proportionate to his size that easily defeated the United Forces fleet. UnaVaatu was also able to spiritbend on a larger scale, which he used against Korra's astral projection. Furthermore, UnaVaatu possessed several abilities that the Avatar has never demonstrated, including tendrils and energy beams. These were all skills that Vaatu had prior to becoming fused with a human host."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Dark_Avatar",
    "file": "avatar.wikia.com/wiki/Dark_Avatar.html",
    "page": "Dark_Avatar",
    "title": "Dark Avatar"
  }
}