{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Dragons",
      "target": {
        "href": "Category_Dragons",
        "page": "Category_Dragons"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "href": "Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Objects",
      "target": {
        "href": "Category_Objects",
        "page": "Category_Objects"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} saved a ${link_1} egg from falling to the ground.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "dragon",
          "key": "${link_1}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        }
      ],
      "text": "Aang saved a dragon egg from falling to the ground."
    },
    {
      "body": "Dragon eggs were laid by female ${link_0} and contained their offspring. They were once highly valuable and plentiful and were often sold illegally on the black market. During the ${link_1}, dragons were hunted to near extinction, partially due to their value and partly due to the honor and glory one would achieve by slaying them. This caused dragon eggs to become scarce and nearly impossible to find.",
      "links": [
        {
          "body": "dragons",
          "key": "${link_0}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_1}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "Dragon eggs were laid by female dragons and contained their offspring. They were once highly valuable and plentiful and were often sold illegally on the black market. During the Hundred Year War, dragons were hunted to near extinction, partially due to their value and partly due to the honor and glory one would achieve by slaying them. This caused dragon eggs to become scarce and nearly impossible to find."
    },
    {
      "body": "Prior to the ${link_0}, Aang journeyed to the ${link_1} to visit his friend ${link_2}. Together they traversed the mountains to scout for a dragon for Kuzon to ride. When nearing a dragon's lair, they stumbled upon some dragon egg poachers who wanted to sell its egg on the black market. After the ${link_3} was lured away from her nest, the poachers stole the egg and put it into one of their saddle bags.",
      "links": [
        {
          "body": "Air Nomad Genocide",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Kuzon",
          "key": "${link_2}",
          "target": {
            "href": "Kuzon",
            "page": "Kuzon"
          }
        },
        {
          "body": "mother",
          "key": "${link_3}",
          "target": {
            "href": "Green_dragon",
            "page": "Green_dragon"
          }
        }
      ],
      "text": "Prior to the Air Nomad Genocide, Aang journeyed to the Fire Nation to visit his friend Kuzon. Together they traversed the mountains to scout for a dragon for Kuzon to ride. When nearing a dragon's lair, they stumbled upon some dragon egg poachers who wanted to sell its egg on the black market. After the mother was lured away from her nest, the poachers stole the egg and put it into one of their saddle bags."
    },
    {
      "body": "Kuzon and Aang, after realizing what the poachers were doing, concocted a plan to prevent them from getting away with the egg. With the help of ${link_0}'s roaring, Kuzon's ${link_1}, and sound effects created by Aang, the two friends were able to scare away the thieves. When Aang removed the egg from the saddle bag in order to replace it in the nest, the mother returned. Kuzon attempted to prevent her from attacking Aang by distracting her, but as she turned to focus on the boy, she knocked Aang down with her tail, unwittingly sending her own egg flying off a cliff. The young ${link_2} leaped forward and managed to catch the egg before it crashed on the ground. It was at this point that the mother realized that Aang and Kuzon were not a threat to her and her egg, and she let them go without harm.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "airbender",
          "key": "${link_2}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Kuzon and Aang, after realizing what the poachers were doing, concocted a plan to prevent them from getting away with the egg. With the help of Appa's roaring, Kuzon's firebending, and sound effects created by Aang, the two friends were able to scare away the thieves. When Aang removed the egg from the saddle bag in order to replace it in the nest, the mother returned. Kuzon attempted to prevent her from attacking Aang by distracting her, but as she turned to focus on the boy, she knocked Aang down with her tail, unwittingly sending her own egg flying off a cliff. The young airbender leaped forward and managed to catch the egg before it crashed on the ground. It was at this point that the mother realized that Aang and Kuzon were not a threat to her and her egg, and she let them go without harm."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Dragon_egg",
    "file": "avatar.wikia.com/wiki/Dragon_egg.html",
    "page": "Dragon_egg",
    "title": "Dragon egg"
  }
}