{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Animal characters",
      "target": {
        "external": false,
        "href": "/wiki/Category_Animal_characters",
        "page": "Category_Animal_characters"
      }
    },
    {
      "body": "Characters",
      "target": {
        "external": false,
        "href": "/wiki/Category_Characters",
        "page": "Category_Characters"
      }
    },
    {
      "body": "Graphic novel characters",
      "target": {
        "external": false,
        "href": "/wiki/Category_Graphic_novel_characters",
        "page": "Category_Graphic_novel_characters"
      }
    },
    {
      "body": "Legend of Korra characters",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra_characters",
        "page": "Category_Legend_of_Korra_characters"
      }
    },
    {
      "body": "Minor characters (Legend of Korra)",
      "target": {
        "external": false,
        "href": "/wiki/Category_Minor_characters_(Legend_of_Korra)",
        "page": "Category_Minor_characters_(Legend_of_Korra)"
      }
    },
    {
      "body": "Minor graphic novel characters (Legend of Korra)",
      "target": {
        "external": false,
        "href": "/wiki/Category_Minor_graphic_novel_characters_(Legend_of_Korra)",
        "page": "Category_Minor_graphic_novel_characters_(Legend_of_Korra)"
      }
    },
    {
      "body": "Spirit World",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirit_World",
        "page": "Category_Spirit_World"
      }
    },
    {
      "body": "Spirits",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirits",
        "page": "Category_Spirits"
      }
    },
    {
      "body": "Turf Wars characters",
      "target": {
        "external": false,
        "href": "/wiki/Category_Turf_Wars_characters",
        "page": "Category_Turf_Wars_characters"
      }
    }
  ],
  "facts": [
    {
      "key": "Eye color",
      "value": [
        {
          "body": "Yellow-red",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Yellow-red",
          "value": "Yellow-red",
          "value_text": "Yellow-red"
        }
      ]
    },
    {
      "key": "Hair color",
      "value": [
        {
          "body": "Cardinal red",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Cardinal red",
          "value": "Cardinal red",
          "value_text": "Cardinal red"
        }
      ]
    },
    {
      "key": "Skin color",
      "value": [
        {
          "body": "Black and puce",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Black and puce",
          "value": "Black and puce",
          "value_text": "Black and puce"
        }
      ]
    },
    {
      "key": "Allies",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Spirits",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Spirit_World#Known_spirits",
                "page": "Spirit_World"
              }
            }
          ],
          "text": "Spirits",
          "value": "${link_0}",
          "value_text": "Spirits"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "Spirit",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Spirit",
          "value": "Spirit",
          "value_text": "Spirit"
        }
      ]
    },
    {
      "key": "Affiliation",
      "value": [
        {
          "body": "Spirit World",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Spirit World",
          "value": "Spirit World",
          "value_text": "Spirit World"
        }
      ]
    },
    {
      "key": "First Appearance",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Operation Beifong",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Operation_Beifong",
                "page": "Operation_Beifong"
              }
            }
          ],
          "text": "\"Operation Beifong\"",
          "value": "\"${link_0}\"",
          "value_text": "\"Operation Beifong\""
        }
      ]
    },
    {
      "key": "Voiced by",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Jim Meskimen",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Jim_Meskimen",
                "page": "Jim_Meskimen"
              }
            }
          ],
          "text": "Jim Meskimen",
          "value": "${link_0}",
          "value_text": "Jim Meskimen"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The dragon eel spirit is a chimerical spirit who, by 174 ${link_0}, came to inhabit the ${link_1} of ${link_2}.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Spirit Wilds",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "section": [
        "Dragon eel spirit"
      ],
      "text": "The dragon eel spirit is a chimerical spirit who, by 174 AG, came to inhabit the Spirit Wilds of Republic City."
    },
    {
      "body": "When ${link_0}'s power began to threaten the spiritual life in Republic City, the dragon eel spirit left their home in the Spirit Wilds and retreated to the ${link_1} in the ${link_2}. When ${link_3} ${link_4} arrived at the base of the tree and asked for the spirits' help to defend Republic City, the new home to many of them, the dragon eel told the Avatar that spirits did not get involved with human wars. As Korra reasoned that they had sided with ${link_5}, the spirit corrected her by pointing out that the former ${link_6} of the ${link_7} had misused ${link_8}'s power during ${link_9} to force spirits to fight her. Although Korra argued that she did not wish to force the spirits to do anything they did not want to do and merely hoped they would come to her aid to defend the new ${link_10} they shared, the dragon eel spirit concluded that she wanted the same as Kuvira, namely to use spirits as a weapon in a human war. Reiterating that spirits would not get involved, he vanished, the other spirits following his example.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "Tree of Time",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tree_of_Time",
            "page": "Tree_of_Time"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Chief",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "world",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "Dragon eel spirit",
        "History",
        "Defending Republic City"
      ],
      "text": "When Kuvira's power began to threaten the spiritual life in Republic City, the dragon eel spirit left their home in the Spirit Wilds and retreated to the Tree of Time in the Spirit World. When Avatar Korra arrived at the base of the tree and asked for the spirits' help to defend Republic City, the new home to many of them, the dragon eel told the Avatar that spirits did not get involved with human wars. As Korra reasoned that they had sided with Unalaq, the spirit corrected her by pointing out that the former Chief of the Water Tribe had misused Vaatu's power during Harmonic Convergence to force spirits to fight her. Although Korra argued that she did not wish to force the spirits to do anything they did not want to do and merely hoped they would come to her aid to defend the new world they shared, the dragon eel spirit concluded that she wanted the same as Kuvira, namely to use spirits as a weapon in a human war. Reiterating that spirits would not get involved, he vanished, the other spirits following his example."
    },
    {
      "body": "After Kuvira's defeat and the creation of the new ${link_0} in the heart of Republic City, the dragon eel spirit returned to their home in the metropolis and circled the portal when Korra and ${link_1} approached it to start their vacation.",
      "links": [
        {
          "body": "spirit portal",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "section": [
        "Dragon eel spirit",
        "History",
        "Defending Republic City"
      ],
      "text": "After Kuvira's defeat and the creation of the new spirit portal in the heart of Republic City, the dragon eel spirit returned to their home in the metropolis and circled the portal when Korra and Asami approached it to start their vacation."
    },
    {
      "body": "When Korra and Asami returned to Republic City from their vacation, the dragon eel spirit was circling the spirit portal while monitoring an argument between ${link_0} and ${link_1} about her and the other ${link_2}' presence there. They kept their distance while Korra and Asami joined the discussion, but when Wonyong told Asami that Keum Enterprises owned the land surrounding the spirit portal and could therefore do with it as he pleased, the spirit angrily flew up to Wonyong and accused him of being \"just another human\" who refused to respect the sacred. Making it clear to the businessman that the deeds to the land did not give him the right to ravage and plunder the Spirit World, the spirit turned to Avatar Korra and urged her to close the portal as it was never meant to be there and left the Spirit World vulnerable to exploitation. Korra asked the spirit why they were suddenly interested in human conflicts, as the dragon eel spirit had vehemently refused to get involved when Kuvira posed a threat to Republic City, to which they replied that since there now was a portal in the middle of a metropolis, they had no choice but to protect their kind. When Korra refused to follow up on their request, reasoning that the new spiritual energy would have a harmonious effect on the citizens of Republic City, the spirit relented and retreated to the portal, though not before warning her that they would hold her responsible for keeping the portal safe.",
      "links": [
        {
          "body": "Wonyong Keum",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wonyong_Keum",
            "page": "Wonyong_Keum"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        }
      ],
      "section": [
        "Dragon eel spirit",
        "History",
        "Defending the spirits"
      ],
      "text": "When Korra and Asami returned to Republic City from their vacation, the dragon eel spirit was circling the spirit portal while monitoring an argument between Wonyong Keum and Jinora about her and the other airbenders' presence there. They kept their distance while Korra and Asami joined the discussion, but when Wonyong told Asami that Keum Enterprises owned the land surrounding the spirit portal and could therefore do with it as he pleased, the spirit angrily flew up to Wonyong and accused him of being \"just another human\" who refused to respect the sacred. Making it clear to the businessman that the deeds to the land did not give him the right to ravage and plunder the Spirit World, the spirit turned to Avatar Korra and urged her to close the portal as it was never meant to be there and left the Spirit World vulnerable to exploitation. Korra asked the spirit why they were suddenly interested in human conflicts, as the dragon eel spirit had vehemently refused to get involved when Kuvira posed a threat to Republic City, to which they replied that since there now was a portal in the middle of a metropolis, they had no choice but to protect their kind. When Korra refused to follow up on their request, reasoning that the new spiritual energy would have a harmonious effect on the citizens of Republic City, the spirit relented and retreated to the portal, though not before warning her that they would hold her responsible for keeping the portal safe."
    },
    {
      "body": "The dragon eel spirit later returned during the ${link_0}'s attack on the airbenders and ${link_1}, who were defending the spirit portal. Emerging from the portal with several others, they ordered the spirits, most of whom had ${link_2}, to protect the portal, upon which the spirits lashed out against the Triple Threats. Defending the humans against the enraged spirits, Korra pleaded the dragon eel spirit to call off the others, but they refused to do so, telling her that it had been her responsibility to protect the area and that she had failed. Korra tried to reason with them, saying that while they might believe they were protecting their world, attacking the humans—who were already afraid of the spirits—would only escalate the conflict. Her argumentation further enraged the spirit, however, who turned dark while pointing out that it was the humans who had started the fight and that one of them had to pay. Korra urged the spirit to stop but left them alone when she saw Asami was in trouble. As the now unhindered spirit neared the Triple Threats' leader, ${link_3} threw three knives at them, though they flew right through the spirit, and they knocked him over. The dragon eel spirit, rounding on Tokuga, held him responsible for disturbing the portal, an action for which he would have to live with the consequences, and charged again, this time moving through Tokuga, deforming him in the process. Having exacted their revenge, the dragon eel spirit returned to their normal form and retreated into the Spirit World, ordering the other spirits to do the same.",
      "links": [
        {
          "body": "Triple Threat Triad",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "turned dark",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_spirits",
            "page": "Dark_spirits"
          }
        },
        {
          "body": "Tokuga",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Tokuga",
            "page": "Tokuga"
          }
        }
      ],
      "section": [
        "Dragon eel spirit",
        "History",
        "Defending the spirits"
      ],
      "text": "The dragon eel spirit later returned during the Triple Threat Triad's attack on the airbenders and Team Avatar, who were defending the spirit portal. Emerging from the portal with several others, they ordered the spirits, most of whom had turned dark, to protect the portal, upon which the spirits lashed out against the Triple Threats. Defending the humans against the enraged spirits, Korra pleaded the dragon eel spirit to call off the others, but they refused to do so, telling her that it had been her responsibility to protect the area and that she had failed. Korra tried to reason with them, saying that while they might believe they were protecting their world, attacking the humans—who were already afraid of the spirits—would only escalate the conflict. Her argumentation further enraged the spirit, however, who turned dark while pointing out that it was the humans who had started the fight and that one of them had to pay. Korra urged the spirit to stop but left them alone when she saw Asami was in trouble. As the now unhindered spirit neared the Triple Threats' leader, Tokuga threw three knives at them, though they flew right through the spirit, and they knocked him over. The dragon eel spirit, rounding on Tokuga, held him responsible for disturbing the portal, an action for which he would have to live with the consequences, and charged again, this time moving through Tokuga, deforming him in the process. Having exacted their revenge, the dragon eel spirit returned to their normal form and retreated into the Spirit World, ordering the other spirits to do the same."
    },
    {
      "body": "410. \"${link_0}\"",
      "links": [
        {
          "body": "Operation Beifong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Operation_Beifong",
            "page": "Operation_Beifong"
          }
        }
      ],
      "section": [
        "Dragon eel spirit",
        "Appearances",
        "The Legend of Korra",
        "Book Four: Balance (平衡)"
      ],
      "text": "410. \"Operation Beifong\""
    },
    {
      "body": "413. \"${link_0}\" (no lines)",
      "links": [
        {
          "body": "The Last Stand",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/The_Last_Stand",
            "page": "The_Last_Stand"
          }
        }
      ],
      "section": [
        "Dragon eel spirit",
        "Appearances",
        "The Legend of Korra",
        "Book Four: Balance (平衡)"
      ],
      "text": "413. \"The Last Stand\" (no lines)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Turf Wars Part One",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Turf_Wars_Part_One",
            "page": "Turf_Wars_Part_One"
          }
        }
      ],
      "section": [
        "Dragon eel spirit",
        "Appearances",
        "Graphic novel trilogies"
      ],
      "text": "Turf Wars Part One"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Turf Wars Part Three",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Turf_Wars_Part_Three",
            "page": "Turf_Wars_Part_Three"
          }
        }
      ],
      "section": [
        "Dragon eel spirit",
        "Appearances",
        "Graphic novel trilogies"
      ],
      "text": "Turf Wars Part Three"
    },
    {
      "body": "The design of the dragon eel spirit, which was done by Angela Song Mueller, is one of ${link_0}'s favorites.",
      "links": [
        {
          "body": "Bryan Konietzko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bryan_Konietzko",
            "page": "Bryan_Konietzko"
          }
        }
      ],
      "section": [
        "Dragon eel spirit",
        "Trivia"
      ],
      "text": "The design of the dragon eel spirit, which was done by Angela Song Mueller, is one of Bryan Konietzko's favorites."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Dragon_eel_spirit",
    "file": "avatar.wikia.com/wiki/Dragon_eel_spirit.html",
    "page": "Dragon_eel_spirit",
    "title": "Dragon eel spirit"
  }
}