{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Battles",
      "target": {
        "href": "Category_Battles",
        "page": "Category_Battles"
      }
    },
    {
      "body": "Battles in the Earth Kingdom",
      "target": {
        "href": "Category_Battles_in_the_Earth_Kingdom",
        "page": "Category_Battles_in_the_Earth_Kingdom"
      }
    },
    {
      "body": "Battles in the United Republic of Nations",
      "target": {
        "href": "Category_Battles_in_the_United_Republic_of_Nations",
        "page": "Category_Battles_in_the_United_Republic_of_Nations"
      }
    },
    {
      "body": "Battles in the Water Tribes",
      "target": {
        "href": "Category_Battles_in_the_Water_Tribes",
        "page": "Category_Battles_in_the_Water_Tribes"
      }
    },
    {
      "body": "Duels",
      "target": {
        "href": "Category_Duels",
        "page": "Category_Duels"
      }
    },
    {
      "body": "Events",
      "target": {
        "href": "Category_Events",
        "page": "Category_Events"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} ${link_1}'s spirit battled ${link_2} ${link_3} during the ${link_4}.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Dark Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Dark_Avatar",
            "page": "Dark_Avatar"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_3}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_4}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        }
      ],
      "text": "Avatar Korra's spirit battled Dark Avatar Unalaq during the Harmonic Convergence."
    },
    {
      "body": "Duels are battles fought by at least two individuals and can be considered a form of recreation, a way of settling disputes, or a training tool for students who are developing skills in a particular fighting art. They may be friendly spars, fought to pass time, or in the most extreme cases, fought to the death. A variety of cultures practice dueling.",
      "links": [],
      "text": "Duels are battles fought by at least two individuals and can be considered a form of recreation, a way of settling disputes, or a training tool for students who are developing skills in a particular fighting art. They may be friendly spars, fought to pass time, or in the most extreme cases, fought to the death. A variety of cultures practice dueling."
    },
    {
      "body": "The following is a list of known duels that occurred in 171 ${link_0} until the ${link_1}.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_1}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        }
      ],
      "text": "The following is a list of known duels that occurred in 171 AG until the Harmonic Convergence."
    },
    {
      "body": "Combatants: ${link_0} and three ${link_1} members",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Red Monsoon Triad",
          "key": "${link_1}",
          "target": {
            "href": "Red_Monsoon_Triad",
            "page": "Red_Monsoon_Triad"
          }
        }
      ],
      "text": "Combatants: Mako and three Red Monsoon Triad members"
    },
    {
      "body": "Victor: Mako",
      "links": [],
      "text": "Victor: Mako"
    },
    {
      "body": "While on patrol in ${link_0}, Mako pursued a ${link_1} containing three ${link_2} members. Two ${link_3} created a fog to obscure the police officer's vision, but to no avail. One of the benders froze the street causing Mako to briefly lose control of his motorcycle. The triad continued to flee, driving through a traffic barrier which caused Mako to be cut off by a truck. Avoiding the vehicle, Mako quickly switched lanes and used another truck's supply of wood as a ramp to propel himself into the air, along with the use of his ${link_4}. While airborne, Mako sent a fire blast down toward his enemies causing them to crash into a nearby fire hydrant.",
      "links": [
        {
          "body": "Republic City",
          "key": "${link_0}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Satomobile",
          "key": "${link_1}",
          "target": {
            "href": "Satomobile",
            "page": "Satomobile"
          }
        },
        {
          "body": "Red Monsoon Triad",
          "key": "${link_2}",
          "target": {
            "href": "Red_Monsoon_Triad",
            "page": "Red_Monsoon_Triad"
          }
        },
        {
          "body": "waterbenders",
          "key": "${link_3}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "firebending",
          "key": "${link_4}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "While on patrol in Republic City, Mako pursued a Satomobile containing three Red Monsoon Triad members. Two waterbenders created a fog to obscure the police officer's vision, but to no avail. One of the benders froze the street causing Mako to briefly lose control of his motorcycle. The triad continued to flee, driving through a traffic barrier which caused Mako to be cut off by a truck. Avoiding the vehicle, Mako quickly switched lanes and used another truck's supply of wood as a ramp to propel himself into the air, along with the use of his firebending. While airborne, Mako sent a fire blast down toward his enemies causing them to crash into a nearby fire hydrant."
    },
    {
      "body": "Combatants: ${link_0}, ${link_1}, ${link_2}, ${link_3}, and a ${link_4}",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_2}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_3}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "dark spirit",
          "key": "${link_4}",
          "target": {
            "href": "Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "text": "Combatants: Bolin, Korra, Mako, Tonraq, and a dark spirit"
    },
    {
      "body": "Victor: None; interrupted by ${link_0}",
      "links": [
        {
          "body": "Unalaq",
          "key": "${link_0}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        }
      ],
      "text": "Victor: None; interrupted by Unalaq"
    },
    {
      "body": "${link_0} was attacked by a ${link_1}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "dark spirit",
          "key": "${link_1}",
          "target": {
            "href": "Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "text": "Korra was attacked by a dark spirit."
    },
    {
      "body": "A dark spirit appeared before Korra outside of her hut on the cliffs overlooking the Glacier Spirits Festival. The spirit charged toward the Avatar, knocking her against a wall of ice. The creature pinned down Korra and attempted to eat her, only to be interrupted by a fire blast from Mako. The spirit dodged several other attacks from the firebender and his brother and proceeded to knock them away with a swipe of its tail. Korra returned to the battle by throwing several more fire blasts that were easily dodged by the specter. Before the dark entity could reach its target, it was interrupted by ${link_0}, who trapped the spirit in an ice cage. This prison proved to be of no use as the spirit broke free and proceeded to grab both waterbenders with its tendrils and fling them in opposite directions. Korra entered the ${link_1} and created an air funnel to avoid the Spirit's attack while sending several more fire blasts toward it. Her attacks had no effect and the spirit used one of its tentacles to slam her body into several crates. Korra was knocked out of the Avatar State and lay helplessly as the creature prepared its final attack. It was, however, interrupted by Unalaq, who used his spiritual method of healing to cleanse the spirit of its dark properties. Now at peace, the spirit ceased combat and left the material world.",
      "links": [
        {
          "body": "Tonraq",
          "key": "${link_0}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_1}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "A dark spirit appeared before Korra outside of her hut on the cliffs overlooking the Glacier Spirits Festival. The spirit charged toward the Avatar, knocking her against a wall of ice. The creature pinned down Korra and attempted to eat her, only to be interrupted by a fire blast from Mako. The spirit dodged several other attacks from the firebender and his brother and proceeded to knock them away with a swipe of its tail. Korra returned to the battle by throwing several more fire blasts that were easily dodged by the specter. Before the dark entity could reach its target, it was interrupted by Tonraq, who trapped the spirit in an ice cage. This prison proved to be of no use as the spirit broke free and proceeded to grab both waterbenders with its tendrils and fling them in opposite directions. Korra entered the Avatar State and created an air funnel to avoid the Spirit's attack while sending several more fire blasts toward it. Her attacks had no effect and the spirit used one of its tentacles to slam her body into several crates. Korra was knocked out of the Avatar State and lay helplessly as the creature prepared its final attack. It was, however, interrupted by Unalaq, who used his spiritual method of healing to cleanse the spirit of its dark properties. Now at peace, the spirit ceased combat and left the material world."
    },
    {
      "body": "Combatants: ${link_0}, ${link_1}, ${link_2}, and four ${link_3}",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_2}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "dark spirits",
          "key": "${link_3}",
          "target": {
            "href": "Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "text": "Combatants: Korra, Mako, Tonraq, and four dark spirits"
    },
    {
      "body": "Victor: None; interrupted by ${link_0}",
      "links": [
        {
          "body": "Unalaq",
          "key": "${link_0}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        }
      ],
      "text": "Victor: None; interrupted by Unalaq"
    },
    {
      "body": "${link_0} attack the group that is traveling to the South Pole's ${link_1}.",
      "links": [
        {
          "body": "Dark spirits",
          "key": "${link_0}",
          "target": {
            "href": "Dark_spirits",
            "page": "Dark_spirits"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        }
      ],
      "text": "Dark spirits attack the group that is traveling to the South Pole's spirit portal."
    },
    {
      "body": "On their journey to the southern ${link_0}, Korra and her companions were attacked by several dark spirits. After ambushing the humans and stealing their equipment, one of the specters frightened Naga, causing Korra to fall to the ground. When another spirit flew toward the Avatar, it was blocked by an ice shield form Tonraq, who pushed his daughter out of harm's way when another another spirit charged for her. However, the spirit quickly dodged Tonraq's attack and tackled him to the ground. Mako and Korra attempted to fend of the spirits with several fire blasts, only for the dark entities to merge and form a larger spirit. Desperate, Korra attempted to mimic Unalaq's spiritual healing to subdue the creature. While this technique seemed successful at first, it ultimately failed and the spirit pinned Korra down. Before it could kill her, it was spiritually cleansed by Unalaq.",
      "links": [
        {
          "body": "spirit portal",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        }
      ],
      "text": "On their journey to the southern spirit portal, Korra and her companions were attacked by several dark spirits. After ambushing the humans and stealing their equipment, one of the specters frightened Naga, causing Korra to fall to the ground. When another spirit flew toward the Avatar, it was blocked by an ice shield form Tonraq, who pushed his daughter out of harm's way when another another spirit charged for her. However, the spirit quickly dodged Tonraq's attack and tackled him to the ground. Mako and Korra attempted to fend of the spirits with several fire blasts, only for the dark entities to merge and form a larger spirit. Desperate, Korra attempted to mimic Unalaq's spiritual healing to subdue the creature. While this technique seemed successful at first, it ultimately failed and the spirit pinned Korra down. Before it could kill her, it was spiritually cleansed by Unalaq."
    },
    {
      "body": "Combatants: ${link_0} and five ${link_1}",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Southern Water Tribe rebels",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe_rebels",
            "page": "Southern_Water_Tribe_rebels"
          }
        }
      ],
      "text": "Combatants: Korra and five Southern Water Tribe rebels"
    },
    {
      "body": "Victor: Korra",
      "links": [],
      "text": "Victor: Korra"
    },
    {
      "body": "${link_0} defeated the ${link_1} and saved ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Southern Water Tribe rebels",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe_rebels",
            "page": "Southern_Water_Tribe_rebels"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_2}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        }
      ],
      "text": "Korra defeated the Southern Water Tribe rebels and saved Unalaq."
    },
    {
      "body": "Upon arriving at the royal palace, Korra found several Northern soldiers tied up. After going to the upper level, she encountered a group of Southern rebels, one of them carrying an unconscious Unalaq. Korra attempted to negotiate the release of her uncle, but the rebels refused her offer and created a wall of ice for their escape. When Korra caught up to her adversaries, the rebel carrying Unalaq split from his group, who then proceeded to attack the Avatar. After dodging several water blasts, Korra tied up two of the rebels in a tapestry using ${link_0}. She then knocked out another rebel with a kick to the stomach, and tied the last one to a pillar with his own rope. As the rebel carrying Unalaq attempted to escaped on a snowmobile, Korra created an ice ramp causing the vehicle to crash.",
      "links": [
        {
          "body": "airbending",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Upon arriving at the royal palace, Korra found several Northern soldiers tied up. After going to the upper level, she encountered a group of Southern rebels, one of them carrying an unconscious Unalaq. Korra attempted to negotiate the release of her uncle, but the rebels refused her offer and created a wall of ice for their escape. When Korra caught up to her adversaries, the rebel carrying Unalaq split from his group, who then proceeded to attack the Avatar. After dodging several water blasts, Korra tied up two of the rebels in a tapestry using airbending. She then knocked out another rebel with a kick to the stomach, and tied the last one to a pillar with his own rope. As the rebel carrying Unalaq attempted to escaped on a snowmobile, Korra created an ice ramp causing the vehicle to crash."
    },
    {
      "body": "Combatants: ${link_0}, ${link_1}, and ${link_2}",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_2}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        }
      ],
      "text": "Combatants: Korra, Mako, and Unalaq"
    },
    {
      "body": "Victor: Korra and Mako",
      "links": [],
      "text": "Victor: Korra and Mako"
    },
    {
      "body": "${link_0} and ${link_1} fought ${link_2} in an attempt to free ${link_3}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_2}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_3}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        }
      ],
      "text": "Korra and Mako fought Unalaq in an attempt to free Tonraq."
    },
    {
      "body": "Korra and her friends broke into the Southern Water Tribe prison to free Tonraq, only to be confronted by Unalaq, who informed ${link_0} that Korra's father was on a ship headed to the Northern Water Tribe, where his daughter would never see him again. He also informed the Avatar that she was not needed anymore and had served her purpose. She furiously launched a fireball at him, which he blocked with water from his ${link_1}. He retaliated with a series of razor sharp water strikes. Mako joined in the assault with his firebending as Unalaq reverses the fight, going on the offensive. Mako was hit in the chest with a blast of water, putting him out of the fight. Korra dodged the last of her uncle's attacks before countering with a blast of airbending, knocking Unalaq against the prison wall. The group departed, leaving the angered chief on the ground.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Water skin",
          "key": "${link_1}",
          "target": {
            "href": "Water_skin",
            "page": "Water_skin"
          }
        }
      ],
      "text": "Korra and her friends broke into the Southern Water Tribe prison to free Tonraq, only to be confronted by Unalaq, who informed Team Avatar that Korra's father was on a ship headed to the Northern Water Tribe, where his daughter would never see him again. He also informed the Avatar that she was not needed anymore and had served her purpose. She furiously launched a fireball at him, which he blocked with water from his Water skin. He retaliated with a series of razor sharp water strikes. Mako joined in the assault with his firebending as Unalaq reverses the fight, going on the offensive. Mako was hit in the chest with a blast of water, putting him out of the fight. Korra dodged the last of her uncle's attacks before countering with a blast of airbending, knocking Unalaq against the prison wall. The group departed, leaving the angered chief on the ground."
    },
    {
      "body": "Combatants: ${link_0}, ${link_1}, and a ${link_2}",
      "links": [
        {
          "body": "Desna, Eska",
          "key": "${link_0}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "dark spirit",
          "key": "${link_2}",
          "target": {
            "href": "Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "text": "Combatants: Desna, Eska, Korra, and a dark spirit"
    },
    {
      "body": "Victor: Dark spirit",
      "links": [],
      "text": "Victor: Dark spirit"
    },
    {
      "body": "${link_0} attempted to purify the ${link_1}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "dark spirit",
          "key": "${link_1}",
          "target": {
            "href": "Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "text": "Korra attempted to purify the dark spirit."
    },
    {
      "body": "Riding a speedboat on her way to the Fire Nation, Korra was pursued by ${link_0}, the latter believing Korra ruined her engagement with Bolin. After dodging several of their attacks, Korra destroyed the twins' ${link_1}, forcing them to continue on foot. Eska proceeded to destroy her cousin's speedboat, to which Korra responded by creating a water spout to distance herself from her pursuers. As the Avatar fought them off with several fire blasts, a giant dark spirit suddenly appeared from the ocean. After dodging several of the spirit's attacks, Korra was knocked into the ocean, where she entered the Avatar State. The Avatar attempted to spiritually cleanse the beast, but to no avail. The spirit proceeded to swallow Korra whole and descended beneath the surface. Having deduced that their adversary had been killed, Desna and Eska left the scene.",
      "links": [
        {
          "body": "Desna and Eska",
          "key": "${link_0}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "jet skis",
          "key": "${link_1}",
          "target": {
            "href": "Jet_ski",
            "page": "Jet_ski"
          }
        }
      ],
      "text": "Riding a speedboat on her way to the Fire Nation, Korra was pursued by Desna and Eska, the latter believing Korra ruined her engagement with Bolin. After dodging several of their attacks, Korra destroyed the twins' jet skis, forcing them to continue on foot. Eska proceeded to destroy her cousin's speedboat, to which Korra responded by creating a water spout to distance herself from her pursuers. As the Avatar fought them off with several fire blasts, a giant dark spirit suddenly appeared from the ocean. After dodging several of the spirit's attacks, Korra was knocked into the ocean, where she entered the Avatar State. The Avatar attempted to spiritually cleanse the beast, but to no avail. The spirit proceeded to swallow Korra whole and descended beneath the surface. Having deduced that their adversary had been killed, Desna and Eska left the scene."
    },
    {
      "body": "Combatants: ${link_0}, ${link_1}, and several members of the ${link_2}",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Triple Threat Triad",
          "key": "${link_2}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        }
      ],
      "text": "Combatants: Asami, Mako, and several members of the Triple Threat Triad"
    },
    {
      "body": "Victor: Mako and Asami",
      "links": [],
      "text": "Victor: Mako and Asami"
    },
    {
      "body": "Double-crossed by the ${link_0}, ${link_1} fought ${link_2} in an attempt to get away from them and to the warehouse where ${link_3}'s shipment was kept.",
      "links": [
        {
          "body": "Triple Threat Triad",
          "key": "${link_0}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Viper",
          "key": "${link_2}",
          "target": {
            "href": "Viper",
            "page": "Viper"
          }
        },
        {
          "body": "Asami",
          "key": "${link_3}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "text": "Double-crossed by the Triple Threat Triad, Mako fought Viper in an attempt to get away from them and to the warehouse where Asami's shipment was kept."
    },
    {
      "body": "Whilst aiding Asami in the search for whoever was responsible for the theft and destruction of several of Varrick Industries' ships, Mako enlisted the help of ${link_0} and the Triple Threat Triad. The group acquired a ship from Varrick, loaded it with dummy crates, and sailed it to the outskirts of Yue Bay, hoping to lure the would-be thieves with an enticing target and catch them in an ambush. After several hours of waiting Mako decided to take a walk about the deck, overhearing Viper and ${link_1} discussing how the gang had orders to keep both him and Asami busy. As the two members of Team Avatar attempted to leave the ship, they were surrounded by the Triple Threats. Mako distracted them with firebending, allowing the two to escape on a speed boat, with two boats of triad members giving chase. Viper utilized his waterbending in an attempt to sink their craft with several icebergs before creating a waterspout under them that threw the boat high into the air. Asami managed to regain control and maneuvered the chase into the shipping lanes, causing one of the pursuing boats to capsize on a sharp turn. The two were ambushed by Viper and Shady Shin, who sideswiped them, causing the boat's engine to stall. As they attempted to force the two to shore, Viper engaged Mako in a furious duel on the bow of the latter's boat. Though successful at first, Mako began to lose ground as Viper eventually gained the upper hand, knocking the firebender back into the vehicle. Moments before they hit shore, Asami managed to restart the engine and swerved out of the way, sending both Viper and Shin crashing through a building.",
      "links": [
        {
          "body": "Viper",
          "key": "${link_0}",
          "target": {
            "href": "Viper",
            "page": "Viper"
          }
        },
        {
          "body": "Shady Shin",
          "key": "${link_1}",
          "target": {
            "href": "Shady_Shin",
            "page": "Shady_Shin"
          }
        }
      ],
      "text": "Whilst aiding Asami in the search for whoever was responsible for the theft and destruction of several of Varrick Industries' ships, Mako enlisted the help of Viper and the Triple Threat Triad. The group acquired a ship from Varrick, loaded it with dummy crates, and sailed it to the outskirts of Yue Bay, hoping to lure the would-be thieves with an enticing target and catch them in an ambush. After several hours of waiting Mako decided to take a walk about the deck, overhearing Viper and Shady Shin discussing how the gang had orders to keep both him and Asami busy. As the two members of Team Avatar attempted to leave the ship, they were surrounded by the Triple Threats. Mako distracted them with firebending, allowing the two to escape on a speed boat, with two boats of triad members giving chase. Viper utilized his waterbending in an attempt to sink their craft with several icebergs before creating a waterspout under them that threw the boat high into the air. Asami managed to regain control and maneuvered the chase into the shipping lanes, causing one of the pursuing boats to capsize on a sharp turn. The two were ambushed by Viper and Shady Shin, who sideswiped them, causing the boat's engine to stall. As they attempted to force the two to shore, Viper engaged Mako in a furious duel on the bow of the latter's boat. Though successful at first, Mako began to lose ground as Viper eventually gained the upper hand, knocking the firebender back into the vehicle. Moments before they hit shore, Asami managed to restart the engine and swerved out of the way, sending both Viper and Shin crashing through a building."
    },
    {
      "body": "Combatants: ${link_0} and four of Varrick's ${link_1}",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "waterbenders",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Combatants: Bolin and four of Varrick's waterbenders"
    },
    {
      "body": "Victor: Bolin",
      "links": [],
      "text": "Victor: Bolin"
    },
    {
      "body": "${link_0} summoned earth discs in order to fight off the ${link_1}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "waterbenders",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Bolin summoned earth discs in order to fight off the waterbenders."
    },
    {
      "body": "After Bolin was told by Lu and Gang that ${link_0} ${link_1} was under attack, he made his way over to the presidential lounge where he found four waterbenders, dressed in ${link_2} military attire, who had bound and gagged the president and ${link_3}. He used his ${link_4} to send one attack into the water and the other three onto the arena, before jumping down himself to continue the fight away from the president. Noticing the commotion, Chief ${link_5} ordered her officers to secure the president and call for backup. At the center of the arena, Bolin used the earth discs from the arena floor and his knowledge of pro-bending to knock two of his opponents into the water. He proceeded to defeat the only remaining waterbender, intimidating him into revealing that it was ${link_6} who had ordered the attack. Upon hearing himself exposed, the businessman attempted to escape with ${link_7}, but the two were apprehended by Chief Lin Beifong and her officers. The remaining waterbender attempted to strike down Bolin, but the earthbender used another earth disc to launch his attacker into the water.",
      "links": [
        {
          "body": "President",
          "key": "${link_0}",
          "target": {
            "href": "President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_1}",
          "target": {
            "href": "Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "his wife",
          "key": "${link_3}",
          "target": {
            "href": "Buttercup_Raiko",
            "page": "Buttercup_Raiko"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_4}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_5}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_6}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "Zhu Li",
          "key": "${link_7}",
          "target": {
            "href": "Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        }
      ],
      "text": "After Bolin was told by Lu and Gang that President Raiko was under attack, he made his way over to the presidential lounge where he found four waterbenders, dressed in Northern Water Tribe military attire, who had bound and gagged the president and his wife. He used his earthbending to send one attack into the water and the other three onto the arena, before jumping down himself to continue the fight away from the president. Noticing the commotion, Chief Lin Beifong ordered her officers to secure the president and call for backup. At the center of the arena, Bolin used the earth discs from the arena floor and his knowledge of pro-bending to knock two of his opponents into the water. He proceeded to defeat the only remaining waterbender, intimidating him into revealing that it was Varrick who had ordered the attack. Upon hearing himself exposed, the businessman attempted to escape with Zhu Li, but the two were apprehended by Chief Lin Beifong and her officers. The remaining waterbender attempted to strike down Bolin, but the earthbender used another earth disc to launch his attacker into the water."
    },
    {
      "body": "Combatants: ${link_0} and ${link_1}",
      "links": [
        {
          "body": "Tonraq",
          "key": "${link_0}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_1}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        }
      ],
      "text": "Combatants: Tonraq and Unalaq"
    },
    {
      "body": "Victor: Unalaq",
      "links": [],
      "text": "Victor: Unalaq"
    },
    {
      "body": "${link_0} attempted to deliver a final blow on ${link_1}, though was intercepted and subsequently defeated.",
      "links": [
        {
          "body": "Tonraq",
          "key": "${link_0}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_1}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        }
      ],
      "text": "Tonraq attempted to deliver a final blow on Unalaq, though was intercepted and subsequently defeated."
    },
    {
      "body": "During the ${link_0}, Tonraq faced his brother in hopes of finishing the civil war between the Northern and the Southern Tribe. Before the duel began, he denounced Unalaq as his brother as it had been his fault Tonraq had been banished from his home tribe. During the fight, both gave and returned attacks from each other. Tonraq eventually managed to get within striking distance of Unalaq, but before he could land his blow, Unalaq struck his unprotected stomach with an ice pillar and subsequently froze him. Trapped in a block of ice, Tonraq received a devastating blow which left him defeated. Tonraq was taken to Unalaq's camp at the ${link_1} where he was kept as a prisoner.",
      "links": [
        {
          "body": "battle of the Southern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Battle_of_the_Southern_Water_Tribe",
            "page": "Battle_of_the_Southern_Water_Tribe"
          }
        },
        {
          "body": "South Pole",
          "key": "${link_1}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        }
      ],
      "text": "During the battle of the Southern Water Tribe, Tonraq faced his brother in hopes of finishing the civil war between the Northern and the Southern Tribe. Before the duel began, he denounced Unalaq as his brother as it had been his fault Tonraq had been banished from his home tribe. During the fight, both gave and returned attacks from each other. Tonraq eventually managed to get within striking distance of Unalaq, but before he could land his blow, Unalaq struck his unprotected stomach with an ice pillar and subsequently froze him. Trapped in a block of ice, Tonraq received a devastating blow which left him defeated. Tonraq was taken to Unalaq's camp at the South Pole where he was kept as a prisoner."
    },
    {
      "body": "Combatants: ${link_0}, ${link_1}, ${link_2}, ${link_3}, ${link_4}, ${link_5}, ${link_6}, ${link_7}, ${link_8}, and the Northern military",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Korra",
          "key": "${link_3}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_4}",
          "target": {
            "href": "Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Kya",
          "key": "${link_5}",
          "target": {
            "href": "Kya",
            "page": "Kya"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_6}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "dark spirits",
          "key": "${link_7}",
          "target": {
            "href": "Dark_spirits",
            "page": "Dark_spirits"
          }
        },
        {
          "body": "Desna, Eska",
          "key": "${link_8}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        }
      ],
      "text": "Combatants: Bolin, Mako, Asami, Korra, Bumi, Kya, Tenzin, dark spirits, Desna, Eska, and the Northern military"
    },
    {
      "body": "Victor: Desna, Eska, the Northern military, and the dark spirits",
      "links": [],
      "text": "Victor: Desna, Eska, the Northern military, and the dark spirits"
    },
    {
      "body": "${link_0} attacked the ${link_1} ${link_2} encampment in order to gain access to the ${link_3}.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "military",
          "key": "${link_2}",
          "target": {
            "href": "Military_of_the_Water_Tribe#Northern_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Team Avatar attacked the Northern Water Tribe military encampment in order to gain access to the Spirit World."
    },
    {
      "body": "In order to get Korra, Bumi, Kya, and Tenzin into the Spirit World, Bolin, Mako, and Asami boarded a biplane to create a diversion attack. Despite their attempt to execute a surprise attack, the trio found the Northern army assembled and ready to defend the portal. Asami maneuvered through the assault launch while Mako and Bolin provided cover by bombarding the army with their bending. Although they managed to do some damage, Desna and Eska both attacked the plane and were able to bring it down. The trio was quickly captured and brought to a tent where Tonraq was also being held.",
      "links": [],
      "text": "In order to get Korra, Bumi, Kya, and Tenzin into the Spirit World, Bolin, Mako, and Asami boarded a biplane to create a diversion attack. Despite their attempt to execute a surprise attack, the trio found the Northern army assembled and ready to defend the portal. Asami maneuvered through the assault launch while Mako and Bolin provided cover by bombarding the army with their bending. Although they managed to do some damage, Desna and Eska both attacked the plane and were able to bring it down. The trio was quickly captured and brought to a tent where Tonraq was also being held."
    },
    {
      "body": "The second group on Oogi approached the portal, but the bison was soon attacked by numerous dark spirits, who were attaching themselves to him, bringing the bison down. Korra, Kya, and Bumi attempted to fight off the spirits. Bumi fell off the bison, though had been able to drag a spirit down with him, while Oogi eventually crashed into the ground as well, rendering the remaining passengers unconscious and an easy target for the Northern military to apprehend and imprison in the same tent as their friends.",
      "links": [],
      "text": "The second group on Oogi approached the portal, but the bison was soon attacked by numerous dark spirits, who were attaching themselves to him, bringing the bison down. Korra, Kya, and Bumi attempted to fight off the spirits. Bumi fell off the bison, though had been able to drag a spirit down with him, while Oogi eventually crashed into the ground as well, rendering the remaining passengers unconscious and an easy target for the Northern military to apprehend and imprison in the same tent as their friends."
    },
    {
      "body": "Combatants: ${link_0}, ${link_1}, ${link_2}, ${link_3}",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_2}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Desna, and Eska",
          "key": "${link_3}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        }
      ],
      "text": "Combatants: Bolin, Mako, Unalaq, Desna, and Eska"
    },
    {
      "body": "Victor: Unalaq",
      "links": [],
      "text": "Victor: Unalaq"
    },
    {
      "body": "${link_0} and ${link_1} guarded the Southern ${link_2} to keep ${link_3} from reentering the ${link_4}.",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_3}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_4}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Mako and Bolin guarded the Southern spirit portal to keep Unalaq from reentering the Spirit World."
    },
    {
      "body": "After Korra managed to expel Unalaq from the Spirit World, Mako and Bolin go after him in order to prevent his reentry. Guarding the southern portal, the brothers were attacked by a barrage of ice pieces. They managed to evade them for a while, though when Desna and Eska came to their father's help, they easily overpowered the brothers as they had not been expecting the twins to show up. With Mako and Bolin unconscious, Unalaq reentered the Spirit World, leaving the brothers in the custody of his children. As the twins dragged Mako and Bolin away from the portal, they woke up and Mako used his firebending to free both himself and Bolin. They made a dash for the portal, however, once they were through, they were encased in a block of ice by the Desna and Eska.",
      "links": [],
      "text": "After Korra managed to expel Unalaq from the Spirit World, Mako and Bolin go after him in order to prevent his reentry. Guarding the southern portal, the brothers were attacked by a barrage of ice pieces. They managed to evade them for a while, though when Desna and Eska came to their father's help, they easily overpowered the brothers as they had not been expecting the twins to show up. With Mako and Bolin unconscious, Unalaq reentered the Spirit World, leaving the brothers in the custody of his children. As the twins dragged Mako and Bolin away from the portal, they woke up and Mako used his firebending to free both himself and Bolin. They made a dash for the portal, however, once they were through, they were encased in a block of ice by the Desna and Eska."
    },
    {
      "body": "Combatants: ${link_0}, ${link_1}, and ${link_2}",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_1}",
          "target": {
            "href": "Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_2}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        }
      ],
      "text": "Combatants: Korra, Vaatu, and Unalaq"
    },
    {
      "body": "Victor: Korra",
      "links": [],
      "text": "Victor: Korra"
    },
    {
      "body": "Casualties: Unalaq is killed and Vaatu is purified.",
      "links": [],
      "text": "Casualties: Unalaq is killed and Vaatu is purified."
    },
    {
      "body": "In the Spirit World, Korra battled Vaatu in an attempt to defeat the spirit before he could merge with Unalaq. Assaulting Vaatu with her bending, Korra landed powerful blows on the dark spirit. She was momentarily subdued after being hit by Vaatu's energy beam and ensnared with vines, though she managed to free herself with her firebending and managed to trap him in an elemental sphere. Before she could fully imprison him once again in the ${link_0}, she was hit by a water blast from Unalaq, who had come back through the portal, freeing Vaatu. As she attempted to retaliate, Korra was hit again by another water blast, momentarily incapacitating her and giving Vaatu and Unalaq the time to permanently merge.",
      "links": [
        {
          "body": "Tree of Time",
          "key": "${link_0}",
          "target": {
            "href": "Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "text": "In the Spirit World, Korra battled Vaatu in an attempt to defeat the spirit before he could merge with Unalaq. Assaulting Vaatu with her bending, Korra landed powerful blows on the dark spirit. She was momentarily subdued after being hit by Vaatu's energy beam and ensnared with vines, though she managed to free herself with her firebending and managed to trap him in an elemental sphere. Before she could fully imprison him once again in the Tree of Time, she was hit by a water blast from Unalaq, who had come back through the portal, freeing Vaatu. As she attempted to retaliate, Korra was hit again by another water blast, momentarily incapacitating her and giving Vaatu and Unalaq the time to permanently merge."
    },
    {
      "body": "${link_0}, having become the ${link_1} by merging with ${link_2}, extracted ${link_3} from ${link_4}.",
      "links": [
        {
          "body": "Unalaq",
          "key": "${link_0}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Dark Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Dark_Avatar",
            "page": "Dark_Avatar"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_2}",
          "target": {
            "href": "Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Raava",
          "key": "${link_3}",
          "target": {
            "href": "Raava",
            "page": "Raava"
          }
        },
        {
          "body": "Korra",
          "key": "${link_4}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Unalaq, having become the Dark Avatar by merging with Vaatu, extracted Raava from Korra."
    },
    {
      "body": "The two Avatars resumed fighting and made their way out of the Spirit World, continuing the battle around the southern portal. Unalaq had managed to knock Korra off her air spout and had trapped her in a fissure on the ground, though inspired by Raava's words, Korra managed to free herself and resume fighting. She was able to bring him down, but before she could subdue him, Vaatu emerged and ripped Raava out of Korra, leaving her to collapse to the ground. Unalaq quickly trapped the light spirit in a sphere of water upon being repossessed by Vaatu. He slammed Raava against a rock and attacked her relentlessly until she was destroyed. Unalaq subsequently took on enormous proportions and made his way to Republic City, where he made easy work of the defending ${link_0} ${link_1} and covered the city in vines.",
      "links": [
        {
          "body": "United Forces",
          "key": "${link_0}",
          "target": {
            "href": "United_Forces",
            "page": "United_Forces"
          }
        },
        {
          "body": "battleships",
          "key": "${link_1}",
          "target": {
            "href": "Battleship",
            "page": "Battleship"
          }
        }
      ],
      "text": "The two Avatars resumed fighting and made their way out of the Spirit World, continuing the battle around the southern portal. Unalaq had managed to knock Korra off her air spout and had trapped her in a fissure on the ground, though inspired by Raava's words, Korra managed to free herself and resume fighting. She was able to bring him down, but before she could subdue him, Vaatu emerged and ripped Raava out of Korra, leaving her to collapse to the ground. Unalaq quickly trapped the light spirit in a sphere of water upon being repossessed by Vaatu. He slammed Raava against a rock and attacked her relentlessly until she was destroyed. Unalaq subsequently took on enormous proportions and made his way to Republic City, where he made easy work of the defending United Forces battleships and covered the city in vines."
    },
    {
      "body": "${link_0} reached inside ${link_1} to extract ${link_2}, before dissipating the dark spirit with the spiritual ${link_3} technique.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_1}",
          "target": {
            "href": "Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Raava",
          "key": "${link_2}",
          "target": {
            "href": "Raava",
            "page": "Raava"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_3}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Korra reached inside Vaatu to extract Raava, before dissipating the dark spirit with the spiritual waterbending technique."
    },
    {
      "body": "After being healed by Kya and with guidance of Tenzin, Korra figured out how to connect to the cosmic energy within the Tree of Time and she created a large astral projection of herself, with which she followed Unalaq to Republic City and rammed into him upon arrival. Korra swiftly gained the upper hand and, while pinning her foe down against a nearby mountain, she searched for Raava inside his body, but to no avail. Korra became disheartened, giving the Dark Avatar an opportunity to entangle her with his tendrils and strike her with a close-range energy blast. With Korra subdued, the Dark Avatar began to use the spiritual waterbending technique to destroy her. Just as he was about to do so, a ${link_0} of Jinora descended from the sky in a brilliant light while carrying a small orb of light which she released. The Dark Avatar's concentration was broken, thus freeing Korra's spirit, and Raava's presence within him was illuminated. Korra's projection ran over to him and punched into him submission, allowing her to rip Raava from within him. She promptly performed the spiritual waterbending technique herself, causing him to dissipate. Upon her return to the Spirit World, Korra's projection also destroyed all the dark spirits that were attacking her friends who were defending her body in the Tree of Time.",
      "links": [
        {
          "body": "spiritual projection",
          "key": "${link_0}",
          "target": {
            "href": "Spiritual_projection",
            "page": "Spiritual_projection"
          }
        }
      ],
      "text": "After being healed by Kya and with guidance of Tenzin, Korra figured out how to connect to the cosmic energy within the Tree of Time and she created a large astral projection of herself, with which she followed Unalaq to Republic City and rammed into him upon arrival. Korra swiftly gained the upper hand and, while pinning her foe down against a nearby mountain, she searched for Raava inside his body, but to no avail. Korra became disheartened, giving the Dark Avatar an opportunity to entangle her with his tendrils and strike her with a close-range energy blast. With Korra subdued, the Dark Avatar began to use the spiritual waterbending technique to destroy her. Just as he was about to do so, a spiritual projection of Jinora descended from the sky in a brilliant light while carrying a small orb of light which she released. The Dark Avatar's concentration was broken, thus freeing Korra's spirit, and Raava's presence within him was illuminated. Korra's projection ran over to him and punched into him submission, allowing her to rip Raava from within him. She promptly performed the spiritual waterbending technique herself, causing him to dissipate. Upon her return to the Spirit World, Korra's projection also destroyed all the dark spirits that were attacking her friends who were defending her body in the Tree of Time."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Duels_(171_AG_-_Harmonic_Convergence)",
    "file": "avatar.wikia.com/wiki/Duels_(171_AG_-_Harmonic_Convergence).html",
    "page": "Duels_(171_AG_-_Harmonic_Convergence)",
    "title": "Duels (171 AG - Harmonic Convergence)"
  }
}