{
  "categories": [
    {
      "body": "A-class articles",
      "target": {
        "href": "Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Duels",
      "target": {
        "href": "Category_Duels",
        "page": "Category_Duels"
      }
    },
    {
      "body": "Events",
      "target": {
        "href": "Category_Events",
        "page": "Category_Events"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} and ${link_1} dueled one another on a number of occasions.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Zuko and Aang dueled one another on a number of occasions."
    },
    {
      "body": "Duels are formal combats that involve two or more opposing fighters. They can be as quick as a minute or last for hours and are sometimes regulated. Duels can be fights to the death, as is the case with most ${link_0}, or simply recreational spars. Duels are also used in training, both in the four ${link_1} and in specialized fighting styles, such as swordsmanship and ${link_2}.",
      "links": [
        {
          "body": "Agni Kai",
          "key": "${link_0}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        },
        {
          "body": "bending arts",
          "key": "${link_1}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "chi blocking",
          "key": "${link_2}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        }
      ],
      "text": "Duels are formal combats that involve two or more opposing fighters. They can be as quick as a minute or last for hours and are sometimes regulated. Duels can be fights to the death, as is the case with most Agni Kai, or simply recreational spars. Duels are also used in training, both in the four bending arts and in specialized fighting styles, such as swordsmanship and chi blocking."
    },
    {
      "body": "${link_0} and ${link_1} fought an ${link_2} after the ${link_3} insulted the young ${link_4}.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_2}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        },
        {
          "body": "commander",
          "key": "${link_3}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#Commander",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "prince",
          "key": "${link_4}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "text": "Zhao and Zuko fought an Agni Kai after the commander insulted the young prince."
    },
    {
      "body": "The Agni Kai is the main type of duel in the ${link_0}. It is a formal fight, fought between two ${link_1} of either gender, from all levels of society. These firebenders do not have to be masters, as anyone can challenge another firebender. It is used to settle a dispute and/or prove worth and honor. They can also be used to gain redemption from a past crime and are seen by some as an opportunity to challenge figures of society for political positions. An Agni Kai is fought until one of the combatants submits or is immobilized by his or her opponent. Some Agni Kai are relatively intense and fought until an opponent is killed, although no known Agni Kai resulted in a death.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "firebenders",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "The Agni Kai is the main type of duel in the Fire Nation. It is a formal fight, fought between two firebenders of either gender, from all levels of society. These firebenders do not have to be masters, as anyone can challenge another firebender. It is used to settle a dispute and/or prove worth and honor. They can also be used to gain redemption from a past crime and are seen by some as an opportunity to challenge figures of society for political positions. An Agni Kai is fought until one of the combatants submits or is immobilized by his or her opponent. Some Agni Kai are relatively intense and fought until an opponent is killed, although no known Agni Kai resulted in a death."
    },
    {
      "body": "${link_0} held her own against ${link_1} during their water duel.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Pakku",
          "key": "${link_1}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        }
      ],
      "text": "Katara held her own against Pakku during their water duel."
    },
    {
      "body": "The system of duels utilized by the ${link_0} lean toward training and recreational purposes. They are fought between two ${link_1}. In water duels used for training, an opponent battles several waterbenders in a sparring circle until they are defeated, at which point another combatant becomes the primary fighter. Upon defeating all opponents present, the primary fighter must spar against any combatants who wish to have a rematch. In other cases, water duels are simply used to settle disputes. The duels are usually a fight to immobilization due to the nation's spiritual nature.",
      "links": [
        {
          "body": "Water Tribes",
          "key": "${link_0}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "waterbenders",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "The system of duels utilized by the Water Tribes lean toward training and recreational purposes. They are fought between two waterbenders. In water duels used for training, an opponent battles several waterbenders in a sparring circle until they are defeated, at which point another combatant becomes the primary fighter. Upon defeating all opponents present, the primary fighter must spar against any combatants who wish to have a rematch. In other cases, water duels are simply used to settle disputes. The duels are usually a fight to immobilization due to the nation's spiritual nature."
    },
    {
      "body": "${link_0} served as both a competition for ${link_1} and as entertainment for spectators.",
      "links": [
        {
          "body": "Earth Rumble VI",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Rumble_VI",
            "page": "Earth_Rumble_VI"
          }
        },
        {
          "body": "earthbenders",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Earth Rumble VI served as both a competition for earthbenders and as entertainment for spectators."
    },
    {
      "body": "${link_0} is an underground, organized dueling system in the ${link_1} that is fought between ${link_2}. Unlike an Agni Kai, the competition is less deadly and serves primarily as entertainment to crowds of viewers. An opponent wins by knocking their competitor out of the ring. The combatant who can successfully defeat all of their opponents without losing a single match becomes the champion. They return in the next rumble to defend the title against the competitors and spectators who challenge them.",
      "links": [
        {
          "body": "Earth Rumble VI",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Rumble_VI",
            "page": "Earth_Rumble_VI"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "earthbenders",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Earth Rumble VI is an underground, organized dueling system in the Earth Kingdom that is fought between earthbenders. Unlike an Agni Kai, the competition is less deadly and serves primarily as entertainment to crowds of viewers. An opponent wins by knocking their competitor out of the ring. The combatant who can successfully defeat all of their opponents without losing a single match becomes the champion. They return in the next rumble to defend the title against the competitors and spectators who challenge them."
    },
    {
      "body": "${link_0} tiebreakers are one-on-one duels between ${link_1} of the same element.",
      "links": [
        {
          "body": "Pro-bending",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending",
            "page": "Pro-bending"
          }
        },
        {
          "body": "benders",
          "key": "${link_1}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "Pro-bending tiebreakers are one-on-one duels between benders of the same element."
    },
    {
      "body": "During a ${link_0} match, if the two fighting teams tie, a duel is fought. The ${link_1} of the match flips a coin and the winning team decides which elemental benders will duel each other. The duel is fought between each team's corresponding bender. The sole winner of the duel wins the round for his or her team.",
      "links": [
        {
          "body": "pro-bending",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending",
            "page": "Pro-bending"
          }
        },
        {
          "body": "referee",
          "key": "${link_1}",
          "target": {
            "href": "Pro-bending_referees",
            "page": "Pro-bending_referees"
          }
        }
      ],
      "text": "During a pro-bending match, if the two fighting teams tie, a duel is fought. The referee of the match flips a coin and the winning team decides which elemental benders will duel each other. The duel is fought between each team's corresponding bender. The sole winner of the duel wins the round for his or her team."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Duels",
    "file": "avatar.wikia.com/wiki/Duels.html",
    "page": "Duels",
    "title": "Duels"
  }
}