{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Establishments",
      "target": {
        "href": "Category_Establishments",
        "page": "Category_Establishments"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "href": "Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Organizations",
      "target": {
        "href": "Category_Organizations",
        "page": "Category_Organizations"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "Near ${link_0}, near the ${link_1}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Yu Dao",
              "key": "${link_0}",
              "target": {
                "href": "Yu_Dao",
                "page": "Yu_Dao"
              }
            },
            {
              "body": "Mo Ce Sea",
              "key": "${link_1}",
              "target": {
                "href": "Mo_Ce_Sea",
                "page": "Mo_Ce_Sea"
              }
            }
          ],
          "text": "Near Yu Dao, near the Mo Ce Sea",
          "value": "Near ${link_0}, near the ${link_1}",
          "value_text": "Near Yu Dao, near the Mo Ce Sea"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "Refinery",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Refinery",
          "value": "Refinery",
          "value_text": "Refinery"
        }
      ]
    },
    {
      "key": "Owner",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Lao Beifong",
              "key": "${link_0}",
              "target": {
                "href": "Lao_Beifong",
                "page": "Lao_Beifong"
              }
            }
          ],
          "text": "Lao Beifong",
          "value": "${link_0}",
          "value_text": "Lao Beifong"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Loban",
              "key": "${link_0}",
              "target": {
                "href": "Loban",
                "page": "Loban"
              }
            }
          ],
          "text": "Loban",
          "value": "${link_0}",
          "value_text": "Loban"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "The Rift Part One",
              "key": "${link_0}",
              "target": {
                "href": "The_Rift_Part_One",
                "page": "The_Rift_Part_One"
              }
            }
          ],
          "text": "The Rift Part One",
          "value": "${link_0}",
          "value_text": "The Rift Part One"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The Earthen Fire Refinery is a production facility founded by ${link_0} from the ${link_1} and ${link_2} from the ${link_3}, giving it the distinction of being the ${link_4}'s first international business venture. Situated over the largest crystal depository outside of ${link_5}, the company primarily focuses on mineral extraction, although it has plans to broaden its scope to other resources. In this regard, Loban gave the order to excavate a local iron mine in secrecy against Lao's wishes, as the latter had deemed the dig site to be too unstable to mine. The refinery employs ${link_6} and nonbenders from all over the world and is located on land previously held sacred by the ${link_7}.",
      "links": [
        {
          "body": "Loban",
          "key": "${link_0}",
          "target": {
            "href": "Loban",
            "page": "Loban"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Lao Beifong",
          "key": "${link_2}",
          "target": {
            "href": "Lao_Beifong",
            "page": "Lao_Beifong"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_3}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "world",
          "key": "${link_4}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_5}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "benders",
          "key": "${link_6}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_7}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "text": "The Earthen Fire Refinery is a production facility founded by Loban from the Fire Nation and Lao Beifong from the Earth Kingdom, giving it the distinction of being the world's first international business venture. Situated over the largest crystal depository outside of Ba Sing Se, the company primarily focuses on mineral extraction, although it has plans to broaden its scope to other resources. In this regard, Loban gave the order to excavate a local iron mine in secrecy against Lao's wishes, as the latter had deemed the dig site to be too unstable to mine. The refinery employs benders and nonbenders from all over the world and is located on land previously held sacred by the Air Nomads."
    },
    {
      "body": "During the final stages of the ${link_0}, Loban discovered a meadow in the Earth Kingdom rich with natural resources. Due to political reasons, he, as a Fire Nation citizen, was unable to exploit the ground's wealth and had to wait until the end of the war before he was able to find an Earth Kingdom business partner, Lao Beifong, and could begin development on the land. The Earthen Fire Refinery attracted labor forces from all nations, such as ${link_1} and ${link_2} from the ${link_3}, who worked the machinery on a production line concentrated in mineral extraction.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Niyok",
          "key": "${link_1}",
          "target": {
            "href": "Niyok",
            "page": "Niyok"
          }
        },
        {
          "body": "Nutha",
          "key": "${link_2}",
          "target": {
            "href": "Nutha",
            "page": "Nutha"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_3}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "During the final stages of the Hundred Year War, Loban discovered a meadow in the Earth Kingdom rich with natural resources. Due to political reasons, he, as a Fire Nation citizen, was unable to exploit the ground's wealth and had to wait until the end of the war before he was able to find an Earth Kingdom business partner, Lao Beifong, and could begin development on the land. The Earthen Fire Refinery attracted labor forces from all nations, such as Niyok and Nutha from the Southern Water Tribe, who worked the machinery on a production line concentrated in mineral extraction."
    },
    {
      "body": "In 102 ${link_0}, ${link_1} visited the refinery along with three ${link_2} on the day of ${link_3}. Shortly after their arrival, the group was attacked by a unit of ${link_4} guards, whom ${link_5} ${link_6} easily defeated. ${link_7}, the refinery's engineer and man in charge when Lao and Loban were absent, instantly recognized the teenagers for who they were and proceeded to give them a tour of the refinery, taking the group to both of the establishment's production lines.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Air Acolytes",
          "key": "${link_2}",
          "target": {
            "href": "Air_Acolytes",
            "page": "Air_Acolytes"
          }
        },
        {
          "body": "Yangchen's Festival",
          "key": "${link_3}",
          "target": {
            "href": "Yangchen%27s_Festival",
            "page": "Yangchen%27s_Festival"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_4}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_5}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_6}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Satoru",
          "key": "${link_7}",
          "target": {
            "href": "Satoru",
            "page": "Satoru"
          }
        }
      ],
      "text": "In 102 AG, Team Avatar visited the refinery along with three Air Acolytes on the day of Yangchen's Festival. Shortly after their arrival, the group was attacked by a unit of earthbending guards, whom Avatar Aang easily defeated. Satoru, the refinery's engineer and man in charge when Lao and Loban were absent, instantly recognized the teenagers for who they were and proceeded to give them a tour of the refinery, taking the group to both of the establishment's production lines."
    },
    {
      "body": "After witnessing ${link_0}'s use of ${link_1} to repair a ${link_2} engine, Satoru suggested establishing a partnership between the ${link_3} and the Earthen Fire Refinery, in which Toph and her students would periodically visit to aid in machine repair in exchange for the refinery's sponsorship of a new school building.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "metalbending",
          "key": "${link_1}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "forklift",
          "key": "${link_2}",
          "target": {
            "href": "Transportation_in_the_World_of_Avatar",
            "page": "Transportation_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Beifong Metalbending Academy",
          "key": "${link_3}",
          "target": {
            "href": "Beifong_Metalbending_Academy",
            "page": "Beifong_Metalbending_Academy"
          }
        }
      ],
      "text": "After witnessing Toph's use of metalbending to repair a forklift engine, Satoru suggested establishing a partnership between the Beifong Metalbending Academy and the Earthen Fire Refinery, in which Toph and her students would periodically visit to aid in machine repair in exchange for the refinery's sponsorship of a new school building."
    },
    {
      "body": "Following two earthquakes, a machine went haywire, spewing rocks everywhere.",
      "links": [],
      "text": "Following two earthquakes, a machine went haywire, spewing rocks everywhere."
    },
    {
      "body": "Following the tour, Aang attempted to reason with Satoru, stating that the refinery was wrongfully erected on land that was once sacred to the ${link_0} and blaming the factory for the pollution of a nearby river. Toph defended the factory, believing Satoru's statement that the refinery was not to blame for the pollution, as well as supporting the notion that the refinery was the future. In the ensuing argument, an earthquake erupted, causing one of the machines to malfunction, which resulted in significant damage to the factory by earthen projectiles that were shot in every direction. Despite Satoru's insistence that the machine could be turned off by unplugging it, Toph shut it down by destroying the ten thousand ${link_1} machine completely, much to the dissatisfaction of Loban.",
      "links": [
        {
          "body": "Air Nomads",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "ban",
          "key": "${link_1}",
          "target": {
            "href": "Currency",
            "page": "Currency"
          }
        }
      ],
      "text": "Following the tour, Aang attempted to reason with Satoru, stating that the refinery was wrongfully erected on land that was once sacred to the Air Nomads and blaming the factory for the pollution of a nearby river. Toph defended the factory, believing Satoru's statement that the refinery was not to blame for the pollution, as well as supporting the notion that the refinery was the future. In the ensuing argument, an earthquake erupted, causing one of the machines to malfunction, which resulted in significant damage to the factory by earthen projectiles that were shot in every direction. Despite Satoru's insistence that the machine could be turned off by unplugging it, Toph shut it down by destroying the ten thousand ban machine completely, much to the dissatisfaction of Loban."
    },
    {
      "body": "The iron mine was being kept secret from ${link_0} as he had already argued against its construction.",
      "links": [
        {
          "body": "Lao",
          "key": "${link_0}",
          "target": {
            "href": "Lao_Beifong",
            "page": "Lao_Beifong"
          }
        }
      ],
      "text": "The iron mine was being kept secret from Lao as he had already argued against its construction."
    },
    {
      "body": "He took his anger out on Satoru and demanded that production with the bender assembly line resumed within the hour in order to make the deadlines. Team Avatar refused to leave the premises and got into a fight with the ${link_0}. Sokka used himself and Katara as targets to trick ${link_1}, ${link_2}, and ${link_3} to run down the factory's fence with their ${link_4}. After Katara encased them in ice, Sokka threw Yeh-Lu's burning stick of dynamite toward the river, though it exploded nonetheless, revealing a secret tunnel that led to a rich, but unstable iron mine underneath the town, which was being excavated on Loban's orders. When this was brought to Lao's attention, he ventured into the mine himself and ordered all the minors to leave, though got into an argument with Loban there, who wished to keep mining the ore. When ${link_5} accidentally broke a support beam with his weapon, trying to hit Sokka, the mine caved in, trapping Loban, Lao, Toph, Katara, and several others as a result.",
      "links": [
        {
          "body": "Rough Rhinos",
          "key": "${link_0}",
          "target": {
            "href": "Rough_Rhinos",
            "page": "Rough_Rhinos"
          }
        },
        {
          "body": "Mongke",
          "key": "${link_1}",
          "target": {
            "href": "Mongke",
            "page": "Mongke"
          }
        },
        {
          "body": "Yeh-Lu",
          "key": "${link_2}",
          "target": {
            "href": "Yeh-Lu",
            "page": "Yeh-Lu"
          }
        },
        {
          "body": "Utor",
          "key": "${link_3}",
          "target": {
            "href": "Utor",
            "page": "Utor"
          }
        },
        {
          "body": "komodo rhinos",
          "key": "${link_4}",
          "target": {
            "href": "Komodo_rhino",
            "page": "Komodo_rhino"
          }
        },
        {
          "body": "Kahchi",
          "key": "${link_5}",
          "target": {
            "href": "Kahchi",
            "page": "Kahchi"
          }
        }
      ],
      "text": "He took his anger out on Satoru and demanded that production with the bender assembly line resumed within the hour in order to make the deadlines. Team Avatar refused to leave the premises and got into a fight with the Rough Rhinos. Sokka used himself and Katara as targets to trick Mongke, Yeh-Lu, and Utor to run down the factory's fence with their komodo rhinos. After Katara encased them in ice, Sokka threw Yeh-Lu's burning stick of dynamite toward the river, though it exploded nonetheless, revealing a secret tunnel that led to a rich, but unstable iron mine underneath the town, which was being excavated on Loban's orders. When this was brought to Lao's attention, he ventured into the mine himself and ordered all the minors to leave, though got into an argument with Loban there, who wished to keep mining the ore. When Kahchi accidentally broke a support beam with his weapon, trying to hit Sokka, the mine caved in, trapping Loban, Lao, Toph, Katara, and several others as a result."
    },
    {
      "body": "The refinery is located atop the largest crystal depository outside of Ba Sing Se in an Earth Kingdom town near the ${link_0}. It is protected by a large metal fence, as well as a unit of earthbending guards who patrol the grounds for trespassers. The exterior of the refinery is primarily gray in coloration, with red metal detailing on the doors and windows. Large smokestacks protrude from several points, some of which bear the company's insignia.",
      "links": [
        {
          "body": "Mo Ce Sea",
          "key": "${link_0}",
          "target": {
            "href": "Mo_Ce_Sea",
            "page": "Mo_Ce_Sea"
          }
        }
      ],
      "text": "The refinery is located atop the largest crystal depository outside of Ba Sing Se in an Earth Kingdom town near the Mo Ce Sea. It is protected by a large metal fence, as well as a unit of earthbending guards who patrol the grounds for trespassers. The exterior of the refinery is primarily gray in coloration, with red metal detailing on the doors and windows. Large smokestacks protrude from several points, some of which bear the company's insignia."
    },
    {
      "body": "The Earthen Fire Refinery's older production line employs ${link_0} to extract the minerals.",
      "links": [
        {
          "body": "benders",
          "key": "${link_0}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "The Earthen Fire Refinery's older production line employs benders to extract the minerals."
    },
    {
      "body": "The facility's interior contains two large production lines, both of which are multi-level systems consisting of large furnaces and conveyor belts. The older production line employs benders, who undergo an extensive yearlong training program outlining proper extraction methods to refine crystals from raw earth. Earthbenders crush the ores and extract the mineral-rich compounds, which ${link_0} treat in solution to purify. ${link_1} finish the process by heating up the ovens to facilitate smelting, which further refines the crystals. The concentrated products are collected in several bins, which are separated and processed by forklifts for subsequent shipment. A newer production line uses the same purification method, but with machines instead of benders. Nonbenders are also employed in this line, as the oversight of processing requires no bending ability and only a few days of training.",
      "links": [
        {
          "body": "waterbenders",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Firebenders",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "The facility's interior contains two large production lines, both of which are multi-level systems consisting of large furnaces and conveyor belts. The older production line employs benders, who undergo an extensive yearlong training program outlining proper extraction methods to refine crystals from raw earth. Earthbenders crush the ores and extract the mineral-rich compounds, which waterbenders treat in solution to purify. Firebenders finish the process by heating up the ovens to facilitate smelting, which further refines the crystals. The concentrated products are collected in several bins, which are separated and processed by forklifts for subsequent shipment. A newer production line uses the same purification method, but with machines instead of benders. Nonbenders are also employed in this line, as the oversight of processing requires no bending ability and only a few days of training."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Earthen_Fire_Refinery",
    "file": "avatar.wikia.com/wiki/Earthen_Fire_Refinery.html",
    "page": "Earthen_Fire_Refinery",
    "title": "Earthen Fire Refinery"
  }
}