{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Ba Sing Se",
      "target": {
        "external": false,
        "href": "/wiki/Category_Ba_Sing_Se",
        "page": "Category_Ba_Sing_Se"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "external": false,
        "href": "/wiki/Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Titles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Titles",
        "page": "Category_Titles"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The Earth King or Earth Queen is the ruler of the ${link_0} and the sovereign of ${link_1}. The earth monarch consolidates their power, ${link_2}, and seat of government in the ${link_3} of Ba Sing Se, the capital of their kingdom. As of 174 ${link_4}, with the coronation of ${link_5} of the Hou-Ting Dynasty, there have been fifty-four monarchs of the Earth Kingdom. However, after ${link_6} ${link_7} ${link_8}, King Wu decided to step down as king and abolish the monarchy in favor of independent states with elected governments akin to the political system of the ${link_9}, a motion for which he received the support of ${link_10} ${link_11}.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "palace",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        },
        {
          "body": "Upper Ring",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se#Upper_Ring",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "AG",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Wu",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Wu",
            "page": "Wu"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "attacked",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "United Republic of Nations",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_11}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        }
      ],
      "section": [
        "Earth monarch"
      ],
      "text": "The Earth King or Earth Queen is the ruler of the Earth Kingdom and the sovereign of Ba Sing Se. The earth monarch consolidates their power, palace, and seat of government in the Upper Ring of Ba Sing Se, the capital of their kingdom. As of 174 AG, with the coronation of Wu of the Hou-Ting Dynasty, there have been fifty-four monarchs of the Earth Kingdom. However, after Kuvira attacked Republic City, King Wu decided to step down as king and abolish the monarchy in favor of independent states with elected governments akin to the political system of the United Republic of Nations, a motion for which he received the support of Avatar Korra."
    },
    {
      "body": "Traditionally, the earth monarch leaves behind all personal possessions upon ascending the throne, including their given name, and is henceforth known only as \"Your Majesty\" or by their reign number, enhancing their status as detached and sacrosanct individuals. However, this was not a universal standard, since the Earth Kings ${link_0} and Wu preferred their given names over their title, allowing even commoners to use it to address them. Traditionally, the earth monarchs are even worshiped as gods by some Earth Kingdom ${link_1}, even though their political role has historically alternated between a largely symbolic figurehead and that of an actual imperial ruler.",
      "links": [
        {
          "body": "Kuei",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuei",
            "page": "Kuei"
          }
        },
        {
          "body": "citizens",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Society_in_the_World_of_Avatar",
            "page": "Society_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Earth monarch"
      ],
      "text": "Traditionally, the earth monarch leaves behind all personal possessions upon ascending the throne, including their given name, and is henceforth known only as \"Your Majesty\" or by their reign number, enhancing their status as detached and sacrosanct individuals. However, this was not a universal standard, since the Earth Kings Kuei and Wu preferred their given names over their title, allowing even commoners to use it to address them. Traditionally, the earth monarchs are even worshiped as gods by some Earth Kingdom citizens, even though their political role has historically alternated between a largely symbolic figurehead and that of an actual imperial ruler."
    },
    {
      "body": "The relation between the monarchs and the general population was likewise subject to major changes. Some rulers like Earth King Kuei had a populist style of rule, while others like ${link_0} insisted on their sacrosanct status, caring only about their power and not their subjects. Such authoritarian styles of rule resulted in rebellion and anarchy at least twice in the Earth Kingdom's history.",
      "links": [
        {
          "body": "Hou-Ting",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hou-Ting",
            "page": "Hou-Ting"
          }
        }
      ],
      "section": [
        "Earth monarch"
      ],
      "text": "The relation between the monarchs and the general population was likewise subject to major changes. Some rulers like Earth King Kuei had a populist style of rule, while others like Hou-Ting insisted on their sacrosanct status, caring only about their power and not their subjects. Such authoritarian styles of rule resulted in rebellion and anarchy at least twice in the Earth Kingdom's history."
    },
    {
      "body": "Early Earth Kings controlled their lands personally, sometimes even brutally. This began to change under the rule of the ${link_0}. He tried to change the Earth Kingdom into a centralist empire. To achieve this goal, he used violence and oppression, causing a ${link_1} and a ${link_2} in the process. Due to these events and the intervention of Avatar ${link_3}, the Earth Kingdom was transformed into a constitutional monarchy to prevent future monarchs from abusing their power. This caused a dramatic change in the politics of the Earth Kingdom, and over time bureaucrats and local rulers used the new constitution to gather more and more power. In the process, the monarchy became stagnant and corrupt, as kings ceded or were forced to cede more and more control over the day-to-day operations to the governments and bureaucracy that sprang up around them. They traditionally made use of sixty-seven different seals, depending on the document in question.",
      "links": [
        {
          "body": "46th Earth King",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/46th_Earth_King",
            "page": "46th_Earth_King"
          }
        },
        {
          "body": "civil war",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/War_of_Chin_the_Conqueror",
            "page": "War_of_Chin_the_Conqueror"
          }
        },
        {
          "body": "peasant uprising",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Peasant_Uprising_in_Ba_Sing_Se",
            "page": "Peasant_Uprising_in_Ba_Sing_Se"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi",
            "page": "Kyoshi"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "History"
      ],
      "text": "Early Earth Kings controlled their lands personally, sometimes even brutally. This began to change under the rule of the 46th Earth King. He tried to change the Earth Kingdom into a centralist empire. To achieve this goal, he used violence and oppression, causing a civil war and a peasant uprising in the process. Due to these events and the intervention of Avatar Kyoshi, the Earth Kingdom was transformed into a constitutional monarchy to prevent future monarchs from abusing their power. This caused a dramatic change in the politics of the Earth Kingdom, and over time bureaucrats and local rulers used the new constitution to gather more and more power. In the process, the monarchy became stagnant and corrupt, as kings ceded or were forced to cede more and more control over the day-to-day operations to the governments and bureaucracy that sprang up around them. They traditionally made use of sixty-seven different seals, depending on the document in question."
    },
    {
      "body": "Due to Earth King Kuei's premature ascendancy to the throne at the age of four, the position finally declined to that of a figurehead, allowing ${link_0} ${link_1}, Kuei's regent and later adviser, to take control of the capital Ba Sing Se. The traditional rule of the Earth Kings eventually ended when the ${link_2} ${link_3} ${link_4} usurped the throne in a violent ${link_5}. The rightful Earth King Kuei was forced into exile. When the Fire Nation took control over the city by Azula's order, the usurper left a ${link_6} as a puppet ruler with the title of \"Supreme Bureaucratic Administrator of Ba Sing Se\".",
      "links": [
        {
          "body": "Grand Secretariat",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Grand_Secretariat_of_Ba_Sing_Se",
            "page": "Grand_Secretariat_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Long_Feng",
            "page": "Long_Feng"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Princess",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Azula",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        },
        {
          "body": "coup",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Joo Dee",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Joo_Dee",
            "page": "Joo_Dee"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "History"
      ],
      "text": "Due to Earth King Kuei's premature ascendancy to the throne at the age of four, the position finally declined to that of a figurehead, allowing Grand Secretariat Long Feng, Kuei's regent and later adviser, to take control of the capital Ba Sing Se. The traditional rule of the Earth Kings eventually ended when the Fire Nation Princess Azula usurped the throne in a violent coup. The rightful Earth King Kuei was forced into exile. When the Fire Nation took control over the city by Azula's order, the usurper left a Joo Dee as a puppet ruler with the title of \"Supreme Bureaucratic Administrator of Ba Sing Se\"."
    },
    {
      "body": "After the end of the century long ${link_0}, Earth King Kuei was restored on his rightful place as the leader of the Earth Kingdom. As such, he played a very important role in the execution of the ${link_1} in order to remove the Fire Nation presence in the Earth Kingdom by transferring the ${link_2} back to the Fire Nation. Kuei also reformed the Earth Kingdom government back to its original form so the monarch had full power over the government.",
      "links": [
        {
          "body": "war",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Harmony Restoration Movement",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Harmony_Restoration_Movement",
            "page": "Harmony_Restoration_Movement"
          }
        },
        {
          "body": "Fire Nation colonials",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_colonies",
            "page": "Fire_Nation_colonies"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "History"
      ],
      "text": "After the end of the century long war, Earth King Kuei was restored on his rightful place as the leader of the Earth Kingdom. As such, he played a very important role in the execution of the Harmony Restoration Movement in order to remove the Fire Nation presence in the Earth Kingdom by transferring the Fire Nation colonials back to the Fire Nation. Kuei also reformed the Earth Kingdom government back to its original form so the monarch had full power over the government."
    },
    {
      "body": "Eventually, Kuei's daughter, Hou-Ting, succeeded her father as ruler of the Earth Kingdom and allowed the Dai Li back into the capital as a force working for her. During her reign, she spent large amounts of money on personal interests, making her somewhat unpopular with her people. However, Hou-Ting was killed by ${link_0} in 171 AG and the throne remained vacant for three years. Prince Wu, Hou-Ting's great-nephew, was the next in line to succeed her, though due to the instability in the kingdom, he was forced to flee the nation and seek refuge in Republic City. He lived in the United Republic of Nations' capital for three years before being crowned the new Earth King in 174 AG. However, during his coronation, Kuvira denounced his authority and usurped power for herself, renaming the Earth Kingdom the \"Earth Empire\".",
      "links": [
        {
          "body": "Zaheer",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "History"
      ],
      "text": "Eventually, Kuei's daughter, Hou-Ting, succeeded her father as ruler of the Earth Kingdom and allowed the Dai Li back into the capital as a force working for her. During her reign, she spent large amounts of money on personal interests, making her somewhat unpopular with her people. However, Hou-Ting was killed by Zaheer in 171 AG and the throne remained vacant for three years. Prince Wu, Hou-Ting's great-nephew, was the next in line to succeed her, though due to the instability in the kingdom, he was forced to flee the nation and seek refuge in Republic City. He lived in the United Republic of Nations' capital for three years before being crowned the new Earth King in 174 AG. However, during his coronation, Kuvira denounced his authority and usurped power for herself, renaming the Earth Kingdom the \"Earth Empire\"."
    },
    {
      "body": "Wu became the ${link_0}, but he managed to stay out of harm's way and grew into his role as a leader of the people. He slowly gained the trust and faith of the people by taking the lead on the evacuation of Republic City when Kuvira attacked, helping to keep the refugees safe. After Kuvira was defeated, however, Wu made plans to step down as king and abolish the monarchy in favor of independent states with elected governments, akin to the political system of the United Republic of Nations, a motion for which he received the support of Avatar Korra.",
      "links": [
        {
          "body": "target of kidnappings",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Attempted_kidnapping_of_Prince_Wu",
            "page": "Attempted_kidnapping_of_Prince_Wu"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "History"
      ],
      "text": "Wu became the target of kidnappings, but he managed to stay out of harm's way and grew into his role as a leader of the people. He slowly gained the trust and faith of the people by taking the lead on the evacuation of Republic City when Kuvira attacked, helping to keep the refugees safe. After Kuvira was defeated, however, Wu made plans to step down as king and abolish the monarchy in favor of independent states with elected governments, akin to the political system of the United Republic of Nations, a motion for which he received the support of Avatar Korra."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Yi Ming",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Yi_Ming",
            "page": "Yi_Ming"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "Known earth monarchs"
      ],
      "text": "Yi Ming"
    },
    {
      "body": "${link_0} - c. 270 ${link_1}",
      "links": [
        {
          "body": "46th Earth King",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/46th_Earth_King",
            "page": "46th_Earth_King"
          }
        },
        {
          "body": "BG",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "Known earth monarchs"
      ],
      "text": "46th Earth King - c. 270 BG"
    },
    {
      "body": "${link_0}, 52nd Earth King - 79 - 100 AG; 100 AG - Unknown",
      "links": [
        {
          "body": "Kuei",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuei",
            "page": "Kuei"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "Known earth monarchs"
      ],
      "text": "Kuei, 52nd Earth King - 79 - 100 AG; 100 AG - Unknown"
    },
    {
      "body": "${link_0} - Spring 100 AG",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "Known earth monarchs"
      ],
      "text": "Azula - Spring 100 AG"
    },
    {
      "body": "${link_0} - Unknown - 171 AG",
      "links": [
        {
          "body": "Hou-Ting",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hou-Ting",
            "page": "Hou-Ting"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "Known earth monarchs"
      ],
      "text": "Hou-Ting - Unknown - 171 AG"
    },
    {
      "body": "${link_0} - 174 AG - Present, though moving to abolish the monarchy and split the kingdom into independent states with democratically-elected leaders.",
      "links": [
        {
          "body": "Wu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wu",
            "page": "Wu"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "Known earth monarchs"
      ],
      "text": "Wu - 174 AG - Present, though moving to abolish the monarchy and split the kingdom into independent states with democratically-elected leaders."
    },
    {
      "body": "On the wanted posters of ${link_0} issued by Hou-Ting, the \"Earth Queen\" title is written in Chinese as 土國皇后, which literally means \"The Empress of the Earth Kingdom\".",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "Trivia"
      ],
      "text": "On the wanted posters of Team Avatar issued by Hou-Ting, the \"Earth Queen\" title is written in Chinese as 土國皇后, which literally means \"The Empress of the Earth Kingdom\"."
    },
    {
      "body": "No Earth King had been to the outer wall of Ba Sing Se until Kuei ventured there with ${link_0}.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "Trivia"
      ],
      "text": "No Earth King had been to the outer wall of Ba Sing Se until Kuei ventured there with Team Avatar."
    },
    {
      "body": "A trait shared by both Earth Kings and Ancient Imperial China rulers is their yellow-colored clothing. In Ancient China, yellow was a color reserved only for the Emperor and was often associated with the gods and the element of Earth.",
      "links": [],
      "section": [
        "Earth monarch",
        "Trivia"
      ],
      "text": "A trait shared by both Earth Kings and Ancient Imperial China rulers is their yellow-colored clothing. In Ancient China, yellow was a color reserved only for the Emperor and was often associated with the gods and the element of Earth."
    },
    {
      "body": "The earth monarchs are the only leaders of one of the four nations to have never demonstrated any bending ability.",
      "links": [],
      "section": [
        "Earth monarch",
        "Trivia"
      ],
      "text": "The earth monarchs are the only leaders of one of the four nations to have never demonstrated any bending ability."
    },
    {
      "body": "${link_0} Avatar Extras for \"The Crossroads of Destiny\" on Nicktoons Network refers to Azula as \"Earth Queen Azula\", meaning that she reigned in the nation as ruler beginning from Long Feng's second incarceration and likely until she left Ba Sing Se. However, Azula was never officially crowned, and thus she can only be considered as usurper.",
      "links": [
        {
          "body": "↑",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/#cite_ref-13",
            "page": ""
          }
        }
      ],
      "section": [
        "Earth monarch",
        "Notes"
      ],
      "text": "↑ Avatar Extras for \"The Crossroads of Destiny\" on Nicktoons Network refers to Azula as \"Earth Queen Azula\", meaning that she reigned in the nation as ruler beginning from Long Feng's second incarceration and likely until she left Ba Sing Se. However, Azula was never officially crowned, and thus she can only be considered as usurper."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "See also"
      ],
      "text": "Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Council of Elders",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Council_of_Elders",
            "page": "Council_of_Elders"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "See also"
      ],
      "text": "Council of Elders"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "See also"
      ],
      "text": "Fire Lord"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Phoenix King",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Phoenix_King",
            "page": "Phoenix_King"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "See also"
      ],
      "text": "Phoenix King"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Politics in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Politics_in_the_World_of_Avatar",
            "page": "Politics_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "See also"
      ],
      "text": "Politics in the World of Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Society in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Society_in_the_World_of_Avatar",
            "page": "Society_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "See also"
      ],
      "text": "Society in the World of Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Tribal chief",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_chief",
            "page": "Tribal_chief"
          }
        }
      ],
      "section": [
        "Earth monarch",
        "See also"
      ],
      "text": "Tribal chief"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Earth_monarch",
    "file": "avatar.wikia.com/wiki/Earth_monarch.html",
    "page": "Earth_monarch",
    "title": "Earth monarch"
  }
}