{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Bending training",
      "target": {
        "href": "Category_Bending_training",
        "page": "Category_Bending_training"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Earthbending",
      "target": {
        "href": "Category_Earthbending",
        "page": "Category_Earthbending"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} was a strict ${link_1} trainer for the ${link_2}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Toph was a strict earthbending trainer for the Avatar."
    },
    {
      "body": "${link_0} training is a rigorous and serious process. Tough and rigid, masters demand perfection and persistence from their pupils. Earthbending training involves both practice of earthbending techniques and a mastery of neutral ${link_1}.",
      "links": [
        {
          "body": "Earthbending",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "jing",
          "key": "${link_1}",
          "target": {
            "href": "Jing",
            "page": "Jing"
          }
        }
      ],
      "text": "Earthbending training is a rigorous and serious process. Tough and rigid, masters demand perfection and persistence from their pupils. Earthbending training involves both practice of earthbending techniques and a mastery of neutral jing."
    },
    {
      "body": "When ${link_0} trained ${link_1} in earthbending, she used a variety of different exercises.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "When Toph trained Aang in earthbending, she used a variety of different exercises."
    },
    {
      "body": "The following exercises have multiple lessons that can be taught to even the most amateur earthbenders. Their main goal is to force the trainee to truly connect with the core of earthbending, to become \"rock-like\".",
      "links": [],
      "text": "The following exercises have multiple lessons that can be taught to even the most amateur earthbenders. Their main goal is to force the trainee to truly connect with the core of earthbending, to become \"rock-like\"."
    },
    {
      "body": "Rock armor training was especially difficult for ${link_0} to master.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Rock armor training was especially difficult for Aang to master."
    },
    {
      "body": "In this training technique, the trainer and trainee are flanked by two earthen walls bent by the trainer, who proceeds by covering themselves with stones, effectively creating a mobile \"rock armor\". It is the trainee's goal to push the \"rock dummy\" over a boundary drawn on the ground.",
      "links": [],
      "text": "In this training technique, the trainer and trainee are flanked by two earthen walls bent by the trainer, who proceeds by covering themselves with stones, effectively creating a mobile \"rock armor\". It is the trainee's goal to push the \"rock dummy\" over a boundary drawn on the ground."
    },
    {
      "body": "As the name suggests, sand punching has the trainee punch into containers that have been weighted with heavy sand. Although the payoff of learning how to better understand the earth is a necessity of the training, sand punching is liable to engender pain in those who attempt it without complete knowledge of proper earthbending.",
      "links": [],
      "text": "As the name suggests, sand punching has the trainee punch into containers that have been weighted with heavy sand. Although the payoff of learning how to better understand the earth is a necessity of the training, sand punching is liable to engender pain in those who attempt it without complete knowledge of proper earthbending."
    },
    {
      "body": "For the sand sack throw, the trainee gets into a ready position and hurls a contained number of rocks high in the sky. From here, the trainee needs to recover from the fatigue of throwing such a heavy load in enough time to catch it before it hits the ground.",
      "links": [],
      "text": "For the sand sack throw, the trainee gets into a ready position and hurls a contained number of rocks high in the sky. From here, the trainee needs to recover from the fatigue of throwing such a heavy load in enough time to catch it before it hits the ground."
    },
    {
      "body": "${link_0}'s attempt at the stone carry maze run did not go off without a hitch.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Aang's attempt at the stone carry maze run did not go off without a hitch."
    },
    {
      "body": "This exercise has the trainee multitask between supporting the weight of a boulder and avoiding craftily laid obstacles. The purpose of this exercise is to keep the trainee grounded while showing how the earth can be utilized to enhance balance.",
      "links": [],
      "text": "This exercise has the trainee multitask between supporting the weight of a boulder and avoiding craftily laid obstacles. The purpose of this exercise is to keep the trainee grounded while showing how the earth can be utilized to enhance balance."
    },
    {
      "body": "The whack-a-rock exercise is a training technique that helps teach ${link_0}. The trainer begins by bending a rock swiftly from below the ground, and the trainee is supposed to whack the rock before it is retracted just as quickly. The trainee stands blindfolded, which forces them to sense the earth through vibrations.",
      "links": [
        {
          "body": "seismic sense",
          "key": "${link_0}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        }
      ],
      "text": "The whack-a-rock exercise is a training technique that helps teach seismic sense. The trainer begins by bending a rock swiftly from below the ground, and the trainee is supposed to whack the rock before it is retracted just as quickly. The trainee stands blindfolded, which forces them to sense the earth through vibrations."
    },
    {
      "body": "It can be assumed that proper breath control is also key when learning earthbending, as in the case of ${link_0}. This theory was implied when Master ${link_1} stated that the beginner level of his earthbending training class focused on basic earthbending moves and breathing exercises.",
      "links": [
        {
          "body": "firebending",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Yu",
          "key": "${link_1}",
          "target": {
            "href": "Yu",
            "page": "Yu"
          }
        }
      ],
      "text": "It can be assumed that proper breath control is also key when learning earthbending, as in the case of firebending. This theory was implied when Master Yu stated that the beginner level of his earthbending training class focused on basic earthbending moves and breathing exercises."
    },
    {
      "body": "Toph instructed Aang to meditate so that he could listen to the earth beneath his feet. This area of training requires complete silence so that one may better understand the sounds beneath one's feet.",
      "links": [],
      "text": "Toph instructed Aang to meditate so that he could listen to the earth beneath his feet. This area of training requires complete silence so that one may better understand the sounds beneath one's feet."
    },
    {
      "body": "Another key aspect to earthbending is mastering neutral jing. This involves waiting and listening to the earth before striking. Listening to the earth allows an earthbender to calculate the surroundings cleverly and to attack with more precision. ${link_0} advised that Aang find a teacher that waited and listened before striking; this teacher ended up being Toph.",
      "links": [
        {
          "body": "Bumi",
          "key": "${link_0}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        }
      ],
      "text": "Another key aspect to earthbending is mastering neutral jing. This involves waiting and listening to the earth before striking. Listening to the earth allows an earthbender to calculate the surroundings cleverly and to attack with more precision. Bumi advised that Aang find a teacher that waited and listened before striking; this teacher ended up being Toph."
    },
    {
      "body": "${link_0} raced ${link_1} uphill in order to test the latter's ${link_2} skill.",
      "links": [
        {
          "body": "Sud",
          "key": "${link_0}",
          "target": {
            "href": "Sud",
            "page": "Sud"
          }
        },
        {
          "body": "Roku",
          "key": "${link_1}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Sud raced Roku uphill in order to test the latter's earthbending skill."
    },
    {
      "body": "Avatar ${link_0} and his teacher, ${link_1}, raced each other up a hill by propelling themselves upward on rocks using earthbending. After training in this test for a while, Roku became so swift at the race that during the time between when he finished and when his master finished, he could make tea.",
      "links": [
        {
          "body": "Roku",
          "key": "${link_0}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Sud",
          "key": "${link_1}",
          "target": {
            "href": "Sud",
            "page": "Sud"
          }
        }
      ],
      "text": "Avatar Roku and his teacher, Sud, raced each other up a hill by propelling themselves upward on rocks using earthbending. After training in this test for a while, Roku became so swift at the race that during the time between when he finished and when his master finished, he could make tea."
    },
    {
      "body": "To understand earthbending, the apprentice must first learn the concept of rooting: connecting to the underground and becoming firmly established, settled, or entrenched. The easiest way to understand rooting is to look at a strong tree and see the way that the plant is firmly connected to the ground, yet moves freely in its branches and leaves. Trees derive their great strength by rooting to the ground.",
      "links": [],
      "text": "To understand earthbending, the apprentice must first learn the concept of rooting: connecting to the underground and becoming firmly established, settled, or entrenched. The easiest way to understand rooting is to look at a strong tree and see the way that the plant is firmly connected to the ground, yet moves freely in its branches and leaves. Trees derive their great strength by rooting to the ground."
    },
    {
      "body": "When under the tutelage of Toph, Aang was taught the method of utilizing seismic sense, a sub-skill of earthbending in which one can sense the vibrations in the earth and perceive objects and characters through it. In one particular exercise, Aang donned a blindfold that impaired his vision and had to fend off various bending attacks from both Toph and ${link_0} through the use of seismic sense.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "When under the tutelage of Toph, Aang was taught the method of utilizing seismic sense, a sub-skill of earthbending in which one can sense the vibrations in the earth and perceive objects and characters through it. In one particular exercise, Aang donned a blindfold that impaired his vision and had to fend off various bending attacks from both Toph and Katara through the use of seismic sense."
    },
    {
      "body": "This earthbending academy focused on teaching students to master ${link_0}, beginning with seismic sense. Owned and operated by Toph Beifong, the academy was positioned just overlooking the ${link_1} ${link_2} of ${link_3}. The students are expected to practice their forms in order to provide a stable base for the mastery of metalbending. Its first students were ${link_4}, ${link_5}, and ${link_6}, though it soon gathered fame, attracting students from all over the nation.",
      "links": [
        {
          "body": "metalbending",
          "key": "${link_0}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "colony",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation_colonies",
            "page": "Fire_Nation_colonies"
          }
        },
        {
          "body": "Yu Dao",
          "key": "${link_3}",
          "target": {
            "href": "Yu_Dao",
            "page": "Yu_Dao"
          }
        },
        {
          "body": "Ho Tun",
          "key": "${link_4}",
          "target": {
            "href": "Ho_Tun",
            "page": "Ho_Tun"
          }
        },
        {
          "body": "The Dark One",
          "key": "${link_5}",
          "target": {
            "href": "The_Dark_One",
            "page": "The_Dark_One"
          }
        },
        {
          "body": "Penga",
          "key": "${link_6}",
          "target": {
            "href": "Penga",
            "page": "Penga"
          }
        }
      ],
      "text": "This earthbending academy focused on teaching students to master metalbending, beginning with seismic sense. Owned and operated by Toph Beifong, the academy was positioned just overlooking the Fire Nation colony of Yu Dao. The students are expected to practice their forms in order to provide a stable base for the mastery of metalbending. Its first students were Ho Tun, The Dark One, and Penga, though it soon gathered fame, attracting students from all over the nation."
    },
    {
      "body": "The students of ${link_0} are taught to strike as if they were \"striking through [their] opponent's head\".",
      "links": [
        {
          "body": "Master Yu's Earthbending Academy",
          "key": "${link_0}",
          "target": {
            "href": "Master_Yu%27s_Earthbending_Academy",
            "page": "Master_Yu%27s_Earthbending_Academy"
          }
        }
      ],
      "text": "The students of Master Yu's Earthbending Academy are taught to strike as if they were \"striking through [their] opponent's head\"."
    },
    {
      "body": "This training institution, ${link_0} in the village of ${link_1}, tutored young earthbenders in the mastery of their native element and was administered by Master Yu. One particular exercise seen involved pupils levitating boulders and speedily striking them as thought they were \"striking through [their] opponent's head\". Similar to other martial arts dojos, the system of bestowing belts based on skill and rank was practiced at the academy.",
      "links": [
        {
          "body": "located",
          "key": "${link_0}",
          "target": {
            "href": "Geography_of_the_World_of_Avatar",
            "page": "Geography_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Gaoling",
          "key": "${link_1}",
          "target": {
            "href": "Gaoling",
            "page": "Gaoling"
          }
        }
      ],
      "text": "This training institution, located in the village of Gaoling, tutored young earthbenders in the mastery of their native element and was administered by Master Yu. One particular exercise seen involved pupils levitating boulders and speedily striking them as thought they were \"striking through [their] opponent's head\". Similar to other martial arts dojos, the system of bestowing belts based on skill and rank was practiced at the academy."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Earthbending_training",
    "file": "avatar.wikia.com/wiki/Earthbending_training.html",
    "page": "Earthbending_training",
    "title": "Earthbending training"
  }
}