{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "World of Avatar",
      "target": {
        "href": "Category_World_of_Avatar",
        "page": "Category_World_of_Avatar"
      }
    }
  ],
  "facts": [
    {
      "key": "Type",
      "value": [
        {
          "body": "Economy and economic activities",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Economy and economic activities",
          "value": "Economy and economic activities",
          "value_text": "Economy and economic activities"
        }
      ]
    },
    {
      "key": "Examples",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Currency",
              "key": "${link_0}",
              "target": {
                "href": "Currency",
                "page": "Currency"
              }
            }
          ],
          "text": "Currency",
          "value": "${link_0}",
          "value_text": "Currency"
        },
        {
          "body": "Natural resources",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Natural resources",
          "value": "Natural resources",
          "value_text": "Natural resources"
        },
        {
          "body": "Trade",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Trade",
          "value": "Trade",
          "value_text": "Trade"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "All ${link_0} in the ${link_1} have, or previously had, economic systems. Of those four, the ${link_2} and the ${link_3} have developed sophisticated and advanced economic systems to facilitate and supplement their daily life. The ${link_4} and the ${link_5}, however, utilized smaller systems based on subsistence and made less impact on their surroundings.",
      "links": [
        {
          "body": "four nations",
          "key": "${link_0}",
          "target": {
            "href": "Four_nations",
            "page": "Four_nations"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_4}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Water Tribes",
          "key": "${link_5}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        }
      ],
      "text": "All four nations in the World of Avatar have, or previously had, economic systems. Of those four, the Earth Kingdom and the Fire Nation have developed sophisticated and advanced economic systems to facilitate and supplement their daily life. The Air Nomads and the Water Tribes, however, utilized smaller systems based on subsistence and made less impact on their surroundings."
    },
    {
      "body": "Most nations also developed basic ${link_0} based on precious metals. The currency of most nations can be used in others, though there are many areas that do not observe this.",
      "links": [
        {
          "body": "currency",
          "key": "${link_0}",
          "target": {
            "href": "Currency",
            "page": "Currency"
          }
        }
      ],
      "text": "Most nations also developed basic currency based on precious metals. The currency of most nations can be used in others, though there are many areas that do not observe this."
    },
    {
      "body": "The Air Nomads practiced subsistence agriculture, growing enough food and crafting enough of the necessary implements to sustain their own survival without the need to trade with others. Industrialization was also largely neglected, as the use of airbending as their principal source of power rendered machinery and vehicles largely unnecessary.",
      "links": [],
      "text": "The Air Nomads practiced subsistence agriculture, growing enough food and crafting enough of the necessary implements to sustain their own survival without the need to trade with others. Industrialization was also largely neglected, as the use of airbending as their principal source of power rendered machinery and vehicles largely unnecessary."
    },
    {
      "body": "The ${link_0} of the ${link_1} is blue in color.",
      "links": [
        {
          "body": "currency",
          "key": "${link_0}",
          "target": {
            "href": "Currency#Water_Tribes",
            "page": "Currency"
          }
        },
        {
          "body": "Water Tribes",
          "key": "${link_1}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        }
      ],
      "text": "The currency of the Water Tribes is blue in color."
    },
    {
      "body": "The Water Tribe economy is small and primarily focused on sustaining the survival of the tribe. Trade with the other nations is rare, as the Water Tribe does not have many items available for the purpose nor many opportunities for trade.",
      "links": [],
      "text": "The Water Tribe economy is small and primarily focused on sustaining the survival of the tribe. Trade with the other nations is rare, as the Water Tribe does not have many items available for the purpose nor many opportunities for trade."
    },
    {
      "body": "The Water Tribes are inherently dependent upon the oceans for a majority of their natural resources and well as the bounty of the frozen tundra. ${link_0} are a favorite, while giant sea crabs are considered a delicious delicacy to those in the Northern Sea. Squid and seaweed can be used to make a wide variety of dishes, including soup, seasoning, and even bread and cookies. Skins from seals are used to create tents, while pelts from furry animals are used as clothing and to cover barren surfaces. Naturally, hunters and fishermen of the Water Tribes are some of the best in the world in their field.",
      "links": [
        {
          "body": "Sea prunes",
          "key": "${link_0}",
          "target": {
            "href": "Sea_prune",
            "page": "Sea_prune"
          }
        }
      ],
      "text": "The Water Tribes are inherently dependent upon the oceans for a majority of their natural resources and well as the bounty of the frozen tundra. Sea prunes are a favorite, while giant sea crabs are considered a delicious delicacy to those in the Northern Sea. Squid and seaweed can be used to make a wide variety of dishes, including soup, seasoning, and even bread and cookies. Skins from seals are used to create tents, while pelts from furry animals are used as clothing and to cover barren surfaces. Naturally, hunters and fishermen of the Water Tribes are some of the best in the world in their field."
    },
    {
      "body": "Since the end of the Hundred Year War however, the Water Tribe economy has developed to a more global scale, leveraging their maritime skills to become a leading force in the international shipping industry.",
      "links": [],
      "text": "Since the end of the Hundred Year War however, the Water Tribe economy has developed to a more global scale, leveraging their maritime skills to become a leading force in the international shipping industry."
    },
    {
      "body": "One of the most prevalent natural resources of the ${link_0} is ice. Ice is used as the main building material of buildings, walls, dikes, locks, and other structures, as it is a medium of their bending. Icebending is their primary form of construction.",
      "links": [
        {
          "body": "Northern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "text": "One of the most prevalent natural resources of the Northern Water Tribe is ice. Ice is used as the main building material of buildings, walls, dikes, locks, and other structures, as it is a medium of their bending. Icebending is their primary form of construction."
    },
    {
      "body": "The Water Tribe does have a form of currency, commonly referred to as Water Tribe money by other nations.",
      "links": [],
      "text": "The Water Tribe does have a form of currency, commonly referred to as Water Tribe money by other nations."
    },
    {
      "body": "The ${link_0} of ${link_1} is a large, open farmland.",
      "links": [
        {
          "body": "Agrarian Zone",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se#Agrarian_Zone",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "The Agrarian Zone of Ba Sing Se is a large, open farmland."
    },
    {
      "body": "The Earth Kingdom has a vast economy primarily based on agriculture, incorporating significant industrial elements as well. Multiple industries, including trade, farming, and hunting, are all important activities for the economy of the nation. Despite maintaining a rural character, its vast supply of natural resources and large population have allowed it to become one of the world's most powerful economies, despite much of the Earth Kingdom being in poverty. However, poverty was more rife during the destructive ${link_0}; the Fire Nation charged heavy taxes on occupied parts of the kingdom, resulting in a decline in wealth among its populace.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "The Earth Kingdom has a vast economy primarily based on agriculture, incorporating significant industrial elements as well. Multiple industries, including trade, farming, and hunting, are all important activities for the economy of the nation. Despite maintaining a rural character, its vast supply of natural resources and large population have allowed it to become one of the world's most powerful economies, despite much of the Earth Kingdom being in poverty. However, poverty was more rife during the destructive Hundred Year War; the Fire Nation charged heavy taxes on occupied parts of the kingdom, resulting in a decline in wealth among its populace."
    },
    {
      "body": "The Earth Kingdom has a large system of commerce and trade. The west coast of the country is especially notable as an economic center, as it features many ports; the ${link_0}, in particular, was important as a hub for pirates and the black market prior to becoming ${link_1} territory. Earth Kingdom shops and stores sell a variety of products, which may conform to the specific culture and resources of the region. The complex postal system of ${link_2}, the efficient ${link_3} ${link_4} network, and various inventions and their inventors, such as the ${link_5}, all serve as indicators of the Earth Kingdom's sophisticated economy.",
      "links": [
        {
          "body": "seedy merchants pier",
          "key": "${link_0}",
          "target": {
            "href": "Seedy_merchants_pier",
            "page": "Seedy_merchants_pier"
          }
        },
        {
          "body": "United Republic of Nations",
          "key": "${link_1}",
          "target": {
            "href": "United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_2}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "monorail",
          "key": "${link_4}",
          "target": {
            "href": "Monorail",
            "page": "Monorail"
          }
        },
        {
          "body": "mechanist",
          "key": "${link_5}",
          "target": {
            "href": "Mechanist",
            "page": "Mechanist"
          }
        }
      ],
      "text": "The Earth Kingdom has a large system of commerce and trade. The west coast of the country is especially notable as an economic center, as it features many ports; the seedy merchants pier, in particular, was important as a hub for pirates and the black market prior to becoming United Republic of Nations territory. Earth Kingdom shops and stores sell a variety of products, which may conform to the specific culture and resources of the region. The complex postal system of Omashu, the efficient Ba Sing Se monorail network, and various inventions and their inventors, such as the mechanist, all serve as indicators of the Earth Kingdom's sophisticated economy."
    },
    {
      "body": "In the aftermath of the Hundred Year War, the Kingdom's mineral wealth became more pronounced as the industrialization process began to take effect around the world, making the country's rich ore deposits one of its most sought after exports.",
      "links": [],
      "text": "In the aftermath of the Hundred Year War, the Kingdom's mineral wealth became more pronounced as the industrialization process began to take effect around the world, making the country's rich ore deposits one of its most sought after exports."
    },
    {
      "body": "Just as the Water Tribe's primary building material is ice, the Earth Kingdom's primary building material is rock. Much of the infrastructure, including buildings, sewers, and even ${link_0}, are made of stone and often constructed by earthbending.",
      "links": [
        {
          "body": "trains",
          "key": "${link_0}",
          "target": {
            "href": "Train",
            "page": "Train"
          }
        }
      ],
      "text": "Just as the Water Tribe's primary building material is ice, the Earth Kingdom's primary building material is rock. Much of the infrastructure, including buildings, sewers, and even trains, are made of stone and often constructed by earthbending."
    },
    {
      "body": "A ${link_0} from the ${link_1}, the nation's least valuable form of currency.",
      "links": [
        {
          "body": "copper coin",
          "key": "${link_0}",
          "target": {
            "href": "Currency#Copper_piece",
            "page": "Currency"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "A copper coin from the Earth Kingdom, the nation's least valuable form of currency."
    },
    {
      "body": "Earth Kingdom coins are mostly round, and all have a square hole in their center which allows them to be strung together, representing the national emblem. There is no significant difference between copper and silver pieces; gold pieces, however, have four notches on their edge, giving them a flower-like shape.",
      "links": [],
      "text": "Earth Kingdom coins are mostly round, and all have a square hole in their center which allows them to be strung together, representing the national emblem. There is no significant difference between copper and silver pieces; gold pieces, however, have four notches on their edge, giving them a flower-like shape."
    },
    {
      "body": "The Fire Nation is one of the strongest economies in the world, built mostly through industry and gains in war. However, some areas were adversely affected by their country's decision-making: ${link_0}, for example, fell into poverty when the Fire Nation built a ${link_1} on the ${link_2}; almost no nourishment was available for the village's residents, and many people may have starved. The economy is based on agriculture, fishing, industry, and technology.",
      "links": [
        {
          "body": "Jang Hui",
          "key": "${link_0}",
          "target": {
            "href": "Jang_Hui",
            "page": "Jang_Hui"
          }
        },
        {
          "body": "smelting factory",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_Army_factory",
            "page": "Fire_Nation_Army_factory"
          }
        },
        {
          "body": "town's river",
          "key": "${link_2}",
          "target": {
            "href": "Jang_Hui_River",
            "page": "Jang_Hui_River"
          }
        }
      ],
      "text": "The Fire Nation is one of the strongest economies in the world, built mostly through industry and gains in war. However, some areas were adversely affected by their country's decision-making: Jang Hui, for example, fell into poverty when the Fire Nation built a smelting factory on the town's river; almost no nourishment was available for the village's residents, and many people may have starved. The economy is based on agriculture, fishing, industry, and technology."
    },
    {
      "body": "The Fire Nation employs skilled metalworkers and blacksmiths who make use of iron and other metals to engender their fortresses and warships. Utilizing coal dug out by prisoners slaving in mines, they are able to power massive furnaces. During the Hundred Year War, the initial drive for their attempts for expansion was industrializing and having a greater need for resources, in itself a staple of imperialism.",
      "links": [],
      "text": "The Fire Nation employs skilled metalworkers and blacksmiths who make use of iron and other metals to engender their fortresses and warships. Utilizing coal dug out by prisoners slaving in mines, they are able to power massive furnaces. During the Hundred Year War, the initial drive for their attempts for expansion was industrializing and having a greater need for resources, in itself a staple of imperialism."
    },
    {
      "body": "${link_0} ${link_1} are more angular than their ${link_2} counterparts.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "coins",
          "key": "${link_1}",
          "target": {
            "href": "Currency#Fire_Nation",
            "page": "Currency"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Fire Nation coins are more angular than their Earth Kingdom counterparts."
    },
    {
      "body": "Fire Nation coins are much more angular than their Earth Kingdom counterparts. They vary according to weight, size, and shape, though all have a nationalistic image on the reverse side and writing on the obverse. The copper piece is the least valuable and is a square with two concave sides. In its center is an image of a small flame. The gold piece is the longest and is mostly rectangular in shape with a long slit running from its base to a little below the top. The silver piece is the smallest and pentagonal in shape with the national emblem on one of its faces.",
      "links": [],
      "text": "Fire Nation coins are much more angular than their Earth Kingdom counterparts. They vary according to weight, size, and shape, though all have a nationalistic image on the reverse side and writing on the obverse. The copper piece is the least valuable and is a square with two concave sides. In its center is an image of a small flame. The gold piece is the longest and is mostly rectangular in shape with a long slit running from its base to a little below the top. The silver piece is the smallest and pentagonal in shape with the national emblem on one of its faces."
    },
    {
      "body": "${link_0} smiling about the amount of ${link_1} the ${link_2} earned after their win.",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "yuans",
          "key": "${link_1}",
          "target": {
            "href": "Currency#United_Republic_of_Nations",
            "page": "Currency"
          }
        },
        {
          "body": "Fire Ferrets",
          "key": "${link_2}",
          "target": {
            "href": "Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        }
      ],
      "text": "Mako smiling about the amount of yuans the Fire Ferrets earned after their win."
    },
    {
      "body": "Although the Fire Nation previously had the strongest economy in the world, ${link_0} ${link_1} and ${link_2} ${link_3} created this nation after the Hundred Year War as a place where ${link_4} and nonbenders would live in peace. Eventually, its capital, ${link_5}, boomed and the economy began to strengthen significantly.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "benders",
          "key": "${link_4}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_5}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "text": "Although the Fire Nation previously had the strongest economy in the world, Fire Lord Zuko and Avatar Aang created this nation after the Hundred Year War as a place where benders and nonbenders would live in peace. Eventually, its capital, Republic City, boomed and the economy began to strengthen significantly."
    },
    {
      "body": "The economy of the United Republic's capital, Republic City, is primarily based upon industry. In the city, rather than the traditional currency used in the other four nations, the ${link_0} is the used currency.",
      "links": [
        {
          "body": "yuan",
          "key": "${link_0}",
          "target": {
            "href": "Currency#United_Republic_of_Nations",
            "page": "Currency"
          }
        }
      ],
      "text": "The economy of the United Republic's capital, Republic City, is primarily based upon industry. In the city, rather than the traditional currency used in the other four nations, the yuan is the used currency."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Economy_in_the_World_of_Avatar",
    "file": "avatar.wikia.com/wiki/Economy_in_the_World_of_Avatar.html",
    "page": "Economy_in_the_World_of_Avatar",
    "title": "Economy in the World of Avatar"
  }
}