{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "World of Avatar",
      "target": {
        "href": "Category_World_of_Avatar",
        "page": "Category_World_of_Avatar"
      }
    }
  ],
  "facts": [
    {
      "key": "Type",
      "value": [
        {
          "body": "Types of education and institutions",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Types of education and institutions",
          "value": "Types of education and institutions",
          "value_text": "Types of education and institutions"
        }
      ]
    },
    {
      "key": "Examples",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Ba Sing Se University",
              "key": "${link_0}",
              "target": {
                "href": "Ba_Sing_Se_University",
                "page": "Ba_Sing_Se_University"
              }
            }
          ],
          "text": "Ba Sing Se University",
          "value": "${link_0}",
          "value_text": "Ba Sing Se University"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Fire Nation school",
              "key": "${link_0}",
              "target": {
                "href": "Fire_Nation_school",
                "page": "Fire_Nation_school"
              }
            }
          ],
          "text": "Fire Nation school",
          "value": "${link_0}",
          "value_text": "Fire Nation school"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Throughout the ${link_0}, formal education is a central aspect of society. The importance of learning is especially emphasized among the ${link_1} of the ${link_2}, and to a lesser extent, by some people in ${link_3}.",
      "links": [
        {
          "body": "World of Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "upper class",
          "key": "${link_1}",
          "target": {
            "href": "Society_in_the_World_of_Avatar#Fire_Sages.2C_nobles.2C_and_high_ranking_military_officials",
            "page": "Society_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "Throughout the World of Avatar, formal education is a central aspect of society. The importance of learning is especially emphasized among the upper class of the Fire Nation, and to a lesser extent, by some people in Ba Sing Se."
    },
    {
      "body": "Spiritual enlightenment was central to the ${link_0} culture, as all of its members regularly meditated, in addition to practicing ${link_1}. Furthermore, they were taught to value all forms of life and considered it to be sacred, regardless of whether it was good or evil. For children, there existed the Air Scouts, an organization that taught young Air Nomads several useful skills, such as how to tie proper knots around the horns of a ${link_2}.",
      "links": [
        {
          "body": "Air Nomad",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "airbending",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "sky bison",
          "key": "${link_2}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        }
      ],
      "text": "Spiritual enlightenment was central to the Air Nomad culture, as all of its members regularly meditated, in addition to practicing airbending. Furthermore, they were taught to value all forms of life and considered it to be sacred, regardless of whether it was good or evil. For children, there existed the Air Scouts, an organization that taught young Air Nomads several useful skills, such as how to tie proper knots around the horns of a sky bison."
    },
    {
      "body": "${link_0} huts are used in the ${link_1} to teach young girls how to heal using their ${link_2} abilities.",
      "links": [
        {
          "body": "Healing",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_2}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Healing huts are used in the Northern Water Tribe to teach young girls how to heal using their waterbending abilities."
    },
    {
      "body": "Besides basic skills such as reading and writing, a ${link_0}'s battlefield skills are also highly valued, as the city maintains a fairly large army and armory. ${link_1} is also regularly taught, with waterbenders like Master ${link_2} instructing and testing male waterbending students during regular dueling sessions, and female waterbenders frequently attending ${link_3} classes. Prior to the end of the ${link_4}, female waterbenders in the North were forbidden from learning any techniques beyond healing.",
      "links": [
        {
          "body": "warrior",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        },
        {
          "body": "Waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Pakku",
          "key": "${link_2}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "healing",
          "key": "${link_3}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_4}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "Besides basic skills such as reading and writing, a warrior's battlefield skills are also highly valued, as the city maintains a fairly large army and armory. Waterbending is also regularly taught, with waterbenders like Master Pakku instructing and testing male waterbending students during regular dueling sessions, and female waterbenders frequently attending healing classes. Prior to the end of the Hundred Year War, female waterbenders in the North were forbidden from learning any techniques beyond healing."
    },
    {
      "body": "Prior to its ${link_0} at the hands of the Fire Nation, the ${link_1} hosted regular classes for its students, as the tribe once consisted of several large walled villages. Unlike the North Pole, it also regularly taught waterbending to members of both sexes, and gender discrimination was not an issue for budding benders. Sadly, this art was virtually lost when the Fire Nation killed or captured the South Pole's entire waterbender population, except for ${link_2}. Like the North, the South maintains a strong regard for its warrior culture. In spite of the South's dire state and its lack of contact with the outside world, the South's tribesmen are quite literate, as ${link_3} and Katara were capable of both reading and writing without any difficulty.",
      "links": [
        {
          "body": "near-destruction",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_3}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Prior to its near-destruction at the hands of the Fire Nation, the Southern Water Tribe hosted regular classes for its students, as the tribe once consisted of several large walled villages. Unlike the North Pole, it also regularly taught waterbending to members of both sexes, and gender discrimination was not an issue for budding benders. Sadly, this art was virtually lost when the Fire Nation killed or captured the South Pole's entire waterbender population, except for Katara. Like the North, the South maintains a strong regard for its warrior culture. In spite of the South's dire state and its lack of contact with the outside world, the South's tribesmen are quite literate, as Sokka and Katara were capable of both reading and writing without any difficulty."
    },
    {
      "body": "${link_0} is a highly renowned institution of higher learning in the ${link_1}.",
      "links": [
        {
          "body": "Ba Sing Se University",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se_University",
            "page": "Ba_Sing_Se_University"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Ba Sing Se University is a highly renowned institution of higher learning in the Earth Kingdom."
    },
    {
      "body": "One of the most renowned institutions in the ${link_0} is ${link_1}, where young scholars attend a variety of typical college-level classes such as anthropology. However, during the ${link_2}, teachings on the Hundred Year War were strictly forbidden in the university, as displayed by ${link_3} when she silenced ${link_4} who was asked about the conflict by ${link_5}. At the peak of the ${link_6}'s power, public knowledge of the War was forbidden in the city as a whole.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Ba Sing Se University",
          "key": "${link_1}",
          "target": {
            "href": "Ba_Sing_Se_University",
            "page": "Ba_Sing_Se_University"
          }
        },
        {
          "body": "Conspiracy of Ba Sing Se",
          "key": "${link_2}",
          "target": {
            "href": "Conspiracy_of_Ba_Sing_Se",
            "page": "Conspiracy_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Joo Dee",
          "key": "${link_3}",
          "target": {
            "href": "Joo_Dee",
            "page": "Joo_Dee"
          }
        },
        {
          "body": "a student",
          "key": "${link_4}",
          "target": {
            "href": "Ba_Sing_Se_University_student",
            "page": "Ba_Sing_Se_University_student"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_5}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_6}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "One of the most renowned institutions in the Earth Kingdom is Ba Sing Se University, where young scholars attend a variety of typical college-level classes such as anthropology. However, during the Conspiracy of Ba Sing Se, teachings on the Hundred Year War were strictly forbidden in the university, as displayed by Joo Dee when she silenced a student who was asked about the conflict by Team Avatar. At the peak of the Dai Li's power, public knowledge of the War was forbidden in the city as a whole."
    },
    {
      "body": "A ${link_0} was visited by ${link_1} in 100 ${link_2}.",
      "links": [
        {
          "body": "Fire Nation school",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_school",
            "page": "Fire_Nation_school"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "AG",
          "key": "${link_2}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "A Fire Nation school was visited by Aang in 100 AG."
    },
    {
      "body": "In the Fire Nation, education was strict during the Hundred Year War and was often oriented toward the ultimate goal of indoctrinating the student population in the country's politics. There were few forms of personal expression, as such actions were considered a threat to the ${link_0}'s unquestioned authority during the War. Many common arts such as dancing were thus omitted from the school curriculum. There was also very strict censoring to make the students believe that the Fire Nation's war against the other nations was in fact a justified one, as ${link_1}'s official reasoning for the Hundred Year War was to spread his nation's prosperity to others. At the beginning of every day, the students must stand up and pledge loyalty to the Fire Lord, promising to serve him for as long as they live. The Fire Nation also altered certain aspects of historical events to make it seem as though they were fighting for the greater good. For example, a school textbook stated that the Air Nomads used military force to repel ${link_2}, although the society had no such ${link_3}. The authorities also fostered the impression that Fire Nation history began with Sozin's ascension, as Sozin had forbidden all knowledge of their history prior to his reign to be shared with the people.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_1}",
          "target": {
            "href": "Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "Fire Nation attacks",
          "key": "${link_2}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "organization",
          "key": "${link_3}",
          "target": {
            "href": "Organizations_in_the_World_of_Avatar",
            "page": "Organizations_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "In the Fire Nation, education was strict during the Hundred Year War and was often oriented toward the ultimate goal of indoctrinating the student population in the country's politics. There were few forms of personal expression, as such actions were considered a threat to the Fire Lord's unquestioned authority during the War. Many common arts such as dancing were thus omitted from the school curriculum. There was also very strict censoring to make the students believe that the Fire Nation's war against the other nations was in fact a justified one, as Sozin's official reasoning for the Hundred Year War was to spread his nation's prosperity to others. At the beginning of every day, the students must stand up and pledge loyalty to the Fire Lord, promising to serve him for as long as they live. The Fire Nation also altered certain aspects of historical events to make it seem as though they were fighting for the greater good. For example, a school textbook stated that the Air Nomads used military force to repel Fire Nation attacks, although the society had no such organization. The authorities also fostered the impression that Fire Nation history began with Sozin's ascension, as Sozin had forbidden all knowledge of their history prior to his reign to be shared with the people."
    },
    {
      "body": "Education, especially military knowledge, is also valued for the children of the ${link_0}, as shown in ${link_1} ${link_2} and Prince ${link_3}'s case.",
      "links": [
        {
          "body": "Fire Nation Royal Family",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_Royal_Family",
            "page": "Fire_Nation_Royal_Family"
          }
        },
        {
          "body": "Princess",
          "key": "${link_1}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Azula",
          "key": "${link_2}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_3}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Education, especially military knowledge, is also valued for the children of the Fire Nation Royal Family, as shown in Princess Azula and Prince Zuko's case."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Education_in_the_World_of_Avatar",
    "file": "avatar.wikia.com/wiki/Education_in_the_World_of_Avatar.html",
    "page": "Education_in_the_World_of_Avatar",
    "title": "Education in the World of Avatar"
  }
}