{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Events",
      "target": {
        "external": false,
        "href": "/wiki/Category_Events",
        "page": "Category_Events"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The era of Raava encompasses the time period prior to the beginning of the ${link_0} around 9,829 ${link_1}, when ${link_2} became the first ${link_3}.",
      "links": [
        {
          "body": "Avatar Cycle",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_Cycle",
            "page": "Avatar"
          }
        },
        {
          "body": "BG",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Wan",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Wan",
            "page": "Wan"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "Era of Raava"
      ],
      "text": "The era of Raava encompasses the time period prior to the beginning of the Avatar Cycle around 9,829 BG, when Wan became the first Avatar."
    },
    {
      "body": "Before the era of ${link_0}, ${link_1} broke through the barriers that separated the ${link_2} and ${link_3} worlds. With no boundary keeping the two worlds apart, spirits freely passed from their world through the spirit portals located at the poles and began residing in the physical world, resulting in almost all the lands of the world becoming the ${link_4}. Humans, who once lived together, split apart to seek shelter and protection on the backs of ${link_5}. Over time, most accounts of this era were lost in history and many humans forgot that other communities of people existed other than those that shared their lion turtle.",
      "links": [
        {
          "body": "Raava",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Raava",
            "page": "Raava"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "mortal",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "spiritual",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Spirit Wilds",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "lion turtles",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Lion_turtle",
            "page": "Lion_turtle"
          }
        }
      ],
      "section": [
        "Era of Raava",
        "History"
      ],
      "text": "Before the era of Raava, Vaatu broke through the barriers that separated the mortal and spiritual worlds. With no boundary keeping the two worlds apart, spirits freely passed from their world through the spirit portals located at the poles and began residing in the physical world, resulting in almost all the lands of the world becoming the Spirit Wilds. Humans, who once lived together, split apart to seek shelter and protection on the backs of lion turtles. Over time, most accounts of this era were lost in history and many humans forgot that other communities of people existed other than those that shared their lion turtle."
    },
    {
      "body": "When humans sought food, they left the protection of their settlements and ventured into the Spirit Wilds. For protection, they were granted control over the element their lion turtle was affiliated with, with the power being theirs to keep until they returned to the cities.",
      "links": [],
      "section": [
        "Era of Raava",
        "History"
      ],
      "text": "When humans sought food, they left the protection of their settlements and ventured into the Spirit Wilds. For protection, they were granted control over the element their lion turtle was affiliated with, with the power being theirs to keep until they returned to the cities."
    },
    {
      "body": "Spirits and man did not warmly welcome each other. With the exception of the predecessors of the ${link_0}, humans would attack spirits and hunt animals for food. Likewise, spirits would possess and disfigure humans, and even kill them if they inhabited their bodies long enough. The humans' only refuges were the lion turtles, of whom the spirits were wary or even respectful.",
      "links": [
        {
          "body": "Air Nomads",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "section": [
        "Era of Raava",
        "History",
        "Tension with the Spirits"
      ],
      "text": "Spirits and man did not warmly welcome each other. With the exception of the predecessors of the Air Nomads, humans would attack spirits and hunt animals for food. Likewise, spirits would possess and disfigure humans, and even kill them if they inhabited their bodies long enough. The humans' only refuges were the lion turtles, of whom the spirits were wary or even respectful."
    },
    {
      "body": "During a trip to the Spirit Wilds from the fire lion turtle, a young man named Wan stole the art of ${link_0} from the lion turtle in order to use the power to steal food from the rich and give to the poor. He was eventually captured by the ${link_1} and sent to the fire lion turtle to be stripped of the sacred art. The fire lion turtle relented and allowed Wan to keep the art in order to defend himself in the Spirit Wilds, where he was perpetually banished for his actions.",
      "links": [
        {
          "body": "fire",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Chou brothers",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Chou_family",
            "page": "Chou_family"
          }
        }
      ],
      "section": [
        "Era of Raava",
        "History",
        "Tension with the Spirits"
      ],
      "text": "During a trip to the Spirit Wilds from the fire lion turtle, a young man named Wan stole the art of fire from the lion turtle in order to use the power to steal food from the rich and give to the poor. He was eventually captured by the Chou brothers and sent to the fire lion turtle to be stripped of the sacred art. The fire lion turtle relented and allowed Wan to keep the art in order to defend himself in the Spirit Wilds, where he was perpetually banished for his actions."
    },
    {
      "body": "Wan arrived at a spirit oasis, which was guarded by the ${link_0}, but was refused entry due to the spirit's dislike of humans. After witnessing Wan rescue ${link_1} from human hunters, however, the aye-aye spirit agreed to let Wan drink from his oasis, dubbing him \"Stinky\".",
      "links": [
        {
          "body": "aye-aye spirit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aye-aye_spirit",
            "page": "Aye-aye_spirit"
          }
        },
        {
          "body": "Mula",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mula",
            "page": "Mula"
          }
        }
      ],
      "section": [
        "Era of Raava",
        "History",
        "Tension with the Spirits"
      ],
      "text": "Wan arrived at a spirit oasis, which was guarded by the aye-aye spirit, but was refused entry due to the spirit's dislike of humans. After witnessing Wan rescue Mula from human hunters, however, the aye-aye spirit agreed to let Wan drink from his oasis, dubbing him \"Stinky\"."
    },
    {
      "body": "Throughout his exile, Wan learned how to perfect the art of firebending with the help of a ${link_0}, using a technique which would eventually be known as the ${link_1} firebending form.",
      "links": [
        {
          "body": "dragon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon",
            "page": "Dragon"
          }
        },
        {
          "body": "Dancing Dragon",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Dancing_Dragon",
            "page": "Dancing_Dragon"
          }
        }
      ],
      "section": [
        "Era of Raava",
        "History",
        "Tension with the Spirits"
      ],
      "text": "Throughout his exile, Wan learned how to perfect the art of firebending with the help of a dragon, using a technique which would eventually be known as the Dancing Dragon firebending form."
    },
    {
      "body": "During his search for the other lion turtle cities, Wan encountered two ancient spirits battling one another. Unaware of the nature of their conflict, Wan was tricked by Vaatu, the spirit of chaos and darkness, into helping him escape from Raava, the spirit of light and peace. To compensate for his mistake, Wan teamed up with Raava in an attempt to defeat Vaatu, as the dark spirit grew stronger due to spreading chaos, whereas Raava became weaker. Under Raava's tutelage, Wan mastered the four elements before the ${link_0}. Right before the Harmonic Convergence happened, Wan challenged Vaatu in Raava's name. The dark spirit proved to be too powerful for him, and in an attempt to turn the tide, Wan called upon Raava to merge with him. However, Raava's presence in Wan's body put him under a lot of strain, enabling Vaatu to pin him down. When the planets aligned, signaling the moment of the Harmonic Convergence, Wan permanently merged with Raava's spirit, creating the Avatar Spirit. With his new power, he managed to imprison Vaatu in the ${link_1} and, after directing all of the spirits back to their world, close the spirit portals so no human would be able to physically enter the Spirit World again and free Vaatu.",
      "links": [
        {
          "body": "Harmonic Convergence",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "Tree of Time",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "section": [
        "Era of Raava",
        "History",
        "Harmonic Convergence"
      ],
      "text": "During his search for the other lion turtle cities, Wan encountered two ancient spirits battling one another. Unaware of the nature of their conflict, Wan was tricked by Vaatu, the spirit of chaos and darkness, into helping him escape from Raava, the spirit of light and peace. To compensate for his mistake, Wan teamed up with Raava in an attempt to defeat Vaatu, as the dark spirit grew stronger due to spreading chaos, whereas Raava became weaker. Under Raava's tutelage, Wan mastered the four elements before the Harmonic Convergence. Right before the Harmonic Convergence happened, Wan challenged Vaatu in Raava's name. The dark spirit proved to be too powerful for him, and in an attempt to turn the tide, Wan called upon Raava to merge with him. However, Raava's presence in Wan's body put him under a lot of strain, enabling Vaatu to pin him down. When the planets aligned, signaling the moment of the Harmonic Convergence, Wan permanently merged with Raava's spirit, creating the Avatar Spirit. With his new power, he managed to imprison Vaatu in the Tree of Time and, after directing all of the spirits back to their world, close the spirit portals so no human would be able to physically enter the Spirit World again and free Vaatu."
    },
    {
      "body": "With the creation of the Avatar Spirit, the era of Raava came to an end and the era of the Avatar began. In acknowledgement of this new beginning, the lion turtles renounced their duty as mankind's protectors, stating they would no longer grant humans bending.",
      "links": [],
      "section": [
        "Era of Raava",
        "History",
        "Harmonic Convergence"
      ],
      "text": "With the creation of the Avatar Spirit, the era of Raava came to an end and the era of the Avatar began. In acknowledgement of this new beginning, the lion turtles renounced their duty as mankind's protectors, stating they would no longer grant humans bending."
    },
    {
      "body": "The inhabitants of air-bestowing lion turtle cities had similar tattoos as the later Air Nomads, only different in the fact that they did not end with arrows, but in a \"t\"-shape with a small blue dot.",
      "links": [],
      "section": [
        "Era of Raava",
        "Trivia"
      ],
      "text": "The inhabitants of air-bestowing lion turtle cities had similar tattoos as the later Air Nomads, only different in the fact that they did not end with arrows, but in a \"t\"-shape with a small blue dot."
    },
    {
      "body": "During the era of Raava, the term \"bending\" was not yet used to refer to the ability to manipulate the elements; those who lived during the era merely referred to it as \"power\".",
      "links": [],
      "section": [
        "Era of Raava",
        "Trivia"
      ],
      "text": "During the era of Raava, the term \"bending\" was not yet used to refer to the ability to manipulate the elements; those who lived during the era merely referred to it as \"power\"."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Era_of_Raava",
    "file": "avatar.wikia.com/wiki/Era_of_Raava.html",
    "page": "Era_of_Raava",
    "title": "Era of Raava"
  }
}