{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Online games",
      "target": {
        "href": "Category_Online_games",
        "page": "Category_Online_games"
      }
    },
    {
      "body": "Real world",
      "target": {
        "href": "Category_Real_world",
        "page": "Category_Real_world"
      }
    },
    {
      "body": "Video games",
      "target": {
        "href": "Category_Video_games",
        "page": "Category_Video_games"
      }
    }
  ],
  "facts": [
    {
      "key": "Publishers",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Nickelodeon",
              "key": "${link_0}",
              "target": {
                "href": "Nickelodeon",
                "page": "Nickelodeon"
              }
            }
          ],
          "text": "Nickelodeon",
          "value": "${link_0}",
          "value_text": "Nickelodeon"
        }
      ]
    },
    {
      "key": "Genre(s)",
      "value": [
        {
          "body": "Narrative",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Narrative",
          "value": "Narrative",
          "value_text": "Narrative"
        },
        {
          "body": "Puzzle",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Puzzle",
          "value": "Puzzle",
          "value_text": "Puzzle"
        }
      ]
    },
    {
      "key": "Company",
      "value": [
        {
          "body": "Nickelodeon",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Nickelodeon",
          "value": "Nickelodeon",
          "value_text": "Nickelodeon"
        }
      ]
    },
    {
      "key": "Platform(s)",
      "value": [
        {
          "body": "Internet",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Internet",
          "value": "Internet",
          "value_text": "Internet"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Escape from the Spirit World is a canonical online game meant to explain the events between the end of ${link_0} and the start of ${link_1}.",
      "links": [
        {
          "body": "Book Two: Earth",
          "key": "${link_0}",
          "target": {
            "href": "Book_Two__Earth",
            "page": "Book_Two__Earth"
          }
        },
        {
          "body": "Book Three: Fire",
          "key": "${link_1}",
          "target": {
            "href": "Book_Three__Fire",
            "page": "Book_Three__Fire"
          }
        }
      ],
      "text": "Escape from the Spirit World is a canonical online game meant to explain the events between the end of Book Two: Earth and the start of Book Three: Fire."
    },
    {
      "body": "After being shot by ${link_0}'s lethal ${link_1}, ${link_2} falls into a deep slumber. Escape from the Spirit World explains that while Aang's mind and body were immobile, his soul was trapped in the ${link_3}. He encounters ${link_4} ${link_5}, the Moon Spirit, who informs him that if he does not reconnect with his past four lives, the ${link_6} will end.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "lightning attack",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Princess",
          "key": "${link_4}",
          "target": {
            "href": "Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_5}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Avatar Cycle",
          "key": "${link_6}",
          "target": {
            "href": "Avatar#Avatar_Cycle",
            "page": "Avatar"
          }
        }
      ],
      "text": "After being shot by Azula's lethal lightning attack, Aang falls into a deep slumber. Escape from the Spirit World explains that while Aang's mind and body were immobile, his soul was trapped in the Spirit World. He encounters Princess Yue, the Moon Spirit, who informs him that if he does not reconnect with his past four lives, the Avatar Cycle will end."
    },
    {
      "body": "Each chapter follows the same pattern. The completion of a small task will trigger the appearance of a spirit. The spirit will provide information about the whereabouts of the Avatar currently being sought out. Afterward, the player will encounter ${link_0}, the Face Stealer. He will ask a question. If the user provides the wrong answer, Aang will be unable to restrain his fear, and Koh will manage to steal his face. However, if the question is answered correctly, the player can proceed and is given directions to the location of the next ${link_1}. From here on, a code is needed to progress. Although the codes were originally meant to be collected while watching the ${link_2} Saturday programs, they are listed below. Once the correct code is entered, the player can either download the podcast or watch the online comic book of Aang encountering one of his four past lives.",
      "links": [
        {
          "body": "Koh",
          "key": "${link_0}",
          "target": {
            "href": "Koh",
            "page": "Koh"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Nickelodeon",
          "key": "${link_2}",
          "target": {
            "href": "Nickelodeon",
            "page": "Nickelodeon"
          }
        }
      ],
      "text": "Each chapter follows the same pattern. The completion of a small task will trigger the appearance of a spirit. The spirit will provide information about the whereabouts of the Avatar currently being sought out. Afterward, the player will encounter Koh, the Face Stealer. He will ask a question. If the user provides the wrong answer, Aang will be unable to restrain his fear, and Koh will manage to steal his face. However, if the question is answered correctly, the player can proceed and is given directions to the location of the next Avatar. From here on, a code is needed to progress. Although the codes were originally meant to be collected while watching the Nickelodeon Saturday programs, they are listed below. Once the correct code is entered, the player can either download the podcast or watch the online comic book of Aang encountering one of his four past lives."
    },
    {
      "body": "To start off, the first small task is to collect ${link_0}. To complete the task, the player must simply click and drag the fireflies into the nearby torch. This causes ${link_1}, ${link_2}'s faithful animal guide, to appear. Fang will offer to guide Aang to Avatar Roku, through means of a challenge: the game ${link_3}. Koh will subsequently appear and will only allow safe passage if the following question is answered correctly.",
      "links": [
        {
          "body": "fireflies",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_World_firefly",
            "page": "Spirit_World_firefly"
          }
        },
        {
          "body": "Fang",
          "key": "${link_1}",
          "target": {
            "href": "Fang",
            "page": "Fang"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Aang On!",
          "key": "${link_3}",
          "target": {
            "href": "Aang_On%21",
            "page": "Aang_On%21"
          }
        }
      ],
      "text": "To start off, the first small task is to collect fireflies. To complete the task, the player must simply click and drag the fireflies into the nearby torch. This causes Fang, Roku's faithful animal guide, to appear. Fang will offer to guide Aang to Avatar Roku, through means of a challenge: the game Aang On!. Koh will subsequently appear and will only allow safe passage if the following question is answered correctly."
    },
    {
      "body": "\"Where did Aang, along with his friends ${link_0} and ${link_1}, first learn about the past Avatars?\"",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "\"Where did Aang, along with his friends Katara and Sokka, first learn about the past Avatars?\""
    },
    {
      "body": "A) Southern Air Temple",
      "links": [],
      "text": "A) Southern Air Temple"
    },
    {
      "body": "B) Northern Air Temple",
      "links": [],
      "text": "B) Northern Air Temple"
    },
    {
      "body": "C) Western water Fortress",
      "links": [],
      "text": "C) Western water Fortress"
    },
    {
      "body": "D) Northeastern earth Mound",
      "links": [],
      "text": "D) Northeastern earth Mound"
    },
    {
      "body": "The correct answer is the Southern Air Temple. Koh will subsequently allow Aang to pass and instructs him to follow the fire geysers. The code needed to pass is PATHIK. Once it is entered, the player may download the podcast or watch the online comic book of Aang encountering Avatar Roku.",
      "links": [],
      "text": "The correct answer is the Southern Air Temple. Koh will subsequently allow Aang to pass and instructs him to follow the fire geysers. The code needed to pass is PATHIK. Once it is entered, the player may download the podcast or watch the online comic book of Aang encountering Avatar Roku."
    },
    {
      "body": "${link_0} ${link_1} forces himself into the ${link_2}.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Roku",
          "key": "${link_1}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "Avatar Roku forces himself into the Avatar State."
    },
    {
      "body": "Aang explains his extreme shame at failing to master the ${link_0}. However, Avatar Roku consoles him, explaining that he too had problems with mastering the Avatar State. He tells of how he unsuccessfully attempted to master the state by learning from ${link_1} ${link_2}, grandfather of ${link_3}. His impatience urged him to seek other ways to master the Avatar State, and his plan involved harnessing energy from the sun during the ${link_4}. On the day of the solstice, he aligned his eyes with a beam of light coming from the sun; the method initially proved to be a success, but Roku was stuck in the Avatar State as a result of the overwhelming power he received. He ended up destroying the top half of the Avatar Temple on ${link_5}. Kaja, however, was wise and knew how to remove Roku from the Avatar State. Roku uses this story to explain to Aang that mastering the Avatar State is very difficult, and he should not feel so ashamed. He subsequently tells Aang to meet with ${link_6} ${link_7}, whom he will find at the lair of ${link_8}.",
      "links": [
        {
          "body": "Avatar State",
          "key": "${link_0}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Fire Sage",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Kaja",
          "key": "${link_2}",
          "target": {
            "href": "Kaja",
            "page": "Kaja"
          }
        },
        {
          "body": "Shyu",
          "key": "${link_3}",
          "target": {
            "href": "Shyu",
            "page": "Shyu"
          }
        },
        {
          "body": "winter solstice",
          "key": "${link_4}",
          "target": {
            "href": "Winter_solstice",
            "page": "Winter_solstice"
          }
        },
        {
          "body": "Crescent Island",
          "key": "${link_5}",
          "target": {
            "href": "Crescent_Island",
            "page": "Crescent_Island"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_6}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_7}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        },
        {
          "body": "Hei Bai",
          "key": "${link_8}",
          "target": {
            "href": "Hei_Bai",
            "page": "Hei_Bai"
          }
        }
      ],
      "text": "Aang explains his extreme shame at failing to master the Avatar State. However, Avatar Roku consoles him, explaining that he too had problems with mastering the Avatar State. He tells of how he unsuccessfully attempted to master the state by learning from Fire Sage Kaja, grandfather of Shyu. His impatience urged him to seek other ways to master the Avatar State, and his plan involved harnessing energy from the sun during the winter solstice. On the day of the solstice, he aligned his eyes with a beam of light coming from the sun; the method initially proved to be a success, but Roku was stuck in the Avatar State as a result of the overwhelming power he received. He ended up destroying the top half of the Avatar Temple on Crescent Island. Kaja, however, was wise and knew how to remove Roku from the Avatar State. Roku uses this story to explain to Aang that mastering the Avatar State is very difficult, and he should not feel so ashamed. He subsequently tells Aang to meet with Avatar Kyoshi, whom he will find at the lair of Hei Bai."
    },
    {
      "body": "The second task begins with several small holes in the sides of trees and rocks. Every so often, a pair of yellow glowing eyes will appear, and the player must click them before they vanish. An efficient technique is to keep the mouse hovering over one of the holes until the yellow eyes appear. The completion of this task will trigger the appearance of a strange bear-like spirit, who will direct the player to Avatar Kyoshi. The game on this level is ${link_0}. Koh will appear once again, with the following question.",
      "links": [
        {
          "body": "Four Nations Tournament",
          "key": "${link_0}",
          "target": {
            "href": "Four_Nations_Tournament",
            "page": "Four_Nations_Tournament"
          }
        }
      ],
      "text": "The second task begins with several small holes in the sides of trees and rocks. Every so often, a pair of yellow glowing eyes will appear, and the player must click them before they vanish. An efficient technique is to keep the mouse hovering over one of the holes until the yellow eyes appear. The completion of this task will trigger the appearance of a strange bear-like spirit, who will direct the player to Avatar Kyoshi. The game on this level is Four Nations Tournament. Koh will appear once again, with the following question."
    },
    {
      "body": "\"What is the name of the spirit that looks like a panda?\"",
      "links": [],
      "text": "\"What is the name of the spirit that looks like a panda?\""
    },
    {
      "body": "A) Hei Bai",
      "links": [],
      "text": "A) Hei Bai"
    },
    {
      "body": "B) Bai Bai",
      "links": [],
      "text": "B) Bai Bai"
    },
    {
      "body": "C) Flai Bai",
      "links": [],
      "text": "C) Flai Bai"
    },
    {
      "body": "D) Wai Bai",
      "links": [],
      "text": "D) Wai Bai"
    },
    {
      "body": "The correct answer is Hei Bai. Once again, Koh will grant passage after the question is answered. The code for this chapter is BOSCO. Once it is entered, the player may download the podcast or watch the online comic book of Aang encountering Avatar Kyoshi.",
      "links": [],
      "text": "The correct answer is Hei Bai. Once again, Koh will grant passage after the question is answered. The code for this chapter is BOSCO. Once it is entered, the player may download the podcast or watch the online comic book of Aang encountering Avatar Kyoshi."
    },
    {
      "body": "${link_0} ${link_1} trains the ${link_2}, something she later came to regret.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_2}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "Avatar Kyoshi trains the Dai Li, something she later came to regret."
    },
    {
      "body": "Aang finds Hei Bai, the spirit of ${link_0}, who takes Aang to Avatar Kyoshi. She apologizes for the events in ${link_1} and explains how after she defeated ${link_2} the Conqueror, balance was restored. However, she informs Aang that she also made some mistakes, and that one of her greatest challenges was dealing with the ${link_3}. The peasants felt that the ${link_4}'s rule was outdated, and that he no longer represented the people's desires and wishes. The 46th Earth King summoned Avatar Kyoshi to the Royal Palace and ordered her to deal with the problem by any means necessary. When she refused, he ordered her immediate arrest. With little difficulty, Kyoshi resisted the Earth King's forces and admonished the king for defying the Avatar. He agreed to make a compromise: he would listen to the peasants' wishes, and in return, Kyoshi would assemble a group to uphold and protect the cultural heritage of ${link_5}. Immediately, she went on to train a group of elite ${link_6}, who later became known as the ${link_7}. Aang is shocked by the revelation that an Avatar trained the Dai Li, stating that they are \"the worst, most corrupt earthbenders in the ${link_8}\". Avatar Kyoshi explains how she thought it was a wise decision at the time, but adds that all actions have an effect, whether positive or negative, for many lifetimes. She subsequently instructs Aang to find the ${link_9} Avatar who came before her, ${link_10}.",
      "links": [
        {
          "body": "Senlin Forest",
          "key": "${link_0}",
          "target": {
            "href": "Senlin_Forest",
            "page": "Senlin_Forest"
          }
        },
        {
          "body": "Chin Village",
          "key": "${link_1}",
          "target": {
            "href": "Chin_Village",
            "page": "Chin_Village"
          }
        },
        {
          "body": "Chin",
          "key": "${link_2}",
          "target": {
            "href": "Chin",
            "page": "Chin"
          }
        },
        {
          "body": "Peasant Uprising in Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "href": "Peasant_Uprising_in_Ba_Sing_Se",
            "page": "Peasant_Uprising_in_Ba_Sing_Se"
          }
        },
        {
          "body": "46th Earth King",
          "key": "${link_4}",
          "target": {
            "href": "46th_Earth_King",
            "page": "46th_Earth_King"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_5}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "earthbenders",
          "key": "${link_6}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_7}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "world",
          "key": "${link_8}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_9}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Kuruk",
          "key": "${link_10}",
          "target": {
            "href": "Kuruk",
            "page": "Kuruk"
          }
        }
      ],
      "text": "Aang finds Hei Bai, the spirit of Senlin Forest, who takes Aang to Avatar Kyoshi. She apologizes for the events in Chin Village and explains how after she defeated Chin the Conqueror, balance was restored. However, she informs Aang that she also made some mistakes, and that one of her greatest challenges was dealing with the Peasant Uprising in Ba Sing Se. The peasants felt that the 46th Earth King's rule was outdated, and that he no longer represented the people's desires and wishes. The 46th Earth King summoned Avatar Kyoshi to the Royal Palace and ordered her to deal with the problem by any means necessary. When she refused, he ordered her immediate arrest. With little difficulty, Kyoshi resisted the Earth King's forces and admonished the king for defying the Avatar. He agreed to make a compromise: he would listen to the peasants' wishes, and in return, Kyoshi would assemble a group to uphold and protect the cultural heritage of Ba Sing Se. Immediately, she went on to train a group of elite earthbenders, who later became known as the Dai Li. Aang is shocked by the revelation that an Avatar trained the Dai Li, stating that they are \"the worst, most corrupt earthbenders in the world\". Avatar Kyoshi explains how she thought it was a wise decision at the time, but adds that all actions have an effect, whether positive or negative, for many lifetimes. She subsequently instructs Aang to find the Water Tribe Avatar who came before her, Kuruk."
    },
    {
      "body": "In this chapter, the small task requires the player to locate all the faceless monkeys. Successfully doing so will trigger the appearance of the ${link_0} from \"${link_1}\". The game in this level is ${link_2}. Koh will appear once again, with another question.",
      "links": [
        {
          "body": "monkey spirit",
          "key": "${link_0}",
          "target": {
            "href": "Baboon_spirit",
            "page": "Baboon_spirit"
          }
        },
        {
          "body": "The Siege of the North, Part 2",
          "key": "${link_1}",
          "target": {
            "href": "The_Siege_of_the_North%2c_Part_2",
            "page": "The_Siege_of_the_North%2c_Part_2"
          }
        },
        {
          "body": "Treetop Trouble",
          "key": "${link_2}",
          "target": {
            "href": "Treetop_Trouble",
            "page": "Treetop_Trouble"
          }
        }
      ],
      "text": "In this chapter, the small task requires the player to locate all the faceless monkeys. Successfully doing so will trigger the appearance of the monkey spirit from \"The Siege of the North, Part 2\". The game in this level is Treetop Trouble. Koh will appear once again, with another question."
    },
    {
      "body": "\"What are the fox-like spirits in the Desert Library called?\"",
      "links": [],
      "text": "\"What are the fox-like spirits in the Desert Library called?\""
    },
    {
      "body": "A) Truthseekers",
      "links": [],
      "text": "A) Truthseekers"
    },
    {
      "body": "B) Learned Ones",
      "links": [],
      "text": "B) Learned Ones"
    },
    {
      "body": "C) Knowledgeseekers",
      "links": [],
      "text": "C) Knowledgeseekers"
    },
    {
      "body": "D) Booksniffers",
      "links": [],
      "text": "D) Booksniffers"
    },
    {
      "body": "The spirits are ${link_0}, knowledge-seeking foxes from ${link_1} in the ${link_2}. Koh will allow the player to pass once again. The code for this chapter is KURUK. Once it is entered, the player may download the podcast or watch the online comic book of Aang encountering Avatar Kuruk.",
      "links": [
        {
          "body": "Knowledge Seekers",
          "key": "${link_0}",
          "target": {
            "href": "Knowledge_Seekers",
            "page": "Knowledge_Seekers"
          }
        },
        {
          "body": "Wan Shi Tong's Library",
          "key": "${link_1}",
          "target": {
            "href": "Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_2}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        }
      ],
      "text": "The spirits are Knowledge Seekers, knowledge-seeking foxes from Wan Shi Tong's Library in the Si Wong Desert. Koh will allow the player to pass once again. The code for this chapter is KURUK. Once it is entered, the player may download the podcast or watch the online comic book of Aang encountering Avatar Kuruk."
    },
    {
      "body": "${link_0} ${link_1} kisses ${link_2}.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Kuruk",
          "key": "${link_1}",
          "target": {
            "href": "Kuruk",
            "page": "Kuruk"
          }
        },
        {
          "body": "Ummi",
          "key": "${link_2}",
          "target": {
            "href": "Ummi",
            "page": "Ummi"
          }
        }
      ],
      "text": "Avatar Kuruk kisses Ummi."
    },
    {
      "body": "Aang and Hei Bai traverse a murky swamp in the ${link_0}, when they bump into a mysterious man, who introduces himself as Avatar Kuruk. He asks Aang if he has seen a beautiful woman with long, brown hair. Aang responds by inquiring about Kuruk's dilemma, and Kuruk proceeds to tell him his history as the Avatar. When Kuruk was a young Avatar, he was very proud, boastful and arrogant. He traveled the world, demonstrating his bending prowess everywhere, especially to women. However, at the ${link_1}, when the two Water Tribes reunited, he met the love of his life, ${link_2}, and the two were soon betrothed. They were to be married in the ${link_3} at the ${link_4}; however, on the day of their wedding, Ummi was pulled into the water by an unseen force. In truth, she had been pulled into the Spirit World by Koh, who had taken her to punish Kuruk for his past mistakes and his failure to realize the importance of being the Avatar. Kuruk continues by stating that each year, on the anniversary of their wedding, he would travel to the Spirit World to try and find Ummi, but to no avail. Suddenly, Aang recalls his encounter with Koh while in the Northern Water Tribe, and how one of Koh's faces was that of the woman Kuruk had described. Heartened by the knowledge of where his wife was, Kuruk sets off to track down Koh once again, telling Aang to look for the nomadic Avatar who came before him, ${link_5}.",
      "links": [
        {
          "body": "Realm of Koh",
          "key": "${link_0}",
          "target": {
            "href": "Realm_of_Koh",
            "page": "Realm_of_Koh"
          }
        },
        {
          "body": "New Moon Celebration",
          "key": "${link_1}",
          "target": {
            "href": "New_Moon_Celebration",
            "page": "New_Moon_Celebration"
          }
        },
        {
          "body": "Ummi",
          "key": "${link_2}",
          "target": {
            "href": "Ummi",
            "page": "Ummi"
          }
        },
        {
          "body": "Spirit Oasis",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "North Pole",
          "key": "${link_4}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Yangchen",
          "key": "${link_5}",
          "target": {
            "href": "Yangchen",
            "page": "Yangchen"
          }
        }
      ],
      "text": "Aang and Hei Bai traverse a murky swamp in the Realm of Koh, when they bump into a mysterious man, who introduces himself as Avatar Kuruk. He asks Aang if he has seen a beautiful woman with long, brown hair. Aang responds by inquiring about Kuruk's dilemma, and Kuruk proceeds to tell him his history as the Avatar. When Kuruk was a young Avatar, he was very proud, boastful and arrogant. He traveled the world, demonstrating his bending prowess everywhere, especially to women. However, at the New Moon Celebration, when the two Water Tribes reunited, he met the love of his life, Ummi, and the two were soon betrothed. They were to be married in the Spirit Oasis at the North Pole; however, on the day of their wedding, Ummi was pulled into the water by an unseen force. In truth, she had been pulled into the Spirit World by Koh, who had taken her to punish Kuruk for his past mistakes and his failure to realize the importance of being the Avatar. Kuruk continues by stating that each year, on the anniversary of their wedding, he would travel to the Spirit World to try and find Ummi, but to no avail. Suddenly, Aang recalls his encounter with Koh while in the Northern Water Tribe, and how one of Koh's faces was that of the woman Kuruk had described. Heartened by the knowledge of where his wife was, Kuruk sets off to track down Koh once again, telling Aang to look for the nomadic Avatar who came before him, Yangchen."
    },
    {
      "body": "The last chapter's task may be the hardest puzzle in the game. In the background, the player will hear one, continuous note. The player must successfully mimic the background note by tapping two correct bamboo reeds to combine their sounds. Each player has a different note, so it is entirely up to the individual to solve the puzzle. The two reeds you must click are the ones closest to you, and the one closest to Aang. After clicking one, you must click the other as fast as you can. Once the note is successfully repeated, a light will appear at the top of the mountain. Aang concludes that the light must be Avatar Yangchen signaling him. The game for this level is ${link_0}, and the following question is asked.",
      "links": [
        {
          "body": "Ashes in the Air",
          "key": "${link_0}",
          "target": {
            "href": "Ashes_in_the_Air",
            "page": "Ashes_in_the_Air"
          }
        }
      ],
      "text": "The last chapter's task may be the hardest puzzle in the game. In the background, the player will hear one, continuous note. The player must successfully mimic the background note by tapping two correct bamboo reeds to combine their sounds. Each player has a different note, so it is entirely up to the individual to solve the puzzle. The two reeds you must click are the ones closest to you, and the one closest to Aang. After clicking one, you must click the other as fast as you can. Once the note is successfully repeated, a light will appear at the top of the mountain. Aang concludes that the light must be Avatar Yangchen signaling him. The game for this level is Ashes in the Air, and the following question is asked."
    },
    {
      "body": "\"What are the names of the Ocean and Moon Spirits in the Northern Water Tribe Sanctuary?\"",
      "links": [],
      "text": "\"What are the names of the Ocean and Moon Spirits in the Northern Water Tribe Sanctuary?\""
    },
    {
      "body": "A) Lui and Ta",
      "links": [],
      "text": "A) Lui and Ta"
    },
    {
      "body": "B) Mooi and Gooi",
      "links": [],
      "text": "B) Mooi and Gooi"
    },
    {
      "body": "C) Huey and Duey",
      "links": [],
      "text": "C) Huey and Duey"
    },
    {
      "body": "D) Tui and La",
      "links": [],
      "text": "D) Tui and La"
    },
    {
      "body": "The answer is Tui and La. Koh will again allow passage after the question is correctly answered. The code needed to pass is YANGCHEN. Once it is entered, the player may download the podcast or watch the online comic book of Aang encountering Avatar Yangchen.",
      "links": [],
      "text": "The answer is Tui and La. Koh will again allow passage after the question is correctly answered. The code needed to pass is YANGCHEN. Once it is entered, the player may download the podcast or watch the online comic book of Aang encountering Avatar Yangchen."
    },
    {
      "body": "${link_0} ${link_1} senses that ${link_2} has lost his ability to enter the ${link_3}.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Yangchen",
          "key": "${link_1}",
          "target": {
            "href": "Yangchen",
            "page": "Yangchen"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_3}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "Avatar Yangchen senses that Aang has lost his ability to enter the Avatar State."
    },
    {
      "body": "Avatar Yangchen appears atop the mountain in the clouds. She asks Aang what he has learned from meeting his past lives. Aang realizes that the past Avatars all struggled and made mistakes, like him. After realizing this, he ponders why the Avatar is born human, and thus allowed to make mistakes, rather than being an all-knowing immortal spirit. Avatar Yangchen explains that the Avatar must experience human emotions to understand how precious human life is. She also explains that Aang's ability to enter the Avatar State has been disrupted, so he will now have to rely on ${link_0} rather than his past lives, though he will still be able to contact them. She bids him farewell and informs Aang that when he awakens, his trip to the Spirit World will be like a forgotten dream.",
      "links": [
        {
          "body": "his friends",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Avatar Yangchen appears atop the mountain in the clouds. She asks Aang what he has learned from meeting his past lives. Aang realizes that the past Avatars all struggled and made mistakes, like him. After realizing this, he ponders why the Avatar is born human, and thus allowed to make mistakes, rather than being an all-knowing immortal spirit. Avatar Yangchen explains that the Avatar must experience human emotions to understand how precious human life is. She also explains that Aang's ability to enter the Avatar State has been disrupted, so he will now have to rely on his friends rather than his past lives, though he will still be able to contact them. She bids him farewell and informs Aang that when he awakens, his trip to the Spirit World will be like a forgotten dream."
    },
    {
      "body": "With all the chapters unlocked, the player can either reset all the chapters and play the game again, or try out a new exclusive game.",
      "links": [],
      "text": "With all the chapters unlocked, the player can either reset all the chapters and play the game again, or try out a new exclusive game."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Escape_from_the_Spirit_World",
    "file": "avatar.wikia.com/wiki/Escape_from_the_Spirit_World.html",
    "page": "Escape_from_the_Spirit_World",
    "title": "Escape from the Spirit World"
  }
}