{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Locations (film)",
      "target": {
        "external": false,
        "href": "/wiki/Category_Locations_(film)",
        "page": "Category_Locations_(film)"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The Southern Water Tribe is the southern division of the ${link_0}. Unlike the metropolitical ${link_1}, the southern tribe is made of a conglomeration of smaller villages and settlements located across the South Pole. The people of the Southern Water Tribe are teetering on the edge of extinction, and there are few able-bodied citizens still remaining. The population consists mostly of old women and children, as the men who were old and strong enough to fight left to help in the war.",
      "links": [
        {
          "body": "Water Tribes",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Northern_Water_Tribe",
            "page": "Film_Northern_Water_Tribe"
          }
        }
      ],
      "section": [
        "Southern Water Tribe"
      ],
      "text": "The Southern Water Tribe is the southern division of the Water Tribes. Unlike the metropolitical Northern Water Tribe, the southern tribe is made of a conglomeration of smaller villages and settlements located across the South Pole. The people of the Southern Water Tribe are teetering on the edge of extinction, and there are few able-bodied citizens still remaining. The population consists mostly of old women and children, as the men who were old and strong enough to fight left to help in the war."
    },
    {
      "body": "Due to irregular and incessant attacks from the Fire Nation, the Southern Water Tribe became severely weakened, deprived of both warriors and benders. The only capable warrior left was ${link_0}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Sokka",
            "page": "Film_Sokka"
          }
        }
      ],
      "section": [
        "Southern Water Tribe",
        "History"
      ],
      "text": "Due to irregular and incessant attacks from the Fire Nation, the Southern Water Tribe became severely weakened, deprived of both warriors and benders. The only capable warrior left was Sokka."
    },
    {
      "body": "The occupants of the village were among the first to learn of the Avatar's return, when Sokka and his sister, ${link_0}, discovered him trapped in an iceberg not far from the village, and subsequently freed him.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Katara",
            "page": "Film_Katara"
          }
        }
      ],
      "section": [
        "Southern Water Tribe",
        "History"
      ],
      "text": "The occupants of the village were among the first to learn of the Avatar's return, when Sokka and his sister, Katara, discovered him trapped in an iceberg not far from the village, and subsequently freed him."
    },
    {
      "body": "The energy discharge accompanying the Avatar's release from the iceberg, directed ${link_0}, the banished prince from the Fire Nation, to visit the home village of Sokka and Katara. There, he demanded a line-up of all villagers, inspecting the elderly for any sign that one was the Avatar. One of the prince's soldiers found a boy with Air Nomad tattoos in one of the village's igloos and took him to face Zuko. ${link_1}'s identity as the Avatar was rediscovered at that moment, and he was subsequently taken aboard Zuko's ship, who promptly left the Southern Water Tribe. This occurrence caused Sokka and Katara to leave the tribe as well in an effort to save the Avatar.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Zuko",
            "page": "Film_Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Aang",
            "page": "Film_Aang"
          }
        }
      ],
      "section": [
        "Southern Water Tribe",
        "History"
      ],
      "text": "The energy discharge accompanying the Avatar's release from the iceberg, directed Zuko, the banished prince from the Fire Nation, to visit the home village of Sokka and Katara. There, he demanded a line-up of all villagers, inspecting the elderly for any sign that one was the Avatar. One of the prince's soldiers found a boy with Air Nomad tattoos in one of the village's igloos and took him to face Zuko. Aang's identity as the Avatar was rediscovered at that moment, and he was subsequently taken aboard Zuko's ship, who promptly left the Southern Water Tribe. This occurrence caused Sokka and Katara to leave the tribe as well in an effort to save the Avatar."
    },
    {
      "body": "Unlike the Southern Tribe from the television series, the film version exhibits no outer wall or watchtowers.",
      "links": [],
      "section": [
        "Southern Water Tribe",
        "Trivia"
      ],
      "text": "Unlike the Southern Tribe from the television series, the film version exhibits no outer wall or watchtowers."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Film:Southern_Water_Tribe",
    "file": "avatar.wikia.com/wiki/Film_Southern_Water_Tribe.html",
    "page": "Film_Southern_Water_Tribe",
    "title": "Southern Water Tribe"
  }
}