{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Films",
      "target": {
        "href": "Category_Films",
        "page": "Category_Films"
      }
    },
    {
      "body": "Real world",
      "target": {
        "href": "Category_Real_world",
        "page": "Category_Real_world"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} film poster of ${link_1} (left) and ${link_2} (right).",
      "links": [
        {
          "body": "The Last Airbender",
          "key": "${link_0}",
          "target": {
            "href": "Film_The_Last_Airbender",
            "page": "Film_The_Last_Airbender"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Film_Zuko",
            "page": "Film_Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        }
      ],
      "text": "The Last Airbender film poster of Zuko (left) and Aang (right)."
    },
    {
      "body": "The film tells the story of ${link_0}, a thirteen-year-old ${link_1} who ran away from his destiny as the ${link_2}. After a hundred years in suspended animation, Aang travels to the ${link_3} on the other side of the world with his newfound friends, ${link_4} and ${link_5}, to find a master to teach him ${link_6}. In his absence, the ${link_7}, now ruled by ${link_8} ${link_9}, has been waging a seemingly endless ${link_10} against the ${link_11} and the ${link_12}, having already destroyed the ${link_13}. As the Avatar, he is hunted by ${link_14}, an exiled ${link_15} of the Fire Nation seeking to redeem his honor, and the Fire Nation itself, led by ${link_16} ${link_17}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        },
        {
          "body": "Airbender",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_3}",
          "target": {
            "href": "Film_Northern_Water_Tribe",
            "page": "Film_Northern_Water_Tribe"
          }
        },
        {
          "body": "Katara",
          "key": "${link_4}",
          "target": {
            "href": "Film_Katara",
            "page": "Film_Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_5}",
          "target": {
            "href": "Film_Sokka",
            "page": "Film_Sokka"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_6}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_7}",
          "target": {
            "href": "Film_Fire_Nation",
            "page": "Film_Fire_Nation"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_8}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_9}",
          "target": {
            "href": "Film_Ozai",
            "page": "Film_Ozai"
          }
        },
        {
          "body": "war",
          "key": "${link_10}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_11}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_12}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_13}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_14}",
          "target": {
            "href": "Film_Zuko",
            "page": "Film_Zuko"
          }
        },
        {
          "body": "prince",
          "key": "${link_15}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Commander",
          "key": "${link_16}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#Commander",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_17}",
          "target": {
            "href": "Film_Zhao",
            "page": "Film_Zhao"
          }
        }
      ],
      "text": "The film tells the story of Aang, a thirteen-year-old Airbender who ran away from his destiny as the Avatar. After a hundred years in suspended animation, Aang travels to the Northern Water Tribe on the other side of the world with his newfound friends, Katara and Sokka, to find a master to teach him waterbending. In his absence, the Fire Nation, now ruled by Fire Lord Ozai, has been waging a seemingly endless war against the Earth Kingdom and the Water Tribe, having already destroyed the Air Nomads. As the Avatar, he is hunted by Zuko, an exiled prince of the Fire Nation seeking to redeem his honor, and the Fire Nation itself, led by Commander Zhao."
    },
    {
      "body": "The story opens with a scrolling text narrated by Katara:",
      "links": [],
      "text": "The story opens with a scrolling text narrated by Katara:"
    },
    {
      "body": "Katara continued with single text on screen:",
      "links": [],
      "text": "Katara continued with single text on screen:"
    },
    {
      "body": "Katara is fifteen years oldCite error: Invalid <ref> tag; refs with no content must have a name. when the story begins - she is practicing her waterbending by lifting a sphere of water, which she accidentally drops on her seventeen-year-oldCite error: Invalid <ref> tag; refs with no content must have a name. brother, Sokka. After repeatedly apologizing to him, she tells him how she thinks about their mom while waterbending, which seems strange to her.",
      "links": [],
      "text": "Katara is fifteen years oldCite error: Invalid <ref> tag; refs with no content must have a name. when the story begins - she is practicing her waterbending by lifting a sphere of water, which she accidentally drops on her seventeen-year-oldCite error: Invalid <ref> tag; refs with no content must have a name. brother, Sokka. After repeatedly apologizing to him, she tells him how she thinks about their mom while waterbending, which seems strange to her."
    },
    {
      "body": "${link_0} and ${link_1} discover ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Film_Katara",
            "page": "Film_Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Film_Sokka",
            "page": "Film_Sokka"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        }
      ],
      "text": "Katara and Sokka discover Aang."
    },
    {
      "body": "Katara accompanies Sokka hunt for food for their tribe. Out at the vast open field of ice, Katara soon notices something glowing directly beneath her feet. Sokka uses his boomerang to crack the floor open but the cracks expands and starts a cave-in, so he runs away from it with Katara. A large ice sphere emerges from the cracks with a silhouette of a person inside it.",
      "links": [],
      "text": "Katara accompanies Sokka hunt for food for their tribe. Out at the vast open field of ice, Katara soon notices something glowing directly beneath her feet. Sokka uses his boomerang to crack the floor open but the cracks expands and starts a cave-in, so he runs away from it with Katara. A large ice sphere emerges from the cracks with a silhouette of a person inside it."
    },
    {
      "body": "The ice sphere breaks apart after Katara cracks it with Sokka's boomerang, shooting a bright light high to the sky, which catches the attention of the eighteen-year-oldCite error: Invalid <ref> tag; refs with no content must have a name. Prince Zuko on a faraway ship. In the resulting ice crater, Katara and Sokka discover a thirteen-year-old boy, alive but exhausted, with his large six-legged bison creature.",
      "links": [],
      "text": "The ice sphere breaks apart after Katara cracks it with Sokka's boomerang, shooting a bright light high to the sky, which catches the attention of the eighteen-year-oldCite error: Invalid <ref> tag; refs with no content must have a name. Prince Zuko on a faraway ship. In the resulting ice crater, Katara and Sokka discover a thirteen-year-old boy, alive but exhausted, with his large six-legged bison creature."
    },
    {
      "body": "One of ${link_0}'s soldiers discovers the ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Film_Zuko",
            "page": "Film_Zuko"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "One of Zuko's soldiers discovers the Avatar."
    },
    {
      "body": "The boy is taken back to the ${link_0} where he soon recovered in an igloo. He thanked Katara for saving him, but she admitted they were just lucky to have found him. He says he should get back, as the others are probably worried after he ran away from home. Just then, Zuko's ship has smashed through the icy landscape.",
      "links": [
        {
          "body": "village",
          "key": "${link_0}",
          "target": {
            "href": "Film_Southern_Water_Tribe",
            "page": "Film_Southern_Water_Tribe"
          }
        }
      ],
      "text": "The boy is taken back to the village where he soon recovered in an igloo. He thanked Katara for saving him, but she admitted they were just lucky to have found him. He says he should get back, as the others are probably worried after he ran away from home. Just then, Zuko's ship has smashed through the icy landscape."
    },
    {
      "body": "Zuko enters the village with his men, and tells the villagers who he is, the son of Fire Lord Ozai and heir the throne of the Fire Nation. He has his men round up all the elderly. One of the soldiers finds the boy in the igloo with some children. Upon noticing his tattoos, he is brought to Zuko. Zuko is astonished to find the tattoos that he seemingly recognizes its significance and demanded to know who he is. The boy defiantly refuses to give his name. Zuko threatens to burn down the village with his ${link_0} if the boy would not come along with him on his ship, so the boy complied.",
      "links": [
        {
          "body": "firebenders",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Zuko enters the village with his men, and tells the villagers who he is, the son of Fire Lord Ozai and heir the throne of the Fire Nation. He has his men round up all the elderly. One of the soldiers finds the boy in the igloo with some children. Upon noticing his tattoos, he is brought to Zuko. Zuko is astonished to find the tattoos that he seemingly recognizes its significance and demanded to know who he is. The boy defiantly refuses to give his name. Zuko threatens to burn down the village with his firebenders if the boy would not come along with him on his ship, so the boy complied."
    },
    {
      "body": "Sokka figures that they were looking for someone old, but soon realizes that the boy was who they wanted. As Katara pleads with Sokka to help her save the boy, the bison creature floats in the air as if wanting to follow his master, but is held back out of concern of the children hanging dangerously off his feet. Sokka thinks of a plan to use the flying bison to rescue the boy.",
      "links": [],
      "text": "Sokka figures that they were looking for someone old, but soon realizes that the boy was who they wanted. As Katara pleads with Sokka to help her save the boy, the bison creature floats in the air as if wanting to follow his master, but is held back out of concern of the children hanging dangerously off his feet. Sokka thinks of a plan to use the flying bison to rescue the boy."
    },
    {
      "body": "${link_0} informed ${link_1} that his nephew ${link_2} wanted to perform a test on him.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Film_Iroh",
            "page": "Film_Iroh"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_2}",
          "target": {
            "href": "Film_Zuko",
            "page": "Film_Zuko"
          }
        }
      ],
      "text": "Iroh informed Aang that his nephew Zuko wanted to perform a test on him."
    },
    {
      "body": "${link_0}, their grandmother, believes the boy to be an airbender from his tattoos, and likely to be the long-lost Avatar. She suggests that it may be Katara's destiny to help the boy, ever since she was discovered to be a waterbender; there has not been a waterbender in the Southern Water Tribe since her friend Hama was taken away. She says the Fire Nation is afraid that with the Avatar's mastery of the four elements and the guidance he receives from the Spirit World, the Avatar would change hearts, as \"it is in the hearts where all wars are won.\"",
      "links": [
        {
          "body": "Kanna",
          "key": "${link_0}",
          "target": {
            "href": "Film_Kanna",
            "page": "Film_Kanna"
          }
        }
      ],
      "text": "Kanna, their grandmother, believes the boy to be an airbender from his tattoos, and likely to be the long-lost Avatar. She suggests that it may be Katara's destiny to help the boy, ever since she was discovered to be a waterbender; there has not been a waterbender in the Southern Water Tribe since her friend Hama was taken away. She says the Fire Nation is afraid that with the Avatar's mastery of the four elements and the guidance he receives from the Spirit World, the Avatar would change hearts, as \"it is in the hearts where all wars are won.\""
    },
    {
      "body": "On the ship, Zuko's uncle, ${link_0}, conducts a few tests on the boy, after assuring him the test would be painless and once complete, he would be free to go. The ${link_1} involved a candle flame that seemed to be drawn toward to him, a poured water that formed a circle on the table and a smooth rock that stood on an unstable position. However, when Zuko declares him to be his prisoner, Iroh apologetically explains to the boy that he had not failed the tests as all others did. Iroh adds that he is honored to be in the presence of the boy.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Film_Iroh",
            "page": "Film_Iroh"
          }
        },
        {
          "body": "test",
          "key": "${link_1}",
          "target": {
            "href": "Film_Four_elements_test",
            "page": "Film_Four_elements_test"
          }
        }
      ],
      "text": "On the ship, Zuko's uncle, Iroh, conducts a few tests on the boy, after assuring him the test would be painless and once complete, he would be free to go. The test involved a candle flame that seemed to be drawn toward to him, a poured water that formed a circle on the table and a smooth rock that stood on an unstable position. However, when Zuko declares him to be his prisoner, Iroh apologetically explains to the boy that he had not failed the tests as all others did. Iroh adds that he is honored to be in the presence of the boy."
    },
    {
      "body": "With skilled airbending moves, the boy escapes from Zuko and his men to the surface of the ship, grabbing his staff along the way. Upon noticing ${link_0} landing at a distant icy cliff, he turns his staff into a glider and flies off toward Appa, propelled with airbending. Zuko watches with despair, saying that he almost had his honor back, but Iroh assures him that his destiny is tied with the Avatar.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Film_Appa",
            "page": "Film_Appa"
          }
        }
      ],
      "text": "With skilled airbending moves, the boy escapes from Zuko and his men to the surface of the ship, grabbing his staff along the way. Upon noticing Appa landing at a distant icy cliff, he turns his staff into a glider and flies off toward Appa, propelled with airbending. Zuko watches with despair, saying that he almost had his honor back, but Iroh assures him that his destiny is tied with the Avatar."
    },
    {
      "body": "${link_0} was distraught learning of the ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        },
        {
          "body": "Air Nomad Genocide",
          "key": "${link_1}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        }
      ],
      "text": "Aang was distraught learning of the Air Nomad Genocide."
    },
    {
      "body": "At the ${link_0} on the high mountains, the boy calls out his friends but no one turns up - he thinks they were playing tricks with him. He also calls for Monk ${link_1}, his guardian and father figure. A ${link_2} flew to the boy and immediately played and bonded with him. Katara was puzzled as winged lemurs were supposed to be extinct but the boy thought she was mistaken. When Katara asks for his name, the boy tells her the monks called him Aang.",
      "links": [
        {
          "body": "Southern Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Film_Southern_Air_Temple",
            "page": "Film_Southern_Air_Temple"
          }
        },
        {
          "body": "Gyatso",
          "key": "${link_1}",
          "target": {
            "href": "Film_Gyatso",
            "page": "Film_Gyatso"
          }
        },
        {
          "body": "winged lemur",
          "key": "${link_2}",
          "target": {
            "href": "Winged_lemur",
            "page": "Winged_lemur"
          }
        }
      ],
      "text": "At the Southern Air Temple on the high mountains, the boy calls out his friends but no one turns up - he thinks they were playing tricks with him. He also calls for Monk Gyatso, his guardian and father figure. A winged lemur flew to the boy and immediately played and bonded with him. Katara was puzzled as winged lemurs were supposed to be extinct but the boy thought she was mistaken. When Katara asks for his name, the boy tells her the monks called him Aang."
    },
    {
      "body": "Katara immediately realizes that Aang has been in the ice for a hundred years, not just gone for a few days as Aang had thought. Before she could tell him, Aang is already racing down the to the prayer field to expecting to find his friends there. Aang is shocked to human remains and an unkempt field. He is in denial until he finds the necklace he made for Monk Gyatso on one of the remains.",
      "links": [],
      "text": "Katara immediately realizes that Aang has been in the ice for a hundred years, not just gone for a few days as Aang had thought. Before she could tell him, Aang is already racing down the to the prayer field to expecting to find his friends there. Aang is shocked to human remains and an unkempt field. He is in denial until he finds the necklace he made for Monk Gyatso on one of the remains."
    },
    {
      "body": "In his rage, his eyes and tattoos glow pure white and strong winds begin to circle around him, lifting him up. Aang is in trance and enters the Spirit World, where he meets the ${link_0}, who is surprised to see the Avatar and asks him where has he been all this while. Before Aang could answer, he hears Katara's voice pleading him even though his people are gone, both she and Sokka are now his family. The words seems to reach Aang, who falls out of the trance, exits the Spirit World and slowly descends back onto the ground.",
      "links": [
        {
          "body": "Dragon Spirit",
          "key": "${link_0}",
          "target": {
            "href": "Film_Dragon_Spirit",
            "page": "Film_Dragon_Spirit"
          }
        }
      ],
      "text": "In his rage, his eyes and tattoos glow pure white and strong winds begin to circle around him, lifting him up. Aang is in trance and enters the Spirit World, where he meets the Dragon Spirit, who is surprised to see the Avatar and asks him where has he been all this while. Before Aang could answer, he hears Katara's voice pleading him even though his people are gone, both she and Sokka are now his family. The words seems to reach Aang, who falls out of the trance, exits the Spirit World and slowly descends back onto the ground."
    },
    {
      "body": "${link_0} and ${link_1} at a luncheon in ${link_2}'s flagship.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Film_Zuko",
            "page": "Film_Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Film_Iroh",
            "page": "Film_Iroh"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_2}",
          "target": {
            "href": "Film_Zhao",
            "page": "Film_Zhao"
          }
        }
      ],
      "text": "Zuko and Iroh at a luncheon in Zhao's flagship."
    },
    {
      "body": "Meanwhile, Commander Zhao spots Zuko on his ship out in the sea and offers him lunch on his own ship. Zuko and Iroh sit with Zhao on the main table. Zhao makes a toast that seemingly mocks Zuko in front of his soldiers in the mess hall. Zhao reminds them how Ozai banished his son Zuko and could not return until he found the Avatar. Zuko confronts Zhao and tells him once his father takes him back, Zhao will bow before him. Back on his ship, Zuko gazes at his family picture (his mother, his father, his sister and himself) before he begins his training of firebending and hand-to-hand combat. Iroh observes from the deck above, while drinking his tea.",
      "links": [],
      "text": "Meanwhile, Commander Zhao spots Zuko on his ship out in the sea and offers him lunch on his own ship. Zuko and Iroh sit with Zhao on the main table. Zhao makes a toast that seemingly mocks Zuko in front of his soldiers in the mess hall. Zhao reminds them how Ozai banished his son Zuko and could not return until he found the Avatar. Zuko confronts Zhao and tells him once his father takes him back, Zhao will bow before him. Back on his ship, Zuko gazes at his family picture (his mother, his father, his sister and himself) before he begins his training of firebending and hand-to-hand combat. Iroh observes from the deck above, while drinking his tea."
    },
    {
      "body": "Appa lands in a forest in the Southern Earth Kingdom, where Katara, Sokka, and Aang set up camp. The winged lemur has become their pet, which was named ${link_0}. Aang sits alone making sense of what he saw at the temple and the Spirit World. He learns from Katara that many villages in the Earth Kingdom have fallen under Fire Nation control, but yet to conquer big cities like Ba Sing Se. As Aang is the last surviving airbender, Katara and Sokka ask him if he is also the Avatar.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "href": "Film_Momo",
            "page": "Film_Momo"
          }
        }
      ],
      "text": "Appa lands in a forest in the Southern Earth Kingdom, where Katara, Sokka, and Aang set up camp. The winged lemur has become their pet, which was named Momo. Aang sits alone making sense of what he saw at the temple and the Spirit World. He learns from Katara that many villages in the Earth Kingdom have fallen under Fire Nation control, but yet to conquer big cities like Ba Sing Se. As Aang is the last surviving airbender, Katara and Sokka ask him if he is also the Avatar."
    },
    {
      "body": "Before Aang could respond, a young boy burst out of the woods and sought refuge with the trio from the Fire Nation soldiers chasing him. He was being arrested for ${link_0}, as it is forbidden in his village. Katara and Sokka refuse to turn the young boy over to the soldiers. Katara pops open her water pouch and bends the water at the soldiers, but the water traps Sokka's arms and chest in ice instead, much to his frustration.",
      "links": [
        {
          "body": "earthbending",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Before Aang could respond, a young boy burst out of the woods and sought refuge with the trio from the Fire Nation soldiers chasing him. He was being arrested for earthbending, as it is forbidden in his village. Katara and Sokka refuse to turn the young boy over to the soldiers. Katara pops open her water pouch and bends the water at the soldiers, but the water traps Sokka's arms and chest in ice instead, much to his frustration."
    },
    {
      "body": "The ${link_0} aid ${link_1}'s efforts and fight back.",
      "links": [
        {
          "body": "earthbenders",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "The earthbenders aid Team Avatar's efforts and fight back."
    },
    {
      "body": "The soldiers arrest Sokka, Katara, Aang and the young earthbending boy. As they are taken to the prison camp just outside a village, Aang notices the poor condition of the village and its people. They are shoved through a gateway of a tall metal fence. In the prison yard, there are men on the ground, weary and defeated. The earthbending boy is reunited with his father. The father explains to Aang that the earthbenders fought and defeated the Fire Nation soldiers back then. But when the Fire Nation sent huge machines made of metal, the earthbenders lost. As a term of surrender, nonbenders were allowed to live in peace if the earthbenders were imprisoned.",
      "links": [],
      "text": "The soldiers arrest Sokka, Katara, Aang and the young earthbending boy. As they are taken to the prison camp just outside a village, Aang notices the poor condition of the village and its people. They are shoved through a gateway of a tall metal fence. In the prison yard, there are men on the ground, weary and defeated. The earthbending boy is reunited with his father. The father explains to Aang that the earthbenders fought and defeated the Fire Nation soldiers back then. But when the Fire Nation sent huge machines made of metal, the earthbenders lost. As a term of surrender, nonbenders were allowed to live in peace if the earthbenders were imprisoned."
    },
    {
      "body": "Aang could not accept that the earthbenders have allowed themselves to be humiliated in a minimal security prison camp with earth underneath their feet, especially with the poor treatment the nonbenders received in return for their surrender. He tries to inspire the earthbenders to rise and fight back, but they are non-responsive. When Aang asks if it makes any difference if the Avatar has returned, one of them answers that if the Avatar were alive, he would protect them, presumably from an eventual retaliation with the war machines. Aang subsequently reveals to everyone that he is the Avatar.",
      "links": [],
      "text": "Aang could not accept that the earthbenders have allowed themselves to be humiliated in a minimal security prison camp with earth underneath their feet, especially with the poor treatment the nonbenders received in return for their surrender. He tries to inspire the earthbenders to rise and fight back, but they are non-responsive. When Aang asks if it makes any difference if the Avatar has returned, one of them answers that if the Avatar were alive, he would protect them, presumably from an eventual retaliation with the war machines. Aang subsequently reveals to everyone that he is the Avatar."
    },
    {
      "body": "A soldier sneers at Aang, as the Avatar would have to be an airbender and all airbenders were killed a long time ago. Katara pushes the soldier away, telling him to leave Aang alone. Aang uses his airbending to counter an attack on Katara. The Fire Nation soldiers surround them to take them out - Sokka moves in to protect the two, calling on the others to help them. The earthbending boy throws a rock behind the lead soldier; he turns and bends a flame from the nearby fire pit at the boy. The father raises an earth barrier to protect his son.",
      "links": [],
      "text": "A soldier sneers at Aang, as the Avatar would have to be an airbender and all airbenders were killed a long time ago. Katara pushes the soldier away, telling him to leave Aang alone. Aang uses his airbending to counter an attack on Katara. The Fire Nation soldiers surround them to take them out - Sokka moves in to protect the two, calling on the others to help them. The earthbending boy throws a rock behind the lead soldier; he turns and bends a flame from the nearby fire pit at the boy. The father raises an earth barrier to protect his son."
    },
    {
      "body": "${link_0} discovers that a village is named after his previous incarnation.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        }
      ],
      "text": "Aang discovers that a village is named after his previous incarnation."
    },
    {
      "body": "The other earthbenders watching the event unfold, rise with renewed sense of hope. Seeking to restore order, the lead soldier with another firebender launches a large flame toward the father and the boy, but it is blocked by a larger barrier, which is raised by six earthbenders bending in unison. Another earthbender raises a rock and accelerates it at the other soldier, and earth-blocked a flame attack from the lead soldier. Sokka takes down the lead soldier while Aang takes out another. After a few more airbending moves from Aang and a boomerang attack thrown by Sokka, the remaining soldiers retreat. Outside the prison, Aang takes out a few more soldiers in the village.",
      "links": [],
      "text": "The other earthbenders watching the event unfold, rise with renewed sense of hope. Seeking to restore order, the lead soldier with another firebender launches a large flame toward the father and the boy, but it is blocked by a larger barrier, which is raised by six earthbenders bending in unison. Another earthbender raises a rock and accelerates it at the other soldier, and earth-blocked a flame attack from the lead soldier. Sokka takes down the lead soldier while Aang takes out another. After a few more airbending moves from Aang and a boomerang attack thrown by Sokka, the remaining soldiers retreat. Outside the prison, Aang takes out a few more soldiers in the village."
    },
    {
      "body": "After everything is settled, the villagers break open a shed, where all tools related to bending taken by the Fire Nation were kept. Momo goes in the shed and knocks over a waterbending scroll. A villager picks up the scroll and gives it to Katara. Katara reveals that her mother told her about these rare scrolls. An elder villager shows Aang the statue of Avatar Kyoshi, his previous incarnation as an earthbender, two lifetimes ago.",
      "links": [],
      "text": "After everything is settled, the villagers break open a shed, where all tools related to bending taken by the Fire Nation were kept. Momo goes in the shed and knocks over a waterbending scroll. A villager picks up the scroll and gives it to Katara. Katara reveals that her mother told her about these rare scrolls. An elder villager shows Aang the statue of Avatar Kyoshi, his previous incarnation as an earthbender, two lifetimes ago."
    },
    {
      "body": "${link_0} putting up a poster announcing the ${link_1}'s return.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Film_Katara",
            "page": "Film_Katara"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Katara putting up a poster announcing the Avatar's return."
    },
    {
      "body": "Aang meets with Sokka and Katara, and reveals to them he ran way before he was trained to the Avatar - he is unable to bend elements other than air. The next element to master would be water, as the cycle was air, water, earth and fire. Sokka suggests that they travel to the Northern Water Tribe, which is on the other side of the world, as his father tells him about powerful waterbenders there who may be able to teach Aang. Sokka also suggests they visit the small villages occupied by the Fire Nation along the way to start a change in the war.",
      "links": [],
      "text": "Aang meets with Sokka and Katara, and reveals to them he ran way before he was trained to the Avatar - he is unable to bend elements other than air. The next element to master would be water, as the cycle was air, water, earth and fire. Sokka suggests that they travel to the Northern Water Tribe, which is on the other side of the world, as his father tells him about powerful waterbenders there who may be able to teach Aang. Sokka also suggests they visit the small villages occupied by the Fire Nation along the way to start a change in the war."
    },
    {
      "body": "The newly formed Team Avatar set out on the journey to the north. Along the way they visit the villages, where Aang announces the Avatar had returned. In villages that are still occupied by Fire Nation soldiers, Aang uses his airbending to defeat them and liberate the village from their grip.",
      "links": [],
      "text": "The newly formed Team Avatar set out on the journey to the north. Along the way they visit the villages, where Aang announces the Avatar had returned. In villages that are still occupied by Fire Nation soldiers, Aang uses his airbending to defeat them and liberate the village from their grip."
    },
    {
      "body": "Meanwhile, Zuko and two soldiers, disguised as travelers of the Earth Kingdom, visit the first village Aang liberated. They also entered the former prison camp and investigate the site.",
      "links": [],
      "text": "Meanwhile, Zuko and two soldiers, disguised as travelers of the Earth Kingdom, visit the first village Aang liberated. They also entered the former prison camp and investigate the site."
    },
    {
      "body": "${link_0} and ${link_1} in a tea shop at the ${link_2} Colony Fifteen.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Film_Zuko",
            "page": "Film_Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Film_Iroh",
            "page": "Film_Iroh"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Film_Fire_Nation",
            "page": "Film_Fire_Nation"
          }
        }
      ],
      "text": "Zuko and Iroh in a tea shop at the Fire Nation Colony Fifteen."
    },
    {
      "body": "On Zhao's flagship, a soldier enters the war room and whispers some information to Zhao. Later, at the Fire Nation palace, Zhao meets with Fire Lord Ozai and informs the good news regarding the raid on the Great Library, which most people believe does not exist. Scrolls were found in the library, which was being deciphered as it may contain information about the location of the Moon and Ocean spirits. This information could be used to bring down the city of the Northern Water Tribe. Regarding the rumors of the Avatar's return, spies report a boy claiming to be the Avatar. Zhao suggests they set a trap for the Avatar, using the Earth Kingdom people under their control and soldiers hidden in certain location. Fire Lord Ozai notes to Zhao that if Zuko would capture the Avatar first, Zuko would effectively become Zhao's superior.",
      "links": [],
      "text": "On Zhao's flagship, a soldier enters the war room and whispers some information to Zhao. Later, at the Fire Nation palace, Zhao meets with Fire Lord Ozai and informs the good news regarding the raid on the Great Library, which most people believe does not exist. Scrolls were found in the library, which was being deciphered as it may contain information about the location of the Moon and Ocean spirits. This information could be used to bring down the city of the Northern Water Tribe. Regarding the rumors of the Avatar's return, spies report a boy claiming to be the Avatar. Zhao suggests they set a trap for the Avatar, using the Earth Kingdom people under their control and soldiers hidden in certain location. Fire Lord Ozai notes to Zhao that if Zuko would capture the Avatar first, Zuko would effectively become Zhao's superior."
    },
    {
      "body": "At the Fire Nation Colony Fifteen located in the Northern Earth Kingdom, Zuko sits with his uncle Iroh in a tea shop, with his face hidden by the hood of his cloak to avoid being recognized. Zuko mentions that they are catching up with the Avatar and his friends. Iroh points out that are lots of pretty girls in the town and pleads with Zuko to settle down here and abandon the search for the Avatar. However, Zuko is determined to catch the Avatar first and to think about the pretty girls later. To convey his point, he asks a local boy about the prince, the Fire Lord's son: Prince Zuko had spoken out of turn to a general in defense of some of his friends who were going to sacrificed in battle, so he was sentenced to an ${link_0} (अग्नि की डूएल - \"Duel of Fire\"). When he showed up, it was his father he was to fight, but he would not fight his father. His father mocked him, \"I should bring your sister up here to beat you.\" The father promptly burned his son to teach him a lesson.",
      "links": [
        {
          "body": "Agni kī Duel",
          "key": "${link_0}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        }
      ],
      "text": "At the Fire Nation Colony Fifteen located in the Northern Earth Kingdom, Zuko sits with his uncle Iroh in a tea shop, with his face hidden by the hood of his cloak to avoid being recognized. Zuko mentions that they are catching up with the Avatar and his friends. Iroh points out that are lots of pretty girls in the town and pleads with Zuko to settle down here and abandon the search for the Avatar. However, Zuko is determined to catch the Avatar first and to think about the pretty girls later. To convey his point, he asks a local boy about the prince, the Fire Lord's son: Prince Zuko had spoken out of turn to a general in defense of some of his friends who were going to sacrificed in battle, so he was sentenced to an Agni kī Duel (अग्नि की डूएल - \"Duel of Fire\"). When he showed up, it was his father he was to fight, but he would not fight his father. His father mocked him, \"I should bring your sister up here to beat you.\" The father promptly burned his son to teach him a lesson."
    },
    {
      "body": "At the shore of a sparkling lake beside a forest, Katara and Aang practice waterbending while Sokka tends to a campfire nearby. Katara asks Aang why he seems distracted. He says that they were near the Northern Air Temple and that he wants to visit there and return, all within a day. He believes that, at another spiritual place, he may be able to communicate with the Dragon Spirit again. Katara fills Sokka in on Aang's plan but Sokka is against it, and urges Katara to talk him out of it.",
      "links": [],
      "text": "At the shore of a sparkling lake beside a forest, Katara and Aang practice waterbending while Sokka tends to a campfire nearby. Katara asks Aang why he seems distracted. He says that they were near the Northern Air Temple and that he wants to visit there and return, all within a day. He believes that, at another spiritual place, he may be able to communicate with the Dragon Spirit again. Katara fills Sokka in on Aang's plan but Sokka is against it, and urges Katara to talk him out of it."
    },
    {
      "body": "${link_0} looking at the statue of ${link_1} ${link_2}, his previous incarnation.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        }
      ],
      "text": "Aang looking at the statue of Avatar Roku, his previous incarnation."
    },
    {
      "body": "Aang continues practicing waterbending in the dark, while Sokka and Katara are sleeping. He manages to raise the three short pillars of water. As he closes his eyes concentrating, ripples and waves began to form on the lake. He remembers Monk Gyatso giving lessons to him and the other students in the open field and images of skeletal remains he saw earlier. When he opens his eyes, he is surprised to see the result of his lack of control over waterbending. Convinced that he needs help immediately from the Dragon Spirit, he wakes up Appa to head over to the Northern Air Temple. Sokka and Katara wake up and see that Aang has taken off. She assures Sokka that Aang will back in a day, but Sokka is concerned the Fire Nation might catch him.",
      "links": [],
      "text": "Aang continues practicing waterbending in the dark, while Sokka and Katara are sleeping. He manages to raise the three short pillars of water. As he closes his eyes concentrating, ripples and waves began to form on the lake. He remembers Monk Gyatso giving lessons to him and the other students in the open field and images of skeletal remains he saw earlier. When he opens his eyes, he is surprised to see the result of his lack of control over waterbending. Convinced that he needs help immediately from the Dragon Spirit, he wakes up Appa to head over to the Northern Air Temple. Sokka and Katara wake up and see that Aang has taken off. She assures Sokka that Aang will back in a day, but Sokka is concerned the Fire Nation might catch him."
    },
    {
      "body": "Appa lands at the Northern Air Temple. As Aang makes his way in the temple ruins, he finds an old-man, an Earth Kingdom villager who has been visiting the temple often. He is surprised to see the Avatar's return and leads Aang to a hidden chamber of statues of past Avatars, each one representing his reincarnations over the years. Avatar Roku was his last life. Aang reveals the airbenders knew he was the Avatar after he chose four toys out of a thousand, the same toys that belonged to the previous Avatar. He was soon told he could have no family and have a responsibility to the four nations. In the ceremony where everyone bowed to him, expecting him to accept his role as the Avatar, he did not bow back. The old man apologizes to Aang for luring him down there, as he had lived in poverty because of his absence. Confused, Aang turns to see him surrounded by Fire Nation archers hiding behind soldiers. Other soldiers pour into the chamber - one of them passes the old-man a pouch of money as a reward.",
      "links": [],
      "text": "Appa lands at the Northern Air Temple. As Aang makes his way in the temple ruins, he finds an old-man, an Earth Kingdom villager who has been visiting the temple often. He is surprised to see the Avatar's return and leads Aang to a hidden chamber of statues of past Avatars, each one representing his reincarnations over the years. Avatar Roku was his last life. Aang reveals the airbenders knew he was the Avatar after he chose four toys out of a thousand, the same toys that belonged to the previous Avatar. He was soon told he could have no family and have a responsibility to the four nations. In the ceremony where everyone bowed to him, expecting him to accept his role as the Avatar, he did not bow back. The old man apologizes to Aang for luring him down there, as he had lived in poverty because of his absence. Confused, Aang turns to see him surrounded by Fire Nation archers hiding behind soldiers. Other soldiers pour into the chamber - one of them passes the old-man a pouch of money as a reward."
    },
    {
      "body": "Aang is hanging from chains in a prayer room in the Northern Air Temple. Aang closes his eyes and entered the Spirit World. Aang meets the Dragon Spirit again, who tells him that it has seen a vision of the moon turning red and that the Fire Nation has stolen and are planning to misuse knowledge from the Great Library so Aang has to go to the Northern Water Tribe city before it is too late. When Aang asks if he will stop them, he is pulled from the Spirit World, being woken up by Zhao. Zhao introduces himself and reveals that he set the trap for Aang. Zhao assures Aang that he will not kill him as he will just be reborn again and the search will continue. Zhao notes that when Aang freed the towns, he only used airbending.",
      "links": [],
      "text": "Aang is hanging from chains in a prayer room in the Northern Air Temple. Aang closes his eyes and entered the Spirit World. Aang meets the Dragon Spirit again, who tells him that it has seen a vision of the moon turning red and that the Fire Nation has stolen and are planning to misuse knowledge from the Great Library so Aang has to go to the Northern Water Tribe city before it is too late. When Aang asks if he will stop them, he is pulled from the Spirit World, being woken up by Zhao. Zhao introduces himself and reveals that he set the trap for Aang. Zhao assures Aang that he will not kill him as he will just be reborn again and the search will continue. Zhao notes that when Aang freed the towns, he only used airbending."
    },
    {
      "body": "\"Wake up, young man. I am Commander Zhao. I set this trap for you.\"",
      "links": [],
      "text": "\"Wake up, young man. I am Commander Zhao. I set this trap for you.\""
    },
    {
      "body": "Later, a Fire Nation tank rolled on the bridge that connects to the temple. A blue-masked figure has slipped underneath and grabs onto its undercarriage, hitching a ride. While Zhao addresses his assembly of soldiers, the figure heads toward the prayer room, stealthily taking down the soldiers posted along the way there. He uses his dual dao swords to break Aang free from the chains. Zhao is heading toward the prayer room when he discovers the downed soldiers. The soldier who accompanies him quickly runs back to alert the others that Avatar has escaped and to close the inner gates.",
      "links": [],
      "text": "Later, a Fire Nation tank rolled on the bridge that connects to the temple. A blue-masked figure has slipped underneath and grabs onto its undercarriage, hitching a ride. While Zhao addresses his assembly of soldiers, the figure heads toward the prayer room, stealthily taking down the soldiers posted along the way there. He uses his dual dao swords to break Aang free from the chains. Zhao is heading toward the prayer room when he discovers the downed soldiers. The soldier who accompanies him quickly runs back to alert the others that Avatar has escaped and to close the inner gates."
    },
    {
      "body": "Aang uses his airbending to knock two soldiers block his path. He enters the temple courtyard with the blue-masked figure, referred by the soldiers as the Blue Spirit. They are surrounded by many Fire Nation soldiers. A fire attack from behind forces them to evade and split up, fighting the soldiers on the opposite sides on the courtyard. Aang uses the airbending practice area to take out the soldiers before leaping out of the courtyard and run on the stepping pillars that the soldiers are unable to follow. Aang is about to fly out using his staff-glider but seeing the Blue Spirit still fending off the soldiers by himself, Aang flies back to fight alongside him.",
      "links": [],
      "text": "Aang uses his airbending to knock two soldiers block his path. He enters the temple courtyard with the blue-masked figure, referred by the soldiers as the Blue Spirit. They are surrounded by many Fire Nation soldiers. A fire attack from behind forces them to evade and split up, fighting the soldiers on the opposite sides on the courtyard. Aang uses the airbending practice area to take out the soldiers before leaping out of the courtyard and run on the stepping pillars that the soldiers are unable to follow. Aang is about to fly out using his staff-glider but seeing the Blue Spirit still fending off the soldiers by himself, Aang flies back to fight alongside him."
    },
    {
      "body": "Zhao orders his soldiers not to kill the Avatar, as he will just be reborn again. The Blue Spirit quickly grabs Aang and threateningly holds his sword at Aang's throat. Zhao has no choice but to let them go. The soldiers remain at the courtyard while the Blue Spirit leads Aang across the bridge. At the end of the bridge, Zhao's archer shoots down the Blue Spirit with single arrow. The soldiers rush across the bridge to capture them. Aang discovers the unconscious Blue Spirit was Prince Zuko. He uses his airbending to pull in the fog and mask their getaway. The next morning, he leaves Zuko still unconscious by the camp-fire in the forest, leaping from tree to tree.",
      "links": [],
      "text": "Zhao orders his soldiers not to kill the Avatar, as he will just be reborn again. The Blue Spirit quickly grabs Aang and threateningly holds his sword at Aang's throat. Zhao has no choice but to let them go. The soldiers remain at the courtyard while the Blue Spirit leads Aang across the bridge. At the end of the bridge, Zhao's archer shoots down the Blue Spirit with single arrow. The soldiers rush across the bridge to capture them. Aang discovers the unconscious Blue Spirit was Prince Zuko. He uses his airbending to pull in the fog and mask their getaway. The next morning, he leaves Zuko still unconscious by the camp-fire in the forest, leaping from tree to tree."
    },
    {
      "body": "${link_0} and the Blue Spirit battle alongside each other.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        }
      ],
      "text": "Aang and the Blue Spirit battle alongside each other."
    },
    {
      "body": "A few days later, Zhao arrives at the Fire Nation palace where he is summoned into the throne room. Ozai demands to know how the Avatar escaped. Zhao blames Zuko for the incident, accusing him of being incompetent and a traitor, although Zhao has no proof. Skeptical, Ozai asks if Zhao thought Zuko was the person the soldiers were calling the Blue Spirit. After a long pause, Zhao gives an affirmative yes. However, Ozai instructs Zuko not to be harmed and leaves in his isolation. As for the Avatar, Zhao confirms he is traveling north to master waterbending from the Northern Water Tribe, as he is believed to only have mastery of his birth element, air.",
      "links": [],
      "text": "A few days later, Zhao arrives at the Fire Nation palace where he is summoned into the throne room. Ozai demands to know how the Avatar escaped. Zhao blames Zuko for the incident, accusing him of being incompetent and a traitor, although Zhao has no proof. Skeptical, Ozai asks if Zhao thought Zuko was the person the soldiers were calling the Blue Spirit. After a long pause, Zhao gives an affirmative yes. However, Ozai instructs Zuko not to be harmed and leaves in his isolation. As for the Avatar, Zhao confirms he is traveling north to master waterbending from the Northern Water Tribe, as he is believed to only have mastery of his birth element, air."
    },
    {
      "body": "Meanwhile, back in the Northern Earth Kingdom, Iroh is relaxing and receiving a foot message from an earth villager woman when Zuko walks past him. He informs Zuko that Zhao's men have been searching for him, but tells them Zuko is on vacation with a girl. Seemingly unaware of Zuko's misadventure at the temple, Iroh asks where he had been for the last four days. Zuko replies \"nowhere\", and they should keep moving as the Avatar is traveling again. Iroh tells Zuko to take rest first as he looks like we went through a great deal. As Zuko lays down on his bed in his ship, he notices something hissing near the torch on his wall. Zuko dashes out just before the ship explodes into a huge, orange fireball. Iroh moves into to protect the woman from the blast as he cries out to Zuko.",
      "links": [],
      "text": "Meanwhile, back in the Northern Earth Kingdom, Iroh is relaxing and receiving a foot message from an earth villager woman when Zuko walks past him. He informs Zuko that Zhao's men have been searching for him, but tells them Zuko is on vacation with a girl. Seemingly unaware of Zuko's misadventure at the temple, Iroh asks where he had been for the last four days. Zuko replies \"nowhere\", and they should keep moving as the Avatar is traveling again. Iroh tells Zuko to take rest first as he looks like we went through a great deal. As Zuko lays down on his bed in his ship, he notices something hissing near the torch on his wall. Zuko dashes out just before the ship explodes into a huge, orange fireball. Iroh moves into to protect the woman from the blast as he cries out to Zuko."
    },
    {
      "body": "${link_0} asked ${link_1} for any news of ${link_2}'s whereabouts.",
      "links": [
        {
          "body": "Ozai",
          "key": "${link_0}",
          "target": {
            "href": "Film_Ozai",
            "page": "Film_Ozai"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "href": "Film_Zhao",
            "page": "Film_Zhao"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_2}",
          "target": {
            "href": "Film_Zuko",
            "page": "Film_Zuko"
          }
        }
      ],
      "text": "Ozai asked Zhao for any news of Zuko's whereabouts."
    },
    {
      "body": "Master Pakku lays out their defense strategy to Princess Yue. The city was designed to withstand any assault. Should the Fire Nation soldiers breach the walls, if they keep the soldiers in the courtyard until nightfall, the waterbenders can take advantage of the Moon Spirit's power. They may be overwhelmed if too many soldiers enter the city. As many fire must be put out to minimize firebender sources. Master Pakku insisted on a guard to be with Princess Yue at all times - Sokka volunteered for the assignment.",
      "links": [],
      "text": "Master Pakku lays out their defense strategy to Princess Yue. The city was designed to withstand any assault. Should the Fire Nation soldiers breach the walls, if they keep the soldiers in the courtyard until nightfall, the waterbenders can take advantage of the Moon Spirit's power. They may be overwhelmed if too many soldiers enter the city. As many fire must be put out to minimize firebender sources. Master Pakku insisted on a guard to be with Princess Yue at all times - Sokka volunteered for the assignment."
    },
    {
      "body": "At the Fire Nation palace, Ozai asks Zhao for any news of Zuko's whereabouts but Zhao has none to offer. Ozai notes that the Northern Water Tribe is given their strength by the Moon and Ocean Spirit. In order to defeat them, the spirits must not be involved. Zhao informs Ozai that the location of the spirits has been deciphered from the scrolls stolen from the Great Library. Ozai orders Zhao to eliminate the spirits, take the city, and destroy the Avatar at the same time. The Fire Nation fleet later leaves the ports, heading out to the city.",
      "links": [],
      "text": "At the Fire Nation palace, Ozai asks Zhao for any news of Zuko's whereabouts but Zhao has none to offer. Ozai notes that the Northern Water Tribe is given their strength by the Moon and Ocean Spirit. In order to defeat them, the spirits must not be involved. Zhao informs Ozai that the location of the spirits has been deciphered from the scrolls stolen from the Great Library. Ozai orders Zhao to eliminate the spirits, take the city, and destroy the Avatar at the same time. The Fire Nation fleet later leaves the ports, heading out to the city."
    },
    {
      "body": "Katara and Aang have been attending waterbending classes taught by Master Pakku. One day, after Pakku explains to his students about letting their emotions \"flow like water\" to master water, he invites Aang to spar with him. Pakku encases him in an icy prison; Aang gracefully waterbends the ice away. Pakku sends him three water balls, which Aang successful catches in mid-air and disperses. Aang attempts an offensive move as instructed, but he only manages to raise droplets of water and inadvertently raises the waters in the nearby canals. Aang stops, realizing his still lack control over his incredible waterbending ability, as Pakku and the students watch in astonishment.",
      "links": [],
      "text": "Katara and Aang have been attending waterbending classes taught by Master Pakku. One day, after Pakku explains to his students about letting their emotions \"flow like water\" to master water, he invites Aang to spar with him. Pakku encases him in an icy prison; Aang gracefully waterbends the ice away. Pakku sends him three water balls, which Aang successful catches in mid-air and disperses. Aang attempts an offensive move as instructed, but he only manages to raise droplets of water and inadvertently raises the waters in the nearby canals. Aang stops, realizing his still lack control over his incredible waterbending ability, as Pakku and the students watch in astonishment."
    },
    {
      "body": "${link_0} finally accepted ${link_1}'s offer to join the siege as his military consultant.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Film_Iroh",
            "page": "Film_Iroh"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "href": "Film_Zhao",
            "page": "Film_Zhao"
          }
        }
      ],
      "text": "Iroh finally accepted Zhao's offer to join the siege as his military consultant."
    },
    {
      "body": "On the Fire Nation flagship that is leading the rest of fleet, Iroh meets with Zhao on the upper deck. Zhao thanks him for accepting his invitation to join him on the historic event. Zhao acknowledges Iroh as a gifted military strategist, though noted his failure of at the hundred-day siege of Ba Sing Se, where Iroh's son also died. Iroh thanks Zhao for expressing his condolence for Zuko's death in that terrible \"accident\".",
      "links": [],
      "text": "On the Fire Nation flagship that is leading the rest of fleet, Iroh meets with Zhao on the upper deck. Zhao thanks him for accepting his invitation to join him on the historic event. Zhao acknowledges Iroh as a gifted military strategist, though noted his failure of at the hundred-day siege of Ba Sing Se, where Iroh's son also died. Iroh thanks Zhao for expressing his condolence for Zuko's death in that terrible \"accident\"."
    },
    {
      "body": "Sokka and Princess Yue have been spending enjoy each other's company for weeks. They head over to the fort walls for the ocean view. Yue expresses her wish to spend time in the Southern Water Tribe, when there is safety for everyone. Yue reveals to Sokka that she was a stillborn baby. Her parents prayed to the Moon spirit for days; when she woke up, her hair turned white and remained since.",
      "links": [],
      "text": "Sokka and Princess Yue have been spending enjoy each other's company for weeks. They head over to the fort walls for the ocean view. Yue expresses her wish to spend time in the Southern Water Tribe, when there is safety for everyone. Yue reveals to Sokka that she was a stillborn baby. Her parents prayed to the Moon spirit for days; when she woke up, her hair turned white and remained since."
    },
    {
      "body": "Iroh goes below deck and meets with Zuko, who is still alive. Iroh is sure that Zhao ordered the attack on Zuko. He informs Zuko that they have arrived at the Water Nation stronghold but is concerned that Zhao has no sacredness. Zuko is determined to continue, as he would be allowed to live in peace until he has found the Avatar.",
      "links": [],
      "text": "Iroh goes below deck and meets with Zuko, who is still alive. Iroh is sure that Zhao ordered the attack on Zuko. He informs Zuko that they have arrived at the Water Nation stronghold but is concerned that Zhao has no sacredness. Zuko is determined to continue, as he would be allowed to live in peace until he has found the Avatar."
    },
    {
      "body": "${link_0} reminding ${link_1} that the ${link_2} is heading to her ${link_3}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Film_Sokka",
            "page": "Film_Sokka"
          }
        },
        {
          "body": "Yue",
          "key": "${link_1}",
          "target": {
            "href": "Film_Yue",
            "page": "Film_Yue"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Film_Fire_Nation",
            "page": "Film_Fire_Nation"
          }
        },
        {
          "body": "city",
          "key": "${link_3}",
          "target": {
            "href": "Film_Northern_Water_Tribe",
            "page": "Film_Northern_Water_Tribe"
          }
        }
      ],
      "text": "Sokka reminding Yue that the Fire Nation is heading to her city."
    },
    {
      "body": "Aang and Katara practice their waterbending forms, when black ashes suddenly fall all over the city. Yue is confused. Sokka grimly tells her that the Fire Nation has arrived, knowing the ashes come from the burning engines of the Fire Nation ships.",
      "links": [],
      "text": "Aang and Katara practice their waterbending forms, when black ashes suddenly fall all over the city. Yue is confused. Sokka grimly tells her that the Fire Nation has arrived, knowing the ashes come from the burning engines of the Fire Nation ships."
    },
    {
      "body": "At the rear of the flagship, Zuko wearing a white camouflage suit steps into a small boat. Iroh reminds Zuko to keep his uniform closed up to his neck, and that his chi can warm him in the icy water. Iroh wishes him to be safe as Zuko heads out near the shore of the stronghold and the prince dives in. He finds a spot underneath the city with a thin layer of ice, generates heat from his chi to melt the spot, and breaks through the surface, into an unoccupied room.",
      "links": [],
      "text": "At the rear of the flagship, Zuko wearing a white camouflage suit steps into a small boat. Iroh reminds Zuko to keep his uniform closed up to his neck, and that his chi can warm him in the icy water. Iroh wishes him to be safe as Zuko heads out near the shore of the stronghold and the prince dives in. He finds a spot underneath the city with a thin layer of ice, generates heat from his chi to melt the spot, and breaks through the surface, into an unoccupied room."
    },
    {
      "body": "Sokka takes Aang into the balcony room, to see Princess Yue, who is overseeing the Fire Nation armada with Katara. Aang asks Yue if there is a spiritual place he can meditate to contact the Dragon Spirit for advice in defeating the Fire Nation. Yue knows of one, the most spiritual place, as the city was built around it. She leads Aang, Katara, and Sokka there. Zuko notices them from the rooftops, and follows them to an entrance into the side of an icy hill.",
      "links": [],
      "text": "Sokka takes Aang into the balcony room, to see Princess Yue, who is overseeing the Fire Nation armada with Katara. Aang asks Yue if there is a spiritual place he can meditate to contact the Dragon Spirit for advice in defeating the Fire Nation. Yue knows of one, the most spiritual place, as the city was built around it. She leads Aang, Katara, and Sokka there. Zuko notices them from the rooftops, and follows them to an entrance into the side of an icy hill."
    },
    {
      "body": "${link_0} stayed with ${link_1} as he meditates in the Spirit Oasis",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Film_Katara",
            "page": "Film_Katara"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        }
      ],
      "text": "Katara stayed with Aang as he meditates in the Spirit Oasis"
    },
    {
      "body": "Inside, they step into a spiritual cave with an oasis pond. In the middle of the pond is a tree with a ground path leading to it. Momo reaches into the pond to touch one of the two fish, one black and the other white. Aang scolds him to be nice, so Momo scampers and flies away. Aang reveals that to receive an airbending tattoo, one must be able to meditate for long periods of time without losing focus. As Aang sits down to meditate near the tree, the two fish swirl together in a circle and glow in their insides. Sokka escorts Yue back while Katara stays with Aang.",
      "links": [],
      "text": "Inside, they step into a spiritual cave with an oasis pond. In the middle of the pond is a tree with a ground path leading to it. Momo reaches into the pond to touch one of the two fish, one black and the other white. Aang scolds him to be nice, so Momo scampers and flies away. Aang reveals that to receive an airbending tattoo, one must be able to meditate for long periods of time without losing focus. As Aang sits down to meditate near the tree, the two fish swirl together in a circle and glow in their insides. Sokka escorts Yue back while Katara stays with Aang."
    },
    {
      "body": "As Aang meditates into a trance, Katara tells Aang that she always knew the Avatar was real and would return some day. Zuko voices his agreement - Katara turns surprised to see him there. Zuko sets his torch down to set the grass on fire, as Katara takes a defensive stance. Zuko sends out a fire blast, which she takes out with two large stream of water from the pond. With the second blast, Katara takes it out with a single stream. Impressed with her waterbending ability, Zuko asks who she is. Katara tells him her name and reveals she is the last waterbender from the Southern Water Tribe. Zuko firebends a curved blast and a straight blast. Overwhelmed with the complexity of Zuko's attack, she deflects the curved blast but is knocked hard against the tree with the other. Unconscious, Zuko rests her body next the tree and checks her condition. He explains to her that he is not allowed to return to the Fire Nation without the Avatar.",
      "links": [],
      "text": "As Aang meditates into a trance, Katara tells Aang that she always knew the Avatar was real and would return some day. Zuko voices his agreement - Katara turns surprised to see him there. Zuko sets his torch down to set the grass on fire, as Katara takes a defensive stance. Zuko sends out a fire blast, which she takes out with two large stream of water from the pond. With the second blast, Katara takes it out with a single stream. Impressed with her waterbending ability, Zuko asks who she is. Katara tells him her name and reveals she is the last waterbender from the Southern Water Tribe. Zuko firebends a curved blast and a straight blast. Overwhelmed with the complexity of Zuko's attack, she deflects the curved blast but is knocked hard against the tree with the other. Unconscious, Zuko rests her body next the tree and checks her condition. He explains to her that he is not allowed to return to the Fire Nation without the Avatar."
    },
    {
      "body": "As the large city bell is rung, the Northern Water Tribe residents hurriedly seek for shelter all over the city. Soldiers are seen lining up on the fort walls, overlooking the large Fire Nation fleet nearing its attack range. As Master Pakku gives out the battle cry, the soldiers rattle the end of their spears against the icy floor for morale.",
      "links": [],
      "text": "As the large city bell is rung, the Northern Water Tribe residents hurriedly seek for shelter all over the city. Soldiers are seen lining up on the fort walls, overlooking the large Fire Nation fleet nearing its attack range. As Master Pakku gives out the battle cry, the soldiers rattle the end of their spears against the icy floor for morale."
    },
    {
      "body": "${link_0} talks about ${link_1} and compares her to ${link_2}, as Aang is held captive.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Film_Zuko",
            "page": "Film_Zuko"
          }
        },
        {
          "body": "his sister",
          "key": "${link_1}",
          "target": {
            "href": "Film_Azula",
            "page": "Film_Azula"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        }
      ],
      "text": "Zuko talks about his sister and compares her to Aang, as Aang is held captive."
    },
    {
      "body": "Entering the war room, Iroh advises Zhao that waterbenders get their power from the Moon, so they will get stronger as the day get to the end. Zhao reveals that during the raid of the Great Library, they found a scroll that revealed location of the Moon and Ocean spirits. Iroh says he would be honored to meet them, to which Zhao hoped he could provide the honor.",
      "links": [],
      "text": "Entering the war room, Iroh advises Zhao that waterbenders get their power from the Moon, so they will get stronger as the day get to the end. Zhao reveals that during the raid of the Great Library, they found a scroll that revealed location of the Moon and Ocean spirits. Iroh says he would be honored to meet them, to which Zhao hoped he could provide the honor."
    },
    {
      "body": "The Fire Nation invasion of the Northern Water Tribe stronghold is fully underway. A firebender riding Komodo-Rhino steps off the ship's platform and scales up the icy fort walls. At the top, the firebender uses the fiery metal spheres catapulted from the ship to blast the city below. Spinning drills break through the surface at many locations within the city, where soldiers emerge from the sea below.",
      "links": [],
      "text": "The Fire Nation invasion of the Northern Water Tribe stronghold is fully underway. A firebender riding Komodo-Rhino steps off the ship's platform and scales up the icy fort walls. At the top, the firebender uses the fiery metal spheres catapulted from the ship to blast the city below. Spinning drills break through the surface at many locations within the city, where soldiers emerge from the sea below."
    },
    {
      "body": "Sokka finds Katara lying unconscious near the tree and wakes her up. She tells him that Zuko has taken Aang. Elsewhere, Zuko places Aang in a storage room in the stronghold, still in trance with his hands bound with rope. Zuko peers out the window, looking down the battle taking place below. His plan is to wait until \"everyone is fighting everyone\" before slipping out into the night.",
      "links": [],
      "text": "Sokka finds Katara lying unconscious near the tree and wakes her up. She tells him that Zuko has taken Aang. Elsewhere, Zuko places Aang in a storage room in the stronghold, still in trance with his hands bound with rope. Zuko peers out the window, looking down the battle taking place below. His plan is to wait until \"everyone is fighting everyone\" before slipping out into the night."
    },
    {
      "body": "In the Spirit World, Aang asks the Dragon Spirit how to beat the Fire Nation, but he tells Aang, \"You are not dealing with loss of your people and your responsibilities for their deaths. You are stopping yourself from grieving. You are angry. You must let this go. As the Avatar you are not meant to hurt others ...\" The Dragon slithers past Aang and out of the cave, but soon peers back at Aang and continues, \"Use the Ocean. Show them the power of water. Go ... Do this now ...\" The Dragon spreads its mighty wings and lifts itself into the sky, as Aang leaves his trance.",
      "links": [],
      "text": "In the Spirit World, Aang asks the Dragon Spirit how to beat the Fire Nation, but he tells Aang, \"You are not dealing with loss of your people and your responsibilities for their deaths. You are stopping yourself from grieving. You are angry. You must let this go. As the Avatar you are not meant to hurt others ...\" The Dragon slithers past Aang and out of the cave, but soon peers back at Aang and continues, \"Use the Ocean. Show them the power of water. Go ... Do this now ...\" The Dragon spreads its mighty wings and lifts itself into the sky, as Aang leaves his trance."
    },
    {
      "body": "${link_0} waterbends.",
      "links": [
        {
          "body": "Pakku",
          "key": "${link_0}",
          "target": {
            "href": "Film_Pakku",
            "page": "Film_Pakku"
          }
        }
      ],
      "text": "Pakku waterbends."
    },
    {
      "body": "Aang finds himself hand bound in the storage room, and overhears Zuko talking about his sister, ${link_0}, while he is still looking out the window. His father favors her over him as she was a firebending prodigy, and thinks he was like his mother. Aang takes off, leaping over barrels, with Zuko chasing right behind him. He firebends the flames from the torches to take Aang down, in the process blasting away items in the room.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Film_Azula",
            "page": "Film_Azula"
          }
        }
      ],
      "text": "Aang finds himself hand bound in the storage room, and overhears Zuko talking about his sister, Azula, while he is still looking out the window. His father favors her over him as she was a firebending prodigy, and thinks he was like his mother. Aang takes off, leaping over barrels, with Zuko chasing right behind him. He firebends the flames from the torches to take Aang down, in the process blasting away items in the room."
    },
    {
      "body": "Just outside the stronghold, a firebender concentrates a large flame through a nozzle on a ship to breach the fort wall. He succeeds in creating a hole, which is large enough for Fire Nation soldiers and Komodo rhino-riders to freely enter the city. Master Pakku fights the soldiers in the courtyard using waterbending. Back on the flagship, Iroh advises Zhao to pull his men back; they will be trapped in the city once the Moon empowers and strengthens the waterbenders. Zhao assures Iroh not to worry as he and Ozai have decided to kill the Moon spirit before that happens, much to Iroh's horror.",
      "links": [],
      "text": "Just outside the stronghold, a firebender concentrates a large flame through a nozzle on a ship to breach the fort wall. He succeeds in creating a hole, which is large enough for Fire Nation soldiers and Komodo rhino-riders to freely enter the city. Master Pakku fights the soldiers in the courtyard using waterbending. Back on the flagship, Iroh advises Zhao to pull his men back; they will be trapped in the city once the Moon empowers and strengthens the waterbenders. Zhao assures Iroh not to worry as he and Ozai have decided to kill the Moon spirit before that happens, much to Iroh's horror."
    },
    {
      "body": "Zuko searches for Aang hiding in the storage room. His hands now free, Aang uses airbending to distract Zuko and tries to escape. The situation escalates to a fight, later with firebending and airbending. As the fight turns into a standoff, they notice that room is rumbling. The water in the barrels begins to shake and spirals to Zuko encasing him in ice. Aang turns to see Katara, who sees the flames illuminating from the window of the storage room from the city below. Aang tells Katara that the Dragon Spirit told him what to do. Katara leaves the room with Sokka and Yue. Before leaving the room, he melts the ice around Zuko's head so Zuko can breathe. Aang suggests for Zuko to stay hidden here for his safety, and that they could be friends. Later, Zuko uses his chi-heat to melt the ice and free himself.",
      "links": [],
      "text": "Zuko searches for Aang hiding in the storage room. His hands now free, Aang uses airbending to distract Zuko and tries to escape. The situation escalates to a fight, later with firebending and airbending. As the fight turns into a standoff, they notice that room is rumbling. The water in the barrels begins to shake and spirals to Zuko encasing him in ice. Aang turns to see Katara, who sees the flames illuminating from the window of the storage room from the city below. Aang tells Katara that the Dragon Spirit told him what to do. Katara leaves the room with Sokka and Yue. Before leaving the room, he melts the ice around Zuko's head so Zuko can breathe. Aang suggests for Zuko to stay hidden here for his safety, and that they could be friends. Later, Zuko uses his chi-heat to melt the ice and free himself."
    },
    {
      "body": "${link_0} prepares to eliminate the ${link_1}'s mortal form.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Film_Zhao",
            "page": "Film_Zhao"
          }
        },
        {
          "body": "Moon Spirit",
          "key": "${link_1}",
          "target": {
            "href": "Film_Moon_Spirit",
            "page": "Film_Moon_Spirit"
          }
        }
      ],
      "text": "Zhao prepares to eliminate the Moon Spirit's mortal form."
    },
    {
      "body": "Zhao and Iroh enter the Water Tribe stronghold through the breach, flanked by Fire Nation soldiers. He uses the scroll from the Great Library to lead his men and Iroh to where they needed to go. Appa growls at the soldiers from approaching the civilians. Aang heads toward the courtyard with Sokka, Yue and Katara, when he notices Zhao heading somewhere with the scroll in his hand. He suggests the others to follow Zhao and his men, while he joins the fight in the main courtyard.",
      "links": [],
      "text": "Zhao and Iroh enter the Water Tribe stronghold through the breach, flanked by Fire Nation soldiers. He uses the scroll from the Great Library to lead his men and Iroh to where they needed to go. Appa growls at the soldiers from approaching the civilians. Aang heads toward the courtyard with Sokka, Yue and Katara, when he notices Zhao heading somewhere with the scroll in his hand. He suggests the others to follow Zhao and his men, while he joins the fight in the main courtyard."
    },
    {
      "body": "Zhao and Iroh end up at the same spiritual place where Aang meditated. Zhao introduces to Iroh the Moon and Ocean spirits, the two glowing fish swimming together in the pond. Zhao scoops the white fish into his pouch, about to kill its vulnerable form. Iroh pleads with Zhao not to tamper with the Spirit World. Just then, Katara, Sokka, and Yue burst into the spiritual place. Iroh warns Zhao to stop as the world would go out of balance with the Moon spirit dead. Declaring Fire Nation as gods, Zhao overcomes his hesitation and stabs the fish with his dagger. Princess Yue collapses onto the grass, as if she was the one who was struck. Outside, pain shoots through Aang's head. The moon slowly turns red, casting a sickly crimson glow over the Northern city. The waterbenders also lose the Moon enhanced powers. In rage, Iroh creates large fires from his hands out of nothing, which terrifies Zhao and his men away.",
      "links": [],
      "text": "Zhao and Iroh end up at the same spiritual place where Aang meditated. Zhao introduces to Iroh the Moon and Ocean spirits, the two glowing fish swimming together in the pond. Zhao scoops the white fish into his pouch, about to kill its vulnerable form. Iroh pleads with Zhao not to tamper with the Spirit World. Just then, Katara, Sokka, and Yue burst into the spiritual place. Iroh warns Zhao to stop as the world would go out of balance with the Moon spirit dead. Declaring Fire Nation as gods, Zhao overcomes his hesitation and stabs the fish with his dagger. Princess Yue collapses onto the grass, as if she was the one who was struck. Outside, pain shoots through Aang's head. The moon slowly turns red, casting a sickly crimson glow over the Northern city. The waterbenders also lose the Moon enhanced powers. In rage, Iroh creates large fires from his hands out of nothing, which terrifies Zhao and his men away."
    },
    {
      "body": "With the Moon power gone, more Fire Nation soldiers are pouring into city, through three breaches now made on the fort walls. Aang looks at the losing battle surrounding him, as the Dragon Spirit's words are heard again, reminding him that the Avatar is not meant to hurt others, so Aang must show them \"the power of water\".",
      "links": [],
      "text": "With the Moon power gone, more Fire Nation soldiers are pouring into city, through three breaches now made on the fort walls. Aang looks at the losing battle surrounding him, as the Dragon Spirit's words are heard again, reminding him that the Avatar is not meant to hurt others, so Aang must show them \"the power of water\"."
    },
    {
      "body": "${link_0} says goodbye to ${link_1}.",
      "links": [
        {
          "body": "Yue",
          "key": "${link_0}",
          "target": {
            "href": "Film_Yue",
            "page": "Film_Yue"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Film_Sokka",
            "page": "Film_Sokka"
          }
        }
      ],
      "text": "Yue says goodbye to Sokka."
    },
    {
      "body": "Yue and the others grieve for the loss of the Moon spirit. Iroh notices that Yue has been anointed by the spirit, to which Yue acknowledges. Iroh pleads to Yue to give the life given to her as a child, back to the spirit. Sokka, at the thought of losing Yue, begs her not to, but Yue is convinced she that sacrificing her life to save her people was meant to be. She gives Sokka a final kiss and enters the pond. As her life force leaves her to revive the Moon spirit, her white hair turned black. There is a pause in battle when the Moon reverts to its natural glow.",
      "links": [],
      "text": "Yue and the others grieve for the loss of the Moon spirit. Iroh notices that Yue has been anointed by the spirit, to which Yue acknowledges. Iroh pleads to Yue to give the life given to her as a child, back to the spirit. Sokka, at the thought of losing Yue, begs her not to, but Yue is convinced she that sacrificing her life to save her people was meant to be. She gives Sokka a final kiss and enters the pond. As her life force leaves her to revive the Moon spirit, her white hair turned black. There is a pause in battle when the Moon reverts to its natural glow."
    },
    {
      "body": "Zhao is on a bridge, seemingly in despair of his failure of killing the Moon, when Zuko steps out from the mist, walking toward him. Zhao says he had him killed. Zuko prepares to duel Zhao when Iroh appears and tells him to walk away. The Fire Nation soldiers have overrun the city - there is no way Zuko could take the Avatar now. Iroh points out that fighting Zhao will lead to him being captured instead, presumably so Zhao would have someone to blame for should the siege failed and not go back empty-handed. As Zuko turns away, the enraged Zhao bends a large double-spiral fire attack to them. Iroh redirects the flames to sides, shielding him and Zuko. They leave Zhao standing alone on the bridge.",
      "links": [],
      "text": "Zhao is on a bridge, seemingly in despair of his failure of killing the Moon, when Zuko steps out from the mist, walking toward him. Zhao says he had him killed. Zuko prepares to duel Zhao when Iroh appears and tells him to walk away. The Fire Nation soldiers have overrun the city - there is no way Zuko could take the Avatar now. Iroh points out that fighting Zhao will lead to him being captured instead, presumably so Zhao would have someone to blame for should the siege failed and not go back empty-handed. As Zuko turns away, the enraged Zhao bends a large double-spiral fire attack to them. Iroh redirects the flames to sides, shielding him and Zuko. They leave Zhao standing alone on the bridge."
    },
    {
      "body": "The flames have attracted the attention of four waterbenders, now blocking Zhao's path off the bridge. Outnumbered, Zhao has no way of escaping and no chance of defeating them, especially with the return of the Moon's power. Refusing to surrender, Zhao provokes the waterbenders by bending a fire shot that barely hit any of the waterbenders. He takes off his cloak and waits to be finished off. Four large streams of water bent from the river below engulf Zhao into a water sphere, drowning him.",
      "links": [],
      "text": "The flames have attracted the attention of four waterbenders, now blocking Zhao's path off the bridge. Outnumbered, Zhao has no way of escaping and no chance of defeating them, especially with the return of the Moon's power. Refusing to surrender, Zhao provokes the waterbenders by bending a fire shot that barely hit any of the waterbenders. He takes off his cloak and waits to be finished off. Four large streams of water bent from the river below engulf Zhao into a water sphere, drowning him."
    },
    {
      "body": "${link_0} uses his abilities as the ${link_1} to create a massive wave to destroy the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Fire Navy",
          "key": "${link_2}",
          "target": {
            "href": "Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        }
      ],
      "text": "Aang uses his abilities as the Avatar to create a massive wave to destroy the Fire Navy."
    },
    {
      "body": "Aang races toward the fort wall, using waterbending to trap and stop Fire Nation soldiers along the way. He sends an airbending blast through the courtyard, opening a path through the battle forces, leading him right to the wall. At the top, he looks out at the vast Fire Nation fleet in the ocean. Letting his emotions \"flow like water\", he recalls images of his life with Monk Gyatso and his friends and the fateful event where everyone bowed to him but ran away instead of bowing back. Freeing himself of his guilt, Aang uses with the Ocean's power to push a massive body of water up against the fort wall, and Moon's power to pull it toward the sky. His eyes and tattoos glow bluish-white as he unleashes the power of water. The battle pauses again at the incredible feat of waterbending. The Fire Nation soldiers in the city try to retreat through a breach but it is blocked by the water. Aang bends the water toward the Fire Nation fleet but keeps it hovering threateningly above them. Knowing that the water could easily crush the fleet, the Fire Nation accepts defeat and turns away. Aang bends the water back into the ocean and watches the fleet in retreat.",
      "links": [],
      "text": "Aang races toward the fort wall, using waterbending to trap and stop Fire Nation soldiers along the way. He sends an airbending blast through the courtyard, opening a path through the battle forces, leading him right to the wall. At the top, he looks out at the vast Fire Nation fleet in the ocean. Letting his emotions \"flow like water\", he recalls images of his life with Monk Gyatso and his friends and the fateful event where everyone bowed to him but ran away instead of bowing back. Freeing himself of his guilt, Aang uses with the Ocean's power to push a massive body of water up against the fort wall, and Moon's power to pull it toward the sky. His eyes and tattoos glow bluish-white as he unleashes the power of water. The battle pauses again at the incredible feat of waterbending. The Fire Nation soldiers in the city try to retreat through a breach but it is blocked by the water. Aang bends the water toward the Fire Nation fleet but keeps it hovering threateningly above them. Knowing that the water could easily crush the fleet, the Fire Nation accepts defeat and turns away. Aang bends the water back into the ocean and watches the fleet in retreat."
    },
    {
      "body": "Katara hugs Aang as he is cheered from the city below. She and Sokka help an exhausted Aang down the stairs into the courtyard. Aang sees the entire Northern Water Tribe waiting for him. They all kneel and bow before him. The remaining Fire Nation soldiers leaving the city also bow, in awe of his power and moved by his show of mercy. Katara says, \"They want you to be their Avatar, Aang. We all do\", before she and Sokka bowed alongside the others. Finally accepting his role as the Avatar, he bowed back.",
      "links": [],
      "text": "Katara hugs Aang as he is cheered from the city below. She and Sokka help an exhausted Aang down the stairs into the courtyard. Aang sees the entire Northern Water Tribe waiting for him. They all kneel and bow before him. The remaining Fire Nation soldiers leaving the city also bow, in awe of his power and moved by his show of mercy. Katara says, \"They want you to be their Avatar, Aang. We all do\", before she and Sokka bowed alongside the others. Finally accepting his role as the Avatar, he bowed back."
    },
    {
      "body": "Rather than Katara's narration, the story closes with Ozai's exposition at the Fire Nation place, directed to his daughter Azula, who is kneeling before him:",
      "links": [],
      "text": "Rather than Katara's narration, the story closes with Ozai's exposition at the Fire Nation place, directed to his daughter Azula, who is kneeling before him:"
    },
    {
      "body": "Azula looks up and said \"I do, father\", unable to hide her twisted smile.",
      "links": [],
      "text": "Azula looks up and said \"I do, father\", unable to hide her twisted smile."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Film:Synopsis_of_The_Last_Airbender",
    "file": "avatar.wikia.com/wiki/Film_Synopsis_of_The_Last_Airbender.html",
    "page": "Film_Synopsis_of_The_Last_Airbender",
    "title": "Synopsis of The Last Airbender"
  }
}