{
  "categories": [
    {
      "body": "Articles to be expanded",
      "target": {
        "href": "Category_Articles_to_be_expanded",
        "page": "Category_Articles_to_be_expanded"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Books",
      "target": {
        "href": "Category_Books",
        "page": "Category_Books"
      }
    },
    {
      "body": "Films",
      "target": {
        "href": "Category_Films",
        "page": "Category_Films"
      }
    },
    {
      "body": "Print publications",
      "target": {
        "href": "Category_Print_publications",
        "page": "Category_Print_publications"
      }
    },
    {
      "body": "Real world",
      "target": {
        "href": "Category_Real_world",
        "page": "Category_Real_world"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page needs to be expanded in order to include more relevant information.",
      "links": [],
      "text": "This page needs to be expanded in order to include more relevant information."
    },
    {
      "body": "The novel's cover features ${link_0}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        }
      ],
      "text": "The novel's cover features Aang."
    },
    {
      "body": "The Last Airbender Movie Novelization (ISBN 978-1-4424-0174-7) is an adaptation of ${link_0} written by Michael Teitelbaum. It consists of 16 chapters plus a short Prologue and Epilogue, spread over 124 pages.",
      "links": [
        {
          "body": "The Last Airbender",
          "key": "${link_0}",
          "target": {
            "href": "Film_The_Last_Airbender",
            "page": "Film_The_Last_Airbender"
          }
        }
      ],
      "text": "The Last Airbender Movie Novelization (ISBN 978-1-4424-0174-7) is an adaptation of The Last Airbender written by Michael Teitelbaum. It consists of 16 chapters plus a short Prologue and Epilogue, spread over 124 pages."
    },
    {
      "body": "The book begins with ${link_0} and ${link_1} stepping out of their canoe onto an ice patch next to the small river they had been in. Katara attempts to ${link_2}, creating a small bubble that floats out of the river. However, she stumbles, and the water splashes Sokka. The two argue for a while before Sokka sees the tracks of a ${link_3}. They start to follow it, when Katara notices a strange glow coming from the under the ice. Sokka strikes the ground with his boomerang. Cracks in the ice appear, and the two of them run away from the spiderweb of fractures. A huge ball of ice rises to the surface. Katara sees a boy and a large creature frozen inside. She opens it with the boomerang. ${link_4} and ${link_5} are found inside. Aang is barely conscious, so Katara and Sokka take him back to ${link_6}. There, Aang finally awakens. Sokka sees a ${link_7} warship heading toward the village, and he prepares the tribe for a battle.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Film_Katara",
            "page": "Film_Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Film_Sokka",
            "page": "Film_Sokka"
          }
        },
        {
          "body": "waterbend",
          "key": "${link_2}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "tiger seal",
          "key": "${link_3}",
          "target": {
            "href": "Tiger_seal",
            "page": "Tiger_seal"
          }
        },
        {
          "body": "Appa",
          "key": "${link_4}",
          "target": {
            "href": "Film_Appa",
            "page": "Film_Appa"
          }
        },
        {
          "body": "Aang",
          "key": "${link_5}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        },
        {
          "body": "the tribe",
          "key": "${link_6}",
          "target": {
            "href": "Film_Southern_Water_Tribe",
            "page": "Film_Southern_Water_Tribe"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_7}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "The book begins with Katara and Sokka stepping out of their canoe onto an ice patch next to the small river they had been in. Katara attempts to waterbend, creating a small bubble that floats out of the river. However, she stumbles, and the water splashes Sokka. The two argue for a while before Sokka sees the tracks of a tiger seal. They start to follow it, when Katara notices a strange glow coming from the under the ice. Sokka strikes the ground with his boomerang. Cracks in the ice appear, and the two of them run away from the spiderweb of fractures. A huge ball of ice rises to the surface. Katara sees a boy and a large creature frozen inside. She opens it with the boomerang. Appa and Aang are found inside. Aang is barely conscious, so Katara and Sokka take him back to the tribe. There, Aang finally awakens. Sokka sees a Fire Nation warship heading toward the village, and he prepares the tribe for a battle."
    },
    {
      "body": "The ship stops in the village. ${link_0} walks out of it and into the village, proclaiming that he is the ${link_1}. His soldiers break into the igloos and huts and capture all the elderly, including Katara's and Sokka's ${link_2}, to be taken prisoner by Zuko. Aang is found in one of the huts by a soldier. The soldier sees his tattoos, and he takes Aang to Zuko. Aang alone is taken aboard the ship. Katara and Sokka depart from the Water Tribe on Appa after the ship.",
      "links": [
        {
          "body": "Prince Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Film_Zuko",
            "page": "Film_Zuko"
          }
        },
        {
          "body": "Prince of the Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "grandmother",
          "key": "${link_2}",
          "target": {
            "href": "Film_Kanna",
            "page": "Film_Kanna"
          }
        }
      ],
      "text": "The ship stops in the village. Prince Zuko walks out of it and into the village, proclaiming that he is the Prince of the Fire Nation. His soldiers break into the igloos and huts and capture all the elderly, including Katara's and Sokka's grandmother, to be taken prisoner by Zuko. Aang is found in one of the huts by a soldier. The soldier sees his tattoos, and he takes Aang to Zuko. Aang alone is taken aboard the ship. Katara and Sokka depart from the Water Tribe on Appa after the ship."
    },
    {
      "body": "On the ship, ${link_0} places objects on a table in front of Aang. First, a flickering candle, which grows into a tall flame once in front of the ${link_1}. Second, Iroh pours some water onto the table. The puddle shapes itself into a perfect circle. Third, a rock is placed in front of Aang at a precarious angle. The rock defies gravity and does not fall over. This involuntary control over the elements proves that Aang is the ${link_2}. Zuko tells him he is going to be kept prisoner, but Aang escapes easily using his ${link_3}. He meets up with Sokka, Katara, and Appa, and they begin to fly toward the ${link_4}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Film_Iroh",
            "page": "Film_Iroh"
          }
        },
        {
          "body": "airbender",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "glider",
          "key": "${link_3}",
          "target": {
            "href": "Airbender_staff",
            "page": "Airbender_staff"
          }
        },
        {
          "body": "Southern Air Temple",
          "key": "${link_4}",
          "target": {
            "href": "Film_Southern_Air_Temple",
            "page": "Film_Southern_Air_Temple"
          }
        }
      ],
      "text": "On the ship, Iroh places objects on a table in front of Aang. First, a flickering candle, which grows into a tall flame once in front of the airbender. Second, Iroh pours some water onto the table. The puddle shapes itself into a perfect circle. Third, a rock is placed in front of Aang at a precarious angle. The rock defies gravity and does not fall over. This involuntary control over the elements proves that Aang is the Avatar. Zuko tells him he is going to be kept prisoner, but Aang escapes easily using his glider. He meets up with Sokka, Katara, and Appa, and they begin to fly toward the Southern Air Temple."
    },
    {
      "body": "At the temple, the group meets ${link_0}, a \"${link_1}\". Soon after, Aang discovers that the Fire Nation had killed all the airbenders. He goes into the ${link_2} out of rage and loss. He enters the ${link_3} while in the state, and he meets a dragon. The dragon tells him that the human and Spirit World are in danger. Katara eventually manages to calm him enough that he drifts back out of the Avatar State.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "href": "Film_Momo",
            "page": "Film_Momo"
          }
        },
        {
          "body": "flying lemur bat",
          "key": "${link_1}",
          "target": {
            "href": "Winged_lemur",
            "page": "Winged_lemur"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "At the temple, the group meets Momo, a \"flying lemur bat\". Soon after, Aang discovers that the Fire Nation had killed all the airbenders. He goes into the Avatar State out of rage and loss. He enters the Spirit World while in the state, and he meets a dragon. The dragon tells him that the human and Spirit World are in danger. Katara eventually manages to calm him enough that he drifts back out of the Avatar State."
    },
    {
      "body": "On a Fire Nation vessel out at sea, a guard tells ${link_0} that he has spotted Prince Zuko's ship. Zhao decides to invite him and Iroh to his ship for a meal. During the meal, Zhao cleverly taunts Zuko about playing with little girls when he was younger. He subsequently mocks him for believing the Avatar is still in existence. He reminds Zuko that he is not allowed to wear a soldier's uniform during his banishment. At this, Zuko leaves the ship.",
      "links": [
        {
          "body": "Commander Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Film_Zhao",
            "page": "Film_Zhao"
          }
        }
      ],
      "text": "On a Fire Nation vessel out at sea, a guard tells Commander Zhao that he has spotted Prince Zuko's ship. Zhao decides to invite him and Iroh to his ship for a meal. During the meal, Zhao cleverly taunts Zuko about playing with little girls when he was younger. He subsequently mocks him for believing the Avatar is still in existence. He reminds Zuko that he is not allowed to wear a soldier's uniform during his banishment. At this, Zuko leaves the ship."
    },
    {
      "body": "In a forest in the Earth Kingdom, Aang confirms to Sokka and Katara that he is the Avatar. Just after, a boy runs out of the trees, Fire Nation soldiers after him. The soldiers tell them that he is being arrested for earthbending stones at them. Katara tries to stop them with waterbending, but fails, and the three of them (along with Momo) get arrested as well. They are all taken to a prison in a ruined ${link_0} village controlled by the Fire Nation. There, they are introduced to the boy's father. Aang, Katara, and the boy's father convince the ${link_1} in the prison to break out. The group makes their way back to the forest.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "earthbenders",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "In a forest in the Earth Kingdom, Aang confirms to Sokka and Katara that he is the Avatar. Just after, a boy runs out of the trees, Fire Nation soldiers after him. The soldiers tell them that he is being arrested for earthbending stones at them. Katara tries to stop them with waterbending, but fails, and the three of them (along with Momo) get arrested as well. They are all taken to a prison in a ruined Earth Kingdom village controlled by the Fire Nation. There, they are introduced to the boy's father. Aang, Katara, and the boy's father convince the earthbenders in the prison to break out. The group makes their way back to the forest."
    },
    {
      "body": "In a small town in the Earth Kingdom, Kyoshi Village (taking the place of Kyoshi Island), Aang is told about Avatar ${link_0} by an old man. Aang realizes he has to master the other three elements, so he tells Sokka and Katara they must head toward the Northern Water Tribe.",
      "links": [
        {
          "body": "Kyoshi",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        }
      ],
      "text": "In a small town in the Earth Kingdom, Kyoshi Village (taking the place of Kyoshi Island), Aang is told about Avatar Kyoshi by an old man. Aang realizes he has to master the other three elements, so he tells Sokka and Katara they must head toward the Northern Water Tribe."
    },
    {
      "body": "In the ${link_0}'s ${link_1}, Commander Zhao speaks with ${link_2}. He tells the Fire Lord about the ${link_3}, and the rebellions caused by him. After Zhao reveals he has visited the \"${link_4}\", they decide to set a trap for the Avatar at the ${link_5}.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "palace",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_Royal_Palace",
            "page": "Fire_Nation_Royal_Palace"
          }
        },
        {
          "body": "Fire Lord Ozai",
          "key": "${link_2}",
          "target": {
            "href": "Film_Ozai",
            "page": "Film_Ozai"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Great Library",
          "key": "${link_4}",
          "target": {
            "href": "Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "Northern Air Temple",
          "key": "${link_5}",
          "target": {
            "href": "Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        }
      ],
      "text": "In the Fire Lord's palace, Commander Zhao speaks with Fire Lord Ozai. He tells the Fire Lord about the Avatar, and the rebellions caused by him. After Zhao reveals he has visited the \"Great Library\", they decide to set a trap for the Avatar at the Northern Air Temple."
    },
    {
      "body": "Despite Sokka and Katara's warning of the Fire Nation, Aang departs on Appa from ${link_0}'s campsite toward the Northern Air Temple. There, he meets an old man who takes him into the ${link_1}. After talking about Avatar ${link_2}, hundreds of Fire Nation archers step into the room, their bows targeting Aang. One of the archers pays the old man for luring the Avatar into the room, and the man scurries away. Aang is chained in the prayer room of the temple. While inside, he reenters the Spirit World, and visits the dragon. It tells him that the Fire Nation has visited the library, and that they will attack the Northern Water Tribe. Aang must master waterbending and stop the Fire Nation at the North Pole.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Avatar Sanctuary",
          "key": "${link_1}",
          "target": {
            "href": "Air_temple_sanctuaries",
            "page": "Air_temple_sanctuaries"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        }
      ],
      "text": "Despite Sokka and Katara's warning of the Fire Nation, Aang departs on Appa from Team Avatar's campsite toward the Northern Air Temple. There, he meets an old man who takes him into the Avatar Sanctuary. After talking about Avatar Roku, hundreds of Fire Nation archers step into the room, their bows targeting Aang. One of the archers pays the old man for luring the Avatar into the room, and the man scurries away. Aang is chained in the prayer room of the temple. While inside, he reenters the Spirit World, and visits the dragon. It tells him that the Fire Nation has visited the library, and that they will attack the Northern Water Tribe. Aang must master waterbending and stop the Fire Nation at the North Pole."
    },
    {
      "body": "At the camp where Katara and Sokka were staying, they are attacked by Fire Nation soldiers as they are unarmed. They are saved by the Kyoshi Warriors, who had been following them all this time. The warriors stay with the group until Aang returns.",
      "links": [],
      "text": "At the camp where Katara and Sokka were staying, they are attacked by Fire Nation soldiers as they are unarmed. They are saved by the Kyoshi Warriors, who had been following them all this time. The warriors stay with the group until Aang returns."
    },
    {
      "body": "As Aang wakes up from his journey into the Spirit World, Zhao taunts him about the death of his people and only being able to bend one element. After he leaves, a dark, mysterious figure in a mask, called the \"Blue Spirit\" by the guards, rescues Aang. After barely managing to escape the temple, the mysterious figure is shot in the mask with an arrow. Aang rescues him in turn, taking him away from the temple. The figure is revealed to be Zuko. After he regains consciousness, he immediately begins ${link_0} at Aang. The airbender dashes away toward where he left Appa.",
      "links": [
        {
          "body": "firebending",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "As Aang wakes up from his journey into the Spirit World, Zhao taunts him about the death of his people and only being able to bend one element. After he leaves, a dark, mysterious figure in a mask, called the \"Blue Spirit\" by the guards, rescues Aang. After barely managing to escape the temple, the mysterious figure is shot in the mask with an arrow. Aang rescues him in turn, taking him away from the temple. The figure is revealed to be Zuko. After he regains consciousness, he immediately begins firebending at Aang. The airbender dashes away toward where he left Appa."
    },
    {
      "body": "${link_0} and ${link_1} are among the ${link_2} villagers.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Film_Sokka",
            "page": "Film_Sokka"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Film_Katara",
            "page": "Film_Katara"
          }
        },
        {
          "body": "Southern Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Film_Southern_Water_Tribe",
            "page": "Film_Southern_Water_Tribe"
          }
        }
      ],
      "text": "Sokka and Katara are among the Southern Tribe villagers."
    },
    {
      "body": "The version of the movie the novelization was based on is estimated to be 20-30 minutes longer than the final cut, which may be what Shyamalan alluded to when he said in the NY Magazine Interview, \"I'm dying to make a two-hour movie, I just haven't earned it yet.\" Moreover, story elements suggestive of ${link_0} was noticeably taken out in the movie, likely due to poor on-screen chemistry between ${link_1} and ${link_2} during the test-screening. In general, the scenes and dialogue were trimmed here and there, mostly keeping the sentences that are necessary to convey the plot. Some of the longer dialogue can be heard in the Blu-ray/DVD documentaries, such as when Zuko said, \"Don't even try to escape. This is a warship! The room is made entirely of impregnable metal. There are armed guards outside the room, and my uncle and I are expert firebenders.\" The movie cut the dialogue after \"This is a warship!\" Other than that, the key differences between the novelization and the movie include:",
      "links": [
        {
          "body": "Kataang",
          "key": "${link_0}",
          "target": {
            "href": "Shipping",
            "page": "Shipping"
          }
        },
        {
          "body": "Noah Ringer",
          "key": "${link_1}",
          "target": {
            "href": "Noah_Ringer",
            "page": "Noah_Ringer"
          }
        },
        {
          "body": "Nicola Peltz",
          "key": "${link_2}",
          "target": {
            "href": "Nicola_Peltz",
            "page": "Nicola_Peltz"
          }
        }
      ],
      "text": "The version of the movie the novelization was based on is estimated to be 20-30 minutes longer than the final cut, which may be what Shyamalan alluded to when he said in the NY Magazine Interview, \"I'm dying to make a two-hour movie, I just haven't earned it yet.\" Moreover, story elements suggestive of Kataang was noticeably taken out in the movie, likely due to poor on-screen chemistry between Noah Ringer and Nicola Peltz during the test-screening. In general, the scenes and dialogue were trimmed here and there, mostly keeping the sentences that are necessary to convey the plot. Some of the longer dialogue can be heard in the Blu-ray/DVD documentaries, such as when Zuko said, \"Don't even try to escape. This is a warship! The room is made entirely of impregnable metal. There are armed guards outside the room, and my uncle and I are expert firebenders.\" The movie cut the dialogue after \"This is a warship!\" Other than that, the key differences between the novelization and the movie include:"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Film:The_Last_Airbender_Movie_Novelization",
    "file": "avatar.wikia.com/wiki/Film_The_Last_Airbender_Movie_Novelization.html",
    "page": "Film_The_Last_Airbender_Movie_Novelization",
    "title": "The Last Airbender Movie Novelization"
  }
}