{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Films",
      "target": {
        "href": "Category_Films",
        "page": "Category_Films"
      }
    },
    {
      "body": "Real world",
      "target": {
        "href": "Category_Real_world",
        "page": "Category_Real_world"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "M. Night Shyamalan Interview by Bryan Konietzko and Mike DiMartino",
      "links": [],
      "text": "M. Night Shyamalan Interview by Bryan Konietzko and Mike DiMartino"
    },
    {
      "body": "After ${link_0} was attached to the film trilogy, he was \"interviewed\" by ${link_1} and ${link_2}.",
      "links": [
        {
          "body": "M. Night Shyamalan",
          "key": "${link_0}",
          "target": {
            "href": "Film_M",
            "page": "Film_M"
          }
        },
        {
          "body": "Bryan Konietzko",
          "key": "${link_1}",
          "target": {
            "href": "Bryan_Konietzko",
            "page": "Bryan_Konietzko"
          }
        },
        {
          "body": "Michael Dante DiMartino",
          "key": "${link_2}",
          "target": {
            "href": "Michael_Dante_DiMartino",
            "page": "Michael_Dante_DiMartino"
          }
        }
      ],
      "text": "After M. Night Shyamalan was attached to the film trilogy, he was \"interviewed\" by Bryan Konietzko and Michael Dante DiMartino."
    },
    {
      "body": "In the video \"interview\" of ${link_0} conducted by ${link_1} and ${link_2}, the film trilogy was planned to be 6+ hours long, which gave 2+ hours for the first movie (though the final running time is 103 minutes). Due to the short allotted running time, the film does not cover the entire first season of the original animated series, even though the film was titled \"Book One: Water\". With such a rich and complex story elements, rather than a \"comprehensive adaptation\" like Harry Potter and Lord of the Rings, ${link_3} from Avatar: The Last Airbender were selected and rewoven into its own story and direction, similar to a \"selective adaptation\" approach with a long series like Spider-man and X-Men. However, some fans mistaken the film as poorly executed \"comprehensive adaptation\" and insisted on a direct comparison with its original animated series.",
      "links": [
        {
          "body": "M. Night Shyamalan",
          "key": "${link_0}",
          "target": {
            "href": "Film_M",
            "page": "Film_M"
          }
        },
        {
          "body": "Bryan Konietzko",
          "key": "${link_1}",
          "target": {
            "href": "Bryan_Konietzko",
            "page": "Bryan_Konietzko"
          }
        },
        {
          "body": "Mike DiMartino",
          "key": "${link_2}",
          "target": {
            "href": "Michael_Dante_DiMartino",
            "page": "Michael_Dante_DiMartino"
          }
        },
        {
          "body": "elements",
          "key": "${link_3}",
          "target": {
            "href": "Film_Elements_from_Avatar__The_Last_Airbender",
            "page": "Film_Elements_from_Avatar__The_Last_Airbender"
          }
        }
      ],
      "text": "In the video \"interview\" of M. Night Shyamalan conducted by Bryan Konietzko and Mike DiMartino, the film trilogy was planned to be 6+ hours long, which gave 2+ hours for the first movie (though the final running time is 103 minutes). Due to the short allotted running time, the film does not cover the entire first season of the original animated series, even though the film was titled \"Book One: Water\". With such a rich and complex story elements, rather than a \"comprehensive adaptation\" like Harry Potter and Lord of the Rings, elements from Avatar: The Last Airbender were selected and rewoven into its own story and direction, similar to a \"selective adaptation\" approach with a long series like Spider-man and X-Men. However, some fans mistaken the film as poorly executed \"comprehensive adaptation\" and insisted on a direct comparison with its original animated series."
    },
    {
      "body": "Shyamalan collaborated with ${link_0} and ${link_1} to identify these essential elements and work out a plot for Shyamalan to write a screenplay with.",
      "links": [
        {
          "body": "Bryan Konietzko",
          "key": "${link_0}",
          "target": {
            "href": "Bryan_Konietzko",
            "page": "Bryan_Konietzko"
          }
        },
        {
          "body": "Mike DiMartino",
          "key": "${link_1}",
          "target": {
            "href": "Michael_Dante_DiMartino",
            "page": "Michael_Dante_DiMartino"
          }
        }
      ],
      "text": "Shyamalan collaborated with Bryan Konietzko and Mike DiMartino to identify these essential elements and work out a plot for Shyamalan to write a screenplay with."
    },
    {
      "body": "The bending arts were reworked with Shyamalan new story parameter of firebenders requiring sources of fires, which \"evens the (playing) field\". Appa's arrow was removed, although as far as not needing wings to fly like Momo, Shyamalan said, \"Appa can just fly. It was too much to change the entire structure of that creature to make it appropriate to physics.\"",
      "links": [],
      "text": "The bending arts were reworked with Shyamalan new story parameter of firebenders requiring sources of fires, which \"evens the (playing) field\". Appa's arrow was removed, although as far as not needing wings to fly like Momo, Shyamalan said, \"Appa can just fly. It was too much to change the entire structure of that creature to make it appropriate to physics.\""
    },
    {
      "body": "The negative fan reactions for the upcoming movie were parodied in \"${link_0}\".",
      "links": [
        {
          "body": "The Ember Island Players",
          "key": "${link_0}",
          "target": {
            "href": "The_Ember_Island_Players",
            "page": "The_Ember_Island_Players"
          }
        }
      ],
      "text": "The negative fan reactions for the upcoming movie were parodied in \"The Ember Island Players\"."
    },
    {
      "body": "Shyamalan was attached to the movie in January 8, 2007 before season three was completed (i.e. \"when I met Mike and Bryan, they hadn't finished season three\"). Since ${link_0} episode was aired in July 18 2008, the play in that episode was likely in reference of the upcoming movie, before its actual filming began in mid-March 2009. Very likely, the show creators anticipated the negative fan reactions of the film adaptation for ${link_1}, based on their own experience with film adaptations of favorite shows from their own past. However, they remained executive producers for the film and even took part in the BR/DVD documentaries for the movie. Since they have neither publicly praised nor condemned the movie, they may have taken the stance of not endorsing any particular view of the movie, and thus want fans of the original series to make up their own minds with M. Night Shyamalan's film adaptation.",
      "links": [
        {
          "body": "The Ember Island Players",
          "key": "${link_0}",
          "target": {
            "href": "The_Ember_Island_Players",
            "page": "The_Ember_Island_Players"
          }
        },
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_1}",
          "target": {
            "href": "Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        }
      ],
      "text": "Shyamalan was attached to the movie in January 8, 2007 before season three was completed (i.e. \"when I met Mike and Bryan, they hadn't finished season three\"). Since The Ember Island Players episode was aired in July 18 2008, the play in that episode was likely in reference of the upcoming movie, before its actual filming began in mid-March 2009. Very likely, the show creators anticipated the negative fan reactions of the film adaptation for Avatar: The Last Airbender, based on their own experience with film adaptations of favorite shows from their own past. However, they remained executive producers for the film and even took part in the BR/DVD documentaries for the movie. Since they have neither publicly praised nor condemned the movie, they may have taken the stance of not endorsing any particular view of the movie, and thus want fans of the original series to make up their own minds with M. Night Shyamalan's film adaptation."
    },
    {
      "body": "The film's map of the Avatar world was altered from that of the series.",
      "links": [],
      "text": "The film's map of the Avatar world was altered from that of the series."
    },
    {
      "body": "The film took many elements from ${link_0}. The main article has a list of elements taken from the original animated series that are otherwise omitted or changed, e.g. the ${link_1}. The inclusion in the movie may not follow the same order as the series – see the ${link_2} to see how these elements were incorporated into its own story and direction.",
      "links": [
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_0}",
          "target": {
            "href": "Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_1}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "synopsis",
          "key": "${link_2}",
          "target": {
            "href": "Film_Synopsis_of_The_Last_Airbender",
            "page": "Film_Synopsis_of_The_Last_Airbender"
          }
        }
      ],
      "text": "The film took many elements from Avatar: The Last Airbender. The main article has a list of elements taken from the original animated series that are otherwise omitted or changed, e.g. the Avatar State. The inclusion in the movie may not follow the same order as the series – see the synopsis to see how these elements were incorporated into its own story and direction."
    },
    {
      "body": "Zuko's anti-hero status was done with less subtlety in the film, rather than revealed throughout the original animated series, which highlighted the moment this status was confirmed when Zuko turned against his father and joined Aang. Shyamalan may have established Zuko's anti-hero status more quickly due to the racebending controversy, with Zuko cast was with a dark-skinned minority actor, while the hero side (Aang, Sokka, and Katara) cast with light-skinned actors.",
      "links": [],
      "text": "Zuko's anti-hero status was done with less subtlety in the film, rather than revealed throughout the original animated series, which highlighted the moment this status was confirmed when Zuko turned against his father and joined Aang. Shyamalan may have established Zuko's anti-hero status more quickly due to the racebending controversy, with Zuko cast was with a dark-skinned minority actor, while the hero side (Aang, Sokka, and Katara) cast with light-skinned actors."
    },
    {
      "body": "A common storytelling technique to avoid confusing the anti-hero as \"another villian\" that rivals the real villain in the story, is to have a \"good\" character vouch for the anti-hero, e.g. Albus Dumbledore for Severus Snape in the Harry Potter series and Gwen Tennyson for the Kevin Levin in the Ben 10: Alien Force series. For the original animated series, it was Iroh and later ${link_0} as well.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "A common storytelling technique to avoid confusing the anti-hero as \"another villian\" that rivals the real villain in the story, is to have a \"good\" character vouch for the anti-hero, e.g. Albus Dumbledore for Severus Snape in the Harry Potter series and Gwen Tennyson for the Kevin Levin in the Ben 10: Alien Force series. For the original animated series, it was Iroh and later Toph as well."
    },
    {
      "body": "Depending on how the show creators originated the names and terms, a few were given a different pronunciation, rather than an American pronunciation: ${link_0} (ɑːŋ), ${link_1} (Sōka), ${link_2} (ɪˈroʊ), ${link_3} (ɑvətɑr), and ${link_4} (अग्नि की डूएल). Shyamalan said the show creators were \"pretty supportive\" of the change, initiated after ${link_5} asked during a rehearsal, \"Why are we pronouncing Iroh like 'Eye-roh'?\"",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_2}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Agni kī Duel",
          "key": "${link_4}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        },
        {
          "body": "Shaun Toub",
          "key": "${link_5}",
          "target": {
            "href": "Film_Shaun_Toub",
            "page": "Film_Shaun_Toub"
          }
        }
      ],
      "text": "Depending on how the show creators originated the names and terms, a few were given a different pronunciation, rather than an American pronunciation: Aang (ɑːŋ), Sokka (Sōka), Iroh (ɪˈroʊ), Avatar (ɑvətɑr), and Agni kī Duel (अग्नि की डूएल). Shyamalan said the show creators were \"pretty supportive\" of the change, initiated after Shaun Toub asked during a rehearsal, \"Why are we pronouncing Iroh like 'Eye-roh'?\""
    },
    {
      "body": "${link_0} threw ${link_1} overboard; the boy was never heard from again.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Hahn",
          "key": "${link_1}",
          "target": {
            "href": "Hahn",
            "page": "Hahn"
          }
        }
      ],
      "text": "Zhao threw Hahn overboard; the boy was never heard from again."
    },
    {
      "body": "The name pronunciation issues may have been raised before in the animated series. In particular, in the ${link_0} episodes, the character Hahn used the Japanese pronunciation of Sokka (創価) and Zhao (趙), and may had deliberately mispronounced Chō as Choi (ちょい meaning \"Little\" in Japanese). Sokka did not object to Hahn pronouncing his name as Sōka. However, when Hahn said \"We'll take out this Admiral Chō in no time\", Sokka yelled \"It's Admiral Zhao!!!\" Later, Hahn showed up on Zhao's ship wearing the Fire Nation uniform that Sokka had nitpicked earlier as outdated, yet Hahn still insisted as correct. He cried \"Admiral Choi, prepare to meet your fate\" and rushed to attack Zhao from behind with a spear; Zhao casually threw Hahn overboard with one hand and continued his interrupted conversation with Iroh. Hahn splashed into the icy waters, never to be heard from again.",
      "links": [
        {
          "body": "Siege of the North",
          "key": "${link_0}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        }
      ],
      "text": "The name pronunciation issues may have been raised before in the animated series. In particular, in the Siege of the North episodes, the character Hahn used the Japanese pronunciation of Sokka (創価) and Zhao (趙), and may had deliberately mispronounced Chō as Choi (ちょい meaning \"Little\" in Japanese). Sokka did not object to Hahn pronouncing his name as Sōka. However, when Hahn said \"We'll take out this Admiral Chō in no time\", Sokka yelled \"It's Admiral Zhao!!!\" Later, Hahn showed up on Zhao's ship wearing the Fire Nation uniform that Sokka had nitpicked earlier as outdated, yet Hahn still insisted as correct. He cried \"Admiral Choi, prepare to meet your fate\" and rushed to attack Zhao from behind with a spear; Zhao casually threw Hahn overboard with one hand and continued his interrupted conversation with Iroh. Hahn splashed into the icy waters, never to be heard from again."
    },
    {
      "body": "In a video interview captured on FlipCam, a young man asked M. Night Shyamalan at a junket why the \"${link_0}\" was replaced with a \"tidal wave\". Some of Shyamalan's answers:",
      "links": [
        {
          "body": "water creature",
          "key": "${link_0}",
          "target": {
            "href": "La#Koizilla",
            "page": "La"
          }
        }
      ],
      "text": "In a video interview captured on FlipCam, a young man asked M. Night Shyamalan at a junket why the \"water creature\" was replaced with a \"tidal wave\". Some of Shyamalan's answers:"
    },
    {
      "body": "Princess Mononoke (もののけ姫, Mononoke-hime) is a 1997 epic Japanese animated historical fantasy feature film written and directed by Hayao Miyazaki of Studio Ghibli. The design of ${link_0} closely resembles the Forest Spirit from that film in its gigantic \"Nightwalker\" form. In the ending of Princess Mononoke, Lady Eboshi wanted to kill the Forest Spirit for the humans to triumph over the \"gods\", which may be similar to what ${link_1} wanted to do with the ${link_2}. Ashitaka (i.e. Iroh) pleaded to her for peaceful coexistence between them and humanity but she severed the head of the Spirit anyway, while it was turning into the Nightwalker form. The head (i.e. Moon Spirit) was captured while the body turned into a blob form, (i.e. ${link_3}) killing everyone in his path while searching for his head. Ashitaka risked his life to return the head back to the body and end its the brutal rampage. The original story elements in the ${link_4} included the tragic story of Princess Yue's sacrifice to save her people and Zhao's willingness to die as a hero (rather live as a failure) to the ${link_5}; those were kept in the movie.",
      "links": [
        {
          "body": "Koizilla",
          "key": "${link_0}",
          "target": {
            "href": "La#Koizilla",
            "page": "La"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Moon Spirit",
          "key": "${link_2}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Ocean Spirit",
          "key": "${link_3}",
          "target": {
            "href": "La",
            "page": "La"
          }
        },
        {
          "body": "Siege of the North",
          "key": "${link_4}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_5}",
          "target": {
            "href": "Film_Fire_Nation",
            "page": "Film_Fire_Nation"
          }
        }
      ],
      "text": "Princess Mononoke (もののけ姫, Mononoke-hime) is a 1997 epic Japanese animated historical fantasy feature film written and directed by Hayao Miyazaki of Studio Ghibli. The design of Koizilla closely resembles the Forest Spirit from that film in its gigantic \"Nightwalker\" form. In the ending of Princess Mononoke, Lady Eboshi wanted to kill the Forest Spirit for the humans to triumph over the \"gods\", which may be similar to what Zhao wanted to do with the Moon Spirit. Ashitaka (i.e. Iroh) pleaded to her for peaceful coexistence between them and humanity but she severed the head of the Spirit anyway, while it was turning into the Nightwalker form. The head (i.e. Moon Spirit) was captured while the body turned into a blob form, (i.e. Ocean Spirit) killing everyone in his path while searching for his head. Ashitaka risked his life to return the head back to the body and end its the brutal rampage. The original story elements in the Siege of the North included the tragic story of Princess Yue's sacrifice to save her people and Zhao's willingness to die as a hero (rather live as a failure) to the Fire Nation; those were kept in the movie."
    },
    {
      "body": "Other similar story elements from Princess Mononoke were also not used in Shyamalan's film adaptation. The episode \"${link_0}\" in particular, may been strongly influenced by the story relating to the forest destruction by humans, and its renewal with the planting of acorns: ${link_1} played the role similar to the Forest Spirit in its benevolent form but as a form of a panda, and its malevolent form as a large multi-armed monster instead of a ferocious \"Blob\". A key difference from Princess Mononoke was the inclusion of the ${link_2}; in contrast from that episode, the Forest Spirit and the other supernatural creatures always reside in the \"human world\" rather than only during the ${link_3}. The concept of the Spirit World that was first introduced in that episode, was included in the film adaptation by first mentioning it in ${link_4}'s narration of the ${link_5}, and later given a brief overview with ${link_6}'s exposition to Katara and Sokka in the igloo.",
      "links": [
        {
          "body": "Winter Solstice, Part 1: The Spirit World",
          "key": "${link_0}",
          "target": {
            "href": "Winter_Solstice%2c_Part_1__The_Spirit_World",
            "page": "Winter_Solstice%2c_Part_1__The_Spirit_World"
          }
        },
        {
          "body": "Hei Bai",
          "key": "${link_1}",
          "target": {
            "href": "Hei_Bai",
            "page": "Hei_Bai"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "winter solstice",
          "key": "${link_3}",
          "target": {
            "href": "Winter_solstice",
            "page": "Winter_solstice"
          }
        },
        {
          "body": "Katara",
          "key": "${link_4}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "prologue",
          "key": "${link_5}",
          "target": {
            "href": "Film_The_Last_Airbender#Prologue",
            "page": "Film_The_Last_Airbender"
          }
        },
        {
          "body": "Kanna",
          "key": "${link_6}",
          "target": {
            "href": "Kanna",
            "page": "Kanna"
          }
        }
      ],
      "text": "Other similar story elements from Princess Mononoke were also not used in Shyamalan's film adaptation. The episode \"Winter Solstice, Part 1: The Spirit World\" in particular, may been strongly influenced by the story relating to the forest destruction by humans, and its renewal with the planting of acorns: Hei Bai played the role similar to the Forest Spirit in its benevolent form but as a form of a panda, and its malevolent form as a large multi-armed monster instead of a ferocious \"Blob\". A key difference from Princess Mononoke was the inclusion of the Spirit World; in contrast from that episode, the Forest Spirit and the other supernatural creatures always reside in the \"human world\" rather than only during the winter solstice. The concept of the Spirit World that was first introduced in that episode, was included in the film adaptation by first mentioning it in Katara's narration of the prologue, and later given a brief overview with Kanna's exposition to Katara and Sokka in the igloo."
    },
    {
      "body": "As for the \"symbolic gesture\" in the movie, it should be noted that unlike in the episode \"${link_0}\", Aang was fully aware and in control of his immense ${link_1} ability, i.e. his will was not overpowered by his past personalities and other entities with the Avatar State. Therefore, the movie finale is similar to the episode \"${link_2}\", in which Aang was in full control of the powers and abilities of a Fully Realized Avatar; he was able to choose not to kill ${link_3}, despite his past lives' insistence that it was the only way.",
      "links": [
        {
          "body": "The Siege of the North, Part 2",
          "key": "${link_0}",
          "target": {
            "href": "The_Siege_of_the_North%2c_Part_2",
            "page": "The_Siege_of_the_North%2c_Part_2"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Sozin's Comet, Part 4: Avatar Aang",
          "key": "${link_2}",
          "target": {
            "href": "Sozin%27s_Comet%2c_Part_4__Avatar_Aang",
            "page": "Sozin%27s_Comet%2c_Part_4__Avatar_Aang"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_3}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "As for the \"symbolic gesture\" in the movie, it should be noted that unlike in the episode \"The Siege of the North, Part 2\", Aang was fully aware and in control of his immense waterbending ability, i.e. his will was not overpowered by his past personalities and other entities with the Avatar State. Therefore, the movie finale is similar to the episode \"Sozin's Comet, Part 4: Avatar Aang\", in which Aang was in full control of the powers and abilities of a Fully Realized Avatar; he was able to choose not to kill Ozai, despite his past lives' insistence that it was the only way."
    },
    {
      "body": "\"They are called many names: Yin and Yang, Push and Pull ...\" – Zhao",
      "links": [],
      "text": "\"They are called many names: Yin and Yang, Push and Pull ...\" – Zhao"
    },
    {
      "body": "As with the animated series, the Ocean Spirit was incarnated in a form of a black koi fish, while the Moon Spirit in a form of a white koi fish. However, their genders, abilities, and names may have been switched in the film, as suggested when ${link_0} said to ${link_1}, \"They are called many names: Yin and Yang, Push and Pull ... may I introduce you to the mysterious Ocean and Moon Spirits\". This may be compared to what ${link_2} said to Aang in the episode \"${link_3}\": \"${link_4} and ${link_5}, your Moon and Ocean, have always circled each other in an eternal dance. They balance each other: push and pull, life and death, good and evil, Yin and Yang.\"",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Film_Zhao",
            "page": "Film_Zhao"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Film_Iroh",
            "page": "Film_Iroh"
          }
        },
        {
          "body": "Koh",
          "key": "${link_2}",
          "target": {
            "href": "Koh",
            "page": "Koh"
          }
        },
        {
          "body": "The Siege of the North, Part 2",
          "key": "${link_3}",
          "target": {
            "href": "The_Siege_of_the_North%2c_Part_2",
            "page": "The_Siege_of_the_North%2c_Part_2"
          }
        },
        {
          "body": "Tui",
          "key": "${link_4}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "La",
          "key": "${link_5}",
          "target": {
            "href": "La",
            "page": "La"
          }
        }
      ],
      "text": "As with the animated series, the Ocean Spirit was incarnated in a form of a black koi fish, while the Moon Spirit in a form of a white koi fish. However, their genders, abilities, and names may have been switched in the film, as suggested when Zhao said to Iroh, \"They are called many names: Yin and Yang, Push and Pull ... may I introduce you to the mysterious Ocean and Moon Spirits\". This may be compared to what Koh said to Aang in the episode \"The Siege of the North, Part 2\": \"Tui and La, your Moon and Ocean, have always circled each other in an eternal dance. They balance each other: push and pull, life and death, good and evil, Yin and Yang.\""
    },
    {
      "body": "Instead of using Written Chinese as done in the original animated series, the writing in the movie is a made-up language influenced by Chinese calligraphy, similar in concept to developing the Klingon language. This emphasized the story taking place in an Asian-inspired \"alternate world\", rather than an \"Asian world\". While the Klingon writing systems are similar to the Latin system (e.g., 26 characters with one-to-one grapheme-phoneme correspondence, reading left-to-right, etc., etc.), this alien writing system has similar traits to the Chinese writing system (e.g., thousands of character glyphs, each with its own sound and meaning but combined to mean something else, reading not necessarily left-to-right, etc., etc.) In some cases, the writing is translated as English subtitles. The grammar and vocabulary for this alien language is yet to be published.",
      "links": [],
      "text": "Instead of using Written Chinese as done in the original animated series, the writing in the movie is a made-up language influenced by Chinese calligraphy, similar in concept to developing the Klingon language. This emphasized the story taking place in an Asian-inspired \"alternate world\", rather than an \"Asian world\". While the Klingon writing systems are similar to the Latin system (e.g., 26 characters with one-to-one grapheme-phoneme correspondence, reading left-to-right, etc., etc.), this alien writing system has similar traits to the Chinese writing system (e.g., thousands of character glyphs, each with its own sound and meaning but combined to mean something else, reading not necessarily left-to-right, etc., etc.) In some cases, the writing is translated as English subtitles. The grammar and vocabulary for this alien language is yet to be published."
    },
    {
      "body": "${link_0} put up the \"Avatar has Returned\" poster.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Film_Katara",
            "page": "Film_Katara"
          }
        }
      ],
      "text": "Katara put up the \"Avatar has Returned\" poster."
    },
    {
      "body": "This made-up language is not well received by many fans of original series, preferring actual written Chinese instead. Professor ${link_0}, who helped with Chinese calligraphy in the original series, was also unhappy with the direction the producers have taken.",
      "links": [
        {
          "body": "Siu-Leung Lee",
          "key": "${link_0}",
          "target": {
            "href": "Siu-Leung_Lee",
            "page": "Siu-Leung_Lee"
          }
        }
      ],
      "text": "This made-up language is not well received by many fans of original series, preferring actual written Chinese instead. Professor Siu-Leung Lee, who helped with Chinese calligraphy in the original series, was also unhappy with the direction the producers have taken."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Film:Adaptation_of_Avatar:_The_Last_Airbender",
    "file": "avatar.wikia.com/wiki/Film_Adaptation_of_Avatar__The_Last_Airbender.html",
    "page": "Film_Adaptation_of_Avatar__The_Last_Airbender",
    "title": "Adaptation of Avatar: The Last Airbender"
  }
}