{
  "categories": [
    {
      "body": "Articles to be expanded",
      "target": {
        "external": false,
        "href": "/wiki/Category_Articles_to_be_expanded",
        "page": "Category_Articles_to_be_expanded"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Books",
      "target": {
        "external": false,
        "href": "/wiki/Category_Books",
        "page": "Category_Books"
      }
    },
    {
      "body": "Films",
      "target": {
        "external": false,
        "href": "/wiki/Category_Films",
        "page": "Category_Films"
      }
    },
    {
      "body": "Print publications",
      "target": {
        "external": false,
        "href": "/wiki/Category_Print_publications",
        "page": "Category_Print_publications"
      }
    },
    {
      "body": "Real world",
      "target": {
        "external": false,
        "href": "/wiki/Category_Real_world",
        "page": "Category_Real_world"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The Last Airbender Movie Novelization (${link_0}) is an adaptation of ${link_1} written by Michael Teitelbaum. It consists of 16 chapters plus a short Prologue and Epilogue, spread over 124 pages.",
      "links": [
        {
          "body": "ISBN 978-1-4424-0174-7",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Special:BookSources/9781442401747",
            "page": "Special:BookSources/9781442401747"
          }
        },
        {
          "body": "The Last Airbender",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Film_The_Last_Airbender",
            "page": "Film_The_Last_Airbender"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization"
      ],
      "text": "The Last Airbender Movie Novelization (ISBN 978-1-4424-0174-7) is an adaptation of The Last Airbender written by Michael Teitelbaum. It consists of 16 chapters plus a short Prologue and Epilogue, spread over 124 pages."
    },
    {
      "body": "The book begins with ${link_0} and ${link_1} stepping out of their canoe onto an ice patch next to the small river they had been in. Katara attempts to ${link_2}, creating a small bubble that floats out of the river. However, she stumbles, and the water splashes Sokka. The two argue for a while before Sokka sees the tracks of a ${link_3}. They start to follow it, when Katara notices a strange glow coming from the under the ice. Sokka strikes the ground with his boomerang. Cracks in the ice appear, and the two of them run away from the spiderweb of fractures. A huge ball of ice rises to the surface. Katara sees a boy and a large creature frozen inside. She opens it with the boomerang. ${link_4} and ${link_5} are found inside. Aang is barely conscious, so Katara and Sokka take him back to ${link_6}. There, Aang finally awakens. Sokka sees a ${link_7} warship heading toward the village, and he prepares the tribe for a battle.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Katara",
            "page": "Film_Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Sokka",
            "page": "Film_Sokka"
          }
        },
        {
          "body": "waterbend",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "tiger seal",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Tiger_seal",
            "page": "Tiger_seal"
          }
        },
        {
          "body": "Appa",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Appa",
            "page": "Film_Appa"
          }
        },
        {
          "body": "Aang",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Aang",
            "page": "Film_Aang"
          }
        },
        {
          "body": "the tribe",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Southern_Water_Tribe",
            "page": "Film_Southern_Water_Tribe"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "Plot",
        "The Avatar Returns"
      ],
      "text": "The book begins with Katara and Sokka stepping out of their canoe onto an ice patch next to the small river they had been in. Katara attempts to waterbend, creating a small bubble that floats out of the river. However, she stumbles, and the water splashes Sokka. The two argue for a while before Sokka sees the tracks of a tiger seal. They start to follow it, when Katara notices a strange glow coming from the under the ice. Sokka strikes the ground with his boomerang. Cracks in the ice appear, and the two of them run away from the spiderweb of fractures. A huge ball of ice rises to the surface. Katara sees a boy and a large creature frozen inside. She opens it with the boomerang. Appa and Aang are found inside. Aang is barely conscious, so Katara and Sokka take him back to the tribe. There, Aang finally awakens. Sokka sees a Fire Nation warship heading toward the village, and he prepares the tribe for a battle."
    },
    {
      "body": "The ship stops in the village. ${link_0} walks out of it and into the village, proclaiming that he is the ${link_1}. His soldiers break into the igloos and huts and capture all the elderly, including Katara's and Sokka's ${link_2}, to be taken prisoner by Zuko. Aang is found in one of the huts by a soldier. The soldier sees his tattoos, and he takes Aang to Zuko. Aang alone is taken aboard the ship. Katara and Sokka depart from the Water Tribe on Appa after the ship.",
      "links": [
        {
          "body": "Prince Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Zuko",
            "page": "Film_Zuko"
          }
        },
        {
          "body": "Prince of the Fire Nation",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "grandmother",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Kanna",
            "page": "Film_Kanna"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "Plot",
        "The Avatar Returns"
      ],
      "text": "The ship stops in the village. Prince Zuko walks out of it and into the village, proclaiming that he is the Prince of the Fire Nation. His soldiers break into the igloos and huts and capture all the elderly, including Katara's and Sokka's grandmother, to be taken prisoner by Zuko. Aang is found in one of the huts by a soldier. The soldier sees his tattoos, and he takes Aang to Zuko. Aang alone is taken aboard the ship. Katara and Sokka depart from the Water Tribe on Appa after the ship."
    },
    {
      "body": "On the ship, ${link_0} places objects on a table in front of Aang. First, a flickering candle, which grows into a tall flame once in front of the ${link_1}. Second, Iroh pours some water onto the table. The puddle shapes itself into a perfect circle. Third, a rock is placed in front of Aang at a precarious angle. The rock defies gravity and does not fall over. This involuntary control over the elements proves that Aang is the ${link_2}. Zuko tells him he is going to be kept prisoner, but Aang escapes easily using his ${link_3}. He meets up with Sokka, Katara, and Appa, and they begin to fly toward the ${link_4}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Iroh",
            "page": "Film_Iroh"
          }
        },
        {
          "body": "airbender",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "glider",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Airbender_staff",
            "page": "Airbender_staff"
          }
        },
        {
          "body": "Southern Air Temple",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Southern_Air_Temple",
            "page": "Film_Southern_Air_Temple"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "Plot",
        "The Avatar Returns"
      ],
      "text": "On the ship, Iroh places objects on a table in front of Aang. First, a flickering candle, which grows into a tall flame once in front of the airbender. Second, Iroh pours some water onto the table. The puddle shapes itself into a perfect circle. Third, a rock is placed in front of Aang at a precarious angle. The rock defies gravity and does not fall over. This involuntary control over the elements proves that Aang is the Avatar. Zuko tells him he is going to be kept prisoner, but Aang escapes easily using his glider. He meets up with Sokka, Katara, and Appa, and they begin to fly toward the Southern Air Temple."
    },
    {
      "body": "At the temple, the group meets ${link_0}, a \"${link_1}\". Soon after, Aang discovers that the Fire Nation had killed all the airbenders. He goes into the ${link_2} out of rage and loss. He enters the ${link_3} while in the state, and he meets a dragon. The dragon tells him that the human and Spirit World are in danger. Katara eventually manages to calm him enough that he drifts back out of the Avatar State.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Momo",
            "page": "Film_Momo"
          }
        },
        {
          "body": "flying lemur bat",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Winged_lemur",
            "page": "Winged_lemur"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "Plot",
        "The Southern Air Temple"
      ],
      "text": "At the temple, the group meets Momo, a \"flying lemur bat\". Soon after, Aang discovers that the Fire Nation had killed all the airbenders. He goes into the Avatar State out of rage and loss. He enters the Spirit World while in the state, and he meets a dragon. The dragon tells him that the human and Spirit World are in danger. Katara eventually manages to calm him enough that he drifts back out of the Avatar State."
    },
    {
      "body": "On a Fire Nation vessel out at sea, a guard tells ${link_0} that he has spotted Prince Zuko's ship. Zhao decides to invite him and Iroh to his ship for a meal. During the meal, Zhao cleverly taunts Zuko about playing with little girls when he was younger. He subsequently mocks him for believing the Avatar is still in existence. He reminds Zuko that he is not allowed to wear a soldier's uniform during his banishment. At this, Zuko leaves the ship.",
      "links": [
        {
          "body": "Commander Zhao",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Zhao",
            "page": "Film_Zhao"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "Plot",
        "The Southern Air Temple"
      ],
      "text": "On a Fire Nation vessel out at sea, a guard tells Commander Zhao that he has spotted Prince Zuko's ship. Zhao decides to invite him and Iroh to his ship for a meal. During the meal, Zhao cleverly taunts Zuko about playing with little girls when he was younger. He subsequently mocks him for believing the Avatar is still in existence. He reminds Zuko that he is not allowed to wear a soldier's uniform during his banishment. At this, Zuko leaves the ship."
    },
    {
      "body": "In a forest in the Earth Kingdom, Aang confirms to Sokka and Katara that he is the Avatar. Just after, a boy runs out of the trees, Fire Nation soldiers after him. The soldiers tell them that he is being arrested for earthbending stones at them. Katara tries to stop them with waterbending, but fails, and the three of them (along with Momo) get arrested as well. They are all taken to a prison in a ruined ${link_0} village controlled by the Fire Nation. There, they are introduced to the boy's father. Aang, Katara, and the boy's father convince the ${link_1} in the prison to break out. The group makes their way back to the forest.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "earthbenders",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "Plot",
        "Jailbreak"
      ],
      "text": "In a forest in the Earth Kingdom, Aang confirms to Sokka and Katara that he is the Avatar. Just after, a boy runs out of the trees, Fire Nation soldiers after him. The soldiers tell them that he is being arrested for earthbending stones at them. Katara tries to stop them with waterbending, but fails, and the three of them (along with Momo) get arrested as well. They are all taken to a prison in a ruined Earth Kingdom village controlled by the Fire Nation. There, they are introduced to the boy's father. Aang, Katara, and the boy's father convince the earthbenders in the prison to break out. The group makes their way back to the forest."
    },
    {
      "body": "In a small town in the Earth Kingdom, Kyoshi Village (taking the place of Kyoshi Island), Aang is told about Avatar ${link_0} by an old man. Aang realizes he has to master the other three elements, so he tells Sokka and Katara they must head toward the Northern Water Tribe.",
      "links": [
        {
          "body": "Kyoshi",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi",
            "page": "Kyoshi"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "Plot",
        "Jailbreak"
      ],
      "text": "In a small town in the Earth Kingdom, Kyoshi Village (taking the place of Kyoshi Island), Aang is told about Avatar Kyoshi by an old man. Aang realizes he has to master the other three elements, so he tells Sokka and Katara they must head toward the Northern Water Tribe."
    },
    {
      "body": "In the ${link_0}'s ${link_1}, Commander Zhao speaks with ${link_2}. He tells the Fire Lord about the ${link_3}, and the rebellions caused by him. After Zhao reveals he has visited the \"${link_4}\", they decide to set a trap for the Avatar at the ${link_5}.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "palace",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_Royal_Palace",
            "page": "Fire_Nation_Royal_Palace"
          }
        },
        {
          "body": "Fire Lord Ozai",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Ozai",
            "page": "Film_Ozai"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Great Library",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "Northern Air Temple",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "Plot",
        "Jailbreak"
      ],
      "text": "In the Fire Lord's palace, Commander Zhao speaks with Fire Lord Ozai. He tells the Fire Lord about the Avatar, and the rebellions caused by him. After Zhao reveals he has visited the \"Great Library\", they decide to set a trap for the Avatar at the Northern Air Temple."
    },
    {
      "body": "Despite Sokka and Katara's warning of the Fire Nation, Aang departs on Appa from ${link_0}'s campsite toward the Northern Air Temple. There, he meets an old man who takes him into the ${link_1}. After talking about Avatar ${link_2}, hundreds of Fire Nation archers step into the room, their bows targeting Aang. One of the archers pays the old man for luring the Avatar into the room, and the man scurries away. Aang is chained in the prayer room of the temple. While inside, he reenters the Spirit World, and visits the dragon. It tells him that the Fire Nation has visited the library, and that they will attack the Northern Water Tribe. Aang must master waterbending and stop the Fire Nation at the North Pole.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Avatar Sanctuary",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Air_temple_sanctuaries",
            "page": "Air_temple_sanctuaries"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Roku",
            "page": "Roku"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "Plot",
        "The Blue Spirit"
      ],
      "text": "Despite Sokka and Katara's warning of the Fire Nation, Aang departs on Appa from Team Avatar's campsite toward the Northern Air Temple. There, he meets an old man who takes him into the Avatar Sanctuary. After talking about Avatar Roku, hundreds of Fire Nation archers step into the room, their bows targeting Aang. One of the archers pays the old man for luring the Avatar into the room, and the man scurries away. Aang is chained in the prayer room of the temple. While inside, he reenters the Spirit World, and visits the dragon. It tells him that the Fire Nation has visited the library, and that they will attack the Northern Water Tribe. Aang must master waterbending and stop the Fire Nation at the North Pole."
    },
    {
      "body": "At the camp where Katara and Sokka were staying, they are attacked by Fire Nation soldiers as they are unarmed. They are saved by the Kyoshi Warriors, who had been following them all this time. The warriors stay with the group until Aang returns.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Plot",
        "The Blue Spirit"
      ],
      "text": "At the camp where Katara and Sokka were staying, they are attacked by Fire Nation soldiers as they are unarmed. They are saved by the Kyoshi Warriors, who had been following them all this time. The warriors stay with the group until Aang returns."
    },
    {
      "body": "As Aang wakes up from his journey into the Spirit World, Zhao taunts him about the death of his people and only being able to bend one element. After he leaves, a dark, mysterious figure in a mask, called the \"Blue Spirit\" by the guards, rescues Aang. After barely managing to escape the temple, the mysterious figure is shot in the mask with an arrow. Aang rescues him in turn, taking him away from the temple. The figure is revealed to be Zuko. After he regains consciousness, he immediately begins ${link_0} at Aang. The airbender dashes away toward where he left Appa.",
      "links": [
        {
          "body": "firebending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "Plot",
        "The Blue Spirit"
      ],
      "text": "As Aang wakes up from his journey into the Spirit World, Zhao taunts him about the death of his people and only being able to bend one element. After he leaves, a dark, mysterious figure in a mask, called the \"Blue Spirit\" by the guards, rescues Aang. After barely managing to escape the temple, the mysterious figure is shot in the mask with an arrow. Aang rescues him in turn, taking him away from the temple. The figure is revealed to be Zuko. After he regains consciousness, he immediately begins firebending at Aang. The airbender dashes away toward where he left Appa."
    },
    {
      "body": "The version of the movie the novelization was based on is estimated to be 20-30 minutes longer than the final cut, which may be what Shyamalan alluded to when he said in the ${link_0}, \"I'm dying to make a two-hour movie, I just haven't earned it yet.\" Moreover, story elements suggestive of ${link_1} was noticeably taken out in the movie, likely due to poor on-screen chemistry between ${link_2} and ${link_3} during the test-screening. In general, the scenes and dialogue were trimmed here and there, mostly keeping the sentences that are necessary to convey the plot. Some of the longer dialogue can be heard in the Blu-ray/DVD documentaries, such as when Zuko said, \"Don't even try to escape. This is a warship! The room is made entirely of impregnable metal. There are armed guards outside the room, and my uncle and I are expert firebenders.\" The movie cut the dialogue after \"This is a warship!\" Other than that, the key differences between the novelization and the movie include:",
      "links": [
        {
          "body": "NY Magazine Interview",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://nymag.com/daily/entertainment/2010/07/m_night_shyamalan_on_the_last",
            "page": "http://nymag.com/daily/entertainment/2010/07/m_night_shyamalan_on_the_last"
          }
        },
        {
          "body": "Kataang",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Shipping",
            "page": "Shipping"
          }
        },
        {
          "body": "Noah Ringer",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Noah_Ringer",
            "page": "Noah_Ringer"
          }
        },
        {
          "body": "Nicola Peltz",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Nicola_Peltz",
            "page": "Nicola_Peltz"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "The version of the movie the novelization was based on is estimated to be 20-30 minutes longer than the final cut, which may be what Shyamalan alluded to when he said in the NY Magazine Interview, \"I'm dying to make a two-hour movie, I just haven't earned it yet.\" Moreover, story elements suggestive of Kataang was noticeably taken out in the movie, likely due to poor on-screen chemistry between Noah Ringer and Nicola Peltz during the test-screening. In general, the scenes and dialogue were trimmed here and there, mostly keeping the sentences that are necessary to convey the plot. Some of the longer dialogue can be heard in the Blu-ray/DVD documentaries, such as when Zuko said, \"Don't even try to escape. This is a warship! The room is made entirely of impregnable metal. There are armed guards outside the room, and my uncle and I are expert firebenders.\" The movie cut the dialogue after \"This is a warship!\" Other than that, the key differences between the novelization and the movie include:"
    },
    {
      "body": "Katara's opening narration is much more akin to the series, \"${link_0}\". This may refer to the original opening hinted in the trailers that was replaced with the text crawl.",
      "links": [
        {
          "body": "The Boy in the Iceberg",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/The_Boy_in_the_Iceberg",
            "page": "The_Boy_in_the_Iceberg"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "Katara's opening narration is much more akin to the series, \"The Boy in the Iceberg\". This may refer to the original opening hinted in the trailers that was replaced with the text crawl."
    },
    {
      "body": "The story begins on an icy landscape with Sokka and Katara on boat, drifting in the river. The movie trimmed it after they stepped out with Katara already bending a water sphere.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "The story begins on an icy landscape with Sokka and Katara on boat, drifting in the river. The movie trimmed it after they stepped out with Katara already bending a water sphere."
    },
    {
      "body": "After they find Aang, they head back to boat and paddle back to their village. Glancing over his shoulder, Sokka notices Appa following them along the shoreline.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "After they find Aang, they head back to boat and paddle back to their village. Glancing over his shoulder, Sokka notices Appa following them along the shoreline."
    },
    {
      "body": "In the village, Kanna tends to Aang as he recovers in her igloo. She subsequently goes outside to talk to Katara. The movie cut in when Katara entered the igloo to check on Aang and saw his tattoos.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "In the village, Kanna tends to Aang as he recovers in her igloo. She subsequently goes outside to talk to Katara. The movie cut in when Katara entered the igloo to check on Aang and saw his tattoos."
    },
    {
      "body": "Aang and Katara's conversation is extended, with a brief discussion about Katara's necklace.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "Aang and Katara's conversation is extended, with a brief discussion about Katara's necklace."
    },
    {
      "body": "When the Fire Nation arrives, Aang plays a game using small stones with the children in the igloo, presumably to keep them calm. Aang is about to start another game when the Fire Nation soldier steps into the igloo and takes him.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "When the Fire Nation arrives, Aang plays a game using small stones with the children in the igloo, presumably to keep them calm. Aang is about to start another game when the Fire Nation soldier steps into the igloo and takes him."
    },
    {
      "body": "The discussion between Katara, Kanna, and Sokka is much different (the final version was part of the re-shoots), and doesn't dwell on the Spirit World, but rather on Katara and Sokka needing to rescue Aang. During this scene, she also says the line from the trailer \"He will need you, and we all need him.\"",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "The discussion between Katara, Kanna, and Sokka is much different (the final version was part of the re-shoots), and doesn't dwell on the Spirit World, but rather on Katara and Sokka needing to rescue Aang. During this scene, she also says the line from the trailer \"He will need you, and we all need him.\""
    },
    {
      "body": "When Aang is reunited with Appa, Katara and Sokka, Sokka remarks that Grandma was right about him being an airbender, and Aang responds \"We airbenders learn to feel the energy behind the wind, not just the breeze on our skin. It's all about controlling energy.\"",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "When Aang is reunited with Appa, Katara and Sokka, Sokka remarks that Grandma was right about him being an airbender, and Aang responds \"We airbenders learn to feel the energy behind the wind, not just the breeze on our skin. It's all about controlling energy.\""
    },
    {
      "body": "The Dragon Spirit dialogue was changed for the final film \"Avatar, the human world and the Spirit World are in danger. Where have you been? You may already be too late.\"",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "The Dragon Spirit dialogue was changed for the final film \"Avatar, the human world and the Spirit World are in danger. Where have you been? You may already be too late.\""
    },
    {
      "body": "When Aang exits the Spirit World, he collapses into Katara's arms.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "When Aang exits the Spirit World, he collapses into Katara's arms."
    },
    {
      "body": "When Zhao mocks Zuko on the ship, he jokingly looks under the table and suggests that the Avatar has been hiding under there for a hundred years. Zuko snaps back that he has found him, but Zhao disregards him, believing him to be lying.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "When Zhao mocks Zuko on the ship, he jokingly looks under the table and suggests that the Avatar has been hiding under there for a hundred years. Zuko snaps back that he has found him, but Zhao disregards him, believing him to be lying."
    },
    {
      "body": "Aang acknowledges to Sokka and Katara that he is the Avatar, before the Haru enters the scene. In the movie, it was confirmed to them when Aang announced he was the Avatar during the prison camp scene.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "Aang acknowledges to Sokka and Katara that he is the Avatar, before the Haru enters the scene. In the movie, it was confirmed to them when Aang announced he was the Avatar during the prison camp scene."
    },
    {
      "body": "After Aang took out the soldiers outside the prison camp, the movie added a scene where the villagers broke open a shed where the bending-related tools were kept and Momo knocked over a waterbending scroll. An elder villager showed Aang the statue of Avatar Kyoshi. As for the novelization, Aang and his friends take off with Appa and visit another village where he is greeted by the residents and finds the statue of Avatar Kyoshi; as an elder villager tells Aang who that statue represents. The villagers were inspired with the Avatar's return that they brought out earthbending robes and garments, and showed off some earthbending moves.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "After Aang took out the soldiers outside the prison camp, the movie added a scene where the villagers broke open a shed where the bending-related tools were kept and Momo knocked over a waterbending scroll. An elder villager showed Aang the statue of Avatar Kyoshi. As for the novelization, Aang and his friends take off with Appa and visit another village where he is greeted by the residents and finds the statue of Avatar Kyoshi; as an elder villager tells Aang who that statue represents. The villagers were inspired with the Avatar's return that they brought out earthbending robes and garments, and showed off some earthbending moves."
    },
    {
      "body": "In the movie, Aang revealed that he could not bend the other elements after Sokka suggested they visit other villages occupied by the Fire Nation, still in the first village. In the novelization, Sokka's initial suggestion was missing and the conversation took place after he ran from crowd near the Kyoshi statue and caught up with Sokka and Katara at the outskirts of the second village.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "In the movie, Aang revealed that he could not bend the other elements after Sokka suggested they visit other villages occupied by the Fire Nation, still in the first village. In the novelization, Sokka's initial suggestion was missing and the conversation took place after he ran from crowd near the Kyoshi statue and caught up with Sokka and Katara at the outskirts of the second village."
    },
    {
      "body": "When Aang said \"they also told me that I couldn't have a family\", the novelization added \"They warned me never to fall in love.\" Thus, the movie is more ambiguous about \"family\", more about Aang being separated from Monk Gyatso and his friends, than serve as a Kataang supporting element.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "When Aang said \"they also told me that I couldn't have a family\", the novelization added \"They warned me never to fall in love.\" Thus, the movie is more ambiguous about \"family\", more about Aang being separated from Monk Gyatso and his friends, than serve as a Kataang supporting element."
    },
    {
      "body": "A portion of the deleted scene \"Talk to the Dead\" is in the novelization. There was the dancing with the villagers but no Aunt Wu. When it was time to leave, Sokka noticed the three mysterious figures, \"draped in green cloaks and holding metal fans\". Sokka said something that is not in the deleted scene: \"What was that about? Does anyone else get the feeling that we're being watched?\"",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "A portion of the deleted scene \"Talk to the Dead\" is in the novelization. There was the dancing with the villagers but no Aunt Wu. When it was time to leave, Sokka noticed the three mysterious figures, \"draped in green cloaks and holding metal fans\". Sokka said something that is not in the deleted scene: \"What was that about? Does anyone else get the feeling that we're being watched?\""
    },
    {
      "body": "Zhao's first dialogue in the story with Ozai is quite different. Zhao met with Ozai sitting on a bench looking the palace, and discussed about rumors of the Avatar returning before speaking about scrolls from the Great Library. Ozai wanted Zhao to take the threat of this \"skinny boy\" seriously as the Avatar would convince others that \"the four elements are the same\" and confine them to a \"lower place, where fire will no longer be the dominant element\". Zhao anticipated Aang will be at the Northern Air Temple to contact the Spirit World so he wanted to trap him there (instead of setting up trap at multiple locations). Ozai said Zuko deserved the opportunity to find the Avatar but Zhao and his army find him first, that will be simply his son's fate.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "Zhao's first dialogue in the story with Ozai is quite different. Zhao met with Ozai sitting on a bench looking the palace, and discussed about rumors of the Avatar returning before speaking about scrolls from the Great Library. Ozai wanted Zhao to take the threat of this \"skinny boy\" seriously as the Avatar would convince others that \"the four elements are the same\" and confine them to a \"lower place, where fire will no longer be the dominant element\". Zhao anticipated Aang will be at the Northern Air Temple to contact the Spirit World so he wanted to trap him there (instead of setting up trap at multiple locations). Ozai said Zuko deserved the opportunity to find the Avatar but Zhao and his army find him first, that will be simply his son's fate."
    },
    {
      "body": "After recounting Zuko's Agni ki Duel, Zuko asked the boy, \"What would you feel if you were Prince Zuko?\". The boy said he would be ashamed as he would have no honor.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "After recounting Zuko's Agni ki Duel, Zuko asked the boy, \"What would you feel if you were Prince Zuko?\". The boy said he would be ashamed as he would have no honor."
    },
    {
      "body": "The scene where Aang and Katara were first practicing their waterbending at the brook where Sokka noticed the smoke from the Fire Nation soldiers following them was not mentioned, although there is a picture of Katara waterbending a blob of water at this brook, the movie only showed Katara practicing her waterbending forms without the water.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "The scene where Aang and Katara were first practicing their waterbending at the brook where Sokka noticed the smoke from the Fire Nation soldiers following them was not mentioned, although there is a picture of Katara waterbending a blob of water at this brook, the movie only showed Katara practicing her waterbending forms without the water."
    },
    {
      "body": "Aang commented to Appa about the Fire Nation metal bridge at the Northern Air Temple, as it \"wasn't there the last time I visited the place.\"",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "Aang commented to Appa about the Fire Nation metal bridge at the Northern Air Temple, as it \"wasn't there the last time I visited the place.\""
    },
    {
      "body": "Back at the campsite with Sokka and Katara, the entire Kyoshi Warriors scenes was cut from the movie.",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "Back at the campsite with Sokka and Katara, the entire Kyoshi Warriors scenes was cut from the movie."
    },
    {
      "body": "At the Northern Air Temple, the Dragon Spirit dialogue was different and extensive. He did not mention of his \"vision of the moon turning red\" but he did talk about the stolen knowledge from the Great Library and the danger to the Northern Water Tribe. When Aang said he would stop them, the Dragon Spriit said \"I know you will try ... but it requires many, many years to master all the elements. The comet that gave the Fire Nation the power to start this war one hundred years ago will be returning in three years. It will once again give the firebenders the ability to use their chi to produce fire themselves, rather than just manipulate already existing fire. Every firebender will be able to create fire and use it against their enemies. if they have not been defeated by the day the comet returns, nothing will be able to stop them.\" He also gave his vision of the future: \"I can tell you that the one called ${link_0} will be very important to you ... but be careful your feelings and actions. You have struggled with this in all of your lifetimes, Avatar: the balance between your desire your love and family, and your responsibility to the world.\"",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "At the Northern Air Temple, the Dragon Spirit dialogue was different and extensive. He did not mention of his \"vision of the moon turning red\" but he did talk about the stolen knowledge from the Great Library and the danger to the Northern Water Tribe. When Aang said he would stop them, the Dragon Spriit said \"I know you will try ... but it requires many, many years to master all the elements. The comet that gave the Fire Nation the power to start this war one hundred years ago will be returning in three years. It will once again give the firebenders the ability to use their chi to produce fire themselves, rather than just manipulate already existing fire. Every firebender will be able to create fire and use it against their enemies. if they have not been defeated by the day the comet returns, nothing will be able to stop them.\" He also gave his vision of the future: \"I can tell you that the one called Katara will be very important to you ... but be careful your feelings and actions. You have struggled with this in all of your lifetimes, Avatar: the balance between your desire your love and family, and your responsibility to the world.\""
    },
    {
      "body": "At the Spirit Oasis, the Dragon Spirit dialogue and his advice to Aang were different: \"You must show them the power of water. They have forgotten that all the elements are equal. That is why an Avatar must exist - to prove by your example that this is true.\" When Aang asked if he had to hurt the Fire Nation soldier, the Dragon Spirit said \"You may have to hurt them.\" Before the Dragon flew off, Aang inquired further regarding his previous conversation with the Dragon Spirit about his friends and some struggles: \"At some point you will have to make a difficult choice ... between Katara and being the Avatar.\"",
      "links": [],
      "section": [
        "The Last Airbender Movie Novelization",
        "Differences between the novelization and the movie"
      ],
      "text": "At the Spirit Oasis, the Dragon Spirit dialogue and his advice to Aang were different: \"You must show them the power of water. They have forgotten that all the elements are equal. That is why an Avatar must exist - to prove by your example that this is true.\" When Aang asked if he had to hurt the Fire Nation soldier, the Dragon Spirit said \"You may have to hurt them.\" Before the Dragon flew off, Aang inquired further regarding his previous conversation with the Dragon Spirit about his friends and some struggles: \"At some point you will have to make a difficult choice ... between Katara and being the Avatar.\""
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Other film novelizations",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Film_The_Last_Airbender_movie_tie-ins#Movie_novelizations",
            "page": "Film_The_Last_Airbender_movie_tie-ins"
          }
        }
      ],
      "section": [
        "The Last Airbender Movie Novelization",
        "See also"
      ],
      "text": "Other film novelizations"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Film:The_Last_Airbender_Movie_Novelization",
    "file": "avatar.wikia.com/wiki/Film_The_Last_Airbender_Movie_Novelization.html",
    "page": "Film_The_Last_Airbender_Movie_Novelization",
    "title": "The Last Airbender Movie Novelization"
  }
}