{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Locations (film)",
      "target": {
        "href": "Category_Locations_(film)",
        "page": "Category_Locations_(film)"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The Southern Air Temple.",
      "links": [],
      "text": "The Southern Air Temple."
    },
    {
      "body": "The Southern Air Temple was one of the four ${link_0} populated by the ${link_1}, and one of the two exclusively housing male ${link_2}, with the other being the ${link_3}. Its population was wiped out, however, as a result of the ${link_4} in the early stages of the ${link_5}, rendering the buildings deserted. The temple is notable for being the childhood home of ${link_6} ${link_7}.",
      "links": [
        {
          "body": "air temples",
          "key": "${link_0}",
          "target": {
            "href": "Air_temple",
            "page": "Air_temple"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_1}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_2}",
          "target": {
            "href": "Airbending#Notable_airbenders",
            "page": "Airbending"
          }
        },
        {
          "body": "Northern Air Temple",
          "key": "${link_3}",
          "target": {
            "href": "Film_Northern_Air_Temple",
            "page": "Film_Northern_Air_Temple"
          }
        },
        {
          "body": "Air Nomad Genocide",
          "key": "${link_4}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_5}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_6}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_7}",
          "target": {
            "href": "Film_Aang",
            "page": "Film_Aang"
          }
        }
      ],
      "text": "The Southern Air Temple was one of the four air temples populated by the Air Nomads, and one of the two exclusively housing male airbenders, with the other being the Northern Air Temple. Its population was wiped out, however, as a result of the Air Nomad Genocide in the early stages of the Hundred Year War, rendering the buildings deserted. The temple is notable for being the childhood home of Avatar Aang."
    },
    {
      "body": "As was the fate of the other temples, this temple was invaded during Sozin's Comet. Despite attempts to defend their home, the monks were outnumbered and defeated. The ${link_0} killed every inhabitant of the temple, contributing to the genocide of the Air Nomads.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "As was the fate of the other temples, this temple was invaded during Sozin's Comet. Despite attempts to defend their home, the monks were outnumbered and defeated. The Fire Nation killed every inhabitant of the temple, contributing to the genocide of the Air Nomads."
    },
    {
      "body": "One hundred years later Aang, ${link_0}, ${link_1}, and ${link_2} visited the temple at the behest of the young airbender, who wished to find his people. Unaware of the disaster that had befallen his family, he moved through the deserted buildings, finding no one, save for a stray lemur Aang named ${link_3}. Determined to find his friends, Aang set course for the praying fields, where he found the massacre that had taken place a century before; human bones, the only remains of the Air Nomads, were scattered across the field.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Film_Sokka",
            "page": "Film_Sokka"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Film_Katara",
            "page": "Film_Katara"
          }
        },
        {
          "body": "Appa",
          "key": "${link_2}",
          "target": {
            "href": "Film_Appa",
            "page": "Film_Appa"
          }
        },
        {
          "body": "Momo",
          "key": "${link_3}",
          "target": {
            "href": "Film_Momo",
            "page": "Film_Momo"
          }
        }
      ],
      "text": "One hundred years later Aang, Sokka, Katara, and Appa visited the temple at the behest of the young airbender, who wished to find his people. Unaware of the disaster that had befallen his family, he moved through the deserted buildings, finding no one, save for a stray lemur Aang named Momo. Determined to find his friends, Aang set course for the praying fields, where he found the massacre that had taken place a century before; human bones, the only remains of the Air Nomads, were scattered across the field."
    },
    {
      "body": "Devastated, Aang walked around the field, eventually stumbling upon a set of bones he was able to identify as his former friend and mentor, Monk ${link_0}, due to the elder's necklace still being intact. Overcome with anger and grief, Aang entered the Avatar State, conjuring a tornado to rage over the field. Sokka wanted to leave the place, before he would be blow off the mountain, but Katara made her way up to Aang in an attempt to calm him down. She successfully managed to do so, and the trio left the temple, bringing Momo with them.",
      "links": [
        {
          "body": "Gyatso",
          "key": "${link_0}",
          "target": {
            "href": "Film_Gyatso",
            "page": "Film_Gyatso"
          }
        }
      ],
      "text": "Devastated, Aang walked around the field, eventually stumbling upon a set of bones he was able to identify as his former friend and mentor, Monk Gyatso, due to the elder's necklace still being intact. Overcome with anger and grief, Aang entered the Avatar State, conjuring a tornado to rage over the field. Sokka wanted to leave the place, before he would be blow off the mountain, but Katara made her way up to Aang in an attempt to calm him down. She successfully managed to do so, and the trio left the temple, bringing Momo with them."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Film:Southern_Air_Temple",
    "file": "avatar.wikia.com/wiki/Film_Southern_Air_Temple.html",
    "page": "Film_Southern_Air_Temple",
    "title": "Southern Air Temple"
  }
}