{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Bending training",
      "target": {
        "href": "Category_Bending_training",
        "page": "Category_Bending_training"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "href": "Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Firebending",
      "target": {
        "href": "Category_Firebending",
        "page": "Category_Firebending"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} practiced his ${link_1} on ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "his ship",
          "key": "${link_2}",
          "target": {
            "href": "Zuko%27s_ship",
            "page": "Zuko%27s_ship"
          }
        }
      ],
      "text": "Zuko practiced his firebending on his ship."
    },
    {
      "body": "${link_0} masters employ a variety of distinct training exercises that considerably aid their pupils in mastering the art of firebending. Breathing exercises are considered fundamental during training, as power for firebending comes from the breath. Firebending was first mastered by the ${link_1} and was passed down to humans by them.",
      "links": [
        {
          "body": "Firebending",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "dragons",
          "key": "${link_1}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        }
      ],
      "text": "Firebending masters employ a variety of distinct training exercises that considerably aid their pupils in mastering the art of firebending. Breathing exercises are considered fundamental during training, as power for firebending comes from the breath. Firebending was first mastered by the dragons and was passed down to humans by them."
    },
    {
      "body": "${link_0} instructed ${link_1} to control his breath.",
      "links": [
        {
          "body": "Jeong Jeong",
          "key": "${link_0}",
          "target": {
            "href": "Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Jeong Jeong instructed Aang to control his breath."
    },
    {
      "body": "Breath control is an important part of firebending training, as ${link_0} made ${link_1} practice it for hours at a time as his first exercise while training him. While overseeing ${link_2}'s firebending training, ${link_3} criticized his nephew, saying that \"firebending power comes from the breath, not the muscle.\" The elder explained that the breath becomes energy within the body, which is released in the form of fire. While training Aang, Zuko was heard saying \"breathe and release\" showing the importance of breath control. The correct way to do this is to inhale through the nose and exhale through the mouth slowly. Jeong Jeong stressed that proper breath control was necessary to prevent fire from expanding and becoming dangerous. Jeong Jeong compared the danger of firebending with other bending arts by stating that, \"A rock without a bender won't throw itself, but fire is alive, it breathes, it grows,\" to show how essential proper breath control is to mastering firebending.",
      "links": [
        {
          "body": "Jeong Jeong",
          "key": "${link_0}",
          "target": {
            "href": "Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_2}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_3}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Breath control is an important part of firebending training, as Jeong Jeong made Aang practice it for hours at a time as his first exercise while training him. While overseeing Zuko's firebending training, Iroh criticized his nephew, saying that \"firebending power comes from the breath, not the muscle.\" The elder explained that the breath becomes energy within the body, which is released in the form of fire. While training Aang, Zuko was heard saying \"breathe and release\" showing the importance of breath control. The correct way to do this is to inhale through the nose and exhale through the mouth slowly. Jeong Jeong stressed that proper breath control was necessary to prevent fire from expanding and becoming dangerous. Jeong Jeong compared the danger of firebending with other bending arts by stating that, \"A rock without a bender won't throw itself, but fire is alive, it breathes, it grows,\" to show how essential proper breath control is to mastering firebending."
    },
    {
      "body": "${link_0}'s ${link_1} lacked drive after he joined ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Zuko's firebending lacked drive after he joined Team Avatar."
    },
    {
      "body": "For every form of bending, there must be drive within a person to bend. Originally, the common drive for firebending was about energy and life, but this was later distorted into rage, hatred, and destruction by the ${link_0} during the ${link_1}. Firebending power stems from the unflinching will to accomplish one's goals. After Aang learned the true source of firebending from the ancient ${link_2} and the dragons ${link_3}, he described the fire as being \"like a little heartbeat\". Initially, Zuko's drive was to capture the Avatar and he used that desire to fuel his bending. However, when he changed sides and joined ${link_4}, his bending was weakened; it was only when he realized it was his duty to help Aang bring balance to the world that he fully regained his ability to create powerful flames.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_1}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Sun Warriors",
          "key": "${link_2}",
          "target": {
            "href": "Sun_Warriors",
            "page": "Sun_Warriors"
          }
        },
        {
          "body": "Ran and Shaw",
          "key": "${link_3}",
          "target": {
            "href": "Ran_and_Shaw",
            "page": "Ran_and_Shaw"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_4}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "For every form of bending, there must be drive within a person to bend. Originally, the common drive for firebending was about energy and life, but this was later distorted into rage, hatred, and destruction by the Fire Nation during the Hundred Year War. Firebending power stems from the unflinching will to accomplish one's goals. After Aang learned the true source of firebending from the ancient Sun Warriors and the dragons Ran and Shaw, he described the fire as being \"like a little heartbeat\". Initially, Zuko's drive was to capture the Avatar and he used that desire to fuel his bending. However, when he changed sides and joined Team Avatar, his bending was weakened; it was only when he realized it was his duty to help Aang bring balance to the world that he fully regained his ability to create powerful flames."
    },
    {
      "body": "One of the most vital sources of firebending is the sun, which makes it an important priority to be able to feel the heat and energy it releases. During his firebending training, Aang was instructed by Jeong Jeong to stand for long periods of time outdoors feeling the heat of the sun. Consequently, when a solar eclipse occurs, firebenders lose their ability to bend because of the lack of the bending art's source of energy.",
      "links": [],
      "text": "One of the most vital sources of firebending is the sun, which makes it an important priority to be able to feel the heat and energy it releases. During his firebending training, Aang was instructed by Jeong Jeong to stand for long periods of time outdoors feeling the heat of the sun. Consequently, when a solar eclipse occurs, firebenders lose their ability to bend because of the lack of the bending art's source of energy."
    },
    {
      "body": "There are two known types of training forms: the traditional form employed by most firebenders in the Fire Nation, and the ancient form employed by the Sun Warriors, Iroh, Zuko, and Aang. The traditional forms use strong strikes that require firm stances, not entirely unlike ${link_0}. The style that the Sun Warriors learned from the dragons employs a more natural and flowing movement and allows the user a more flexible style of combat, as seen many times by Zuko, who initially learned some of the unique forms from Iroh during his private training.",
      "links": [
        {
          "body": "earthbending",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "There are two known types of training forms: the traditional form employed by most firebenders in the Fire Nation, and the ancient form employed by the Sun Warriors, Iroh, Zuko, and Aang. The traditional forms use strong strikes that require firm stances, not entirely unlike earthbending. The style that the Sun Warriors learned from the dragons employs a more natural and flowing movement and allows the user a more flexible style of combat, as seen many times by Zuko, who initially learned some of the unique forms from Iroh during his private training."
    },
    {
      "body": "While training under Zuko, Aang had certain assignments. He was instructed to do twenty sets of fire fists and ten hot squats every time he heard a ${link_0} croak. When under the tutelage of Master Jeong Jeong, Aang was ordered to prevent a small flame generated at the center of a leaf from reaching its edges for as long as he possibly could. There are other forms of firebending exercises, however, these forms have not been explored in great detail.",
      "links": [
        {
          "body": "badgerfrog",
          "key": "${link_0}",
          "target": {
            "href": "Badgerfrog",
            "page": "Badgerfrog"
          }
        }
      ],
      "text": "While training under Zuko, Aang had certain assignments. He was instructed to do twenty sets of fire fists and ten hot squats every time he heard a badgerfrog croak. When under the tutelage of Master Jeong Jeong, Aang was ordered to prevent a small flame generated at the center of a leaf from reaching its edges for as long as he possibly could. There are other forms of firebending exercises, however, these forms have not been explored in great detail."
    },
    {
      "body": "The ancient Sun Warrior civilization employed the original method of learning firebending rather than the modernized method which is solely based on anger and inner drive. The Sun Warriors took immense pride in their culture and valued the traditional methods of learning firebending. For a long time during the ${link_0}, they were an undiscovered civilization, thought to have gone completely extinct until Aang and Zuko traveled to their civilization and learned of their present existence.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "The ancient Sun Warrior civilization employed the original method of learning firebending rather than the modernized method which is solely based on anger and inner drive. The Sun Warriors took immense pride in their culture and valued the traditional methods of learning firebending. For a long time during the Hundred Year War, they were an undiscovered civilization, thought to have gone completely extinct until Aang and Zuko traveled to their civilization and learned of their present existence."
    },
    {
      "body": "People who wished to learn the true nature of firebending needed to go through a ceremonial ritual where they presented a piece of the ${link_0} to two masters, Ran and Shaw, who happened to be the last living ${link_1}. The ritual was traditionally coupled with ceremonial music playing, bowing down, and firebending displays. If the masters deemed the subject worthy, they would pass on the secrets of the art of firebending, in Aang and Zuko's case, through the release of multi-colored flames that formed a spiraling column around the two; if deemed unworthy, the person would be destroyed on the spot.",
      "links": [
        {
          "body": "Eternal Flame",
          "key": "${link_0}",
          "target": {
            "href": "Eternal_Flame",
            "page": "Eternal_Flame"
          }
        },
        {
          "body": "dragons",
          "key": "${link_1}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        }
      ],
      "text": "People who wished to learn the true nature of firebending needed to go through a ceremonial ritual where they presented a piece of the Eternal Flame to two masters, Ran and Shaw, who happened to be the last living dragons. The ritual was traditionally coupled with ceremonial music playing, bowing down, and firebending displays. If the masters deemed the subject worthy, they would pass on the secrets of the art of firebending, in Aang and Zuko's case, through the release of multi-colored flames that formed a spiraling column around the two; if deemed unworthy, the person would be destroyed on the spot."
    },
    {
      "body": "A series of statues illustrate the ${link_0} form.",
      "links": [
        {
          "body": "Dancing Dragon",
          "key": "${link_0}",
          "target": {
            "href": "Dancing_Dragon",
            "page": "Dancing_Dragon"
          }
        }
      ],
      "text": "A series of statues illustrate the Dancing Dragon form."
    },
    {
      "body": "The Dancing Dragon is an ancient firebending form employed by Avatar ${link_0} and the Sun Warriors, who learned it from the original firebenders, the dragons. The Dancing Dragon is based on three types of attacks: low kicks, high punches or hits, and double punches with both fists. This technique was one of the only known firebending forms to employ both attacks and defenses. This \"dance\" was so effective that Zuko was able to effectively duel the prodigious Azula after he mastered it enough to use in battle.",
      "links": [
        {
          "body": "Wan",
          "key": "${link_0}",
          "target": {
            "href": "Wan",
            "page": "Wan"
          }
        }
      ],
      "text": "The Dancing Dragon is an ancient firebending form employed by Avatar Wan and the Sun Warriors, who learned it from the original firebenders, the dragons. The Dancing Dragon is based on three types of attacks: low kicks, high punches or hits, and double punches with both fists. This technique was one of the only known firebending forms to employ both attacks and defenses. This \"dance\" was so effective that Zuko was able to effectively duel the prodigious Azula after he mastered it enough to use in battle."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Firebending_training",
    "file": "avatar.wikia.com/wiki/Firebending_training.html",
    "page": "Firebending_training",
    "title": "Firebending training"
  }
}