{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "external": false,
        "href": "/wiki/Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Featured articles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Featured_articles",
        "page": "Category_Featured_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Bending arts",
      "target": {
        "external": false,
        "href": "/wiki/Category_Bending_arts",
        "page": "Category_Bending_arts"
      }
    },
    {
      "body": "Firebending",
      "target": {
        "external": false,
        "href": "/wiki/Category_Firebending",
        "page": "Category_Firebending"
      }
    }
  ],
  "facts": [
    {
      "key": "Source",
      "value": [
        {
          "body": "Sun",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Sun",
          "value": "Sun",
          "value_text": "Sun"
        }
      ]
    },
    {
      "key": "Learned from",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Dragons",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Dragon",
                "page": "Dragon"
              }
            }
          ],
          "text": "Dragons",
          "value": "${link_0}",
          "value_text": "Dragons"
        }
      ]
    },
    {
      "key": "Alternate styles",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Combustionbending",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Specialized_bending_techniques#Combustionbending",
                "page": "Specialized_bending_techniques"
              }
            }
          ],
          "text": "Combustionbending",
          "value": "${link_0}",
          "value_text": "Combustionbending"
        },
        {
          "body": "${link_0} and ${link_1}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Lightning generation",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Lightning_generation",
                "page": "Lightning_generation"
              }
            },
            {
              "body": "redirection",
              "key": "${link_1}",
              "target": {
                "external": false,
                "href": "/wiki/Lightning_redirection",
                "page": "Lightning_redirection"
              }
            }
          ],
          "text": "Lightning generation and redirection",
          "value": "${link_0} and ${link_1}",
          "value_text": "Lightning generation and redirection"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Firebending, one of the four elemental ${link_0}, is the pyrokinetic ability to control fire. It is unique among the bending arts, as it is the only one in which the performer can generate the element. The first human firebenders lived in a city atop a ${link_1} during the ${link_2} and the art later spread to the ${link_3}, the ${link_4}, and the ${link_5}. The ${link_6} also has a small firebending minority.",
      "links": [
        {
          "body": "bending arts",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "lion turtle",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lion_turtle",
            "page": "Lion_turtle"
          }
        },
        {
          "body": "era of Raava",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Era_of_Raava",
            "page": "Era_of_Raava"
          }
        },
        {
          "body": "Sun Warriors",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Sun_Warriors",
            "page": "Sun_Warriors"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "United Republic of Nations",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "section": [
        "Firebending"
      ],
      "text": "Firebending, one of the four elemental bending arts, is the pyrokinetic ability to control fire. It is unique among the bending arts, as it is the only one in which the performer can generate the element. The first human firebenders lived in a city atop a lion turtle during the era of Raava and the art later spread to the Sun Warriors, the Fire Nation, and the United Republic of Nations. The Earth Kingdom also has a small firebending minority."
    },
    {
      "body": "As described by ${link_0}, fire is the element of power, consisting of overpowering force tempered by the unflinching will to accomplish tasks and desires. However, during the ${link_1}, a militaristic Fire Nation twisted this into firebending being fueled by rage, hatred, and anger. Firebending draws its power from the sun, and the first human firebenders derived their firebending techniques from the ${link_2}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "dragons",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon",
            "page": "Dragon"
          }
        }
      ],
      "section": [
        "Firebending"
      ],
      "text": "As described by Iroh, fire is the element of power, consisting of overpowering force tempered by the unflinching will to accomplish tasks and desires. However, during the Hundred Year War, a militaristic Fire Nation twisted this into firebending being fueled by rage, hatred, and anger. Firebending draws its power from the sun, and the first human firebenders derived their firebending techniques from the dragons."
    },
    {
      "body": "Firebending is known for its intense and aggressive attacking style and general lack of adequate defensive moves, although firebenders can modify offensive maneuvers to function as a defense, such as creating large walls of fire or shooting down incoming attacks with fire jabs.",
      "links": [],
      "section": [
        "Firebending"
      ],
      "text": "Firebending is known for its intense and aggressive attacking style and general lack of adequate defensive moves, although firebenders can modify offensive maneuvers to function as a defense, such as creating large walls of fire or shooting down incoming attacks with fire jabs."
    },
    {
      "body": "During the era of Raava, people received the element of fire from the fire lion turtle that was the guardian of their city, who would grant them the power with ${link_0}. They could request it whenever they ventured into the ${link_1} and were to return it when they came back. However, ${link_2} stole the power to better his life and that of his impoverished friends, but was captured and banished. He was allowed to keep the power of fire to protect himself and eventually befriended the spirits. As such, he managed to hone his skills by learning the proper way of bending from the dragons that lived in the Spirit Wilds. He developed his style in such a manner that his fire became an extension of his body, rather than a mere tool for protection as the others perceived it. Others learned of his survival and also set out into the Spirit Wilds with the power of fire, no longer wanting to live under the poor conditions they had in the city.",
      "links": [
        {
          "body": "energybending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Energybending",
            "page": "Energybending"
          }
        },
        {
          "body": "Spirit Wilds",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "Wan",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Wan",
            "page": "Wan"
          }
        }
      ],
      "section": [
        "Firebending",
        "Origin"
      ],
      "text": "During the era of Raava, people received the element of fire from the fire lion turtle that was the guardian of their city, who would grant them the power with energybending. They could request it whenever they ventured into the Spirit Wilds and were to return it when they came back. However, Wan stole the power to better his life and that of his impoverished friends, but was captured and banished. He was allowed to keep the power of fire to protect himself and eventually befriended the spirits. As such, he managed to hone his skills by learning the proper way of bending from the dragons that lived in the Spirit Wilds. He developed his style in such a manner that his fire became an extension of his body, rather than a mere tool for protection as the others perceived it. Others learned of his survival and also set out into the Spirit Wilds with the power of fire, no longer wanting to live under the poor conditions they had in the city."
    },
    {
      "body": "In the years following, people learned firebending from the dragons that had once populated the land. The first people in the era of the ${link_0} to learn from the dragons were the Sun Warriors, who understood the connection between the fire of their souls, the fire of the dragons, and the sun. In the remains of their once great civilization, ${link_1} and ${link_2} discovered that firebending represents energy and life, a concept that had been lost to nearly all firebenders in the Hundred Year War. The true meaning of firebending was forgotten as anger, rage and a desire to dominate began to replace the ideals of life and energy, and how they connect to the sun. The ${link_3} encouraged this to aid in the propaganda that fire could be used as a tool to destroy and that the Hundred Year War justified.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Royal Family",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_Royal_Family",
            "page": "Fire_Nation_Royal_Family"
          }
        }
      ],
      "section": [
        "Firebending",
        "Origin"
      ],
      "text": "In the years following, people learned firebending from the dragons that had once populated the land. The first people in the era of the Avatar to learn from the dragons were the Sun Warriors, who understood the connection between the fire of their souls, the fire of the dragons, and the sun. In the remains of their once great civilization, Zuko and Aang discovered that firebending represents energy and life, a concept that had been lost to nearly all firebenders in the Hundred Year War. The true meaning of firebending was forgotten as anger, rage and a desire to dominate began to replace the ideals of life and energy, and how they connect to the sun. The Royal Family encouraged this to aid in the propaganda that fire could be used as a tool to destroy and that the Hundred Year War justified."
    },
    {
      "body": "Firebenders draw their power from the sun and other solar objects, such as comets, as well as the fiery core of the planet. A solar eclipse has the potential to completely negate a firebender's power, which is the result of a direct connection between the sun and firebending. Additionally, after defeating ${link_0} at sunrise during the ${link_1}, Zuko stated that she rose with the moon, but he rose with the sun, further referencing the sun's importance to firebending. Firebenders are also said to draw power from volcanic energy and lightning.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Siege of the North",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        }
      ],
      "section": [
        "Firebending",
        "Origin"
      ],
      "text": "Firebenders draw their power from the sun and other solar objects, such as comets, as well as the fiery core of the planet. A solar eclipse has the potential to completely negate a firebender's power, which is the result of a direct connection between the sun and firebending. Additionally, after defeating Katara at sunrise during the Siege of the North, Zuko stated that she rose with the moon, but he rose with the sun, further referencing the sun's importance to firebending. Firebenders are also said to draw power from volcanic energy and lightning."
    },
    {
      "body": "Firebenders use their chi as a source for their bending. This facet of firebending is a sharp contrast to the other bending arts, which manipulate already present sources of their element, though firebenders can also control or enhance flames nearby.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style"
      ],
      "text": "Firebenders use their chi as a source for their bending. This facet of firebending is a sharp contrast to the other bending arts, which manipulate already present sources of their element, though firebenders can also control or enhance flames nearby."
    },
    {
      "body": "Firebending uses concentrated barrages of fire to overwhelm opponents before striking a fatal blow. Swift, whirling kicks and punches generate diverse shapes for offensive attacks. This strategy is probably what makes firebending arguably the most suited to pro-bending out of all the bending arts. Firebending tactics and forms have required little modification for use in pro-bending, the most noticeable difference in the restriction on the use of prolonged fire streams. Nevertheless, quick flurries of kicks and punches allow a pro-bending firebender to retain excellent mobility around the arena while simultaneously trying to push back the members of the opposing team.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style"
      ],
      "text": "Firebending uses concentrated barrages of fire to overwhelm opponents before striking a fatal blow. Swift, whirling kicks and punches generate diverse shapes for offensive attacks. This strategy is probably what makes firebending arguably the most suited to pro-bending out of all the bending arts. Firebending tactics and forms have required little modification for use in pro-bending, the most noticeable difference in the restriction on the use of prolonged fire streams. Nevertheless, quick flurries of kicks and punches allow a pro-bending firebender to retain excellent mobility around the arena while simultaneously trying to push back the members of the opposing team."
    },
    {
      "body": "Circular motion is also a crucial element to the skill as it seems to \"power up\" and enhance the firebender's flames. When creating lightning, the firebenders often move their arms in slow, circular motions, similar to waterbenders but with more tension.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style"
      ],
      "text": "Circular motion is also a crucial element to the skill as it seems to \"power up\" and enhance the firebender's flames. When creating lightning, the firebenders often move their arms in slow, circular motions, similar to waterbenders but with more tension."
    },
    {
      "body": "Blazing rings and arcs: Spinning kicks or sweeping arm movements create rings and arcs to slice larger, more widely spaced, or evasive targets. Zuko used a circular motion with his feet to create an expanding ring and successfully knocked Azula down during their ${link_0}.",
      "links": [
        {
          "body": "Comet-Enhanced Agni Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending abilities"
      ],
      "text": "Blazing rings and arcs: Spinning kicks or sweeping arm movements create rings and arcs to slice larger, more widely spaced, or evasive targets. Zuko used a circular motion with his feet to create an expanding ring and successfully knocked Azula down during their Comet-Enhanced Agni Kai."
    },
    {
      "body": "Blocking fire: A skilled firebender can defuse and extinguish an oncoming fire blast from another firebender by using a swift kick, jab, or any other defensive maneuver, allowing them to stop attacks.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending abilities"
      ],
      "text": "Blocking fire: A skilled firebender can defuse and extinguish an oncoming fire blast from another firebender by using a swift kick, jab, or any other defensive maneuver, allowing them to stop attacks."
    },
    {
      "body": "Fire blade: A more advanced version of a blazing arc. By narrowing and condensing their flame projections, firebenders can create thin blades of fire to slice through objects without completely destroying them. Azula used this technique to cut open a wall, and Zuko used it to free Azula from Katara's water whips.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending abilities"
      ],
      "text": "Fire blade: A more advanced version of a blazing arc. By narrowing and condensing their flame projections, firebenders can create thin blades of fire to slice through objects without completely destroying them. Azula used this technique to cut open a wall, and Zuko used it to free Azula from Katara's water whips."
    },
    {
      "body": "Fire bomb: Used as a short-range attack, a firebender can create a flame at the end of a limb and thrust the flame down in an explosive burst. Zuko used this technique once, and both Zuko and Aang performed it at the beginning of their routine on Ember Island. Enhanced by the power of ${link_0}, ${link_1} ${link_2} used an extremely powerful variant of a fire bomb to break through Aang's earth shield.",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Phoenix King",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Phoenix_King",
            "page": "Phoenix_King"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending abilities"
      ],
      "text": "Fire bomb: Used as a short-range attack, a firebender can create a flame at the end of a limb and thrust the flame down in an explosive burst. Zuko used this technique once, and both Zuko and Aang performed it at the beginning of their routine on Ember Island. Enhanced by the power of Sozin's Comet, Phoenix King Ozai used an extremely powerful variant of a fire bomb to break through Aang's earth shield."
    },
    {
      "body": "Fire circle: A technique demonstrated by the Sun Warriors. They created a circle of fire and suspended it in the air for an extended period of time. The Tribesmen made these circles with the ${link_0} just before Zuko and Aang were to be judged by Ran and Shaw.",
      "links": [
        {
          "body": "Eternal Flame",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Eternal_Flame",
            "page": "Eternal_Flame"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending abilities"
      ],
      "text": "Fire circle: A technique demonstrated by the Sun Warriors. They created a circle of fire and suspended it in the air for an extended period of time. The Tribesmen made these circles with the Eternal Flame just before Zuko and Aang were to be judged by Ran and Shaw."
    },
    {
      "body": "Fire daggers: Blowtorch-like jets which are created from the fist or fingertips to use as close range melee attacks. However, they lack the ability to actually block physical objects. Both Zuko and Azula have used this technique, the latter to hold ${link_0} hostage during the ${link_1}. ${link_2} used a variant of this technique, creating a blowtorch as opposed to a dagger to cut through the chains that were binding ${link_3} and his family during the ${link_4}. ${link_5} used this technique to threaten ${link_6} for information regarding the theft of ${link_7}' entire stockpile of technology. Korra also used this technique when getting ready to fight ${link_8} at the ${link_9}.",
      "links": [
        {
          "body": "Kuei",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuei",
            "page": "Kuei"
          }
        },
        {
          "body": "Coup of Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Equalist victory rally",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Equalist_victory_rally",
            "page": "Equalist_victory_rally"
          }
        },
        {
          "body": "Mako",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Two Toed Ping",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Two_Toed_Ping",
            "page": "Two_Toed_Ping"
          }
        },
        {
          "body": "Future Industries",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries",
            "page": "Future_Industries"
          }
        },
        {
          "body": "Macao and Lily",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Macao_and_Lily",
            "page": "Macao_and_Lily"
          }
        },
        {
          "body": "Misty Palms Inn",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Misty_Palms_Inn",
            "page": "Misty_Palms_Inn"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending abilities"
      ],
      "text": "Fire daggers: Blowtorch-like jets which are created from the fist or fingertips to use as close range melee attacks. However, they lack the ability to actually block physical objects. Both Zuko and Azula have used this technique, the latter to hold Kuei hostage during the Coup of Ba Sing Se. Korra used a variant of this technique, creating a blowtorch as opposed to a dagger to cut through the chains that were binding Tenzin and his family during the Equalist victory rally. Mako used this technique to threaten Two Toed Ping for information regarding the theft of Future Industries' entire stockpile of technology. Korra also used this technique when getting ready to fight Macao and Lily at the Misty Palms Inn."
    },
    {
      "body": "Fire lashes: An even further extension of the fire whip/stream, firebenders can create a long lash of fire and bring it down on their enemies, like Azula did to Aang, or create smaller, multiple lashes and envelop an area with fire, like Zuko did.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending abilities"
      ],
      "text": "Fire lashes: An even further extension of the fire whip/stream, firebenders can create a long lash of fire and bring it down on their enemies, like Azula did to Aang, or create smaller, multiple lashes and envelop an area with fire, like Zuko did."
    },
    {
      "body": "Fire streams: A basic firebending ability, firebenders can shoot continuous streams of fire from their fingertips, fists, palms, or legs. These streams can be widened to create flame-thrower like techniques. Fire Nation soldiers often used this technique to damage or destroy villages and towns.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending abilities"
      ],
      "text": "Fire streams: A basic firebending ability, firebenders can shoot continuous streams of fire from their fingertips, fists, palms, or legs. These streams can be widened to create flame-thrower like techniques. Fire Nation soldiers often used this technique to damage or destroy villages and towns."
    },
    {
      "body": "Fire whip: An extension of a fire stream, this continuous stream of flame has a semi-tactile quality and can be utilized as a whip. The prison guards at the ${link_0} used this technique to round up the prisoners during a lock down, and a trainer of the ${link_1} employed it to intimidate ${link_2}. Zuko used a larger version of the fire whip in his fight in ${link_3}, creating streams of great length for continuous mid-to-long range combat, which he used to counter Katara's water whip technique.",
      "links": [
        {
          "body": "Boiling Rock",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "Fire Nation circus",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_circus",
            "page": "Fire_Nation_circus"
          }
        },
        {
          "body": "Appa",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending abilities"
      ],
      "text": "Fire whip: An extension of a fire stream, this continuous stream of flame has a semi-tactile quality and can be utilized as a whip. The prison guards at the Boiling Rock used this technique to round up the prisoners during a lock down, and a trainer of the Fire Nation circus employed it to intimidate Appa. Zuko used a larger version of the fire whip in his fight in Ba Sing Se, creating streams of great length for continuous mid-to-long range combat, which he used to counter Katara's water whip technique."
    },
    {
      "body": "Fireballs or \"Fire-jabs\": Another basic ability, jabs and punches produce miniature fireballs and missiles of flame. These can be charged up (refer to \"charged attacks\" entry) to create larger, slower bursts, or swiftly and repetitively fired to keep opponents off balance.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending abilities"
      ],
      "text": "Fireballs or \"Fire-jabs\": Another basic ability, jabs and punches produce miniature fireballs and missiles of flame. These can be charged up (refer to \"charged attacks\" entry) to create larger, slower bursts, or swiftly and repetitively fired to keep opponents off balance."
    },
    {
      "body": "Flame redirection: In a similar fashion to waterbending, firebenders are capable of changing the course of an incoming fire blast and redirecting it back at the attacker using fluid motion. This move exemplifies the use of firebending as an extension of the body and is used infrequently in modern combat in favor of more offensive maneuvers. Wan used this to defend spirits from firebending hunters.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending abilities"
      ],
      "text": "Flame redirection: In a similar fashion to waterbending, firebenders are capable of changing the course of an incoming fire blast and redirecting it back at the attacker using fluid motion. This move exemplifies the use of firebending as an extension of the body and is used infrequently in modern combat in favor of more offensive maneuvers. Wan used this to defend spirits from firebending hunters."
    },
    {
      "body": "Shield of fire: This technique creates a protective shield of fire in front of, or around, a firebender that can deflect attacks and explosions. It may be a lesser version of the Wall of Flames.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending abilities"
      ],
      "text": "Shield of fire: This technique creates a protective shield of fire in front of, or around, a firebender that can deflect attacks and explosions. It may be a lesser version of the Wall of Flames."
    },
    {
      "body": "The ${link_0}: This firebending form was learned from the sacred statues that were hidden atop the ancient civilization of the Sun Warriors. It involves a more fluid and natural form of firebending. It is a simple, yet possibly very powerful firebending form, as it also brings advantages for more skilled firebenders; upon integrating it into his own style, Zuko's abilities improved to the point that he was able to duel evenly with Azula, successfully dispelling her attacks instead of overcoming them or trying to endure them. It is also one of the few firebending techniques with defensive capabilities. There is a circular nature to the technique, which is unusual in firebending; the only other known techniques to incorporate smooth, circular movements are the fire circle and lightning generation.",
      "links": [
        {
          "body": "Dancing Dragon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dancing_Dragon",
            "page": "Dancing_Dragon"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending abilities"
      ],
      "text": "The Dancing Dragon: This firebending form was learned from the sacred statues that were hidden atop the ancient civilization of the Sun Warriors. It involves a more fluid and natural form of firebending. It is a simple, yet possibly very powerful firebending form, as it also brings advantages for more skilled firebenders; upon integrating it into his own style, Zuko's abilities improved to the point that he was able to duel evenly with Azula, successfully dispelling her attacks instead of overcoming them or trying to endure them. It is also one of the few firebending techniques with defensive capabilities. There is a circular nature to the technique, which is unusual in firebending; the only other known techniques to incorporate smooth, circular movements are the fire circle and lightning generation."
    },
    {
      "body": "Charged attacks: Certain firebenders have been shown charging their attacks before releasing them, allowing them to create enormous blasts of fire. Zuko and Iroh used a combined charged attack against Aang prior to their first encounter. Zhao may have charged some of his attacks before releasing them when he fought Aang. Azula used this skill against Aang while they were battling atop ${link_0}. During the ${link_1}, Zuko used this technique against both Aang and Katara, and Iroh used a charged fire blast to defend himself against several ${link_2} agents. During the ${link_3}, using comet-enhanced firebending, Phoenix King Ozai and several ${link_4} unleashed charged fire blasts of enormous size from airships in an attempt to carry out their scorched earth plan, and Ozai later used it again to break Aang's rock sphere during their battle. Iroh used a charged attack to destroy ${link_5}'s thick Inner Wall during the ${link_6}.",
      "links": [
        {
          "body": "the drill",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        },
        {
          "body": "Battle in the Crystal Catacombs",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Coup_of_Ba_Sing_Se#Battle_in_the_Crystal_Catacombs",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "battle at Wulong Forest",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Battle_at_Wulong_Forest",
            "page": "Battle_at_Wulong_Forest"
          }
        },
        {
          "body": "Imperial Firebenders",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Royal_Procession",
            "page": "Royal_Procession"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "liberation of the city",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Liberation_of_Ba_Sing_Se",
            "page": "Liberation_of_Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending master level"
      ],
      "text": "Charged attacks: Certain firebenders have been shown charging their attacks before releasing them, allowing them to create enormous blasts of fire. Zuko and Iroh used a combined charged attack against Aang prior to their first encounter. Zhao may have charged some of his attacks before releasing them when he fought Aang. Azula used this skill against Aang while they were battling atop the drill. During the Battle in the Crystal Catacombs, Zuko used this technique against both Aang and Katara, and Iroh used a charged fire blast to defend himself against several Dai Li agents. During the battle at Wulong Forest, using comet-enhanced firebending, Phoenix King Ozai and several Imperial Firebenders unleashed charged fire blasts of enormous size from airships in an attempt to carry out their scorched earth plan, and Ozai later used it again to break Aang's rock sphere during their battle. Iroh used a charged attack to destroy Ba Sing Se's thick Inner Wall during the liberation of the city."
    },
    {
      "body": "Fire augmentation: Firebenders can also control the size and intensity of any nearby flames and can draw them in to manipulate them at will. Zuko was the first one to show mastery over this technique, when he augmented the flame of the candles before him when his uncle brought him bad news. Avatar Roku used this method to protect himself and counter an attack by Zhao and his soldiers while Aang channeled his spirit. ${link_0} augmented the fire in his candles while he was discouraging Aang. When Azula scared ${link_1}, the torch behind Azula also fell under her firebending, as it burned bright blue. Zuko later augmented a campfire while confronting his anger. Another example is the fire in the ${link_2}'s throne room. When Ozai and Azulon got angry, the flames rose up higher and burned more rapidly. It was also evident when Azula was on the throne and the flames around her turned a dark blue. Another example was when Zuko was attacking Aang in the beach house, as he disintegrated flames Aang used to counter-attack.",
      "links": [
        {
          "body": "Jeong Jeong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        },
        {
          "body": "Chan",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Chan",
            "page": "Chan"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending master level"
      ],
      "text": "Fire augmentation: Firebenders can also control the size and intensity of any nearby flames and can draw them in to manipulate them at will. Zuko was the first one to show mastery over this technique, when he augmented the flame of the candles before him when his uncle brought him bad news. Avatar Roku used this method to protect himself and counter an attack by Zhao and his soldiers while Aang channeled his spirit. Jeong Jeong augmented the fire in his candles while he was discouraging Aang. When Azula scared Chan, the torch behind Azula also fell under her firebending, as it burned bright blue. Zuko later augmented a campfire while confronting his anger. Another example is the fire in the Fire Lord's throne room. When Ozai and Azulon got angry, the flames rose up higher and burned more rapidly. It was also evident when Azula was on the throne and the flames around her turned a dark blue. Another example was when Zuko was attacking Aang in the beach house, as he disintegrated flames Aang used to counter-attack."
    },
    {
      "body": "Fire comet: An advanced form of the fire stream in which the user pressurizes the fire into a ball and shoots it toward the enemy. Iroh employed this technique to break through the Inner Wall during the liberation of Ba Sing Se.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending master level"
      ],
      "text": "Fire comet: An advanced form of the fire stream in which the user pressurizes the fire into a ball and shoots it toward the enemy. Iroh employed this technique to break through the Inner Wall during the liberation of Ba Sing Se."
    },
    {
      "body": "Fire missiles: A more advanced form of the fire stream, powerful firebenders can shoot long streams of fire that follow the target as they move. This technique was used by both Ozai and Aang during the battle at Wulong Forest.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending master level"
      ],
      "text": "Fire missiles: A more advanced form of the fire stream, powerful firebenders can shoot long streams of fire that follow the target as they move. This technique was used by both Ozai and Aang during the battle at Wulong Forest."
    },
    {
      "body": "Fire pinwheel: A whirling disk of flame, capable of being used at long range. Only Azula appeared to have the ability to create these while in pursuit of Aang in ${link_0}.",
      "links": [
        {
          "body": "Omashu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Omashu",
            "page": "Omashu"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending master level"
      ],
      "text": "Fire pinwheel: A whirling disk of flame, capable of being used at long range. Only Azula appeared to have the ability to create these while in pursuit of Aang in Omashu."
    },
    {
      "body": "Intertwined fire stream: An advanced move based on the basic fire stream. The performer directs two powerful fire streams at their opponent, though by intertwining the two streams, a massive, comet-shaped fire stream is formed that has more power than the single stream. Zuko used this technique in the Crystal Catacombs, and later again in ${link_0} with Azula.",
      "links": [
        {
          "body": "his Agni Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending master level"
      ],
      "text": "Intertwined fire stream: An advanced move based on the basic fire stream. The performer directs two powerful fire streams at their opponent, though by intertwining the two streams, a massive, comet-shaped fire stream is formed that has more power than the single stream. Zuko used this technique in the Crystal Catacombs, and later again in his Agni Kai with Azula."
    },
    {
      "body": "Jet propulsion: Skilled firebending masters are able to conjure huge amounts of flame to propel themselves at high speeds on the ground or through the air. Normally, this can only be used for short periods of time by regular firebenders; however, when augmented by Sozin's Comet or the Avatar State, the technique can be used for sustained levitation and flight. It was first demonstrated by Azula during her battle with Aang in the ${link_0}. During the fight, Azula released the flames she used to propel herself horizontally, which blasted Aang backward. Azula used this skill to propel herself through the air over the ${link_1}, as she was pursuing Zuko, Sokka, and Suki when they were escaping the prison. When Azula was knocked off an ${link_2}, she used a smaller burst of fire to propel herself on to a cliff, saving herself from falling to her death. During Sozin's Comet, Ozai and Jeong Jeong were capable of utilizing this skill with much more proficiency than Azula had ever shown. Azula and Zuko both executed this technique while powered by the comet during ${link_3}, and Phoenix King Ozai used it extensively during the battle at Wulong Forest with Aang. It was also used by General Iroh of the United Forces as he flew through the air above Republic City while defending against Equalist planes. This technique can also be used to briefly run across a vertical surface as Mako and Korra did during an ${link_4} ${link_5}. Korra also used it to propel herself through the air during her fight with ${link_6}.",
      "links": [
        {
          "body": "Crystal Catacombs",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        },
        {
          "body": "boiling lake",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "airship",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        },
        {
          "body": "their Agni Kai",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "rally",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Equalist_victory_rally",
            "page": "Equalist_victory_rally"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending master level"
      ],
      "text": "Jet propulsion: Skilled firebending masters are able to conjure huge amounts of flame to propel themselves at high speeds on the ground or through the air. Normally, this can only be used for short periods of time by regular firebenders; however, when augmented by Sozin's Comet or the Avatar State, the technique can be used for sustained levitation and flight. It was first demonstrated by Azula during her battle with Aang in the Crystal Catacombs. During the fight, Azula released the flames she used to propel herself horizontally, which blasted Aang backward. Azula used this skill to propel herself through the air over the boiling lake, as she was pursuing Zuko, Sokka, and Suki when they were escaping the prison. When Azula was knocked off an airship, she used a smaller burst of fire to propel herself on to a cliff, saving herself from falling to her death. During Sozin's Comet, Ozai and Jeong Jeong were capable of utilizing this skill with much more proficiency than Azula had ever shown. Azula and Zuko both executed this technique while powered by the comet during their Agni Kai, and Phoenix King Ozai used it extensively during the battle at Wulong Forest with Aang. It was also used by General Iroh of the United Forces as he flew through the air above Republic City while defending against Equalist planes. This technique can also be used to briefly run across a vertical surface as Mako and Korra did during an Equalist rally. Korra also used it to propel herself through the air during her fight with Zaheer."
    },
    {
      "body": "Pressurized fire stream: A more powerful form of the fire stream, achieved by pressurizing the fire before it is released. It covers more area than a regular fire stream. Phoenix King Ozai and the Imperial Firebenders used this during their assault on ${link_0}.",
      "links": [
        {
          "body": "Wulong Forest",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wulong_Forest",
            "page": "Wulong_Forest"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending master level"
      ],
      "text": "Pressurized fire stream: A more powerful form of the fire stream, achieved by pressurizing the fire before it is released. It covers more area than a regular fire stream. Phoenix King Ozai and the Imperial Firebenders used this during their assault on Wulong Forest."
    },
    {
      "body": "Wall of flames: One of firebending's few defensive techniques, either a situated explosion or controlled inferno, this wall of concentrated flames acts as a barrier to incoming attacks. It may be a more powerful version of a fire shield. It not only protects against attacks, but when used right, can be used to stealthily escape from foes. Azula once used it to deflect four simultaneous attacks from all four elements to provide herself a stealthy escape. Zuko used it to stop a combustion attack (although he was still being pushed back by the force). Master Jeong Jeong also used this method to stop a group of ${link_0} patrol boats, so precise was his control that his flames burned on water. He later created another wall to shield himself from four firebending attacks and escaped from Zhao. Later on, Jeong Jeong used the technique to push back several Fire Nation tanks, which shows that it can also be an offensive move. It should be noted that at that instance his firebending was being powered by ${link_1}.",
      "links": [
        {
          "body": "Fire Navy",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Firebending master level"
      ],
      "text": "Wall of flames: One of firebending's few defensive techniques, either a situated explosion or controlled inferno, this wall of concentrated flames acts as a barrier to incoming attacks. It may be a more powerful version of a fire shield. It not only protects against attacks, but when used right, can be used to stealthily escape from foes. Azula once used it to deflect four simultaneous attacks from all four elements to provide herself a stealthy escape. Zuko used it to stop a combustion attack (although he was still being pushed back by the force). Master Jeong Jeong also used this method to stop a group of Fire Navy patrol boats, so precise was his control that his flames burned on water. He later created another wall to shield himself from four firebending attacks and escaped from Zhao. Later on, Jeong Jeong used the technique to push back several Fire Nation tanks, which shows that it can also be an offensive move. It should be noted that at that instance his firebending was being powered by Sozin's Comet."
    },
    {
      "body": "Long-range multiple fire whips: An Avatar-level firebender can produce fire whips, the most being five at once. They are capable of reaching across long distances, displayed when Aang used the technique hundreds of feet above Ozai. This may have been a result of his firebending being augmented by Sozin's Comet or because he was in the Avatar State at the time, or possibly a combination of both. Each fire whip is also very wide and moves in a similar fashion to squid or octopus tentacles. They have enough destructive power to demolish large rock formations. This could be the technique ${link_0} was referring to when he said that, \"only a fully realized Avatar can open the sanctuary doors alone.\"",
      "links": [
        {
          "body": "Shyu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Shyu",
            "page": "Shyu"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Avatar level firebending"
      ],
      "text": "Long-range multiple fire whips: An Avatar-level firebender can produce fire whips, the most being five at once. They are capable of reaching across long distances, displayed when Aang used the technique hundreds of feet above Ozai. This may have been a result of his firebending being augmented by Sozin's Comet or because he was in the Avatar State at the time, or possibly a combination of both. Each fire whip is also very wide and moves in a similar fashion to squid or octopus tentacles. They have enough destructive power to demolish large rock formations. This could be the technique Shyu was referring to when he said that, \"only a fully realized Avatar can open the sanctuary doors alone.\""
    },
    {
      "body": "Blue fire: Only Azula has demonstrated the ability to bend completely blue flames, which are hotter than the orange flames produced by most other firebenders. The production of blue fire is attributed to prodigious skill in firebending.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Special techniques"
      ],
      "text": "Blue fire: Only Azula has demonstrated the ability to bend completely blue flames, which are hotter than the orange flames produced by most other firebenders. The production of blue fire is attributed to prodigious skill in firebending."
    },
    {
      "body": "Breath of fire: The breath of fire involves the user firebending out of his or her mouth, mixing air from the lungs with the flame, creating a wider, hotter blast. This has been exhibited by multiple individuals, including Ozai, Iroh, Zuko, Azula, Aang, Mako, and Korra. It was the employment of this firebending style in the heat of battle that earned General Iroh the nickname, \"The Dragon of the West\". It is alluded that it was from Iroh that Zuko learned how to create his own breath of fire, though his was smaller and less intense, while Iroh's produced the force of a fire stream. With its wide, encompassing range, the technique allows for staving off multiple opponents and is also shown to be able to instantaneously warm the body even under frigid conditions. It is also useful for stealth, as it requires no hand motions and can thus be impossible to predict. Tea can also serve as a catalyst for this technique, as shown by Iroh.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Special techniques"
      ],
      "text": "Breath of fire: The breath of fire involves the user firebending out of his or her mouth, mixing air from the lungs with the flame, creating a wider, hotter blast. This has been exhibited by multiple individuals, including Ozai, Iroh, Zuko, Azula, Aang, Mako, and Korra. It was the employment of this firebending style in the heat of battle that earned General Iroh the nickname, \"The Dragon of the West\". It is alluded that it was from Iroh that Zuko learned how to create his own breath of fire, though his was smaller and less intense, while Iroh's produced the force of a fire stream. With its wide, encompassing range, the technique allows for staving off multiple opponents and is also shown to be able to instantaneously warm the body even under frigid conditions. It is also useful for stealth, as it requires no hand motions and can thus be impossible to predict. Tea can also serve as a catalyst for this technique, as shown by Iroh."
    },
    {
      "body": "Combustionbending: Combustionbending is an ability employed by ${link_0} and ${link_1}, which allows the bender to ignite objects with their mind instead of traditional firebending methods. Combustionbenders concentrate the energy through a tattooed third eye to project a ray of heat which detonates with great force, producing situated explosions with a great deal of precision. This technique is extremely effective and very destructive, capable of use at close and long-range; it can completely disintegrate hill-sized boulders and instantaneously evaporate large bodies of water with ease. It can also be employed to burn things without setting an explosion, similar to a lens focusing sunlight. The beam can also be curved, as demonstrated by P'Li. However, the technique has the potential to be just as hazardous to the user as it can be to their surroundings, as Combustion Man blew off his own right arm and leg due to his initial lack of control over the newly discovered ability in his youth. The sole known weakness of the combustion ray is that it is heavily reliant on an uninterrupted flow of chi, as blocking the chi paths in the forehead from where the combustion beam issues forth causes potentially fatal backfires.",
      "links": [
        {
          "body": "Combustion Man",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Combustion_Man",
            "page": "Combustion_Man"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/P%27Li",
            "page": "P%27Li"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Special techniques"
      ],
      "text": "Combustionbending: Combustionbending is an ability employed by Combustion Man and P'Li, which allows the bender to ignite objects with their mind instead of traditional firebending methods. Combustionbenders concentrate the energy through a tattooed third eye to project a ray of heat which detonates with great force, producing situated explosions with a great deal of precision. This technique is extremely effective and very destructive, capable of use at close and long-range; it can completely disintegrate hill-sized boulders and instantaneously evaporate large bodies of water with ease. It can also be employed to burn things without setting an explosion, similar to a lens focusing sunlight. The beam can also be curved, as demonstrated by P'Li. However, the technique has the potential to be just as hazardous to the user as it can be to their surroundings, as Combustion Man blew off his own right arm and leg due to his initial lack of control over the newly discovered ability in his youth. The sole known weakness of the combustion ray is that it is heavily reliant on an uninterrupted flow of chi, as blocking the chi paths in the forehead from where the combustion beam issues forth causes potentially fatal backfires."
    },
    {
      "body": "Dragon fire: When the dragons, ${link_0}, unleashed a vortex of fire, several other colors of fire beyond the usual yellow, orange and blue flames were present, including white, purple, green, pink and red fire. While defending his family during an ambush, Zuko also showed himself capable of creating a fire vortex with hints of green and purple flames.",
      "links": [
        {
          "body": "Ran and Shaw",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ran_and_Shaw",
            "page": "Ran_and_Shaw"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Special techniques"
      ],
      "text": "Dragon fire: When the dragons, Ran and Shaw, unleashed a vortex of fire, several other colors of fire beyond the usual yellow, orange and blue flames were present, including white, purple, green, pink and red fire. While defending his family during an ambush, Zuko also showed himself capable of creating a fire vortex with hints of green and purple flames."
    },
    {
      "body": "Energy reading: In a similar way to ${link_0}, firebenders are capable of using fire to sense ${link_1} paths and interpret spiritual energy. A ${link_2} used this technique to ascertain the cause of Avatar Korra's memory loss, concluding it to be the result of a ${link_3} infecting her.",
      "links": [
        {
          "body": "healing",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Healing",
            "page": "Healing"
          }
        },
        {
          "body": "chi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Chi",
            "page": "Chi"
          }
        },
        {
          "body": "shaman",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Shaman",
            "page": "Shaman"
          }
        },
        {
          "body": "dark spirit",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Special techniques"
      ],
      "text": "Energy reading: In a similar way to healing, firebenders are capable of using fire to sense chi paths and interpret spiritual energy. A shaman used this technique to ascertain the cause of Avatar Korra's memory loss, concluding it to be the result of a dark spirit infecting her."
    },
    {
      "body": "Heat control: Certain advanced firebenders appear to have the ability to control heat. Using this technique, firebenders can heat a wide range of liquids, like water or tea, heat metal to scalding temperatures, or melt ice. Heat direction has also been performed by Fire Lord ${link_0}, heat redirection allows for the absorption of heat from one hand and passing through one's body and out the other hand. It was used to cool down the lava during the eruption that destroyed ${link_1}. It appears to operate on a similar principle to Iroh's redirection of lightning technique.",
      "links": [
        {
          "body": "Sozin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "Roku's island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Roku%27s_island",
            "page": "Roku%27s_island"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Special techniques"
      ],
      "text": "Heat control: Certain advanced firebenders appear to have the ability to control heat. Using this technique, firebenders can heat a wide range of liquids, like water or tea, heat metal to scalding temperatures, or melt ice. Heat direction has also been performed by Fire Lord Sozin, heat redirection allows for the absorption of heat from one hand and passing through one's body and out the other hand. It was used to cool down the lava during the eruption that destroyed Roku's island. It appears to operate on a similar principle to Iroh's redirection of lightning technique."
    },
    {
      "body": "Due to its solar augmentation, firebending is slightly stronger during the day, being at its most powerful around noon. With an extraterrestrial heat source much closer to the planet than the sun, in particular Sozin's Comet, firebending is enhanced dramatically. A firebender under the effects of the comet can produce much larger, powerful flames, which create greater destruction and can extend much further than usual. Experienced firebenders can use the comet's power to sustain flight, generate exceptionally powerful lightning bolts, and perform other feats of firebending which they would usually be incapable of executing.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Enhanced firebending"
      ],
      "text": "Due to its solar augmentation, firebending is slightly stronger during the day, being at its most powerful around noon. With an extraterrestrial heat source much closer to the planet than the sun, in particular Sozin's Comet, firebending is enhanced dramatically. A firebender under the effects of the comet can produce much larger, powerful flames, which create greater destruction and can extend much further than usual. Experienced firebenders can use the comet's power to sustain flight, generate exceptionally powerful lightning bolts, and perform other feats of firebending which they would usually be incapable of executing."
    },
    {
      "body": "Firebending is the opposing art to ${link_0}, though they share facets of self-control, diversity, and variation in strength due to external forces and strong emotions. Firebenders use quick strong punches and kicks to shoot fire, while waterbenders use smooth movements and elegant turns and spins to return the momentum of the opponents' attacks. Firebenders attack first, while waterbenders wait and turn their target's attacks against them. However, in 170 AG these differences are no longer as strong as in the centuries before. Many waterbenders of the United Republic of Nations, a new-founded country of the world, have adapted a fighting style which is based primarily on sheer strength and speed. For example, criminals, task force members, and even ${link_1} ${link_2} tried to defeat their opponents with surprising, aggressive first strikes, a tactic typical of firebenders. However, this new fighting style is restricted mainly to the waterbenders of the republic.",
      "links": [
        {
          "body": "waterbending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Councilman",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Tarrlok",
            "page": "Tarrlok"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Opposing bending art"
      ],
      "text": "Firebending is the opposing art to waterbending, though they share facets of self-control, diversity, and variation in strength due to external forces and strong emotions. Firebenders use quick strong punches and kicks to shoot fire, while waterbenders use smooth movements and elegant turns and spins to return the momentum of the opponents' attacks. Firebenders attack first, while waterbenders wait and turn their target's attacks against them. However, in 170 AG these differences are no longer as strong as in the centuries before. Many waterbenders of the United Republic of Nations, a new-founded country of the world, have adapted a fighting style which is based primarily on sheer strength and speed. For example, criminals, task force members, and even Councilman Tarrlok tried to defeat their opponents with surprising, aggressive first strikes, a tactic typical of firebenders. However, this new fighting style is restricted mainly to the waterbenders of the republic."
    },
    {
      "body": "The two bending arts are also opposed by their celestial power source; firebending is fueled by the sun, waterbending by the moon. This is best demonstrated during a duel fought between Zuko and Katara; at night, during the full moon, Katara quickly battered Zuko into submission and froze him against a wall; however, at sunrise, Zuko effortlessly melted the ice holding him in place and defeated Katara with several short fire blasts.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Opposing bending art"
      ],
      "text": "The two bending arts are also opposed by their celestial power source; firebending is fueled by the sun, waterbending by the moon. This is best demonstrated during a duel fought between Zuko and Katara; at night, during the full moon, Katara quickly battered Zuko into submission and froze him against a wall; however, at sunrise, Zuko effortlessly melted the ice holding him in place and defeated Katara with several short fire blasts."
    },
    {
      "body": "Like all bending arts, firebending is balanced out as to not be more or less powerful than the other arts. It has repeatedly been illustrated that it is the skill and prowess of the user that determines victory.",
      "links": [],
      "section": [
        "Firebending",
        "Fighting style",
        "Opposing bending art"
      ],
      "text": "Like all bending arts, firebending is balanced out as to not be more or less powerful than the other arts. It has repeatedly been illustrated that it is the skill and prowess of the user that determines victory."
    },
    {
      "body": "Firebenders sometimes incorporate weapons into firebending, such as Zuko's utilization of firebending in conjunction with his ${link_0}, shaping and channeling the flames down the blade of his weapons.",
      "links": [
        {
          "body": "dual broadswords",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dual_broadswords",
            "page": "Dual_broadswords"
          }
        }
      ],
      "section": [
        "Firebending",
        "Fighting style",
        "Weapons"
      ],
      "text": "Firebenders sometimes incorporate weapons into firebending, such as Zuko's utilization of firebending in conjunction with his dual broadswords, shaping and channeling the flames down the blade of his weapons."
    },
    {
      "body": "Certain powerful firebenders are able to generate and manipulate lightning by separating the yin and yang energies. Lightning, also known as \"the cold-blooded fire\", is considered the most powerful firebending technique, and its use was initially available only to a select few firebending prodigies and masters. However, seventy years later, the art has evolved to a well-known skill and is known by enough people to make lightning generation a decently-paid job at a ${link_0} in ${link_1}.",
      "links": [
        {
          "body": "power plant",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_power_plant",
            "page": "Republic_City_power_plant"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "section": [
        "Firebending",
        "Lightningbending"
      ],
      "text": "Certain powerful firebenders are able to generate and manipulate lightning by separating the yin and yang energies. Lightning, also known as \"the cold-blooded fire\", is considered the most powerful firebending technique, and its use was initially available only to a select few firebending prodigies and masters. However, seventy years later, the art has evolved to a well-known skill and is known by enough people to make lightning generation a decently-paid job at a power plant in Republic City."
    },
    {
      "body": "Some experienced firebenders are unable to generate lightning because they do not possess inner peace. If a firebender who harbors inner turmoil tries to generate lightning, it would only cause a miniature explosion. For example, Zuko was unable to because of his inner conflict with both his father, Fire Lord Ozai, and his sister, Azula.",
      "links": [],
      "section": [
        "Firebending",
        "Lightningbending"
      ],
      "text": "Some experienced firebenders are unable to generate lightning because they do not possess inner peace. If a firebender who harbors inner turmoil tries to generate lightning, it would only cause a miniature explosion. For example, Zuko was unable to because of his inner conflict with both his father, Fire Lord Ozai, and his sister, Azula."
    },
    {
      "body": "${link_0}: Lightning generation is the ability to generate and direct lightning. It requires peace of mind and a complete absence of emotion. So far, only six named firebenders have demonstrated themselves as capable of this art: Iroh, Ozai, Azula, Mako, ${link_1}, and Zuko's grandson, ${link_2} ${link_3}. During Korra's lifetime, many other firebenders demonstrated the ability to generate lightning, particularly in creating energy for Republic City's power plant.",
      "links": [
        {
          "body": "Lightning generation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "Lightning Bolt Zolt",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lightning_Bolt_Zolt",
            "page": "Lightning_Bolt_Zolt"
          }
        },
        {
          "body": "General",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#General_3",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh_(United_Forces_general)",
            "page": "Iroh_(United_Forces_general)"
          }
        }
      ],
      "section": [
        "Firebending",
        "Lightningbending"
      ],
      "text": "Lightning generation: Lightning generation is the ability to generate and direct lightning. It requires peace of mind and a complete absence of emotion. So far, only six named firebenders have demonstrated themselves as capable of this art: Iroh, Ozai, Azula, Mako, Lightning Bolt Zolt, and Zuko's grandson, General Iroh. During Korra's lifetime, many other firebenders demonstrated the ability to generate lightning, particularly in creating energy for Republic City's power plant."
    },
    {
      "body": "${link_0}: After observing the redirecting techniques of waterbending, Iroh developed a technique to redirect the course of lightning strikes by absorbing it through one arm, guiding it through the stomach, and out the other arm. Only Iroh, Zuko, Aang, Azula, and Mako have demonstrated the ability to redirect lightning.",
      "links": [
        {
          "body": "Lightning redirection",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "section": [
        "Firebending",
        "Lightningbending"
      ],
      "text": "Lightning redirection: After observing the redirecting techniques of waterbending, Iroh developed a technique to redirect the course of lightning strikes by absorbing it through one arm, guiding it through the stomach, and out the other arm. Only Iroh, Zuko, Aang, Azula, and Mako have demonstrated the ability to redirect lightning."
    },
    {
      "body": "Equator: A firebender's power is at its maximum potential nearest to the equator. This effect increases significantly during the summer.",
      "links": [],
      "section": [
        "Firebending",
        "Strengths"
      ],
      "text": "Equator: A firebender's power is at its maximum potential nearest to the equator. This effect increases significantly during the summer."
    },
    {
      "body": "Warm climate: A firebender is much stronger and controlled whenever he or she can draw energy from heat. The climate conditions of a battleground can turn the tides of the fight in a firebender's favor, if the weather is hot enough.",
      "links": [],
      "section": [
        "Firebending",
        "Strengths"
      ],
      "text": "Warm climate: A firebender is much stronger and controlled whenever he or she can draw energy from heat. The climate conditions of a battleground can turn the tides of the fight in a firebender's favor, if the weather is hot enough."
    },
    {
      "body": "Extreme cold: Cold temperatures reduce a firebender's abilities; the prison on the Boiling Rock used insulated chambers, the coolers, and piped in cold air as a punishment for those prisoners who used firebending. While in disguise, ${link_0} was told by a guard that ${link_1} \"won't be firebending in there\". However, this can be overcome, as Zuko used his breath of fire to stay warm while he detached the cooler as part of Sokka's escape plan. The same principle was used to detain ${link_2} in the depths of the icy tundra of the ${link_3}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Chit Sang",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Chit_Sang",
            "page": "Chit_Sang"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/P%27Li",
            "page": "P%27Li"
          }
        },
        {
          "body": "North Pole",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/North_Pole",
            "page": "North_Pole"
          }
        }
      ],
      "section": [
        "Firebending",
        "Weaknesses"
      ],
      "text": "Extreme cold: Cold temperatures reduce a firebender's abilities; the prison on the Boiling Rock used insulated chambers, the coolers, and piped in cold air as a punishment for those prisoners who used firebending. While in disguise, Sokka was told by a guard that Chit Sang \"won't be firebending in there\". However, this can be overcome, as Zuko used his breath of fire to stay warm while he detached the cooler as part of Sokka's escape plan. The same principle was used to detain P'Li in the depths of the icy tundra of the North Pole."
    },
    {
      "body": "Full moon: With waterbending becoming stronger with it and firebending being water's opposite element, the full moon weakens firebending to some degree.",
      "links": [],
      "section": [
        "Firebending",
        "Weaknesses"
      ],
      "text": "Full moon: With waterbending becoming stronger with it and firebending being water's opposite element, the full moon weakens firebending to some degree."
    },
    {
      "body": "Lack of defense: The major combat weakness behind the applied art of firebending is its confrontational nature. Due to its aggressiveness and pursuit of continuous assault, it traditionally lacks basic defensive techniques, which can leave an inexperienced bender considerably vulnerable to enemy counterattacks, though masters such as Jeong Jeong can effectively use firebending for defense. It also consumes a vast amount of energy leaving the bender at a considerable disadvantage in a prolonged battle. A common mark of a firebending master is the ability to sustain attacks for long periods.",
      "links": [],
      "section": [
        "Firebending",
        "Weaknesses"
      ],
      "text": "Lack of defense: The major combat weakness behind the applied art of firebending is its confrontational nature. Due to its aggressiveness and pursuit of continuous assault, it traditionally lacks basic defensive techniques, which can leave an inexperienced bender considerably vulnerable to enemy counterattacks, though masters such as Jeong Jeong can effectively use firebending for defense. It also consumes a vast amount of energy leaving the bender at a considerable disadvantage in a prolonged battle. A common mark of a firebending master is the ability to sustain attacks for long periods."
    },
    {
      "body": "Lack of drive: In order to firebend properly, one must have \"inner fire\", his or her drive, without which one's firebending becomes weak. After joining the Avatar, Zuko's firebending became noticeably weaker, because for three years, hunting the Avatar was his drive. Aang, being traumatized by his first experience with firebending, was too afraid to \"give it some juice\", as said by Zuko. Both overcame their problems after meeting with the masters Ran and Shaw, who taught them the true meaning of firebending, restoring their drives.",
      "links": [],
      "section": [
        "Firebending",
        "Weaknesses"
      ],
      "text": "Lack of drive: In order to firebend properly, one must have \"inner fire\", his or her drive, without which one's firebending becomes weak. After joining the Avatar, Zuko's firebending became noticeably weaker, because for three years, hunting the Avatar was his drive. Aang, being traumatized by his first experience with firebending, was too afraid to \"give it some juice\", as said by Zuko. Both overcame their problems after meeting with the masters Ran and Shaw, who taught them the true meaning of firebending, restoring their drives."
    },
    {
      "body": "Other circumstances: A firebender's power may decrease in any situation which might extinguish their flames, such as being underwater or caught in the rain. Zuko overcame this while underwater in the North Pole by melting ice by heating it with direct contact.",
      "links": [],
      "section": [
        "Firebending",
        "Weaknesses"
      ],
      "text": "Other circumstances: A firebender's power may decrease in any situation which might extinguish their flames, such as being underwater or caught in the rain. Zuko overcame this while underwater in the North Pole by melting ice by heating it with direct contact."
    },
    {
      "body": "Poor breath control: According to Iroh, true firebending power comes not from physical size or strength, but rather from the very control of one's breath. This was first explained and demonstrated by Iroh, an overweight, squat man with no exceptional strength or physique; however, this did not stop him from being one of the most powerful firebenders in the world. Firebender discipline stresses self-restraint and breath control as a means of directing and containing the fire manifested. Poor breath control means dangerously poor control of any fire generated. For this reason, breathing exercises are one of the most critical first steps for beginning firebenders.",
      "links": [],
      "section": [
        "Firebending",
        "Weaknesses"
      ],
      "text": "Poor breath control: According to Iroh, true firebending power comes not from physical size or strength, but rather from the very control of one's breath. This was first explained and demonstrated by Iroh, an overweight, squat man with no exceptional strength or physique; however, this did not stop him from being one of the most powerful firebenders in the world. Firebender discipline stresses self-restraint and breath control as a means of directing and containing the fire manifested. Poor breath control means dangerously poor control of any fire generated. For this reason, breathing exercises are one of the most critical first steps for beginning firebenders."
    },
    {
      "body": "Poor self-control: Though anger, rage and other intense emotions can amplify the power of firebending, it can lead to dangerous explosions or wildfires and can also cause any nearby flames to burn out of control. The enlightened firebending master Jeong Jeong repeatedly stressed this importance during his instruction of Aang, who accidentally burned Katara when he refused to listen, and a lack of self-control was demonstrated by Zhao during his fight with Aang.",
      "links": [],
      "section": [
        "Firebending",
        "Weaknesses"
      ],
      "text": "Poor self-control: Though anger, rage and other intense emotions can amplify the power of firebending, it can lead to dangerous explosions or wildfires and can also cause any nearby flames to burn out of control. The enlightened firebending master Jeong Jeong repeatedly stressed this importance during his instruction of Aang, who accidentally burned Katara when he refused to listen, and a lack of self-control was demonstrated by Zhao during his fight with Aang."
    },
    {
      "body": "${link_0}: Firebending's connection to the sun results in a lessening of strength during the night and a complete loss of firebending during a solar eclipse.",
      "links": [
        {
          "body": "Solar eclipse",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        }
      ],
      "section": [
        "Firebending",
        "Weaknesses"
      ],
      "text": "Solar eclipse: Firebending's connection to the sun results in a lessening of strength during the night and a complete loss of firebending during a solar eclipse."
    },
    {
      "body": "The symbol for fire and firebending is a stylized, tulip-shaped flame forked into three tongues that curve outward like flower petals, with a counter-clockwise spiral at the base. The symbol is featured in connection with ${link_0} spirituality.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "section": [
        "Firebending",
        "Elemental symbol"
      ],
      "text": "The symbol for fire and firebending is a stylized, tulip-shaped flame forked into three tongues that curve outward like flower petals, with a counter-clockwise spiral at the base. The symbol is featured in connection with Fire Nation spirituality."
    },
    {
      "body": "In 0 ${link_0}, Fire Lord Sozin launched a ${link_1} on the ${link_2}, succeeding in part due to the power granted him by a passing comet. Over the course of a century, the war continued, and under the rule of Sozin's grandson, Fire Lord Ozai, the Fire Nation saw the return of \"Sozin's Comet\". As prophesied, the comet's immense energy granted Ozai the power to conquer the entire world. The only threat to Ozai's campaign was the Avatar, Aang. Aang succeeded in his quest to defeat Ozai, and he satisfied his spiritual needs by not taking Ozai's life but simply by removing his ability to firebend.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#War_years_.280_.E2.80.93_100_AG.29",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "genocidal attack",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "section": [
        "Firebending",
        "Spirituality and firebending"
      ],
      "text": "In 0 AG, Fire Lord Sozin launched a genocidal attack on the Air Nomads, succeeding in part due to the power granted him by a passing comet. Over the course of a century, the war continued, and under the rule of Sozin's grandson, Fire Lord Ozai, the Fire Nation saw the return of \"Sozin's Comet\". As prophesied, the comet's immense energy granted Ozai the power to conquer the entire world. The only threat to Ozai's campaign was the Avatar, Aang. Aang succeeded in his quest to defeat Ozai, and he satisfied his spiritual needs by not taking Ozai's life but simply by removing his ability to firebend."
    },
    {
      "body": "The Fire Nation's religious clerics, the ${link_0}, once served the Avatar, but they were eventually forced to endorse the imperial war. ${link_1} was the only Fire Sage to remain true to his allegiance to the Avatar, a trait he inherited from his father and grandfather.",
      "links": [
        {
          "body": "Fire Sages",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Shyu",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Shyu",
            "page": "Shyu"
          }
        }
      ],
      "section": [
        "Firebending",
        "Spirituality and firebending"
      ],
      "text": "The Fire Nation's religious clerics, the Fire Sages, once served the Avatar, but they were eventually forced to endorse the imperial war. Shyu was the only Fire Sage to remain true to his allegiance to the Avatar, a trait he inherited from his father and grandfather."
    },
    {
      "body": "A firebender's powers seem to increase during the day in the presence of the sun. Because of this solar sympathy, their powers are weakened at night and a solar eclipse can temporarily negate their powers entirely, much like waterbenders' powers are negated during a lunar eclipse. Aside from their main power source, the sun, firebenders also draw their energy from other heat sources, including volcanic activity, lightning, and passing comets, if they somehow become a heat source, such as Sozin's Comet, which ignites when it brushes the atmosphere. A firebender's power is intensified in warmer climates and is at its peak when situated near their native equatorial homelands during the summer.",
      "links": [],
      "section": [
        "Firebending",
        "Spirituality and firebending"
      ],
      "text": "A firebender's powers seem to increase during the day in the presence of the sun. Because of this solar sympathy, their powers are weakened at night and a solar eclipse can temporarily negate their powers entirely, much like waterbenders' powers are negated during a lunar eclipse. Aside from their main power source, the sun, firebenders also draw their energy from other heat sources, including volcanic activity, lightning, and passing comets, if they somehow become a heat source, such as Sozin's Comet, which ignites when it brushes the atmosphere. A firebender's power is intensified in warmer climates and is at its peak when situated near their native equatorial homelands during the summer."
    },
    {
      "body": "Firebending's distinctiveness is in its uncontrolled nature; fire, if left to itself, will consume everything it can. Firebending is thus a matter of controlling an element rather than directing it. Many firebenders are intoxicated by their power, while more prudent ones feel cursed by it, much like Jeong Jeong. However, its roots and nature are fully explored by Ran and Shaw and the Sun Warriors; properly controlled, fire is life and industry, comforting and creative.",
      "links": [],
      "section": [
        "Firebending",
        "Spirituality and firebending"
      ],
      "text": "Firebending's distinctiveness is in its uncontrolled nature; fire, if left to itself, will consume everything it can. Firebending is thus a matter of controlling an element rather than directing it. Many firebenders are intoxicated by their power, while more prudent ones feel cursed by it, much like Jeong Jeong. However, its roots and nature are fully explored by Ran and Shaw and the Sun Warriors; properly controlled, fire is life and industry, comforting and creative."
    },
    {
      "body": "Among firebenders, or at least those of the upper-class, disputes of honor are settled by a challenge to an Agni Kai, or \"fire duel\", a traditional firebender duel that is centuries old. Such a duel is conducted in an open-air arena, and it may be witnessed by spectators. The traditional time for an Agni Kai is sunset or sunrise, although it is not a requirement. While not an explicit condition, in the post-Sozin Fire Nation, Agni Kai have become almost exclusively duels to the death. The victor may spare the defeated, but it is generally looked upon as an act of weakness rather than generosity. The duel is traditionally fought bare-chested and the contestants may have one or more \"seconds\", i.e. people who stand around in that person's corner of the field and may attend to their champion before and after the duel, or bear them away in case they die fighting. The opening pose of an Agni Kai is squatting with back turned to the opponent. During this phase, both contestants traditionally wear a red-and-black shawl over their bare shoulders, which is dropped upon turning to face each other. It is considered dishonorable to attack from behind in an Agni Kai, especially for a defeated opponent who has been spared by the victor. Notable Agni Kais include Zuko's first public Agni Kai, against his father, the Agni Kai between Zuko and Zhao, and most notably the Comet-Enhanced Agni Kai between Zuko and Azula, which was fought for the right to the throne.",
      "links": [],
      "section": [
        "Firebending",
        "Agni Kai"
      ],
      "text": "Among firebenders, or at least those of the upper-class, disputes of honor are settled by a challenge to an Agni Kai, or \"fire duel\", a traditional firebender duel that is centuries old. Such a duel is conducted in an open-air arena, and it may be witnessed by spectators. The traditional time for an Agni Kai is sunset or sunrise, although it is not a requirement. While not an explicit condition, in the post-Sozin Fire Nation, Agni Kai have become almost exclusively duels to the death. The victor may spare the defeated, but it is generally looked upon as an act of weakness rather than generosity. The duel is traditionally fought bare-chested and the contestants may have one or more \"seconds\", i.e. people who stand around in that person's corner of the field and may attend to their champion before and after the duel, or bear them away in case they die fighting. The opening pose of an Agni Kai is squatting with back turned to the opponent. During this phase, both contestants traditionally wear a red-and-black shawl over their bare shoulders, which is dropped upon turning to face each other. It is considered dishonorable to attack from behind in an Agni Kai, especially for a defeated opponent who has been spared by the victor. Notable Agni Kais include Zuko's first public Agni Kai, against his father, the Agni Kai between Zuko and Zhao, and most notably the Comet-Enhanced Agni Kai between Zuko and Azula, which was fought for the right to the throne."
    },
    {
      "body": "When giving his input on firebenders in the ${link_0}, ${link_1} said that he made the choice to have the firebenders in the film only be able to control pre-existing fire to avoid them being \"overpowered\". However, this puts firebenders at a great disadvantage when in the Northern Water Tribe. It would also make an Agni Kai quite difficult.",
      "links": [
        {
          "body": "film",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Film_The_Last_Airbender",
            "page": "Film_The_Last_Airbender"
          }
        },
        {
          "body": "M. Night Shyamalan",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Film_M",
            "page": "Film_M"
          }
        }
      ],
      "section": [
        "Firebending",
        "The Last Airbender"
      ],
      "text": "When giving his input on firebenders in the film, M. Night Shyamalan said that he made the choice to have the firebenders in the film only be able to control pre-existing fire to avoid them being \"overpowered\". However, this puts firebenders at a great disadvantage when in the Northern Water Tribe. It would also make an Agni Kai quite difficult."
    },
    {
      "body": "It was stated at the end of the film that the power of Sozin's Comet is required for all firebenders to be able to generate fire \"from their own chi\", just like the \"Highest of firebenders\", like ${link_0} was in the movie. Thus, when the Fire Nation begins invading a city or town, they bombard it with fire balls so as to set fires and give their firebenders a source. Only the most skilled firebenders have the ability to create fire from nothing but their own chi; they also show the ability to be unharmed by fire.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Film_Iroh",
            "page": "Film_Iroh"
          }
        }
      ],
      "section": [
        "Firebending",
        "The Last Airbender"
      ],
      "text": "It was stated at the end of the film that the power of Sozin's Comet is required for all firebenders to be able to generate fire \"from their own chi\", just like the \"Highest of firebenders\", like Iroh was in the movie. Thus, when the Fire Nation begins invading a city or town, they bombard it with fire balls so as to set fires and give their firebenders a source. Only the most skilled firebenders have the ability to create fire from nothing but their own chi; they also show the ability to be unharmed by fire."
    },
    {
      "body": "Firebending moves are based mainly on the Northern Shaolin style of kung fu. Aspects of the firebending combat style can be seen through the similar emphasis on highly technical kicking strikes, fundamentally strong movements, and the usage of swift, direct maneuvers. Northern Shaolin is an external style that uses long, aggressive techniques that explode and drive through the opponent.",
      "links": [],
      "section": [
        "Firebending",
        "Connection"
      ],
      "text": "Firebending moves are based mainly on the Northern Shaolin style of kung fu. Aspects of the firebending combat style can be seen through the similar emphasis on highly technical kicking strikes, fundamentally strong movements, and the usage of swift, direct maneuvers. Northern Shaolin is an external style that uses long, aggressive techniques that explode and drive through the opponent."
    },
    {
      "body": "The Northern Shaolin style emphasizes \"kicking over hand fighting\", or prioritizing one's legwork as opposed to the arms. Kicks are meant to \"extend as far as possible without compromising balance. A few techniques from Northern Seven Star Praying Mantis are also prominent. These martial art variants feature quick, successive attacks that utilize momentary bursts of extreme power, much like an explosion, called ging lik. It optimizes a strong continuous offense, sacrificing defense for greater power, the principle behind a pre-emptive strike, and as such, firebending is categorized as the most aggressive of the four bending arts.",
      "links": [],
      "section": [
        "Firebending",
        "Connection"
      ],
      "text": "The Northern Shaolin style emphasizes \"kicking over hand fighting\", or prioritizing one's legwork as opposed to the arms. Kicks are meant to \"extend as far as possible without compromising balance. A few techniques from Northern Seven Star Praying Mantis are also prominent. These martial art variants feature quick, successive attacks that utilize momentary bursts of extreme power, much like an explosion, called ging lik. It optimizes a strong continuous offense, sacrificing defense for greater power, the principle behind a pre-emptive strike, and as such, firebending is categorized as the most aggressive of the four bending arts."
    },
    {
      "body": "Close quarters firebending and distanced firebending combat use completely different styles of the bending art. Particular examples of such styles include:",
      "links": [],
      "section": [
        "Firebending",
        "Connection"
      ],
      "text": "Close quarters firebending and distanced firebending combat use completely different styles of the bending art. Particular examples of such styles include:"
    },
    {
      "body": "Chaquan – A fighting style that involves acrobatics and agile, graceful movements, it emphasizes long range movements and stances combined with speed and power.",
      "links": [],
      "section": [
        "Firebending",
        "Connection"
      ],
      "text": "Chaquan – A fighting style that involves acrobatics and agile, graceful movements, it emphasizes long range movements and stances combined with speed and power."
    },
    {
      "body": "Northern Shaolin Kung Fu – used particularly in close-ranges, utilizing strong kicks and quick punches.",
      "links": [],
      "section": [
        "Firebending",
        "Connection"
      ],
      "text": "Northern Shaolin Kung Fu – used particularly in close-ranges, utilizing strong kicks and quick punches."
    },
    {
      "body": "Southern Dragon Claw – mirrors a dragon \"swooping down on its prey\". The form contains close-range techniques for \"seizing and holding that utilize the hand.\"",
      "links": [],
      "section": [
        "Firebending",
        "Connection"
      ],
      "text": "Southern Dragon Claw – mirrors a dragon \"swooping down on its prey\". The form contains close-range techniques for \"seizing and holding that utilize the hand.\""
    },
    {
      "body": "Xingyiquan – The classic \"Seven Stars\"; or the hands, feet, elbows, hips, knees, shoulders, and head; are incorporated into most firebending.",
      "links": [],
      "section": [
        "Firebending",
        "Connection"
      ],
      "text": "Xingyiquan – The classic \"Seven Stars\"; or the hands, feet, elbows, hips, knees, shoulders, and head; are incorporated into most firebending."
    },
    {
      "body": "Based on the Chinese text of Jeong Jeong's wanted poster, the word \"firebending\" is written as 制火術, which is directly translated as \"the technique of creating fire\".",
      "links": [],
      "section": [
        "Firebending",
        "Trivia"
      ],
      "text": "Based on the Chinese text of Jeong Jeong's wanted poster, the word \"firebending\" is written as 制火術, which is directly translated as \"the technique of creating fire\"."
    },
    {
      "body": "Iroh, Azula, and Mako are the only known characters with the ability to both generate and redirect lightning.\n Lightning Bolt Zolt also had this ability, teaching Mako how to do both acts, before he lost his bending to ${link_0}.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        }
      ],
      "section": [
        "Firebending",
        "Trivia"
      ],
      "text": "Iroh, Azula, and Mako are the only known characters with the ability to both generate and redirect lightning.\n Lightning Bolt Zolt also had this ability, teaching Mako how to do both acts, before he lost his bending to Amon."
    },
    {
      "body": "Lightning Bolt Zolt also had this ability, teaching Mako how to do both acts, before he lost his bending to ${link_0}.",
      "links": [],
      "section": [
        "Firebending",
        "Trivia"
      ],
      "text": "Lightning Bolt Zolt also had this ability, teaching Mako how to do both acts, before he lost his bending to ${link_0}."
    },
    {
      "body": "The firebending salute is meant to look like a flame.",
      "links": [],
      "section": [
        "Firebending",
        "Trivia"
      ],
      "text": "The firebending salute is meant to look like a flame."
    },
    {
      "body": "Even after the Hundred Year War, firebenders have a reputation of violence, as ${link_0}, Mako, ${link_1}, and ${link_2} have lost a family member at the hands of a firebender. Amon was able to use this fact as a way of gaining trust from ${link_3}'s nonbenders, claiming that a firebender had killed his family.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Hiroshi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Asami Sato",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "section": [
        "Firebending",
        "Trivia"
      ],
      "text": "Even after the Hundred Year War, firebenders have a reputation of violence, as Bolin, Mako, Hiroshi, and Asami Sato have lost a family member at the hands of a firebender. Amon was able to use this fact as a way of gaining trust from Republic City's nonbenders, claiming that a firebender had killed his family."
    },
    {
      "body": "Zuko's fire daggers are inspired by the Bak Sil Lum double dagger form.",
      "links": [],
      "section": [
        "Firebending",
        "Trivia"
      ],
      "text": "Zuko's fire daggers are inspired by the Bak Sil Lum double dagger form."
    },
    {
      "body": "Firebending was the first bending art mastered by the first Avatar, Wan.",
      "links": [],
      "section": [
        "Firebending",
        "Trivia"
      ],
      "text": "Firebending was the first bending art mastered by the first Avatar, Wan."
    },
    {
      "body": "${link_0} was initially stated to be a combination of firebending and ${link_1} that only Avatars could perform. However, in ${link_2}, it was shown to solely be a subskill of earthbending.",
      "links": [
        {
          "body": "Lavabending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lavabending",
            "page": "Lavabending"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "The Legend of Korra",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/The_Legend_of_Korra",
            "page": "The_Legend_of_Korra"
          }
        }
      ],
      "section": [
        "Firebending",
        "Trivia"
      ],
      "text": "Lavabending was initially stated to be a combination of firebending and earthbending that only Avatars could perform. However, in The Legend of Korra, it was shown to solely be a subskill of earthbending."
    },
    {
      "body": "There are a variety of real-world influences on firebending, including:",
      "links": [],
      "section": [
        "Firebending",
        "External links"
      ],
      "text": "There are a variety of real-world influences on firebending, including:"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Northern Shaolin style",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Northern_Shaolin_(martial_art)",
            "page": "http://en.wikipedia.org/wiki/Northern_Shaolin_(martial_art)"
          }
        }
      ],
      "section": [
        "Firebending",
        "External links"
      ],
      "text": "Northern Shaolin style"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Southern Dragon Claw",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Southern_Dragon_Kung_Fu",
            "page": "http://en.wikipedia.org/wiki/Southern_Dragon_Kung_Fu"
          }
        }
      ],
      "section": [
        "Firebending",
        "External links"
      ],
      "text": "Southern Dragon Claw"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Xingyiquan",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Xingyiquan",
            "page": "http://en.wikipedia.org/wiki/Xingyiquan"
          }
        }
      ],
      "section": [
        "Firebending",
        "External links"
      ],
      "text": "Xingyiquan"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Firebending",
    "file": "avatar.wikia.com/wiki/Firebending.html",
    "page": "Firebending",
    "title": "Firebending"
  }
}