{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Fashion",
      "target": {
        "href": "Category_Fashion",
        "page": "Category_Fashion"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "href": "Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Objects",
      "target": {
        "href": "Category_Objects",
        "page": "Category_Objects"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The ${link_0}'s headpiece features five prongs and bears a similarity to the ${link_1} emblem.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "The Fire Lord's headpiece features five prongs and bears a similarity to the Fire Nation emblem."
    },
    {
      "body": "The Fire Lord's headpiece is an ancient royal artifact of the ${link_0}, meant to be worn by the ${link_1}, the absolute ruler of the nation. The headpiece is shaped like the Fire Nation insignia, except it possesses two additional prongs to make it appear like a crown. It is worn in a ${link_2}.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "top-knot",
          "key": "${link_2}",
          "target": {
            "href": "Top-knot",
            "page": "Top-knot"
          }
        }
      ],
      "text": "The Fire Lord's headpiece is an ancient royal artifact of the Fire Nation, meant to be worn by the Fire Lord, the absolute ruler of the nation. The headpiece is shaped like the Fire Nation insignia, except it possesses two additional prongs to make it appear like a crown. It is worn in a top-knot."
    },
    {
      "body": "The royal headpiece had been passed down for many generations from one Fire Lord to the next. The ${link_0} initiate the crowning ceremony right after the burial of the deceased Fire Lord. The crown had been worn by at least seven Fire Lords: Sozin's grandfather, Sozin's father, ${link_1}, ${link_2}, ${link_3}, ${link_4}, and ${link_5}.",
      "links": [
        {
          "body": "Fire Sages",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_1}",
          "target": {
            "href": "Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "Azulon",
          "key": "${link_2}",
          "target": {
            "href": "Azulon",
            "page": "Azulon"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_3}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_4}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Izumi",
          "key": "${link_5}",
          "target": {
            "href": "Izumi",
            "page": "Izumi"
          }
        }
      ],
      "text": "The royal headpiece had been passed down for many generations from one Fire Lord to the next. The Fire Sages initiate the crowning ceremony right after the burial of the deceased Fire Lord. The crown had been worn by at least seven Fire Lords: Sozin's grandfather, Sozin's father, Sozin, Azulon, Ozai, Zuko, and Izumi."
    },
    {
      "body": "The crown, being the largest and most ornamental of all known headpieces worn in the Fire Nation, was well-recognized by the citizens as a symbol of the head of their country. After Fire Lord Sozin began the ${link_0} and ruled his nation with an \"iron fist\", the crown consequentially became a symbol of the tyrannical ambitions of the Fire Nation and the dictatorship of its ruler as well. Because the title of Fire Lord was usually held by the most powerful ${link_1} in ${link_2}, the crown also acted as a signifier for the greatest firebending master, instilling fear in some.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "firebender",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "the world",
          "key": "${link_2}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "The crown, being the largest and most ornamental of all known headpieces worn in the Fire Nation, was well-recognized by the citizens as a symbol of the head of their country. After Fire Lord Sozin began the Hundred Year War and ruled his nation with an \"iron fist\", the crown consequentially became a symbol of the tyrannical ambitions of the Fire Nation and the dictatorship of its ruler as well. Because the title of Fire Lord was usually held by the most powerful firebender in the world, the crown also acted as a signifier for the greatest firebending master, instilling fear in some."
    },
    {
      "body": "Fire Lord Sozin wore the crown during his long reign, as did his son, Fire Lord Azulon. Though Azulon's firstborn son, ${link_0} ${link_1}, was supposed to assume the throne after him, second-born Prince Ozai usurped the crown after his father's mysterious death. Ozai wore the crown for the six short years he held the title of Fire Lord until the arrival of ${link_2}. He took off the crown and was never to wear it again after assuming the title of ${link_3} for himself, the ruler of the entire world. Ozai intended for his daughter, Princess ${link_4}, to become the new Fire Lord in his place, and she was nearly crowned as such until the arrival of Prince Zuko. The two siblings ${link_5} for ownership of the crown and the title of Fire Lord, ending with Zuko as the victor. After Phoenix King Ozai was defeated by ${link_6} ${link_7}, Zuko was crowned the new Fire Lord and put an end to Sozin's war. Sometime later, Zuko was in the ${link_8}, wearing traditional Earth Kingdom clothing and not wearing the crown. After Zuko stepped down as Fire Lord, the crown passed to his daughter and successor, Izumi.",
      "links": [
        {
          "body": "Prince",
          "key": "${link_0}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_2}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Phoenix King",
          "key": "${link_3}",
          "target": {
            "href": "Phoenix_King",
            "page": "Phoenix_King"
          }
        },
        {
          "body": "Azula",
          "key": "${link_4}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "battled",
          "key": "${link_5}",
          "target": {
            "href": "Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_6}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_7}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Jasmine Dragon",
          "key": "${link_8}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "text": "Fire Lord Sozin wore the crown during his long reign, as did his son, Fire Lord Azulon. Though Azulon's firstborn son, Prince Iroh, was supposed to assume the throne after him, second-born Prince Ozai usurped the crown after his father's mysterious death. Ozai wore the crown for the six short years he held the title of Fire Lord until the arrival of Sozin's Comet. He took off the crown and was never to wear it again after assuming the title of Phoenix King for himself, the ruler of the entire world. Ozai intended for his daughter, Princess Azula, to become the new Fire Lord in his place, and she was nearly crowned as such until the arrival of Prince Zuko. The two siblings battled for ownership of the crown and the title of Fire Lord, ending with Zuko as the victor. After Phoenix King Ozai was defeated by Avatar Aang, Zuko was crowned the new Fire Lord and put an end to Sozin's war. Sometime later, Zuko was in the Jasmine Dragon, wearing traditional Earth Kingdom clothing and not wearing the crown. After Zuko stepped down as Fire Lord, the crown passed to his daughter and successor, Izumi."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Fire_Lord_headpiece",
    "file": "avatar.wikia.com/wiki/Fire_Lord_headpiece.html",
    "page": "Fire_Lord_headpiece",
    "title": "Fire Lord headpiece"
  }
}