{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "href": "Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Fire Nation",
              "key": "${link_0}",
              "target": {
                "href": "Fire_Nation",
                "page": "Fire_Nation"
              }
            }
          ],
          "text": "Fire Nation",
          "value": "${link_0}",
          "value_text": "Fire Nation"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "The Search Part Two",
              "key": "${link_0}",
              "target": {
                "href": "The_Search_Part_Two",
                "page": "The_Search_Part_Two"
              }
            }
          ],
          "text": "The Search Part Two",
          "value": "${link_0}",
          "value_text": "The Search Part Two"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The Forgetful Valley is a forest that is connected to the ${link_0}. It is known to the villagers of ${link_1} that the heartbroken go there to forget their lives. It is considered very dangerous and few ever attempt to enter it.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Hira'a",
          "key": "${link_1}",
          "target": {
            "href": "Hira%27a",
            "page": "Hira%27a"
          }
        }
      ],
      "text": "The Forgetful Valley is a forest that is connected to the Spirit World. It is known to the villagers of Hira'a that the heartbroken go there to forget their lives. It is considered very dangerous and few ever attempt to enter it."
    },
    {
      "body": "When his beloved ${link_0} left Hira'a to marry Fire Prince ${link_1}, ${link_2}, in his despair, departed to Forgetful Valley. Eventually, he encountered the ${link_3}, who granted him a new face, and he returned to Hira'a under the name ${link_4}.",
      "links": [
        {
          "body": "Ursa",
          "key": "${link_0}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_1}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Ikem",
          "key": "${link_2}",
          "target": {
            "href": "Noren#Life_as_Ikem",
            "page": "Noren"
          }
        },
        {
          "body": "Mother of Faces",
          "key": "${link_3}",
          "target": {
            "href": "Mother_of_Faces",
            "page": "Mother_of_Faces"
          }
        },
        {
          "body": "Noren",
          "key": "${link_4}",
          "target": {
            "href": "Noren",
            "page": "Noren"
          }
        }
      ],
      "text": "When his beloved Ursa left Hira'a to marry Fire Prince Ozai, Ikem, in his despair, departed to Forgetful Valley. Eventually, he encountered the Mother of Faces, who granted him a new face, and he returned to Hira'a under the name Noren."
    },
    {
      "body": "Years later, ${link_0} of the ${link_1} was dispatched by Ozai to assassinate Ikem and ventured into Forgetful Valley after receiving information from locals, only to be beset by various animals and plants. Concluding that the commoner could not had survived for long, Vachir left the forest.",
      "links": [
        {
          "body": "Vachir",
          "key": "${link_0}",
          "target": {
            "href": "Vachir",
            "page": "Vachir"
          }
        },
        {
          "body": "Yuyan Archers",
          "key": "${link_1}",
          "target": {
            "href": "Yuyan_Archers",
            "page": "Yuyan_Archers"
          }
        }
      ],
      "text": "Years later, Vachir of the Yuyan Archers was dispatched by Ozai to assassinate Ikem and ventured into Forgetful Valley after receiving information from locals, only to be beset by various animals and plants. Concluding that the commoner could not had survived for long, Vachir left the forest."
    },
    {
      "body": "When Ursa returned to Hira'a and met Ikem, he took her to Forgetful Valley to receive a new face. Eventually encountering the Mother of Faces, Ursa chose a plainer face and to forget her old life, taking the identity of ${link_0}.",
      "links": [
        {
          "body": "Noriko",
          "key": "${link_0}",
          "target": {
            "href": "Ursa#Reunion_with_Ikem_and_life_as_Noriko",
            "page": "Ursa"
          }
        }
      ],
      "text": "When Ursa returned to Hira'a and met Ikem, he took her to Forgetful Valley to receive a new face. Eventually encountering the Mother of Faces, Ursa chose a plainer face and to forget her old life, taking the identity of Noriko."
    },
    {
      "body": "${link_0} arrived at the Forgetful Valley when they were younger in an attempt to locate the Mother of Faces, hoping the spirit would grant Rafa a second face. In return, the two protected the forest.",
      "links": [
        {
          "body": "Rafa and Misu",
          "key": "${link_0}",
          "target": {
            "href": "Rafa_and_Misu",
            "page": "Rafa_and_Misu"
          }
        }
      ],
      "text": "Rafa and Misu arrived at the Forgetful Valley when they were younger in an attempt to locate the Mother of Faces, hoping the spirit would grant Rafa a second face. In return, the two protected the forest."
    },
    {
      "body": "In 102 ${link_0}, ${link_1} arrived in the Forgetful Valley while on their search for ${link_2} and befriended an older Rafa and Misu shortly thereafter. ${link_3} ${link_4} entered the Spirit World and also attempted to locate the Mother of Faces, with the intent of asking her to grant Rafa a new face. Once inside the Spirit World, Aang rode on the ${link_5} to reach the Mother of Faces. When he succeeded in bringing the spirit to his friends, ${link_6} gave Misu the chance to use the group's single request to ask for a new face for Rafa. However, Azula intervened and instead requested information about Ursa, after which she returned to Hira'a, followed closely by Zuko and ${link_7}, who took Misu's shortcut in order to reach the village faster.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Ursa",
          "key": "${link_2}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_4}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "wolf spirit",
          "key": "${link_5}",
          "target": {
            "href": "Wolf_spirit",
            "page": "Wolf_spirit"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_6}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_7}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "In 102 AG, Team Avatar arrived in the Forgetful Valley while on their search for Ursa and befriended an older Rafa and Misu shortly thereafter. Avatar Aang entered the Spirit World and also attempted to locate the Mother of Faces, with the intent of asking her to grant Rafa a new face. Once inside the Spirit World, Aang rode on the wolf spirit to reach the Mother of Faces. When he succeeded in bringing the spirit to his friends, Zuko gave Misu the chance to use the group's single request to ask for a new face for Rafa. However, Azula intervened and instead requested information about Ursa, after which she returned to Hira'a, followed closely by Zuko and Sokka, who took Misu's shortcut in order to reach the village faster."
    },
    {
      "body": "As the Mother of Faces attempted to depart, Misu and Aang tried to stop her, only to enrage the ancient spirit, who summoned angry spirit animals to attack them. During the ensuing fight, Rafa's mask was blown off, revealing that his face was stolen by ${link_0} the Face Stealer. After Aang declared this realization out loud, the Mother of Faces told the group that Koh was her son and, recognizing her child's handiwork, restored Rafa's face. As the elder siblings happily returned home, Aang and Katara convinced the Mother of Faces to accompany them to Hira'a in order to restore Ursa's face and memories.",
      "links": [
        {
          "body": "Koh",
          "key": "${link_0}",
          "target": {
            "href": "Koh",
            "page": "Koh"
          }
        }
      ],
      "text": "As the Mother of Faces attempted to depart, Misu and Aang tried to stop her, only to enrage the ancient spirit, who summoned angry spirit animals to attack them. During the ensuing fight, Rafa's mask was blown off, revealing that his face was stolen by Koh the Face Stealer. After Aang declared this realization out loud, the Mother of Faces told the group that Koh was her son and, recognizing her child's handiwork, restored Rafa's face. As the elder siblings happily returned home, Aang and Katara convinced the Mother of Faces to accompany them to Hira'a in order to restore Ursa's face and memories."
    },
    {
      "body": "Soon after, Azula vanished inside Forgetful Valley, unable to cope with the love and care her mother and brother showed her. Despite searching the valley for several weeks, Zuko was unable to find her.",
      "links": [],
      "text": "Soon after, Azula vanished inside Forgetful Valley, unable to cope with the love and care her mother and brother showed her. Despite searching the valley for several weeks, Zuko was unable to find her."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Forgetful_Valley",
    "file": "avatar.wikia.com/wiki/Forgetful_Valley.html",
    "page": "Forgetful_Valley",
    "title": "Forgetful Valley"
  }
}