{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "href": "Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Objects",
      "target": {
        "href": "Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Vehicles",
      "target": {
        "href": "Category_Vehicles",
        "page": "Category_Vehicles"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0}, ${link_1}, and ${link_2} fought ${link_3} and ${link_4} on one of the gondolas.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Suki",
          "key": "${link_2}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Azula",
          "key": "${link_3}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_4}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "text": "Zuko, Sokka, and Suki fought Azula and Ty Lee on one of the gondolas."
    },
    {
      "body": "The ${link_0} had a pair of gondolas on a pulley system to use for transportation between the prison and the island itself. Designed to be the only way to cross the lake of boiling water that surrounded the prison, they were used to transfer new prisoners into the prison, as well as shuttling prison guards back and forth between their shifts. There were two separate gondola tracks that ran parallel to each other and in opposite directions, so when one gondola car was at the prison station, the other car was at the outer crater station, and they passed each other at the midpoint. The gondola cars were large and enclosed with open windows.",
      "links": [
        {
          "body": "Boiling Rock",
          "key": "${link_0}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        }
      ],
      "text": "The Boiling Rock had a pair of gondolas on a pulley system to use for transportation between the prison and the island itself. Designed to be the only way to cross the lake of boiling water that surrounded the prison, they were used to transfer new prisoners into the prison, as well as shuttling prison guards back and forth between their shifts. There were two separate gondola tracks that ran parallel to each other and in opposite directions, so when one gondola car was at the prison station, the other car was at the outer crater station, and they passed each other at the midpoint. The gondola cars were large and enclosed with open windows."
    },
    {
      "body": "As the only way to enter or leave the Boiling Rock prison safely, ${link_0} and ${link_1} used them during their final ${link_2}. Their escape was well underway until ${link_3} and ${link_4} arrived. The two girls used the cable of the other gondola to catch up with the escapees and stop them from leaving. To defend their own gondola, Sokka, ${link_5} and ${link_6} climbed atop the roof to face the double threat. Suki and Ty Lee had a rematch while Azula faced Zuko and Sokka. The ${link_7} was cut short as the ${link_8} managed to order to cut the line of the gondola; Azula and Ty Lee switched gondola roofs in order to prevent from falling to their deaths in the boiling lake. Before the line was completely cut, ${link_9} intervened and saved the gondola and its passengers.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "his father",
          "key": "${link_1}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "escape attempt",
          "key": "${link_2}",
          "target": {
            "href": "Escape_from_the_Boiling_Rock",
            "page": "Escape_from_the_Boiling_Rock"
          }
        },
        {
          "body": "Azula",
          "key": "${link_3}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_4}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_5}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Suki",
          "key": "${link_6}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "battle",
          "key": "${link_7}",
          "target": {
            "href": "Duels_(Summer_100_AG)#Duel_on_the_Gondola",
            "page": "Duels_(Summer_100_AG)"
          }
        },
        {
          "body": "warden",
          "key": "${link_8}",
          "target": {
            "href": "Warden_(Boiling_Rock)",
            "page": "Warden_(Boiling_Rock)"
          }
        },
        {
          "body": "Mai",
          "key": "${link_9}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        }
      ],
      "text": "As the only way to enter or leave the Boiling Rock prison safely, Sokka and his father used them during their final escape attempt. Their escape was well underway until Azula and Ty Lee arrived. The two girls used the cable of the other gondola to catch up with the escapees and stop them from leaving. To defend their own gondola, Sokka, Zuko and Suki climbed atop the roof to face the double threat. Suki and Ty Lee had a rematch while Azula faced Zuko and Sokka. The battle was cut short as the warden managed to order to cut the line of the gondola; Azula and Ty Lee switched gondola roofs in order to prevent from falling to their deaths in the boiling lake. Before the line was completely cut, Mai intervened and saved the gondola and its passengers."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Gondola",
    "file": "avatar.wikia.com/wiki/Gondola.html",
    "page": "Gondola",
    "title": "Gondola"
  }
}