{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "href": "Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Settlements",
      "target": {
        "href": "Category_Settlements",
        "page": "Category_Settlements"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Fire Nation",
              "key": "${link_0}",
              "target": {
                "href": "Fire_Nation",
                "page": "Fire_Nation"
              }
            }
          ],
          "text": "Fire Nation",
          "value": "${link_0}",
          "value_text": "Fire Nation"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "Village",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Village",
          "value": "Village",
          "value_text": "Village"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\" (only appearance)",
          "extra": "(only appearance)",
          "extra_text": "(only appearance)",
          "links": [
            {
              "body": "The Puppetmaster",
              "key": "${link_0}",
              "target": {
                "href": "The_Puppetmaster",
                "page": "The_Puppetmaster"
              }
            }
          ],
          "text": "\"The Puppetmaster\" (only appearance)",
          "value": "\"${link_0}\"",
          "value_text": "\"The Puppetmaster\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Hama's village is a small town ${link_0} in the central islands of the ${link_1}. Its ${link_2} once believed it to be haunted by a \"moon monster\" who caused locals to disappear during the ${link_3}; it was eventually discovered that ${link_4}, the innkeeper, was the cause of the disappearances, as she had imprisoned those missing using ${link_5}.",
      "links": [
        {
          "body": "located",
          "key": "${link_0}",
          "target": {
            "href": "Geography_of_the_World_of_Avatar",
            "page": "Geography_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "citizens",
          "key": "${link_2}",
          "target": {
            "href": "Society_in_the_World_of_Avatar",
            "page": "Society_in_the_World_of_Avatar"
          }
        },
        {
          "body": "full moon",
          "key": "${link_3}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Hama",
          "key": "${link_4}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "bloodbending",
          "key": "${link_5}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        }
      ],
      "text": "Hama's village is a small town located in the central islands of the Fire Nation. Its citizens once believed it to be haunted by a \"moon monster\" who caused locals to disappear during the full moon; it was eventually discovered that Hama, the innkeeper, was the cause of the disappearances, as she had imprisoned those missing using bloodbending."
    },
    {
      "body": "Hama, a ${link_0} from the ${link_1}, moved to this village after escaping her ${link_2} in the Fire Nation, which occurred as a result of the Fire Nation's ${link_3} to rid the South Pole of waterbenders. After acquiring an ${link_4} in the town, Hama engaged in her own private war against the Fire Nation through the use of a technique she developed in prison, known as bloodbending. Hama imprisoned many of the town's residents by locking them away in chains inside the ${link_5}. Since her techniques only worked during a full moon, citizens stayed indoors on these nights, preferring not to risk their safety, and these disappearances plagued the town for several years.",
      "links": [
        {
          "body": "waterbender",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "imprisonment",
          "key": "${link_2}",
          "target": {
            "href": "Waterbender_prison",
            "page": "Waterbender_prison"
          }
        },
        {
          "body": "efforts",
          "key": "${link_3}",
          "target": {
            "href": "Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        },
        {
          "body": "inn",
          "key": "${link_4}",
          "target": {
            "href": "Hama%27s_inn",
            "page": "Hama%27s_inn"
          }
        },
        {
          "body": "mountain prison",
          "key": "${link_5}",
          "target": {
            "href": "Mountain_prison",
            "page": "Mountain_prison"
          }
        }
      ],
      "text": "Hama, a waterbender from the Southern Water Tribe, moved to this village after escaping her imprisonment in the Fire Nation, which occurred as a result of the Fire Nation's efforts to rid the South Pole of waterbenders. After acquiring an inn in the town, Hama engaged in her own private war against the Fire Nation through the use of a technique she developed in prison, known as bloodbending. Hama imprisoned many of the town's residents by locking them away in chains inside the mountain prison. Since her techniques only worked during a full moon, citizens stayed indoors on these nights, preferring not to risk their safety, and these disappearances plagued the town for several years."
    },
    {
      "body": "During the final months of the ${link_0}, ${link_1} was camping in the nearby woods when Hama appeared and offered them refuge at her inn for a few nights. They gladly accepted, and during their stay, they discovered that Hama was a Southern waterbender. ${link_2} was ecstatic at this discovery and wished to be taught more about her ${link_3} heritage and waterbending. Taking advantage of Katara's desire to learn, Hama agreed to share with her some unique techniques, while secretly desiring to create a successive bloodbender to continue her war on the Fire Nation populace.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_3}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        }
      ],
      "text": "During the final months of the Hundred Year War, Team Avatar was camping in the nearby woods when Hama appeared and offered them refuge at her inn for a few nights. They gladly accepted, and during their stay, they discovered that Hama was a Southern waterbender. Katara was ecstatic at this discovery and wished to be taught more about her Water Tribe heritage and waterbending. Taking advantage of Katara's desire to learn, Hama agreed to share with her some unique techniques, while secretly desiring to create a successive bloodbender to continue her war on the Fire Nation populace."
    },
    {
      "body": "During their stay in the village, ${link_0}, ${link_1}, and ${link_2} investigated the village for ${link_3} activity in hopes of finding the \"moon monster\", but could not find any. Instead, they discovered the hidden mountain prison where Hama's prisoners were being held. Having been told of Hama's actions by the prisoners, Toph stayed behind to free them while the boys rushed to save Katara, who was in the woods with Hama. Hama tried unsuccessfully to teach Katara bloodbending; when the latter refused to control another human in such a manner, Hama began to bloodbend her into submission instead. Katara fought back, but when Aang and Sokka arrived, their intervention allowed Hama to bloodbend them, causing Sokka to charge unwillingly at Aang with ${link_4}. Katara was forced to bloodbend Hama to cease her control over Aang and Sokka, effectively learning the technique.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_2}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "his sword",
          "key": "${link_4}",
          "target": {
            "href": "Sokka%27s_sword",
            "page": "Sokka%27s_sword"
          }
        }
      ],
      "text": "During their stay in the village, Aang, Toph, and Sokka investigated the village for Spirit World activity in hopes of finding the \"moon monster\", but could not find any. Instead, they discovered the hidden mountain prison where Hama's prisoners were being held. Having been told of Hama's actions by the prisoners, Toph stayed behind to free them while the boys rushed to save Katara, who was in the woods with Hama. Hama tried unsuccessfully to teach Katara bloodbending; when the latter refused to control another human in such a manner, Hama began to bloodbend her into submission instead. Katara fought back, but when Aang and Sokka arrived, their intervention allowed Hama to bloodbend them, causing Sokka to charge unwillingly at Aang with his sword. Katara was forced to bloodbend Hama to cease her control over Aang and Sokka, effectively learning the technique."
    },
    {
      "body": "Katara was traumatized by the experience, and Team Avatar left the village immediately after the villagers thanked them for capturing Hama. She was locked away by the villagers, who ensured that she would never bloodbend again, finally ending the terror that had gripped their town for so long.",
      "links": [],
      "text": "Katara was traumatized by the experience, and Team Avatar left the village immediately after the villagers thanked them for capturing Hama. She was locked away by the villagers, who ensured that she would never bloodbend again, finally ending the terror that had gripped their town for so long."
    },
    {
      "body": "A mountain overlooks ${link_0}'s village, which is located near a field of ${link_1}.",
      "links": [
        {
          "body": "Hama",
          "key": "${link_0}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "fire lilies",
          "key": "${link_1}",
          "target": {
            "href": "Fire_lily",
            "page": "Fire_lily"
          }
        }
      ],
      "text": "A mountain overlooks Hama's village, which is located near a field of fire lilies."
    },
    {
      "body": "This Fire Nation village lies within a rural area surrounded by forests. The village itself sits on a large bed of rock and includes a lively marketplace where many popular Fire Nation products are sold, including ${link_0} and ${link_1}. Aang described the village and its surroundings as \"the nicest natural setting in the Fire Nation\". It is also located near a vast field of ${link_2}.",
      "links": [
        {
          "body": "ash bananas",
          "key": "${link_0}",
          "target": {
            "href": "Ash_banana",
            "page": "Ash_banana"
          }
        },
        {
          "body": "komodo sausages",
          "key": "${link_1}",
          "target": {
            "href": "Komodo_sausage",
            "page": "Komodo_sausage"
          }
        },
        {
          "body": "fire lilies",
          "key": "${link_2}",
          "target": {
            "href": "Fire_lily",
            "page": "Fire_lily"
          }
        }
      ],
      "text": "This Fire Nation village lies within a rural area surrounded by forests. The village itself sits on a large bed of rock and includes a lively marketplace where many popular Fire Nation products are sold, including ash bananas and komodo sausages. Aang described the village and its surroundings as \"the nicest natural setting in the Fire Nation\". It is also located near a vast field of fire lilies."
    },
    {
      "body": "One of the town's landmarks is Hama's inn, which served as her home during her exile and as a rest stop for travelers. Unbeknownst to most of the townspeople, the town was also located near Hama's mountain prison, where she imprisoned and tortured captured villagers.",
      "links": [],
      "text": "One of the town's landmarks is Hama's inn, which served as her home during her exile and as a rest stop for travelers. Unbeknownst to most of the townspeople, the town was also located near Hama's mountain prison, where she imprisoned and tortured captured villagers."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Hama%27s_village",
    "file": "avatar.wikia.com/wiki/Hama's_village.html",
    "page": "Hama's_village",
    "title": "Hama's village"
  }
}