{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Battles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Battles",
        "page": "Category_Battles"
      }
    },
    {
      "body": "Duels",
      "target": {
        "external": false,
        "href": "/wiki/Category_Duels",
        "page": "Category_Duels"
      }
    },
    {
      "body": "Events",
      "target": {
        "external": false,
        "href": "/wiki/Category_Events",
        "page": "Category_Events"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Spirit World",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirit_World",
        "page": "Category_Spirit_World"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Harmonic Convergence is a supernatural phenomenon that occurs once every ten thousand years. When the planets align, spiritual energy is greatly amplified, causing the ${link_0} at the ${link_1} and ${link_2} to merge, while an aura of spirit energy envelops the ${link_3}. During this event, ${link_4} and ${link_5} must engage in a battle that determines the fate of the world until the next Harmonic Convergence. However, after Raava merged with ${link_6}, becoming the Avatar Spirit, it became the ${link_7}'s duty to battle Vaatu in the ${link_8} near the two portals that connect the two poles of the physical world.",
      "links": [
        {
          "body": "spirit portals",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "North",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/North_Pole",
            "page": "North_Pole"
          }
        },
        {
          "body": "South Poles",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Earth",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Raava",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Raava",
            "page": "Raava"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Wan",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Wan",
            "page": "Wan"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "section": [
        "Harmonic Convergence"
      ],
      "text": "Harmonic Convergence is a supernatural phenomenon that occurs once every ten thousand years. When the planets align, spiritual energy is greatly amplified, causing the spirit portals at the North and South Poles to merge, while an aura of spirit energy envelops the Earth. During this event, Raava and Vaatu must engage in a battle that determines the fate of the world until the next Harmonic Convergence. However, after Raava merged with Wan, becoming the Avatar Spirit, it became the Avatar's duty to battle Vaatu in the Spirit World near the two portals that connect the two poles of the physical world."
    },
    {
      "body": "At some point before the Harmonic Convergence of 19,829 ${link_0}, Vaatu, the spirit of darkness and chaos, managed to break through the barriers that separated the plane of the humans and that of the spirits, allowing both entities to travel from one world to the next. However, as the Harmonic Convergence began, Raava, the spirit of light and peace, battled Vaatu and was able to restrain him for nearly ten thousand years.",
      "links": [
        {
          "body": "BG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Harmonic Convergence",
        "History"
      ],
      "text": "At some point before the Harmonic Convergence of 19,829 BG, Vaatu, the spirit of darkness and chaos, managed to break through the barriers that separated the plane of the humans and that of the spirits, allowing both entities to travel from one world to the next. However, as the Harmonic Convergence began, Raava, the spirit of light and peace, battled Vaatu and was able to restrain him for nearly ten thousand years."
    },
    {
      "body": "Prior to the Harmonic Convergence that occurred in 9,829 BG, the link that kept Raava and Vaatu connected was severed by ${link_0}, who unknowingly set loose chaos into the world under the belief that releasing Vaatu would aid in maintaining spiritual balance. As a result, Vaatu was able to harness negative energy and turn several spirits ${link_1}, allowing him to gather strength while Raava weakened.",
      "links": [
        {
          "body": "Wan",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wan",
            "page": "Wan"
          }
        },
        {
          "body": "dark",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "section": [
        "Harmonic Convergence",
        "History",
        "9,829 BG"
      ],
      "text": "Prior to the Harmonic Convergence that occurred in 9,829 BG, the link that kept Raava and Vaatu connected was severed by Wan, who unknowingly set loose chaos into the world under the belief that releasing Vaatu would aid in maintaining spiritual balance. As a result, Vaatu was able to harness negative energy and turn several spirits dark, allowing him to gather strength while Raava weakened."
    },
    {
      "body": "To atone for his mistakes, Wan resolved to master all four ${link_0} to aid Raava in the next battle, providing his body to the light spirit as a host. Though Wan initially struggled in fighting Vaatu, he was able to trap the spirit in an elemental sphere and imprison him within the ${link_1} after allowing his spirit to permanently merge with Raava, in the process creating the Avatar Spirit. To prevent humans from freeing Vaatu, Wan led the spirits from the physical world into the Spirit World and closed the two spirit portals.",
      "links": [
        {
          "body": "bending arts",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Tree of Time",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "section": [
        "Harmonic Convergence",
        "History",
        "9,829 BG"
      ],
      "text": "To atone for his mistakes, Wan resolved to master all four bending arts to aid Raava in the next battle, providing his body to the light spirit as a host. Though Wan initially struggled in fighting Vaatu, he was able to trap the spirit in an elemental sphere and imprison him within the Tree of Time after allowing his spirit to permanently merge with Raava, in the process creating the Avatar Spirit. To prevent humans from freeing Vaatu, Wan led the spirits from the physical world into the Spirit World and closed the two spirit portals."
    },
    {
      "body": "Ten millennia later, Avatar ${link_0} reopened the Southern spirit portal in an attempt to calm the dark spirits rampaging in the South. Later, she learned about the origins of the Avatar Spirit and the Harmonic Convergence from Wan while recovering from a dark spirit attack that had left her amnesiac. After regaining her memory, Korra spoke with the ${link_1} who had aided her and discovered that the next Harmonic Convergence was only weeks away. Determined to close the Southern spirit portal, Korra set out on a ${link_2} from a herd that the shaman maintained during the ${link_3}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "shaman",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Shaman",
            "page": "Shaman"
          }
        },
        {
          "body": "flying bison",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "section": [
        "Harmonic Convergence",
        "History",
        "171 AG"
      ],
      "text": "Ten millennia later, Avatar Korra reopened the Southern spirit portal in an attempt to calm the dark spirits rampaging in the South. Later, she learned about the origins of the Avatar Spirit and the Harmonic Convergence from Wan while recovering from a dark spirit attack that had left her amnesiac. After regaining her memory, Korra spoke with the shaman who had aided her and discovered that the next Harmonic Convergence was only weeks away. Determined to close the Southern spirit portal, Korra set out on a flying bison from a herd that the shaman maintained during the Hundred Year War."
    },
    {
      "body": "Together with ${link_0}, Korra meditated into the Spirit World, where the two eventually found themselves separated. Jinora made her way to ${link_1}, where she found a book detailing that if both spirit portals were open when Harmonic Convergence occurs, spirit energy would be amplified, enabling Vaatu to free himself, starting the battle between good and evil anew. Before she could relay this information to the Avatar, she was captured by Unalaq, who threatened the young airbender's safety to force Korra to open the Northern spirit portal.",
      "links": [
        {
          "body": "Jinora",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Wan Shi Tong's Library",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        }
      ],
      "section": [
        "Harmonic Convergence",
        "History",
        "171 AG"
      ],
      "text": "Together with Jinora, Korra meditated into the Spirit World, where the two eventually found themselves separated. Jinora made her way to Wan Shi Tong's Library, where she found a book detailing that if both spirit portals were open when Harmonic Convergence occurs, spirit energy would be amplified, enabling Vaatu to free himself, starting the battle between good and evil anew. Before she could relay this information to the Avatar, she was captured by Unalaq, who threatened the young airbender's safety to force Korra to open the Northern spirit portal."
    },
    {
      "body": "The Avatar later returned to the Spirit World via the Southern portal and attempted to close it, though the energetic increase that accompanied the start of Harmonic Convergence negated her attempts. As the portals merged, Vaatu took advantage of the subsequent amplification of spiritual energy to break free from the Tree of Time. In the ensuing battle between him and Korra, she managed the trap encase him again in an elemental trap, though before she could re-imprison him in the hollow of the tree, Unalaq stopped her and merged with Vaatu. He used the energy coming from the Northern portal during the Harmonic Convergence to permanently fuse himself with Vaatu, creating a Dark Avatar Spirit. The Avatars battled each other for supremacy, trading blows, until Vaatu managed to wrest Raava out of Korra. Separated from her host, the Light Spirit was vulnerable to the Dark Avatar's attack, ultimately being destroyed, which severed Korra's connection to the past Avatars. Unalaq subsequently transformed into a massive dark spirit and traveled to ${link_0} via the ${link_1} and laid waste to it in his attempt to forcefully take back the mortal world.",
      "links": [
        {
          "body": "Republic City",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "spirit lights",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_lights",
            "page": "Spirit_lights"
          }
        }
      ],
      "section": [
        "Harmonic Convergence",
        "History",
        "171 AG"
      ],
      "text": "The Avatar later returned to the Spirit World via the Southern portal and attempted to close it, though the energetic increase that accompanied the start of Harmonic Convergence negated her attempts. As the portals merged, Vaatu took advantage of the subsequent amplification of spiritual energy to break free from the Tree of Time. In the ensuing battle between him and Korra, she managed the trap encase him again in an elemental trap, though before she could re-imprison him in the hollow of the tree, Unalaq stopped her and merged with Vaatu. He used the energy coming from the Northern portal during the Harmonic Convergence to permanently fuse himself with Vaatu, creating a Dark Avatar Spirit. The Avatars battled each other for supremacy, trading blows, until Vaatu managed to wrest Raava out of Korra. Separated from her host, the Light Spirit was vulnerable to the Dark Avatar's attack, ultimately being destroyed, which severed Korra's connection to the past Avatars. Unalaq subsequently transformed into a massive dark spirit and traveled to Republic City via the spirit lights and laid waste to it in his attempt to forcefully take back the mortal world."
    },
    {
      "body": "Tenzin encouraged Korra to draw on her own spirit as she meditated within the Tree of Time, using the cosmic energy of the universe to bend her own energy rather than the elements. Korra's spirit manifested and grew to a massive size as she went to confront Unalaq. She searched the Dark Avatar's being for a sign of Raava, as dark cannot exist without light, though her efforts proved futile. The Dark Avatar seized that moment to gain the upper hand and attempt to corrupt Korra's spirit by using Unalaq's spiritual knowledge. Before he could complete his attack, Jinora's spirit intervened, who brought Raava's light back into the world, and by bathing the combatants in a brilliant light, she illuminated Raava within the Dark Avatar. Korra managed to free the Light Spirit before using Unalaq's pacification technique to purify the Dark Avatar, dissipating him into a golden light. Korra, Raava, and Jinora returned to the Spirit World, where Korra and Raava used the energy of the combined spirit portal once more and recreate the Avatar Spirit, right before Harmonic Convergence ended.",
      "links": [],
      "section": [
        "Harmonic Convergence",
        "History",
        "171 AG"
      ],
      "text": "Tenzin encouraged Korra to draw on her own spirit as she meditated within the Tree of Time, using the cosmic energy of the universe to bend her own energy rather than the elements. Korra's spirit manifested and grew to a massive size as she went to confront Unalaq. She searched the Dark Avatar's being for a sign of Raava, as dark cannot exist without light, though her efforts proved futile. The Dark Avatar seized that moment to gain the upper hand and attempt to corrupt Korra's spirit by using Unalaq's spiritual knowledge. Before he could complete his attack, Jinora's spirit intervened, who brought Raava's light back into the world, and by bathing the combatants in a brilliant light, she illuminated Raava within the Dark Avatar. Korra managed to free the Light Spirit before using Unalaq's pacification technique to purify the Dark Avatar, dissipating him into a golden light. Korra, Raava, and Jinora returned to the Spirit World, where Korra and Raava used the energy of the combined spirit portal once more and recreate the Avatar Spirit, right before Harmonic Convergence ended."
    },
    {
      "body": "After the end of the Harmonic Convergence, Korra announced that she could feel the shift in the planet's energy caused by the celestial event, noting that the world would never be the same. One of the consequences was a number of nonbending citizens across the world manifesting newly acquired ${link_0} abilities.",
      "links": [
        {
          "body": "airbending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        }
      ],
      "section": [
        "Harmonic Convergence",
        "History",
        "171 AG"
      ],
      "text": "After the end of the Harmonic Convergence, Korra announced that she could feel the shift in the planet's energy caused by the celestial event, noting that the world would never be the same. One of the consequences was a number of nonbending citizens across the world manifesting newly acquired airbending abilities."
    },
    {
      "body": "19,829 BG — Result: Raava was victorious.",
      "links": [],
      "section": [
        "Harmonic Convergence",
        "Known Harmonic Convergences"
      ],
      "text": "19,829 BG — Result: Raava was victorious."
    },
    {
      "body": "${link_0} — Result: Raava permanently merged with Wan's essence, creating the Avatar Spirit, and Vaatu was imprisoned in the Spirit World for ten thousand years.",
      "links": [
        {
          "body": "9,829 BG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Battle_during_Harmonic_Convergence_(9%2c829_BG)",
            "page": "Battle_during_Harmonic_Convergence_(9%2c829_BG)"
          }
        }
      ],
      "section": [
        "Harmonic Convergence",
        "Known Harmonic Convergences"
      ],
      "text": "9,829 BG — Result: Raava permanently merged with Wan's essence, creating the Avatar Spirit, and Vaatu was imprisoned in the Spirit World for ten thousand years."
    },
    {
      "body": "${link_0} — Result: Raava was destroyed by Unalaq, who had merged with Vaatu. Korra dissipated Dark Avatar Unalaq. Raava merged with Korra to begin the Avatar Cycle anew.",
      "links": [
        {
          "body": "171 AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq_Crisis",
            "page": "Unalaq_Crisis"
          }
        }
      ],
      "section": [
        "Harmonic Convergence",
        "Known Harmonic Convergences"
      ],
      "text": "171 AG — Result: Raava was destroyed by Unalaq, who had merged with Vaatu. Korra dissipated Dark Avatar Unalaq. Raava merged with Korra to begin the Avatar Cycle anew."
    },
    {
      "body": "Raava and Vaatu cannot permanently destroy each other, as the defeated spirit is eventually regenerated from the victor. This is because neither light nor darkness can exist by itself.",
      "links": [],
      "section": [
        "Harmonic Convergence",
        "Trivia"
      ],
      "text": "Raava and Vaatu cannot permanently destroy each other, as the defeated spirit is eventually regenerated from the victor. This is because neither light nor darkness can exist by itself."
    },
    {
      "body": "The only way to prevent the battle between Raava and Vaatu is if the portals remain closed while Vaatu is in his prison.",
      "links": [],
      "section": [
        "Harmonic Convergence",
        "Trivia"
      ],
      "text": "The only way to prevent the battle between Raava and Vaatu is if the portals remain closed while Vaatu is in his prison."
    },
    {
      "body": "The battle takes place in the Spirit World, near the spirit portals where the two realms intersect.",
      "links": [],
      "section": [
        "Harmonic Convergence",
        "Trivia"
      ],
      "text": "The battle takes place in the Spirit World, near the spirit portals where the two realms intersect."
    },
    {
      "body": "In the real world, Harmonic Convergence refers to the first globally synchronized meditation, which coincided with a rare alignment of the planets.\n This event purportedly corresponded with a great shift in the planet's energy from warlike to peaceful, similar to how Raava's victories in both historic Harmonic Convergences resulted in the maintenance of balance in the ${link_0}.\n During the observances, ${link_1} and ${link_2} were regarded as \"power centers\" where spiritual energy was held to be particularly strong, similar to the two spirit portals in the North and South Poles.",
      "links": [
        {
          "body": "Avatar World",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Mount Shasta",
          "key": "${link_1}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Mount_Shasta",
            "page": "http://en.wikipedia.org/wiki/Mount_Shasta"
          }
        },
        {
          "body": "Mount Fuji",
          "key": "${link_2}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Mount_Fuji",
            "page": "http://en.wikipedia.org/wiki/Mount_Fuji"
          }
        }
      ],
      "section": [
        "Harmonic Convergence",
        "Trivia"
      ],
      "text": "In the real world, Harmonic Convergence refers to the first globally synchronized meditation, which coincided with a rare alignment of the planets.\n This event purportedly corresponded with a great shift in the planet's energy from warlike to peaceful, similar to how Raava's victories in both historic Harmonic Convergences resulted in the maintenance of balance in the Avatar World.\n During the observances, Mount Shasta and Mount Fuji were regarded as \"power centers\" where spiritual energy was held to be particularly strong, similar to the two spirit portals in the North and South Poles."
    },
    {
      "body": "This event purportedly corresponded with a great shift in the planet's energy from warlike to peaceful, similar to how Raava's victories in both historic Harmonic Convergences resulted in the maintenance of balance in the ${link_0}.",
      "links": [],
      "section": [
        "Harmonic Convergence",
        "Trivia"
      ],
      "text": "This event purportedly corresponded with a great shift in the planet's energy from warlike to peaceful, similar to how Raava's victories in both historic Harmonic Convergences resulted in the maintenance of balance in the ${link_0}."
    },
    {
      "body": "During the observances, ${link_1} and ${link_2} were regarded as \"power centers\" where spiritual energy was held to be particularly strong, similar to the two spirit portals in the North and South Poles.",
      "links": [],
      "section": [
        "Harmonic Convergence",
        "Trivia"
      ],
      "text": "During the observances, ${link_1} and ${link_2} were regarded as \"power centers\" where spiritual energy was held to be particularly strong, similar to the two spirit portals in the North and South Poles."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Harmonic_Convergence",
    "file": "avatar.wikia.com/wiki/Harmonic_Convergence.html",
    "page": "Harmonic_Convergence",
    "title": "Harmonic Convergence"
  }
}