{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "external": false,
        "href": "/wiki/Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Titles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Titles",
        "page": "Category_Titles"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Heir to the Fire Lord, also known as the Crown Prince, Crown Princess, Fire Prince, or Fire Princess, is the title normally given to the eldest eligible son or daughter of the ${link_0} and is used to refer to the person who is next in line to the ${link_1} throne.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord"
      ],
      "text": "Heir to the Fire Lord, also known as the Crown Prince, Crown Princess, Fire Prince, or Fire Princess, is the title normally given to the eldest eligible son or daughter of the Fire Lord and is used to refer to the person who is next in line to the Fire Nation throne."
    },
    {
      "body": "In the Fire Nation, primogeniture, the right of a firstborn to inherit a position, usually determines the appointment of the Crown Prince or Princess. However, the eldest is not necessarily the heir apparent; the title may be conferred and removed according to the reigning Fire Lord's wishes. One way for a royal to reclaim his or her lost birthright is to challenge the current heir to single combat or ${link_0}.",
      "links": [
        {
          "body": "Agni Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Agni_Kai",
            "page": "Agni_Kai"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "History"
      ],
      "text": "In the Fire Nation, primogeniture, the right of a firstborn to inherit a position, usually determines the appointment of the Crown Prince or Princess. However, the eldest is not necessarily the heir apparent; the title may be conferred and removed according to the reigning Fire Lord's wishes. One way for a royal to reclaim his or her lost birthright is to challenge the current heir to single combat or Agni Kai."
    },
    {
      "body": "The first known Heir to the Fire Lord was ${link_0}. His days as Crown Prince were often spent with his best friend, ${link_1}. He succeeded his father as Fire Lord during the years in which Roku trained to become a fully-realized ${link_2}.",
      "links": [
        {
          "body": "Sozin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "Roku",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "History"
      ],
      "text": "The first known Heir to the Fire Lord was Sozin. His days as Crown Prince were often spent with his best friend, Roku. He succeeded his father as Fire Lord during the years in which Roku trained to become a fully-realized Avatar."
    },
    {
      "body": "Sozin married and had his first and only child, ${link_0}, who became the Crown Prince as a result and served his father as an illustrious High ${link_1} during the ${link_2}. Azulon ascended the throne upon Sozin's eventual death at the age of 102.",
      "links": [
        {
          "body": "Azulon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Azulon",
            "page": "Azulon"
          }
        },
        {
          "body": "General",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#General_2",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "History"
      ],
      "text": "Sozin married and had his first and only child, Azulon, who became the Crown Prince as a result and served his father as an illustrious High General during the Hundred Year War. Azulon ascended the throne upon Sozin's eventual death at the age of 102."
    },
    {
      "body": "Azulon eventually married a woman named Ilah and had two sons, ${link_0} and ${link_1}. Iroh became the Crown Prince as the immediate heir to the throne. Both men eventually married, with Iroh having his only son ${link_2}, and Ozai having his first child ${link_3}. Since his father was expected to succeed Azulon as Fire Lord, Lu Ten was the second legitimate heir to the throne. Crown Prince Iroh, like his father, became a prominent High General of the ${link_4} and claimed many victories for his nation, including the near conquest of the ${link_5} capital of ${link_6}. However, ${link_7} ended in failure when Prince Lu Ten was killed in battle, breaking Iroh's will to fight.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Lu Ten",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Lu_Ten",
            "page": "Lu_Ten"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Fire Nation Army",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "this invasion",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Siege_of_Ba_Sing_Se",
            "page": "Siege_of_Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "History"
      ],
      "text": "Azulon eventually married a woman named Ilah and had two sons, Iroh and Ozai. Iroh became the Crown Prince as the immediate heir to the throne. Both men eventually married, with Iroh having his only son Lu Ten, and Ozai having his first child Zuko. Since his father was expected to succeed Azulon as Fire Lord, Lu Ten was the second legitimate heir to the throne. Crown Prince Iroh, like his father, became a prominent High General of the Fire Nation Army and claimed many victories for his nation, including the near conquest of the Earth Kingdom capital of Ba Sing Se. However, this invasion ended in failure when Prince Lu Ten was killed in battle, breaking Iroh's will to fight."
    },
    {
      "body": "Fire Lord Azulon mysteriously died after word of Iroh's defeat reached the Fire Nation. On his deathbed, he stripped Iroh of his title in favor of his second son, Ozai, in an episode of palace intrigue orchestrated by ${link_0} on Zuko's behalf. Zuko became the immediate heir to the throne but was banished after speaking out of turn at a war meeting. He was never Ozai's favorite to inherit the crown, but was promised the return of his birthright if he captured the Avatar. Though Zuko was reconfirmed as Crown Prince after the ${link_1}, it was a short-lived return, as he was once again stripped of his birthright for betraying the Fire Nation during the ${link_2}.",
      "links": [
        {
          "body": "Ursa",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ursa",
            "page": "Ursa"
          }
        },
        {
          "body": "Coup of Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Day of Black Sun",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "History"
      ],
      "text": "Fire Lord Azulon mysteriously died after word of Iroh's defeat reached the Fire Nation. On his deathbed, he stripped Iroh of his title in favor of his second son, Ozai, in an episode of palace intrigue orchestrated by Ursa on Zuko's behalf. Zuko became the immediate heir to the throne but was banished after speaking out of turn at a war meeting. He was never Ozai's favorite to inherit the crown, but was promised the return of his birthright if he captured the Avatar. Though Zuko was reconfirmed as Crown Prince after the Coup of Ba Sing Se, it was a short-lived return, as he was once again stripped of his birthright for betraying the Fire Nation during the Day of Black Sun."
    },
    {
      "body": "${link_0} became the Crown Princess of the Fire Nation, and thus the heiress apparent to the throne. It was indicated that she had every intention of stealing the throne from Zuko, considering the bitter rivalry between the two. In the final battles of the Hundred Year War, Azula was to succeed Ozai as Fire Lord while he declared himself the new ${link_1} of the ${link_2}. However, she was ultimately defeated by Zuko and his ally ${link_3} during the arrival of ${link_4} in a vicious ${link_5} for the throne. Azula was subsequently stripped of the title of Crown Princess.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Phoenix King",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Phoenix_King",
            "page": "Phoenix_King"
          }
        },
        {
          "body": "earth",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "duel",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "History"
      ],
      "text": "Azula became the Crown Princess of the Fire Nation, and thus the heiress apparent to the throne. It was indicated that she had every intention of stealing the throne from Zuko, considering the bitter rivalry between the two. In the final battles of the Hundred Year War, Azula was to succeed Ozai as Fire Lord while he declared himself the new Phoenix King of the earth. However, she was ultimately defeated by Zuko and his ally Katara during the arrival of Sozin's Comet in a vicious duel for the throne. Azula was subsequently stripped of the title of Crown Princess."
    },
    {
      "body": "Zuko became Fire Lord after this, declaring the Hundred Year War over. Years later, his daughter, ${link_0}, became the heir to the throne, and she was crowned Fire Lord upon Zuko's retirement at the age of eighty-four.",
      "links": [
        {
          "body": "Izumi",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Izumi",
            "page": "Izumi"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "History"
      ],
      "text": "Zuko became Fire Lord after this, declaring the Hundred Year War over. Years later, his daughter, Izumi, became the heir to the throne, and she was crowned Fire Lord upon Zuko's retirement at the age of eighty-four."
    },
    {
      "body": "The Fire Lord's heir, along with all other members of the ${link_0}, has a number of distinctive trappings that distinguishes them. For many generations, the heir wore a ${link_1} on their ${link_2} that indicated their position. However, this headpiece was lost after Sozin gave it to Roku. After this, Royal Family members wore small coronets in their top-knots in the shape of flames. These pieces come in either red or gold, apparently depending on the occasion.",
      "links": [
        {
          "body": "Royal Family",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_Royal_Family",
            "page": "Fire_Nation_Royal_Family"
          }
        },
        {
          "body": "headpiece",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Crown_Prince_headpiece",
            "page": "Crown_Prince_headpiece"
          }
        },
        {
          "body": "top-knot",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Top-knot",
            "page": "Top-knot"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "Distinguishing features"
      ],
      "text": "The Fire Lord's heir, along with all other members of the Royal Family, has a number of distinctive trappings that distinguishes them. For many generations, the heir wore a headpiece on their top-knot that indicated their position. However, this headpiece was lost after Sozin gave it to Roku. After this, Royal Family members wore small coronets in their top-knots in the shape of flames. These pieces come in either red or gold, apparently depending on the occasion."
    },
    {
      "body": "Sozin, Zuko, and Azula adorned themselves formal ${link_0} and outfits while in certain areas of the palace. These robes are identical, although they appeared shorter in Sozin's generation. They are a deep, blood red, and are trimmed with gold along the sleeves and collars.",
      "links": [
        {
          "body": "robes",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fashion_in_the_World_of_Avatar#Royalty",
            "page": "Fashion_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "Distinguishing features"
      ],
      "text": "Sozin, Zuko, and Azula adorned themselves formal robes and outfits while in certain areas of the palace. These robes are identical, although they appeared shorter in Sozin's generation. They are a deep, blood red, and are trimmed with gold along the sleeves and collars."
    },
    {
      "body": "For matters involving the Fire Lord such as war meetings and audiences, Zuko and Azula wore ${link_0}, at least following their return home. This armor is black and deep red, with gold trimmings. Zuko and Azula both wore gold flame pieces on their top-knots while they wore this armor.",
      "links": [
        {
          "body": "formal armor",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Royal_armor",
            "page": "Royal_armor"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "Distinguishing features"
      ],
      "text": "For matters involving the Fire Lord such as war meetings and audiences, Zuko and Azula wore formal armor, at least following their return home. This armor is black and deep red, with gold trimmings. Zuko and Azula both wore gold flame pieces on their top-knots while they wore this armor."
    },
    {
      "body": "Before his return home, Zuko wore normal ${link_0} armor without a headpiece, and Azula wore an all blood red armor with a red headpiece.",
      "links": [
        {
          "body": "Fire Navy",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "Distinguishing features"
      ],
      "text": "Before his return home, Zuko wore normal Fire Navy armor without a headpiece, and Azula wore an all blood red armor with a red headpiece."
    },
    {
      "body": "Due to the Fire Nation's warrior culture, potential rulers are expected to \"prove their worth\" before taking the throne. From young ages, heirs and potential heirs are trained extensively in combat and academics. Potential heirs usually master ${link_0} moves far from the standards of normal firebenders their age. They are educated extensively on the ${link_1} of the Fire Nation, from subjects ranging from the lives of past Fire Lords to the strategies and techniques used by past Generals to defeat districts from other nations. Those who do well are more inclined to become Fire Lord in the future. Royal family members undergo a number of tests throughout their lives to determine their value to the Fire Nation. By the time he was an adult, Iroh had been in a number of intense battles, a part of his life as a prince.",
      "links": [
        {
          "body": "firebending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "history",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation#History",
            "page": "Fire_Nation"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "Life and duties"
      ],
      "text": "Due to the Fire Nation's warrior culture, potential rulers are expected to \"prove their worth\" before taking the throne. From young ages, heirs and potential heirs are trained extensively in combat and academics. Potential heirs usually master firebending moves far from the standards of normal firebenders their age. They are educated extensively on the history of the Fire Nation, from subjects ranging from the lives of past Fire Lords to the strategies and techniques used by past Generals to defeat districts from other nations. Those who do well are more inclined to become Fire Lord in the future. Royal family members undergo a number of tests throughout their lives to determine their value to the Fire Nation. By the time he was an adult, Iroh had been in a number of intense battles, a part of his life as a prince."
    },
    {
      "body": "The heirs to the Fire Nation throne also share the duty of commanding or overseeing their nation's forces overseas when deemed necessary and also take an active role in political decisions. Crown Princess Azula briefly assumed authority over the newly conquered city of ${link_0} from its ${link_1} due to his poor decision-making, and she and Prince Zuko both advised their father on how to quell the ${link_2} raging across the conquered Earth Kingdom. They can command Fire Nation troops when it serves their purpose as well. Such involvement in politics and wartime exposes potential heirs to the political structure and functions of the Fire Nation, and thus gives them insight into their own future policies should they inherit the throne.",
      "links": [
        {
          "body": "Omashu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "governor",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ukano",
            "page": "Ukano"
          }
        },
        {
          "body": "rebellion",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbender_rebellions",
            "page": "Earthbender_rebellions"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "Life and duties"
      ],
      "text": "The heirs to the Fire Nation throne also share the duty of commanding or overseeing their nation's forces overseas when deemed necessary and also take an active role in political decisions. Crown Princess Azula briefly assumed authority over the newly conquered city of Omashu from its governor due to his poor decision-making, and she and Prince Zuko both advised their father on how to quell the rebellion raging across the conquered Earth Kingdom. They can command Fire Nation troops when it serves their purpose as well. Such involvement in politics and wartime exposes potential heirs to the political structure and functions of the Fire Nation, and thus gives them insight into their own future policies should they inherit the throne."
    },
    {
      "body": "This list includes all known Heirs to the Fire Lord, and the period they held said position:",
      "links": [],
      "section": [
        "Heir to the Fire Lord",
        "Known heirs"
      ],
      "text": "This list includes all known Heirs to the Fire Lord, and the period they held said position:"
    },
    {
      "body": "${link_0} – 82 ${link_1} ~ 58 BG",
      "links": [
        {
          "body": "Sozin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "BG",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "Known heirs"
      ],
      "text": "Sozin – 82 BG ~ 58 BG"
    },
    {
      "body": "${link_0} – 0 ~ 20 AG",
      "links": [
        {
          "body": "Azulon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Azulon",
            "page": "Azulon"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "Known heirs"
      ],
      "text": "Azulon – 0 ~ 20 AG"
    },
    {
      "body": "${link_0} – Unknown ~ 95 AG",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "Known heirs"
      ],
      "text": "Iroh – Unknown ~ 95 AG"
    },
    {
      "body": "${link_0} – 95 ~ 97 AG; Spring 100 AG ~ Summer 100 AG",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "Known heirs"
      ],
      "text": "Zuko – 95 ~ 97 AG; Spring 100 AG ~ Summer 100 AG"
    },
    {
      "body": "${link_0} – 97 ~ Spring 100 AG; Summer 100 AG",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "Known heirs"
      ],
      "text": "Azula – 97 ~ Spring 100 AG; Summer 100 AG"
    },
    {
      "body": "${link_0} – Unknown ~ 167 AG",
      "links": [
        {
          "body": "Izumi",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Izumi",
            "page": "Izumi"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "Known heirs"
      ],
      "text": "Izumi – Unknown ~ 167 AG"
    },
    {
      "body": "Heir to the Fire Lord is written on Zuko's wanted poster as 火帝儲君.",
      "links": [],
      "section": [
        "Heir to the Fire Lord",
        "Trivia"
      ],
      "text": "Heir to the Fire Lord is written on Zuko's wanted poster as 火帝儲君."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "See also"
      ],
      "text": "Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Council of Elders",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Council_of_Elders",
            "page": "Council_of_Elders"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "See also"
      ],
      "text": "Council of Elders"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Earth monarch",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "See also"
      ],
      "text": "Earth monarch"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "See also"
      ],
      "text": "Fire Lord"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "See also"
      ],
      "text": "Fire Nation"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Phoenix King",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Phoenix_King",
            "page": "Phoenix_King"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "See also"
      ],
      "text": "Phoenix King"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Politics in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Politics_in_the_World_of_Avatar",
            "page": "Politics_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "See also"
      ],
      "text": "Politics in the World of Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Tribal chief",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_chief",
            "page": "Tribal_chief"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "See also"
      ],
      "text": "Tribal chief"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Tribal Princess",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_Princess",
            "page": "Tribal_Princess"
          }
        }
      ],
      "section": [
        "Heir to the Fire Lord",
        "See also"
      ],
      "text": "Tribal Princess"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Heir_to_the_Fire_Lord",
    "file": "avatar.wikia.com/wiki/Heir_to_the_Fire_Lord.html",
    "page": "Heir_to_the_Fire_Lord",
    "title": "Heir to the Fire Lord"
  }
}