{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Hiroshi was a businessman and industrialist who had a high position in society because of the wealth he gained from his invention of the ${link_2}.",
      "links": [
        {
          "body": "Hiroshi Sato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Satomobile",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Satomobile",
            "page": "Satomobile"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships"
      ],
      "text": "This page is comprised of Hiroshi Sato's relationships with other characters in the World of Avatar. Hiroshi was a businessman and industrialist who had a high position in society because of the wealth he gained from his invention of the Satomobile."
    },
    {
      "body": "Aside from being a diligent businessman, Hiroshi made sure that his daughter ${link_0} always had everything she needed. He sent her to self-defense classes at a young age to ensure she was capable of defending herself. Living as a single parent, Hiroshi and his daughter always had a close relationship with each other following the death of ${link_1}, his wife. When he was told by his daughter of ${link_2}'s monetary issues, he sponsored the ${link_3} and allowed Asami's friends to stay at his ${link_4} despite secretly despising them for being ${link_5}.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Yasuko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Yasuko",
            "page": "Yasuko"
          }
        },
        {
          "body": "Mako",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Fire Ferrets",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        },
        {
          "body": "estate",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Sato_estate",
            "page": "Sato_estate"
          }
        },
        {
          "body": "benders",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Relatives",
        "Asami Sato"
      ],
      "text": "Aside from being a diligent businessman, Hiroshi made sure that his daughter Asami always had everything she needed. He sent her to self-defense classes at a young age to ensure she was capable of defending herself. Living as a single parent, Hiroshi and his daughter always had a close relationship with each other following the death of Yasuko, his wife. When he was told by his daughter of Mako's monetary issues, he sponsored the Fire Ferrets and allowed Asami's friends to stay at his estate despite secretly despising them for being benders."
    },
    {
      "body": "When he revealed his ties with the ${link_0}, Asami, stating that she loved him, electroshocked Hiroshi with an ${link_1}. All that Hiroshi did for his daughter was to cover his true status and he placed his revenge over her happiness, causing Asami to be greatly disappointed. Later, Asami became a member of the new ${link_2}, displaying an ambitious desire to oppose the Equalists.",
      "links": [
        {
          "body": "Equalists",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Equalist glove",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Electrified_glove",
            "page": "Electrified_glove"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Relatives",
        "Asami Sato"
      ],
      "text": "When he revealed his ties with the Equalists, Asami, stating that she loved him, electroshocked Hiroshi with an Equalist glove. All that Hiroshi did for his daughter was to cover his true status and he placed his revenge over her happiness, causing Asami to be greatly disappointed. Later, Asami became a member of the new Team Avatar, displaying an ambitious desire to oppose the Equalists."
    },
    {
      "body": "While talking with ${link_0}, Hiroshi expressed disgust at his daughter fighting alongside the benders, to which Amon replied that he would have his daughter back soon.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Relatives",
        "Asami Sato"
      ],
      "text": "While talking with Amon, Hiroshi expressed disgust at his daughter fighting alongside the benders, to which Amon replied that he would have his daughter back soon."
    },
    {
      "body": "As the ${link_0} reached its climax, Asami teamed up with ${link_1} and ${link_2} ${link_3} of the ${link_4} to destroy the Equalists' air superiority, which was granted through a fleet of ${link_5} provided by Hiroshi. In their attempt to destroy the ${link_6}, they were electroshocked and subsequently imprisoned. Hiroshi confronted his daughter in her cell, saying he was sorry for hurting her and insisting once more that she join him in avenging her mother's death. When Asami retorted by saying that her mother would hate Hiroshi for the monster he had become, he furiously shot her down, berating Asami for her continued defiance. He subsequently left her alone in her cell to lead the attack on the incoming fleet of reinforcements.",
      "links": [
        {
          "body": "battle for Republic City",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Battle_for_Republic_City",
            "page": "Battle_for_Republic_City"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "General",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#General_3",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh_(United_Forces_general)",
            "page": "Iroh_(United_Forces_general)"
          }
        },
        {
          "body": "United Republic Forces",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/United_Forces",
            "page": "United_Forces"
          }
        },
        {
          "body": "biplanes",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Biplane",
            "page": "Biplane"
          }
        },
        {
          "body": "airbase",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi%27s_secret_airfield",
            "page": "Hiroshi%27s_secret_airfield"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Relatives",
        "Asami Sato"
      ],
      "text": "As the battle for Republic City reached its climax, Asami teamed up with Bolin and General Iroh of the United Republic Forces to destroy the Equalists' air superiority, which was granted through a fleet of biplanes provided by Hiroshi. In their attempt to destroy the airbase, they were electroshocked and subsequently imprisoned. Hiroshi confronted his daughter in her cell, saying he was sorry for hurting her and insisting once more that she join him in avenging her mother's death. When Asami retorted by saying that her mother would hate Hiroshi for the monster he had become, he furiously shot her down, berating Asami for her continued defiance. He subsequently left her alone in her cell to lead the attack on the incoming fleet of reinforcements."
    },
    {
      "body": "Hiroshi confronted his daughter once more as the two of them met face-to-face in ${link_0}. Hiroshi once more insisted that he was doing this out of love for his wife, but Asami said that Hiroshi's love for her mother was no more, as he was too overcome by his own hatred of benders. Infuriated, Hiroshi proceeded to attack her, calling her an ungrateful, insolent child and completely lost in his quest for revenge. Finally deciding that she was a lost cause, he repeatedly attacked Asami, severing any familial affection he held for her. Just as he attempted to kill her, Bolin intervened, giving Asami time to pin him down and disarm him. Ultimately, however, she could not bring herself to kill him; Hiroshi attacked again, but was forced to flee on foot as Asami had overpowered his tank. At this point, Asami captured her father by electroshocking him one last time, having finally realized that Hiroshi was no longer the father she loved.",
      "links": [
        {
          "body": "mecha tanks",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_tank",
            "page": "Mecha_tank"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Relatives",
        "Asami Sato"
      ],
      "text": "Hiroshi confronted his daughter once more as the two of them met face-to-face in mecha tanks. Hiroshi once more insisted that he was doing this out of love for his wife, but Asami said that Hiroshi's love for her mother was no more, as he was too overcome by his own hatred of benders. Infuriated, Hiroshi proceeded to attack her, calling her an ungrateful, insolent child and completely lost in his quest for revenge. Finally deciding that she was a lost cause, he repeatedly attacked Asami, severing any familial affection he held for her. Just as he attempted to kill her, Bolin intervened, giving Asami time to pin him down and disarm him. Ultimately, however, she could not bring herself to kill him; Hiroshi attacked again, but was forced to flee on foot as Asami had overpowered his tank. At this point, Asami captured her father by electroshocking him one last time, having finally realized that Hiroshi was no longer the father she loved."
    },
    {
      "body": "By 174 ${link_0}, Hiroshi had come to regret his past actions, especially how they had affected Asami and what they had together. In an attempt to make amends with his daughter, he began to write her and managed to get her to visit him in ${link_1}. Given the chance, he apologized to her for all he had done, admitting that while he could never forgive himself or hope to be forgiven, Asami was the only thing in his life that he was proud of, declaring her to be his greatest achievement. Hiroshi was pleased when Asami eventually decided that, while she was unsure if she would ever be able to trust him again, she was willing to give him another chance.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "prison",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_prison",
            "page": "Republic_City_prison"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Relatives",
        "Asami Sato"
      ],
      "text": "By 174 AG, Hiroshi had come to regret his past actions, especially how they had affected Asami and what they had together. In an attempt to make amends with his daughter, he began to write her and managed to get her to visit him in prison. Given the chance, he apologized to her for all he had done, admitting that while he could never forgive himself or hope to be forgiven, Asami was the only thing in his life that he was proud of, declaring her to be his greatest achievement. Hiroshi was pleased when Asami eventually decided that, while she was unsure if she would ever be able to trust him again, she was willing to give him another chance."
    },
    {
      "body": "When Lin later freed Hiroshi from prison to assist Team Avatar against ${link_0}, he showed Asami, ${link_1}, and ${link_2} how to convert welding torches to plasma saws. Working together on the same ${link_3} as his daughter and conducting a successful test by cutting a piece of plasma, he was thanked by Asami for all that he had done, though he instantly returned the compliment, praising her for the design of the hummingbird suits. As he emphasized how wonderful he thought it was to be working again with her, Asami told Hiroshi she loved him, a sentiment he immediately returned, before the two of them boarded the same vehicle.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "Zhu Li",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        },
        {
          "body": "hummingbird mecha suit",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Hummingbird_mecha_suit",
            "page": "Hummingbird_mecha_suit"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Relatives",
        "Asami Sato"
      ],
      "text": "When Lin later freed Hiroshi from prison to assist Team Avatar against Kuvira, he showed Asami, Varrick, and Zhu Li how to convert welding torches to plasma saws. Working together on the same hummingbird mecha suit as his daughter and conducting a successful test by cutting a piece of plasma, he was thanked by Asami for all that he had done, though he instantly returned the compliment, praising her for the design of the hummingbird suits. As he emphasized how wonderful he thought it was to be working again with her, Asami told Hiroshi she loved him, a sentiment he immediately returned, before the two of them boarded the same vehicle."
    },
    {
      "body": "During ${link_0}, however, Hiroshi ignored Asami's warning that they needed to leave lest they be crushed. Making a conscious decision to keep on welding as opposed to escaping to safety, he sadly said his goodbyes to Asami and with a final \"I love you\", flipped the switch to her ejection seat. While saving Asami's life, Hiroshi died as he finished his welding work when Kuvira crushed his suit. His death deeply affected his daughter, who later found comfort in the fact that she had at least been able to forgive her father before his death.",
      "links": [
        {
          "body": "battle",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Relatives",
        "Asami Sato"
      ],
      "text": "During battle, however, Hiroshi ignored Asami's warning that they needed to leave lest they be crushed. Making a conscious decision to keep on welding as opposed to escaping to safety, he sadly said his goodbyes to Asami and with a final \"I love you\", flipped the switch to her ejection seat. While saving Asami's life, Hiroshi died as he finished his welding work when Kuvira crushed his suit. His death deeply affected his daughter, who later found comfort in the fact that she had at least been able to forgive her father before his death."
    },
    {
      "body": "Hiroshi Sato met Yasuko sometime before 152 AG, married her, and parented one daughter, Asami, with her. The love he had for her instilled in him a deep hatred toward all benders after she was killed at the hands of an ${link_0} member during the break-in and robbery of their mansion. This resentment prompted him to join the Equalists and develop advanced weapons for them and to express anger whenever somebody said that Yasuko would despise him for his actions, as he lost his temper when Asami stated this during his unsuccessful attempt to recruit her.",
      "links": [
        {
          "body": "Agni Kai Triad",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Agni_Kai_Triad",
            "page": "Agni_Kai_Triad"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Love interests",
        "Yasuko"
      ],
      "text": "Hiroshi Sato met Yasuko sometime before 152 AG, married her, and parented one daughter, Asami, with her. The love he had for her instilled in him a deep hatred toward all benders after she was killed at the hands of an Agni Kai Triad member during the break-in and robbery of their mansion. This resentment prompted him to join the Equalists and develop advanced weapons for them and to express anger whenever somebody said that Yasuko would despise him for his actions, as he lost his temper when Asami stated this during his unsuccessful attempt to recruit her."
    },
    {
      "body": "Hiroshi first joined the ${link_0} sometime after his wife was killed by a group of ${link_1} during a robbery of his estate. Fueled by anger and a desire for revenge against the benders, Hiroshi aided the Equalists by supplying them with new weapons. Hiroshi had a secret ${link_2} under his workshop, to cover his Equalist ties, and was experienced in the creation of weapons, as he had the Satomobile factory. He later revealed his status as an Equalist to his daughter and the council. He held a high position in the Equalist ranks, having been seen with other leaders, including Amon and the ${link_3}, and was a staunch believer in Amon's direction and ideals.",
      "links": [
        {
          "body": "Anti-bending Revolution",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Anti-bending_Revolution",
            "page": "Anti-bending_Revolution"
          }
        },
        {
          "body": "firebenders",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Equalist factory",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Equalist_factory",
            "page": "Equalist_factory"
          }
        },
        {
          "body": "Lieutenant",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Lieutenant",
            "page": "Lieutenant"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Allies",
        "Equalists"
      ],
      "text": "Hiroshi first joined the Anti-bending Revolution sometime after his wife was killed by a group of firebenders during a robbery of his estate. Fueled by anger and a desire for revenge against the benders, Hiroshi aided the Equalists by supplying them with new weapons. Hiroshi had a secret Equalist factory under his workshop, to cover his Equalist ties, and was experienced in the creation of weapons, as he had the Satomobile factory. He later revealed his status as an Equalist to his daughter and the council. He held a high position in the Equalist ranks, having been seen with other leaders, including Amon and the Lieutenant, and was a staunch believer in Amon's direction and ideals."
    },
    {
      "body": "In 158 AG, during a robbery of the Sato estate, Hiroshi's wife was murdered by a member of the Agni Kai Triad. As a result of this incident and the loss of his wife, Hiroshi grew to hate all benders.",
      "links": [],
      "section": [
        "Hiroshi Sato's relationships",
        "Enemies",
        "Agni Kai Triad"
      ],
      "text": "In 158 AG, during a robbery of the Sato estate, Hiroshi's wife was murdered by a member of the Agni Kai Triad. As a result of this incident and the loss of his wife, Hiroshi grew to hate all benders."
    },
    {
      "body": "Hiroshi Sato had offered to personally sponsor the Fire Ferrets in the ${link_0}, after the team incurred financial issues. Following the team's invite to the Sato mansion, however, ${link_1} began to suspect Hiroshi of working for the Equalists, having overheared a phone call he had with an unknown individual after the shutdown of ${link_2}. The businessman ignored the speculation, saying that it was all a misunderstanding. However, Korra, ${link_3}, several ${link_4}, and ${link_5} began to investigate ${link_6} and the mansion at the former's urging. Their investigation turned up a secret factory where Hiroshi was producing weapons for the Equalists, including the electrified gloves and mecha tanks, proving Korra's suspicions to be correct. The invading party subsequently encountered Hiroshi and the Equalists, sparking a fight, in which Hiroshi was successful in stunning them with electric ropes. Following the attack, Hiroshi expressed great distress at seeing his daughter affiliated with a group of benders.",
      "links": [
        {
          "body": "Pro-bending Tournament",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending#Pro-bending_Tournament",
            "page": "Pro-bending"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Cabbage Corp",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Cabbage_Corp",
            "page": "Cabbage_Corp"
          }
        },
        {
          "body": "Lin",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "metalbending officers",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Metalbender_officer",
            "page": "Metalbender_officer"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Future Industries",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries",
            "page": "Future_Industries"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Enemies",
        "Korra"
      ],
      "text": "Hiroshi Sato had offered to personally sponsor the Fire Ferrets in the Pro-bending Tournament, after the team incurred financial issues. Following the team's invite to the Sato mansion, however, Korra began to suspect Hiroshi of working for the Equalists, having overheared a phone call he had with an unknown individual after the shutdown of Cabbage Corp. The businessman ignored the speculation, saying that it was all a misunderstanding. However, Korra, Lin, several metalbending officers, and Tenzin began to investigate Future Industries and the mansion at the former's urging. Their investigation turned up a secret factory where Hiroshi was producing weapons for the Equalists, including the electrified gloves and mecha tanks, proving Korra's suspicions to be correct. The invading party subsequently encountered Hiroshi and the Equalists, sparking a fight, in which Hiroshi was successful in stunning them with electric ropes. Following the attack, Hiroshi expressed great distress at seeing his daughter affiliated with a group of benders."
    },
    {
      "body": "After Korra told Lin about her suspicion of Hiroshi, Lin declared that he did have a motive to do so. Tenzin and Korra accompanied Lin in investigating the case further; however, Hiroshi had a trap set up for them. After being given a tip by a ${link_0} regarding a secret Equalist factory underneath the Sato mansion, they set out to bring it down. When Lin, Tenzin, Korra, and several police officers found the factory, however, Hiroshi ambushed them with ${link_1}.",
      "links": [
        {
          "body": "warehouse worker",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Warehouse_worker",
            "page": "Warehouse_worker"
          }
        },
        {
          "body": "mecha tanks",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_tank",
            "page": "Mecha_tank"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Enemies",
        "Lin Beifong"
      ],
      "text": "After Korra told Lin about her suspicion of Hiroshi, Lin declared that he did have a motive to do so. Tenzin and Korra accompanied Lin in investigating the case further; however, Hiroshi had a trap set up for them. After being given a tip by a warehouse worker regarding a secret Equalist factory underneath the Sato mansion, they set out to bring it down. When Lin, Tenzin, Korra, and several police officers found the factory, however, Hiroshi ambushed them with mecha tanks."
    },
    {
      "body": "Hiroshi first met Mako in his factory when Asami introduced him and explained his background. Initially Hiroshi appeared to believe in the Fire Ferrets' potential and after Asami told her father about Mako's financial situation, he agreed to sponsor the Fire Ferrets, giving them the thirty-thousand ${link_0} the team needed to compete in the tournament. Hiroshi had planned this beforehand, using the sponsorship to cover his status as an Equalist. Later, he fought against Mako in the Equalists' secret factory. After the battle, Hiroshi continued to express his disdain at seeing Asami with Mako.",
      "links": [
        {
          "body": "yuans",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Currency#United_Republic_of_Nations",
            "page": "Currency"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Enemies",
        "Mako"
      ],
      "text": "Hiroshi first met Mako in his factory when Asami introduced him and explained his background. Initially Hiroshi appeared to believe in the Fire Ferrets' potential and after Asami told her father about Mako's financial situation, he agreed to sponsor the Fire Ferrets, giving them the thirty-thousand yuans the team needed to compete in the tournament. Hiroshi had planned this beforehand, using the sponsorship to cover his status as an Equalist. Later, he fought against Mako in the Equalists' secret factory. After the battle, Hiroshi continued to express his disdain at seeing Asami with Mako."
    },
    {
      "body": "Hiroshi was smart enough to cover his true status, even from a ${link_0}. When Korra told Tenzin and Lin Beifong about Hiroshi's phone conversation she had overheard, he concurred with Lin that Sato had the means and a motive for working with the Equalists. However, Hiroshi calmly dismissed these accusations. Tenzin continued to harbor suspicions and decided to inspect Future Industries' factories. That night, Tenzin, Korra, Lin, and several ${link_1} officers found Hiroshi's secret factory, where they were ambushed by the businessman and several other Equalists.",
      "links": [
        {
          "body": "councilman",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "metalbending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Metalbending",
            "page": "Metalbending"
          }
        }
      ],
      "section": [
        "Hiroshi Sato's relationships",
        "Enemies",
        "Tenzin"
      ],
      "text": "Hiroshi was smart enough to cover his true status, even from a councilman. When Korra told Tenzin and Lin Beifong about Hiroshi's phone conversation she had overheard, he concurred with Lin that Sato had the means and a motive for working with the Equalists. However, Hiroshi calmly dismissed these accusations. Tenzin continued to harbor suspicions and decided to inspect Future Industries' factories. That night, Tenzin, Korra, Lin, and several metalbending officers found Hiroshi's secret factory, where they were ambushed by the businessman and several other Equalists."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Hiroshi_Sato%27s_relationships",
    "file": "avatar.wikia.com/wiki/Hiroshi_Sato's_relationships.html",
    "page": "Hiroshi_Sato's_relationships",
    "title": "Hiroshi Sato's relationships"
  }
}