{
  "categories": [
    {
      "body": "Katara",
      "target": {
        "external": false,
        "href": "/wiki/Category_Katara",
        "page": "Category_Katara"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0}, a fourteen-year-old girl living in the ${link_1}, was the only ${link_2} left in her tribe after several Fire Nation ${link_3}. With the death of her mother and the long absence of her father due to the ${link_4}, she was forced to grow up fairly quickly. She grew swiftly in strength and bravery, standing up for what she believes in and still managing to hold on to hope. Her distressed life changed forever when she and her brother discovered the ${link_5}, ${link_6}, frozen in an iceberg. Katara journeyed with Aang and her brother, ${link_7}, to the ${link_8} in the hope of finding a waterbending master to teach herself and Aang.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "waterbender",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "raids",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)"
      ],
      "text": "Katara, a fourteen-year-old girl living in the Southern Water Tribe, was the only waterbender left in her tribe after several Fire Nation raids. With the death of her mother and the long absence of her father due to the Hundred Year War, she was forced to grow up fairly quickly. She grew swiftly in strength and bravery, standing up for what she believes in and still managing to hold on to hope. Her distressed life changed forever when she and her brother discovered the Avatar, Aang, frozen in an iceberg. Katara journeyed with Aang and her brother, Sokka, to the Northern Water Tribe in the hope of finding a waterbending master to teach herself and Aang."
    },
    {
      "body": "Katara was born in 85 ${link_0} to ${link_1} ${link_2} and his wife, ${link_3}. She became their second-born, being one year younger than her brother, Sokka. Prior to the present day, Katara led a normal life and displayed the ability to waterbend. As the last living waterbender in the South Pole, Katara was a source of hope for her war-torn tribe. Hakoda sought out a teacher for her, but there were none to be found in the Southern Water Tribe.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Tribal chief",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Hakoda",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Kya",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Background"
      ],
      "text": "Katara was born in 85 AG to Tribal chief Hakoda and his wife, Kya. She became their second-born, being one year younger than her brother, Sokka. Prior to the present day, Katara led a normal life and displayed the ability to waterbend. As the last living waterbender in the South Pole, Katara was a source of hope for her war-torn tribe. Hakoda sought out a teacher for her, but there were none to be found in the Southern Water Tribe."
    },
    {
      "body": "When Katara was eight, a ${link_0} ${link_1} ${link_2} attacked the tribe in an attempt to kill the last waterbender, who was indeed Katara. Katara's mother, Kya, saved her daughter by lying and claiming herself to be the last waterbender. She was consequently killed by the ${link_3}, leaving her daughter deeply traumatized. After Kya's death, Katara took on a maternal role in the family, filling the void left by her mother. Katara inherited her mother's ${link_4} after her death, and continued to wear it in honor of her mother's memory.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "military",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "unit",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Raiders",
            "page": "Southern_Raiders"
          }
        },
        {
          "body": "commanding officer",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Yon_Rha",
            "page": "Yon_Rha"
          }
        },
        {
          "body": "necklace",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Katara%27s_necklace",
            "page": "Katara%27s_necklace"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Background"
      ],
      "text": "When Katara was eight, a Fire Nation military unit attacked the tribe in an attempt to kill the last waterbender, who was indeed Katara. Katara's mother, Kya, saved her daughter by lying and claiming herself to be the last waterbender. She was consequently killed by the commanding officer, leaving her daughter deeply traumatized. After Kya's death, Katara took on a maternal role in the family, filling the void left by her mother. Katara inherited her mother's necklace after her death, and continued to wear it in honor of her mother's memory."
    },
    {
      "body": "Katara's father left for the ${link_0} to fight in the War when she was twelve, which had a profound emotional impact on the young waterbender. She was raised in the small, diminishing tribe with Sokka, where they were mostly taken care of by their grandmother, ${link_1}, whom they fondly called Gran Gran. While Sokka trained the young boys of the tribe to be ${link_2}, Katara cooked, cleaned, and did the laundry. Even though she did not admit it, she was very motherly and protective of Sokka. Things were not easy for Katara, but she never lost hope that her life would get better, and that the Avatar would return.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Kanna",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kanna",
            "page": "Kanna"
          }
        },
        {
          "body": "warriors",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Background"
      ],
      "text": "Katara's father left for the Earth Kingdom to fight in the War when she was twelve, which had a profound emotional impact on the young waterbender. She was raised in the small, diminishing tribe with Sokka, where they were mostly taken care of by their grandmother, Kanna, whom they fondly called Gran Gran. While Sokka trained the young boys of the tribe to be warriors, Katara cooked, cleaned, and did the laundry. Even though she did not admit it, she was very motherly and protective of Sokka. Things were not easy for Katara, but she never lost hope that her life would get better, and that the Avatar would return."
    },
    {
      "body": "While on a fishing expedition for their village, Katara and Sokka accidentally steered their canoe into a rip current, where it was crushed between ice floes. Sokka blamed Katara for their predicament, and she began to yell angrily about his inconsiderate behavior, gesturing emphatically as she did so. Unknown to her, she was involuntarily waterbending, and she accidentally cracked a massive iceberg directly behind her. A large, spherical underwater portion bobbed to the surface, revealing Aang and a ${link_0} named ${link_1}, both trapped in a state of suspended animation. Katara grabbed Sokka's ${link_2}, and shattered the iceberg to free them. As she did so, a vertical column of bright blue light shot up from their position into the sky like a beacon. The boy climbed out of the ice and collapsed into Katara's arms. He introduced himself as Aang, an ${link_3}, and offered to escort them home on Appa.",
      "links": [
        {
          "body": "flying bison",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Appa",
            "page": "Appa"
          }
        },
        {
          "body": "club",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka%27s_weapons#Battle_club",
            "page": "Sokka%27s_weapons"
          }
        },
        {
          "body": "airbender",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Discovering the Avatar"
      ],
      "text": "While on a fishing expedition for their village, Katara and Sokka accidentally steered their canoe into a rip current, where it was crushed between ice floes. Sokka blamed Katara for their predicament, and she began to yell angrily about his inconsiderate behavior, gesturing emphatically as she did so. Unknown to her, she was involuntarily waterbending, and she accidentally cracked a massive iceberg directly behind her. A large, spherical underwater portion bobbed to the surface, revealing Aang and a flying bison named Appa, both trapped in a state of suspended animation. Katara grabbed Sokka's club, and shattered the iceberg to free them. As she did so, a vertical column of bright blue light shot up from their position into the sky like a beacon. The boy climbed out of the ice and collapsed into Katara's arms. He introduced himself as Aang, an airbender, and offered to escort them home on Appa."
    },
    {
      "body": "The young boy and the siblings returned to the village where the former received tepid reception from the villagers, who had not laid eyes upon an airbender before, thinking they were extinct. After displaying his airbending abilities, Aang quickly won the favor of the village children, although Sokka and Katara's grandmother, Kanna, and Sokka himself remained skeptical of the newcomer. Later on, while trying to persuade an ${link_0} to go ${link_1}, Aang proposed an idea to Katara, saying he would personally fly her to the ${link_2} to master waterbending if she would aid him in catching a penguin. Katara was wary of the idea, but did help him catch a penguin in the end.",
      "links": [
        {
          "body": "otter penguin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Otter_penguin",
            "page": "Otter_penguin"
          }
        },
        {
          "body": "sledding",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Penguin_sledding",
            "page": "Penguin_sledding"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Discovering the Avatar"
      ],
      "text": "The young boy and the siblings returned to the village where the former received tepid reception from the villagers, who had not laid eyes upon an airbender before, thinking they were extinct. After displaying his airbending abilities, Aang quickly won the favor of the village children, although Sokka and Katara's grandmother, Kanna, and Sokka himself remained skeptical of the newcomer. Later on, while trying to persuade an otter penguin to go sledding, Aang proposed an idea to Katara, saying he would personally fly her to the Northern Water Tribe to master waterbending if she would aid him in catching a penguin. Katara was wary of the idea, but did help him catch a penguin in the end."
    },
    {
      "body": "The two went penguin sledding, and incidentally ventured to an abandoned ${link_0} ${link_1}. Katara was hesitant to investigate inside the ship, to which Aang responded that to be a bender, she needed to let go of fear. Katara reluctantly agreed to explore the shipwreck, but doing so had its consequences, as the two accidentally released a flare that signaled the Fire Nation ${link_2}, ${link_3}, of the Avatar's whereabouts.",
      "links": [
        {
          "body": "Fire Nation Navy",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "shipwreck",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Shipwreck",
            "page": "Shipwreck"
          }
        },
        {
          "body": "prince",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Discovering the Avatar"
      ],
      "text": "The two went penguin sledding, and incidentally ventured to an abandoned Fire Nation Navy shipwreck. Katara was hesitant to investigate inside the ship, to which Aang responded that to be a bender, she needed to let go of fear. Katara reluctantly agreed to explore the shipwreck, but doing so had its consequences, as the two accidentally released a flare that signaled the Fire Nation prince, Zuko, of the Avatar's whereabouts."
    },
    {
      "body": "Upon returning to the tribe, Katara tried to defend her new friend from the verbal onslaught of an angry Sokka, but Aang was still banished from the village by her brother. Katara wanted to follow the airbender to travel to the North Pole, but Aang advised her to return to the tribe, not wanting to come between her and her family.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Discovering the Avatar"
      ],
      "text": "Upon returning to the tribe, Katara tried to defend her new friend from the verbal onslaught of an angry Sokka, but Aang was still banished from the village by her brother. Katara wanted to follow the airbender to travel to the North Pole, but Aang advised her to return to the tribe, not wanting to come between her and her family."
    },
    {
      "body": "After her village was attacked by soldiers on a ${link_0} commanded by Prince Zuko, Katara learned that Aang was the Avatar. She and her brother set out to save Aang, who had himself purposefully arrested to save the village. After their successful rescue, she mused that they might find a waterbending teacher at the North Pole, to which Aang quickly brightened up, suggesting they could learn waterbending together. Sokka decided to come along, under the excuse of this being an opportunity to defeat firebenders, and the three began their journey to the North Pole together.",
      "links": [
        {
          "body": "Fire Nation ship",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_cruiser",
            "page": "Fire_Nation_cruiser"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Discovering the Avatar"
      ],
      "text": "After her village was attacked by soldiers on a Fire Nation ship commanded by Prince Zuko, Katara learned that Aang was the Avatar. She and her brother set out to save Aang, who had himself purposefully arrested to save the village. After their successful rescue, she mused that they might find a waterbending teacher at the North Pole, to which Aang quickly brightened up, suggesting they could learn waterbending together. Sokka decided to come along, under the excuse of this being an opportunity to defeat firebenders, and the three began their journey to the North Pole together."
    },
    {
      "body": "Katara, Sokka, and Aang stopped at the ${link_0} because Aang wanted to try and visit his former home. Before entering the temple, Katara attempted to warn him about what he might see, but her efforts did not leave much of an impact on Aang, who still was hoping to see his people. After seeing some signs of the events that had taken place at the temples, she attempted to hide them in hopes of preserving innocence.",
      "links": [
        {
          "body": "Southern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Southern Air Temple"
      ],
      "text": "Katara, Sokka, and Aang stopped at the Southern Air Temple because Aang wanted to try and visit his former home. Before entering the temple, Katara attempted to warn him about what he might see, but her efforts did not leave much of an impact on Aang, who still was hoping to see his people. After seeing some signs of the events that had taken place at the temples, she attempted to hide them in hopes of preserving innocence."
    },
    {
      "body": "Later, Aang took Katara and her brother to a special room filled with statues of past Avatars, which fascinated Katara. The trio also saw a ${link_0}, which Sokka and Aang chased after, but during the chase, Aang came across ${link_1}'s corpse, which caused him to enter the ${link_2}. Katara attempted to console Aang by imparting what she felt when she lost her mother, and even went on to state that even though his people were gone, both she and Sokka were now his family. The words seemed to reach Aang, who came out of the Avatar State and slowly descended back onto the ground. After calming down, Aang introduced Sokka and Katara to the lemur from before who he had since made his pet, naming him \"${link_3}\". While leaving the temple, Aang told Katara and Sokka that he now realized he really was the last airbender.",
      "links": [
        {
          "body": "winged lemur",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Winged_lemur",
            "page": "Winged_lemur"
          }
        },
        {
          "body": "Gyatso",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Gyatso",
            "page": "Gyatso"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Momo",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Momo",
            "page": "Momo"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Southern Air Temple"
      ],
      "text": "Later, Aang took Katara and her brother to a special room filled with statues of past Avatars, which fascinated Katara. The trio also saw a winged lemur, which Sokka and Aang chased after, but during the chase, Aang came across Gyatso's corpse, which caused him to enter the Avatar State. Katara attempted to console Aang by imparting what she felt when she lost her mother, and even went on to state that even though his people were gone, both she and Sokka were now his family. The words seemed to reach Aang, who came out of the Avatar State and slowly descended back onto the ground. After calming down, Aang introduced Sokka and Katara to the lemur from before who he had since made his pet, naming him \"Momo\". While leaving the temple, Aang told Katara and Sokka that he now realized he really was the last airbender."
    },
    {
      "body": "${link_0} stopped at ${link_1} due to Aang wanting to ride the ${link_2}. As soon as Aang saw the elephant koi, he jumped into the water and began to ride the fish, trying to impress Katara. However, while he was in the water, the ${link_3} living near the shore started to attack the elephant koi, along with Aang. Aang narrowly escaped the unagi and ran back to shore. Moments later, they were ambushed by a group of female warriors, known as the ${link_4}. The gang was taken to a nearby village, where they were interrogated by the island's leader, ${link_5}, who assumed them to be Fire Nation spies. Aang told them he was the Avatar and proved this by airbending himself free of the ropes to which he was tied. Upon watching his airbending, the villagers believed him and welcomed the team to their village.",
      "links": [
        {
          "body": "The gang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "elephant koi",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Elephant_koi",
            "page": "Elephant_koi"
          }
        },
        {
          "body": "unagi",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Unagi",
            "page": "Unagi"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Oyaji",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Oyaji",
            "page": "Oyaji"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Kyoshi Island"
      ],
      "text": "The gang stopped at Kyoshi Island due to Aang wanting to ride the elephant koi. As soon as Aang saw the elephant koi, he jumped into the water and began to ride the fish, trying to impress Katara. However, while he was in the water, the unagi living near the shore started to attack the elephant koi, along with Aang. Aang narrowly escaped the unagi and ran back to shore. Moments later, they were ambushed by a group of female warriors, known as the Kyoshi Warriors. The gang was taken to a nearby village, where they were interrogated by the island's leader, Oyaji, who assumed them to be Fire Nation spies. Aang told them he was the Avatar and proved this by airbending himself free of the ropes to which he was tied. Upon watching his airbending, the villagers believed him and welcomed the team to their village."
    },
    {
      "body": "Katara and her friends were treated like royalty, which prompted the young waterbender to issue a stern warning to Aang not to grow too comfortable with their new lifestyle. Aang did not heed to this warning and soon became swallowed up by fame and glory. Only when Prince Zuko arrived at the island, seeking to capture the Avatar, did Aang realize the error of his ways. He and rest of the team managed to successfully flee the island with Aang using the unagi to extinguish the fires consuming the village.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Kyoshi Island"
      ],
      "text": "Katara and her friends were treated like royalty, which prompted the young waterbender to issue a stern warning to Aang not to grow too comfortable with their new lifestyle. Aang did not heed to this warning and soon became swallowed up by fame and glory. Only when Prince Zuko arrived at the island, seeking to capture the Avatar, did Aang realize the error of his ways. He and rest of the team managed to successfully flee the island with Aang using the unagi to extinguish the fires consuming the village."
    },
    {
      "body": "After leaving Kyoshi Island, Aang, Katara, and Sokka flew to the great Earth Kingdom metropolis of ${link_0}, a grand city and stronghold boasting a superb ${link_1}. Entering the city under individual aliases, the Avatar and his friends decided to take a joy ride through the city on one of the mail carts. The ride resulted in considerable damage to various homes and shops throughout Omashu and the trio's arrest. They were brought before the elderly ${link_2} of the city who, much to their surprise, treated them as royalty and threw a feast for them.",
      "links": [
        {
          "body": "Omashu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "mailing system",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Omashu_delivery_system",
            "page": "Omashu_delivery_system"
          }
        },
        {
          "body": "king",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/King_of_Omashu",
            "page": "King_of_Omashu"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Omashu"
      ],
      "text": "After leaving Kyoshi Island, Aang, Katara, and Sokka flew to the great Earth Kingdom metropolis of Omashu, a grand city and stronghold boasting a superb mailing system. Entering the city under individual aliases, the Avatar and his friends decided to take a joy ride through the city on one of the mail carts. The ride resulted in considerable damage to various homes and shops throughout Omashu and the trio's arrest. They were brought before the elderly king of the city who, much to their surprise, treated them as royalty and threw a feast for them."
    },
    {
      "body": "When Aang unintentionally revealed himself to be the Avatar, the king ordered the three to be confined within a newly refurbished prison chamber, and challenged Aang with three deadly tasks. To add to the pressure, the king had pure ${link_0} rings placed over both Katara and Sokka's fingers. The jennamite rings proved impossible to remove and slowly grew to encase their entire bodies. Aang was able to successfully complete all three challenges as well as an additional assignment, which was to identify the king's name, whom he learned was his old friend, ${link_1}, from before the War. Sokka and Katara were thus saved and the trio eventually left the city to continue on their travels.",
      "links": [
        {
          "body": "jennamite",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jennamite",
            "page": "Jennamite"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Omashu"
      ],
      "text": "When Aang unintentionally revealed himself to be the Avatar, the king ordered the three to be confined within a newly refurbished prison chamber, and challenged Aang with three deadly tasks. To add to the pressure, the king had pure jennamite rings placed over both Katara and Sokka's fingers. The jennamite rings proved impossible to remove and slowly grew to encase their entire bodies. Aang was able to successfully complete all three challenges as well as an additional assignment, which was to identify the king's name, whom he learned was his old friend, Bumi, from before the War. Sokka and Katara were thus saved and the trio eventually left the city to continue on their travels."
    },
    {
      "body": "Aang, Katara, and Sokka were gathered in their campsite and were suddenly startled by loud noises coming from the distance. Aang and Katara were curious, and set out to investigate with a less cooperative Sokka right behind. They found that the noises were caused by a young ${link_0} practicing his ${link_1}. Katara introduced herself, but before she could finish, the young bender raced off, seeming very fearful.",
      "links": [
        {
          "body": "earthbender",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "bending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Haru and the imprisoned earthbenders"
      ],
      "text": "Aang, Katara, and Sokka were gathered in their campsite and were suddenly startled by loud noises coming from the distance. Aang and Katara were curious, and set out to investigate with a less cooperative Sokka right behind. They found that the noises were caused by a young earthbender practicing his bending. Katara introduced herself, but before she could finish, the young bender raced off, seeming very fearful."
    },
    {
      "body": "Katara decided that they should follow him, and they ended up in a ${link_0} that happened to be under Fire Nation control. They spotted found the same young man and followed him into a store. He was talking to ${link_1} when Katara, Aang, and Sokka entered the store, asking why he ran. He told them that his name was ${link_2}, and his mother explained that since the Fire Nation took control of the town, anyone discovered to be an earthbender was arrested and sent to a ${link_3} far from the shore. Haru informed them that ${link_4} was sent to the rig several years before.",
      "links": [
        {
          "body": "small town",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mining_village",
            "page": "Mining_village"
          }
        },
        {
          "body": "his mother",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Haru%27s_mother",
            "page": "Haru%27s_mother"
          }
        },
        {
          "body": "Haru",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Haru",
            "page": "Haru"
          }
        },
        {
          "body": "prison rig",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Prison_rig",
            "page": "Prison_rig"
          }
        },
        {
          "body": "his father",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Tyro",
            "page": "Tyro"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Haru and the imprisoned earthbenders"
      ],
      "text": "Katara decided that they should follow him, and they ended up in a small town that happened to be under Fire Nation control. They spotted found the same young man and followed him into a store. He was talking to his mother when Katara, Aang, and Sokka entered the store, asking why he ran. He told them that his name was Haru, and his mother explained that since the Fire Nation took control of the town, anyone discovered to be an earthbender was arrested and sent to a prison rig far from the shore. Haru informed them that his father was sent to the rig several years before."
    },
    {
      "body": "Later on that day, Haru and Katara walked with each other, both sharing their own stories and quickly becoming friends. They suddenly came across an old man that had been trapped by a cave-in. After Katara convinced him to do so, Haru reluctantly used his earthbending to save the old man.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Haru and the imprisoned earthbenders"
      ],
      "text": "Later on that day, Haru and Katara walked with each other, both sharing their own stories and quickly becoming friends. They suddenly came across an old man that had been trapped by a cave-in. After Katara convinced him to do so, Haru reluctantly used his earthbending to save the old man."
    },
    {
      "body": "The next morning, Katara woke up to get some water when Haru's mother told her that the old man Haru had saved told the Fire Nation that he was an earthbender. The Fire Nation had arrested Haru and sent him to the prison rig. Once Katara learned of Haru's situation, she wanted to take action and find a way onto the rig. She decided the only solution was to convince the Fire Nation she was an earthbender. After some strategy, she was able to \"earthbend\" with the help of Aang and some ventilation pipes while the ${link_0} and two other Fire Nation soldiers were watching. The soldiers captured her and she was sent to the rig. There, she and some other captives met the ${link_1}, a self-important and cruel taskmaster. He stated that since the entire rig was made of metal, they were helpless because there was nothing for the earthbenders to control.",
      "links": [
        {
          "body": "prison rig captain",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Prison_rig_captain",
            "page": "Prison_rig_captain"
          }
        },
        {
          "body": "warden",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Warden_(prison_rig)",
            "page": "Warden_(prison_rig)"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Haru and the imprisoned earthbenders"
      ],
      "text": "The next morning, Katara woke up to get some water when Haru's mother told her that the old man Haru had saved told the Fire Nation that he was an earthbender. The Fire Nation had arrested Haru and sent him to the prison rig. Once Katara learned of Haru's situation, she wanted to take action and find a way onto the rig. She decided the only solution was to convince the Fire Nation she was an earthbender. After some strategy, she was able to \"earthbend\" with the help of Aang and some ventilation pipes while the prison rig captain and two other Fire Nation soldiers were watching. The soldiers captured her and she was sent to the rig. There, she and some other captives met the warden, a self-important and cruel taskmaster. He stated that since the entire rig was made of metal, they were helpless because there was nothing for the earthbenders to control."
    },
    {
      "body": "After finding Haru and his father Tyro, Katara asked what their plan was to escape. Tyro said that escape was not an option; the only way to survive was to do what they were told and hope the War went in their favor. Shocked by his lack of hope, Katara gave an inspirational speech to try and stir life in the spirits of the other benders on the rig, but to no avail. That night, Katara met up with Aang and Sokka to try and find a way for the prisoners to fight back and gain their confidence. Aang noticed that there were smoke stacks and stated that they were burning coal; therefore, there was earth on the rig that the prisoners could bend.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Haru and the imprisoned earthbenders"
      ],
      "text": "After finding Haru and his father Tyro, Katara asked what their plan was to escape. Tyro said that escape was not an option; the only way to survive was to do what they were told and hope the War went in their favor. Shocked by his lack of hope, Katara gave an inspirational speech to try and stir life in the spirits of the other benders on the rig, but to no avail. That night, Katara met up with Aang and Sokka to try and find a way for the prisoners to fight back and gain their confidence. Aang noticed that there were smoke stacks and stated that they were burning coal; therefore, there was earth on the rig that the prisoners could bend."
    },
    {
      "body": "Drawing from her experience from the fake earthbending she used to get herself arrested, they had Aang close all the vents around the fire, save for one that led to the outer vent where Katara and Sokka were. The warden soon discovered them and stated that they were to surrender or die. As if on cue, the coal burst from the vent and landed in front of Haru and the others. Katara told them that this was their chance to stand up and fight, but no one seemed to have the will to fight anymore.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Haru and the imprisoned earthbenders"
      ],
      "text": "Drawing from her experience from the fake earthbending she used to get herself arrested, they had Aang close all the vents around the fire, save for one that led to the outer vent where Katara and Sokka were. The warden soon discovered them and stated that they were to surrender or die. As if on cue, the coal burst from the vent and landed in front of Haru and the others. Katara told them that this was their chance to stand up and fight, but no one seemed to have the will to fight anymore."
    },
    {
      "body": "The warden gloated that their spirits were broken a long time ago and walked away in triumph, only to have a chunk of coal strike him on the head. He turned around to see that it was Haru who threw it. The warden attacked Haru, but his attack was blocked by Tyro and two other benders. Subsequently, the prisoners all attacked the Fire Nation soldiers together. After a dramatic fight, the earthbenders threw the warden overboard and were victorious. They escaped the rig by sailing off in stolen Fire Nation ships.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Haru and the imprisoned earthbenders"
      ],
      "text": "The warden gloated that their spirits were broken a long time ago and walked away in triumph, only to have a chunk of coal strike him on the head. He turned around to see that it was Haru who threw it. The warden attacked Haru, but his attack was blocked by Tyro and two other benders. Subsequently, the prisoners all attacked the Fire Nation soldiers together. After a dramatic fight, the earthbenders threw the warden overboard and were victorious. They escaped the rig by sailing off in stolen Fire Nation ships."
    },
    {
      "body": "After winning their freedom, Tyro thanked Katara for giving his people hope again, followed by Haru. She was touched by Haru's words, but shortly thereafter noticed with shock that her mother's necklace was gone. Back on the rig, Katara's necklace was picked up by Zuko. With a blank look, he clutched the necklace and looked out toward the horizon.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Haru and the imprisoned earthbenders"
      ],
      "text": "After winning their freedom, Tyro thanked Katara for giving his people hope again, followed by Haru. She was touched by Haru's words, but shortly thereafter noticed with shock that her mother's necklace was gone. Back on the rig, Katara's necklace was picked up by Zuko. With a blank look, he clutched the necklace and looked out toward the horizon."
    },
    {
      "body": "The team made their way to ${link_0} after an ${link_1} found them in a ${link_2}. It was revealed that a black and white spirit named ${link_3} was terrorizing it, and that Aang needed to end the attacks. While it was on a rampage, Sokka tried to assist Aang, but was kidnapped by the Hei Bai and found himself trapped in the ${link_4} for twenty-four hours. Aang was ultimately able to halt the spirit's rampage, thus freeing him and the other kidnapped villagers.",
      "links": [
        {
          "body": "Senlin Village",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Senlin_Village",
            "page": "Senlin_Village"
          }
        },
        {
          "body": "old wanderer",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Old_wanderer",
            "page": "Old_wanderer"
          }
        },
        {
          "body": "charred forest",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Scorched_forest",
            "page": "Scorched_forest"
          }
        },
        {
          "body": "Hei Bai",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Hei_Bai",
            "page": "Hei_Bai"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "The winter solstice"
      ],
      "text": "The team made their way to Senlin Village after an old wanderer found them in a charred forest. It was revealed that a black and white spirit named Hei Bai was terrorizing it, and that Aang needed to end the attacks. While it was on a rampage, Sokka tried to assist Aang, but was kidnapped by the Hei Bai and found himself trapped in the Spirit World for twenty-four hours. Aang was ultimately able to halt the spirit's rampage, thus freeing him and the other kidnapped villagers."
    },
    {
      "body": "Katara and Sokka later accompanied Aang to the ${link_0} in the Fire Nation so Aang could speak to Roku during the ${link_1}. They bravely fought their way past ${link_2}'s fleet, with the ${link_3} intent on capturing the Avatar.",
      "links": [
        {
          "body": "Fire Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Temple",
            "page": "Fire_Temple"
          }
        },
        {
          "body": "winter solstice",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Winter_solstice",
            "page": "Winter_solstice"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "commander",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Commander",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "The winter solstice"
      ],
      "text": "Katara and Sokka later accompanied Aang to the Fire Temple in the Fire Nation so Aang could speak to Roku during the winter solstice. They bravely fought their way past Zhao's fleet, with the commander intent on capturing the Avatar."
    },
    {
      "body": "They entered the temple and found that the ${link_0} were trying to capture them. After a chase, they discovered ${link_1}, a sage who was still loyal to their original purpose of protecting the Avatar. The team followed Shyu to the chamber where Aang could speak with Avatar ${link_2}.",
      "links": [
        {
          "body": "Fire Sages",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Shyu",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Shyu",
            "page": "Shyu"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Roku",
            "page": "Roku"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "The winter solstice"
      ],
      "text": "They entered the temple and found that the Fire Sages were trying to capture them. After a chase, they discovered Shyu, a sage who was still loyal to their original purpose of protecting the Avatar. The team followed Shyu to the chamber where Aang could speak with Avatar Roku."
    },
    {
      "body": "When they were able to reach the chamber, however, the found that the door could only be opened by firebending. Sokka used five of his bombs to imitate the art, but the door did not open. However, one of his statements gave Katara the idea to send Momo, who could get inside the door and lead the Fire Sages to open the door themselves. When the door was finally opened, Aang could not enter it, as he was captured by Zuko. The Fire Sage he was holding took advantage of this distraction and now held the Avatar's friends down. Aang managed to escape from Zuko, and was able to speak with Avatar Roku, who warned him of an impending ${link_0} that would grant the firebenders unbelievable power, and would allow them to win the War. When his discussion with the previous Avatar ended, Roku helped him by taking over his successor's body. He defeated the Fire Sages and Zhao, and also melted the chains which bound the Water Tribe siblings and Shyu. They helped Aang get up when Roku's manifestation in Aang ended, and they escaped on Appa.",
      "links": [
        {
          "body": "comet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "The winter solstice"
      ],
      "text": "When they were able to reach the chamber, however, the found that the door could only be opened by firebending. Sokka used five of his bombs to imitate the art, but the door did not open. However, one of his statements gave Katara the idea to send Momo, who could get inside the door and lead the Fire Sages to open the door themselves. When the door was finally opened, Aang could not enter it, as he was captured by Zuko. The Fire Sage he was holding took advantage of this distraction and now held the Avatar's friends down. Aang managed to escape from Zuko, and was able to speak with Avatar Roku, who warned him of an impending comet that would grant the firebenders unbelievable power, and would allow them to win the War. When his discussion with the previous Avatar ended, Roku helped him by taking over his successor's body. He defeated the Fire Sages and Zhao, and also melted the chains which bound the Water Tribe siblings and Shyu. They helped Aang get up when Roku's manifestation in Aang ended, and they escaped on Appa."
    },
    {
      "body": "At a ${link_0}, Katara began to teach Aang her knowledge of waterbending. Aang immediately mastered the lessons she gave him, despite the fact that it took her much more time to master them. Although she tried to hide it, she grew jealous of Aang's natural talent.",
      "links": [
        {
          "body": "waterfall lagoon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Waterfall_lagoon",
            "page": "Waterfall_lagoon"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Waterbending scroll"
      ],
      "text": "At a waterfall lagoon, Katara began to teach Aang her knowledge of waterbending. Aang immediately mastered the lessons she gave him, despite the fact that it took her much more time to master them. Although she tried to hide it, she grew jealous of Aang's natural talent."
    },
    {
      "body": "Katara came across a ${link_0} on a ${link_1} which, featuring several waterbending techniques including the single water whip, was among the loot the pirates had stolen. The pirates were reserving the scroll for a wealthy client in the Earth Kingdom, though he offered it to them if they had two hundred gold pieces on them that moment. Unable to pay for the item, they left the ship, only to be chased by the crew. Aang and the others escaped, only to find the reason they had been pursued: The pirates wanted the scroll Katara had stolen. Katara convinced Sokka and Aang to keep the scroll so she and Aang could learn from it. She ended up growing even more jealous of Aang, as not only did he learn the techniques easily, she herself had trouble mastering them. Her temper got the better of her, and she snapped furiously at the young airbender before realizing her mistake and apologizing. She offered up the scroll to him, claiming she wanted nothing to do with the item.",
      "links": [
        {
          "body": "waterbending scroll",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending_scroll",
            "page": "Waterbending_scroll"
          }
        },
        {
          "body": "pirate ship",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pirate_ship_boutique",
            "page": "Pirate_ship_boutique"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Waterbending scroll"
      ],
      "text": "Katara came across a waterbending scroll on a pirate ship which, featuring several waterbending techniques including the single water whip, was among the loot the pirates had stolen. The pirates were reserving the scroll for a wealthy client in the Earth Kingdom, though he offered it to them if they had two hundred gold pieces on them that moment. Unable to pay for the item, they left the ship, only to be chased by the crew. Aang and the others escaped, only to find the reason they had been pursued: The pirates wanted the scroll Katara had stolen. Katara convinced Sokka and Aang to keep the scroll so she and Aang could learn from it. She ended up growing even more jealous of Aang, as not only did he learn the techniques easily, she herself had trouble mastering them. Her temper got the better of her, and she snapped furiously at the young airbender before realizing her mistake and apologizing. She offered up the scroll to him, claiming she wanted nothing to do with the item."
    },
    {
      "body": "As night fell, however, temptation overpowered her, and she crept down to the water along with the scroll. Her frustrated cries as she unsuccessfully tried to perfect the water whip drew the attention of Prince Zuko and the pirates, who happened to be nearby. Zuko and one of the pirates ambushed Katara, and Katara was tied to a tree. Attempting to interrogate her for information on the Avatar, he tried to bribe her with her mother's lost betrothal necklace, the last tie that she had to her mother, in exchange for the location of Aang. When she refused to reveal where Aang was, Zuko kept her mother's necklace in his possession. However, the pirates demanded the scroll. Zuko threatened to destroy it if they did not find Aang and coerced them into supporting his search. After a brutal fight broke out between the pirates and Zuko over the right to keep the Avatar in their possession, Katara escaped from the enemies with the help of Aang and Sokka, who had also been briefly captured. Later, Katara gave Aang a full apology, while Sokka revealed that he was able to regain the scroll in the fighting. Before he gave it to her, he asked what she had learned. She said that \"stealing is wrong\", but when Sokka handed her the scroll, she quickly added \"unless it's from pirates.\"",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Waterbending scroll"
      ],
      "text": "As night fell, however, temptation overpowered her, and she crept down to the water along with the scroll. Her frustrated cries as she unsuccessfully tried to perfect the water whip drew the attention of Prince Zuko and the pirates, who happened to be nearby. Zuko and one of the pirates ambushed Katara, and Katara was tied to a tree. Attempting to interrogate her for information on the Avatar, he tried to bribe her with her mother's lost betrothal necklace, the last tie that she had to her mother, in exchange for the location of Aang. When she refused to reveal where Aang was, Zuko kept her mother's necklace in his possession. However, the pirates demanded the scroll. Zuko threatened to destroy it if they did not find Aang and coerced them into supporting his search. After a brutal fight broke out between the pirates and Zuko over the right to keep the Avatar in their possession, Katara escaped from the enemies with the help of Aang and Sokka, who had also been briefly captured. Later, Katara gave Aang a full apology, while Sokka revealed that he was able to regain the scroll in the fighting. Before he gave it to her, he asked what she had learned. She said that \"stealing is wrong\", but when Sokka handed her the scroll, she quickly added \"unless it's from pirates.\""
    },
    {
      "body": "While walking through the forest, Katara and her friends wandered into a campsite of Fire Nation soldiers. However, a group of children led by a teenage boy wielding ${link_0} suddenly descended from the trees and began combating the Fire Nation soldiers. The leader introduced himself as ${link_1} and his allies as the ${link_2}. Katara very quickly developed a crush on Jet and shamelessly flattered him briefly. As Katara and Jet spoke, in the process indirectly insulting Sokka's instinctual behavior, ${link_3} and ${link_4} raided the now-abandoned Fire Nation campsite, finding crates filled with jelly candy and barrels of explosive ${link_5}. When the Freedom Fighters mentioned bringing their score back to the ${link_6}, Aang expressed interest, and Jet invited them to come. Katara eagerly accepted on behalf of the group. Katara expressed further infatuation with Jet, temperately praising his bravery, which provoked a sarcastic comment from Sokka.",
      "links": [
        {
          "body": "dual hook swords",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hook_swords",
            "page": "Hook_swords"
          }
        },
        {
          "body": "Jet",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jet",
            "page": "Jet"
          }
        },
        {
          "body": "Freedom Fighters",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Freedom_Fighters",
            "page": "Freedom_Fighters"
          }
        },
        {
          "body": "The Duke",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/The_Duke",
            "page": "The_Duke"
          }
        },
        {
          "body": "Pipsqueak",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Pipsqueak",
            "page": "Pipsqueak"
          }
        },
        {
          "body": "blasting jelly",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Blasting_jelly",
            "page": "Blasting_jelly"
          }
        },
        {
          "body": "hideout",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Treetop_hideout",
            "page": "Treetop_hideout"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Jet"
      ],
      "text": "While walking through the forest, Katara and her friends wandered into a campsite of Fire Nation soldiers. However, a group of children led by a teenage boy wielding dual hook swords suddenly descended from the trees and began combating the Fire Nation soldiers. The leader introduced himself as Jet and his allies as the Freedom Fighters. Katara very quickly developed a crush on Jet and shamelessly flattered him briefly. As Katara and Jet spoke, in the process indirectly insulting Sokka's instinctual behavior, The Duke and Pipsqueak raided the now-abandoned Fire Nation campsite, finding crates filled with jelly candy and barrels of explosive blasting jelly. When the Freedom Fighters mentioned bringing their score back to the hideout, Aang expressed interest, and Jet invited them to come. Katara eagerly accepted on behalf of the group. Katara expressed further infatuation with Jet, temperately praising his bravery, which provoked a sarcastic comment from Sokka."
    },
    {
      "body": "After Sokka saw Jet mistreating an ${link_0}, he announced that they were leaving. Aang and Katara objected, to which Sokka responded by revealing Jet's previous bullying action. Doubtful, Katara demanded to hear Jet's side of the story. Jet reiterated that the man was with the Fire Nation and produced a ${link_1}, which had a compartment for poison in the hilt. He claimed that the man was an assassin, sent especially to kill him. Sokka was still angry and heavily doubted Jet's story, stating that he never saw a knife on the man's person, although the explanation convinced Katara and Aang. Sokka stormed off, stating that he would be preparing to leave. Upon his departure, Jet quickly pleaded for Katara and Aang to stay, stating that the Fire Nation planned to burn down the forest; he needed the two to use waterbending to fill the nearby reservoir, which would allow the Freedom Fighters to quench the fires.",
      "links": [
        {
          "body": "old man",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Old_Fire_Nation_civilian",
            "page": "Old_Fire_Nation_civilian"
          }
        },
        {
          "body": "knife",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Poison_knife",
            "page": "Poison_knife"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Jet"
      ],
      "text": "After Sokka saw Jet mistreating an old man, he announced that they were leaving. Aang and Katara objected, to which Sokka responded by revealing Jet's previous bullying action. Doubtful, Katara demanded to hear Jet's side of the story. Jet reiterated that the man was with the Fire Nation and produced a knife, which had a compartment for poison in the hilt. He claimed that the man was an assassin, sent especially to kill him. Sokka was still angry and heavily doubted Jet's story, stating that he never saw a knife on the man's person, although the explanation convinced Katara and Aang. Sokka stormed off, stating that he would be preparing to leave. Upon his departure, Jet quickly pleaded for Katara and Aang to stay, stating that the Fire Nation planned to burn down the forest; he needed the two to use waterbending to fill the nearby reservoir, which would allow the Freedom Fighters to quench the fires."
    },
    {
      "body": "That night, Sokka overheard Jet and the core of the Freedom Fighters sneaking out of their base and decided to follow them. The six brought with them the barrels of blasting jelly on a cart, and Jet reviewed their plan: to blow up the barrels directly beneath the dam of a river, which ran through ${link_0}. With the reservoir full, the village would be flooded, wiping out the Fire Nation soldiers stationed there as well as all the villagers living there. After Sokka was discovered, Pipsqueak and ${link_1} walked him into the forest so as to prevent him from warning Aang and Katara of the plan.",
      "links": [
        {
          "body": "a nearby city",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Gaipan",
            "page": "Gaipan"
          }
        },
        {
          "body": "Smellerbee",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Smellerbee",
            "page": "Smellerbee"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Jet"
      ],
      "text": "That night, Sokka overheard Jet and the core of the Freedom Fighters sneaking out of their base and decided to follow them. The six brought with them the barrels of blasting jelly on a cart, and Jet reviewed their plan: to blow up the barrels directly beneath the dam of a river, which ran through a nearby city. With the reservoir full, the village would be flooded, wiping out the Fire Nation soldiers stationed there as well as all the villagers living there. After Sokka was discovered, Pipsqueak and Smellerbee walked him into the forest so as to prevent him from warning Aang and Katara of the plan."
    },
    {
      "body": "Soon afterward, Jet led Aang and Katara to an extremely shallow river which led into the reservoir. Katara, still unaware of Jet's true plans, apologized for Sokka's crude behavior, to which Jet responded by lying that Sokka had already apologized for himself, their dispute was resolved, and Sokka was currently out scouting with Smellerbee and Pipsqueak. Although Aang and Katara found it strange that Sokka would be so quick to apologize, they did not question Jet's word. Katara initially doubted her ability to bend water that she could not see, but Jet provided her with words of encouragement, accompanied by his hands on her shoulders, and soon she and Aang successfully released the water from one of the vents. Jet left and Aang and Katara decided, after releasing water from several more vents, to go to meet Jet at the reservoir.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Jet"
      ],
      "text": "Soon afterward, Jet led Aang and Katara to an extremely shallow river which led into the reservoir. Katara, still unaware of Jet's true plans, apologized for Sokka's crude behavior, to which Jet responded by lying that Sokka had already apologized for himself, their dispute was resolved, and Sokka was currently out scouting with Smellerbee and Pipsqueak. Although Aang and Katara found it strange that Sokka would be so quick to apologize, they did not question Jet's word. Katara initially doubted her ability to bend water that she could not see, but Jet provided her with words of encouragement, accompanied by his hands on her shoulders, and soon she and Aang successfully released the water from one of the vents. Jet left and Aang and Katara decided, after releasing water from several more vents, to go to meet Jet at the reservoir."
    },
    {
      "body": "Aang and Katara came to the edge of a cliff overlooking the dam, where they spotted four Freedom Fighters setting up the barrels of blasting jelly. Aang immediately realized Jet's plan and moved to fly down and stop it on his glider. Katara, however, was in denial until Jet jumped forward and snagged ${link_0} with his hook-swords, preventing the boy from flying off. Jet confessed what his true plan was and attempted to convince Katara that the action was necessary. He said that Sokka did not understand, but was cut off by Katara, who immediately demanded to know where Sokka was, tears beginning to flow from her eyes. Jet placed a comforting hand on her cheek, but Katara had had enough; she drew water from her ${link_1} and used it to violently throw Jet to the ground.",
      "links": [
        {
          "body": "Aang's glider",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Airbender_staff",
            "page": "Airbender_staff"
          }
        },
        {
          "body": "water skin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Water_skin",
            "page": "Water_skin"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Jet"
      ],
      "text": "Aang and Katara came to the edge of a cliff overlooking the dam, where they spotted four Freedom Fighters setting up the barrels of blasting jelly. Aang immediately realized Jet's plan and moved to fly down and stop it on his glider. Katara, however, was in denial until Jet jumped forward and snagged Aang's glider with his hook-swords, preventing the boy from flying off. Jet confessed what his true plan was and attempted to convince Katara that the action was necessary. He said that Sokka did not understand, but was cut off by Katara, who immediately demanded to know where Sokka was, tears beginning to flow from her eyes. Jet placed a comforting hand on her cheek, but Katara had had enough; she drew water from her water skin and used it to violently throw Jet to the ground."
    },
    {
      "body": "Katara bent water from a small nearby stream to aggressively attack Jet, pushing him back toward a tree and freezing him to its trunk. Even so, Jet was able to make the signal for the plan to start. Aang and Katara could only wait and hope that Sokka had succeeded where they had failed.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Jet"
      ],
      "text": "Katara bent water from a small nearby stream to aggressively attack Jet, pushing him back toward a tree and freezing him to its trunk. Even so, Jet was able to make the signal for the plan to start. Aang and Katara could only wait and hope that Sokka had succeeded where they had failed."
    },
    {
      "body": "In mere seconds, the village was completely flooded. Sad, hurt, and angry, Katara turned on Jet and resumed insulting him for his actions; still, Jet did not back down, stating that this act was a victory against the Fire Nation, who will forever be absent from the valley, which would be safe. Suddenly, Sokka arrived, riding Appa and accompanied by ${link_0}. He told how he helped save the village from the flood by warning the villagers and evacuating them all out in time. Jet asked for Katara's help, but all she said was goodbye and turned her back on him. She, Aang, and Sokka flew off on Appa, leaving the leader of the Freedom Fighters frozen against the tree.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Momo",
            "page": "Momo"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Jet"
      ],
      "text": "In mere seconds, the village was completely flooded. Sad, hurt, and angry, Katara turned on Jet and resumed insulting him for his actions; still, Jet did not back down, stating that this act was a victory against the Fire Nation, who will forever be absent from the valley, which would be safe. Suddenly, Sokka arrived, riding Appa and accompanied by Momo. He told how he helped save the village from the flood by warning the villagers and evacuating them all out in time. Jet asked for Katara's help, but all she said was goodbye and turned her back on him. She, Aang, and Sokka flew off on Appa, leaving the leader of the Freedom Fighters frozen against the tree."
    },
    {
      "body": "Katara and the others continued their travels to the North Pole, briefly stopping to set up camp. Katara and Sokka began arguing over the chores to set up camp, and Aang was able to end the feud by stating, \"Harsh words won't solve problems, action will.\" The next day, the group came to the ${link_0}, the largest canyon in the Earth Kingdom, and Katara expressed great appreciation for the fascinating view it provided. While there, they met two tribes, the ${link_1} and the ${link_2}, both of whom were differing in their culture and had been feuding for the past one hundred years. Aang was eventually able to persuade them into traversing the canyon on foot. Sokka favored the Zhang as opposed to Katara, who favored the Gan Jin, stating he only chose their side because they fed him overnight. He joined the two tribes in a combined effort to harness the predatory ${link_3} that inhabited the canyon and the entirety of the traveling group was able to successfully escape the gorge by riding atop their backs. The Water Tribe warrior was later present to witness Aang devise a false story to settle the feud between the two tribes.",
      "links": [
        {
          "body": "Great Divide",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Great_Divide",
            "page": "Great_Divide"
          }
        },
        {
          "body": "Zhang",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zhang",
            "page": "Zhang"
          }
        },
        {
          "body": "Gan Jin",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Gan_Jin",
            "page": "Gan_Jin"
          }
        },
        {
          "body": "canyon crawlers",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Canyon_crawler",
            "page": "Canyon_crawler"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "The Great Divide and the storm"
      ],
      "text": "Katara and the others continued their travels to the North Pole, briefly stopping to set up camp. Katara and Sokka began arguing over the chores to set up camp, and Aang was able to end the feud by stating, \"Harsh words won't solve problems, action will.\" The next day, the group came to the Great Divide, the largest canyon in the Earth Kingdom, and Katara expressed great appreciation for the fascinating view it provided. While there, they met two tribes, the Zhang and the Gan Jin, both of whom were differing in their culture and had been feuding for the past one hundred years. Aang was eventually able to persuade them into traversing the canyon on foot. Sokka favored the Zhang as opposed to Katara, who favored the Gan Jin, stating he only chose their side because they fed him overnight. He joined the two tribes in a combined effort to harness the predatory canyon crawlers that inhabited the canyon and the entirety of the traveling group was able to successfully escape the gorge by riding atop their backs. The Water Tribe warrior was later present to witness Aang devise a false story to settle the feud between the two tribes."
    },
    {
      "body": "Later on, while camping out on a beach, the team discovered they were out of food and flew to a marketplace in a ${link_0}. The three ran into a ${link_1} and ${link_2}, and the former hired Sokka to go on a fishing expedition with him. However, when the fisherman discovered that Aang was the Avatar, he yelled at him for turning his back on the world for a century, to which Aang promptly became upset at and flew away. Katara reprimanded the man for his harshness, and left to find Aang.",
      "links": [
        {
          "body": "harbor town",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Harbor_town",
            "page": "Harbor_town"
          }
        },
        {
          "body": "fisherman",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fisherman",
            "page": "Fisherman"
          }
        },
        {
          "body": "his wife",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fisherman%27s_wife",
            "page": "Fisherman%27s_wife"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "The Great Divide and the storm"
      ],
      "text": "Later on, while camping out on a beach, the team discovered they were out of food and flew to a marketplace in a harbor town. The three ran into a fisherman and his wife, and the former hired Sokka to go on a fishing expedition with him. However, when the fisherman discovered that Aang was the Avatar, he yelled at him for turning his back on the world for a century, to which Aang promptly became upset at and flew away. Katara reprimanded the man for his harshness, and left to find Aang."
    },
    {
      "body": "A bad storm began to encompass the area as Katara found Aang in a small cave. Aang began telling Katara about his past; he ran away because the monks tried to separate him from his mentor and guardian, Gyatso, and froze himself in ice while in the Avatar State since he was about to drown. Aang felt tremendous guilt, as he thought that he did turn his back on the world, but Katara comforted him by saying that he gives people hope.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "The Great Divide and the storm"
      ],
      "text": "A bad storm began to encompass the area as Katara found Aang in a small cave. Aang began telling Katara about his past; he ran away because the monks tried to separate him from his mentor and guardian, Gyatso, and froze himself in ice while in the Avatar State since he was about to drown. Aang felt tremendous guilt, as he thought that he did turn his back on the world, but Katara comforted him by saying that he gives people hope."
    },
    {
      "body": "The storm continued to worsen, and suddenly the fisherman's wife appeared at the entrance of the cave, asking for Aang and Katara's help, as she was worried that her husband and Sokka got caught at sea in the storm. Aang and Katara flew on Appa out to sea, and spotted Sokka and the fisherman on a sinking boat. They safely rescued Sokka and the old man, and returned them to the cave. Aang proceeded to tell Katara that he was ready to move on from the past and look toward a brighter future.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "The Great Divide and the storm"
      ],
      "text": "The storm continued to worsen, and suddenly the fisherman's wife appeared at the entrance of the cave, asking for Aang and Katara's help, as she was worried that her husband and Sokka got caught at sea in the storm. Aang and Katara flew on Appa out to sea, and spotted Sokka and the fisherman on a sinking boat. They safely rescued Sokka and the old man, and returned them to the cave. Aang proceeded to tell Katara that he was ready to move on from the past and look toward a brighter future."
    },
    {
      "body": "The team took shelter in a derelict building near the ruins of ${link_0}, where Katara tended to an illness Sokka had developed because of the storm. Katara subsequently caught Sokka's cold. When Aang was unable to find ginger root for ${link_1} to cure their sickness, he traveled to an ${link_2} where he was captured by the ${link_3} and taken to a prison under ${link_4} Zhao's command, leaving Katara worried about his whereabouts.",
      "links": [
        {
          "body": "Taku",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Taku",
            "page": "Taku"
          }
        },
        {
          "body": "tea",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tea",
            "page": "Tea"
          }
        },
        {
          "body": "herbalist institute",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Taku#Herbalist_institute",
            "page": "Taku"
          }
        },
        {
          "body": "Yuyan Archers",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Yuyan_Archers",
            "page": "Yuyan_Archers"
          }
        },
        {
          "body": "Admiral",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "The Blue Spirit and the fortuneteller"
      ],
      "text": "The team took shelter in a derelict building near the ruins of Taku, where Katara tended to an illness Sokka had developed because of the storm. Katara subsequently caught Sokka's cold. When Aang was unable to find ginger root for tea to cure their sickness, he traveled to an herbalist institute where he was captured by the Yuyan Archers and taken to a prison under Admiral Zhao's command, leaving Katara worried about his whereabouts."
    },
    {
      "body": "Aang escaped with the aid of the mysterious Blue Spirit, Zuko's alter ego, and returned to his friends. He gave them frozen ${link_0} from the nearby valley swamp to suck on, a method advised by the ${link_1}. The frogs cured them both, however, they quickly thawed out, to which Katara and Sokka were left disgusted at.",
      "links": [
        {
          "body": "wood frogs",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wood_frog",
            "page": "Wood_frog"
          }
        },
        {
          "body": "herbalist",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Herbalist",
            "page": "Herbalist"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "The Blue Spirit and the fortuneteller"
      ],
      "text": "Aang escaped with the aid of the mysterious Blue Spirit, Zuko's alter ego, and returned to his friends. He gave them frozen wood frogs from the nearby valley swamp to suck on, a method advised by the herbalist. The frogs cured them both, however, they quickly thawed out, to which Katara and Sokka were left disgusted at."
    },
    {
      "body": "Later, as the group camped out by a lake, Aang made a necklace for Katara out of Sokka's fishing line to replace the one she had lost. Katara thanked him, and upon donning the necklace, Aang became infatuated by the way she looked. Upon hearing loud noises, the group was drawn to a spot in the wooded area where an elderly man was being attacked by a vicious ${link_0}. Despite the dire circumstances, however, the man remained oddly calm. After Appa managed to fend off the bear, the man told them he came from a nearby village where a fortuneteller, Aunt ${link_1}, lived. The group decided to travel to the ${link_2} to have their fortunes told.",
      "links": [
        {
          "body": "platypus bear",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Platypus_bear",
            "page": "Platypus_bear"
          }
        },
        {
          "body": "Wu",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Wu_(fortuneteller)",
            "page": "Wu_(fortuneteller)"
          }
        },
        {
          "body": "village",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Makapu_Village",
            "page": "Makapu_Village"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "The Blue Spirit and the fortuneteller"
      ],
      "text": "Later, as the group camped out by a lake, Aang made a necklace for Katara out of Sokka's fishing line to replace the one she had lost. Katara thanked him, and upon donning the necklace, Aang became infatuated by the way she looked. Upon hearing loud noises, the group was drawn to a spot in the wooded area where an elderly man was being attacked by a vicious platypus bear. Despite the dire circumstances, however, the man remained oddly calm. After Appa managed to fend off the bear, the man told them he came from a nearby village where a fortuneteller, Aunt Wu, lived. The group decided to travel to the village to have their fortunes told."
    },
    {
      "body": "Katara was told by the fortuneteller that she would marry a powerful bender, to which she was very satisfied with. Upon having this first fortune read, Katara became obsessed with asking Aunt Wu to predict her fortune about every single detail of her life, to the point where she was locked out of the fortuneteller's building, due to annoying Wu so much.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "The Blue Spirit and the fortuneteller"
      ],
      "text": "Katara was told by the fortuneteller that she would marry a powerful bender, to which she was very satisfied with. Upon having this first fortune read, Katara became obsessed with asking Aunt Wu to predict her fortune about every single detail of her life, to the point where she was locked out of the fortuneteller's building, due to annoying Wu so much."
    },
    {
      "body": "Later, Aang and Sokka came up to Katara and explained that Aunt Wu's prediction about the ${link_0} surrounding the village being inactive was wrong, and that they needed to save the village from the impending doom. After plans were arranged to dig a trench to channel the oncoming lava to the river and some impressive displays of airbending power, Aang managed to successfully quell the volcano's fury and save the village. Sokka remarked that Aang was one powerful bender, which caused Katara to realize that Aang may have been the \"powerful bender\" Aunt Wu predicted she would marry.",
      "links": [
        {
          "body": "volcano",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mt",
            "page": "Mt"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "The Blue Spirit and the fortuneteller"
      ],
      "text": "Later, Aang and Sokka came up to Katara and explained that Aunt Wu's prediction about the volcano surrounding the village being inactive was wrong, and that they needed to save the village from the impending doom. After plans were arranged to dig a trench to channel the oncoming lava to the river and some impressive displays of airbending power, Aang managed to successfully quell the volcano's fury and save the village. Sokka remarked that Aang was one powerful bender, which caused Katara to realize that Aang may have been the \"powerful bender\" Aunt Wu predicted she would marry."
    },
    {
      "body": "The group met up with an old friend from their Water Tribe village named ${link_0}, who had been injured and left behind. They headed back to his current home in an ${link_1} of nuns who made perfumes and cures. Katara and Sokka spent so much time reminiscing that they unintentionally neglected Aang. Bato suddenly started talking about how Katara and Sokka might be able to visit their father, Hakoda, and that a message was arriving soon about Hakoda's whereabouts. Aang ran off, feeling hurt that Katara and Sokka might leave him to go find their father. While Aang was contemplating their possible departure, a messenger arrived with a rendezvous map leading to Hakoda's location, and instead of giving it to them, Aang hid it. After taking part in a Water Tribe ritual known as ${link_2}, however, in which Aang was bestowed the ${link_3}, he came clean about his actions and revealed that he had the map. An angered Sokka and a hurt Katara decided to leave him behind in order to find their father. After further contemplation, however, they came to the realization that they were needed by Aang's side on his journey and joined up with him once more. Later, when the kids were flying on Appa, Aang asked what the plan was now. They told him they were going to get him to the North Pole because he was their family. Aang gave Katara back her necklace which he had retrieved from Zuko, to which she responded by going over and kissing Aang on the cheek, causing Aang to blush and twiddle with his thumbs.",
      "links": [
        {
          "body": "Bato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bato",
            "page": "Bato"
          }
        },
        {
          "body": "abbey",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Abbey",
            "page": "Abbey"
          }
        },
        {
          "body": "ice dodging",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ice_dodging",
            "page": "Ice_dodging"
          }
        },
        {
          "body": "Mark of the Trusted",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Body_markings_in_the_World_of_Avatar#Mark_of_the_Trusted",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Bato and Jeong Jeong"
      ],
      "text": "The group met up with an old friend from their Water Tribe village named Bato, who had been injured and left behind. They headed back to his current home in an abbey of nuns who made perfumes and cures. Katara and Sokka spent so much time reminiscing that they unintentionally neglected Aang. Bato suddenly started talking about how Katara and Sokka might be able to visit their father, Hakoda, and that a message was arriving soon about Hakoda's whereabouts. Aang ran off, feeling hurt that Katara and Sokka might leave him to go find their father. While Aang was contemplating their possible departure, a messenger arrived with a rendezvous map leading to Hakoda's location, and instead of giving it to them, Aang hid it. After taking part in a Water Tribe ritual known as ice dodging, however, in which Aang was bestowed the Mark of the Trusted, he came clean about his actions and revealed that he had the map. An angered Sokka and a hurt Katara decided to leave him behind in order to find their father. After further contemplation, however, they came to the realization that they were needed by Aang's side on his journey and joined up with him once more. Later, when the kids were flying on Appa, Aang asked what the plan was now. They told him they were going to get him to the North Pole because he was their family. Aang gave Katara back her necklace which he had retrieved from Zuko, to which she responded by going over and kissing Aang on the cheek, causing Aang to blush and twiddle with his thumbs."
    },
    {
      "body": "When the group met a firebender named ${link_0}, Aang found this as the perfect moment to learn how to firebend. Jeong Jeong started teaching Aang slowly, focusing exclusively on breathing exercises and stances, but the young Avatar desired to learn more advanced firebending techniques. Jeong Jeong assigned him the simple task of preventing a leaf from being completely burned and left to tend to other matters. Aang, feeling restricted, took his exercise to the next step and created fire. He played around with it for a little while even though Katara insisted that he be careful. Soon thereafter, he accidentally burned Katara's hands when he attempted to imitate a move a ${link_1} made at the ${link_2} earlier on. Katara cried in pain and ran away; Sokka became enraged as a result and tackled Aang. Jeong Jeong, having returned, followed Katara into the forest. Katara tried to cool her hands from the burn in the water, and she miraculously was able to heal herself. Jeong Jeong told Katara that she possessed vitakinetic ${link_3} powers, with water as the catalyst. Jeong Jeong confessed of his desire to be a waterbender like herself, due to its ability to heal, while fire only destroyed. She later forgave Aang for his actions.",
      "links": [
        {
          "body": "Jeong Jeong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        },
        {
          "body": "performer",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Malu",
            "page": "Malu"
          }
        },
        {
          "body": "festival",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_colonial_village#Fire_Days_Festival",
            "page": "Fire_Nation_colonial_village"
          }
        },
        {
          "body": "healing",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Healing",
            "page": "Healing"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "Throughout the Earth Kingdom",
        "Bato and Jeong Jeong"
      ],
      "text": "When the group met a firebender named Jeong Jeong, Aang found this as the perfect moment to learn how to firebend. Jeong Jeong started teaching Aang slowly, focusing exclusively on breathing exercises and stances, but the young Avatar desired to learn more advanced firebending techniques. Jeong Jeong assigned him the simple task of preventing a leaf from being completely burned and left to tend to other matters. Aang, feeling restricted, took his exercise to the next step and created fire. He played around with it for a little while even though Katara insisted that he be careful. Soon thereafter, he accidentally burned Katara's hands when he attempted to imitate a move a performer made at the festival earlier on. Katara cried in pain and ran away; Sokka became enraged as a result and tackled Aang. Jeong Jeong, having returned, followed Katara into the forest. Katara tried to cool her hands from the burn in the water, and she miraculously was able to heal herself. Jeong Jeong told Katara that she possessed vitakinetic healing powers, with water as the catalyst. Jeong Jeong confessed of his desire to be a waterbender like herself, due to its ability to heal, while fire only destroyed. She later forgave Aang for his actions."
    },
    {
      "body": "After hearing rumors about flying people from a traveling storyteller, the kids journeyed to the ${link_0} to see for themselves if the rumors were true. Upon arrival, they found not airbenders, but an Earth Kingdom colony led by ${link_1} and ${link_2}. He made ${link_3} based on the Air Nomad staffs he found in the temple, and the members of the colony used them for \"flight\", leading to the rumor of the \"flying people\". The inventor had defiled the ancient landmarks with technological \"improvements\", similar in style to the Industrial Revolution. Aang was at first disheartened by the many changes to the temple, though he developed a degree of respect for the mechanist's son, Teo. Teo let Katara try flying with one of the manufactured gliders, and Katara found it thrilling and exciting.",
      "links": [
        {
          "body": "Northern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        },
        {
          "body": "a mad inventor",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mechanist",
            "page": "Mechanist"
          }
        },
        {
          "body": "his paraplegic son",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Teo",
            "page": "Teo"
          }
        },
        {
          "body": "gliders",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Glider",
            "page": "Glider"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "The Northern Air Temple"
      ],
      "text": "After hearing rumors about flying people from a traveling storyteller, the kids journeyed to the Northern Air Temple to see for themselves if the rumors were true. Upon arrival, they found not airbenders, but an Earth Kingdom colony led by a mad inventor and his paraplegic son. He made gliders based on the Air Nomad staffs he found in the temple, and the members of the colony used them for \"flight\", leading to the rumor of the \"flying people\". The inventor had defiled the ancient landmarks with technological \"improvements\", similar in style to the Industrial Revolution. Aang was at first disheartened by the many changes to the temple, though he developed a degree of respect for the mechanist's son, Teo. Teo let Katara try flying with one of the manufactured gliders, and Katara found it thrilling and exciting."
    },
    {
      "body": "Later, Aang, Katara and Teo discovered that the once sacred ${link_0} had been transformed into a workshop for creating ${link_1} for the Fire Nation. The mechanist confessed that he was coerced into producing weapons for the Fire Nation with the threat that, should he not comply, the entire temple would be destroyed by the enemy. Not long after, ${link_2} ${link_3} came to the temple, seeking the promised weapons. When Aang refused and attacked the war minister, the latter vowed vengeance and left to assemble an army of Fire Nation soldiers. With Fire Nation forces quickly approaching the temple, the Earth Kingdom colonists and Team Avatar worked together to fend them off. Aang flipped many Fire Nation tanks over, but to no avail, as the cockpits also flipped. Teo stated that the tanks had a water balancing system. Katara used this knowledge and her waterbending to fight them, but there were too many.",
      "links": [
        {
          "body": "air temple sanctuary",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_temple_sanctuaries#Northern_Sanctuary",
            "page": "Air_temple_sanctuaries"
          }
        },
        {
          "body": "weapons",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Weaponry_in_the_World_of_Avatar",
            "page": "Weaponry_in_the_World_of_Avatar"
          }
        },
        {
          "body": "War Minister",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/War_Minister",
            "page": "War_Minister"
          }
        },
        {
          "body": "Qin",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Qin",
            "page": "Qin"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "The Northern Air Temple"
      ],
      "text": "Later, Aang, Katara and Teo discovered that the once sacred air temple sanctuary had been transformed into a workshop for creating weapons for the Fire Nation. The mechanist confessed that he was coerced into producing weapons for the Fire Nation with the threat that, should he not comply, the entire temple would be destroyed by the enemy. Not long after, War Minister Qin came to the temple, seeking the promised weapons. When Aang refused and attacked the war minister, the latter vowed vengeance and left to assemble an army of Fire Nation soldiers. With Fire Nation forces quickly approaching the temple, the Earth Kingdom colonists and Team Avatar worked together to fend them off. Aang flipped many Fire Nation tanks over, but to no avail, as the cockpits also flipped. Teo stated that the tanks had a water balancing system. Katara used this knowledge and her waterbending to fight them, but there were too many."
    },
    {
      "body": "Appa arrived and retrieved Aang and Katara out of the battlefield. Out of explosives, the people lost hope. Making a timely appearance, Sokka and the mechanist suddenly appeared with their newest invention: a war balloon. The Fire Nation did not attack the balloon, as they saw the Fire Nation insignia on it. Sokka dropped several slime bombs, but that did not stop the advancing army. Ultimately, Sokka, in a desperate maneuver, threw the balloon's hot air engine into a crack with explosive gas emanating from it. The resulting explosion crushed the invaders and resulted in victory for Team Avatar and the Earth Kingdom colony. Afterward, Aang stated his approval of the villagers having settled there.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "The Northern Air Temple"
      ],
      "text": "Appa arrived and retrieved Aang and Katara out of the battlefield. Out of explosives, the people lost hope. Making a timely appearance, Sokka and the mechanist suddenly appeared with their newest invention: a war balloon. The Fire Nation did not attack the balloon, as they saw the Fire Nation insignia on it. Sokka dropped several slime bombs, but that did not stop the advancing army. Ultimately, Sokka, in a desperate maneuver, threw the balloon's hot air engine into a crack with explosive gas emanating from it. The resulting explosion crushed the invaders and resulted in victory for Team Avatar and the Earth Kingdom colony. Afterward, Aang stated his approval of the villagers having settled there."
    },
    {
      "body": "Unknowingly, the balloon consequently dropped into the Fire Nation campgrounds. Qin and his soldiers found it, saying, \"This defeat is the gateway to many victories\", as firebenders inflated the balloon.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "Journey to the Northern Tribe",
        "The Northern Air Temple"
      ],
      "text": "Unknowingly, the balloon consequently dropped into the Fire Nation campgrounds. Qin and his soldiers found it, saying, \"This defeat is the gateway to many victories\", as firebenders inflated the balloon."
    },
    {
      "body": "As they progressed toward the Northern Water Tribe, Sokka began to complain that Appa was flying too slowly. Aang defensively replied that they should all climb on Sokka's back so he could fly them to the North Pole. Katara tried to soothe the situation remarking that they were all tired and cranky as a result of flying for two days straight. Just as Sokka was voicing his doubts about finding the Northern Water Tribe, the group was attacked by waterbenders, who led them to their Water Tribe.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "The Northern Water Tribe",
        "Fight for waterbending"
      ],
      "text": "As they progressed toward the Northern Water Tribe, Sokka began to complain that Appa was flying too slowly. Aang defensively replied that they should all climb on Sokka's back so he could fly them to the North Pole. Katara tried to soothe the situation remarking that they were all tired and cranky as a result of flying for two days straight. Just as Sokka was voicing his doubts about finding the Northern Water Tribe, the group was attacked by waterbenders, who led them to their Water Tribe."
    },
    {
      "body": "Outside the great palace of the Northern Water Tribe, Sokka and Katara were celebrated as family from the Southern Tribe, and Aang was honored as a special guest. Aang and Katara were delighted to see the waterbending master, ${link_0}, and his students performing elaborate and elegant waterbending moves for entertainment. After the waterbending performance was over, Aang was introduced to Master Pakku. Katara was looking forward to Aang and herself learning waterbending after she took a few days rest. The next day, as they approached the palace, Katara expressed her joy at being able to learn from a real master, saying she had waited for this day her whole life. However, she was horrified to learn from Master Pakku that it was forbidden for women to learn waterbending. He advised her to go to the healing huts and learn from ${link_1} to use her waterbending to heal. Although Aang initially refused to learn from Master Pakku, outraged at the unfairness, Katara made him return by saying that he could not risk his training for her.",
      "links": [
        {
          "body": "Pakku",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "Yugoda",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Yugoda",
            "page": "Yugoda"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "The Northern Water Tribe",
        "Fight for waterbending"
      ],
      "text": "Outside the great palace of the Northern Water Tribe, Sokka and Katara were celebrated as family from the Southern Tribe, and Aang was honored as a special guest. Aang and Katara were delighted to see the waterbending master, Pakku, and his students performing elaborate and elegant waterbending moves for entertainment. After the waterbending performance was over, Aang was introduced to Master Pakku. Katara was looking forward to Aang and herself learning waterbending after she took a few days rest. The next day, as they approached the palace, Katara expressed her joy at being able to learn from a real master, saying she had waited for this day her whole life. However, she was horrified to learn from Master Pakku that it was forbidden for women to learn waterbending. He advised her to go to the healing huts and learn from Yugoda to use her waterbending to heal. Although Aang initially refused to learn from Master Pakku, outraged at the unfairness, Katara made him return by saying that he could not risk his training for her."
    },
    {
      "body": "Katara reluctantly went to the class, which was taught by an old woman and where all the other students were very young girls. After the healing class, Katara thanked Yugoda, who noticed her betrothal necklace and asked her to whom she was getting married. Katara explained that she was not ready for marriage and that the necklace was her grandmother's, passed down to her mother, and finally to her. Yugoda recognized the carving and revealed to Katara that she was an old friend of Kanna's, who was actually born in the Northern Tribe and was engaged to a young waterbender, but left mysteriously without saying goodbye.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "The Northern Water Tribe",
        "Fight for waterbending"
      ],
      "text": "Katara reluctantly went to the class, which was taught by an old woman and where all the other students were very young girls. After the healing class, Katara thanked Yugoda, who noticed her betrothal necklace and asked her to whom she was getting married. Katara explained that she was not ready for marriage and that the necklace was her grandmother's, passed down to her mother, and finally to her. Yugoda recognized the carving and revealed to Katara that she was an old friend of Kanna's, who was actually born in the Northern Tribe and was engaged to a young waterbender, but left mysteriously without saying goodbye."
    },
    {
      "body": "Sokka suggested that at night Aang teach Katara everything he had learned that day. Katara was excited at this idea, for it allowed her to learn waterbending as well as give Aang someone with whom to practice, so everyone would be happy. As Aang showed Katara a waterbending move, they looked up to the bridge above them to see Master Pakku, angry that Aang had disrespected him, his teachings, and his entire culture. Aang hastily apologized, but Master Pakku refused to teach Aang anymore, saying he was no longer welcome as his student before leaving. The next day at the palace, Katara pleaded with Chief ${link_0} to have Master Pakku take Aang back as his student. Master Pakku agreed to continue training Aang as long as Katara apologized. She conceded, but after a few patronizing comments by him, Katara angrily refused to apologize and challenged him to a duel.",
      "links": [
        {
          "body": "Arnook",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Arnook",
            "page": "Arnook"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "The Northern Water Tribe",
        "Fight for waterbending"
      ],
      "text": "Sokka suggested that at night Aang teach Katara everything he had learned that day. Katara was excited at this idea, for it allowed her to learn waterbending as well as give Aang someone with whom to practice, so everyone would be happy. As Aang showed Katara a waterbending move, they looked up to the bridge above them to see Master Pakku, angry that Aang had disrespected him, his teachings, and his entire culture. Aang hastily apologized, but Master Pakku refused to teach Aang anymore, saying he was no longer welcome as his student before leaving. The next day at the palace, Katara pleaded with Chief Arnook to have Master Pakku take Aang back as his student. Master Pakku agreed to continue training Aang as long as Katara apologized. She conceded, but after a few patronizing comments by him, Katara angrily refused to apologize and challenged him to a duel."
    },
    {
      "body": "Katara went outside to wait for Master Pakku, who simply strolled past her, further angering her with patronizing comments. Katara, her temper pushed to the breaking point, formed a water whip and slapped Master Pakku on the back of the head. He turned around and agreed to the fight, telling her if she wanted to learn so badly, she should study closely. The fight began, and it was discovered that Katara was much more advanced in waterbending than previously known. She demonstrated amazingly powerful techniques she never used before during the fight. The two were able to manipulate the water and snow around them amazingly, using basic and advanced waterbending techniques. Master Pakku grinned and smirked as he attacked, but when Katara launched discs of ice at him, he appeared to realize how skilled she was as a waterbender. After a few moments of violent waterbending, it seemed Katara had the upper-hand, as she toppled ice-obelisks over Master Pakku, who disappeared in a cloud of mist. However, Master Pakku quickly emerged and performed a waterbending move that rendered Katara helpless, and she was defeated.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "The Northern Water Tribe",
        "Fight for waterbending"
      ],
      "text": "Katara went outside to wait for Master Pakku, who simply strolled past her, further angering her with patronizing comments. Katara, her temper pushed to the breaking point, formed a water whip and slapped Master Pakku on the back of the head. He turned around and agreed to the fight, telling her if she wanted to learn so badly, she should study closely. The fight began, and it was discovered that Katara was much more advanced in waterbending than previously known. She demonstrated amazingly powerful techniques she never used before during the fight. The two were able to manipulate the water and snow around them amazingly, using basic and advanced waterbending techniques. Master Pakku grinned and smirked as he attacked, but when Katara launched discs of ice at him, he appeared to realize how skilled she was as a waterbender. After a few moments of violent waterbending, it seemed Katara had the upper-hand, as she toppled ice-obelisks over Master Pakku, who disappeared in a cloud of mist. However, Master Pakku quickly emerged and performed a waterbending move that rendered Katara helpless, and she was defeated."
    },
    {
      "body": "Her grandmother's necklace, which fell off during the fight, was picked up by Master Pakku, and it was discovered that he made it for Kanna sixty years prior. He decided to start teaching Katara to waterbend.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "The Northern Water Tribe",
        "Fight for waterbending"
      ],
      "text": "Her grandmother's necklace, which fell off during the fight, was picked up by Master Pakku, and it was discovered that he made it for Kanna sixty years prior. He decided to start teaching Katara to waterbend."
    },
    {
      "body": "Under the tutelage of Master Pakku, Katara's waterbending skills improved to the degree she could defeat ${link_0} and all the other pupils with ease. To both Pakku and Katara's annoyance, the same could not be said for Aang, who did not take it very seriously.",
      "links": [
        {
          "body": "Sangok",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sangok",
            "page": "Sangok"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "The Northern Water Tribe",
        "Fight for waterbending"
      ],
      "text": "Under the tutelage of Master Pakku, Katara's waterbending skills improved to the degree she could defeat Sangok and all the other pupils with ease. To both Pakku and Katara's annoyance, the same could not be said for Aang, who did not take it very seriously."
    },
    {
      "body": "The Northern Water Tribe prepared for an attack as Fire Nation ships approached and laid siege to the city. ${link_0} ${link_1}, after relating the origins of the Water Tribe and its power, gave Aang an idea. If he could connect with the ${link_2} and meet with the ${link_3} and ${link_4}, perhaps they could help him defeat the Fire Nation. Yue took Katara and Aang to a hidden ${link_5}, the most spiritual place in North Pole. Aang entered a trance after staring at the two koi fish in a pool and entered the Spirit World, and Katara was left to protect him. When Zuko arrived, Katara dueled him, and with the power of the moon, was able to temporarily defeat Zuko by freezing him on a pillar of ice. However, when the sun rose and enhanced Zuko's powers, he was able to defeat Katara. Zuko subsequently kidnapped the Avatar while Katara was left unconscious until Yue brought Sokka and Appa back to the Spirit Oasis.",
      "links": [
        {
          "body": "Princess",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Moon",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Ocean Spirits",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/La",
            "page": "La"
          }
        },
        {
          "body": "oasis",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "The Northern Water Tribe",
        "Siege of the North"
      ],
      "text": "The Northern Water Tribe prepared for an attack as Fire Nation ships approached and laid siege to the city. Princess Yue, after relating the origins of the Water Tribe and its power, gave Aang an idea. If he could connect with the Spirit World and meet with the Moon and Ocean Spirits, perhaps they could help him defeat the Fire Nation. Yue took Katara and Aang to a hidden oasis, the most spiritual place in North Pole. Aang entered a trance after staring at the two koi fish in a pool and entered the Spirit World, and Katara was left to protect him. When Zuko arrived, Katara dueled him, and with the power of the moon, was able to temporarily defeat Zuko by freezing him on a pillar of ice. However, when the sun rose and enhanced Zuko's powers, he was able to defeat Katara. Zuko subsequently kidnapped the Avatar while Katara was left unconscious until Yue brought Sokka and Appa back to the Spirit Oasis."
    },
    {
      "body": "Katara, Sokka, and Princess Yue eventually found Aang and Zuko traversing the icy tundra. Zuko and Katara had a rematch, but, due to the full moon being out this time, Katara easily defeated him in a matter of seconds by temporarily suspending him in a frozen pillar at a colossal height and subsequently throwing him to the ground. Aang took the unconscious Zuko with him, despite some disagreement from Sokka and Katara.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "The Northern Water Tribe",
        "Siege of the North"
      ],
      "text": "Katara, Sokka, and Princess Yue eventually found Aang and Zuko traversing the icy tundra. Zuko and Katara had a rematch, but, due to the full moon being out this time, Katara easily defeated him in a matter of seconds by temporarily suspending him in a frozen pillar at a colossal height and subsequently throwing him to the ground. Aang took the unconscious Zuko with him, despite some disagreement from Sokka and Katara."
    },
    {
      "body": "When Katara and the others returned to the oasis, Zhao had already captured the white koi fish. Immediately, the moon glowed red, creating a lunar eclipse, and color seeped from the world. Zhao, however, was forced to release the spirit when ${link_0} showed himself and threatened Zhao and his men. This caused the moon to return and the waterbenders to resume fighting. In a rage, Zhao suddenly threw fire at the koi, killing it, and the moon vanished altogether from the sky. Iroh leaped forward and easily defeated Zhao's firebending escort, but Zhao himself was able to sneak away during the commotion. Iroh and Katara attempted to revive the Moon Spirit, but it was too late. Aang suddenly entered the Avatar State and fused with the Ocean Spirit into a ${link_1}. With his new power, he massacred the Fire Nation's invasion force. Shortly after, Iroh told Yue that some of the Moon Spirit's life was in her. Yue, realizing her destiny, gave up her life to the white koi and restored its life, killing herself in the process.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "giant spirit creature",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/La#Koizilla",
            "page": "La"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "The Northern Water Tribe",
        "Siege of the North"
      ],
      "text": "When Katara and the others returned to the oasis, Zhao had already captured the white koi fish. Immediately, the moon glowed red, creating a lunar eclipse, and color seeped from the world. Zhao, however, was forced to release the spirit when Iroh showed himself and threatened Zhao and his men. This caused the moon to return and the waterbenders to resume fighting. In a rage, Zhao suddenly threw fire at the koi, killing it, and the moon vanished altogether from the sky. Iroh leaped forward and easily defeated Zhao's firebending escort, but Zhao himself was able to sneak away during the commotion. Iroh and Katara attempted to revive the Moon Spirit, but it was too late. Aang suddenly entered the Avatar State and fused with the Ocean Spirit into a giant spirit creature. With his new power, he massacred the Fire Nation's invasion force. Shortly after, Iroh told Yue that some of the Moon Spirit's life was in her. Yue, realizing her destiny, gave up her life to the white koi and restored its life, killing herself in the process."
    },
    {
      "body": "After the battle, Pakku revealed to Katara his intention to head for the South Pole and help rebuild the tribe. He assigned Katara as Aang's new waterbending master.",
      "links": [],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "The Northern Water Tribe",
        "Siege of the North"
      ],
      "text": "After the battle, Pakku revealed to Katara his intention to head for the South Pole and help rebuild the tribe. He assigned Katara as Aang's new waterbending master."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Katara (Spring 100 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Katara_(Spring_100_AG)",
            "page": "History_of_Katara_(Spring_100_AG)"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "See also"
      ],
      "text": "History of Katara (Spring 100 AG)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Katara (Summer 100 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Katara_(Summer_100_AG)",
            "page": "History_of_Katara_(Summer_100_AG)"
          }
        }
      ],
      "section": [
        "History of Katara (85 AG – 100 AG)",
        "See also"
      ],
      "text": "History of Katara (Summer 100 AG)"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Katara_(85_AG_-_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Katara_(85_AG_-_100_AG).html",
    "page": "History_of_Katara_(85_AG_-_100_AG)",
    "title": "History of Katara (85 AG – 100 AG)"
  }
}