{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "After the end of the ${link_0}, ${link_1} moved to a decent ${link_2} with ${link_3} and he became the new captain of the ${link_4}, though after his brother and ${link_5} had quit, the team was not what it used to be.",
      "links": [
        {
          "body": "Anti-bending Revolution",
          "key": "${link_0}",
          "target": {
            "href": "Anti-bending_Revolution",
            "page": "Anti-bending_Revolution"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "apartment",
          "key": "${link_2}",
          "target": {
            "href": "Mako_and_Bolin%27s_apartment",
            "page": "Mako_and_Bolin%27s_apartment"
          }
        },
        {
          "body": "Mako",
          "key": "${link_3}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Fire Ferrets",
          "key": "${link_4}",
          "target": {
            "href": "Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        },
        {
          "body": "Korra",
          "key": "${link_5}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "After the end of the Anti-bending Revolution, Bolin moved to a decent apartment with Mako and he became the new captain of the Fire Ferrets, though after his brother and Korra had quit, the team was not what it used to be."
    },
    {
      "body": "During the six months after the defeat of Amon and the end of the Anti-bending Revolution, Bolin became the new captain of the Fire Ferrets, though his team suffered numerous losses. Nonetheless, he hoped to inspire his teammates with an uplifting speech, though as soon as his team entered the ring, they were knocked out in the fastest defeat in pro-bending history. Upset with the circumstances, Bolin wondered to himself where Mako was when he needed him.",
      "links": [],
      "text": "During the six months after the defeat of Amon and the end of the Anti-bending Revolution, Bolin became the new captain of the Fire Ferrets, though his team suffered numerous losses. Nonetheless, he hoped to inspire his teammates with an uplifting speech, though as soon as his team entered the ring, they were knocked out in the fastest defeat in pro-bending history. Upset with the circumstances, Bolin wondered to himself where Mako was when he needed him."
    },
    {
      "body": "Days later, Bolin was invited to join ${link_0} ${link_1}, Mako, ${link_2}, and ${link_3}'s family by traveling to the ${link_4} at the ${link_5}. He rode on a boat with all of them, and when he arrived at the docks, he was surprised that there were a lot of people waiting for them. However, upon expressing this belief out loud, Korra corrected him and showed him that the people were there for Unalaq, ${link_6}. He was immediately infatuated with the twins, until Korra informed him that Desna was male.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_3}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Glacier Spirits Festival",
          "key": "${link_4}",
          "target": {
            "href": "Glacier_Spirits_Festival",
            "page": "Glacier_Spirits_Festival"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_5}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Desna, and Eska",
          "key": "${link_6}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        }
      ],
      "text": "Days later, Bolin was invited to join Avatar Korra, Mako, Asami, and Tenzin's family by traveling to the Glacier Spirits Festival at the Southern Water Tribe. He rode on a boat with all of them, and when he arrived at the docks, he was surprised that there were a lot of people waiting for them. However, upon expressing this belief out loud, Korra corrected him and showed him that the people were there for Unalaq, Desna, and Eska. He was immediately infatuated with the twins, until Korra informed him that Desna was male."
    },
    {
      "body": "${link_0} proving himself to be a natural assistant by entertaining ${link_1} and helping ${link_2} without trying.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_1}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "text": "Bolin proving himself to be a natural assistant by entertaining Varrick and helping Asami without trying."
    },
    {
      "body": "Later, Asami requested that Bolin accompany her into Varrick's ship so that she could create a deal that would help her save ${link_0}. Bolin said he was a natural assistant, but Asami still told Bolin that he should not talk, to which he agreed. When Bolin and Asami entered, they found Varrick sitting on a pillow, surrounded by several people. Varrick asked the earthbender what he thought of the businessman's levitation, but Bolin responded that he had not been levitating, causing shock throughout the room. The entrepreneur approached Bolin, seemingly angry, questioning what Bolin had said, to which he repeated that Varrick had not been levitating. Varrick's attitude quickly changed and he asked aloud why nobody had bothered to tell him and fired his ${link_1}. Varrick told Bolin he liked him and invited him to look at his moving picture of an ${link_2} running. Bolin was very impressed, but Varrick declared it old news and instead showed off a girl working for him, ${link_3}. Shortly afterward, he made the deal with Asami, who hugged Bolin, agreeing that he was a natural assistant.",
      "links": [
        {
          "body": "Future Industries",
          "key": "${link_0}",
          "target": {
            "href": "Future_Industries",
            "page": "Future_Industries"
          }
        },
        {
          "body": "swami",
          "key": "${link_1}",
          "target": {
            "href": "Swami",
            "page": "Swami"
          }
        },
        {
          "body": "ostrich horse",
          "key": "${link_2}",
          "target": {
            "href": "Ostrich_horse",
            "page": "Ostrich_horse"
          }
        },
        {
          "body": "Ginger",
          "key": "${link_3}",
          "target": {
            "href": "Ginger",
            "page": "Ginger"
          }
        }
      ],
      "text": "Later, Asami requested that Bolin accompany her into Varrick's ship so that she could create a deal that would help her save Future Industries. Bolin said he was a natural assistant, but Asami still told Bolin that he should not talk, to which he agreed. When Bolin and Asami entered, they found Varrick sitting on a pillow, surrounded by several people. Varrick asked the earthbender what he thought of the businessman's levitation, but Bolin responded that he had not been levitating, causing shock throughout the room. The entrepreneur approached Bolin, seemingly angry, questioning what Bolin had said, to which he repeated that Varrick had not been levitating. Varrick's attitude quickly changed and he asked aloud why nobody had bothered to tell him and fired his swami. Varrick told Bolin he liked him and invited him to look at his moving picture of an ostrich horse running. Bolin was very impressed, but Varrick declared it old news and instead showed off a girl working for him, Ginger. Shortly afterward, he made the deal with Asami, who hugged Bolin, agreeing that he was a natural assistant."
    },
    {
      "body": "${link_0}'s attempt to get ${link_1}'s attention.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Eska",
          "key": "${link_1}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        }
      ],
      "text": "Bolin's attempt to get Eska's attention."
    },
    {
      "body": "Bolin later attended the feasting part of the festival, where ${link_0} made an announcement that the South had become spiritually unbalanced and that he planned to fix it in the future. After the feast, Bolin attempted to accompany Mako and Korra, but became annoyed with the two of them feeding each other and said he was going to try and make a move on Eska. He approached the twins, introduced himself to Eska and attempted to relate to the fact that she was from the ${link_1} by saying that \"north [was his] favorite direction\". Desna did not seem to like this, but Eska said that she was amused by him and he now belonged to her before dragging him by the hood to go off and win her prizes.",
      "links": [
        {
          "body": "Unalaq",
          "key": "${link_0}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "text": "Bolin later attended the feasting part of the festival, where Unalaq made an announcement that the South had become spiritually unbalanced and that he planned to fix it in the future. After the feast, Bolin attempted to accompany Mako and Korra, but became annoyed with the two of them feeding each other and said he was going to try and make a move on Eska. He approached the twins, introduced himself to Eska and attempted to relate to the fact that she was from the Northern Water Tribe by saying that \"north [was his] favorite direction\". Desna did not seem to like this, but Eska said that she was amused by him and he now belonged to her before dragging him by the hood to go off and win her prizes."
    },
    {
      "body": "Later that night, the area Bolin was sleeping in was disturbed by a ${link_0} that attacked the area. This caused Bolin to wake up, and he attempted to fight it with Mako and Korra, but the three of them had no success. Their efforts were soon aided by ${link_1}, Korra's father, and later Tenzin, but all of their efforts proved futile until Unalaq entered and used a special ${link_2} technique that spiraled around the spirit, causing the water and the spirit to glow, and moments later the spirit vanished.",
      "links": [
        {
          "body": "dark spirit",
          "key": "${link_0}",
          "target": {
            "href": "Dark_spirits",
            "page": "Dark_spirits"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_1}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_2}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Later that night, the area Bolin was sleeping in was disturbed by a dark spirit that attacked the area. This caused Bolin to wake up, and he attempted to fight it with Mako and Korra, but the three of them had no success. Their efforts were soon aided by Tonraq, Korra's father, and later Tenzin, but all of their efforts proved futile until Unalaq entered and used a special waterbending technique that spiraled around the spirit, causing the water and the spirit to glow, and moments later the spirit vanished."
    },
    {
      "body": "${link_0}, thinking he would give a lift to ${link_1}, becomes stuck driving both siblings.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Eska",
          "key": "${link_1}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        }
      ],
      "text": "Bolin, thinking he would give a lift to Eska, becomes stuck driving both siblings."
    },
    {
      "body": "Given a snowmobile and new gear by Varrick, Bolin accompanied Korra, Unalaq, ${link_0}, the twins, and Mako to the southern tundra so that the Avatar could open a portal to the spirit realm. After meeting up with the group, Eska inquired as to whether the sidecar of the snowmobile could hold two passengers, with Bolin giving a definite yes. He was less than amused afterward as the waterbender brought her brother along for the ride. That evening, the group sought cover in a cave for the night. Prior to turning in, Bolin became uncomfortable when Unalaq explained the situation regarding the dark spirits, as he did not like to hear ghost stories. He scooted closer to Eska, who promised to protect him, labeling him her \"feeble turtle duck\".",
      "links": [
        {
          "body": "Tonraq",
          "key": "${link_0}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        }
      ],
      "text": "Given a snowmobile and new gear by Varrick, Bolin accompanied Korra, Unalaq, Tonraq, the twins, and Mako to the southern tundra so that the Avatar could open a portal to the spirit realm. After meeting up with the group, Eska inquired as to whether the sidecar of the snowmobile could hold two passengers, with Bolin giving a definite yes. He was less than amused afterward as the waterbender brought her brother along for the ride. That evening, the group sought cover in a cave for the night. Prior to turning in, Bolin became uncomfortable when Unalaq explained the situation regarding the dark spirits, as he did not like to hear ghost stories. He scooted closer to Eska, who promised to protect him, labeling him her \"feeble turtle duck\"."
    },
    {
      "body": "On their way to the site, the group was set upon by dark spirits, one of which sabotaged the motor of Bolin's vehicle, causing him to lose control. As the snowmobile headed for a mountainside, the twins pulled the earthbender out of the driver's seat. As they dropped him on the ground, his special snowsuit inflated to cushion the impact, and he slid down the rest of slope. Arriving at the bottom, Bolin asked for someone to deflate the suit, with Eska complying by puncturing the suit with three ice spikes. With his snowmobile destroyed, Bolin was pulled the rest of the way by Desna and Eska's ${link_0}, while he sat in the wreck of the snowmobile.",
      "links": [
        {
          "body": "Arctic camel",
          "key": "${link_0}",
          "target": {
            "href": "Arctic_camel",
            "page": "Arctic_camel"
          }
        }
      ],
      "text": "On their way to the site, the group was set upon by dark spirits, one of which sabotaged the motor of Bolin's vehicle, causing him to lose control. As the snowmobile headed for a mountainside, the twins pulled the earthbender out of the driver's seat. As they dropped him on the ground, his special snowsuit inflated to cushion the impact, and he slid down the rest of slope. Arriving at the bottom, Bolin asked for someone to deflate the suit, with Eska complying by puncturing the suit with three ice spikes. With his snowmobile destroyed, Bolin was pulled the rest of the way by Desna and Eska's Arctic camel, while he sat in the wreck of the snowmobile."
    },
    {
      "body": "When Korra returned from opening the portal, Bolin welcomed her back with a hug. However, his action was interrupted and halted by Eska, who waterbent an ice wall between him and her cousin. She pulled him back to her, asking why he was initiating physical contact with another woman. Bolin smiled nervously, and Eska dropped him to the ground and walked away with her brother.",
      "links": [],
      "text": "When Korra returned from opening the portal, Bolin welcomed her back with a hug. However, his action was interrupted and halted by Eska, who waterbent an ice wall between him and her cousin. She pulled him back to her, asking why he was initiating physical contact with another woman. Bolin smiled nervously, and Eska dropped him to the ground and walked away with her brother."
    },
    {
      "body": "${link_0} faking sadness upon ${link_1}'s imminent return to the ${link_2}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Eska",
          "key": "${link_1}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "text": "Bolin faking sadness upon Eska's imminent return to the Northern Water Tribe."
    },
    {
      "body": "The party returned to the Southern Water Tribe, arriving to find the Northern forces occupying the city. As the occupation sat in, Eska continued to treat Bolin more and more as a manservant as he chauffeured the Water Tribe twins on a rickshaw cart. As the three and Pabu arrived at their destination, Bolin sarcastically commented to Eska that he will miss her after she left, but much to his dismay, Eska revealed her plan to move back to the North with Bolin, where they would live together in \"icy bliss\". As the twins part his company, Bolin ran up to Mako, pleading his brother not to let Eska take him away. Mako suggested that he break up with Eska.",
      "links": [],
      "text": "The party returned to the Southern Water Tribe, arriving to find the Northern forces occupying the city. As the occupation sat in, Eska continued to treat Bolin more and more as a manservant as he chauffeured the Water Tribe twins on a rickshaw cart. As the three and Pabu arrived at their destination, Bolin sarcastically commented to Eska that he will miss her after she left, but much to his dismay, Eska revealed her plan to move back to the North with Bolin, where they would live together in \"icy bliss\". As the twins part his company, Bolin ran up to Mako, pleading his brother not to let Eska take him away. Mako suggested that he break up with Eska."
    },
    {
      "body": "However, this was easier said than done, as every time he brought up the subject, Eska threatened to freeze him in a block of ice and feed him to dolphin-piranhas. Accompanying the twins on a double-date with Mako and Korra, Bolin despaired his troubles as soon as the twins were out of earshot and futilely pleaded Korra to help him.",
      "links": [],
      "text": "However, this was easier said than done, as every time he brought up the subject, Eska threatened to freeze him in a block of ice and feed him to dolphin-piranhas. Accompanying the twins on a double-date with Mako and Korra, Bolin despaired his troubles as soon as the twins were out of earshot and futilely pleaded Korra to help him."
    },
    {
      "body": "The next day, Bolin chose to hide from Eska in Varrick's residence, when at the same time, his friend was late for wrapping up his deal with Asami. The room was searched by Desna and Eska, who claimed that Varrick was wanted for treason. As their search of the room turned up nothing, they left, but not before Eska ordered Bolin to grovel as she exited. Asami disapproved of how he easily kowtowed to her every whim and urged Bolin to stand up for himself. However, Varrick, revealed to be hiding in a stuffed ${link_0}, told him he should instead flee.",
      "links": [
        {
          "body": "platypus bear",
          "key": "${link_0}",
          "target": {
            "href": "Platypus_bear",
            "page": "Platypus_bear"
          }
        }
      ],
      "text": "The next day, Bolin chose to hide from Eska in Varrick's residence, when at the same time, his friend was late for wrapping up his deal with Asami. The room was searched by Desna and Eska, who claimed that Varrick was wanted for treason. As their search of the room turned up nothing, they left, but not before Eska ordered Bolin to grovel as she exited. Asami disapproved of how he easily kowtowed to her every whim and urged Bolin to stand up for himself. However, Varrick, revealed to be hiding in a stuffed platypus bear, told him he should instead flee."
    },
    {
      "body": "${link_0} engaging herself to a reluctant ${link_1}.",
      "links": [
        {
          "body": "Eska",
          "key": "${link_0}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        }
      ],
      "text": "Eska engaging herself to a reluctant Bolin."
    },
    {
      "body": "Varrick passed Bolin a wad of yuans for the purpose of bribing guards to release the captive rebels, suspecting that Unalaq had rigged the trial. Bolin, however, made the mistake of bribing two random spectators instead of Judge ${link_0}. As the trial progressed, Bolin attempted to object only to be ignored every time. During the recession, the earthbender once more attempted to break up with Eska, only for his attempt to backfire, as she decided to marry him at sunset and wrapped a ${link_1} around his neck. She dragged him off, forcing him and Pabu to wear Northern Water Tribe robes.",
      "links": [
        {
          "body": "Hotah",
          "key": "${link_0}",
          "target": {
            "href": "Hotah",
            "page": "Hotah"
          }
        },
        {
          "body": "betrothal necklace",
          "key": "${link_1}",
          "target": {
            "href": "Betrothal_necklace",
            "page": "Betrothal_necklace"
          }
        }
      ],
      "text": "Varrick passed Bolin a wad of yuans for the purpose of bribing guards to release the captive rebels, suspecting that Unalaq had rigged the trial. Bolin, however, made the mistake of bribing two random spectators instead of Judge Hotah. As the trial progressed, Bolin attempted to object only to be ignored every time. During the recession, the earthbender once more attempted to break up with Eska, only for his attempt to backfire, as she decided to marry him at sunset and wrapped a betrothal necklace around his neck. She dragged him off, forcing him and Pabu to wear Northern Water Tribe robes."
    },
    {
      "body": "Bolin and Pabu returned to their friends, who were plotting to break Tonraq and the rebels out of prison. While Korra, Mako, and Asami infiltrated the prison where they were being held, Bolin led the others to Varrick's yacht, the billionaire and his assistant, Zhu Li, hiding in the stuffed platypus bear. Bolin was stopped by Northern troops, who asked if the platypus bear was licensed, but managed to escape to the yacht when Varrick caused a distraction by scattering money about. Korra's party joined them shortly after and told them that the prisoners were being transferred to the North. The team took off on the yacht in hopes to catch up with the transport. After rescuing the prisoners and dropping them off to continue resistance against Unalaq, Bolin thanked Korra for making the breakup between him and Eska official. His relief soon changed to worry, however, when Varrick spotted an enraged Eska heading toward them. Eager to escape his ex, Bolin urged Varrick to speed away from her.",
      "links": [],
      "text": "Bolin and Pabu returned to their friends, who were plotting to break Tonraq and the rebels out of prison. While Korra, Mako, and Asami infiltrated the prison where they were being held, Bolin led the others to Varrick's yacht, the billionaire and his assistant, Zhu Li, hiding in the stuffed platypus bear. Bolin was stopped by Northern troops, who asked if the platypus bear was licensed, but managed to escape to the yacht when Varrick caused a distraction by scattering money about. Korra's party joined them shortly after and told them that the prisoners were being transferred to the North. The team took off on the yacht in hopes to catch up with the transport. After rescuing the prisoners and dropping them off to continue resistance against Unalaq, Bolin thanked Korra for making the breakup between him and Eska official. His relief soon changed to worry, however, when Varrick spotted an enraged Eska heading toward them. Eager to escape his ex, Bolin urged Varrick to speed away from her."
    },
    {
      "body": "${link_0} enjoying ${link_1} by night under ${link_2}'s care.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_2}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "text": "Bolin enjoying Republic City by night under Varrick's care."
    },
    {
      "body": "Upon arriving in Republic City, where Korra intended to get the ${link_0} to aid the South, news of civil war had already spread. While everyone had their own preoccupations for the day, Bolin was unsure of what to do, so Varrick decided to treat him to a night on the town. They attended the Pro-bending Arena as spectators and Bolin was personally interviewed by ${link_1}, earning his fans' applause whenever he spoke of them or Republic City. After the interview, Varrick told him that he found his true calling.",
      "links": [
        {
          "body": "United Forces",
          "key": "${link_0}",
          "target": {
            "href": "United_Forces",
            "page": "United_Forces"
          }
        },
        {
          "body": "Shiro Shinobi",
          "key": "${link_1}",
          "target": {
            "href": "Shiro_Shinobi",
            "page": "Shiro_Shinobi"
          }
        }
      ],
      "text": "Upon arriving in Republic City, where Korra intended to get the United Forces to aid the South, news of civil war had already spread. While everyone had their own preoccupations for the day, Bolin was unsure of what to do, so Varrick decided to treat him to a night on the town. They attended the Pro-bending Arena as spectators and Bolin was personally interviewed by Shiro Shinobi, earning his fans' applause whenever he spoke of them or Republic City. After the interview, Varrick told him that he found his true calling."
    },
    {
      "body": "The next day, after Varrick was done with his meeting with Korra and President ${link_0}, he returned to his yacht to show Bolin he could fire an arrow at his target blindfolded, only to miss several times, including nearly hitting Asami when she and Korra came on board to discuss their respective problems. Varrick began brainstorming by eating a hot pepper and hanging himself upside-down and hit an epiphany. He also proposed using his moving pictures as propaganda, with Bolin starring as Nuktuk, the hero character in the film.",
      "links": [
        {
          "body": "Raiko",
          "key": "${link_0}",
          "target": {
            "href": "Raiko",
            "page": "Raiko"
          }
        }
      ],
      "text": "The next day, after Varrick was done with his meeting with Korra and President Raiko, he returned to his yacht to show Bolin he could fire an arrow at his target blindfolded, only to miss several times, including nearly hitting Asami when she and Korra came on board to discuss their respective problems. Varrick began brainstorming by eating a hot pepper and hanging himself upside-down and hit an epiphany. He also proposed using his moving pictures as propaganda, with Bolin starring as Nuktuk, the hero character in the film."
    },
    {
      "body": "Bolin returned to his and Mako's apartment to tell him of what their friends had planned. Mako deplored their plan before focusing on trying to identify one of the bombers of last night's attack on the ${link_0}. Bolin indirectly helped by flipping a page of Mako's book, allowing him to identify the culprit.",
      "links": [
        {
          "body": "Southern Water Tribe Cultural Center",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe_Cultural_Center",
            "page": "Southern_Water_Tribe_Cultural_Center"
          }
        }
      ],
      "text": "Bolin returned to his and Mako's apartment to tell him of what their friends had planned. Mako deplored their plan before focusing on trying to identify one of the bombers of last night's attack on the Southern Water Tribe Cultural Center. Bolin indirectly helped by flipping a page of Mako's book, allowing him to identify the culprit."
    },
    {
      "body": "${link_0} starting his acting career as \"Nuktuk, hero of the South\".",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        }
      ],
      "text": "Bolin starting his acting career as \"Nuktuk, hero of the South\"."
    },
    {
      "body": "Bolin later started up his acting career as he and Varrick started filming, though he criticized why his character would be wearing light clothing. Then suddenly, Korra came in, asking Bolin to watch Naga for her and Varrick for a speedboat, explaining that Raiko had found out about their plan and stopped her, so she intended to go to the ${link_0} to aid. She also wondered who could have tipped Raiko off, forcing Bolin to confess that he told Mako, prompting the Avatar to storm off to confront him.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "Bolin later started up his acting career as he and Varrick started filming, though he criticized why his character would be wearing light clothing. Then suddenly, Korra came in, asking Bolin to watch Naga for her and Varrick for a speedboat, explaining that Raiko had found out about their plan and stopped her, so she intended to go to the Fire Nation to aid. She also wondered who could have tipped Raiko off, forcing Bolin to confess that he told Mako, prompting the Avatar to storm off to confront him."
    },
    {
      "body": "Bolin attended the premiere of the Nuktuk film, which earned positive reception among the young audiences. Varrick predicted that their film series would eventually pressure Raiko into assisting the South. Bolin turned to Ginger and attempted to court her but she was obviously uninterested.",
      "links": [],
      "text": "Bolin attended the premiere of the Nuktuk film, which earned positive reception among the young audiences. Varrick predicted that their film series would eventually pressure Raiko into assisting the South. Bolin turned to Ginger and attempted to court her but she was obviously uninterested."
    },
    {
      "body": "Bolin soon began enjoying the perks of being a star, as he redecorated his and Mako's apartment with a marble statue of himself that double as a hat stand and a hot tub. When Mako arrived home, he attempted to enlist his brother's aid in determining who was intercepting Future Industries shipments, Bolin spitefully refused, wanting to continue relaxing and to get back at his brother for refusing to help him in the past. Mako left, but not before spitefully firebending his tub's heater, causing it to erupt with hot steam, leaving Bolin in pain.",
      "links": [],
      "text": "Bolin soon began enjoying the perks of being a star, as he redecorated his and Mako's apartment with a marble statue of himself that double as a hat stand and a hot tub. When Mako arrived home, he attempted to enlist his brother's aid in determining who was intercepting Future Industries shipments, Bolin spitefully refused, wanting to continue relaxing and to get back at his brother for refusing to help him in the past. Mako left, but not before spitefully firebending his tub's heater, causing it to erupt with hot steam, leaving Bolin in pain."
    },
    {
      "body": "${link_0} is left in confusion about the difference between ${link_1}, the person, and Ginger, the character.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Ginger",
          "key": "${link_1}",
          "target": {
            "href": "Ginger",
            "page": "Ginger"
          }
        }
      ],
      "text": "Bolin is left in confusion about the difference between Ginger, the person, and Ginger, the character."
    },
    {
      "body": "While doing another scene with Ginger, Bolin deviated from the script to kiss her instead of freeing her. Though initially disapproving, Varrick quickly changed his opinion to Bolin's on-set improvisation. Afterward, Bolin made another attempt at Ginger, but she coldly told him that her interest in him was only from her character to his, and not in real life as well, though Bolin appeared to be confused as to what the difference was.",
      "links": [],
      "text": "While doing another scene with Ginger, Bolin deviated from the script to kiss her instead of freeing her. Though initially disapproving, Varrick quickly changed his opinion to Bolin's on-set improvisation. Afterward, Bolin made another attempt at Ginger, but she coldly told him that her interest in him was only from her character to his, and not in real life as well, though Bolin appeared to be confused as to what the difference was."
    },
    {
      "body": "The next day, Mako came by the set looking for Varrick, but Bolin refused to acknowledge him until he was addressed as Nuktuk. After a brief conversation, he excused himself to do another scene, in which Nuktuk was running to save Ginger, while explosions were going off behind him due to the use of pyrotechnics.",
      "links": [],
      "text": "The next day, Mako came by the set looking for Varrick, but Bolin refused to acknowledge him until he was addressed as Nuktuk. After a brief conversation, he excused himself to do another scene, in which Nuktuk was running to save Ginger, while explosions were going off behind him due to the use of pyrotechnics."
    },
    {
      "body": "${link_0} was shocked to find out that ${link_1} and ${link_2} were dating again, only a week after ${link_3}'s departure.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Korra",
          "key": "${link_3}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Bolin was shocked to find out that Mako and Asami were dating again, only a week after Korra's departure."
    },
    {
      "body": "A few days later, Bolin shot a scene in which Nuktuk was captured and suspended upside down. However, even after the filming had ended, he was left hanging there, and it was in this position that he encountered Asami venturing on stage, who had been invited by Varrick to view the filming process. The duo was soon joined by Mako, who informed them of his suspicions about Varrick being the mastermind behind the attacks on Future Industries' warehouses. Protective over his new friend and producer, Bolin refused to believe his brother. When the firebender snapped at Asami for pointing out that he was stressed, Bolin calmly stated that Mako's stress level was exactly the reason why he had needed to move out. The earthbender quickly grew suspicious, however, when he noticed the closeness and brewing intimacy between Mako and Asami. Concluding that the two were dating again, he indignantly shouted out against it, pointing out that Korra had only been gone for a week. Mako and Asami refused to go deeper into the subject, and when Mako continued to incriminate Varrick, Bolin told his brother to just let it go, much to the annoyance of the firebender, who snapped at the earthbender.",
      "links": [],
      "text": "A few days later, Bolin shot a scene in which Nuktuk was captured and suspended upside down. However, even after the filming had ended, he was left hanging there, and it was in this position that he encountered Asami venturing on stage, who had been invited by Varrick to view the filming process. The duo was soon joined by Mako, who informed them of his suspicions about Varrick being the mastermind behind the attacks on Future Industries' warehouses. Protective over his new friend and producer, Bolin refused to believe his brother. When the firebender snapped at Asami for pointing out that he was stressed, Bolin calmly stated that Mako's stress level was exactly the reason why he had needed to move out. The earthbender quickly grew suspicious, however, when he noticed the closeness and brewing intimacy between Mako and Asami. Concluding that the two were dating again, he indignantly shouted out against it, pointing out that Korra had only been gone for a week. Mako and Asami refused to go deeper into the subject, and when Mako continued to incriminate Varrick, Bolin told his brother to just let it go, much to the annoyance of the firebender, who snapped at the earthbender."
    },
    {
      "body": "On the night of the final Nuktuk mover, Bolin paid a visit to Mako in jail, who was accused of working with triads to steal from Future Industries. Though Mako insisted that Varrick framed him, Bolin thought he was pleading insanity. However, his brother warned that Varrick may be planning something at the finale, though Bolin did not take him seriously. He left, promising to later bring him an attorney.",
      "links": [],
      "text": "On the night of the final Nuktuk mover, Bolin paid a visit to Mako in jail, who was accused of working with triads to steal from Future Industries. Though Mako insisted that Varrick framed him, Bolin thought he was pleading insanity. However, his brother warned that Varrick may be planning something at the finale, though Bolin did not take him seriously. He left, promising to later bring him an attorney."
    },
    {
      "body": "${link_0} defeated three ${link_1} assailants, stopping ${link_2}'s ${link_3}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_2}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "attempted kidnapping of President Raiko",
          "key": "${link_3}",
          "target": {
            "href": "Attempted_kidnapping_of_President_Raiko",
            "page": "Attempted_kidnapping_of_President_Raiko"
          }
        }
      ],
      "text": "Bolin defeated three waterbending assailants, stopping Varrick's attempted kidnapping of President Raiko."
    },
    {
      "body": "Arriving at the Pro-bending Arena with Ginger, Bolin grew excited when Shiro announced the both of them as a couple, to which Ginger criticized him for failing to see that they were only a couple in public. As the mover reached the part where Juji, Pabu's character, died, Bolin got up and went outside. As Asami joined him, Bolin lamented how broken Team Avatar had recently become. As Asami returned inside, Bolin spotted a boat docked nearby and, upon investigating, discovered Detectives ${link_0} bound and gagged in a locker. He freed them and was warned that waterbenders were after President Raiko. Bolin managed to save Raiko and his wife from being kidnapped and engaged the waterbenders on the pro-bending floor. When he knocked out all but one, he forced his opponent to confess that Varrick was the mastermind behind this attempt.",
      "links": [
        {
          "body": "Lu and Gang",
          "key": "${link_0}",
          "target": {
            "href": "Lu_and_Gang",
            "page": "Lu_and_Gang"
          }
        }
      ],
      "text": "Arriving at the Pro-bending Arena with Ginger, Bolin grew excited when Shiro announced the both of them as a couple, to which Ginger criticized him for failing to see that they were only a couple in public. As the mover reached the part where Juji, Pabu's character, died, Bolin got up and went outside. As Asami joined him, Bolin lamented how broken Team Avatar had recently become. As Asami returned inside, Bolin spotted a boat docked nearby and, upon investigating, discovered Detectives Lu and Gang bound and gagged in a locker. He freed them and was warned that waterbenders were after President Raiko. Bolin managed to save Raiko and his wife from being kidnapped and engaged the waterbenders on the pro-bending floor. When he knocked out all but one, he forced his opponent to confess that Varrick was the mastermind behind this attempt."
    },
    {
      "body": "While being lauded as a hero for saving ${link_0} ${link_1} and the ${link_2}, ${link_3} was surprised to be kissed by ${link_4}.",
      "links": [
        {
          "body": "President",
          "key": "${link_0}",
          "target": {
            "href": "President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_1}",
          "target": {
            "href": "Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "First Lady",
          "key": "${link_2}",
          "target": {
            "href": "Buttercup_Raiko",
            "page": "Buttercup_Raiko"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_3}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Ginger",
          "key": "${link_4}",
          "target": {
            "href": "Ginger",
            "page": "Ginger"
          }
        }
      ],
      "text": "While being lauded as a hero for saving President Raiko and the First Lady, Bolin was surprised to be kissed by Ginger."
    },
    {
      "body": "While Varrick was arrested, Bolin was lauded as a hero, and Ginger ran up and kissed him, much to his confusion. He quickly got over his confusion when she kissed him again. They were eventually broken up when Asami intervened, drawing his attention to the fact that Mako was still wrongfully imprisoned. As they left the arena to head toward the police station, Korra arrived with Tenzin and his family, appealing to Raiko for military aid to the South since Unalaq was planning on unleashing the dark spirit Vaatu, who would destroy the world. However, Raiko once again refused, believing it best to hold the United Forces to defend the United Republic. Bolin attempted to sway him, quoting a line from his mover, but Raiko, though grateful to the young earthbender for having saved his life, would not be swayed, causing Bolin to note that he regretted having done so.",
      "links": [],
      "text": "While Varrick was arrested, Bolin was lauded as a hero, and Ginger ran up and kissed him, much to his confusion. He quickly got over his confusion when she kissed him again. They were eventually broken up when Asami intervened, drawing his attention to the fact that Mako was still wrongfully imprisoned. As they left the arena to head toward the police station, Korra arrived with Tenzin and his family, appealing to Raiko for military aid to the South since Unalaq was planning on unleashing the dark spirit Vaatu, who would destroy the world. However, Raiko once again refused, believing it best to hold the United Forces to defend the United Republic. Bolin attempted to sway him, quoting a line from his mover, but Raiko, though grateful to the young earthbender for having saved his life, would not be swayed, causing Bolin to note that he regretted having done so."
    },
    {
      "body": "Bolin left with the others to the police headquarters where he witnessed his brother's release and reconciled with him. He was surprised to see Korra run up and kiss Mako though remained silent about Mako's recent romantic outings with Asami. When the conversation soon came to the subject of how to break through to the ${link_0}, Bolin brought everyone before Varrick, who provided them with his battleship, the Zhu Li, which held all of Future Industries' machines.",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        }
      ],
      "text": "Bolin left with the others to the police headquarters where he witnessed his brother's release and reconciled with him. He was surprised to see Korra run up and kiss Mako though remained silent about Mako's recent romantic outings with Asami. When the conversation soon came to the subject of how to break through to the South Pole, Bolin brought everyone before Varrick, who provided them with his battleship, the Zhu Li, which held all of Future Industries' machines."
    },
    {
      "body": "En route to the South Pole, Bolin quickly took to the luxuries aboard the Zhu Li but lost the back of his pants in a ${link_0} tank. He then asked Mako whether to inform Korra about their breakup, reminding his brother of his previous advice regarding his breakup with Eska. However, Mako hesitated after witnessing Korra firebend a practice dummy's head off.",
      "links": [
        {
          "body": "catgator",
          "key": "${link_0}",
          "target": {
            "href": "Catgator",
            "page": "Catgator"
          }
        }
      ],
      "text": "En route to the South Pole, Bolin quickly took to the luxuries aboard the Zhu Li but lost the back of his pants in a catgator tank. He then asked Mako whether to inform Korra about their breakup, reminding his brother of his previous advice regarding his breakup with Eska. However, Mako hesitated after witnessing Korra firebend a practice dummy's head off."
    },
    {
      "body": "Moved by ${link_0}'s declaration of love, ${link_1} kissed her former fiancé and subsequently released him and ${link_2}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Eska",
          "key": "${link_1}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "his brother",
          "key": "${link_2}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "Moved by Bolin's declaration of love, Eska kissed her former fiancé and subsequently released him and his brother."
    },
    {
      "body": "Arriving at the White Lotus compound, the party discussed how to break through to the ${link_0}. Asami came up with a plan for them to attack by air. She, Mako and Bolin rode a biplane in the assault. Bolin earthbent a number of explosives against mecha tanks and remotely detonated them; he remarked that if Varrick were there, they'd be able to caption Nuktuk as a sky hero. Soon Desna and Eska joined the fighting and crippled the trio's biplane, causing it to crash, and captured them. They were soon freed by Bumi, Naga, and Pabu, and they continued onto the spirit portal. As Korra devised a plan to stop Unalaq and Vaatu, Bolin asked whether they'd face a worst-case scenario where she fails and they all get trapped in the Spirit World, the Avatar said that it'd be an honor to fight beside them. They then entered the Spirit World. While Tenzin, Kya and Bumi went searching for ${link_1}, Mako, and Bolin fought against Unalaq while Korra closed the Southern portal. Ultimately, the brothers were beaten, as the Harmonic Convergence freed Vaatu from the ${link_2}.",
      "links": [
        {
          "body": "spirit portal",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_1}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Tree of Time",
          "key": "${link_2}",
          "target": {
            "href": "Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "text": "Arriving at the White Lotus compound, the party discussed how to break through to the spirit portal. Asami came up with a plan for them to attack by air. She, Mako and Bolin rode a biplane in the assault. Bolin earthbent a number of explosives against mecha tanks and remotely detonated them; he remarked that if Varrick were there, they'd be able to caption Nuktuk as a sky hero. Soon Desna and Eska joined the fighting and crippled the trio's biplane, causing it to crash, and captured them. They were soon freed by Bumi, Naga, and Pabu, and they continued onto the spirit portal. As Korra devised a plan to stop Unalaq and Vaatu, Bolin asked whether they'd face a worst-case scenario where she fails and they all get trapped in the Spirit World, the Avatar said that it'd be an honor to fight beside them. They then entered the Spirit World. While Tenzin, Kya and Bumi went searching for Jinora, Mako, and Bolin fought against Unalaq while Korra closed the Southern portal. Ultimately, the brothers were beaten, as the Harmonic Convergence freed Vaatu from the Tree of Time."
    },
    {
      "body": "Korra used firebending to separate Unalaq and Vaatu before airbending her uncle back through the portal, and ordered both Mako and Bolin to keep him out of the Spirit World. The two brothers briefly held off the Northern Chief for a time before being ambushed by Desna and Eska, enabling Unalaq to re-enter the portal. The brothers managed to escape and followed the waterbender back through the portal, but they barely made a few steps before being encased in ice by the twins, and thus helplessly witnessed Unalaq succeed in merging with Vaatu, becoming the ${link_0}. While Mako failed to reason with the twins, Bolin, emotionally distraught about the end of the world, admitted his regret over not marrying Eska. Shocked by this, Eska demanded to know why Bolin ran away, to which he simply stated he was afraid of his feelings. Finding Bolin's words true, she kissed him and let the brothers go free. While Mako believed it to be an act by Bolin, Bolin realized that he truly meant it all. They returned to the physical world and rushed to aid Korra as the Dark Avatar ripped the light spirit ${link_1} right out of her, but were too late to save the light spirit. As they helped Korra up, the three were witness to Unalaq transforming into a massive dark spirit and reached toward the spirit lights and vanished, causing a shockwave that knocked them out.",
      "links": [
        {
          "body": "Dark Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Dark_Avatar",
            "page": "Dark_Avatar"
          }
        },
        {
          "body": "Raava",
          "key": "${link_1}",
          "target": {
            "href": "Raava",
            "page": "Raava"
          }
        }
      ],
      "text": "Korra used firebending to separate Unalaq and Vaatu before airbending her uncle back through the portal, and ordered both Mako and Bolin to keep him out of the Spirit World. The two brothers briefly held off the Northern Chief for a time before being ambushed by Desna and Eska, enabling Unalaq to re-enter the portal. The brothers managed to escape and followed the waterbender back through the portal, but they barely made a few steps before being encased in ice by the twins, and thus helplessly witnessed Unalaq succeed in merging with Vaatu, becoming the Dark Avatar. While Mako failed to reason with the twins, Bolin, emotionally distraught about the end of the world, admitted his regret over not marrying Eska. Shocked by this, Eska demanded to know why Bolin ran away, to which he simply stated he was afraid of his feelings. Finding Bolin's words true, she kissed him and let the brothers go free. While Mako believed it to be an act by Bolin, Bolin realized that he truly meant it all. They returned to the physical world and rushed to aid Korra as the Dark Avatar ripped the light spirit Raava right out of her, but were too late to save the light spirit. As they helped Korra up, the three were witness to Unalaq transforming into a massive dark spirit and reached toward the spirit lights and vanished, causing a shockwave that knocked them out."
    },
    {
      "body": "${link_0} was healed along with ${link_1} and ${link_2} by ${link_3} in a pool of spirit water.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_2}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Kya",
          "key": "${link_3}",
          "target": {
            "href": "Kya",
            "page": "Kya"
          }
        }
      ],
      "text": "Bolin was healed along with Korra and Mako by Kya in a pool of spirit water."
    },
    {
      "body": "The trio were recovered by Tenzin and his siblings, who brought them back to the Spirit World to use ${link_0} to heal them. As Korra explained her failure to save Raava, Bolin asks if she could ask one of her past lives for advice, to which she says that she had lost that connection. However, Tenzin assured Korra that there was still hope and guided her into the Tree of Time. The group witnessed Korra's spirit manifesting to giant size and vanishing through the combined spirit portal. They then spotted a horde of dark spirits attempting to attack Korra's body, so the group fought in her defense. In the midst of the fighting, Bolin was snagged by the leg but was saved by Desna and Eska. Bolin proclaimed his love for Eska and kissed her on the cheek. But eventually the dark spirits started to overwhelm them, forcing the party into the Tree of Time's hollow. Afterward, Korra's spirit, Raava, and Jinora returned, causing the dark spirits to vanish in a bright light. The party was then witness to Korra re-fusing with Raava, recreating the Avatar Spirit.",
      "links": [
        {
          "body": "spirit water",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_water",
            "page": "Spirit_water"
          }
        }
      ],
      "text": "The trio were recovered by Tenzin and his siblings, who brought them back to the Spirit World to use spirit water to heal them. As Korra explained her failure to save Raava, Bolin asks if she could ask one of her past lives for advice, to which she says that she had lost that connection. However, Tenzin assured Korra that there was still hope and guided her into the Tree of Time. The group witnessed Korra's spirit manifesting to giant size and vanishing through the combined spirit portal. They then spotted a horde of dark spirits attempting to attack Korra's body, so the group fought in her defense. In the midst of the fighting, Bolin was snagged by the leg but was saved by Desna and Eska. Bolin proclaimed his love for Eska and kissed her on the cheek. But eventually the dark spirits started to overwhelm them, forcing the party into the Tree of Time's hollow. Afterward, Korra's spirit, Raava, and Jinora returned, causing the dark spirits to vanish in a bright light. The party was then witness to Korra re-fusing with Raava, recreating the Avatar Spirit."
    },
    {
      "body": "After Korra addressed her cousins over Unalaq's demise, Bolin walks up to Eska and suggests that she move back with him to Republic City, only for her to decline. Thinking that she would not want to leave her brother, Bolin agrees that Desna can join her. However, Eska clarified that she and Desna had to return home and confessed that she was only caught up in the moment when she kissed him, but promised that he would have a special place \"in the organ that pumps [her] blood\".",
      "links": [],
      "text": "After Korra addressed her cousins over Unalaq's demise, Bolin walks up to Eska and suggests that she move back with him to Republic City, only for her to decline. Thinking that she would not want to leave her brother, Bolin agrees that Desna can join her. However, Eska clarified that she and Desna had to return home and confessed that she was only caught up in the moment when she kissed him, but promised that he would have a special place \"in the organ that pumps [her] blood\"."
    },
    {
      "body": "Returning to the physical world after Korra decided to keep the spirit portals open, Bolin gave Mako a hug after he and Korra parted on good terms.",
      "links": [],
      "text": "Returning to the physical world after Korra decided to keep the spirit portals open, Bolin gave Mako a hug after he and Korra parted on good terms."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Bolin_(171_AG_-_Harmonic_Convergence)",
    "file": "avatar.wikia.com/wiki/History_of_Bolin_(171_AG_-_Harmonic_Convergence).html",
    "page": "History_of_Bolin_(171_AG_-_Harmonic_Convergence)",
    "title": "History of Bolin (171 AG - Harmonic Convergence)"
  }
}