{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Born to the owner of ${link_0}, ${link_1}, and his wife ${link_2}, ${link_3} was raised in the high society of ${link_4}. Although a nonbender, she is a capable fighter and a valuable part of ${link_5}, helping them in their fight against the ${link_6}.",
      "links": [
        {
          "body": "Future Industries",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries",
            "page": "Future_Industries"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Yasuko",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Yasuko",
            "page": "Yasuko"
          }
        },
        {
          "body": "Asami",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Anti-bending Revolution",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Anti-bending_Revolution",
            "page": "Anti-bending_Revolution"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)"
      ],
      "text": "Born to the owner of Future Industries, Hiroshi Sato, and his wife Yasuko, Asami was raised in the high society of Republic City. Although a nonbender, she is a capable fighter and a valuable part of Team Avatar, helping them in their fight against the Anti-bending Revolution."
    },
    {
      "body": "When Asami was six, her mother was killed during a break-in and robbery of ${link_0} by the ${link_1}. However, the fact that her father forever held a grudge against all benders for her death was unknown to young Asami. After her mother's murder, Hiroshi had Asami trained by the best self-defense teachers money could buy to ensure she would always be able to protect herself. As she grew, she lived a life of luxury, but despite her fancy clothes and polite manners, Asami also developed a tough side and is unafraid to stand up for what she believes in. Along with her hand-to-hand combat skills, she also became an expert driver due to her testing Satomobiles for her father's company. She was also a big fan of ${link_2}, attending every match she could.",
      "links": [
        {
          "body": "their mansion",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sato_estate",
            "page": "Sato_estate"
          }
        },
        {
          "body": "Agni Kai Triad",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Agni_Kai_Triad",
            "page": "Agni_Kai_Triad"
          }
        },
        {
          "body": "pro-bending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending",
            "page": "Pro-bending"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Early life"
      ],
      "text": "When Asami was six, her mother was killed during a break-in and robbery of their mansion by the Agni Kai Triad. However, the fact that her father forever held a grudge against all benders for her death was unknown to young Asami. After her mother's murder, Hiroshi had Asami trained by the best self-defense teachers money could buy to ensure she would always be able to protect herself. As she grew, she lived a life of luxury, but despite her fancy clothes and polite manners, Asami also developed a tough side and is unafraid to stand up for what she believes in. Along with her hand-to-hand combat skills, she also became an expert driver due to her testing Satomobiles for her father's company. She was also a big fan of pro-bending, attending every match she could."
    },
    {
      "body": "While riding her moped through ${link_0}, Asami accidentally ran into ${link_1} when he suddenly appeared from behind a car and crossed the road without looking, trying to catch the ${link_2}. Helping him up, she apologized profusely, and when Mako brushed off her apologies, noting that his brother hit him harder than that every day at practice, she recognized him as a member of the ${link_3}. To make up for the accident, she invited him to dinner at an ${link_4} ${link_5}, even going so far as to make sure he was provided with the proper attire for it.",
      "links": [
        {
          "body": "Republic City",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "trolley",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Trolley",
            "page": "Trolley"
          }
        },
        {
          "body": "Fire Ferrets",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        },
        {
          "body": "upper-class",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Society_in_the_World_of_Avatar",
            "page": "Society_in_the_World_of_Avatar"
          }
        },
        {
          "body": "restaurant",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Kwong%27s_Cuisine",
            "page": "Kwong%27s_Cuisine"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Meeting Mako"
      ],
      "text": "While riding her moped through Republic City, Asami accidentally ran into Mako when he suddenly appeared from behind a car and crossed the road without looking, trying to catch the trolley. Helping him up, she apologized profusely, and when Mako brushed off her apologies, noting that his brother hit him harder than that every day at practice, she recognized him as a member of the Fire Ferrets. To make up for the accident, she invited him to dinner at an upper-class restaurant, even going so far as to make sure he was provided with the proper attire for it."
    },
    {
      "body": "During their date the following night, she informed Mako that she was a big pro-bending fan and that she had caught all of the Fire Ferrets' matches that season. As she expressed her excitement to see Mako play in the tournament, she learned that the team had not acquired the amount of money needed to compete. When the waiter arrived carrying their main course, he addressed her as \"Miss Sato\". When Mako inquired if she was related to Hiroshi Sato, she confirmed by stating the latter was her father and invited Mako to meet him, an offer he readily accepted.",
      "links": [],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Meeting Mako"
      ],
      "text": "During their date the following night, she informed Mako that she was a big pro-bending fan and that she had caught all of the Fire Ferrets' matches that season. As she expressed her excitement to see Mako play in the tournament, she learned that the team had not acquired the amount of money needed to compete. When the waiter arrived carrying their main course, he addressed her as \"Miss Sato\". When Mako inquired if she was related to Hiroshi Sato, she confirmed by stating the latter was her father and invited Mako to meet him, an offer he readily accepted."
    },
    {
      "body": "Asami headed home and told her father about the Fire Ferrets hard earned success in the Pro-bending Arena as well their poor financial state. When she introduced Mako to Hiroshi at ${link_0} the next day, she politely cut her father short when he got carried away telling the story of his empire growing from an idea and from one selfless loan, since she wanted him to tell Mako some good news instead; Future Industries was going to sponsor the Fire Ferrets in the championship tournament.",
      "links": [
        {
          "body": "Future Industries",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries",
            "page": "Future_Industries"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Meeting Mako"
      ],
      "text": "Asami headed home and told her father about the Fire Ferrets hard earned success in the Pro-bending Arena as well their poor financial state. When she introduced Mako to Hiroshi at Future Industries the next day, she politely cut her father short when he got carried away telling the story of his empire growing from an idea and from one selfless loan, since she wanted him to tell Mako some good news instead; Future Industries was going to sponsor the Fire Ferrets in the championship tournament."
    },
    {
      "body": "Mako later accompanied Asami to a gala ${link_0} ${link_1} threw in ${link_2} ${link_3}'s honor at ${link_4}, where she was introduced to Korra. She amiably greeted the Avatar, commenting that she had heard so much about her from Mako. However, her polite introduction sparked a rather jealous reaction from Korra.",
      "links": [
        {
          "body": "Councilman",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "City Hall",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/City_Hall",
            "page": "City_Hall"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Meeting Mako"
      ],
      "text": "Mako later accompanied Asami to a gala Councilman Tarrlok threw in Avatar Korra's honor at City Hall, where she was introduced to Korra. She amiably greeted the Avatar, commenting that she had heard so much about her from Mako. However, her polite introduction sparked a rather jealous reaction from Korra."
    },
    {
      "body": "Her relationship with Mako continued to grow during the ensuing weeks. During a heart-felt carriage ride through ${link_0}, she asked him why he was not wearing the new scarf she bought him, to which Mako answered that, while he appreciated the gesture, his scarf used to belong to his father and it was the only remaining part of him he had. In return, Asami told him that she lost her mother when she was very young as well. The conversation ended when she rested against Mako, stating that she felt \"so safe\" with him.",
      "links": [
        {
          "body": "Republic City Park",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar_Korra_Park",
            "page": "Avatar_Korra_Park"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Meeting Mako"
      ],
      "text": "Her relationship with Mako continued to grow during the ensuing weeks. During a heart-felt carriage ride through Republic City Park, she asked him why he was not wearing the new scarf she bought him, to which Mako answered that, while he appreciated the gesture, his scarf used to belong to his father and it was the only remaining part of him he had. In return, Asami told him that she lost her mother when she was very young as well. The conversation ended when she rested against Mako, stating that she felt \"so safe\" with him."
    },
    {
      "body": "On the morning of the ${link_0}, Asami entered the gym where the Fire Ferrets had been training and presented the team with their new uniforms. After she affectionately greeted Mako with \"sweetie\", the two rubbed noses, and they left together to go on a lunch date. Asami was present at every tournament match, keeping an eye on ${link_1}, and afterward always came to the locker room to congratulate the team, especially Mako, for their victories.",
      "links": [
        {
          "body": "Pro-bending Tournament",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending#Pro-bending_Tournament",
            "page": "Pro-bending"
          }
        },
        {
          "body": "Pabu",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pabu",
            "page": "Pabu"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Supporting the Fire Ferrets"
      ],
      "text": "On the morning of the Pro-bending Tournament, Asami entered the gym where the Fire Ferrets had been training and presented the team with their new uniforms. After she affectionately greeted Mako with \"sweetie\", the two rubbed noses, and they left together to go on a lunch date. Asami was present at every tournament match, keeping an eye on Pabu, and afterward always came to the locker room to congratulate the team, especially Mako, for their victories."
    },
    {
      "body": "As the Fire Ferrets entered the ring for the Pro-bending Championship finals, Asami blew Mako a kiss from afar, which he returned with the same gesture, to Korra's slight annoyance.",
      "links": [],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Supporting the Fire Ferrets"
      ],
      "text": "As the Fire Ferrets entered the ring for the Pro-bending Championship finals, Asami blew Mako a kiss from afar, which he returned with the same gesture, to Korra's slight annoyance."
    },
    {
      "body": "After the ${link_0} on the ${link_1}, Asami offered Mako and ${link_2} a place to stay at her family's estate. However, she had not cleared it with her father first, remarking that it was easier to ask for forgiveness than permission. When Korra came to visit the next day, Asami took her and the brothers to ${link_3} where Future Industries test-drives its new ${link_4}. Noticing Korra's interest, she invited the Avatar to take a drive with her. Since Korra did not know how to drive one, she sat behind Asami and together they raced one of the test drivers. After driving in second place nearly the entire course, Asami managed to pass the other driver and win the race. When Asami told Korra that people should not be afraid to mix it up sometimes, Korra apologized for having judged her so quickly. Asami did not mind, as the majority of people thought of her as a helpless rich girl when she was actually quite capable of taking good care of herself, being a competitive driver and an expert in self-defense techniques.",
      "links": [
        {
          "body": "Equalist attack",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Attack_on_the_Pro-bending_Arena",
            "page": "Attack_on_the_Pro-bending_Arena"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "the racetrack",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries_test_course",
            "page": "Future_Industries_test_course"
          }
        },
        {
          "body": "Satomobiles",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Satomobile",
            "page": "Satomobile"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Gaining Korra's approval"
      ],
      "text": "After the Equalist attack on the Pro-bending Arena, Asami offered Mako and Bolin a place to stay at her family's estate. However, she had not cleared it with her father first, remarking that it was easier to ask for forgiveness than permission. When Korra came to visit the next day, Asami took her and the brothers to the racetrack where Future Industries test-drives its new Satomobiles. Noticing Korra's interest, she invited the Avatar to take a drive with her. Since Korra did not know how to drive one, she sat behind Asami and together they raced one of the test drivers. After driving in second place nearly the entire course, Asami managed to pass the other driver and win the race. When Asami told Korra that people should not be afraid to mix it up sometimes, Korra apologized for having judged her so quickly. Asami did not mind, as the majority of people thought of her as a helpless rich girl when she was actually quite capable of taking good care of herself, being a competitive driver and an expert in self-defense techniques."
    },
    {
      "body": "The next day, however, Korra accused Hiroshi of having ties with the Equalists and despite their newfound respect for each other, Asami refused to believe her. She rushed to her father's defense, claiming that they not being benders did not imply they supported the Equalist movement, even calling Amon and his supporters \"monsters\". As ${link_0}, ${link_1}, and the ${link_2} continued their investigation of Future Industries, Asami showed complete disapproval and disgust toward them, accusing them of lying just to persecute her father. She aided them nonetheless to show that Hiroshi was innocent of any wrongdoing.",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Lin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Metalbending Police Force",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "A startling discovery"
      ],
      "text": "The next day, however, Korra accused Hiroshi of having ties with the Equalists and despite their newfound respect for each other, Asami refused to believe her. She rushed to her father's defense, claiming that they not being benders did not imply they supported the Equalist movement, even calling Amon and his supporters \"monsters\". As Tenzin, Lin, and the Metalbending Police Force continued their investigation of Future Industries, Asami showed complete disapproval and disgust toward them, accusing them of lying just to persecute her father. She aided them nonetheless to show that Hiroshi was innocent of any wrongdoing."
    },
    {
      "body": "When Lin used her ${link_0} to discover a hidden tunnel underneath Hiroshi's workshop, Asami was completely taken aback. Desperate to know the truth, she wanted to investigate the tunnel herself, but was halted by Lin who ordered her to stay behind with Mako and Bolin under supervision of ${link_1} for safety. After a suspicious sound came from the tunnel, Mako and Bolin overpowered their guard and headed down to investigate. Again, Asami was asked to stay behind, this time by Mako who wanted to keep her safe.",
      "links": [
        {
          "body": "seismic sense",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Seismic_sense",
            "page": "Seismic_sense"
          }
        },
        {
          "body": "Officer Song",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Song_(officer)",
            "page": "Song_(officer)"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "A startling discovery"
      ],
      "text": "When Lin used her seismic sense to discover a hidden tunnel underneath Hiroshi's workshop, Asami was completely taken aback. Desperate to know the truth, she wanted to investigate the tunnel herself, but was halted by Lin who ordered her to stay behind with Mako and Bolin under supervision of Officer Song for safety. After a suspicious sound came from the tunnel, Mako and Bolin overpowered their guard and headed down to investigate. Again, Asami was asked to stay behind, this time by Mako who wanted to keep her safe."
    },
    {
      "body": "However, Asami did not listen and ventured down anyway, discovering the ${link_0} where her father and the ${link_1} were about to attack Mako and her other friends. Completely heartbroken upon discovering her father's true allegiances, she sadly asked him why he had chosen to support Amon. Hiroshi told her that benders stole the love of his life and were responsible for her growing up without a mother. Believing that benders had completely ruined the world and that Amon would change things for the better, he took off one of his ${link_2} and offered it to her, hoping that she would join him as part of the Equalists. Hesitating, a deeply conflicted Asami accepted it. However, after telling her dad that she loved him, she used the glove to electroshock him, completely surprising Mako, Korra and the others as her father tumbled to the ground. As the Lieutenant quickly came to Hiroshi's defense, Asami had no trouble knocking one of his ${link_3} out of his hand and shocking him with the other, successfully incapacitating him, which allowed her to escape with Korra, Tenzin, Lin, Bolin, and Mako. Heartbroken, she stared at her home from the ${link_4} as they made their way back to the city. Mako came to console her and she buried her face into his body.",
      "links": [
        {
          "body": "hidden factory",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Equalist_factory",
            "page": "Equalist_factory"
          }
        },
        {
          "body": "Lieutenant",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "electrified gloves",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Electrified_glove",
            "page": "Electrified_glove"
          }
        },
        {
          "body": "kali sticks",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Electrified_kali_sticks",
            "page": "Electrified_kali_sticks"
          }
        },
        {
          "body": "police airship",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Police_airship",
            "page": "Police_airship"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "A startling discovery"
      ],
      "text": "However, Asami did not listen and ventured down anyway, discovering the hidden factory where her father and the Lieutenant were about to attack Mako and her other friends. Completely heartbroken upon discovering her father's true allegiances, she sadly asked him why he had chosen to support Amon. Hiroshi told her that benders stole the love of his life and were responsible for her growing up without a mother. Believing that benders had completely ruined the world and that Amon would change things for the better, he took off one of his electrified gloves and offered it to her, hoping that she would join him as part of the Equalists. Hesitating, a deeply conflicted Asami accepted it. However, after telling her dad that she loved him, she used the glove to electroshock him, completely surprising Mako, Korra and the others as her father tumbled to the ground. As the Lieutenant quickly came to Hiroshi's defense, Asami had no trouble knocking one of his kali sticks out of his hand and shocking him with the other, successfully incapacitating him, which allowed her to escape with Korra, Tenzin, Lin, Bolin, and Mako. Heartbroken, she stared at her home from the police airship as they made their way back to the city. Mako came to console her and she buried her face into his body."
    },
    {
      "body": "After escaping the factory, Asami, along with Mako and Bolin, moved to Air Temple Island, where they were greeted by Korra, ${link_0}, ${link_1}, and ${link_2}. Asami was told by Meelo that she was beautiful and was asked for a lock of her hair. Korra and Ikki showed Asami her room on the island, where Asami was told by the ${link_3} that Korra also liked Mako. Asami reacted with mild confusion and discomfort, stating that she was not really aware of that, but decided not to act on it. An embarrassed Korra quickly led her to her room and slammed the door on Ikki, leaving the two teenagers by themselves. When Korra apologized for the rustic nature of the abode, Asami quickly put the Avatar at ease by stating that the room was charming and did not remind her of her father, which were all good things in her opinion. Later, when Team Avatar decided to patrol the city, she offered her Satomobile as a method of transport for the team when ${link_4} refused to carry the group. Armed with the ${link_5} her father had given her, she drove the car through the streets. Using a police monitor that her father installed, they soon found, chased, and captured several Equalists, much to Tarrlok's dismay. As they continued patrolling the next night, Asami observed Mako and Korra's interaction in the backseat of her Satomobile with suspicion. When Asami and the team arrived at the ${link_6} and saw a group of nonbenders being arrested, Tarrlok ordered to arrest Asami too as she was a nonbender and the daughter of an Equalist. At Mako's attempt to stop the police, she was taken to prison along with her boyfriend and Bolin.",
      "links": [
        {
          "body": "Ikki",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ikki",
            "page": "Ikki"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Meelo",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Meelo",
            "page": "Meelo"
          }
        },
        {
          "body": "airbender",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Naga",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Naga",
            "page": "Naga"
          }
        },
        {
          "body": "electrified glove",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Electrified_glove",
            "page": "Electrified_glove"
          }
        },
        {
          "body": "Dragon Flats borough",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon_Flats_borough",
            "page": "Dragon_Flats_borough"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Forming Team Avatar"
      ],
      "text": "After escaping the factory, Asami, along with Mako and Bolin, moved to Air Temple Island, where they were greeted by Korra, Ikki, Jinora, and Meelo. Asami was told by Meelo that she was beautiful and was asked for a lock of her hair. Korra and Ikki showed Asami her room on the island, where Asami was told by the airbender that Korra also liked Mako. Asami reacted with mild confusion and discomfort, stating that she was not really aware of that, but decided not to act on it. An embarrassed Korra quickly led her to her room and slammed the door on Ikki, leaving the two teenagers by themselves. When Korra apologized for the rustic nature of the abode, Asami quickly put the Avatar at ease by stating that the room was charming and did not remind her of her father, which were all good things in her opinion. Later, when Team Avatar decided to patrol the city, she offered her Satomobile as a method of transport for the team when Naga refused to carry the group. Armed with the electrified glove her father had given her, she drove the car through the streets. Using a police monitor that her father installed, they soon found, chased, and captured several Equalists, much to Tarrlok's dismay. As they continued patrolling the next night, Asami observed Mako and Korra's interaction in the backseat of her Satomobile with suspicion. When Asami and the team arrived at the Dragon Flats borough and saw a group of nonbenders being arrested, Tarrlok ordered to arrest Asami too as she was a nonbender and the daughter of an Equalist. At Mako's attempt to stop the police, she was taken to prison along with her boyfriend and Bolin."
    },
    {
      "body": "Asami was also freed from her prison cell by Lin Beifong, along with Mako and Bolin. Mako and Asami kissed passionately when they were reunited. Soon after, she joined Mako, Bolin, Tenzin, and Lin in the search of Korra, who Tarrlok claimed had been taken by the Equalists. While exploring the ${link_0} used by the Equalists, Mako was very short with Asami, prompting her to ask his brother Bolin whether or not Mako's determination to protect Korra stemmed from strong feelings for her. Seeing right through the earthbender's evasive answers, she pressed him for the truth until he admitted that Mako and Korra had shared a kiss during the Pro-bending Tournament. Asami was taken aback at the revelation, and although Bolin tried to downplay the kiss, Asami expressed doubt that it meant nothing.",
      "links": [
        {
          "body": "underground tunnel system",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_tunnel_network",
            "page": "Republic_City_tunnel_network"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Searching for Avatar Korra"
      ],
      "text": "Asami was also freed from her prison cell by Lin Beifong, along with Mako and Bolin. Mako and Asami kissed passionately when they were reunited. Soon after, she joined Mako, Bolin, Tenzin, and Lin in the search of Korra, who Tarrlok claimed had been taken by the Equalists. While exploring the underground tunnel system used by the Equalists, Mako was very short with Asami, prompting her to ask his brother Bolin whether or not Mako's determination to protect Korra stemmed from strong feelings for her. Seeing right through the earthbender's evasive answers, she pressed him for the truth until he admitted that Mako and Korra had shared a kiss during the Pro-bending Tournament. Asami was taken aback at the revelation, and although Bolin tried to downplay the kiss, Asami expressed doubt that it meant nothing."
    },
    {
      "body": "After discovering that the Equalists did not take Korra and that Tarrlok was behind Korra's disappearance, she returned with the others to City Hall to expose him. However, Tarrlok escaped after he incapacitated Asami and everyone else with his ${link_0}. The group was able to locate the Avatar later that evening when they found Naga howling while roaming the streets, carrying a weakened Korra. Although Asami was glad to have found Korra without major injuries, she was crestfallen seeing how concerned and caring Mako was with Korra, when Mako pushed the group overcrowding Korra out of the way and carried the Avatar in his arms. Asami looked on with sadness and pain-filled eyes as Mako set Korra down on ${link_1} and gently brushed her hair from her face.",
      "links": [
        {
          "body": "bloodbending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "Oogi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Oogi",
            "page": "Oogi"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Searching for Avatar Korra"
      ],
      "text": "After discovering that the Equalists did not take Korra and that Tarrlok was behind Korra's disappearance, she returned with the others to City Hall to expose him. However, Tarrlok escaped after he incapacitated Asami and everyone else with his bloodbending. The group was able to locate the Avatar later that evening when they found Naga howling while roaming the streets, carrying a weakened Korra. Although Asami was glad to have found Korra without major injuries, she was crestfallen seeing how concerned and caring Mako was with Korra, when Mako pushed the group overcrowding Korra out of the way and carried the Avatar in his arms. Asami looked on with sadness and pain-filled eyes as Mako set Korra down on Oogi and gently brushed her hair from her face."
    },
    {
      "body": "After finding Korra, Asami and the rest of Team Avatar returned to Air Temple Island to rest, where she noticed that a worried Mako never left Korra's side. After a meal, Asami offered to help Pema clean the table, which the latter accepted gladly. When Mako entered the kitchen, asking for hot water to make tea for Korra, an irritated Asami suggested he should heat it himself because he was a ${link_0}. Sensing tension between the couple, Pema quickly left the room, allowing them to talk. Asami expressed her concern for the way Mako had been treating Korra and told him that she knew he had kissed the Avatar, imploring him to be honest about any feelings he had for Korra. When he asked her if they could deal with their relationship problems later, Asami left the kitchen, coldly stating that \"there might not be any relationship to worry about later.\"",
      "links": [
        {
          "body": "firebender",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "The Equalist attack"
      ],
      "text": "After finding Korra, Asami and the rest of Team Avatar returned to Air Temple Island to rest, where she noticed that a worried Mako never left Korra's side. After a meal, Asami offered to help Pema clean the table, which the latter accepted gladly. When Mako entered the kitchen, asking for hot water to make tea for Korra, an irritated Asami suggested he should heat it himself because he was a firebender. Sensing tension between the couple, Pema quickly left the room, allowing them to talk. Asami expressed her concern for the way Mako had been treating Korra and told him that she knew he had kissed the Avatar, imploring him to be honest about any feelings he had for Korra. When he asked her if they could deal with their relationship problems later, Asami left the kitchen, coldly stating that \"there might not be any relationship to worry about later.\""
    },
    {
      "body": "Later, when the Equalists began ${link_0}, Asami assumed her position as the driver of Team Avatar's Satomobile. She made the automobile crash into several ${link_1}, disabling them, and knocked out several Equalists with little trouble and saving Tenzin. She returned with the others to Air Temple Island, though when it became apparent that they were no match for the number of incoming Equalists, Asami went into hiding with the rest of Team Avatar until the ${link_2} arrived.",
      "links": [
        {
          "body": "attacking Republic City",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Battle_for_Republic_City",
            "page": "Battle_for_Republic_City"
          }
        },
        {
          "body": "mecha tanks",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "United Forces",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/United_Forces",
            "page": "United_Forces"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "The Equalist attack"
      ],
      "text": "Later, when the Equalists began attacking Republic City, Asami assumed her position as the driver of Team Avatar's Satomobile. She made the automobile crash into several mecha tanks, disabling them, and knocked out several Equalists with little trouble and saving Tenzin. She returned with the others to Air Temple Island, though when it became apparent that they were no match for the number of incoming Equalists, Asami went into hiding with the rest of Team Avatar until the United Forces arrived."
    },
    {
      "body": "After Korra and Mako returned from a reconnaissance mission, an annoyed Asami told them that they had taken a long time, scoffing at Mako's defending argument that it was merely reconnaissance. ${link_0} interjected the brewing argument and invited them all to dinner, serving the team some street gruel, which was made from the scraps of the \"finest dumpsters the city ha[d] to offer\". As he said this, Asami was taking her first bite and became visibly sickened, spitting her food out and placing her bowl on the ground for Pabu to eat.",
      "links": [
        {
          "body": "Gommu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Gommu",
            "page": "Gommu"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Confronting her father"
      ],
      "text": "After Korra and Mako returned from a reconnaissance mission, an annoyed Asami told them that they had taken a long time, scoffing at Mako's defending argument that it was merely reconnaissance. Gommu interjected the brewing argument and invited them all to dinner, serving the team some street gruel, which was made from the scraps of the \"finest dumpsters the city ha[d] to offer\". As he said this, Asami was taking her first bite and became visibly sickened, spitting her food out and placing her bowl on the ground for Pabu to eat."
    },
    {
      "body": "On the day of the arrival of the United Forces, Asami accompanied the team to await the soldiers. However, she was forced to watch from the sideline how the Equalists destroyed the incoming fleet with their fast ${link_0} and ${link_1}. After Korra saved ${link_2}, Asami retreated back to the sewers with the others, where a telegram was sent to warn ${link_3} about the fast moving aircrafts.",
      "links": [
        {
          "body": "biplanes",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Biplane",
            "page": "Biplane"
          }
        },
        {
          "body": "naval mines",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Naval_mine",
            "page": "Naval_mine"
          }
        },
        {
          "body": "General Iroh",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh_(United_Forces_general)",
            "page": "Iroh_(United_Forces_general)"
          }
        },
        {
          "body": "Commander Bumi",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi",
            "page": "Bumi"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Confronting her father"
      ],
      "text": "On the day of the arrival of the United Forces, Asami accompanied the team to await the soldiers. However, she was forced to watch from the sideline how the Equalists destroyed the incoming fleet with their fast biplanes and naval mines. After Korra saved General Iroh, Asami retreated back to the sewers with the others, where a telegram was sent to warn Commander Bumi about the fast moving aircrafts."
    },
    {
      "body": "After agreeing to take out the ${link_0}, Korra decided to boldly attack Amon in an ambush by herself. When Mako insisted on accompanying Korra, Asami realized that he could not help his feelings for Korra. Before Mako and Korra headed out to face Amon, Mako pulled her aside to apologize for their messed-up relationship and to let her know how much he still cared for her. Asami told him that she cared about him too and kissed him on the cheek, ending their romantic relationship on a good note. She parted ways with him and Korra to accompany Bolin and Iroh on the mission to wipe out the airfield.",
      "links": [
        {
          "body": "Equalist airfield",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Equalist_airfield",
            "page": "Equalist_airfield"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Confronting her father"
      ],
      "text": "After agreeing to take out the Equalist airfield, Korra decided to boldly attack Amon in an ambush by herself. When Mako insisted on accompanying Korra, Asami realized that he could not help his feelings for Korra. Before Mako and Korra headed out to face Amon, Mako pulled her aside to apologize for their messed-up relationship and to let her know how much he still cared for her. Asami told him that she cared about him too and kissed him on the cheek, ending their romantic relationship on a good note. She parted ways with him and Korra to accompany Bolin and Iroh on the mission to wipe out the airfield."
    },
    {
      "body": "The trio arrived at the field on Naga. As they approached the field, Asami wondered why there were only fence posts visible. It turned out to be an electric fence, causing the three to be electrically stunned, and when they came to, they were enclosed in a cell. Hiroshi arrived to apologize for hurting Asami, and he also expressed his hope that she would \"come to her senses,\" so they could be a family once again.",
      "links": [],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Confronting her father"
      ],
      "text": "The trio arrived at the field on Naga. As they approached the field, Asami wondered why there were only fence posts visible. It turned out to be an electric fence, causing the three to be electrically stunned, and when they came to, they were enclosed in a cell. Hiroshi arrived to apologize for hurting Asami, and he also expressed his hope that she would \"come to her senses,\" so they could be a family once again."
    },
    {
      "body": "However, Asami coldly rebuffed Hiroshi, asking him how they could be a family again after what he had done and telling him that her mother would hate him for what he had become. Hiroshi immediately lost his temper with Asami, shouting at her that he was avenging his wife's death. He gloated to Iroh that he had intercepted his message to Bumi and that his airplanes would destroy the fleet before they ever came near the city. After he left, Naga charged in and broke the trio out of prison. As Iroh hijacked an Equalist biplane to pursue the other airplanes, Bolin started destroying the runways with his earthbending while Asami ran into the hanger and hopped in a mecha tank, happily noting that the controls were similar to a Future Industries forklift. She proceeded to destroy the remaining aircraft inside the hanger. As she was doing this, her father arrived in another mecha tank, ordering her to stop \"aiding the people who took her mother away\". Again, Asami stated that he was not doing what he was doing out of love for her mother anymore, but out of hatred for all benders. Her words and further rejection of him send Hiroshi into a blind rage and he proceeded to violently attack her. Asami tried to defend herself, but Hiroshi quickly managed to knock her into one of the planes. After breaking the glass of her mecha tank's cockpit, he prepared to kill her, bellowing that he now saw she was beyond saving.",
      "links": [],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Confronting her father"
      ],
      "text": "However, Asami coldly rebuffed Hiroshi, asking him how they could be a family again after what he had done and telling him that her mother would hate him for what he had become. Hiroshi immediately lost his temper with Asami, shouting at her that he was avenging his wife's death. He gloated to Iroh that he had intercepted his message to Bumi and that his airplanes would destroy the fleet before they ever came near the city. After he left, Naga charged in and broke the trio out of prison. As Iroh hijacked an Equalist biplane to pursue the other airplanes, Bolin started destroying the runways with his earthbending while Asami ran into the hanger and hopped in a mecha tank, happily noting that the controls were similar to a Future Industries forklift. She proceeded to destroy the remaining aircraft inside the hanger. As she was doing this, her father arrived in another mecha tank, ordering her to stop \"aiding the people who took her mother away\". Again, Asami stated that he was not doing what he was doing out of love for her mother anymore, but out of hatred for all benders. Her words and further rejection of him send Hiroshi into a blind rage and he proceeded to violently attack her. Asami tried to defend herself, but Hiroshi quickly managed to knock her into one of the planes. After breaking the glass of her mecha tank's cockpit, he prepared to kill her, bellowing that he now saw she was beyond saving."
    },
    {
      "body": "However, before it could come to pass, Bolin rode in on Naga, launching earth projectiles at Hiroshi's mecha and calling Hiroshi a horrible father. This attack, combined with a powerful punch from Asami's mecha, effectively put Hiroshi's mecha out of commission. Asami moved in to finish the fight though hesitated upon seeing her father's face, which allowed him to attack her. He vainly attempted to escape on foot, but Asami, agreeing with Bolin's earlier statement, fired an electric bola at her father, capturing him and ending the fight.",
      "links": [],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "Confronting her father"
      ],
      "text": "However, before it could come to pass, Bolin rode in on Naga, launching earth projectiles at Hiroshi's mecha and calling Hiroshi a horrible father. This attack, combined with a powerful punch from Asami's mecha, effectively put Hiroshi's mecha out of commission. Asami moved in to finish the fight though hesitated upon seeing her father's face, which allowed him to attack her. He vainly attempted to escape on foot, but Asami, agreeing with Bolin's earlier statement, fired an electric bola at her father, capturing him and ending the fight."
    },
    {
      "body": "Asami was present when ${link_0} attempted to restore Korra's bending at the ${link_1} and watched her emerge from the room with a sad appearance. She was also present when Korra restored Lin Beifong's bending abilities. She smiled and stood by as Tenzin addressed Korra as \"Avatar Korra\".",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Southern Water Tribe compound",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_compound",
            "page": "Southern_Water_Tribe_compound"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "At the South Pole"
      ],
      "text": "Asami was present when Katara attempted to restore Korra's bending at the Southern Water Tribe compound and watched her emerge from the room with a sad appearance. She was also present when Korra restored Lin Beifong's bending abilities. She smiled and stood by as Tenzin addressed Korra as \"Avatar Korra\"."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Asami Sato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "See also"
      ],
      "text": "Asami Sato"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Asami Sato (171 AG - Harmonic Convergence)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Asami_Sato_(171_AG_-_Harmonic_Convergence)",
            "page": "History_of_Asami_Sato_(171_AG_-_Harmonic_Convergence)"
          }
        }
      ],
      "section": [
        "History of Asami Sato (152 AG - 170 AG)",
        "See also"
      ],
      "text": "History of Asami Sato (171 AG - Harmonic Convergence)"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Asami_Sato_(152_AG_-_170_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Asami_Sato_(152_AG_-_170_AG).html",
    "page": "History_of_Asami_Sato_(152_AG_-_170_AG)",
    "title": "History of Asami Sato (152 AG - 170 AG)"
  }
}