{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Following the end of ${link_0}, ${link_1} assumed control of ${link_2}. She started working on remodeling the biplanes that were previously manufactured for ${link_3} use to have a more commercial purpose. However, due to ${link_4}'s Equalist ties, no major company or investor wanted to do business with Future Industries, prompting Asami to take a trip to the ${link_5} in order to save her company from bankruptcy.",
      "links": [
        {
          "body": "Anti-bending Revolution",
          "key": "${link_0}",
          "target": {
            "href": "Anti-bending_Revolution",
            "page": "Anti-bending_Revolution"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Future Industries",
          "key": "${link_2}",
          "target": {
            "href": "Future_Industries",
            "page": "Future_Industries"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_3}",
          "target": {
            "href": "Equalist",
            "page": "Equalist"
          }
        },
        {
          "body": "Hiroshi",
          "key": "${link_4}",
          "target": {
            "href": "Hiroshi",
            "page": "Hiroshi"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_5}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "Following the end of Anti-bending Revolution, Asami assumed control of Future Industries. She started working on remodeling the biplanes that were previously manufactured for Equalist use to have a more commercial purpose. However, due to Hiroshi's Equalist ties, no major company or investor wanted to do business with Future Industries, prompting Asami to take a trip to the Southern Water Tribe in order to save her company from bankruptcy."
    },
    {
      "body": "${link_0} adapted the ${link_1} ${link_2} to have a more commercial purpose.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_1}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "biplane",
          "key": "${link_2}",
          "target": {
            "href": "Biplane",
            "page": "Biplane"
          }
        }
      ],
      "text": "Asami adapted the Equalist biplane to have a more commercial purpose."
    },
    {
      "body": "Asami attended the ${link_0} with the rest of ${link_1}, hoping to convince ${link_2} to go into business with her in order to save the struggling Future Industries business. She invited ${link_3} to come along with her as her assistant, though she instructed him to just stand with her and be quiet. When she entered ${link_4}, they found the businessman sitting on a pillow, pretending to levitate. To soothe his ego, Asami joined in with the rest of the gathered crowd by applauding Varrick when he announced he had levitated a foot of the ground. Much to her shock and dismay, however, Bolin blurted out the truth to the businessman, seemingly angering him. Asami was pleased to note, albeit confused, that Varrick liked Bolin's honesty and was commended by Varrick upon her decision to bring her \"tiger shark\" to their meeting.",
      "links": [
        {
          "body": "Glacier Spirits Festival",
          "key": "${link_0}",
          "target": {
            "href": "Glacier_Spirits_Festival",
            "page": "Glacier_Spirits_Festival"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_2}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_3}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Varrick's ship",
          "key": "${link_4}",
          "target": {
            "href": "Varrick%27s_yacht",
            "page": "Varrick%27s_yacht"
          }
        }
      ],
      "text": "Asami attended the Glacier Spirits Festival with the rest of Team Avatar, hoping to convince Varrick to go into business with her in order to save the struggling Future Industries business. She invited Bolin to come along with her as her assistant, though she instructed him to just stand with her and be quiet. When she entered Varrick's ship, they found the businessman sitting on a pillow, pretending to levitate. To soothe his ego, Asami joined in with the rest of the gathered crowd by applauding Varrick when he announced he had levitated a foot of the ground. Much to her shock and dismay, however, Bolin blurted out the truth to the businessman, seemingly angering him. Asami was pleased to note, albeit confused, that Varrick liked Bolin's honesty and was commended by Varrick upon her decision to bring her \"tiger shark\" to their meeting."
    },
    {
      "body": "${link_0} stared intently into ${link_1}'s eye, sealing their business deal.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_1}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "text": "Asami stared intently into Varrick's eye, sealing their business deal."
    },
    {
      "body": "Asami was guided along by the extravagant businessman to have some tea with him, though before she could bring up her business plan, she was sat down to watch Varrick's latest invention, a moving picture. When Asami attempted again to bring their meeting back to her suggestion, she was promptly cut off and stared intently in the eye by Varrick. Initially shocked, Asami sternly stared back, which caused Varrick to exclaim after a few seconds that they had a deal. Pleased, Asami hugged Bolin and thanked him for his help, noting that he truly was a natural assistant.",
      "links": [],
      "text": "Asami was guided along by the extravagant businessman to have some tea with him, though before she could bring up her business plan, she was sat down to watch Varrick's latest invention, a moving picture. When Asami attempted again to bring their meeting back to her suggestion, she was promptly cut off and stared intently in the eye by Varrick. Initially shocked, Asami sternly stared back, which caused Varrick to exclaim after a few seconds that they had a deal. Pleased, Asami hugged Bolin and thanked him for his help, noting that he truly was a natural assistant."
    },
    {
      "body": "Several days later, Asami awaited Varrick in his house on the mainland together with ${link_0} and Bolin, growing anxious at the businessman's tardiness, fearing he might have reconsidered on helping Future Industries out of financial stress. As ${link_1} suddenly barged into Varrick's home, looking for the rich entrepreneur, Asami inquired what he had done. She was shocked to learn that he was wanted for treason and that ${link_2}'s parents had been arrested. As Desna and Eska's search of the room proved to be futile and left, Asami chided Bolin for groveling for Eska, telling him to stand up for himself. When she told him to just be honest about his feelings, the muffled voice of Varrick contradicted her, and she was surprised to learn that both Varrick and ${link_3} were hiding in a stuffed ${link_4}.",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Desna and Eska",
          "key": "${link_1}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Zhu Li",
          "key": "${link_3}",
          "target": {
            "href": "Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        },
        {
          "body": "platypus bear",
          "key": "${link_4}",
          "target": {
            "href": "Platypus_bear",
            "page": "Platypus_bear"
          }
        }
      ],
      "text": "Several days later, Asami awaited Varrick in his house on the mainland together with Mako and Bolin, growing anxious at the businessman's tardiness, fearing he might have reconsidered on helping Future Industries out of financial stress. As Desna and Eska suddenly barged into Varrick's home, looking for the rich entrepreneur, Asami inquired what he had done. She was shocked to learn that he was wanted for treason and that Korra's parents had been arrested. As Desna and Eska's search of the room proved to be futile and left, Asami chided Bolin for groveling for Eska, telling him to stand up for himself. When she told him to just be honest about his feelings, the muffled voice of Varrick contradicted her, and she was surprised to learn that both Varrick and Zhu Li were hiding in a stuffed platypus bear."
    },
    {
      "body": "${link_0} and ${link_1} were shocked to hear the ${link_2}' death sentence.",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Southern Water Tribe rebels",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Water_Tribe_rebels",
            "page": "Southern_Water_Tribe_rebels"
          }
        }
      ],
      "text": "Mako and Asami were shocked to hear the Southern Water Tribe rebels' death sentence."
    },
    {
      "body": "Asami attended the trial of Korra's parents, knowing that Bolin had been tasked by Varrick to bribe the judge. However, she grew irritated with the earthbender as he had given all the money to some random spectators, thus forsaking their chance to free the defendants. Afterward, she returned to Varrick's quarters, where Korra came asking for help in breaking ${link_0} out of prison. As such, Team Avatar and Varrick concocted a plan together to free Korra's father and Varrick's ${link_1}.",
      "links": [
        {
          "body": "Tonraq",
          "key": "${link_0}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "rebels",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe_rebels",
            "page": "Southern_Water_Tribe_rebels"
          }
        }
      ],
      "text": "Asami attended the trial of Korra's parents, knowing that Bolin had been tasked by Varrick to bribe the judge. However, she grew irritated with the earthbender as he had given all the money to some random spectators, thus forsaking their chance to free the defendants. Afterward, she returned to Varrick's quarters, where Korra came asking for help in breaking Tonraq out of prison. As such, Team Avatar and Varrick concocted a plan together to free Korra's father and Varrick's rebels."
    },
    {
      "body": "When Korra tunneled the ${link_0} and created an impromptu hatch to the inside, Asami took out the patrolling guard with her ${link_1}, enabling Mako to snatch his keys. However, after learning from ${link_2} that Tonraq was being transferred to the ${link_3}, Asami, Mako, and Korra quickly exited the prison to get to ${link_4}.",
      "links": [
        {
          "body": "prison",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe_prison",
            "page": "Southern_Water_Tribe_prison"
          }
        },
        {
          "body": "electrified glove",
          "key": "${link_1}",
          "target": {
            "href": "Electrified_glove",
            "page": "Electrified_glove"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_2}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_3}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Varrick's yacht",
          "key": "${link_4}",
          "target": {
            "href": "Varrick%27s_yacht",
            "page": "Varrick%27s_yacht"
          }
        }
      ],
      "text": "When Korra tunneled the prison and created an impromptu hatch to the inside, Asami took out the patrolling guard with her electrified glove, enabling Mako to snatch his keys. However, after learning from Unalaq that Tonraq was being transferred to the Northern Water Tribe, Asami, Mako, and Korra quickly exited the prison to get to Varrick's yacht."
    },
    {
      "body": "${link_0} prepared to take off with ${link_1}'s ${link_2} in order to get ${link_3} close enough to the ${link_4} Navy to take it out.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_1}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "biplane",
          "key": "${link_2}",
          "target": {
            "href": "Biplane",
            "page": "Biplane"
          }
        },
        {
          "body": "Korra",
          "key": "${link_3}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Northern",
          "key": "${link_4}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "text": "Asami prepared to take off with Varrick's biplane in order to get Korra close enough to the Northern Navy to take it out."
    },
    {
      "body": "Asami piloted Varrick's biplane to take Korra close enough to the ${link_0} blockade in order for her to clear them out. From their elevated position, it was easy to spot the ship that was transporting the prisoners to the North. Asami directed the aircraft after the ship and she jumped out of it together with Mako and Korra right before she let it crash on the surface. The plane's explosion served as a welcomed distraction for the threesome to sneak on board and take out the guards, freeing the prisoners. As the freed men made their way back to the mainland, Asami and her friends set course for ${link_1}, intending to persuade ${link_2} ${link_3} to deploy the ${link_4} in order to save the Southern Water Tribe from a northern attack.",
      "links": [
        {
          "body": "Northern Navy's",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "President",
          "key": "${link_2}",
          "target": {
            "href": "President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_3}",
          "target": {
            "href": "Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "United Forces",
          "key": "${link_4}",
          "target": {
            "href": "United_Forces",
            "page": "United_Forces"
          }
        }
      ],
      "text": "Asami piloted Varrick's biplane to take Korra close enough to the Northern Navy's blockade in order for her to clear them out. From their elevated position, it was easy to spot the ship that was transporting the prisoners to the North. Asami directed the aircraft after the ship and she jumped out of it together with Mako and Korra right before she let it crash on the surface. The plane's explosion served as a welcomed distraction for the threesome to sneak on board and take out the guards, freeing the prisoners. As the freed men made their way back to the mainland, Asami and her friends set course for Republic City, intending to persuade President Raiko to deploy the United Forces in order to save the Southern Water Tribe from a northern attack."
    },
    {
      "body": "Arriving at Republic City, Asami checked up on Future Industries' affairs, and, after seeing the company's latest figures, she met up with Varrick again to figure out a way to make some sales. However, before she could board his yacht, she was nearly run over by an angry Korra, who was also on her way to see the businessman. As they boarded together, the ${link_0} saved her from being impaled by an arrow Varrick had shot at a target she had accidentally walked in front of. Asami did not make anything of it and cut right down to business, namely her company's near bankruptcy. After pondering over several different ideas, Varrick suggested she sell some mecha tanks to the Southerners, so that Future Industries could profit from the brewing ${link_1}. Although acknowledging it would be dangerous, Asami agreed with the idea, glad that she could do something for her company and the Southerners at the same time. After the brainstorming session, she watched the propaganda movie Varrick had created to get the people of Republic City to support the Southern Water Tribe, although she herself did not seem very convinced.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Water Tribe Civil War",
          "key": "${link_1}",
          "target": {
            "href": "Water_Tribe_Civil_War",
            "page": "Water_Tribe_Civil_War"
          }
        }
      ],
      "text": "Arriving at Republic City, Asami checked up on Future Industries' affairs, and, after seeing the company's latest figures, she met up with Varrick again to figure out a way to make some sales. However, before she could board his yacht, she was nearly run over by an angry Korra, who was also on her way to see the businessman. As they boarded together, the Avatar saved her from being impaled by an arrow Varrick had shot at a target she had accidentally walked in front of. Asami did not make anything of it and cut right down to business, namely her company's near bankruptcy. After pondering over several different ideas, Varrick suggested she sell some mecha tanks to the Southerners, so that Future Industries could profit from the brewing Water Tribe Civil War. Although acknowledging it would be dangerous, Asami agreed with the idea, glad that she could do something for her company and the Southerners at the same time. After the brainstorming session, she watched the propaganda movie Varrick had created to get the people of Republic City to support the Southern Water Tribe, although she herself did not seem very convinced."
    },
    {
      "body": "${link_0}, unsure about the future of ${link_1}, let herself be consoled by ${link_2}.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Future Industries",
          "key": "${link_1}",
          "target": {
            "href": "Future_Industries",
            "page": "Future_Industries"
          }
        },
        {
          "body": "Mako",
          "key": "${link_2}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "Asami, unsure about the future of Future Industries, let herself be consoled by Mako."
    },
    {
      "body": "Shortly afterward, Asami was informed of the ambush on the ship that was carrying her mecha tanks to the South. She rushed over to the police headquarters in order to verify if the truth behind it and was told by Mako that the entire shipment had been stolen. In an attempt to reassure her, Mako promised to find whoever was responsible and let her attend the interrogation of the ship's captain. When Mako left the room upon hearing the captain speak of remotely detonated bombs, Asami was approached by Varrick, who also had received the news of the theft, and together they heard Mako pitch his idea of the Northerners not being responsible for the attack. When ${link_0} were laughing at Mako's efforts, Asami came to his aid, but was told to leave the interrogation room, just as Mako, by an angered Chief Beifong.",
      "links": [
        {
          "body": "Lu and Gang",
          "key": "${link_0}",
          "target": {
            "href": "Lu_and_Gang",
            "page": "Lu_and_Gang"
          }
        }
      ],
      "text": "Shortly afterward, Asami was informed of the ambush on the ship that was carrying her mecha tanks to the South. She rushed over to the police headquarters in order to verify if the truth behind it and was told by Mako that the entire shipment had been stolen. In an attempt to reassure her, Mako promised to find whoever was responsible and let her attend the interrogation of the ship's captain. When Mako left the room upon hearing the captain speak of remotely detonated bombs, Asami was approached by Varrick, who also had received the news of the theft, and together they heard Mako pitch his idea of the Northerners not being responsible for the attack. When Lu and Gang were laughing at Mako's efforts, Asami came to his aid, but was told to leave the interrogation room, just as Mako, by an angered Chief Beifong."
    },
    {
      "body": "Outside the police station, Asami heard that Mako planned on setting up a sting operation in order to smoke out the true thieves. Upon noticing that he was hesitant to go through with the plan, as it meant risking his career, Asami pleaded with him for his help, as Future Industries was all that she had left of her family and its survival was depending on her shipments reaching the South. After Varrick offered one of his ships, Mako agreed, and together the two teenagers started to prepare the bait ship.",
      "links": [],
      "text": "Outside the police station, Asami heard that Mako planned on setting up a sting operation in order to smoke out the true thieves. Upon noticing that he was hesitant to go through with the plan, as it meant risking his career, Asami pleaded with him for his help, as Future Industries was all that she had left of her family and its survival was depending on her shipments reaching the South. After Varrick offered one of his ships, Mako agreed, and together the two teenagers started to prepare the bait ship."
    },
    {
      "body": "${link_0} offered the ${link_1} ${link_2}' latest ${link_3} in exchange for their help.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Triple Threat Triad",
          "key": "${link_1}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "Future Industries",
          "key": "${link_2}",
          "target": {
            "href": "Future_Industries",
            "page": "Future_Industries"
          }
        },
        {
          "body": "vehicles",
          "key": "${link_3}",
          "target": {
            "href": "Motor_vehicle",
            "page": "Motor_vehicle"
          }
        }
      ],
      "text": "Asami offered the Triple Threat Triad Future Industries' latest vehicles in exchange for their help."
    },
    {
      "body": "After the ship was loaded with empty crates and the true cargo was stocked in a Future Industries warehouse, Mako and Asami traveled to the ${link_0} headquarters in an attempt to gain some help for their sting job, after Mako told her that Korra was out of town, and Bolin was too preoccupied with shooting his mover. Asami offered the triad some new, state of the art vehicles in exchange for their help, which the mobsters accepted.",
      "links": [
        {
          "body": "Triple Threat Triad",
          "key": "${link_0}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        }
      ],
      "text": "After the ship was loaded with empty crates and the true cargo was stocked in a Future Industries warehouse, Mako and Asami traveled to the Triple Threat Triad headquarters in an attempt to gain some help for their sting job, after Mako told her that Korra was out of town, and Bolin was too preoccupied with shooting his mover. Asami offered the triad some new, state of the art vehicles in exchange for their help, which the mobsters accepted."
    },
    {
      "body": "Awaiting the ambush, Asami and Mako were joined by ${link_0} on their lookout. She was shocked to learn that Mako had broken up with Korra and did not tell her about. The two continued to talk to the gangster, learning why he was called Two Toed Ping. When Mako overheard Shady Shin and Viper talking about how they betrayed the teenagers, Asami was told by Mako that they needed to get off the ship. Piloting the ${link_1}, Asami tried her best to avoid any obstacles the pursuing mobsters threw at them, eventually managing to shake them off.",
      "links": [
        {
          "body": "Two Toed Ping",
          "key": "${link_0}",
          "target": {
            "href": "Two_Toed_Ping",
            "page": "Two_Toed_Ping"
          }
        },
        {
          "body": "speedboat",
          "key": "${link_1}",
          "target": {
            "href": "Speedboat",
            "page": "Speedboat"
          }
        }
      ],
      "text": "Awaiting the ambush, Asami and Mako were joined by Two Toed Ping on their lookout. She was shocked to learn that Mako had broken up with Korra and did not tell her about. The two continued to talk to the gangster, learning why he was called Two Toed Ping. When Mako overheard Shady Shin and Viper talking about how they betrayed the teenagers, Asami was told by Mako that they needed to get off the ship. Piloting the speedboat, Asami tried her best to avoid any obstacles the pursuing mobsters threw at them, eventually managing to shake them off."
    },
    {
      "body": "When Mako told her that the Triple Threats were paid to distract them, she instantly deduced that it had to do with her real shipment of equipment. She hurried to the warehouse and discovered it to be empty. Devastated over having lost everything, she implored Mako to stop his investigation, as she no longer had the heart to continue. He reassured her that he was not giving up on her, to which a touched Asami reacted by kissing him. She immediately apologized afterward though was awkwardly assured by Mako that it was fine. She remained behind at the warehouse as Mako left, promising her to find out who was responsible for the theft.",
      "links": [],
      "text": "When Mako told her that the Triple Threats were paid to distract them, she instantly deduced that it had to do with her real shipment of equipment. She hurried to the warehouse and discovered it to be empty. Devastated over having lost everything, she implored Mako to stop his investigation, as she no longer had the heart to continue. He reassured her that he was not giving up on her, to which a touched Asami reacted by kissing him. She immediately apologized afterward though was awkwardly assured by Mako that it was fine. She remained behind at the warehouse as Mako left, promising her to find out who was responsible for the theft."
    },
    {
      "body": "To save ${link_0}, ${link_1} sold a controlling interest in her company to ${link_2}.",
      "links": [
        {
          "body": "Future Industries",
          "key": "${link_0}",
          "target": {
            "href": "Future_Industries",
            "page": "Future_Industries"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_2}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "text": "To save Future Industries, Asami sold a controlling interest in her company to Varrick."
    },
    {
      "body": "The next day, Asami met with Varrick and sold him a controlling share of her company. The prospect of having saved Future Industries cheered her up, but in the middle of the meeting, Mako entered and told her he had made a big break in the case. However, unwilling to tell her who he had uncovered as the one behind her Future Industries' robbing, he left her with the promise of filling her in later.",
      "links": [],
      "text": "The next day, Asami met with Varrick and sold him a controlling share of her company. The prospect of having saved Future Industries cheered her up, but in the middle of the meeting, Mako entered and told her he had made a big break in the case. However, unwilling to tell her who he had uncovered as the one behind her Future Industries' robbing, he left her with the promise of filling her in later."
    },
    {
      "body": "A while after officially entering into business with Varrick, Asami was told by Mako of the shipping global's hand in the theft of her merchandise. Asami struggled to believe him, not seeing the reason for why Varrick would attack his own ships. She attributed Mako's suspicions to him having had a busy week and suggested that a relaxation was in order. The closeness she displayed toward the firebender alarmed Bolin, who deduced that they were dating again. However, as the earthbender voiced his conclusion, Asami and Mako were quick to refute his claims.",
      "links": [],
      "text": "A while after officially entering into business with Varrick, Asami was told by Mako of the shipping global's hand in the theft of her merchandise. Asami struggled to believe him, not seeing the reason for why Varrick would attack his own ships. She attributed Mako's suspicions to him having had a busy week and suggested that a relaxation was in order. The closeness she displayed toward the firebender alarmed Bolin, who deduced that they were dating again. However, as the earthbender voiced his conclusion, Asami and Mako were quick to refute his claims."
    },
    {
      "body": "${link_0} was left with doubt, unsure whom to believe.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "text": "Asami was left with doubt, unsure whom to believe."
    },
    {
      "body": "Asami later visited Mako at his apartment to invite him to dinner at Kwong's Cuisine in order to help him relax and relive their first date. The two shared a kiss, though their intimate moment was interrupted when the police came by to investigate an incriminating lead on Mako that they had gotten from some arrested Triple Threat Triad members. Asami was shocked to learn that Mako had explosives and a detonator hidden away in his back room, and Lu and Gang pointed out that Mako had been using her the entire time to get to Future Industries' wealth. Mako refuted the allegations, claiming that he would never do anything to hurt her and pinned the blame on Varrick, Asami was left with doubts, unsure whose story to believe.",
      "links": [],
      "text": "Asami later visited Mako at his apartment to invite him to dinner at Kwong's Cuisine in order to help him relax and relive their first date. The two shared a kiss, though their intimate moment was interrupted when the police came by to investigate an incriminating lead on Mako that they had gotten from some arrested Triple Threat Triad members. Asami was shocked to learn that Mako had explosives and a detonator hidden away in his back room, and Lu and Gang pointed out that Mako had been using her the entire time to get to Future Industries' wealth. Mako refuted the allegations, claiming that he would never do anything to hurt her and pinned the blame on Varrick, Asami was left with doubts, unsure whose story to believe."
    },
    {
      "body": "After ${link_0} ${link_1} turned down ${link_2}'s request for help, ${link_3} instantly offered her assistance, much to the ${link_4}'s gratitude.",
      "links": [
        {
          "body": "President",
          "key": "${link_0}",
          "target": {
            "href": "President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_1}",
          "target": {
            "href": "Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Asami",
          "key": "${link_3}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_4}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "After President Raiko turned down Korra's request for help, Asami instantly offered her assistance, much to the Avatar's gratitude."
    },
    {
      "body": "Asami passed on the chance to visit Mako in jail, stating it was too painful as the location reminded her of her father. Instead, she accompanied Bolin to the ${link_0}, where the finale of his ${link_1} premiered. When Bolin left the loge, Asami followed him outside to see what was bothering him. Together, they reminisced about how much things had changed since their first encounter. She invited him to return watching the mover with her, though was told to go ahead as Bolin wanted to be by himself for a while. She cheered him on when he later saved President Raiko from being kidnapped. She congratulated him on his victory and suggested that they visit Mako to tell him what happened. However, before they could leave, they were interrupted by Korra's arrival. When the President turned down the Avatar's plea for help again, Asami readily offer her assistance, much to Korra's gratitude. Together, they all went to pick up Mako from jail. Asami smiled at her boyfriend, though grew angry when Mako did not tell Korra he was now in a relationship with Asami. However, she did not say anything about it, focusing on the dire situation at hand instead. She visited Varrick in jail with the others, chiding him for having stolen her property, though relented slightly when he pointed out that he also saved her company.",
      "links": [
        {
          "body": "Pro-bending Arena",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "mover",
          "key": "${link_1}",
          "target": {
            "href": "The_Adventures_of_Nuktuk__Hero_of_the_South",
            "page": "The_Adventures_of_Nuktuk__Hero_of_the_South"
          }
        }
      ],
      "text": "Asami passed on the chance to visit Mako in jail, stating it was too painful as the location reminded her of her father. Instead, she accompanied Bolin to the Pro-bending Arena, where the finale of his mover premiered. When Bolin left the loge, Asami followed him outside to see what was bothering him. Together, they reminisced about how much things had changed since their first encounter. She invited him to return watching the mover with her, though was told to go ahead as Bolin wanted to be by himself for a while. She cheered him on when he later saved President Raiko from being kidnapped. She congratulated him on his victory and suggested that they visit Mako to tell him what happened. However, before they could leave, they were interrupted by Korra's arrival. When the President turned down the Avatar's plea for help again, Asami readily offer her assistance, much to Korra's gratitude. Together, they all went to pick up Mako from jail. Asami smiled at her boyfriend, though grew angry when Mako did not tell Korra he was now in a relationship with Asami. However, she did not say anything about it, focusing on the dire situation at hand instead. She visited Varrick in jail with the others, chiding him for having stolen her property, though relented slightly when he pointed out that he also saved her company."
    },
    {
      "body": "In order to get ${link_0}, ${link_1}, ${link_2}, and ${link_3} into the ${link_4}, ${link_5} suggested an aerial attack, with herself, ${link_6}, and ${link_7} serving as the decoy.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "href": "Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Kya",
          "key": "${link_2}",
          "target": {
            "href": "Kya",
            "page": "Kya"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_3}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_4}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Asami",
          "key": "${link_5}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Mako",
          "key": "${link_6}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_7}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        }
      ],
      "text": "In order to get Korra, Bumi, Kya, and Tenzin into the Spirit World, Asami suggested an aerial attack, with herself, Mako, and Bolin serving as the decoy."
    },
    {
      "body": "Asami steered the battleship they acquired from Varrick toward the Southern Water Tribe, though as they were almost at their destination, she picked up a distress signal of the Southern Water Tribe rebels. They continued their journey toward the Southern Water Tribe compound. Asami suggested an aerial assault on the Northern defenses at the South Pole; she would create a diversion with Mako and Bolin's help by using Varrick's plane in order to provide Korra, ${link_0}, ${link_1}, and ${link_2} an opening to fly in on ${link_3}. Although she managed to evade the ice projectiles for quite some time, successfully completing several attacks, Asami's plane was brought down by Desna and Eska, forcing her to crash land. They were apprehended by the twin and imprisoned in the same tent as Korra and the others, who had also been brought down. She was freed by Bumi and subsequently asked by Korra to fly Tonraq back to the ${link_4} huts to get treatment.",
      "links": [
        {
          "body": "Bumi",
          "key": "${link_0}",
          "target": {
            "href": "Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Kya",
          "key": "${link_1}",
          "target": {
            "href": "Kya",
            "page": "Kya"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_2}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Oogi",
          "key": "${link_3}",
          "target": {
            "href": "Oogi",
            "page": "Oogi"
          }
        },
        {
          "body": "healing",
          "key": "${link_4}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "Asami steered the battleship they acquired from Varrick toward the Southern Water Tribe, though as they were almost at their destination, she picked up a distress signal of the Southern Water Tribe rebels. They continued their journey toward the Southern Water Tribe compound. Asami suggested an aerial assault on the Northern defenses at the South Pole; she would create a diversion with Mako and Bolin's help by using Varrick's plane in order to provide Korra, Bumi, Kya, and Tenzin an opening to fly in on Oogi. Although she managed to evade the ice projectiles for quite some time, successfully completing several attacks, Asami's plane was brought down by Desna and Eska, forcing her to crash land. They were apprehended by the twin and imprisoned in the same tent as Korra and the others, who had also been brought down. She was freed by Bumi and subsequently asked by Korra to fly Tonraq back to the healing huts to get treatment."
    },
    {
      "body": "Asami remained at the healing hut with Katara, Tonraq, and ${link_0}, watching over ${link_1}. When the young airbender awoke, she immediately inquired about the safety of her friends and was relieved to hear that Korra had saved the world.",
      "links": [
        {
          "body": "Senna",
          "key": "${link_0}",
          "target": {
            "href": "Senna",
            "page": "Senna"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_1}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        }
      ],
      "text": "Asami remained at the healing hut with Katara, Tonraq, and Senna, watching over Jinora. When the young airbender awoke, she immediately inquired about the safety of her friends and was relieved to hear that Korra had saved the world."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Asami_Sato_(171_AG_-_Harmonic_Convergence)",
    "file": "avatar.wikia.com/wiki/History_of_Asami_Sato_(171_AG_-_Harmonic_Convergence).html",
    "page": "History_of_Asami_Sato_(171_AG_-_Harmonic_Convergence)",
    "title": "History of Asami Sato (171 AG - Harmonic Convergence)"
  }
}