{
  "categories": [
    {
      "body": "Aang",
      "target": {
        "href": "Category_Aang",
        "page": "Category_Aang"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "After being frozen in an iceberg for one hundred years, ${link_0}, the new ${link_1}, was discovered by two ${link_2} teenagers, ${link_3} and her brother ${link_4}. Accompanied by his new ${link_5}, Aang embarked on a journey to master all ${link_6} in preparation for his eventual ${link_7} with ${link_8} ${link_9}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_4}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "allies",
          "key": "${link_5}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "four elements",
          "key": "${link_6}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "face-off",
          "key": "${link_7}",
          "target": {
            "href": "Battle_at_Wulong_Forest",
            "page": "Battle_at_Wulong_Forest"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_8}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_9}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "After being frozen in an iceberg for one hundred years, Aang, the new Avatar, was discovered by two Water Tribe teenagers, Katara and her brother Sokka. Accompanied by his new allies, Aang embarked on a journey to master all four elements in preparation for his eventual face-off with Fire Lord Ozai."
    },
    {
      "body": "When Aang was young, he unknowingly revealed that he was the reincarnation of the Avatar when he chose ${link_0} out of thousands - a turtle shell, a string-powered propeller, a ${link_1}, and a drum. These four toys were the same ones that past Avatars had chosen for generations when they were children.",
      "links": [
        {
          "body": "four toys",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_relics",
            "page": "Avatar_relics"
          }
        },
        {
          "body": "hog monkey",
          "key": "${link_1}",
          "target": {
            "href": "Hog_monkey",
            "page": "Hog_monkey"
          }
        }
      ],
      "text": "When Aang was young, he unknowingly revealed that he was the reincarnation of the Avatar when he chose four toys out of thousands - a turtle shell, a string-powered propeller, a hog monkey, and a drum. These four toys were the same ones that past Avatars had chosen for generations when they were children."
    },
    {
      "body": "${link_0} presented an apple to ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Aang presented an apple to Appa."
    },
    {
      "body": "Raised by ${link_0} ${link_1}, Aang grew up in the idyllic surroundings of the ${link_2}. He was a carefree young boy, given to frequent travel, play and possessing an almost effortless mastery over his native element, so much so, in fact, that he had surpassed his master by the age of ten. When he was a small child, he, along with the other airbending children, traveled to the ${link_3}, where the young airbenders chose their lifelong friends and companions - the ${link_4}. Aang immediately bonded with ${link_5}, who would become his partner and companion for the rest of his life. In his youth, he traveled all across ${link_6} and made many close friends from different ${link_7}, including ${link_8}, from the ${link_9}, and ${link_10}, from the ${link_11}. When he was twelve years old, he invented the airbending technique, the \"air scooter\". This act caused the monks to decree him an airbending master, and he received the blue arrow-shaped ${link_12} that all master airbenders wore. His world drastically changed when the monks revealed that he was the Avatar, destined to master all four elements and bring peace to the world.",
      "links": [
        {
          "body": "airbender",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "monks",
          "key": "${link_1}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Southern Air Temple",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        },
        {
          "body": "Eastern Air Temple",
          "key": "${link_3}",
          "target": {
            "href": "Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        },
        {
          "body": "flying bison",
          "key": "${link_4}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "Appa",
          "key": "${link_5}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "the world",
          "key": "${link_6}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "nations",
          "key": "${link_7}",
          "target": {
            "href": "Four_nations",
            "page": "Four_nations"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_8}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_9}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Kuzon",
          "key": "${link_10}",
          "target": {
            "href": "Kuzon",
            "page": "Kuzon"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_11}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "tattoos",
          "key": "${link_12}",
          "target": {
            "href": "Body_markings_in_the_World_of_Avatar",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Raised by airbender monks, Aang grew up in the idyllic surroundings of the Southern Air Temple. He was a carefree young boy, given to frequent travel, play and possessing an almost effortless mastery over his native element, so much so, in fact, that he had surpassed his master by the age of ten. When he was a small child, he, along with the other airbending children, traveled to the Eastern Air Temple, where the young airbenders chose their lifelong friends and companions - the flying bison. Aang immediately bonded with Appa, who would become his partner and companion for the rest of his life. In his youth, he traveled all across the world and made many close friends from different nations, including Bumi, from the Earth Kingdom, and Kuzon, from the Fire Nation. When he was twelve years old, he invented the airbending technique, the \"air scooter\". This act caused the monks to decree him an airbending master, and he received the blue arrow-shaped tattoos that all master airbenders wore. His world drastically changed when the monks revealed that he was the Avatar, destined to master all four elements and bring peace to the world."
    },
    {
      "body": "${link_0} was told of his ${link_1} status four years earlier than normal.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Aang was told of his Avatar status four years earlier than normal."
    },
    {
      "body": "Usually, the Avatar is only told of his or her true identity after turning sixteen; however, Aang's caretakers feared that a war between the four nations was on the horizon and believed that the Avatar would be needed to help maintain balance. Aang soon began to feel overwhelmed with the burden of his position. His peers ostracized him for his airbending skill and new status, while his caretakers pressured him to mature too quickly.",
      "links": [],
      "text": "Usually, the Avatar is only told of his or her true identity after turning sixteen; however, Aang's caretakers feared that a war between the four nations was on the horizon and believed that the Avatar would be needed to help maintain balance. Aang soon began to feel overwhelmed with the burden of his position. His peers ostracized him for his airbending skill and new status, while his caretakers pressured him to mature too quickly."
    },
    {
      "body": "The only monk sympathetic to Aang's feelings was the elder Monk ${link_0}, Aang's airbending teacher and guardian. When the burden weighed heavily on his favorite student, Gyatso worked to instill a sense of fun through jokes and games. He sincerely believed that Aang should be allowed to grow up as a normal boy. However, the other monks disagreed. Citing Gyatso's attachment to the boy as interference, they decided to send Aang away to the Eastern Air Temple to focus on his training, oblivious to the fact that Aang had overheard their conversation.",
      "links": [
        {
          "body": "Gyatso",
          "key": "${link_0}",
          "target": {
            "href": "Gyatso",
            "page": "Gyatso"
          }
        }
      ],
      "text": "The only monk sympathetic to Aang's feelings was the elder Monk Gyatso, Aang's airbending teacher and guardian. When the burden weighed heavily on his favorite student, Gyatso worked to instill a sense of fun through jokes and games. He sincerely believed that Aang should be allowed to grow up as a normal boy. However, the other monks disagreed. Citing Gyatso's attachment to the boy as interference, they decided to send Aang away to the Eastern Air Temple to focus on his training, oblivious to the fact that Aang had overheard their conversation."
    },
    {
      "body": "Confused and frightened by what he had learned, Aang fled his home on Appa, heading toward the ${link_0}. While over the Southern Ocean, a sudden storm caused Appa to plunge deep into the sea. Entering the ${link_1}, Aang reflexively used airbending to surround himself and Appa in an air bubble that quickly froze into an iceberg, putting them into a state of suspended animation.",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_1}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "Confused and frightened by what he had learned, Aang fled his home on Appa, heading toward the South Pole. While over the Southern Ocean, a sudden storm caused Appa to plunge deep into the sea. Entering the Avatar State, Aang reflexively used airbending to surround himself and Appa in an air bubble that quickly froze into an iceberg, putting them into a state of suspended animation."
    },
    {
      "body": "${link_0} awoke from one hundred years of sleep.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Aang awoke from one hundred years of sleep."
    },
    {
      "body": "A hundred years had passed when two teenage siblings from the ${link_0} - Katara, a ${link_1}, and her brother, Sokka - discovered and freed Aang from his iceberg. Aang's first thought upon being freed from the iceberg was to ask his liberator, Katara, to go ${link_2}. The trio later traveled to Katara and Sokka's ${link_3} where Aang was met with bewildered stares from the natives, who had not witnessed an airbender before.",
      "links": [
        {
          "body": "Southern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "waterbender",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "penguin sledding",
          "key": "${link_2}",
          "target": {
            "href": "Penguin_sledding",
            "page": "Penguin_sledding"
          }
        },
        {
          "body": "tribe",
          "key": "${link_3}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "A hundred years had passed when two teenage siblings from the Southern Water Tribe - Katara, a waterbender, and her brother, Sokka - discovered and freed Aang from his iceberg. Aang's first thought upon being freed from the iceberg was to ask his liberator, Katara, to go penguin sledding. The trio later traveled to Katara and Sokka's tribe where Aang was met with bewildered stares from the natives, who had not witnessed an airbender before."
    },
    {
      "body": "He soon discovered that in his absence, fears of war had become a reality. The year he vanished, the leader of the ${link_0} at that time, the ruthless Fire Lord ${link_1}, took advantage of the ${link_2}-enhancing powers of a mystical ${link_3} to launch ${link_4} on the three other nations. To Aang's utter shock and disbelief, the Fire Nation's opening gambit had been a ${link_5} on the Air Nomads in an attempt to kill the latest incarnation of the Avatar Spirit. All four ${link_6} were stormed and even though they fought against the invaders, leaving many firebender corpses in their wake, the ambushed monks were slaughtered. Thus, Aang became the last known airbender in existence.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_1}",
          "target": {
            "href": "Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "firebending",
          "key": "${link_2}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "comet",
          "key": "${link_3}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "a war",
          "key": "${link_4}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "genocidal assault",
          "key": "${link_5}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "air temples",
          "key": "${link_6}",
          "target": {
            "href": "Air_temple",
            "page": "Air_temple"
          }
        }
      ],
      "text": "He soon discovered that in his absence, fears of war had become a reality. The year he vanished, the leader of the Fire Nation at that time, the ruthless Fire Lord Sozin, took advantage of the firebending-enhancing powers of a mystical comet to launch a war on the three other nations. To Aang's utter shock and disbelief, the Fire Nation's opening gambit had been a genocidal assault on the Air Nomads in an attempt to kill the latest incarnation of the Avatar Spirit. All four air temples were stormed and even though they fought against the invaders, leaving many firebender corpses in their wake, the ambushed monks were slaughtered. Thus, Aang became the last known airbender in existence."
    },
    {
      "body": "Aang had since realized that the future of the four nations rested in his hands. It was his duty to defeat the Fire Nation and restore peace and harmony to the world. To achieve this, Aang and his new friends and pets set off on a quest to find and learn from master benders, while evading capture by the Fire Nation.",
      "links": [],
      "text": "Aang had since realized that the future of the four nations rested in his hands. It was his duty to defeat the Fire Nation and restore peace and harmony to the world. To achieve this, Aang and his new friends and pets set off on a quest to find and learn from master benders, while evading capture by the Fire Nation."
    },
    {
      "body": "During one of their detours they landed on ${link_0}, named after ${link_1}. There, they were captured by the ${link_2}. The inhabitants had kept out of the war for the past one hundred years and thus were xenophobic to outsiders. The village elder, ${link_3}, and the warrior ${link_4} believed they were Fire Nation spies and were about to throw them to the ${link_5}, until Aang proved he was the Avatar and they became honored guests in the village. However, Aang's new celebrity status went to his head, causing him to entertain and impress a group of fan girls, much to Katara's dismay. When ${link_6} ${link_7} arrived on Kyoshi Island, seeking to capture the Avatar, Aang realized that by staying too long, he had endangered the people. Therefore, he escaped with Katara and Sokka, knowing Zuko would follow him and leave the island. Before leaving, however, Aang jumped off of Appa and rode the unagi, controlling the creature to spray water over the burning houses.",
      "links": [
        {
          "body": "Kyoshi Island",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "one of his incarnations",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_2}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Oyaji",
          "key": "${link_3}",
          "target": {
            "href": "Oyaji",
            "page": "Oyaji"
          }
        },
        {
          "body": "Suki",
          "key": "${link_4}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "unagi",
          "key": "${link_5}",
          "target": {
            "href": "Unagi",
            "page": "Unagi"
          }
        },
        {
          "body": "Prince",
          "key": "${link_6}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_7}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "During one of their detours they landed on Kyoshi Island, named after one of his incarnations. There, they were captured by the Kyoshi Warriors. The inhabitants had kept out of the war for the past one hundred years and thus were xenophobic to outsiders. The village elder, Oyaji, and the warrior Suki believed they were Fire Nation spies and were about to throw them to the unagi, until Aang proved he was the Avatar and they became honored guests in the village. However, Aang's new celebrity status went to his head, causing him to entertain and impress a group of fan girls, much to Katara's dismay. When Prince Zuko arrived on Kyoshi Island, seeking to capture the Avatar, Aang realized that by staying too long, he had endangered the people. Therefore, he escaped with Katara and Sokka, knowing Zuko would follow him and leave the island. Before leaving, however, Aang jumped off of Appa and rode the unagi, controlling the creature to spray water over the burning houses."
    },
    {
      "body": "${link_0} and ${link_1} ${link_2} rode the ${link_3}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "King",
          "key": "${link_1}",
          "target": {
            "href": "King_of_Omashu",
            "page": "King_of_Omashu"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_2}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "Omashu delivery system",
          "key": "${link_3}",
          "target": {
            "href": "Omashu_delivery_system",
            "page": "Omashu_delivery_system"
          }
        }
      ],
      "text": "Aang and King Bumi rode the Omashu delivery system."
    },
    {
      "body": "In another detour, he took Katara and Sokka to the ${link_0} city of ${link_1}, where he recalled how his childhood friend ${link_2} had taken him on the world's biggest roller coaster ride on the city's ${link_3}. After their own roller coaster ride, they were arrested for damages and taken before the king. The old, seemingly crazy, king tricked Aang into revealing he was an airbender and thus the Avatar, and had the trio taken to a refurbished prison chamber. Aang woke up to find out that the king had encased Katara and Sokka in ${link_4} called \"creeping crystal\", and would only free them if he passed three tests. He passed the challenges, but the king had one last challenge for him: to guess his name. Figuring out the link between his seemingly random challenges was that he had to think outside the box, Aang identified the king to be his old friend Bumi, who had said something similar to him a hundred years prior. Having his friends freed as promised, Aang was told by Bumi that in order to end the war, he must learn all the bending arts and defeat the Fire Lord himself. Before the team left the city, Aang and Bumi rode the Omashu mail system one last time for old time's sake.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_1}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_2}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "postal system",
          "key": "${link_3}",
          "target": {
            "href": "Omashu_delivery_system",
            "page": "Omashu_delivery_system"
          }
        },
        {
          "body": "a strange mineral",
          "key": "${link_4}",
          "target": {
            "href": "Jennamite",
            "page": "Jennamite"
          }
        }
      ],
      "text": "In another detour, he took Katara and Sokka to the Earth Kingdom city of Omashu, where he recalled how his childhood friend Bumi had taken him on the world's biggest roller coaster ride on the city's postal system. After their own roller coaster ride, they were arrested for damages and taken before the king. The old, seemingly crazy, king tricked Aang into revealing he was an airbender and thus the Avatar, and had the trio taken to a refurbished prison chamber. Aang woke up to find out that the king had encased Katara and Sokka in a strange mineral called \"creeping crystal\", and would only free them if he passed three tests. He passed the challenges, but the king had one last challenge for him: to guess his name. Figuring out the link between his seemingly random challenges was that he had to think outside the box, Aang identified the king to be his old friend Bumi, who had said something similar to him a hundred years prior. Having his friends freed as promised, Aang was told by Bumi that in order to end the war, he must learn all the bending arts and defeat the Fire Lord himself. Before the team left the city, Aang and Bumi rode the Omashu mail system one last time for old time's sake."
    },
    {
      "body": "While trying to help a village tormented by ${link_0}, Aang unknowingly entered the ${link_1}. There he was contacted by Avatar ${link_2}'s ${link_3}, ${link_4}, who led him in his spiritual state to Roku's ${link_5} on ${link_6}. By showing Aang visions of a fiery comet and beams of light shining toward Roku's statue, Aang realized he could talk with his previous incarnation during the winter solstice.",
      "links": [
        {
          "body": "an angry spirit",
          "key": "${link_0}",
          "target": {
            "href": "Hei_Bai",
            "page": "Hei_Bai"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "dragon",
          "key": "${link_3}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        },
        {
          "body": "Fang",
          "key": "${link_4}",
          "target": {
            "href": "Fang",
            "page": "Fang"
          }
        },
        {
          "body": "temple",
          "key": "${link_5}",
          "target": {
            "href": "Fire_Temple",
            "page": "Fire_Temple"
          }
        },
        {
          "body": "Crescent Island",
          "key": "${link_6}",
          "target": {
            "href": "Crescent_Island",
            "page": "Crescent_Island"
          }
        }
      ],
      "text": "While trying to help a village tormented by an angry spirit, Aang unknowingly entered the Spirit World. There he was contacted by Avatar Roku's dragon, Fang, who led him in his spiritual state to Roku's temple on Crescent Island. By showing Aang visions of a fiery comet and beams of light shining toward Roku's statue, Aang realized he could talk with his previous incarnation during the winter solstice."
    },
    {
      "body": "${link_0} conversed with ${link_1} ${link_2} in the ${link_3}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Aang conversed with Avatar Roku in the Spirit World."
    },
    {
      "body": "On the morning of the solstice, Aang and his friends passed through a ${link_0} and entered the Fire Nation, journeying to the Avatar's temple. However, they found that the temple's guardians, the ${link_1}, were instead hostile to the Avatar, having given their loyalty to the Fire Lord. With the help of the only sage still loyal to the Avatar, ${link_2}, Aang managed to enter the inner chamber of the temple. Avatar Roku, who manifested himself when light from the solstice sun struck his statue, warned Aang of Sozin's Comet, a comet that returned once every one hundred years and greatly increased a firebender's power. Fire Lord Sozin used the power of the comet to start the war one century prior, and Sozin's Comet would return at the end of summer. If Aang did not defeat the Fire Lord before the comet's arrival, the Fire Nation would be unstoppable, and the Avatar would be unable to restore balance to the world. Aang despaired that he had not learned the other bending arts and would not be unable to complete his training before the comet's arrival, but Roku assured him that he would succeed, as his previous incarnations had done before. Upon the end of the solstice, Roku helped Aang in confronting Admiral ${link_3} and his troops who were stationed outside the sanctuary. Aang was able to manifest himself as his previous incarnation, who proceeded to destroy the temple completely. Aang and the team were later able to escape safely.",
      "links": [
        {
          "body": "Fire Navy blockade",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Navy_blockade",
            "page": "Fire_Navy_blockade"
          }
        },
        {
          "body": "Fire Sages",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Shyu",
          "key": "${link_2}",
          "target": {
            "href": "Shyu",
            "page": "Shyu"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_3}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        }
      ],
      "text": "On the morning of the solstice, Aang and his friends passed through a Fire Navy blockade and entered the Fire Nation, journeying to the Avatar's temple. However, they found that the temple's guardians, the Fire Sages, were instead hostile to the Avatar, having given their loyalty to the Fire Lord. With the help of the only sage still loyal to the Avatar, Shyu, Aang managed to enter the inner chamber of the temple. Avatar Roku, who manifested himself when light from the solstice sun struck his statue, warned Aang of Sozin's Comet, a comet that returned once every one hundred years and greatly increased a firebender's power. Fire Lord Sozin used the power of the comet to start the war one century prior, and Sozin's Comet would return at the end of summer. If Aang did not defeat the Fire Lord before the comet's arrival, the Fire Nation would be unstoppable, and the Avatar would be unable to restore balance to the world. Aang despaired that he had not learned the other bending arts and would not be unable to complete his training before the comet's arrival, but Roku assured him that he would succeed, as his previous incarnations had done before. Upon the end of the solstice, Roku helped Aang in confronting Admiral Zhao and his troops who were stationed outside the sanctuary. Aang was able to manifest himself as his previous incarnation, who proceeded to destroy the temple completely. Aang and the team were later able to escape safely."
    },
    {
      "body": "With the knowledge of the comet's impending arrival, the weight of his duty increasingly agitated Aang. To help relieve his predicament, they landed near a river in front of a ${link_0} where Katara offered to begin training him in the art of waterbending. Aang quickly undressed to his red briefs, but Katara told him to remember the reason they were there. Sokka asked what he was supposed to do and Aang told him to clean mud and bugs out of Appa's toes. Katara taught Aang some of her waterbending skills, only to find Aang was faster and better at learning the techniques that took her a long time to learn, causing her to grow jealous. Aang's waterbending eventually caused all their supplies to wash downstream, and the group was forced to head to a port market to buy new supplies.",
      "links": [
        {
          "body": "waterfall",
          "key": "${link_0}",
          "target": {
            "href": "Waterfall_lagoon",
            "page": "Waterfall_lagoon"
          }
        }
      ],
      "text": "With the knowledge of the comet's impending arrival, the weight of his duty increasingly agitated Aang. To help relieve his predicament, they landed near a river in front of a waterfall where Katara offered to begin training him in the art of waterbending. Aang quickly undressed to his red briefs, but Katara told him to remember the reason they were there. Sokka asked what he was supposed to do and Aang told him to clean mud and bugs out of Appa's toes. Katara taught Aang some of her waterbending skills, only to find Aang was faster and better at learning the techniques that took her a long time to learn, causing her to grow jealous. Aang's waterbending eventually caused all their supplies to wash downstream, and the group was forced to head to a port market to buy new supplies."
    },
    {
      "body": "While at the port, Aang impulsively bought a ${link_0}, which did not seem to work, to the chagrin of his friends. They came upon a ship docked with a ${link_1} attempting to attract business. The ship's crew was selling items that they acquired by \"high risk trading\". Sokka quickly surmised they were pirates. Katara saw a ${link_2}, featuring several waterbending techniques among their loot, which they were reserving for a wealthy client in the Earth Kingdom. However, the ${link_3} would offer it to them if they had a better offer, specifically, two hundred ${link_4}.",
      "links": [
        {
          "body": "bison whistle",
          "key": "${link_0}",
          "target": {
            "href": "Bison_whistle",
            "page": "Bison_whistle"
          }
        },
        {
          "body": "barker",
          "key": "${link_1}",
          "target": {
            "href": "Oh",
            "page": "Oh"
          }
        },
        {
          "body": "training scroll",
          "key": "${link_2}",
          "target": {
            "href": "Waterbending_scroll",
            "page": "Waterbending_scroll"
          }
        },
        {
          "body": "pirate captain",
          "key": "${link_3}",
          "target": {
            "href": "Pirate_captain",
            "page": "Pirate_captain"
          }
        },
        {
          "body": "gold pieces",
          "key": "${link_4}",
          "target": {
            "href": "Currency",
            "page": "Currency"
          }
        }
      ],
      "text": "While at the port, Aang impulsively bought a bison whistle, which did not seem to work, to the chagrin of his friends. They came upon a ship docked with a barker attempting to attract business. The ship's crew was selling items that they acquired by \"high risk trading\". Sokka quickly surmised they were pirates. Katara saw a training scroll, featuring several waterbending techniques among their loot, which they were reserving for a wealthy client in the Earth Kingdom. However, the pirate captain would offer it to them if they had a better offer, specifically, two hundred gold pieces."
    },
    {
      "body": "${link_0} began to learn ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Aang began to learn waterbending."
    },
    {
      "body": "They left the ship, only to be chased by the crew. The group escaped and found the reason they had been pursued: the pirates wanted the scroll Katara had stolen. Katara convinced Sokka and Aang to keep the scroll and learn from it. One of the first techniques they attempted was the water whip, a simple technique where water is formed into an elongated shape and snapped at the target. Katara grew even more jealous of Aang as not only did he learn the technique easily, she herself had trouble mastering it. Her jealousy got the better of her; she yelled at Aang angrily, but quickly apologized and gave up the right to use the scroll, handing it over to Aang. At night, however, she stole the scroll to study the technique again.",
      "links": [],
      "text": "They left the ship, only to be chased by the crew. The group escaped and found the reason they had been pursued: the pirates wanted the scroll Katara had stolen. Katara convinced Sokka and Aang to keep the scroll and learn from it. One of the first techniques they attempted was the water whip, a simple technique where water is formed into an elongated shape and snapped at the target. Katara grew even more jealous of Aang as not only did he learn the technique easily, she herself had trouble mastering it. Her jealousy got the better of her; she yelled at Aang angrily, but quickly apologized and gave up the right to use the scroll, handing it over to Aang. At night, however, she stole the scroll to study the technique again."
    },
    {
      "body": "Zuko joined forces with the pirates to hunt down Aang, and they found Katara late at night practicing the water whip. Zuko captured and tied Katara to a tree, attempting to interrogate her for information on the Avatar, showing her that he held her mother's lost betrothal ${link_0} in his possession, the last tie that she had to her mother. However, the pirates demanded the scroll; Zuko threatened to destroy it if they did not find Aang.",
      "links": [
        {
          "body": "necklace",
          "key": "${link_0}",
          "target": {
            "href": "Katara%27s_necklace",
            "page": "Katara%27s_necklace"
          }
        }
      ],
      "text": "Zuko joined forces with the pirates to hunt down Aang, and they found Katara late at night practicing the water whip. Zuko captured and tied Katara to a tree, attempting to interrogate her for information on the Avatar, showing her that he held her mother's lost betrothal necklace in his possession, the last tie that she had to her mother. However, the pirates demanded the scroll; Zuko threatened to destroy it if they did not find Aang."
    },
    {
      "body": "Later, Aang and Sokka were found and captured and were taken to the pirates and Fire Nation ships. Aang and Sokka discovered Katara bound to a tree surrounded by firebenders. As Zuko and the pirates were about to trade the scroll for the Avatar, Sokka convinced the pirates to sell Aang by revealing to them that he was the Avatar, despite Zuko's attempts to keep it a secret from the pirates. The pirates decided that they wanted to sell Aang to the Fire Lord themselves, and the situation quickly escalated into a battle.",
      "links": [],
      "text": "Later, Aang and Sokka were found and captured and were taken to the pirates and Fire Nation ships. Aang and Sokka discovered Katara bound to a tree surrounded by firebenders. As Zuko and the pirates were about to trade the scroll for the Avatar, Sokka convinced the pirates to sell Aang by revealing to them that he was the Avatar, despite Zuko's attempts to keep it a secret from the pirates. The pirates decided that they wanted to sell Aang to the Fire Lord themselves, and the situation quickly escalated into a battle."
    },
    {
      "body": "During the fight, Aang, Katara and Sokka escaped and hijacked the pirate ship. Katara and Aang used waterbending to get the pirates' boat into water and sail away, but the pirates, except for their leader, stole Zuko's smaller ship and started chasing after them. They battled the pirates, Katara learning the water whip in the process. The ship was fast approaching a waterfall. Aang and Katara managed to use waterbending to stop the ship, but the pirates rammed into it with Zuko's boat, sending them falling over, where they were saved by Appa, who heard Aang's bison whistle which was working after all.",
      "links": [],
      "text": "During the fight, Aang, Katara and Sokka escaped and hijacked the pirate ship. Katara and Aang used waterbending to get the pirates' boat into water and sail away, but the pirates, except for their leader, stole Zuko's smaller ship and started chasing after them. They battled the pirates, Katara learning the water whip in the process. The ship was fast approaching a waterfall. Aang and Katara managed to use waterbending to stop the ship, but the pirates rammed into it with Zuko's boat, sending them falling over, where they were saved by Appa, who heard Aang's bison whistle which was working after all."
    },
    {
      "body": "Later, Katara gave Aang a full apology, while Sokka revealed that he was able to regain the scroll in the fighting. Before he gave it to her, he asked what they learned. She said never to steal, except from pirates. Aang and Katara could now practice waterbending.",
      "links": [],
      "text": "Later, Katara gave Aang a full apology, while Sokka revealed that he was able to regain the scroll in the fighting. Before he gave it to her, he asked what they learned. She said never to steal, except from pirates. Aang and Katara could now practice waterbending."
    },
    {
      "body": "Katara and Sokka began to argue over their chores at their campsite. Aang ended the fight by having them swap chores. Aang stated, \"Harsh words won't solve problems, action will.\" When ${link_0} and Appa fought over a piece of food, Aang resolved that issue as well and began gloating about his ability to solve problems as the Avatar. The following day, Aang and his friends came across the largest canyon in the world, the ${link_1}, and were planning to fly across on Appa.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        },
        {
          "body": "Great Divide",
          "key": "${link_1}",
          "target": {
            "href": "Great_Divide",
            "page": "Great_Divide"
          }
        }
      ],
      "text": "Katara and Sokka began to argue over their chores at their campsite. Aang ended the fight by having them swap chores. Aang stated, \"Harsh words won't solve problems, action will.\" When Momo and Appa fought over a piece of food, Aang resolved that issue as well and began gloating about his ability to solve problems as the Avatar. The following day, Aang and his friends came across the largest canyon in the world, the Great Divide, and were planning to fly across on Appa."
    },
    {
      "body": "${link_0} mediated between the feuding ${link_1} and ${link_2} tribes.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Zhang",
          "key": "${link_1}",
          "target": {
            "href": "Zhang",
            "page": "Zhang"
          }
        },
        {
          "body": "Gan Jin",
          "key": "${link_2}",
          "target": {
            "href": "Gan_Jin",
            "page": "Gan_Jin"
          }
        }
      ],
      "text": "Aang mediated between the feuding Zhang and Gan Jin tribes."
    },
    {
      "body": "Just before they left, a man ran up to them and started yelling that they better not leave with the ${link_0} because he was there first. He was holding a spot for the rest of his tribe, the ${link_1}, until they could arrive. While waiting, another tribe, the ${link_2}, arrived, a tribe that the man claimed had been an enemy of his tribe for one hundred years. The Gan Jin tribe arrived and showed themselves to be prim and proper, while the Zhang tribe was dirty and barbaric. The canyon guide, an ${link_3}, arrived, and both tribes got into an argument over who got to go first; the Zhangs said they should because they had sick people while the Gan Jins said they should because they had old people. Aang reached a compromise and suggested that Appa would carry their sick and elderly across, while the two tribes traveled together across the canyon.",
      "links": [
        {
          "body": "canyon guide",
          "key": "${link_0}",
          "target": {
            "href": "Canyon_guide",
            "page": "Canyon_guide"
          }
        },
        {
          "body": "Gan Jin",
          "key": "${link_1}",
          "target": {
            "href": "Gan_Jin",
            "page": "Gan_Jin"
          }
        },
        {
          "body": "Zhang",
          "key": "${link_2}",
          "target": {
            "href": "Zhang",
            "page": "Zhang"
          }
        },
        {
          "body": "earthbender",
          "key": "${link_3}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Just before they left, a man ran up to them and started yelling that they better not leave with the canyon guide because he was there first. He was holding a spot for the rest of his tribe, the Gan Jin, until they could arrive. While waiting, another tribe, the Zhang, arrived, a tribe that the man claimed had been an enemy of his tribe for one hundred years. The Gan Jin tribe arrived and showed themselves to be prim and proper, while the Zhang tribe was dirty and barbaric. The canyon guide, an earthbender, arrived, and both tribes got into an argument over who got to go first; the Zhangs said they should because they had sick people while the Gan Jins said they should because they had old people. Aang reached a compromise and suggested that Appa would carry their sick and elderly across, while the two tribes traveled together across the canyon."
    },
    {
      "body": "The canyon guide warned them not to take any food into the canyon, as it would attract dangerous predators. After he demolished a rock shelf so that potential Fire Nation soldiers could not follow them, a ${link_0} attacked. Aang and his friends fended it off, but the guide's arms were broken, which meant he could not earthbend and therefore they were trapped in the canyon. Both tribes argued some more and finally split up. It is revealed that both tribes brought food into the canyon because they believed that the other tribe must have brought food, thus justifying their actions. Katara and Sokka each learned one side of the story of the feuding tribes. The Gan Jins told Katara that the forefather of their tribe, ${link_1}, was attacked while transporting the ${link_2} during their redemption ritual and robbed by a thief, ${link_3}, from the Zhangs. The Zhangs told Sokka that their ancestor, Wei Jin, saw Jin Wei passed out on the ground and was returning the sacred orb to Jin Wei's tribe when they wrongfully imprisoned him for twenty years.",
      "links": [
        {
          "body": "canyon crawler",
          "key": "${link_0}",
          "target": {
            "href": "Canyon_crawler",
            "page": "Canyon_crawler"
          }
        },
        {
          "body": "Jin Wei",
          "key": "${link_1}",
          "target": {
            "href": "Jin_Wei",
            "page": "Jin_Wei"
          }
        },
        {
          "body": "sacred orb",
          "key": "${link_2}",
          "target": {
            "href": "Sacred_crystal_orb",
            "page": "Sacred_crystal_orb"
          }
        },
        {
          "body": "Wei Jin",
          "key": "${link_3}",
          "target": {
            "href": "Wei_Jin",
            "page": "Wei_Jin"
          }
        }
      ],
      "text": "The canyon guide warned them not to take any food into the canyon, as it would attract dangerous predators. After he demolished a rock shelf so that potential Fire Nation soldiers could not follow them, a canyon crawler attacked. Aang and his friends fended it off, but the guide's arms were broken, which meant he could not earthbend and therefore they were trapped in the canyon. Both tribes argued some more and finally split up. It is revealed that both tribes brought food into the canyon because they believed that the other tribe must have brought food, thus justifying their actions. Katara and Sokka each learned one side of the story of the feuding tribes. The Gan Jins told Katara that the forefather of their tribe, Jin Wei, was attacked while transporting the sacred orb during their redemption ritual and robbed by a thief, Wei Jin, from the Zhangs. The Zhangs told Sokka that their ancestor, Wei Jin, saw Jin Wei passed out on the ground and was returning the sacred orb to Jin Wei's tribe when they wrongfully imprisoned him for twenty years."
    },
    {
      "body": "They reached the end of the canyon, where they argued and prepared to fight and end the feud once and for all. Aang became angry and used airbending to stop the fight, but in the process revealed the food from both tribes, even getting entranced by custard tart, and attracting many canyon crawlers. By working together and throwing bags over the crawlers' heads while they were distracted with food, everyone was able to ride them up the wall and out of the canyon.",
      "links": [],
      "text": "They reached the end of the canyon, where they argued and prepared to fight and end the feud once and for all. Aang became angry and used airbending to stop the fight, but in the process revealed the food from both tribes, even getting entranced by custard tart, and attracting many canyon crawlers. By working together and throwing bags over the crawlers' heads while they were distracted with food, everyone was able to ride them up the wall and out of the canyon."
    },
    {
      "body": "${link_0} solved the feud by telling a made-up version of the story that led to the conflict.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Aang solved the feud by telling a made-up version of the story that led to the conflict."
    },
    {
      "body": "Afterward, the two tribe leaders were about to resume their fight. Aang, upon hearing the names of the two tribes' ancestors, revealed that he knew them, and that they were twins. He said that when they were eight and playing a game called \"${link_0}\". Jin Wei was running with the ball when he fell; Wei Jin picked it up and started running to the other end of the field when he stepped out of bounds and was put in the penalty box for two minutes.",
      "links": [
        {
          "body": "Redemption",
          "key": "${link_0}",
          "target": {
            "href": "Recreation_in_the_World_of_Avatar#Redemption",
            "page": "Recreation_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Afterward, the two tribe leaders were about to resume their fight. Aang, upon hearing the names of the two tribes' ancestors, revealed that he knew them, and that they were twins. He said that when they were eight and playing a game called \"Redemption\". Jin Wei was running with the ball when he fell; Wei Jin picked it up and started running to the other end of the field when he stepped out of bounds and was put in the penalty box for two minutes."
    },
    {
      "body": "As they met Appa on the other side, Aang happily hugged him, and Appa licked his face. The Gan Jin leader thanked Aang, only to be repulsed by the saliva on Aang's face. Finally, the tribes made up and continued their journey to ${link_0} together as one tribe, along with the guide who had enough of the canyon. Aang subsequently revealed to his friends that he made up the whole thing, much to their surprise.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "As they met Appa on the other side, Aang happily hugged him, and Appa licked his face. The Gan Jin leader thanked Aang, only to be repulsed by the saliva on Aang's face. Finally, the tribes made up and continued their journey to Ba Sing Se together as one tribe, along with the guide who had enough of the canyon. Aang subsequently revealed to his friends that he made up the whole thing, much to their surprise."
    },
    {
      "body": "Aang had a strange dream about his past that clearly troubled him, but did not tell the others. It started happily with Aang, Katara and Sokka unrealistically flying through the skies, but suddenly Aang was alone, trapped in a storm and plunged into the sea.",
      "links": [],
      "text": "Aang had a strange dream about his past that clearly troubled him, but did not tell the others. It started happily with Aang, Katara and Sokka unrealistically flying through the skies, but suddenly Aang was alone, trapped in a storm and plunged into the sea."
    },
    {
      "body": "Later, Aang, Katara and Sokka stopped by a market, but realized they were out of food and money. They ran into a ${link_0}, who hired Sokka, but when he found out that Aang was the Avatar, he yelled at him, saying that \"he turned his back on the world.\" Aang became upset and flew away into a cave. Katara reprimanded the fisherman for his harsh words and went after Aang, as a horrible storm began brewing.",
      "links": [
        {
          "body": "fisherman",
          "key": "${link_0}",
          "target": {
            "href": "Fisherman",
            "page": "Fisherman"
          }
        }
      ],
      "text": "Later, Aang, Katara and Sokka stopped by a market, but realized they were out of food and money. They ran into a fisherman, who hired Sokka, but when he found out that Aang was the Avatar, he yelled at him, saying that \"he turned his back on the world.\" Aang became upset and flew away into a cave. Katara reprimanded the fisherman for his harsh words and went after Aang, as a horrible storm began brewing."
    },
    {
      "body": "${link_0} revealed the truth of how he became locked in the iceberg.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Aang revealed the truth of how he became locked in the iceberg."
    },
    {
      "body": "Aang started telling the story of his past to Katara, beginning with the day the monks told him he was the Avatar. Burdened with extra training exercises and ostracized from his friends, Aang became confused and afraid; so when he learned that the monks were planning to separate him from his guardian, Gyatso, he decided to run away. Aang was caught in a horrible storm, and as he was about to drown, the Avatar Spirit inside him formed an air pocket, saving himself and Appa, but freezing them inside for the next one hundred years. Aang suffered terrible guilt over abandoning the world, but Katara convinced him that \"it was meant to be\", and he \"gives people hope\".",
      "links": [],
      "text": "Aang started telling the story of his past to Katara, beginning with the day the monks told him he was the Avatar. Burdened with extra training exercises and ostracized from his friends, Aang became confused and afraid; so when he learned that the monks were planning to separate him from his guardian, Gyatso, he decided to run away. Aang was caught in a horrible storm, and as he was about to drown, the Avatar Spirit inside him formed an air pocket, saving himself and Appa, but freezing them inside for the next one hundred years. Aang suffered terrible guilt over abandoning the world, but Katara convinced him that \"it was meant to be\", and he \"gives people hope\"."
    },
    {
      "body": "As the storm reached its height, becoming a typhoon, the ${link_0} of the old fisherman arrived at the cave, beckoning for the Avatar's help. She explained that her husband and Sokka should have returned from their fishing expedition and must have become caught out at sea. Aang and Katara flew out on Appa and came upon the fishing boat that was capsized. They were able to safely rescue Sokka and the old man and return them to the cave. Aang later told Katara that he was ready to move on from the past and look toward a brighter future.",
      "links": [
        {
          "body": "wife",
          "key": "${link_0}",
          "target": {
            "href": "Fisherman%27s_wife",
            "page": "Fisherman%27s_wife"
          }
        }
      ],
      "text": "As the storm reached its height, becoming a typhoon, the wife of the old fisherman arrived at the cave, beckoning for the Avatar's help. She explained that her husband and Sokka should have returned from their fishing expedition and must have become caught out at sea. Aang and Katara flew out on Appa and came upon the fishing boat that was capsized. They were able to safely rescue Sokka and the old man and return them to the cave. Aang later told Katara that he was ready to move on from the past and look toward a brighter future."
    },
    {
      "body": "In ${link_0}, also along the western shores, Sokka had fallen ill due to his exposure to the recent storm. He was delusional and also exhibited flu-like symptoms. Aang learned of an ${link_1} who lived at the top of a nearby mountain and made plans to travel there to find a cure. The situation worsened when Katara quickly grew sick herself, leaving Aang to travel alone to the herbalist. Aang raced through the mountainside, using his airbending abilities to speed his pace. He soon arrived at the herbalist's home, but not before passing an unnoticed pair of Fire Nation look-outs, who sounded the alarm after their station was ripped apart by the winds in Aang's path. After a frustrating meeting with the herbalist, Aang learned that his friends must suck on the frozen bodies of hibernating ${link_2}, which could be found on the bottoms of riverbeds.",
      "links": [
        {
          "body": "abandoned Earth Kingdom ruins",
          "key": "${link_0}",
          "target": {
            "href": "Taku",
            "page": "Taku"
          }
        },
        {
          "body": "herbalist",
          "key": "${link_1}",
          "target": {
            "href": "Herbalist",
            "page": "Herbalist"
          }
        },
        {
          "body": "wood frogs",
          "key": "${link_2}",
          "target": {
            "href": "Wood_frog",
            "page": "Wood_frog"
          }
        }
      ],
      "text": "In abandoned Earth Kingdom ruins, also along the western shores, Sokka had fallen ill due to his exposure to the recent storm. He was delusional and also exhibited flu-like symptoms. Aang learned of an herbalist who lived at the top of a nearby mountain and made plans to travel there to find a cure. The situation worsened when Katara quickly grew sick herself, leaving Aang to travel alone to the herbalist. Aang raced through the mountainside, using his airbending abilities to speed his pace. He soon arrived at the herbalist's home, but not before passing an unnoticed pair of Fire Nation look-outs, who sounded the alarm after their station was ripped apart by the winds in Aang's path. After a frustrating meeting with the herbalist, Aang learned that his friends must suck on the frozen bodies of hibernating wood frogs, which could be found on the bottoms of riverbeds."
    },
    {
      "body": "However, he made little progress toward his destination before encountering the ${link_0}, who wasted little time in pinning his boots to the ground with arrows. Aang airbent to defend himself from the succeeding shots, freed his legs, and jumped off of the mountain into the thick forest below. Aang ran out of the woods, and unexpectedly ended up in a murky, partially-frozen river. He found the frozen frogs he had been looking for, and even while avoiding the Yuyans' arrows, managed to scoop several of the amphibians into his clothing. However, several arrows caught the sleeve of his left and right arm and pinned it to an overturned tree before a net was shot over him.",
      "links": [
        {
          "body": "Yuyan Archers",
          "key": "${link_0}",
          "target": {
            "href": "Yuyan_Archers",
            "page": "Yuyan_Archers"
          }
        }
      ],
      "text": "However, he made little progress toward his destination before encountering the Yuyan Archers, who wasted little time in pinning his boots to the ground with arrows. Aang airbent to defend himself from the succeeding shots, freed his legs, and jumped off of the mountain into the thick forest below. Aang ran out of the woods, and unexpectedly ended up in a murky, partially-frozen river. He found the frozen frogs he had been looking for, and even while avoiding the Yuyans' arrows, managed to scoop several of the amphibians into his clothing. However, several arrows caught the sleeve of his left and right arm and pinned it to an overturned tree before a net was shot over him."
    },
    {
      "body": "Aang was taken back to ${link_0} and placed in a cell guarded on the outside by four guards, while his arms and legs were chained and held in place. ${link_1} ${link_2} entered the cell and began to taunt Aang by bringing up the fact that all the other airbenders were slaughtered. However, Zhao stated that he would not have Aang killed, as such an action would simply result in the Avatar being reincarnated, leaving the Fire Nation to find him/her again. Instead, Zhao promised to keep Aang alive, though \"just barely\". As Zhao departed, Aang angrily used his powerful breath to blow Zhao against the wall. However, before leaving, Zhao decided to have the last word and stated that there was no possible way for Aang to escape, and no one would come to rescue him. The frogs, still stuffed in Aang's clothes, began to thaw and crawl away, despite the young airbender's protests. Just as several frogs, still partially-frozen, crawled under the door, the mysterious Blue Spirit, a broadsword-wielding vigilante, appeared and deftly defeated the guards in his way. The Blue Spirit slashed through Aang's bonds, freeing him, and began to leave the room. Aang questioned the Blue Spirit's identity and intentions, but he did not answer, instead silently motioning for Aang to follow him. Aang concluded that this new figure meant to help him escape.",
      "links": [
        {
          "body": "a fortress",
          "key": "${link_0}",
          "target": {
            "href": "Pohuai_Stronghold",
            "page": "Pohuai_Stronghold"
          }
        },
        {
          "body": "Admiral",
          "key": "${link_1}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_2}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        }
      ],
      "text": "Aang was taken back to a fortress and placed in a cell guarded on the outside by four guards, while his arms and legs were chained and held in place. Admiral Zhao entered the cell and began to taunt Aang by bringing up the fact that all the other airbenders were slaughtered. However, Zhao stated that he would not have Aang killed, as such an action would simply result in the Avatar being reincarnated, leaving the Fire Nation to find him/her again. Instead, Zhao promised to keep Aang alive, though \"just barely\". As Zhao departed, Aang angrily used his powerful breath to blow Zhao against the wall. However, before leaving, Zhao decided to have the last word and stated that there was no possible way for Aang to escape, and no one would come to rescue him. The frogs, still stuffed in Aang's clothes, began to thaw and crawl away, despite the young airbender's protests. Just as several frogs, still partially-frozen, crawled under the door, the mysterious Blue Spirit, a broadsword-wielding vigilante, appeared and deftly defeated the guards in his way. The Blue Spirit slashed through Aang's bonds, freeing him, and began to leave the room. Aang questioned the Blue Spirit's identity and intentions, but he did not answer, instead silently motioning for Aang to follow him. Aang concluded that this new figure meant to help him escape."
    },
    {
      "body": "${link_0} was threatened by the ${link_1} to ward off ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Blue Spirit",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_2}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        }
      ],
      "text": "Aang was threatened by the Blue Spirit to ward off Zhao."
    },
    {
      "body": "During a difficult and violent attempt to escape, which included a standoff, seen at the left, a Yuyan Archer knocked out the Blue Spirit with a single arrow to his forehead. The Blue Spirit fell over instantly, unconscious. Aang immediately airbent up a large dust cloud and concealed himself. He took off the Blue Spirit's mask to learn that his rescuer was ${link_0}. He turned to run and leave the ${link_1} behind, but hesitated. When the dust settled, Aang and Zuko had vanished without a trace.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "prince",
          "key": "${link_1}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "text": "During a difficult and violent attempt to escape, which included a standoff, seen at the left, a Yuyan Archer knocked out the Blue Spirit with a single arrow to his forehead. The Blue Spirit fell over instantly, unconscious. Aang immediately airbent up a large dust cloud and concealed himself. He took off the Blue Spirit's mask to learn that his rescuer was Zuko. He turned to run and leave the prince behind, but hesitated. When the dust settled, Aang and Zuko had vanished without a trace."
    },
    {
      "body": "Later, Zuko regained consciousness to discover that morning had arrived, and he was with Aang in a wooded area. Aang spoke nostalgically of ${link_0}, a Fire Nation boy he knew as one of his closest friends a century before. He laughed at the thought of how much trouble he got into with his friend. After reflecting, he asked Zuko if, under different circumstances, they too could have been friends. Zuko paused before responding by launching a fire blast, which Aang easily avoided before leaping through the trees. Aang returned to the swampy river to retrieve a new set of frozen frogs. He finally returned to Katara and Sokka, placing a frozen frog in each of their mouths and repeating to them what the herbalist told him. A delirious Sokka asked if Aang made any new friends, to which he sadly replied no, as he rested.",
      "links": [
        {
          "body": "Kuzon",
          "key": "${link_0}",
          "target": {
            "href": "Kuzon",
            "page": "Kuzon"
          }
        }
      ],
      "text": "Later, Zuko regained consciousness to discover that morning had arrived, and he was with Aang in a wooded area. Aang spoke nostalgically of Kuzon, a Fire Nation boy he knew as one of his closest friends a century before. He laughed at the thought of how much trouble he got into with his friend. After reflecting, he asked Zuko if, under different circumstances, they too could have been friends. Zuko paused before responding by launching a fire blast, which Aang easily avoided before leaping through the trees. Aang returned to the swampy river to retrieve a new set of frozen frogs. He finally returned to Katara and Sokka, placing a frozen frog in each of their mouths and repeating to them what the herbalist told him. A delirious Sokka asked if Aang made any new friends, to which he sadly replied no, as he rested."
    },
    {
      "body": "As the group camped out by a lake, Aang wove a necklace for Katara from Sokka's fishing line to replace her stolen one. Upon seeing the Water Tribe girl donning the necklace, he saw her in a whole new light, developing a strong crush on her. Loud noises drew the group to a spot in the wooded area where an elderly man was being attacked by a vicious platypus bear. Despite the dire circumstances, however, the man remained oddly calm. After Appa managed to fend off the bear, the man told them he came from a nearby village where a fortuneteller, Aunt ${link_0}, lived. The group decided to travel to the ${link_1} to have their fortunes told, much to Sokka's dismay.",
      "links": [
        {
          "body": "Wu",
          "key": "${link_0}",
          "target": {
            "href": "Wu_(fortuneteller)",
            "page": "Wu_(fortuneteller)"
          }
        },
        {
          "body": "village",
          "key": "${link_1}",
          "target": {
            "href": "Makapu_Village",
            "page": "Makapu_Village"
          }
        }
      ],
      "text": "As the group camped out by a lake, Aang wove a necklace for Katara from Sokka's fishing line to replace her stolen one. Upon seeing the Water Tribe girl donning the necklace, he saw her in a whole new light, developing a strong crush on her. Loud noises drew the group to a spot in the wooded area where an elderly man was being attacked by a vicious platypus bear. Despite the dire circumstances, however, the man remained oddly calm. After Appa managed to fend off the bear, the man told them he came from a nearby village where a fortuneteller, Aunt Wu, lived. The group decided to travel to the village to have their fortunes told, much to Sokka's dismay."
    },
    {
      "body": "${link_0} used his ${link_1} to stop the lava from the eruption of ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "airbending",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Mt. Makapu",
          "key": "${link_2}",
          "target": {
            "href": "Mt",
            "page": "Mt"
          }
        }
      ],
      "text": "Aang used his airbending to stop the lava from the eruption of Mt. Makapu."
    },
    {
      "body": "While there, Aang tried repeatedly to draw Katara's attention, even taking advice from Sokka on how to approach her. Sokka instructed Aang to act aloof, as though he did not really care. This behavior, however, was not successful in impressing Katara, much to Aang's disappointment. He instead opted to retrieve a rare ${link_0} flower for her on the rim of the ${link_1} which led to his discovery of the volcano ready to erupt and destroy the village. After plans were arranged to dig a trench to channel the oncoming lava to the river and some impressive displays of airbending power, Aang managed to successfully quell the volcano's fury and save the village.",
      "links": [
        {
          "body": "panda lily",
          "key": "${link_0}",
          "target": {
            "href": "Panda_lily",
            "page": "Panda_lily"
          }
        },
        {
          "body": "Makapu volcano",
          "key": "${link_1}",
          "target": {
            "href": "Mt",
            "page": "Mt"
          }
        }
      ],
      "text": "While there, Aang tried repeatedly to draw Katara's attention, even taking advice from Sokka on how to approach her. Sokka instructed Aang to act aloof, as though he did not really care. This behavior, however, was not successful in impressing Katara, much to Aang's disappointment. He instead opted to retrieve a rare panda lily flower for her on the rim of the Makapu volcano which led to his discovery of the volcano ready to erupt and destroy the village. After plans were arranged to dig a trench to channel the oncoming lava to the river and some impressive displays of airbending power, Aang managed to successfully quell the volcano's fury and save the village."
    },
    {
      "body": "While camping one night by a Water Tribe ship the team discovered earlier that day, a fellow Water Tribe member and old friend of Katara and Sokka, ${link_0}, appeared. Bato took the team to his room in a nearby ${link_1} and he, Katara and Sokka began recalling stories of the past, while unintentionally ostracizing Aang in the process. When Bato informed the two Water Tribe siblings that he was expecting a message from their father about his whereabouts and that they had the opportunity to reunite with him, Aang became fed up and left the room. While brooding outside, he was approached by an Earth Kingdom messenger who delivered him the message Bato had been expecting. Instead of taking it to him, though, Aang crumpled it up and kept it to himself.",
      "links": [
        {
          "body": "Bato",
          "key": "${link_0}",
          "target": {
            "href": "Bato",
            "page": "Bato"
          }
        },
        {
          "body": "abbey",
          "key": "${link_1}",
          "target": {
            "href": "Abbey",
            "page": "Abbey"
          }
        }
      ],
      "text": "While camping one night by a Water Tribe ship the team discovered earlier that day, a fellow Water Tribe member and old friend of Katara and Sokka, Bato, appeared. Bato took the team to his room in a nearby abbey and he, Katara and Sokka began recalling stories of the past, while unintentionally ostracizing Aang in the process. When Bato informed the two Water Tribe siblings that he was expecting a message from their father about his whereabouts and that they had the opportunity to reunite with him, Aang became fed up and left the room. While brooding outside, he was approached by an Earth Kingdom messenger who delivered him the message Bato had been expecting. Instead of taking it to him, though, Aang crumpled it up and kept it to himself."
    },
    {
      "body": "The next day, Aang and his friends performed the coming-of-age ritual of ${link_0}. After successfully navigating a ship through rocky waters, each of them were bestowed with an honorary mark. Aang was bestowed the mark of the trusted which finally pushed him to come clean and reveal that he had the map to Sokka and Katara's father. An angered Sokka and hurt Katara abandoned him to go find their father, leaving the Avatar disappointed and on his own.",
      "links": [
        {
          "body": "ice dodging",
          "key": "${link_0}",
          "target": {
            "href": "Ice_dodging",
            "page": "Ice_dodging"
          }
        }
      ],
      "text": "The next day, Aang and his friends performed the coming-of-age ritual of ice dodging. After successfully navigating a ship through rocky waters, each of them were bestowed with an honorary mark. Aang was bestowed the mark of the trusted which finally pushed him to come clean and reveal that he had the map to Sokka and Katara's father. An angered Sokka and hurt Katara abandoned him to go find their father, leaving the Avatar disappointed and on his own."
    },
    {
      "body": "In the end, however, the two realized that Aang was their family and they were needed by him on his journey north. They rejoined him and, after engaging in a battle with Prince Zuko, ultimately defeating him, the three made up. Aang returned Katara's necklace to her and she kissed him on the cheek, causing him to blush and twiddle his thumbs.",
      "links": [],
      "text": "In the end, however, the two realized that Aang was their family and they were needed by him on his journey north. They rejoined him and, after engaging in a battle with Prince Zuko, ultimately defeating him, the three made up. Aang returned Katara's necklace to her and she kissed him on the cheek, causing him to blush and twiddle his thumbs."
    },
    {
      "body": "${link_0} began learning ${link_1} basics from ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Jeong Jeong",
          "key": "${link_2}",
          "target": {
            "href": "Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        }
      ],
      "text": "Aang began learning firebending basics from Jeong Jeong."
    },
    {
      "body": "Venturing through the northwestern Earth Kingdom, Aang and his friends decided to go to a ${link_0} in a Fire Nation occupied ${link_1} so that Aang could witness some firebending, ensuring their safety from attack with disguises, although they acquired masks soon after their arrival. Regardless, it was discovered that Aang was the Avatar after he was forced to \"save\" Katara from a dragon of fire by using his airbending, and the three friends quickly attempted to escape from Fire Nation soldiers. Their escape was aided greatly by a man named ${link_2}, who told them of a firebender and deserter named ${link_3}. Chey took them to him and after the spirit of Avatar ${link_4} appeared to Jeong Jeong and persuaded him to be Aang's mentor, he reluctantly agreed to teach Aang firebending.",
      "links": [
        {
          "body": "cultural festival",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation#Cultural_Festivals",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "town",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_colonial_village",
            "page": "Fire_Nation_colonial_village"
          }
        },
        {
          "body": "Chey",
          "key": "${link_2}",
          "target": {
            "href": "Chey",
            "page": "Chey"
          }
        },
        {
          "body": "Jeong Jeong",
          "key": "${link_3}",
          "target": {
            "href": "Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        },
        {
          "body": "Roku",
          "key": "${link_4}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        }
      ],
      "text": "Venturing through the northwestern Earth Kingdom, Aang and his friends decided to go to a cultural festival in a Fire Nation occupied town so that Aang could witness some firebending, ensuring their safety from attack with disguises, although they acquired masks soon after their arrival. Regardless, it was discovered that Aang was the Avatar after he was forced to \"save\" Katara from a dragon of fire by using his airbending, and the three friends quickly attempted to escape from Fire Nation soldiers. Their escape was aided greatly by a man named Chey, who told them of a firebender and deserter named Jeong Jeong. Chey took them to him and after the spirit of Avatar Roku appeared to Jeong Jeong and persuaded him to be Aang's mentor, he reluctantly agreed to teach Aang firebending."
    },
    {
      "body": "Jeong Jeong started teaching Aang slowly, focusing exclusively on breathing exercises, but the young Avatar desired to learn more advanced firebending techniques. Jeong Jeong was greatly angered with Aang's lack of discipline, telling Aang vehemently that without control, firebending would bring nothing but unnecessary destruction, using a former student of his who displayed similar impatience and lack of discipline as an example. Aang quickly apologized and said that he was ready to learn Jeong Jeong's way. Jeong Jeong proceeded to teach Aang to use real fire, much to Aang's enthusiasm. However, his enthusiasm was quickly deflated when Jeong Jeong only assigned him the simple task of preventing a leaf from being completely burned. Jeong Jeong soon left to other matters, and Aang, still feeling restricted, took his exercise to the next step and created fire. Aang played around with it for a little while, although Katara insisted that he be careful. He soon accidentally burned Katara's hands when he attempted to imitate a move the performer made at the festival. Katara ran away crying, and Sokka became enraged as a result and tackled him. Jeong Jeong, having returned, followed Katara into the forest. However, during this time, Admiral Zhao, who was revealed to be the former student of Jeong Jeong, and his men located the ${link_0}, and in turn battled Jeong Jeong, although the master's attempt was half-hearted.",
      "links": [
        {
          "body": "camp",
          "key": "${link_0}",
          "target": {
            "href": "Jeong_Jeong%27s_camp",
            "page": "Jeong_Jeong%27s_camp"
          }
        }
      ],
      "text": "Jeong Jeong started teaching Aang slowly, focusing exclusively on breathing exercises, but the young Avatar desired to learn more advanced firebending techniques. Jeong Jeong was greatly angered with Aang's lack of discipline, telling Aang vehemently that without control, firebending would bring nothing but unnecessary destruction, using a former student of his who displayed similar impatience and lack of discipline as an example. Aang quickly apologized and said that he was ready to learn Jeong Jeong's way. Jeong Jeong proceeded to teach Aang to use real fire, much to Aang's enthusiasm. However, his enthusiasm was quickly deflated when Jeong Jeong only assigned him the simple task of preventing a leaf from being completely burned. Jeong Jeong soon left to other matters, and Aang, still feeling restricted, took his exercise to the next step and created fire. Aang played around with it for a little while, although Katara insisted that he be careful. He soon accidentally burned Katara's hands when he attempted to imitate a move the performer made at the festival. Katara ran away crying, and Sokka became enraged as a result and tackled him. Jeong Jeong, having returned, followed Katara into the forest. However, during this time, Admiral Zhao, who was revealed to be the former student of Jeong Jeong, and his men located the camp, and in turn battled Jeong Jeong, although the master's attempt was half-hearted."
    },
    {
      "body": "${link_0}'s reckless ${link_1} burned ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Aang's reckless firebending burned Katara."
    },
    {
      "body": "Aang, hiding away in Jeong Jeong's hut in order to reflect over his error, was urged by Katara to aid Jeong Jeong. Although Aang felt terribly guilty and promised to never firebend again, Katara's revelation of her ${link_0} restored his battle spirit. With a fiery display, Jeong Jeong and his men made their escape, while Aang confronted Zhao. Recalling Jeong Jeong's lesson of control, Aang provoked the firebending master, goading him into destroying his own ships. Zhao could only watch as his ships burned and sank into the river as Aang escaped. In this act, Aang demonstrated that some firebenders had little self-control. With Jeong Jeong gone, the three resumed their journey and left the forest, a hard-learned lesson of fire's destructive power fresh in their minds.",
      "links": [
        {
          "body": "healing",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "Aang, hiding away in Jeong Jeong's hut in order to reflect over his error, was urged by Katara to aid Jeong Jeong. Although Aang felt terribly guilty and promised to never firebend again, Katara's revelation of her healing restored his battle spirit. With a fiery display, Jeong Jeong and his men made their escape, while Aang confronted Zhao. Recalling Jeong Jeong's lesson of control, Aang provoked the firebending master, goading him into destroying his own ships. Zhao could only watch as his ships burned and sank into the river as Aang escaped. In this act, Aang demonstrated that some firebenders had little self-control. With Jeong Jeong gone, the three resumed their journey and left the forest, a hard-learned lesson of fire's destructive power fresh in their minds."
    },
    {
      "body": "After hearing rumors about flying people from a traveling storyteller, the kids journeyed to the ${link_0} to see for themselves if the rumors were true. Upon arrival, they found not airbenders, but an Earth Kingdom colony led by ${link_1} and ${link_2}. He made ${link_3} based on the Air Nomad staffs he found in the temple, and the members of the colony used them for \"flight\", leading to the rumor of the \"flying people\". The inventor had defiled the ancient landmarks with technological \"improvements\", similar in style to the Industrial Revolution. Aang was at first disheartened by the many changes to the temple, though he developed a degree of respect for the mechanist's son, Teo. Sokka began to work with the mechanist and came up with ways to detect natural gas leaks through use of rotten eggs.",
      "links": [
        {
          "body": "Northern Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        },
        {
          "body": "a mad inventor",
          "key": "${link_1}",
          "target": {
            "href": "Mechanist",
            "page": "Mechanist"
          }
        },
        {
          "body": "his paraplegic son",
          "key": "${link_2}",
          "target": {
            "href": "Teo",
            "page": "Teo"
          }
        },
        {
          "body": "gliders",
          "key": "${link_3}",
          "target": {
            "href": "Glider",
            "page": "Glider"
          }
        }
      ],
      "text": "After hearing rumors about flying people from a traveling storyteller, the kids journeyed to the Northern Air Temple to see for themselves if the rumors were true. Upon arrival, they found not airbenders, but an Earth Kingdom colony led by a mad inventor and his paraplegic son. He made gliders based on the Air Nomad staffs he found in the temple, and the members of the colony used them for \"flight\", leading to the rumor of the \"flying people\". The inventor had defiled the ancient landmarks with technological \"improvements\", similar in style to the Industrial Revolution. Aang was at first disheartened by the many changes to the temple, though he developed a degree of respect for the mechanist's son, Teo. Sokka began to work with the mechanist and came up with ways to detect natural gas leaks through use of rotten eggs."
    },
    {
      "body": "${link_0} was initially furious with what the ${link_1} had done to the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "mechanist",
          "key": "${link_1}",
          "target": {
            "href": "Mechanist",
            "page": "Mechanist"
          }
        },
        {
          "body": "Northern Air Temple",
          "key": "${link_2}",
          "target": {
            "href": "Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        }
      ],
      "text": "Aang was initially furious with what the mechanist had done to the Northern Air Temple."
    },
    {
      "body": "This state of relative happiness was not to last. Aang soon discovered that the mechanist was supplying the Fire Nation with weapons inside the temple's ${link_0} where Avatar statues were supposed to be, in exchange for the safety of his newly settled village. He unearthed a room filled with monstrous weapons of war, like self-propelled war wagons and attack balloons, all destined for use by the enemy. Later, Aang demanded to know when the Fire Nation would come for their weapons, and the mechanist stated soon. After that, ${link_1} ${link_2} appeared, demanding his weapons. Aang closed the door and trapped the minister, told him that the deal was off, and slapped him in the face with a blast of air. Qin angrily stated to Aang that \"the destruction of [the] temple [would] be on [his] head\".",
      "links": [
        {
          "body": "sanctuary",
          "key": "${link_0}",
          "target": {
            "href": "Air_temple_sanctuaries",
            "page": "Air_temple_sanctuaries"
          }
        },
        {
          "body": "War Minister",
          "key": "${link_1}",
          "target": {
            "href": "War_Minister",
            "page": "War_Minister"
          }
        },
        {
          "body": "Qin",
          "key": "${link_2}",
          "target": {
            "href": "Qin",
            "page": "Qin"
          }
        }
      ],
      "text": "This state of relative happiness was not to last. Aang soon discovered that the mechanist was supplying the Fire Nation with weapons inside the temple's sanctuary where Avatar statues were supposed to be, in exchange for the safety of his newly settled village. He unearthed a room filled with monstrous weapons of war, like self-propelled war wagons and attack balloons, all destined for use by the enemy. Later, Aang demanded to know when the Fire Nation would come for their weapons, and the mechanist stated soon. After that, War Minister Qin appeared, demanding his weapons. Aang closed the door and trapped the minister, told him that the deal was off, and slapped him in the face with a blast of air. Qin angrily stated to Aang that \"the destruction of [the] temple [would] be on [his] head\"."
    },
    {
      "body": "However, Aang realized that they had something the Fire Nation did not have: air power. Sokka and the mechanist planned on how to improve the war balloon and how to fight back the Fire Nation using their gliders and the prototype war balloon. Sokka stated that there were four different types of bombs; smoke, slime, stink and fire. When the mechanist stated stink, he added, \"Never underestimate the power of stink.\" The gliders fought with courage, but the Fire Nation tanks soon overwhelmed them. Every time Aang flipped them over, the cockpits also flipped. Teo stated that the tanks had a water balancing system. Katara used this knowledge and her waterbending to fight them, but there were too many.",
      "links": [],
      "text": "However, Aang realized that they had something the Fire Nation did not have: air power. Sokka and the mechanist planned on how to improve the war balloon and how to fight back the Fire Nation using their gliders and the prototype war balloon. Sokka stated that there were four different types of bombs; smoke, slime, stink and fire. When the mechanist stated stink, he added, \"Never underestimate the power of stink.\" The gliders fought with courage, but the Fire Nation tanks soon overwhelmed them. Every time Aang flipped them over, the cockpits also flipped. Teo stated that the tanks had a water balancing system. Katara used this knowledge and her waterbending to fight them, but there were too many."
    },
    {
      "body": "Appa arrived and retrieved Aang and Katara out of the battlefield. Out of explosives, the people lost hope, but the war balloon appeared. The Fire Nation did not attack because they saw the Fire Nation emblem on it. Sokka dropped several slime bombs, but that did not stop the advancing army. Ultimately, Sokka, in a desperate maneuver, threw the balloon's hot air engine into a crack with explosive gas emanating from it. The resulting explosion crushed the invaders and resulted in victory for Team Avatar and the Earth Kingdom colony. Afterward, Aang stated his approval of the villagers having settled there.",
      "links": [],
      "text": "Appa arrived and retrieved Aang and Katara out of the battlefield. Out of explosives, the people lost hope, but the war balloon appeared. The Fire Nation did not attack because they saw the Fire Nation emblem on it. Sokka dropped several slime bombs, but that did not stop the advancing army. Ultimately, Sokka, in a desperate maneuver, threw the balloon's hot air engine into a crack with explosive gas emanating from it. The resulting explosion crushed the invaders and resulted in victory for Team Avatar and the Earth Kingdom colony. Afterward, Aang stated his approval of the villagers having settled there."
    },
    {
      "body": "Unknowingly, the balloon consequently dropped into the Fire Nation campgrounds. Qin and his soldiers found it, saying, \"This defeat is the gateway to many victories\", as firebenders inflated the balloon.",
      "links": [],
      "text": "Unknowingly, the balloon consequently dropped into the Fire Nation campgrounds. Qin and his soldiers found it, saying, \"This defeat is the gateway to many victories\", as firebenders inflated the balloon."
    },
    {
      "body": "As they progressed toward the north, Sokka began to complain that Appa was flying too slowly. Aang defensively replied that they should all climb on Sokka's back and he could fly them to the ${link_0}. Katara tried to soothe the situation by remarking that they were all tired and cranky as a result of flying for two days straight. Just as Sokka was voicing his doubts about finding the Northern Water Tribe, the group was attacked by northern waterbenders who led them to their Water Tribe.",
      "links": [
        {
          "body": "North Pole",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "text": "As they progressed toward the north, Sokka began to complain that Appa was flying too slowly. Aang defensively replied that they should all climb on Sokka's back and he could fly them to the North Pole. Katara tried to soothe the situation by remarking that they were all tired and cranky as a result of flying for two days straight. Just as Sokka was voicing his doubts about finding the Northern Water Tribe, the group was attacked by northern waterbenders who led them to their Water Tribe."
    },
    {
      "body": "Outside the great palace of the Northern Water Tribe, Sokka and Katara were celebrated as family from the Southern Tribe, and Aang was honored as a special guest. Aang and Katara were delighted to see the waterbending master, ${link_0}, and his students performing elaborate and elegant waterbending moves for entertainment. After the waterbending performance was over, Aang was introduced to Master Pakku. Aang was looking forward to Katara and himself learning waterbending, after a few days rest. Master Pakku was unimpressed with his work ethic, telling Aang that he would receive no special treatment just because he was destined to save the world. He was told that if he was interested in learning waterbending, he would be ready at sunrise.",
      "links": [
        {
          "body": "Pakku",
          "key": "${link_0}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        }
      ],
      "text": "Outside the great palace of the Northern Water Tribe, Sokka and Katara were celebrated as family from the Southern Tribe, and Aang was honored as a special guest. Aang and Katara were delighted to see the waterbending master, Pakku, and his students performing elaborate and elegant waterbending moves for entertainment. After the waterbending performance was over, Aang was introduced to Master Pakku. Aang was looking forward to Katara and himself learning waterbending, after a few days rest. Master Pakku was unimpressed with his work ethic, telling Aang that he would receive no special treatment just because he was destined to save the world. He was told that if he was interested in learning waterbending, he would be ready at sunrise."
    },
    {
      "body": "${link_0} secretly taught ${link_1} to ${link_2} at the ${link_3}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_3}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "text": "Aang secretly taught waterbending to Katara at the Northern Water Tribe."
    },
    {
      "body": "The next day as they approached the palace, Katara expressed her joy at being able to learn from a real master, saying she had waited for this day her whole life. However she was horrified to learn from Master Pakku that it was forbidden for women to learn waterbending. He advised her to go to the healing huts and learn from ${link_0} to use her waterbending to heal. Although Aang initially refused to learn from Master Pakku, outraged at the unfairness, Katara urged him to return, saying that he could not risk his training for her. Thus, Aang began to reluctantly learn from Master Pakku.",
      "links": [
        {
          "body": "Yugoda",
          "key": "${link_0}",
          "target": {
            "href": "Yugoda",
            "page": "Yugoda"
          }
        }
      ],
      "text": "The next day as they approached the palace, Katara expressed her joy at being able to learn from a real master, saying she had waited for this day her whole life. However she was horrified to learn from Master Pakku that it was forbidden for women to learn waterbending. He advised her to go to the healing huts and learn from Yugoda to use her waterbending to heal. Although Aang initially refused to learn from Master Pakku, outraged at the unfairness, Katara urged him to return, saying that he could not risk his training for her. Thus, Aang began to reluctantly learn from Master Pakku."
    },
    {
      "body": "Sokka suggested that at night Aang teach Katara everything he had learned that day. Katara was excited at this idea, as it allowed her to learn waterbending and Aang would have someone with whom to practice; everyone would be happy. Sokka remarked that he was not happy, but Katara dismissed this by saying that he was never happy, and she and Aang hurried outside to begin practicing. They looked up to the bridge above them to see Master Pakku, who was angry that Aang had disrespected him, his teachings, and his entire culture. Aang hastily apologized, but Master Pakku refused to teach Aang anymore, saying he was no longer welcome as his student, before leaving.",
      "links": [],
      "text": "Sokka suggested that at night Aang teach Katara everything he had learned that day. Katara was excited at this idea, as it allowed her to learn waterbending and Aang would have someone with whom to practice; everyone would be happy. Sokka remarked that he was not happy, but Katara dismissed this by saying that he was never happy, and she and Aang hurried outside to begin practicing. They looked up to the bridge above them to see Master Pakku, who was angry that Aang had disrespected him, his teachings, and his entire culture. Aang hastily apologized, but Master Pakku refused to teach Aang anymore, saying he was no longer welcome as his student, before leaving."
    },
    {
      "body": "The next day at the palace, Katara pleaded with ${link_0} ${link_1} to have Master Pakku take Aang back as his student. Master Pakku agreed to continue training Aang on the condition that Katara swallow her pride and apologize. Katara, angered by his pomposity and condescending attitude, challenged him to a fight instead of apologizing, gesturing emphatically as she did so and unintentionally waterbending huge cracks in the ice floor and smashing two pots.",
      "links": [
        {
          "body": "Chief",
          "key": "${link_0}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Arnook",
          "key": "${link_1}",
          "target": {
            "href": "Arnook",
            "page": "Arnook"
          }
        }
      ],
      "text": "The next day at the palace, Katara pleaded with Chief Arnook to have Master Pakku take Aang back as his student. Master Pakku agreed to continue training Aang on the condition that Katara swallow her pride and apologize. Katara, angered by his pomposity and condescending attitude, challenged him to a fight instead of apologizing, gesturing emphatically as she did so and unintentionally waterbending huge cracks in the ice floor and smashing two pots."
    },
    {
      "body": "Katara went outside to wait for Master Pakku, who simply strolled past her, further angering her with patronizing comments. Katara, temper pushed to the breaking point, formed a water whip and slapped Master Pakku on the back of the head. He turned around and agreed to the fight, telling her if she wanted to learn so badly, she should study closely. The fight began and it was discovered that Katara was much more advanced in waterbending than previously known. She demonstrated amazingly powerful techniques she never used before during the fight. The two were able to manipulate the water and snow around them amazingly, using basic and advanced waterbending techniques. Master Pakku grinned and smirked as he attacked, but when Katara launched discs of ice at him, he appeared to realize how skilled she was as a waterbender. After a few moments of violent waterbending, it seemed Katara had the upper-hand, as she toppled ice-obelisks over Master Pakku, who disappeared in a cloud of mist, but Master Pakku quickly emerged and performed a waterbending move that rendered Katara helpless, and she was beaten. Her grandmother's necklace, which fell off during the fight, was picked up by Master Pakku and it was discovered that he made it for ${link_0}, Katara's grandmother, sixty years prior.",
      "links": [
        {
          "body": "Kanna",
          "key": "${link_0}",
          "target": {
            "href": "Kanna",
            "page": "Kanna"
          }
        }
      ],
      "text": "Katara went outside to wait for Master Pakku, who simply strolled past her, further angering her with patronizing comments. Katara, temper pushed to the breaking point, formed a water whip and slapped Master Pakku on the back of the head. He turned around and agreed to the fight, telling her if she wanted to learn so badly, she should study closely. The fight began and it was discovered that Katara was much more advanced in waterbending than previously known. She demonstrated amazingly powerful techniques she never used before during the fight. The two were able to manipulate the water and snow around them amazingly, using basic and advanced waterbending techniques. Master Pakku grinned and smirked as he attacked, but when Katara launched discs of ice at him, he appeared to realize how skilled she was as a waterbender. After a few moments of violent waterbending, it seemed Katara had the upper-hand, as she toppled ice-obelisks over Master Pakku, who disappeared in a cloud of mist, but Master Pakku quickly emerged and performed a waterbending move that rendered Katara helpless, and she was beaten. Her grandmother's necklace, which fell off during the fight, was picked up by Master Pakku and it was discovered that he made it for Kanna, Katara's grandmother, sixty years prior."
    },
    {
      "body": "Master Pakku told Katara that her grandmother left the arranged marriage to begin her life in the South Pole. Katara understood that she refused to let her tribe's customs rule her life. In the end, although the waterbending master had not changed his rather harsh methods of teaching, he had taken both Katara and Aang as students.",
      "links": [],
      "text": "Master Pakku told Katara that her grandmother left the arranged marriage to begin her life in the South Pole. Katara understood that she refused to let her tribe's customs rule her life. In the end, although the waterbending master had not changed his rather harsh methods of teaching, he had taken both Katara and Aang as students."
    },
    {
      "body": "Zhao began to launch ${link_0} against the Northern Water Tribe. Under the tutelage of Master Pakku, Katara's waterbending skills improved to the extent that she could defeat all of his pupils with ease. To both Pakku and Katara's annoyance, the same could not be said for Aang, who idly played with Momo during training. Meanwhile, Sokka took ${link_1} ${link_2} for a ride on Appa, during which they noticed soot beginning to fall from the sky, an ominous signal of the Fire Nation's approach.",
      "links": [
        {
          "body": "his attack",
          "key": "${link_0}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        },
        {
          "body": "Princess",
          "key": "${link_1}",
          "target": {
            "href": "Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_2}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        }
      ],
      "text": "Zhao began to launch his attack against the Northern Water Tribe. Under the tutelage of Master Pakku, Katara's waterbending skills improved to the extent that she could defeat all of his pupils with ease. To both Pakku and Katara's annoyance, the same could not be said for Aang, who idly played with Momo during training. Meanwhile, Sokka took Princess Yue for a ride on Appa, during which they noticed soot beginning to fall from the sky, an ominous signal of the Fire Nation's approach."
    },
    {
      "body": "The Northern Water Tribe prepared to defend itself from invasion, and Sokka volunteered for a dangerous mission in which several ${link_0} would be forced to infiltrate the Fire Nation fleet. As the walls of the prestigious city began to fall, Aang felt duty bound to prevent the same fate that befell the Air Nomads and the Southern Water Tribe. Riding out to the fleet on Appa, he managed to successfully overtake several battleships. As dusk approached, however, he came to the realization that his efforts hardly thwarted the Fire Nation's advance and he retreated in despair.",
      "links": [
        {
          "body": "warriors",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        }
      ],
      "text": "The Northern Water Tribe prepared to defend itself from invasion, and Sokka volunteered for a dangerous mission in which several warriors would be forced to infiltrate the Fire Nation fleet. As the walls of the prestigious city began to fall, Aang felt duty bound to prevent the same fate that befell the Air Nomads and the Southern Water Tribe. Riding out to the fleet on Appa, he managed to successfully overtake several battleships. As dusk approached, however, he came to the realization that his efforts hardly thwarted the Fire Nation's advance and he retreated in despair."
    },
    {
      "body": "${link_0} was captured by ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Aang was captured by Zuko."
    },
    {
      "body": "That night, Princess Yue related the origins of the Water Tribe and its power, leading Aang to realize that if he could enter the ${link_0} and meet with the ${link_1} and ${link_2} Spirits, perhaps they could help him defeat the Fire Nation. Yue took Katara and Aang to a ${link_3} which was the spiritual center of the North Pole. After observing the two koi fish in the oasis, which resembled yin and yang, Aang entered a trance and crossed over into the Spirit World. Katara stood watch over Aang's body, but was caught by surprise with Zuko's sudden appearance. With the enhanced power of the moon, Katara was able to temporarily defeat Zuko in the ensuing duel. However, the sun's subsequent rising enhanced Zuko's power, allowing him to ultimately defeat Katara, leaving her unconscious. He kidnapped the Avatar, escaping to the icy tundra.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Moon",
          "key": "${link_1}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Ocean",
          "key": "${link_2}",
          "target": {
            "href": "La",
            "page": "La"
          }
        },
        {
          "body": "hidden oasis",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        }
      ],
      "text": "That night, Princess Yue related the origins of the Water Tribe and its power, leading Aang to realize that if he could enter the Spirit World and meet with the Moon and Ocean Spirits, perhaps they could help him defeat the Fire Nation. Yue took Katara and Aang to a hidden oasis which was the spiritual center of the North Pole. After observing the two koi fish in the oasis, which resembled yin and yang, Aang entered a trance and crossed over into the Spirit World. Katara stood watch over Aang's body, but was caught by surprise with Zuko's sudden appearance. With the enhanced power of the moon, Katara was able to temporarily defeat Zuko in the ensuing duel. However, the sun's subsequent rising enhanced Zuko's power, allowing him to ultimately defeat Katara, leaving her unconscious. He kidnapped the Avatar, escaping to the icy tundra."
    },
    {
      "body": "Meanwhile, Zhao's forces broke through the outer wall of the Northern Water Tribe's defenses. The admiral revealed a sinister plan to kill the mortal manifestation of the Moon Spirit in order to destroy the moon and severely weaken the Water Tribe.",
      "links": [],
      "text": "Meanwhile, Zhao's forces broke through the outer wall of the Northern Water Tribe's defenses. The admiral revealed a sinister plan to kill the mortal manifestation of the Moon Spirit in order to destroy the moon and severely weaken the Water Tribe."
    },
    {
      "body": "${link_0} talked to ${link_1} in the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Koh",
          "key": "${link_1}",
          "target": {
            "href": "Koh",
            "page": "Koh"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Aang talked to Koh in the Spirit World."
    },
    {
      "body": "In the Spirit World, Aang hurriedly sought out the Moon and Ocean Spirits, receiving only minimal guidance from a begrudging ${link_0} who urged him to chase a nearby firefly. Although this proved unsuccessful in locating the spirits, Aang did come in contact with Avatar Roku, who instructed him to see ${link_1}, one of the oldest spirits in existence. Before parting, Roku warned Aang to show no emotion while speaking with Koh, as the spirit would otherwise steal his face. Aang eventually arrived at ${link_2} where he questioned the spirit and learned that the white and black koi he had seen swimming in the oasis were the Moon and Ocean Spirits, ${link_3} and ${link_4} respectively. He returned to the physical world with the help of ${link_5} and escaped from Zuko due to the timely arrival of Katara, Sokka, and Princess Yue on Appa. Zuko and Katara briefly dueled again wherein Katara easily defeated him due to the enhancing power of the full moon. The team subsequently took off for the Spirit Oasis, but not before a sympathetic Aang brought the unconscious Zuko with them.",
      "links": [
        {
          "body": "baboon spirit",
          "key": "${link_0}",
          "target": {
            "href": "Baboon_spirit",
            "page": "Baboon_spirit"
          }
        },
        {
          "body": "Koh",
          "key": "${link_1}",
          "target": {
            "href": "Koh",
            "page": "Koh"
          }
        },
        {
          "body": "Koh's lair",
          "key": "${link_2}",
          "target": {
            "href": "Realm_of_Koh",
            "page": "Realm_of_Koh"
          }
        },
        {
          "body": "Tui",
          "key": "${link_3}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "La",
          "key": "${link_4}",
          "target": {
            "href": "La",
            "page": "La"
          }
        },
        {
          "body": "Hei Bai",
          "key": "${link_5}",
          "target": {
            "href": "Hei_Bai",
            "page": "Hei_Bai"
          }
        }
      ],
      "text": "In the Spirit World, Aang hurriedly sought out the Moon and Ocean Spirits, receiving only minimal guidance from a begrudging baboon spirit who urged him to chase a nearby firefly. Although this proved unsuccessful in locating the spirits, Aang did come in contact with Avatar Roku, who instructed him to see Koh, one of the oldest spirits in existence. Before parting, Roku warned Aang to show no emotion while speaking with Koh, as the spirit would otherwise steal his face. Aang eventually arrived at Koh's lair where he questioned the spirit and learned that the white and black koi he had seen swimming in the oasis were the Moon and Ocean Spirits, Tui and La respectively. He returned to the physical world with the help of Hei Bai and escaped from Zuko due to the timely arrival of Katara, Sokka, and Princess Yue on Appa. Zuko and Katara briefly dueled again wherein Katara easily defeated him due to the enhancing power of the full moon. The team subsequently took off for the Spirit Oasis, but not before a sympathetic Aang brought the unconscious Zuko with them."
    },
    {
      "body": "${link_0}, merged with the ${link_1}, drove off the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Ocean Spirit",
          "key": "${link_1}",
          "target": {
            "href": "La",
            "page": "La"
          }
        },
        {
          "body": "Fire Nation Navy",
          "key": "${link_2}",
          "target": {
            "href": "Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        }
      ],
      "text": "Aang, merged with the Ocean Spirit, drove off the Fire Nation Navy."
    },
    {
      "body": "When Aang and the rest returned to the oasis, Zhao had already captured the Moon Spirit, Tui, which caused the moon to glow red, created a lunar eclipse, and stripped waterbenders of their bending abilities. Aang pleaded with Zhao to spare the spirit upon realizing his murderous intentions; he was supported by Iroh, who threatened action against the admiral if he harmed the spirit. Zhao initially complied, releasing the koi into the oasis. In a sudden act of rage, however, he firebent at the koi, killing it. The moon vanished from the sky altogether and color seeped from the world. Iroh immediately retaliated, overpowering Zhao's henchmen, but Zhao himself was able to flee the scene. Although the situation appeared hopeless, Aang suddenly entered the Avatar State and fused with the Ocean Spirit into a giant, water-based creature. The merged figures subsequently massacred the Fire Nation troops and annihilated the fleet, forcing a hasty retreat of the enemy. Meanwhile, Yue, who had been imbued with life by the Moon Spirit as an infant, sacrificed herself to revive Tui and restore the moon's power; she thus became the new Moon Spirit. With the moon reinstated, Aang exited the Avatar State and was returned safely to the city by La.",
      "links": [],
      "text": "When Aang and the rest returned to the oasis, Zhao had already captured the Moon Spirit, Tui, which caused the moon to glow red, created a lunar eclipse, and stripped waterbenders of their bending abilities. Aang pleaded with Zhao to spare the spirit upon realizing his murderous intentions; he was supported by Iroh, who threatened action against the admiral if he harmed the spirit. Zhao initially complied, releasing the koi into the oasis. In a sudden act of rage, however, he firebent at the koi, killing it. The moon vanished from the sky altogether and color seeped from the world. Iroh immediately retaliated, overpowering Zhao's henchmen, but Zhao himself was able to flee the scene. Although the situation appeared hopeless, Aang suddenly entered the Avatar State and fused with the Ocean Spirit into a giant, water-based creature. The merged figures subsequently massacred the Fire Nation troops and annihilated the fleet, forcing a hasty retreat of the enemy. Meanwhile, Yue, who had been imbued with life by the Moon Spirit as an infant, sacrificed herself to revive Tui and restore the moon's power; she thus became the new Moon Spirit. With the moon reinstated, Aang exited the Avatar State and was returned safely to the city by La."
    },
    {
      "body": "After the battle, Pakku revealed to Katara his intention to head for the South Pole and help rebuild the tribe. He assigned Katara as Aang's new waterbending teacher.",
      "links": [],
      "text": "After the battle, Pakku revealed to Katara his intention to head for the South Pole and help rebuild the tribe. He assigned Katara as Aang's new waterbending teacher."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Aang_(12_BG_-_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Aang_(12_BG_-_100_AG).html",
    "page": "History_of_Aang_(12_BG_-_100_AG)",
    "title": "History of Aang (12 BG – 100 AG)"
  }
}