{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Zuko",
      "target": {
        "href": "Category_Zuko",
        "page": "Category_Zuko"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} returned home to the ${link_1} after the Fire Nation's spectacular victory at ${link_2}. Despite winning ${link_3}'s praise, however, Zuko found no consolation at this prospect. After a great deal of emotional turbulence, Zuko finally abandoned the Fire Nation and joined ${link_4}'s quest to defeat the ${link_5}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_2}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "his father",
          "key": "${link_3}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "the Avatar",
          "key": "${link_4}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_5}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "text": "Zuko returned home to the Fire Nation after the Fire Nation's spectacular victory at Ba Sing Se. Despite winning his father's praise, however, Zuko found no consolation at this prospect. After a great deal of emotional turbulence, Zuko finally abandoned the Fire Nation and joined the Avatar's quest to defeat the Fire Lord."
    },
    {
      "body": "${link_0} angrily ${link_1} at two guards.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Zuko angrily firebending at two guards."
    },
    {
      "body": "After this, Zuko was surprisingly reluctant to return to the Fire Nation as a hero. However, after informing his sister of his intention to remain in Ba Sing Se, the princess pulled out a trump card in the form of an old friend—${link_0}, who had shared a mutual crush with Zuko as a child. After foiling Azula's dinner date set up, Zuko accompanied the governor's daughter on a stroll throughout the city, where —after an incident involving ${link_1}, octofish, and a fountain— the two ended up kissing and reminiscing. The following day, as he saw Mai off during the boardings, Zuko severely contemplated returning home with her, watched on by Azula. The princess turned her attention to ${link_2} being led aboard a Fire Nation ship in chains and wondered aloud if he will even survive the trip. As she bid her brother farewell, Zuko suddenly made the resolve to come with them back to the Fire Nation. Azula slyly told her brother to do whatever he wanted, as it is his decision.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Jin",
          "key": "${link_1}",
          "target": {
            "href": "Jin",
            "page": "Jin"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_2}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "After this, Zuko was surprisingly reluctant to return to the Fire Nation as a hero. However, after informing his sister of his intention to remain in Ba Sing Se, the princess pulled out a trump card in the form of an old friend—Mai, who had shared a mutual crush with Zuko as a child. After foiling Azula's dinner date set up, Zuko accompanied the governor's daughter on a stroll throughout the city, where —after an incident involving Jin, octofish, and a fountain— the two ended up kissing and reminiscing. The following day, as he saw Mai off during the boardings, Zuko severely contemplated returning home with her, watched on by Azula. The princess turned her attention to Iroh being led aboard a Fire Nation ship in chains and wondered aloud if he will even survive the trip. As she bid her brother farewell, Zuko suddenly made the resolve to come with them back to the Fire Nation. Azula slyly told her brother to do whatever he wanted, as it is his decision."
    },
    {
      "body": "${link_0} ${link_1} welcoming ${link_2} after his three year long banishment.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_1}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_2}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Fire Lord Ozai welcoming Zuko after his three year long banishment."
    },
    {
      "body": "Several weeks later, though, as the ship approached Fire Nation waters, Zuko expressed his fear at how much everything had changed, and how much he himself had changed. Despite reassurances from Mai and deafening cheers from the citizens of the Fire Nation, Zuko was still uncertain as to how his father would receive him, and even doubtful as to whether or not the Avatar was truly dead, a feeling he consequentially expressed to his sister. When he finally returned to his father's throne room, however, his father welcomed him back with pride and recognition, claiming that Zuko had fully redeemed himself by slaying the Avatar. Zuko managed to contain his surprise at this, knowing fully well that it had been Azula who had delivered the blow, not him.",
      "links": [],
      "text": "Several weeks later, though, as the ship approached Fire Nation waters, Zuko expressed his fear at how much everything had changed, and how much he himself had changed. Despite reassurances from Mai and deafening cheers from the citizens of the Fire Nation, Zuko was still uncertain as to how his father would receive him, and even doubtful as to whether or not the Avatar was truly dead, a feeling he consequentially expressed to his sister. When he finally returned to his father's throne room, however, his father welcomed him back with pride and recognition, claiming that Zuko had fully redeemed himself by slaying the Avatar. Zuko managed to contain his surprise at this, knowing fully well that it had been Azula who had delivered the blow, not him."
    },
    {
      "body": "Although the false claim finally gave him the redemption he had so longed for, Zuko confronted his sister that night about why she had given him the credit. Azula claimed that she saw how worried Zuko was about not having the Avatar, she decided to give him the credit for his demise out of a generous gesture to repay his part in the takeover of Ba Sing Se. Zuko refused to believe her explanation, accusing her of retaining an ulterior motive. Azula nonchalantly pointed out how letting him have all the glory over slaying the Avatar could do little to benefit her, but went on to insidiously acknowledge the fact that should it be discovered that the Avatar was alive, all that glory would swiftly turn into shame and foolishness. She assured Zuko that he had nothing to worry about, as he had already said himself, there was no way the Avatar could have survived. With that, the princess bid her brother goodnight, who left deeply incensed. Even with his redemption, he was still being manipulated.",
      "links": [],
      "text": "Although the false claim finally gave him the redemption he had so longed for, Zuko confronted his sister that night about why she had given him the credit. Azula claimed that she saw how worried Zuko was about not having the Avatar, she decided to give him the credit for his demise out of a generous gesture to repay his part in the takeover of Ba Sing Se. Zuko refused to believe her explanation, accusing her of retaining an ulterior motive. Azula nonchalantly pointed out how letting him have all the glory over slaying the Avatar could do little to benefit her, but went on to insidiously acknowledge the fact that should it be discovered that the Avatar was alive, all that glory would swiftly turn into shame and foolishness. She assured Zuko that he had nothing to worry about, as he had already said himself, there was no way the Avatar could have survived. With that, the princess bid her brother goodnight, who left deeply incensed. Even with his redemption, he was still being manipulated."
    },
    {
      "body": "${link_0} and ${link_1} sharing a kiss.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Mai",
          "key": "${link_1}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        }
      ],
      "text": "Zuko and Mai sharing a kiss."
    },
    {
      "body": "Zuko had been secretly seeing his imprisoned uncle, telling the guard to say nothing. However, Iroh would have none of him and refused to listen to Zuko's claims he could have returned a hero. He promptly called Iroh a crazy old man. While on a picnic with Mai, they were interrupted by Azula who cautioned Zuko not to be discovered visiting Uncle or people will think he was conspiring with him. After delivering a box of chicken to his uncle, Zuko said to his uncle that he had everything he had ever wanted, but was tortured knowing that the ${link_0} was still alive; Iroh refused to advise his nephew. Zuko later met with a ${link_1} who he hired and instructed to kill the Avatar.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "person who had a tattoo of a third eye",
          "key": "${link_1}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        }
      ],
      "text": "Zuko had been secretly seeing his imprisoned uncle, telling the guard to say nothing. However, Iroh would have none of him and refused to listen to Zuko's claims he could have returned a hero. He promptly called Iroh a crazy old man. While on a picnic with Mai, they were interrupted by Azula who cautioned Zuko not to be discovered visiting Uncle or people will think he was conspiring with him. After delivering a box of chicken to his uncle, Zuko said to his uncle that he had everything he had ever wanted, but was tortured knowing that the Avatar was still alive; Iroh refused to advise his nephew. Zuko later met with a person who had a tattoo of a third eye who he hired and instructed to kill the Avatar."
    },
    {
      "body": "Zuko, Azula, Mai, and Ty Lee went on vacation to ${link_0} at ${link_1}'s beach house, due to the fact Fire Lord Ozai was holding a restricted meeting with his confidants. At the beach, Zuko made several unsuccessful attempts to impress Mai with pretty shells and ice cream; the former failed to appeal to her, and the latter fell on Mai's leg in the unlucky fashion Zuko was famous for. Later, the group was invited to a party at ${link_2}'s house.",
      "links": [
        {
          "body": "Ember Island",
          "key": "${link_0}",
          "target": {
            "href": "Ember_Island",
            "page": "Ember_Island"
          }
        },
        {
          "body": "Lo and Li",
          "key": "${link_1}",
          "target": {
            "href": "Lo_and_Li",
            "page": "Lo_and_Li"
          }
        },
        {
          "body": "Chan",
          "key": "${link_2}",
          "target": {
            "href": "Chan",
            "page": "Chan"
          }
        }
      ],
      "text": "Zuko, Azula, Mai, and Ty Lee went on vacation to Ember Island at Lo and Li's beach house, due to the fact Fire Lord Ozai was holding a restricted meeting with his confidants. At the beach, Zuko made several unsuccessful attempts to impress Mai with pretty shells and ice cream; the former failed to appeal to her, and the latter fell on Mai's leg in the unlucky fashion Zuko was famous for. Later, the group was invited to a party at Chan's house."
    },
    {
      "body": "During the party, after fetching Mai some food, Zuko found ${link_0} talking to Mai. Zuko lost his temper and violently threw Ruon-Jian into a large pot across the room. Disgusted, Mai angrily told Zuko that his temper was out of control; he took his anger out on her, saying that she did not feel anything and was a \"big blah\". Hurt and confused by this accusation, Mai told Zuko that their relationship was over. Chan returned and ejected Zuko from the party.",
      "links": [
        {
          "body": "Ruon-Jian",
          "key": "${link_0}",
          "target": {
            "href": "Ruon-Jian",
            "page": "Ruon-Jian"
          }
        }
      ],
      "text": "During the party, after fetching Mai some food, Zuko found Ruon-Jian talking to Mai. Zuko lost his temper and violently threw Ruon-Jian into a large pot across the room. Disgusted, Mai angrily told Zuko that his temper was out of control; he took his anger out on her, saying that she did not feel anything and was a \"big blah\". Hurt and confused by this accusation, Mai told Zuko that their relationship was over. Chan returned and ejected Zuko from the party."
    },
    {
      "body": "${link_0} and ${link_1} on the beach.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Mai",
          "key": "${link_1}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        }
      ],
      "text": "Zuko and Mai on the beach."
    },
    {
      "body": "Zuko headed off and went to his family's abandoned vacation house where he reminisced about memories of himself as a child with his Mother, Father, and Uncle. He spotted a stone imprinted with his own baby hand print, only for his eyes to be drawn to an old family portrait hanging on the wall. Azula found Zuko, and they all went down to the beach again. Zuko tried to reconcile with Mai, but she was still cold toward him.",
      "links": [],
      "text": "Zuko headed off and went to his family's abandoned vacation house where he reminisced about memories of himself as a child with his Mother, Father, and Uncle. He spotted a stone imprinted with his own baby hand print, only for his eyes to be drawn to an old family portrait hanging on the wall. Azula found Zuko, and they all went down to the beach again. Zuko tried to reconcile with Mai, but she was still cold toward him."
    },
    {
      "body": "When words started to fly, Zuko pushed into a rant about his own life, where he admitted that he was angry but unsure why. The girls all pressured him into giving an answer, and he finally screamed that he was angry at himself because he did not know the difference between right and wrong anymore. Finally understanding what bothers Zuko so much, Mai returned to his side and said that there was one thing she cared about and kissed him once again.",
      "links": [],
      "text": "When words started to fly, Zuko pushed into a rant about his own life, where he admitted that he was angry but unsure why. The girls all pressured him into giving an answer, and he finally screamed that he was angry at himself because he did not know the difference between right and wrong anymore. Finally understanding what bothers Zuko so much, Mai returned to his side and said that there was one thing she cared about and kissed him once again."
    },
    {
      "body": "Later that weekend, the couple went on a date to the Ember Island Arcade. After winning a stuffed ${link_0} toy that Mai did not really want, Zuko got dragged into a game of \"${link_1}\" with Azula. Initially Azula, having been defeating children at the game for several days, managed to dominate her brother, but when Zuko started to get the hang of it, Azula used her firebending to secretly enhance her figure's attacks. In a fit of rage, Zuko attempted the same trick, but ended up destroying the machine. Afterward, Ty Lee remarked that they should make a rule about letting Zuko play.",
      "links": [
        {
          "body": "tiger monkey",
          "key": "${link_0}",
          "target": {
            "href": "Tiger_monkey",
            "page": "Tiger_monkey"
          }
        },
        {
          "body": "Street Bender",
          "key": "${link_1}",
          "target": {
            "href": "Recreation_in_the_World_of_Avatar#Street_Bender",
            "page": "Recreation_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Later that weekend, the couple went on a date to the Ember Island Arcade. After winning a stuffed tiger monkey toy that Mai did not really want, Zuko got dragged into a game of \"Street Bender\" with Azula. Initially Azula, having been defeating children at the game for several days, managed to dominate her brother, but when Zuko started to get the hang of it, Azula used her firebending to secretly enhance her figure's attacks. In a fit of rage, Zuko attempted the same trick, but ended up destroying the machine. Afterward, Ty Lee remarked that they should make a rule about letting Zuko play."
    },
    {
      "body": "Zuko awoke and found a ${link_0} telling him that he needed to learn the story of his great grandfather's demise, it would help reveal his own destiny. He quizzed Azula but she said that Sozin died in his sleep. Zuko puzzled over the message until he finally threw it over his lamp revealing a secret message written on the other side, telling him that the Fire Sages kept the Secret History in the ${link_1}. He found the place by secretly following one of the Fire Sages. After entering he discovered the Final Testament of Fire Lord Sozin.",
      "links": [
        {
          "body": "message",
          "key": "${link_0}",
          "target": {
            "href": "Scroll",
            "page": "Scroll"
          }
        },
        {
          "body": "Dragonbone Catacombs",
          "key": "${link_1}",
          "target": {
            "href": "Dragonbone_Catacombs",
            "page": "Dragonbone_Catacombs"
          }
        }
      ],
      "text": "Zuko awoke and found a message telling him that he needed to learn the story of his great grandfather's demise, it would help reveal his own destiny. He quizzed Azula but she said that Sozin died in his sleep. Zuko puzzled over the message until he finally threw it over his lamp revealing a secret message written on the other side, telling him that the Fire Sages kept the Secret History in the Dragonbone Catacombs. He found the place by secretly following one of the Fire Sages. After entering he discovered the Final Testament of Fire Lord Sozin."
    },
    {
      "body": "${link_0} receiving the ${link_1} from ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Crown Prince headpiece",
          "key": "${link_1}",
          "target": {
            "href": "Crown_Prince_headpiece",
            "page": "Crown_Prince_headpiece"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_2}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Zuko receiving the Crown Prince headpiece from Iroh."
    },
    {
      "body": "Zuko read up on the past friendship of ${link_0} ${link_1} and Fire Lord ${link_2}. At the end Sozin said he kept searching for the new Avatar. Zuko confronted Iroh in prison, outraged, and accusing Iroh of sending him messages telling him that the scroll told him little more than what he already knew. Zuko said he had learned nothing more of Sozin's death. Iroh calmly stated that he was referring to his mother's grandfather, Avatar Roku. Zuko fell to his knees, more confused than ever. Iroh told Zuko good and evil were always fighting inside Zuko for it was his nature. Iroh said that the bright side was that Zuko alone could restore honor to the Fire Nation and bring about peace. Iroh subsequently handed Zuko a ${link_3} meant to be worn by the crown prince that was worn by both of his great-grandfathers and told him he could choose either of their paths and restore balance to the world or destroy it.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Roku",
          "key": "${link_1}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_2}",
          "target": {
            "href": "Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "lost royal artifact",
          "key": "${link_3}",
          "target": {
            "href": "Crown_Prince_headpiece",
            "page": "Crown_Prince_headpiece"
          }
        }
      ],
      "text": "Zuko read up on the past friendship of Avatar Roku and Fire Lord Sozin. At the end Sozin said he kept searching for the new Avatar. Zuko confronted Iroh in prison, outraged, and accusing Iroh of sending him messages telling him that the scroll told him little more than what he already knew. Zuko said he had learned nothing more of Sozin's death. Iroh calmly stated that he was referring to his mother's grandfather, Avatar Roku. Zuko fell to his knees, more confused than ever. Iroh told Zuko good and evil were always fighting inside Zuko for it was his nature. Iroh said that the bright side was that Zuko alone could restore honor to the Fire Nation and bring about peace. Iroh subsequently handed Zuko a lost royal artifact meant to be worn by the crown prince that was worn by both of his great-grandfathers and told him he could choose either of their paths and restore balance to the world or destroy it."
    },
    {
      "body": "Zuko eventually recovered from the initial shock of his family revelation, and in the following weeks was thoroughly enjoying life as an honored prince. He had servants attending to his every need and the population adored him, and had romantic evenings with Mai. A few days before the ${link_0}, he visited Mai's house, which was right across from the Royal Palace. The two were happier than ever as Mai was now much more open with her emotions. When Zuko asked if Mai could have anything she wanted in the world at that moment what it would be, he discovered her love for fruit tarts and with his servants was able to answer to such desires.",
      "links": [
        {
          "body": "Day of Black Sun",
          "key": "${link_0}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        }
      ],
      "text": "Zuko eventually recovered from the initial shock of his family revelation, and in the following weeks was thoroughly enjoying life as an honored prince. He had servants attending to his every need and the population adored him, and had romantic evenings with Mai. A few days before the Day of Black Sun, he visited Mai's house, which was right across from the Royal Palace. The two were happier than ever as Mai was now much more open with her emotions. When Zuko asked if Mai could have anything she wanted in the world at that moment what it would be, he discovered her love for fruit tarts and with his servants was able to answer to such desires."
    },
    {
      "body": "Suddenly, Mai mentioned that Azula got invited to a war meeting with their father and apparently Zuko did not get invited. He talked to Azula who assured him that he was not told about the war meeting because he was already expected to be there. However, the fact that he, the Crown Prince was not informed as opposed to the Crown Princess insulted him, so he refused to go. When he sulked about it, Mai suggested he order some servants around or enjoy a fruit tart, but Zuko was not in the mood.",
      "links": [],
      "text": "Suddenly, Mai mentioned that Azula got invited to a war meeting with their father and apparently Zuko did not get invited. He talked to Azula who assured him that he was not told about the war meeting because he was already expected to be there. However, the fact that he, the Crown Prince was not informed as opposed to the Crown Princess insulted him, so he refused to go. When he sulked about it, Mai suggested he order some servants around or enjoy a fruit tart, but Zuko was not in the mood."
    },
    {
      "body": "However, the next morning, Zuko did go to the war meeting when he found out that his father refused to start with him absent, setting his mind at ease. When it ended, he told Mai that his father let him sit at his right side, much to Mai's delight. However, Zuko also confided in her that although he acted like the son his father wanted, he was not himself. This made Zuko realize that he could not be the son that his father wanted him to be, and that the war must come to end.",
      "links": [],
      "text": "However, the next morning, Zuko did go to the war meeting when he found out that his father refused to start with him absent, setting his mind at ease. When it ended, he told Mai that his father let him sit at his right side, much to Mai's delight. However, Zuko also confided in her that although he acted like the son his father wanted, he was not himself. This made Zuko realize that he could not be the son that his father wanted him to be, and that the war must come to end."
    },
    {
      "body": "Before the ${link_0}, he gazed at a drawing of him and Mai, saying \"I'm sorry.\" During the ${link_1}, he entered his father's chamber with his ${link_2}. First, he told his father that \"it was Azula who took down the Avatar, not me.\" When Zuko told him that Azula's reason for lying was that the Avatar had survived, Ozai was furious. Zuko spouted his rage at the Fire Lord, explaining his internal conflicts throughout the series. Zuko said that he was never there during his childhood and argued that his father was cruel to challenge a thirteen year old to an Agni Kai and caused permanent damage to him for only the crime of speaking out of turn at a war meeting. Having had a first hand look at the destruction the Fire Nation had caused, Zuko spoke his mind about it and said it was not the \"spreading of greatness\" the country had lied about to its citizens. He turned to \"join the Avatar\" and nearly left the ${link_3} when his father asked, \"Don't you want to know what happened to your mother?\"",
      "links": [
        {
          "body": "battle on the Day of Black Sun",
          "key": "${link_0}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        },
        {
          "body": "eclipse",
          "key": "${link_1}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "dual broadswords",
          "key": "${link_2}",
          "target": {
            "href": "Dual_broadswords",
            "page": "Dual_broadswords"
          }
        },
        {
          "body": "bunker",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation_Capital#Fire_Lord.27s_Bunker",
            "page": "Fire_Nation_Capital"
          }
        }
      ],
      "text": "Before the battle on the Day of Black Sun, he gazed at a drawing of him and Mai, saying \"I'm sorry.\" During the eclipse, he entered his father's chamber with his dual broadswords. First, he told his father that \"it was Azula who took down the Avatar, not me.\" When Zuko told him that Azula's reason for lying was that the Avatar had survived, Ozai was furious. Zuko spouted his rage at the Fire Lord, explaining his internal conflicts throughout the series. Zuko said that he was never there during his childhood and argued that his father was cruel to challenge a thirteen year old to an Agni Kai and caused permanent damage to him for only the crime of speaking out of turn at a war meeting. Having had a first hand look at the destruction the Fire Nation had caused, Zuko spoke his mind about it and said it was not the \"spreading of greatness\" the country had lied about to its citizens. He turned to \"join the Avatar\" and nearly left the bunker when his father asked, \"Don't you want to know what happened to your mother?\""
    },
    {
      "body": "Zuko absorbing ${link_0}'s ${link_1} in order to ${link_2} it.",
      "links": [
        {
          "body": "Ozai",
          "key": "${link_0}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "lightning",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "redirect",
          "key": "${link_2}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "text": "Zuko absorbing Ozai's lightning in order to redirect it."
    },
    {
      "body": "Lured by these words, Zuko turned to stay. Ozai explained that after requesting that Iroh's birthright be revoked and placed upon his head, Azulon told him that he would have to kill Zuko to suffer the same pain as Iroh. Ozai reveals he had every intention to do so, but that his wife stated a plan in which Zuko would live and Ozai would become Fire Lord. Her actions resulted in Azulon's death and her banishment. This left Zuko hopefully asking that she was still alive. Ozai stated it was possible, but that he had learned that banishment was far too merciful of a punishment for treason and that Zuko will receive no such mercy. Just as the eclipse ended, Ozai leaped from his seat and fired a massive lightning bolt at Zuko. He caught the blast, sliding back several feet, before redirecting the charge at a much-surprised Ozai. The impact slammed Ozai into the back wall, and gave Zuko time to escape. From there, he headed to the ${link_0}, finding most of the guards unconscious or otherwise incapacitated. Finding the ${link_1} who constantly insulted Iroh, he demanded to know what happened. The guard revealed that Iroh broke himself out, and was like a \"one-man army\". Zuko later followed ${link_2} in a ${link_3}, intent on joining them.",
      "links": [
        {
          "body": "prison",
          "key": "${link_0}",
          "target": {
            "href": "Capital_City_Prison",
            "page": "Capital_City_Prison"
          }
        },
        {
          "body": "warden",
          "key": "${link_1}",
          "target": {
            "href": "Poon",
            "page": "Poon"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "war balloon",
          "key": "${link_3}",
          "target": {
            "href": "Hot_air_balloon",
            "page": "Hot_air_balloon"
          }
        }
      ],
      "text": "Lured by these words, Zuko turned to stay. Ozai explained that after requesting that Iroh's birthright be revoked and placed upon his head, Azulon told him that he would have to kill Zuko to suffer the same pain as Iroh. Ozai reveals he had every intention to do so, but that his wife stated a plan in which Zuko would live and Ozai would become Fire Lord. Her actions resulted in Azulon's death and her banishment. This left Zuko hopefully asking that she was still alive. Ozai stated it was possible, but that he had learned that banishment was far too merciful of a punishment for treason and that Zuko will receive no such mercy. Just as the eclipse ended, Ozai leaped from his seat and fired a massive lightning bolt at Zuko. He caught the blast, sliding back several feet, before redirecting the charge at a much-surprised Ozai. The impact slammed Ozai into the back wall, and gave Zuko time to escape. From there, he headed to the prison, finding most of the guards unconscious or otherwise incapacitated. Finding the warden who constantly insulted Iroh, he demanded to know what happened. The guard revealed that Iroh broke himself out, and was like a \"one-man army\". Zuko later followed Team Avatar in a war balloon, intent on joining them."
    },
    {
      "body": "${link_0} requesting to join ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Zuko requesting to join Team Avatar."
    },
    {
      "body": "Zuko arrived at the ${link_0} before Aang and his friends. He ran away to hide when the gang arrived on ${link_1}. Later at his camp in the woods, he tried to practice a speech on how to persuade Team Avatar that he now was good and wanted to join their group; he did this in front of a badgerfrog with little success. Finally, Zuko returned to the temple and appeared before Aang, ${link_2}, ${link_3}, and ${link_4}. Upon his arrival, Appa licked him for remembering that Zuko set him free in Ba Sing Se, which surprised Aang. Zuko tried his speech, and offered to teach Aang ${link_5}, but the group was unwilling to let him due to their mistrust of him, especially Katara. Zuko began apologizing for the bad things he did to them, but accidentally let slip the fact that he sent Combustion Man after them. Enraged, the gang demanded that Zuko leave them now. Zuko instead offered to be accepted as their prisoner, but Katara waterbent at him and ordered him to leave. Zuko returned to his camp and berated himself for how bad his attempt at joining their group was, including voicing his regret for not having blamed Azula for hiring Combustion Man, as that would have been a believable statement.",
      "links": [
        {
          "body": "Western Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_3}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Toph",
          "key": "${link_4}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "firebending",
          "key": "${link_5}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Zuko arrived at the Western Air Temple before Aang and his friends. He ran away to hide when the gang arrived on Appa. Later at his camp in the woods, he tried to practice a speech on how to persuade Team Avatar that he now was good and wanted to join their group; he did this in front of a badgerfrog with little success. Finally, Zuko returned to the temple and appeared before Aang, Katara, Sokka, and Toph. Upon his arrival, Appa licked him for remembering that Zuko set him free in Ba Sing Se, which surprised Aang. Zuko tried his speech, and offered to teach Aang firebending, but the group was unwilling to let him due to their mistrust of him, especially Katara. Zuko began apologizing for the bad things he did to them, but accidentally let slip the fact that he sent Combustion Man after them. Enraged, the gang demanded that Zuko leave them now. Zuko instead offered to be accepted as their prisoner, but Katara waterbent at him and ordered him to leave. Zuko returned to his camp and berated himself for how bad his attempt at joining their group was, including voicing his regret for not having blamed Azula for hiring Combustion Man, as that would have been a believable statement."
    },
    {
      "body": "${link_0} blocking ${link_1}'s attack.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Combustion Man",
          "key": "${link_1}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        }
      ],
      "text": "Zuko blocking Combustion Man's attack."
    },
    {
      "body": "Later that night, Toph, sensing that Zuko was sincere, went to visit him. She made a noise that startled Zuko, causing him to act on instinct and firebend at the intruder, not knowing it was Toph. He burned her feet by accident, and when he tried to apologize and help her, Toph, despite knowing it was an accident, earthbent at him in panicked self-defense and retreated back to the temple. Thinking his act disillusioned Toph's beliefs of Zuko being sincere, Zuko collapsed to the ground and shouted in frustration: \"Why am I so bad at being good?!\"",
      "links": [],
      "text": "Later that night, Toph, sensing that Zuko was sincere, went to visit him. She made a noise that startled Zuko, causing him to act on instinct and firebend at the intruder, not knowing it was Toph. He burned her feet by accident, and when he tried to apologize and help her, Toph, despite knowing it was an accident, earthbent at him in panicked self-defense and retreated back to the temple. Thinking his act disillusioned Toph's beliefs of Zuko being sincere, Zuko collapsed to the ground and shouted in frustration: \"Why am I so bad at being good?!\""
    },
    {
      "body": "The next day, Combustion Man had tracked down Aang and the group to the temple. Zuko attacked Combustion Man with a flying kick, causing his attack to miss Aang and his friends. Zuko ordered him to stop hunting the Avatar, but Combustion Man ignored him and continued firing blasts at the temple. Zuko attempted to stop him with a fire punch, but was stopped when the assassin grabbed his shirt. The banished prince kicked him and was able to free himself. When he caused Combustion Man to misfire again, Combustion Man retaliated by shooting a blast at Zuko, who managed to shield himself with a fire wall, but the force of the blast pushed him off the edge. The firebender managed to grab a vine at the last moment. Aang and Katara attempted to bend at Combustion Man, but he easily withstood their attacks. Sokka however, used his boomerang to hit Combustion Man in his third eye tattoo, causing his next attack to backfire and prompt an explosion that sent him falling off the cliff.",
      "links": [],
      "text": "The next day, Combustion Man had tracked down Aang and the group to the temple. Zuko attacked Combustion Man with a flying kick, causing his attack to miss Aang and his friends. Zuko ordered him to stop hunting the Avatar, but Combustion Man ignored him and continued firing blasts at the temple. Zuko attempted to stop him with a fire punch, but was stopped when the assassin grabbed his shirt. The banished prince kicked him and was able to free himself. When he caused Combustion Man to misfire again, Combustion Man retaliated by shooting a blast at Zuko, who managed to shield himself with a fire wall, but the force of the blast pushed him off the edge. The firebender managed to grab a vine at the last moment. Aang and Katara attempted to bend at Combustion Man, but he easily withstood their attacks. Sokka however, used his boomerang to hit Combustion Man in his third eye tattoo, causing his next attack to backfire and prompt an explosion that sent him falling off the cliff."
    },
    {
      "body": "${link_0} warning ${link_1} not to hurt ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Katara warning Zuko not to hurt Aang."
    },
    {
      "body": "Zuko appeared to Team Avatar once more and apologized to them again, saying that he had been through a lot the past few years. He apologized to Toph for burning her, remarking that he had to be in better control of his bending, and that fire could be a dangerous thing if not controlled. Aang told Zuko that he thought Zuko was meant to be his teacher because he understood what Aang went through when he first tried to firebend and burned Katara by accident. Zuko asked one more time to join the group. Aang accepted and asked his friends if he could be allowed to join them. Toph agreed, saying jokingly that it would give her time to get back at Zuko for burning her. Sokka agreed, knowing that Aang knew what he was doing. Lastly, Katara allowed him, but only reluctantly. Zuko happily promised that he would not let them down. As soon as this happened, the rest of the gang turned around and headed into the temple.",
      "links": [],
      "text": "Zuko appeared to Team Avatar once more and apologized to them again, saying that he had been through a lot the past few years. He apologized to Toph for burning her, remarking that he had to be in better control of his bending, and that fire could be a dangerous thing if not controlled. Aang told Zuko that he thought Zuko was meant to be his teacher because he understood what Aang went through when he first tried to firebend and burned Katara by accident. Zuko asked one more time to join the group. Aang accepted and asked his friends if he could be allowed to join them. Toph agreed, saying jokingly that it would give her time to get back at Zuko for burning her. Sokka agreed, knowing that Aang knew what he was doing. Lastly, Katara allowed him, but only reluctantly. Zuko happily promised that he would not let them down. As soon as this happened, the rest of the gang turned around and headed into the temple."
    },
    {
      "body": "After Sokka showed Zuko to his room in the temple, he began to unpack his things. Katara appeared in his doorway. Just as Zuko began to show delight at her letting him join the team, she informed Zuko that even though the others accepted him, she still did not trust him and warned him.",
      "links": [],
      "text": "After Sokka showed Zuko to his room in the temple, he began to unpack his things. Katara appeared in his doorway. Just as Zuko began to show delight at her letting him join the team, she informed Zuko that even though the others accepted him, she still did not trust him and warned him."
    },
    {
      "body": "She promptly left Zuko to ponder her words.",
      "links": [],
      "text": "She promptly left Zuko to ponder her words."
    },
    {
      "body": "${link_0}'s weak ${link_1} without a drive.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Zuko's weak firebending without a drive."
    },
    {
      "body": "After joining the group, Zuko began to teach Aang firebending. After Aang showed him that he could not create fire, Zuko attempted to demonstrate, but was only able to produce weak and faint fire blasts. He theorized that he no longer had the anger he had to fuel his bending anymore because he switched sides.",
      "links": [],
      "text": "After joining the group, Zuko began to teach Aang firebending. After Aang showed him that he could not create fire, Zuko attempted to demonstrate, but was only able to produce weak and faint fire blasts. He theorized that he no longer had the anger he had to fuel his bending anymore because he switched sides."
    },
    {
      "body": "After Zuko informed the rest of the group about his loss of firebending, Sokka and Katara poked fun at him, the former by referring to firebending as \"jerkbending\" and the latter by calling it ironic since it \"would have been nice for [them] if [Zuko] lost [his] firebending a long time ago,\" but Toph had another idea. She suggested that Zuko and Aang learn from the original source of firebending. Zuko felt he was out of luck because firebending originated from the ${link_0}, which were extinct. He did inform them that there were ${link_1} of the ancient ${link_2} located near to the Western Air Temple, and that they might learn something there.",
      "links": [
        {
          "body": "dragons",
          "key": "${link_0}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        },
        {
          "body": "old ruins",
          "key": "${link_1}",
          "target": {
            "href": "Sun_Warriors%27_ancient_city",
            "page": "Sun_Warriors%27_ancient_city"
          }
        },
        {
          "body": "Sun Warrior civilization",
          "key": "${link_2}",
          "target": {
            "href": "Sun_Warriors",
            "page": "Sun_Warriors"
          }
        }
      ],
      "text": "After Zuko informed the rest of the group about his loss of firebending, Sokka and Katara poked fun at him, the former by referring to firebending as \"jerkbending\" and the latter by calling it ironic since it \"would have been nice for [them] if [Zuko] lost [his] firebending a long time ago,\" but Toph had another idea. She suggested that Zuko and Aang learn from the original source of firebending. Zuko felt he was out of luck because firebending originated from the dragons, which were extinct. He did inform them that there were old ruins of the ancient Sun Warrior civilization located near to the Western Air Temple, and that they might learn something there."
    },
    {
      "body": "After arriving at the ruins, Aang was almost caught in a ${link_0}. Zuko avoided it, saying that places with booby traps always have something worth protecting. While exploring, Zuko revealed that his great-grandfather Sozin began a tradition that if anyone hunted a dragon and killed it, their firebending would become legendary, and be granted the title of \"Dragon\". This action lead the Fire Nation to exterminate the dragons. Zuko's uncle conquered the last dragon, possibly giving him the name \"The Dragon of the West\", as well as his ability to breathe fire as he demonstrated to Azula. Sozin also started the belief that firebending originated from anger and rage and could only be used for destruction.",
      "links": [
        {
          "body": "booby trap",
          "key": "${link_0}",
          "target": {
            "href": "Booby_trap",
            "page": "Booby_trap"
          }
        }
      ],
      "text": "After arriving at the ruins, Aang was almost caught in a booby trap. Zuko avoided it, saying that places with booby traps always have something worth protecting. While exploring, Zuko revealed that his great-grandfather Sozin began a tradition that if anyone hunted a dragon and killed it, their firebending would become legendary, and be granted the title of \"Dragon\". This action lead the Fire Nation to exterminate the dragons. Zuko's uncle conquered the last dragon, possibly giving him the name \"The Dragon of the West\", as well as his ability to breathe fire as he demonstrated to Azula. Sozin also started the belief that firebending originated from anger and rage and could only be used for destruction."
    },
    {
      "body": "Aang and Zuko later found their way into a room with a circular alignment of statues, that were labeled as the ${link_0}, which was an ancient firebending form. After the both of them perform the form, a glowing ${link_1} appeared in the center of the room. Zuko took it, and accidentally triggered another trap. They were both found by members of the Sun Warrior tribe a while later.",
      "links": [
        {
          "body": "Dancing Dragon",
          "key": "${link_0}",
          "target": {
            "href": "Dancing_Dragon",
            "page": "Dancing_Dragon"
          }
        },
        {
          "body": "jewel",
          "key": "${link_1}",
          "target": {
            "href": "Sunstone",
            "page": "Sunstone"
          }
        }
      ],
      "text": "Aang and Zuko later found their way into a room with a circular alignment of statues, that were labeled as the Dancing Dragon, which was an ancient firebending form. After the both of them perform the form, a glowing jewel appeared in the center of the room. Zuko took it, and accidentally triggered another trap. They were both found by members of the Sun Warrior tribe a while later."
    },
    {
      "body": "The ${link_0} told them that if they wish to master firebending, they must meet the tribe's masters. They were both given a fireball to carry up a mountain where the masters were to prove their worth and commitment to firebending. Shortly after arriving at the mountain top, they were confronted by the ${link_1}, which turned out to be a red dragon and a blue dragon. The dragons circled around a shocked Zuko and Aang. Aang and Zuko performed the Dancing Dragon, which mimicked the dragon's movements. The masters deemed them worthy, and demonstrated their bending by creating a rainbow colored column of fire.",
      "links": [
        {
          "body": "chief",
          "key": "${link_0}",
          "target": {
            "href": "Sun_Warrior_chief",
            "page": "Sun_Warrior_chief"
          }
        },
        {
          "body": "masters",
          "key": "${link_1}",
          "target": {
            "href": "Ran_and_Shaw",
            "page": "Ran_and_Shaw"
          }
        }
      ],
      "text": "The chief told them that if they wish to master firebending, they must meet the tribe's masters. They were both given a fireball to carry up a mountain where the masters were to prove their worth and commitment to firebending. Shortly after arriving at the mountain top, they were confronted by the masters, which turned out to be a red dragon and a blue dragon. The dragons circled around a shocked Zuko and Aang. Aang and Zuko performed the Dancing Dragon, which mimicked the dragon's movements. The masters deemed them worthy, and demonstrated their bending by creating a rainbow colored column of fire."
    },
    {
      "body": "${link_0} performed the ${link_1} with firebending masters ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Dancing Dragon",
          "key": "${link_1}",
          "target": {
            "href": "Dancing_Dragon",
            "page": "Dancing_Dragon"
          }
        },
        {
          "body": "Ran and Shaw",
          "key": "${link_2}",
          "target": {
            "href": "Ran_and_Shaw",
            "page": "Ran_and_Shaw"
          }
        }
      ],
      "text": "Zuko performed the Dancing Dragon with firebending masters Ran and Shaw."
    },
    {
      "body": "Zuko and Aang were still shocked that there were dragons left. Zuko thought that his Uncle lied when he found and killed the last dragon, but the Sun Chief informs him otherwise. Zuko's uncle Iroh found his way to the dragons, and was deemed worthy and taught the original source of firebending as well. Zuko realized that firebending was not just hate and destruction, but beauty and life as well, and why he lost his ability to firebend. Hunting the Avatar was his drive for so long, so when he joined him, his drive vanished and he lost his touch with his inner fire. His new drive was to help the Avatar defeat the Fire Lord and restore balance to the world. Zuko was able to perform strong fire blasts again, and Aang was able to create fire too.",
      "links": [],
      "text": "Zuko and Aang were still shocked that there were dragons left. Zuko thought that his Uncle lied when he found and killed the last dragon, but the Sun Chief informs him otherwise. Zuko's uncle Iroh found his way to the dragons, and was deemed worthy and taught the original source of firebending as well. Zuko realized that firebending was not just hate and destruction, but beauty and life as well, and why he lost his ability to firebend. Hunting the Avatar was his drive for so long, so when he joined him, his drive vanished and he lost his touch with his inner fire. His new drive was to help the Avatar defeat the Fire Lord and restore balance to the world. Zuko was able to perform strong fire blasts again, and Aang was able to create fire too."
    },
    {
      "body": "After returning to the group, Aang and Zuko performed the firebending form they learned. Sokka poked fun at them saying that they could dance to defeat the Fire Lord. A frustrated Zuko argued with him, but when he told the group the form was called the Dancing Dragon, he was left embarrassed as the group laughed at him.",
      "links": [],
      "text": "After returning to the group, Aang and Zuko performed the firebending form they learned. Sokka poked fun at them saying that they could dance to defeat the Fire Lord. A frustrated Zuko argued with him, but when he told the group the form was called the Dancing Dragon, he was left embarrassed as the group laughed at him."
    },
    {
      "body": "During the team's dinner, Zuko was serving everyone tea. While doing so, he attempted to tell a tea joke Uncle Iroh said at an earlier point, but spoiled it when he could only remember the punchline, saying that it would have sounded funnier had it been his uncle who said it.",
      "links": [],
      "text": "During the team's dinner, Zuko was serving everyone tea. While doing so, he attempted to tell a tea joke Uncle Iroh said at an earlier point, but spoiled it when he could only remember the punchline, saying that it would have sounded funnier had it been his uncle who said it."
    },
    {
      "body": "${link_0} and ${link_1} heading to the ${link_2} in a war balloon.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_2}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        }
      ],
      "text": "Zuko and Sokka heading to the Boiling Rock in a war balloon."
    },
    {
      "body": "Meanwhile, Sokka was feeling a little disturbed. When he privately asked Zuko about what prison Fire Nation criminals would be placed in, and where his father may had been taken, he said it would only make Sokka feel worse, but he hesitantly answered that the place would be a prison out in the middle of a volcano, in the middle of the ocean, where the gang might had passed through while they were on their way to the Western Air Temple. The prison was called the ${link_0}, the most secure prison in the Fire Nation. Zuko was suspicious on why Sokka would ask such thing, to which the latter denied of going there.",
      "links": [
        {
          "body": "Boiling Rock",
          "key": "${link_0}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        }
      ],
      "text": "Meanwhile, Sokka was feeling a little disturbed. When he privately asked Zuko about what prison Fire Nation criminals would be placed in, and where his father may had been taken, he said it would only make Sokka feel worse, but he hesitantly answered that the place would be a prison out in the middle of a volcano, in the middle of the ocean, where the gang might had passed through while they were on their way to the Western Air Temple. The prison was called the Boiling Rock, the most secure prison in the Fire Nation. Zuko was suspicious on why Sokka would ask such thing, to which the latter denied of going there."
    },
    {
      "body": "In the middle of the night, while everyone was asleep, Sokka attempted to sneak on Appa alone. As he reached the saddle, he was caught by Zuko waiting there. Sokka demanded he needed to do this; as the Invasion was his idea, and his burden to get his honor back. However Zuko, knowing what it was like to want one's honor back, decided to go along with Sokka, not with Appa, but with a war balloon Zuko used as transportation to get to the Western Air Temple. Zuko left a note, for the gang to find next morning, fabricated in writing that he and Sokka had gone fishing, and reminded Aang to do some fire fists and hotsquats for firebending practice, much to the Avatar's dismay.",
      "links": [],
      "text": "In the middle of the night, while everyone was asleep, Sokka attempted to sneak on Appa alone. As he reached the saddle, he was caught by Zuko waiting there. Sokka demanded he needed to do this; as the Invasion was his idea, and his burden to get his honor back. However Zuko, knowing what it was like to want one's honor back, decided to go along with Sokka, not with Appa, but with a war balloon Zuko used as transportation to get to the Western Air Temple. Zuko left a note, for the gang to find next morning, fabricated in writing that he and Sokka had gone fishing, and reminded Aang to do some fire fists and hotsquats for firebending practice, much to the Avatar's dismay."
    },
    {
      "body": "Zuko and Sokka spent most of their journey to the Boiling Rock in awkward silence. Eventually, Sokka broke the silence by stating that a ${link_0} designed the war balloons. Zuko replied that his father was good at war, to which Sokka replied that it \"seemed to run in the family.\" Zuko claimed that not all of his family was like that, talking about his uncle, whom he was still downcast over betraying. Sokka tried stating that his uncle would be proud that he left his home to help them and that it was hard, but Zuko claimed it was not that hard, since the only one he left behind that he cared about was his girlfriend, Mai. Zuko said that he did not want to get her involved since he was now a traitor.",
      "links": [
        {
          "body": "friend of his",
          "key": "${link_0}",
          "target": {
            "href": "Mechanist",
            "page": "Mechanist"
          }
        }
      ],
      "text": "Zuko and Sokka spent most of their journey to the Boiling Rock in awkward silence. Eventually, Sokka broke the silence by stating that a friend of his designed the war balloons. Zuko replied that his father was good at war, to which Sokka replied that it \"seemed to run in the family.\" Zuko claimed that not all of his family was like that, talking about his uncle, whom he was still downcast over betraying. Sokka tried stating that his uncle would be proud that he left his home to help them and that it was hard, but Zuko claimed it was not that hard, since the only one he left behind that he cared about was his girlfriend, Mai. Zuko said that he did not want to get her involved since he was now a traitor."
    },
    {
      "body": "Zuko and Sokka made it to the prison at night. They saw a significant amount of steam emitting from the volcano. Because of the steam, the balloon air was no longer hot in relation to the outside air, which caused it to fall and crash, meaning there was no way off of the prison. Zuko told Sokka that he \"hope[d Sokka] knew what he was doing\", saying that there was no turning back.",
      "links": [],
      "text": "Zuko and Sokka made it to the prison at night. They saw a significant amount of steam emitting from the volcano. Because of the steam, the balloon air was no longer hot in relation to the outside air, which caused it to fall and crash, meaning there was no way off of the prison. Zuko told Sokka that he \"hope[d Sokka] knew what he was doing\", saying that there was no turning back."
    },
    {
      "body": "${link_0} and ${link_1} disguised as guards.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Zuko and Sokka disguised as guards."
    },
    {
      "body": "The next morning, the duo donned Fire Nation guard uniforms. As they entered the prison yard, an altercation was ongoing. ${link_0}, a firebending prisoner, \"broke\" the rule of \"Not bowing down to a prison guard.\" After Chit Sang defied his rule, the ${link_1} made a fire whip and used it against Chit Sang. However, the latter parried this, making him break the rule that firebending was prohibited in the prison. As a result, Chit Sang was sentenced to a cooler, where the firebenders would freeze until they could not firebend for a while.",
      "links": [
        {
          "body": "Chit Sang",
          "key": "${link_0}",
          "target": {
            "href": "Chit_Sang",
            "page": "Chit_Sang"
          }
        },
        {
          "body": "guard",
          "key": "${link_1}",
          "target": {
            "href": "Bully_guard",
            "page": "Bully_guard"
          }
        }
      ],
      "text": "The next morning, the duo donned Fire Nation guard uniforms. As they entered the prison yard, an altercation was ongoing. Chit Sang, a firebending prisoner, \"broke\" the rule of \"Not bowing down to a prison guard.\" After Chit Sang defied his rule, the guard made a fire whip and used it against Chit Sang. However, the latter parried this, making him break the rule that firebending was prohibited in the prison. As a result, Chit Sang was sentenced to a cooler, where the firebenders would freeze until they could not firebend for a while."
    },
    {
      "body": "Meanwhile, Zuko, at lunch break for the guards, asked some guards whether or not the Boiling Rock also held war prisoners. Zuko and Sokka met up later on and the firebender told the warrior that ${link_0} prisoners were not located in this prison, much to Sokka's sorrow. Sokka believed he failed, yet again, but Zuko tried to cheer him up with one of Iroh's wise sayings, which he messed up anyway. Sokka cheered up, not by Zuko's attempt, but at the sight of his girlfriend, ${link_1}, who was returning to her prison cell.",
      "links": [
        {
          "body": "Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Suki",
          "key": "${link_1}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        }
      ],
      "text": "Meanwhile, Zuko, at lunch break for the guards, asked some guards whether or not the Boiling Rock also held war prisoners. Zuko and Sokka met up later on and the firebender told the warrior that Water Tribe prisoners were not located in this prison, much to Sokka's sorrow. Sokka believed he failed, yet again, but Zuko tried to cheer him up with one of Iroh's wise sayings, which he messed up anyway. Sokka cheered up, not by Zuko's attempt, but at the sight of his girlfriend, Suki, who was returning to her prison cell."
    },
    {
      "body": "Sokka went inside her cell to talk to her while Zuko stood guard. While Sokka and Suki reunited, a guard came by to check on Suki. Zuko tried to keep her out, at first with an excuse, followed by physical force. When Sokka came out, back in his guard disguise, he helped the guard arrest Zuko, but whispered to him that he would figure something out. Zuko allowed himself to get captured, and he was taken to a prison cell. While Zuko was in his cell, he was confronted by the ${link_0}, who shocked Zuko by showing that he knew the prince, claiming that Zuko \"broke [his] niece's heart\", referring to Mai.",
      "links": [
        {
          "body": "warden",
          "key": "${link_0}",
          "target": {
            "href": "Warden_(Boiling_Rock)",
            "page": "Warden_(Boiling_Rock)"
          }
        }
      ],
      "text": "Sokka went inside her cell to talk to her while Zuko stood guard. While Sokka and Suki reunited, a guard came by to check on Suki. Zuko tried to keep her out, at first with an excuse, followed by physical force. When Sokka came out, back in his guard disguise, he helped the guard arrest Zuko, but whispered to him that he would figure something out. Zuko allowed himself to get captured, and he was taken to a prison cell. While Zuko was in his cell, he was confronted by the warden, who shocked Zuko by showing that he knew the prince, claiming that Zuko \"broke [his] niece's heart\", referring to Mai."
    },
    {
      "body": "${link_0} getting captured by ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Zuko getting captured by Sokka."
    },
    {
      "body": "Soon, Zuko and Suki were up to mopping duty and Suki recognized Zuko from when he ${link_0}. Sokka gathered the both of them for a plan which Chit Sang overheard, and he demanded to be involved. They planned to use a cooler to ride their way out like a boat, as the cooler was perfect for keeping heat out. First, someone would need to screw a cooler cell free. Zuko volunteered by pretending to fight with Chit Sang with firebending. After that, he was sent to a cooler cell and, having used his fire breath to keep warm, was successful in unscrewing the cooler free. However, guards passed by and the two hid and overheard information that new arrivals would be coming the next day, including war prisoners, giving Sokka hope that he would see his father, ${link_1}.",
      "links": [
        {
          "body": "attacked her village",
          "key": "${link_0}",
          "target": {
            "href": "Duels_(Spring_270_BG_-_Winter_100_AG)#Duel_on_Kyoshi_Island",
            "page": "Duels_(Spring_270_BG_-_Winter_100_AG)"
          }
        },
        {
          "body": "Hakoda",
          "key": "${link_1}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        }
      ],
      "text": "Soon, Zuko and Suki were up to mopping duty and Suki recognized Zuko from when he attacked her village. Sokka gathered the both of them for a plan which Chit Sang overheard, and he demanded to be involved. They planned to use a cooler to ride their way out like a boat, as the cooler was perfect for keeping heat out. First, someone would need to screw a cooler cell free. Zuko volunteered by pretending to fight with Chit Sang with firebending. After that, he was sent to a cooler cell and, having used his fire breath to keep warm, was successful in unscrewing the cooler free. However, guards passed by and the two hid and overheard information that new arrivals would be coming the next day, including war prisoners, giving Sokka hope that he would see his father, Hakoda."
    },
    {
      "body": "That night, Zuko and Sokka brought the loose cooler cell to where Chit Sang, Suki, and Chit Sang's ${link_0} and ${link_1} were waiting. Sokka, knowing about the new arrivals of new prisoners tomorrow, stayed at the prison to break his father out. Suki and Zuko agreed to stay, while Chit Sang left. By dawn, Chit Sang and his friends were steaming up in the cooler and Chit Sang broke off a piece of metal to use as an oar to make the cooler go faster. He was scalded by the boiling water and yelled out in pain, alerting the Fire Nation guards of their escape attempt and they were caught. Meanwhile, Sokka, Suki, and Zuko hid while watching the prisoners come out of the lift used to transport prisoners. After a few come out, Sokka lost hope of seeing his father, until one last person was called out: Hakoda.",
      "links": [
        {
          "body": "friend",
          "key": "${link_0}",
          "target": {
            "href": "Chit_Sang%27s_friend",
            "page": "Chit_Sang%27s_friend"
          }
        },
        {
          "body": "girlfriend",
          "key": "${link_1}",
          "target": {
            "href": "Chit_Sang%27s_girlfriend",
            "page": "Chit_Sang%27s_girlfriend"
          }
        }
      ],
      "text": "That night, Zuko and Sokka brought the loose cooler cell to where Chit Sang, Suki, and Chit Sang's friend and girlfriend were waiting. Sokka, knowing about the new arrivals of new prisoners tomorrow, stayed at the prison to break his father out. Suki and Zuko agreed to stay, while Chit Sang left. By dawn, Chit Sang and his friends were steaming up in the cooler and Chit Sang broke off a piece of metal to use as an oar to make the cooler go faster. He was scalded by the boiling water and yelled out in pain, alerting the Fire Nation guards of their escape attempt and they were caught. Meanwhile, Sokka, Suki, and Zuko hid while watching the prisoners come out of the lift used to transport prisoners. After a few come out, Sokka lost hope of seeing his father, until one last person was called out: Hakoda."
    },
    {
      "body": "${link_0} reunited with ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Mai",
          "key": "${link_1}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        }
      ],
      "text": "Zuko reunited with Mai."
    },
    {
      "body": "After the father-son reunion, Sokka made his way to Zuko's prison cell and tried to share an escape plan that he and Hakoda made, but was interrupted by two Fire Nation guards. Sokka feigned brutalizing Zuko as he filled in with where to meet. Zuko was taken into another cell, where he was confronted by Mai. Mai began to berate Zuko for leaving a letter and making her think that he had abandoned her, claiming that he could have least \"looked [her] in the eye when [he] ripped out [her] heart\". Zuko tried to tell her that he was doing this for his Nation, but Mai did not seem to understand how betraying his Nation will help it.",
      "links": [],
      "text": "After the father-son reunion, Sokka made his way to Zuko's prison cell and tried to share an escape plan that he and Hakoda made, but was interrupted by two Fire Nation guards. Sokka feigned brutalizing Zuko as he filled in with where to meet. Zuko was taken into another cell, where he was confronted by Mai. Mai began to berate Zuko for leaving a letter and making her think that he had abandoned her, claiming that he could have least \"looked [her] in the eye when [he] ripped out [her] heart\". Zuko tried to tell her that he was doing this for his Nation, but Mai did not seem to understand how betraying his Nation will help it."
    },
    {
      "body": "Later, Sokka, with the help of Chit Sang, started a riot and, in the confusion, Zuko got away and locked Mai in the cell to keep her safe. After Zuko showed up to join his friends, Suki captured the warden and the group made their way to the ${link_0}.",
      "links": [
        {
          "body": "gondola",
          "key": "${link_0}",
          "target": {
            "href": "Gondola",
            "page": "Gondola"
          }
        }
      ],
      "text": "Later, Sokka, with the help of Chit Sang, started a riot and, in the confusion, Zuko got away and locked Mai in the cell to keep her safe. After Zuko showed up to join his friends, Suki captured the warden and the group made their way to the gondola."
    },
    {
      "body": "${link_0} fighting ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Zuko fighting Azula."
    },
    {
      "body": "The groups made it and Zuko broke the lever to make it unstoppable. However, they soon discovered a problem: They were being followed by Azula and Ty Lee, though Zuko and Suki had been waiting for a rematch with the two, respectively. Sokka, Suki, and Zuko climbed to the roof of the gondola and battled Ty Lee and Azula. Suki battled evenly with Ty Lee and Sokka and Zuko matched Azula fairly. The warden broke free of his binding and orders the guards to cut the line, even though that meant he and the others would not survive. The guards proceed on doing so. Azula and Ty Lee made it onto another gondola, but the group was trapped. Just as the ${link_0} were about to finish cutting the line, they were stopped by Mai. Mai started to pin the guards with her daggers, much to everyone's confusion. A guard asked her what she was doing, to which she replied, \"Saving the jerk who dumped me.\" She freed the line and the gondola used by the group started moving again. The group made it out, while leaving the warden behind, and the group left. Although Suki wondered how they were going to leave, Zuko realized that Azula must have come to the Boiling Rock somehow and spotted a ${link_1}. The group used the airship as a tool for escape.",
      "links": [
        {
          "body": "guards",
          "key": "${link_0}",
          "target": {
            "href": "Gondola_guards",
            "page": "Gondola_guards"
          }
        },
        {
          "body": "Fire Nation airship",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        }
      ],
      "text": "The groups made it and Zuko broke the lever to make it unstoppable. However, they soon discovered a problem: They were being followed by Azula and Ty Lee, though Zuko and Suki had been waiting for a rematch with the two, respectively. Sokka, Suki, and Zuko climbed to the roof of the gondola and battled Ty Lee and Azula. Suki battled evenly with Ty Lee and Sokka and Zuko matched Azula fairly. The warden broke free of his binding and orders the guards to cut the line, even though that meant he and the others would not survive. The guards proceed on doing so. Azula and Ty Lee made it onto another gondola, but the group was trapped. Just as the guards were about to finish cutting the line, they were stopped by Mai. Mai started to pin the guards with her daggers, much to everyone's confusion. A guard asked her what she was doing, to which she replied, \"Saving the jerk who dumped me.\" She freed the line and the gondola used by the group started moving again. The group made it out, while leaving the warden behind, and the group left. Although Suki wondered how they were going to leave, Zuko realized that Azula must have come to the Boiling Rock somehow and spotted a Fire Nation airship. The group used the airship as a tool for escape."
    },
    {
      "body": "As Zuko and the others got back to the Western Air Temple, Katara asked Sokka and Zuko what happened to Zuko's small war balloon. Zuko merely answered, \"It kinda got destroyed.\" After the rest of the gang asked if they got some good meat, Sokka answered that he did and it was the best meat of all, which was the meat of friendship and fatherhood. Hakoda, Suki, and Chit Sang presented themselves, though Chit Sang said, \"I'm new. What's up everybody?\" Katara embraced her father and asked what was going on. Sokka told her that they went to a Fire Nation prison, and he was dragged into the family reunion. Zuko watched this with a first real smile on his face.",
      "links": [],
      "text": "As Zuko and the others got back to the Western Air Temple, Katara asked Sokka and Zuko what happened to Zuko's small war balloon. Zuko merely answered, \"It kinda got destroyed.\" After the rest of the gang asked if they got some good meat, Sokka answered that he did and it was the best meat of all, which was the meat of friendship and fatherhood. Hakoda, Suki, and Chit Sang presented themselves, though Chit Sang said, \"I'm new. What's up everybody?\" Katara embraced her father and asked what was going on. Sokka told her that they went to a Fire Nation prison, and he was dragged into the family reunion. Zuko watched this with a first real smile on his face."
    },
    {
      "body": "${link_0} blocking ${link_1}'s fireblast.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Zuko blocking Azula's fireblast."
    },
    {
      "body": "In the beginning, the group was sleeping soundly on the ground some time after Zuko and Sokka returned to the Western Air Temple. Suddenly, bombs started shooting from Azula and fleet of airships there. Aang airbent the large doors closed to protect the group. Zuko pushed Katara out of the way when the ceiling almost fell on her. Katara in anger asked him what he was doing. Zuko told her that he was keeping rocks from crushing her, but Katara just shoved him off and said that she was not crushed and he could get off of her now. Zuko replied \"I'll take that as a thank you\", and got up. During the group's escape, Zuko acted as a distraction to buy them some time. When he confronted Azula, he asked why she was there. Her response was she was \"about to celebrate becoming an only child\", meaning she intended to kill him. Zuko fought Azula atop one of the airships, and was saved from certain death when the rest of the team flew under him on Appa and caught him after he and Azula blasted each other off.",
      "links": [],
      "text": "In the beginning, the group was sleeping soundly on the ground some time after Zuko and Sokka returned to the Western Air Temple. Suddenly, bombs started shooting from Azula and fleet of airships there. Aang airbent the large doors closed to protect the group. Zuko pushed Katara out of the way when the ceiling almost fell on her. Katara in anger asked him what he was doing. Zuko told her that he was keeping rocks from crushing her, but Katara just shoved him off and said that she was not crushed and he could get off of her now. Zuko replied \"I'll take that as a thank you\", and got up. During the group's escape, Zuko acted as a distraction to buy them some time. When he confronted Azula, he asked why she was there. Her response was she was \"about to celebrate becoming an only child\", meaning she intended to kill him. Zuko fought Azula atop one of the airships, and was saved from certain death when the rest of the team flew under him on Appa and caught him after he and Azula blasted each other off."
    },
    {
      "body": "After that morning, they settled down and Aang remarked that camping was just like old times. Zuko made a joke that if he wanted it to feel like old times, he could chase Aang around and try to capture him. Everyone laughed except Katara. Sokka made a toast to Zuko, but Zuko said he did not deserve it. Katara agreed with him and stormed off. Zuko followed her, finding out why Katara had been acting so bitter toward him, and that everyone seemed to trust him now. She yelled at him and said, \"Maybe you can reconquer ${link_0} in the name of the Earth King! Or, I know, you can bring my mother back!\" She left him there, thinking about what she said. After inadvertently thwarting a tryst between Sokka and Suki, he asked Sokka about the death of their ${link_1}, since he thought that was why Katara was holding in a grudge on him. He learned that the leader of the ${link_2}, a fleet of Fire Nation warships, was responsible. He offered Katara his assistance in finding him, and she accepted. When Aang told Katara to let go of her anger, and that revenge was not the right path to go with, he was criticized by Zuko.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "mother",
          "key": "${link_1}",
          "target": {
            "href": "Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        },
        {
          "body": "Southern Raiders",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Raiders",
            "page": "Southern_Raiders"
          }
        }
      ],
      "text": "After that morning, they settled down and Aang remarked that camping was just like old times. Zuko made a joke that if he wanted it to feel like old times, he could chase Aang around and try to capture him. Everyone laughed except Katara. Sokka made a toast to Zuko, but Zuko said he did not deserve it. Katara agreed with him and stormed off. Zuko followed her, finding out why Katara had been acting so bitter toward him, and that everyone seemed to trust him now. She yelled at him and said, \"Maybe you can reconquer Ba Sing Se in the name of the Earth King! Or, I know, you can bring my mother back!\" She left him there, thinking about what she said. After inadvertently thwarting a tryst between Sokka and Suki, he asked Sokka about the death of their mother, since he thought that was why Katara was holding in a grudge on him. He learned that the leader of the Southern Raiders, a fleet of Fire Nation warships, was responsible. He offered Katara his assistance in finding him, and she accepted. When Aang told Katara to let go of her anger, and that revenge was not the right path to go with, he was criticized by Zuko."
    },
    {
      "body": "${link_0} yelling at ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Katara yelling at Zuko."
    },
    {
      "body": "They sneaked into the ${link_0} and found out where the Southern Raiders were: ${link_1}. They quickly escaped on Appa and continue their mission to the island. Katara told Zuko the story of what happened to her mother from her point of view. When the Southern Raiders came, young Katara went to her family's house to find her mother. There she saw the leader of the Southern Raiders, looking into his eyes, with her mother. Katara was scared, but her mother told her not to worry, and to find her father. Katara run outside as fast as she could and told her father about this, and both started running toward their igloo. But when the got there, it was too late. Zuko told Katara that her mother was a brave woman. Katara touched her necklace, and said she knew.",
      "links": [
        {
          "body": "Fire Navy communications tower",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Navy_communications_towers",
            "page": "Fire_Navy_communications_towers"
          }
        },
        {
          "body": "Whaletail Island",
          "key": "${link_1}",
          "target": {
            "href": "Whaletail_Island",
            "page": "Whaletail_Island"
          }
        }
      ],
      "text": "They sneaked into the Fire Navy communications tower and found out where the Southern Raiders were: Whaletail Island. They quickly escaped on Appa and continue their mission to the island. Katara told Zuko the story of what happened to her mother from her point of view. When the Southern Raiders came, young Katara went to her family's house to find her mother. There she saw the leader of the Southern Raiders, looking into his eyes, with her mother. Katara was scared, but her mother told her not to worry, and to find her father. Katara run outside as fast as she could and told her father about this, and both started running toward their igloo. But when the got there, it was too late. Zuko told Katara that her mother was a brave woman. Katara touched her necklace, and said she knew."
    },
    {
      "body": "Zuko and Katara finally got to Whaletail Island. Both started running toward the front where they predicted the leader was, knocking down every soldier in their way. They got there and Zuko and Katara spotted the leader. The leader, who was baffled and confused on what they were accusing him of, said he did not know what they were talking about. Zuko promptly witnessed Katara's power when she ${link_0} the ${link_1}, which he never knew she could do. The leader, helpless and afraid, kept telling them he did not know anything about the ${link_2}. Katara looked into the man's eyes and let him go, realizing this was not the man they were looking for. Zuko interrogated the man to say where the veteran leader was and they both headed off.",
      "links": [
        {
          "body": "bloodbent",
          "key": "${link_0}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "leader",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Raiders_commander",
            "page": "Southern_Raiders_commander"
          }
        },
        {
          "body": "Southern Water Tribe raids",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        }
      ],
      "text": "Zuko and Katara finally got to Whaletail Island. Both started running toward the front where they predicted the leader was, knocking down every soldier in their way. They got there and Zuko and Katara spotted the leader. The leader, who was baffled and confused on what they were accusing him of, said he did not know what they were talking about. Zuko promptly witnessed Katara's power when she bloodbent the leader, which he never knew she could do. The leader, helpless and afraid, kept telling them he did not know anything about the Southern Water Tribe raids. Katara looked into the man's eyes and let him go, realizing this was not the man they were looking for. Zuko interrogated the man to say where the veteran leader was and they both headed off."
    },
    {
      "body": "${link_0} finally forgiving ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Katara finally forgiving Zuko."
    },
    {
      "body": "Zuko and Katara eventually found ${link_0} responsible of killing Katara's mother. At first he did not remember, but it all came back to him. He remembered the little Water Tribe girl and her mother telling her to leave. Yon Rha asked ${link_1} who the last waterbender was. She denied at first that there were no waterbenders left, but Yon Rha knew there was one more. Kya lied and told him she was the last waterbender of the tribe and to take her prisoner. Yon Rha refused to take her prisoner and killed her.",
      "links": [
        {
          "body": "the man",
          "key": "${link_0}",
          "target": {
            "href": "Yon_Rha",
            "page": "Yon_Rha"
          }
        },
        {
          "body": "Kya",
          "key": "${link_1}",
          "target": {
            "href": "Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        }
      ],
      "text": "Zuko and Katara eventually found the man responsible of killing Katara's mother. At first he did not remember, but it all came back to him. He remembered the little Water Tribe girl and her mother telling her to leave. Yon Rha asked Kya who the last waterbender was. She denied at first that there were no waterbenders left, but Yon Rha knew there was one more. Kya lied and told him she was the last waterbender of the tribe and to take her prisoner. Yon Rha refused to take her prisoner and killed her."
    },
    {
      "body": "Katara told the man that her mother lied to protect the last waterbender: her. When she finally had her chance to get revenge once and for all, she could not bring herself to kill him. After the group joined Katara on Ember Island, Katara told Zuko that she had forgiven him, and hugged him warmly. He subsequently asked Aang what he would do when he faced Ozai, since he believed killing someone was never the answer.",
      "links": [],
      "text": "Katara told the man that her mother lied to protect the last waterbender: her. When she finally had her chance to get revenge once and for all, she could not bring herself to kill him. After the group joined Katara on Ember Island, Katara told Zuko that she had forgiven him, and hugged him warmly. He subsequently asked Aang what he would do when he faced Ozai, since he believed killing someone was never the answer."
    },
    {
      "body": "${link_0} and ${link_1} embarrassed by the ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "play",
          "key": "${link_2}",
          "target": {
            "href": "The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        }
      ],
      "text": "Zuko and Aang embarrassed by the play."
    },
    {
      "body": "While stationed at ${link_0}, the group attended a ${link_1} which showed their adventures. The plot was twisted and made to demoralize the group. Zuko had quite possibly the most negative response to the play as it \"[took] all the mistakes of [his] life and [shoved] them in [his] face\". The most emotional part to him was the scene where he betrayed Iroh which he was still ashamed of as he now saw that Iroh was more of a father to him than Ozai ever was. Toph later told him about her long conversation with Iroh she once had and how he would constantly talk about Zuko. This knowledge gave Zuko hope that Iroh still loved him. At the end of the play, Azula's character was shown killing him, at which the audience cheered and Zuko was taken aback. When ${link_2} left, Zuko said to the others that the play \"wasn't good\", which was met with agreement.",
      "links": [
        {
          "body": "Ember Island",
          "key": "${link_0}",
          "target": {
            "href": "Ember_Island",
            "page": "Ember_Island"
          }
        },
        {
          "body": "play",
          "key": "${link_1}",
          "target": {
            "href": "The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "While stationed at Ember Island, the group attended a play which showed their adventures. The plot was twisted and made to demoralize the group. Zuko had quite possibly the most negative response to the play as it \"[took] all the mistakes of [his] life and [shoved] them in [his] face\". The most emotional part to him was the scene where he betrayed Iroh which he was still ashamed of as he now saw that Iroh was more of a father to him than Ozai ever was. Toph later told him about her long conversation with Iroh she once had and how he would constantly talk about Zuko. This knowledge gave Zuko hope that Iroh still loved him. At the end of the play, Azula's character was shown killing him, at which the audience cheered and Zuko was taken aback. When Team Avatar left, Zuko said to the others that the play \"wasn't good\", which was met with agreement."
    },
    {
      "body": "${link_0} attacked ${link_1} to teach him a lesson.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Zuko attacked Aang to teach him a lesson."
    },
    {
      "body": "Three days before the arrival of ${link_0}, Zuko was fiercely training Aang in firebending, pushing him to improve quickly and urging him to be more aggressive. However, Aang soon lost focus and joined the group in a beach party. Zuko became enraged and attacked Aang, hoping to coax him into fighting seriously as preparation for his battle with Ozai. Zuko chased Aang all over the yard and into the house, firebending at him the entire time. Finally, Aang blasted air at Zuko, blasting him out of the house.",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "text": "Three days before the arrival of Sozin's Comet, Zuko was fiercely training Aang in firebending, pushing him to improve quickly and urging him to be more aggressive. However, Aang soon lost focus and joined the group in a beach party. Zuko became enraged and attacked Aang, hoping to coax him into fighting seriously as preparation for his battle with Ozai. Zuko chased Aang all over the yard and into the house, firebending at him the entire time. Finally, Aang blasted air at Zuko, blasting him out of the house."
    },
    {
      "body": "The rest of the group demanded to know what was wrong with Zuko, and the latter told them they should not be having beach parties when the comet was only three days away. Aang and the others awkwardly told him that they had planned to wait until after the comet came to fight the Fire Lord. The Avatar told him that he still needed more time to master firebending, and Sokka added that if Aang fought Ozai now, he would lose. Katara said that the point of defeating the Fire Lord before the Comet was to win the war, but the Fire Nation won the war when they took Ba Sing Se, and that things could not get any worse. With regret, Zuko told them about the war meeting he had attended before the eclipse during which his father had revealed his plans to use the comet to wipe out the Earth Kingdom by burning it all to the ground while building a new world from its ashes, a world in which the Fire Nation will be the only nation. The group was shocked by the plan, and Zuko told Aang that if he did not defeat the Fire Lord before the Comet came, there would not be a world to save anymore. He taught Aang one final technique before he could face the Fire Lord: the ${link_0}.",
      "links": [
        {
          "body": "lightning redirection",
          "key": "${link_0}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "text": "The rest of the group demanded to know what was wrong with Zuko, and the latter told them they should not be having beach parties when the comet was only three days away. Aang and the others awkwardly told him that they had planned to wait until after the comet came to fight the Fire Lord. The Avatar told him that he still needed more time to master firebending, and Sokka added that if Aang fought Ozai now, he would lose. Katara said that the point of defeating the Fire Lord before the Comet was to win the war, but the Fire Nation won the war when they took Ba Sing Se, and that things could not get any worse. With regret, Zuko told them about the war meeting he had attended before the eclipse during which his father had revealed his plans to use the comet to wipe out the Earth Kingdom by burning it all to the ground while building a new world from its ashes, a world in which the Fire Nation will be the only nation. The group was shocked by the plan, and Zuko told Aang that if he did not defeat the Fire Lord before the Comet came, there would not be a world to save anymore. He taught Aang one final technique before he could face the Fire Lord: the lightning redirection."
    },
    {
      "body": "${link_0} urging ${link_1} to find ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "June",
          "key": "${link_1}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Zuko urging June to find Aang."
    },
    {
      "body": "The following morning, the group woke up to find Aang and Momo missing. They decided to split up, with Toph eagerly going with Zuko, as she wanted her own \"life-changing field trip\" with him. Toph spent the entire trip telling Zuko her problems with her parents, but was disappointed when Zuko had difficulty maintaining sympathy with her, mostly due to the graveness of the situation. After an extensive search of the island revealed nothing, the gang turned to Zuko to find him, as he was the one with the most experience tracking the Avatar. Zuko flew them to the Earth Kingdom, to a seedy ${link_0}, where they found ${link_1}. He urged her to track down Aang, as the fate of the world depended on him. However, the ${link_2} was unable to find Aang's scent anywhere on the planet. At first, the gang despaired of ever finding Aang, until Zuko thought that there was one other person who may be able to defeat Ozai. He asked June to find Iroh, and provided a smell sample: his uncle's sweaty sandal, which he had kept. ${link_3} tracked the scent all the way to the Outer Wall of Ba Sing Se. After arriving at the wall, June wished them luck and left. At that night, the group was approached by four members of the ${link_4}: ${link_5}, ${link_6}, ${link_7}, and ${link_8}. They guided the group to a ${link_9}, and explained that they had planned to liberate Ba Sing Se from the Fire Nation. They led Zuko to his uncle's tent.",
      "links": [
        {
          "body": "tavern",
          "key": "${link_0}",
          "target": {
            "href": "Tavern",
            "page": "Tavern"
          }
        },
        {
          "body": "June",
          "key": "${link_1}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "shirshu",
          "key": "${link_2}",
          "target": {
            "href": "Shirshu",
            "page": "Shirshu"
          }
        },
        {
          "body": "June's shirshu",
          "key": "${link_3}",
          "target": {
            "href": "Nyla",
            "page": "Nyla"
          }
        },
        {
          "body": "Order of the White Lotus",
          "key": "${link_4}",
          "target": {
            "href": "Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        },
        {
          "body": "Pakku",
          "key": "${link_5}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_6}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "Jeong Jeong",
          "key": "${link_7}",
          "target": {
            "href": "Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        },
        {
          "body": "Piandao",
          "key": "${link_8}",
          "target": {
            "href": "Piandao",
            "page": "Piandao"
          }
        },
        {
          "body": "camp",
          "key": "${link_9}",
          "target": {
            "href": "White_Lotus_camp",
            "page": "White_Lotus_camp"
          }
        }
      ],
      "text": "The following morning, the group woke up to find Aang and Momo missing. They decided to split up, with Toph eagerly going with Zuko, as she wanted her own \"life-changing field trip\" with him. Toph spent the entire trip telling Zuko her problems with her parents, but was disappointed when Zuko had difficulty maintaining sympathy with her, mostly due to the graveness of the situation. After an extensive search of the island revealed nothing, the gang turned to Zuko to find him, as he was the one with the most experience tracking the Avatar. Zuko flew them to the Earth Kingdom, to a seedy tavern, where they found June. He urged her to track down Aang, as the fate of the world depended on him. However, the shirshu was unable to find Aang's scent anywhere on the planet. At first, the gang despaired of ever finding Aang, until Zuko thought that there was one other person who may be able to defeat Ozai. He asked June to find Iroh, and provided a smell sample: his uncle's sweaty sandal, which he had kept. June's shirshu tracked the scent all the way to the Outer Wall of Ba Sing Se. After arriving at the wall, June wished them luck and left. At that night, the group was approached by four members of the Order of the White Lotus: Pakku, Bumi, Jeong Jeong, and Piandao. They guided the group to a camp, and explained that they had planned to liberate Ba Sing Se from the Fire Nation. They led Zuko to his uncle's tent."
    },
    {
      "body": "${link_0} and ${link_1} reuniting at the ${link_2} ${link_3}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Order of the White Lotus",
          "key": "${link_2}",
          "target": {
            "href": "Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        },
        {
          "body": "camp",
          "key": "${link_3}",
          "target": {
            "href": "White_Lotus_camp",
            "page": "White_Lotus_camp"
          }
        }
      ],
      "text": "Zuko and Iroh reuniting at the Order of the White Lotus camp."
    },
    {
      "body": "Believing that his uncle hated him, Zuko was afraid to enter, but after some reassurances from Katara he went in to find his uncle asleep. When Iroh woke up, Zuko tearfully told him how sorry he was and begged for his forgiveness. Iroh embraced him, and said that he was never angry, only sad because he feared Zuko had lost his way. He told Zuko how proud he was that he found it again, and found his way to him.",
      "links": [],
      "text": "Believing that his uncle hated him, Zuko was afraid to enter, but after some reassurances from Katara he went in to find his uncle asleep. When Iroh woke up, Zuko tearfully told him how sorry he was and begged for his forgiveness. Iroh embraced him, and said that he was never angry, only sad because he feared Zuko had lost his way. He told Zuko how proud he was that he found it again, and found his way to him."
    },
    {
      "body": "The following morning, Zuko tried to convince Iroh to fight Ozai, as he was the only one who could defeat him apart from Aang. Iroh refused saying that even if he defeated Ozai, and he was not sure that he could, history would see it as more senseless violence. Only the Avatar could honorably defeat the Fire Lord. When Zuko asked if he will take the throne and become Fire Lord after the war, Iroh said that the Fire Nation must have a new, young leader of unquestionable honor: Zuko. While Zuko at first questions whether he had unquestionable honor after he made so many mistakes, Iroh told him that it was how he had struggled to redeem himself that truly made him worthy. He told Zuko to return to the Fire Nation and fight against Azula for its fate.",
      "links": [],
      "text": "The following morning, Zuko tried to convince Iroh to fight Ozai, as he was the only one who could defeat him apart from Aang. Iroh refused saying that even if he defeated Ozai, and he was not sure that he could, history would see it as more senseless violence. Only the Avatar could honorably defeat the Fire Lord. When Zuko asked if he will take the throne and become Fire Lord after the war, Iroh said that the Fire Nation must have a new, young leader of unquestionable honor: Zuko. While Zuko at first questions whether he had unquestionable honor after he made so many mistakes, Iroh told him that it was how he had struggled to redeem himself that truly made him worthy. He told Zuko to return to the Fire Nation and fight against Azula for its fate."
    },
    {
      "body": "Zuko journeyed with Katara and Appa to the ${link_0} to take the throne from his sister. They arrived during Azula's coronation. She challenged Zuko to an ${link_1} for the right to become Fire Lord. He accepted the challenge despite Katara's warnings, noticing something was wrong with Azula. Empowered by Sozin's Comet, Zuko and Azula ${link_2} in a dazzling display of firebending which destroyed much of the Capital. As Zuko slowly started to gain the upper hand he taunted Azula about being afraid to use lightning, for he could redirect it now.",
      "links": [
        {
          "body": "Fire Nation Capital",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_1}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        },
        {
          "body": "battled",
          "key": "${link_2}",
          "target": {
            "href": "Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        }
      ],
      "text": "Zuko journeyed with Katara and Appa to the Fire Nation Capital to take the throne from his sister. They arrived during Azula's coronation. She challenged Zuko to an Agni Kai for the right to become Fire Lord. He accepted the challenge despite Katara's warnings, noticing something was wrong with Azula. Empowered by Sozin's Comet, Zuko and Azula battled in a dazzling display of firebending which destroyed much of the Capital. As Zuko slowly started to gain the upper hand he taunted Azula about being afraid to use lightning, for he could redirect it now."
    },
    {
      "body": "${link_0} absorbing the ${link_1} meant for ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "lightning attack",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Zuko absorbing the lightning attack meant for Katara."
    },
    {
      "body": "Goaded, Azula prepared to use lightning on Zuko until she noticed Katara in the distance. Azula shot lightning toward Katara but Zuko jumped in its way to protect her at the last second. He managed to redirect the brunt of the lightning, but he failed to direct it around his heart and fell to the ground, badly injured. Katara attempted to heal him, but Azula attacked and drove her back between the pillars. Just when Azula was about to kill her with another bolt, Katara froze them both into a mass of water and tied Azula to a drain. Katara promptly rushed back to Zuko and healed him. Zuko thanked Katara, but Katara said she was the one who should be thanking him. They both got up and looked at Azula, who now was breathing fire as she cried uncontrollably. Realizing the extent of Azula's madness, Zuko and Katara looked upon the defeated princess; Katara with shock and sadness, and Zuko with impenitence.",
      "links": [],
      "text": "Goaded, Azula prepared to use lightning on Zuko until she noticed Katara in the distance. Azula shot lightning toward Katara but Zuko jumped in its way to protect her at the last second. He managed to redirect the brunt of the lightning, but he failed to direct it around his heart and fell to the ground, badly injured. Katara attempted to heal him, but Azula attacked and drove her back between the pillars. Just when Azula was about to kill her with another bolt, Katara froze them both into a mass of water and tied Azula to a drain. Katara promptly rushed back to Zuko and healed him. Zuko thanked Katara, but Katara said she was the one who should be thanking him. They both got up and looked at Azula, who now was breathing fire as she cried uncontrollably. Realizing the extent of Azula's madness, Zuko and Katara looked upon the defeated princess; Katara with shock and sadness, and Zuko with impenitence."
    },
    {
      "body": "${link_0} being crowned as the new ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "text": "Zuko being crowned as the new Fire Lord."
    },
    {
      "body": "After his battle with Azula, Zuko renewed his relationship with Mai, who had been released from prison by ${link_0}. During his subsequent coronation as Fire Lord in the presence of a large delegation of each nation and the Avatar, he promised that he and Aang would help rebuild the world together and that he would redeem the Fire Nation for their atrocities.",
      "links": [
        {
          "body": "her uncle",
          "key": "${link_0}",
          "target": {
            "href": "Warden_(Boiling_Rock)",
            "page": "Warden_(Boiling_Rock)"
          }
        }
      ],
      "text": "After his battle with Azula, Zuko renewed his relationship with Mai, who had been released from prison by her uncle. During his subsequent coronation as Fire Lord in the presence of a large delegation of each nation and the Avatar, he promised that he and Aang would help rebuild the world together and that he would redeem the Fire Nation for their atrocities."
    },
    {
      "body": "Shortly after this, he visited his father in ${link_0}. While Ozai sarcastically told him he felt lucky to be visited by the new Fire Lord, Zuko told him he was lucky the Avatar spared his life. He also told him that maybe time in prison would set Ozai on the right path, just as his banishment set him on the right path. When Ozai asked him why he was there, Zuko demanded to know where ${link_1} was. Ozai only mocked Zuko, asking him to get some tea so they could talk just like Iroh would talk to Zuko. Zuko began to leave in frustration, but Ozai snidely warned him about the pressures of the throne and how they can change a person. Ozai guaranteed Zuko that one day he would return to the cell and ask for advice.",
      "links": [
        {
          "body": "prison",
          "key": "${link_0}",
          "target": {
            "href": "Capital_City_Prison",
            "page": "Capital_City_Prison"
          }
        },
        {
          "body": "Ursa",
          "key": "${link_1}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        }
      ],
      "text": "Shortly after this, he visited his father in prison. While Ozai sarcastically told him he felt lucky to be visited by the new Fire Lord, Zuko told him he was lucky the Avatar spared his life. He also told him that maybe time in prison would set Ozai on the right path, just as his banishment set him on the right path. When Ozai asked him why he was there, Zuko demanded to know where Ursa was. Ozai only mocked Zuko, asking him to get some tea so they could talk just like Iroh would talk to Zuko. Zuko began to leave in frustration, but Ozai snidely warned him about the pressures of the throne and how they can change a person. Ozai guaranteed Zuko that one day he would return to the cell and ask for advice."
    },
    {
      "body": "Not long after his coronation, Zuko traveled to Ba Sing Se both to participate in celebrations and plan ahead. He met with ${link_0} ${link_1} and the rest of Team Avatar at ${link_2}, where the group first conceived of the ${link_3}. At the time, Zuko firmly supported the full removal of the Fire Nation colonies from the western shores of the Earth Kingdom. The final scene showed the entire group, composed of Aang, Sokka, Katara, Toph, Suki, Zuko, Mai, and Iroh in the ${link_4} tea shop. Zuko served tea to the group while his uncle played the ${link_5}, and criticized Sokka's painting of the group, saying his hair was too spiky, making him look like a ${link_6}. He laughed at Toph's joke about the painting looking perfect to her. Later, during a group ride on Appa, Zuko made Aang promise that if Zuko were ever to start acting like his father, Aang would end his life. Aang reluctantly agreed to the request.",
      "links": [
        {
          "body": "Earth King",
          "key": "${link_0}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Kuei",
          "key": "${link_1}",
          "target": {
            "href": "Kuei",
            "page": "Kuei"
          }
        },
        {
          "body": "Kuei's palace",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        },
        {
          "body": "Harmony Restoration Movement",
          "key": "${link_3}",
          "target": {
            "href": "Harmony_Restoration_Movement",
            "page": "Harmony_Restoration_Movement"
          }
        },
        {
          "body": "Jasmine Dragon",
          "key": "${link_4}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        },
        {
          "body": "tsungi horn",
          "key": "${link_5}",
          "target": {
            "href": "Tsungi_horn",
            "page": "Tsungi_horn"
          }
        },
        {
          "body": "boar-q-pine",
          "key": "${link_6}",
          "target": {
            "href": "Boar-q-pine",
            "page": "Boar-q-pine"
          }
        }
      ],
      "text": "Not long after his coronation, Zuko traveled to Ba Sing Se both to participate in celebrations and plan ahead. He met with Earth King Kuei and the rest of Team Avatar at Kuei's palace, where the group first conceived of the Harmony Restoration Movement. At the time, Zuko firmly supported the full removal of the Fire Nation colonies from the western shores of the Earth Kingdom. The final scene showed the entire group, composed of Aang, Sokka, Katara, Toph, Suki, Zuko, Mai, and Iroh in the Jasmine Dragon tea shop. Zuko served tea to the group while his uncle played the tsungi horn, and criticized Sokka's painting of the group, saying his hair was too spiky, making him look like a boar-q-pine. He laughed at Toph's joke about the painting looking perfect to her. Later, during a group ride on Appa, Zuko made Aang promise that if Zuko were ever to start acting like his father, Aang would end his life. Aang reluctantly agreed to the request."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Zuko_(Summer_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Zuko_(Summer_100_AG).html",
    "page": "History_of_Zuko_(Summer_100_AG)",
    "title": "History of Zuko (Summer 100 AG)"
  }
}