{
  "categories": [
    {
      "body": "Sokka",
      "target": {
        "href": "Category_Sokka",
        "page": "Category_Sokka"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} and the rest of ${link_1} traveled to the ${link_2}, disguised themselves as Fire Nation ${link_3}, and made necessary preparations for the ${link_4}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "citizens",
          "key": "${link_3}",
          "target": {
            "href": "Society_in_the_World_of_Avatar",
            "page": "Society_in_the_World_of_Avatar"
          }
        },
        {
          "body": "invasion",
          "key": "${link_4}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "text": "Sokka and the rest of Team Avatar traveled to the Fire Nation, disguised themselves as Fire Nation citizens, and made necessary preparations for the invasion."
    },
    {
      "body": "${link_0} explaining things to ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Sokka explaining things to Aang."
    },
    {
      "body": "When ${link_0} awoke from his coma on a ${link_1}, Sokka informed him of the team's excursions after he was ${link_2} by ${link_3}. They had returned to ${link_4} where Sokka reunited with ${link_5} and the other ${link_6} ${link_7}. They managed to successfully capture a Fire Nation ship, allowing them to continue their travels under minimal suspicion. Sokka explained that the ${link_8} and ${link_9} had decided to travel the world in disguise, and mentioned that they had recently traversed the ${link_10}. According to Sokka, although their forces were greatly outnumbered for the invasion, they had one clear advantage: the world believed the ${link_11} to be dead, and thus would not hunt for him any longer. However, Aang did not take this revelation well at all, believing this marked the second letdown by the Avatar. Discouraged, he ran away for a short time, only to be found by his friends shortly after. He, Sokka, and the other team members departed from the rest of the Water Tribe warriors, resolving to rejoin them on the ${link_12}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Fire Nation ship",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_cruiser",
            "page": "Fire_Nation_cruiser"
          }
        },
        {
          "body": "injured",
          "key": "${link_2}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        },
        {
          "body": "Azula",
          "key": "${link_3}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Chameleon Bay",
          "key": "${link_4}",
          "target": {
            "href": "Chameleon_Bay",
            "page": "Chameleon_Bay"
          }
        },
        {
          "body": "his father",
          "key": "${link_5}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_6}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "warriors",
          "key": "${link_7}",
          "target": {
            "href": "Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_8}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Bosco",
          "key": "${link_9}",
          "target": {
            "href": "Bosco",
            "page": "Bosco"
          }
        },
        {
          "body": "Serpent's Pass",
          "key": "${link_10}",
          "target": {
            "href": "Serpent%27s_Pass",
            "page": "Serpent%27s_Pass"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_11}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Day of Black Sun",
          "key": "${link_12}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        }
      ],
      "text": "When Aang awoke from his coma on a Fire Nation ship, Sokka informed him of the team's excursions after he was injured by Azula. They had returned to Chameleon Bay where Sokka reunited with his father and the other Water Tribe warriors. They managed to successfully capture a Fire Nation ship, allowing them to continue their travels under minimal suspicion. Sokka explained that the Earth King and Bosco had decided to travel the world in disguise, and mentioned that they had recently traversed the Serpent's Pass. According to Sokka, although their forces were greatly outnumbered for the invasion, they had one clear advantage: the world believed the Avatar to be dead, and thus would not hunt for him any longer. However, Aang did not take this revelation well at all, believing this marked the second letdown by the Avatar. Discouraged, he ran away for a short time, only to be found by his friends shortly after. He, Sokka, and the other team members departed from the rest of the Water Tribe warriors, resolving to rejoin them on the Day of Black Sun."
    },
    {
      "body": "\"Those are 'enemy' birds.\"",
      "links": [],
      "text": "\"Those are 'enemy' birds.\""
    },
    {
      "body": "Sokka and the others proceeded to enter the Fire Nation, using a combination of ${link_0} and ${link_1} to hide ${link_2} in a cloud. Sokka appeared exceedingly cautious about having infiltrated enemy territory, even branding some harmless ${link_3} as enemy birds, much to the team's amusement. They took temporary shelter in a ${link_4} before seeking out new clothes with which they could blend into the Fire Nation. After stealing outfits from an unattended clothesline, they went to a nearby ${link_5} to buy suitable accessories. In town, the group attempted to act natural, which was somewhat impeded by Aang, who, having visited the Fire Nation a century before, claimed to be an expert of their customs, even though his ${link_6} was obviously outdated. While Sokka and the others attended a restaurant that only served meat, Aang remained on his own, expressing discomfort due to his vegetarianism. While unaccompanied, however, he was brought to a local ${link_7} by truant officers. Aang returned to the cave at nightfall, relieving Katara, Sokka, and ${link_8}, who were evidently worried by his long absence. They were shocked upon learning that he had been attending a ${link_9}; when he claimed that he enjoyed the experience and wished to return to the school the next day, Sokka strongly objected. Aang eventually persuaded him otherwise by pointing out that it was an opportunity to learn information on the Fire Nation, specifically mentioning a \"secret river\" they were going to learn about that led to ${link_10} ${link_11}'s palace. Sokka reluctantly agreed to allowing Aang to return, stating that \"[he] was a fan of secret rivers\".",
      "links": [
        {
          "body": "waterbending",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "airbending",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Appa",
          "key": "${link_2}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "toucan puffins",
          "key": "${link_3}",
          "target": {
            "href": "Toucan_puffin",
            "page": "Toucan_puffin"
          }
        },
        {
          "body": "cave",
          "key": "${link_4}",
          "target": {
            "href": "Beach_cave",
            "page": "Beach_cave"
          }
        },
        {
          "body": "town",
          "key": "${link_5}",
          "target": {
            "href": "Fire_Nation_bazaar",
            "page": "Fire_Nation_bazaar"
          }
        },
        {
          "body": "slang",
          "key": "${link_6}",
          "target": {
            "href": "Slang_in_the_World_of_Avatar",
            "page": "Slang_in_the_World_of_Avatar"
          }
        },
        {
          "body": "school",
          "key": "${link_7}",
          "target": {
            "href": "Fire_Nation_school",
            "page": "Fire_Nation_school"
          }
        },
        {
          "body": "Toph",
          "key": "${link_8}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Fire Nation school",
          "key": "${link_9}",
          "target": {
            "href": "Fire_Nation_school",
            "page": "Fire_Nation_school"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_10}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_11}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Sokka and the others proceeded to enter the Fire Nation, using a combination of waterbending and airbending to hide Appa in a cloud. Sokka appeared exceedingly cautious about having infiltrated enemy territory, even branding some harmless toucan puffins as enemy birds, much to the team's amusement. They took temporary shelter in a cave before seeking out new clothes with which they could blend into the Fire Nation. After stealing outfits from an unattended clothesline, they went to a nearby town to buy suitable accessories. In town, the group attempted to act natural, which was somewhat impeded by Aang, who, having visited the Fire Nation a century before, claimed to be an expert of their customs, even though his slang was obviously outdated. While Sokka and the others attended a restaurant that only served meat, Aang remained on his own, expressing discomfort due to his vegetarianism. While unaccompanied, however, he was brought to a local school by truant officers. Aang returned to the cave at nightfall, relieving Katara, Sokka, and Toph, who were evidently worried by his long absence. They were shocked upon learning that he had been attending a Fire Nation school; when he claimed that he enjoyed the experience and wished to return to the school the next day, Sokka strongly objected. Aang eventually persuaded him otherwise by pointing out that it was an opportunity to learn information on the Fire Nation, specifically mentioning a \"secret river\" they were going to learn about that led to Fire Lord Ozai's palace. Sokka reluctantly agreed to allowing Aang to return, stating that \"[he] was a fan of secret rivers\"."
    },
    {
      "body": "Aang got into trouble for supposedly victimizing ${link_0}, a favored student of the ${link_1}, resulting in a parent-teacher conference. Sokka and Katara attended the conference acting as Aang's parents, \"Mr. Wang Fire\" and \"Mrs. Sapphire Fire\". While they managed to succeed in fooling the teacher, Sokka was against Aang returning to school. Aang therefore planned to hold a secret dance party in the cave for everyone in the school, wishing to give the new generation a taste of freedom. After the dance party was crashed by the headmaster, the group fled on Appa. As they left, they surprised a small ${link_2} by ${link_3} the tunnel shut.",
      "links": [
        {
          "body": "Hide",
          "key": "${link_0}",
          "target": {
            "href": "Hide",
            "page": "Hide"
          }
        },
        {
          "body": "Headmaster",
          "key": "${link_1}",
          "target": {
            "href": "Headmaster",
            "page": "Headmaster"
          }
        },
        {
          "body": "Fire Nation kid",
          "key": "${link_2}",
          "target": {
            "href": "Shoji",
            "page": "Shoji"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_3}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Aang got into trouble for supposedly victimizing Hide, a favored student of the Headmaster, resulting in a parent-teacher conference. Sokka and Katara attended the conference acting as Aang's parents, \"Mr. Wang Fire\" and \"Mrs. Sapphire Fire\". While they managed to succeed in fooling the teacher, Sokka was against Aang returning to school. Aang therefore planned to hold a secret dance party in the cave for everyone in the school, wishing to give the new generation a taste of freedom. After the dance party was crashed by the headmaster, the group fled on Appa. As they left, they surprised a small Fire Nation kid by earthbending the tunnel shut."
    },
    {
      "body": "${link_0} as \"Wang Fire\".",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Sokka as \"Wang Fire\"."
    },
    {
      "body": "The group journeyed to the fishing village of ${link_0}, which was in a deep depression. Many villagers were sick, and there was a lack of food due to water pollution caused by a nearby ${link_1}. Katara wished to help the people, but Sokka argued that their overall mission was too important for the team to become preoccupied with helping every needy group they encountered. That night, Sokka tried to rearrange their schedule to compensate for the time lost during their detour in the village. In the morning, Appa was found lying on his side, seemingly ill and his tongue an unnatural purple color. The team visited the village, seeking medicinal herbs for the bison where they found the villagers in higher spirits than before. The shop keeper, ${link_2}, said that the ${link_3}, a local river spirit, had come during the night and delivered food and medicine to the town. Sokka skeptically noted that the Painted Lady's work would be all for nothing unless she consistently helped the settlement, being that the factory was still present, and jokingly suggested that the spirit use her \"spirit magic\" to destroy it. Unaware that Katara had been impersonating the Painted Lady and secretly aiding the village, his suggestion prompted the waterbender to actually demolish the factory that night with the help of Aang. Katara and Aang quietly returned to the camp in the morning only to find Sokka and Toph waiting for them, the latter two having discovered the truth of Katara's actions. Angered by her deception, Sokka declared that they would leave the village immediately. As they prepared to depart, however, they saw a squad of Fire Nation troops heading toward the town on ${link_4}, and realized that the soldiers believed the villagers had sabotaged the factory. Katara determinedly resolved to stop them, and despite their argument, Sokka readily agreed to help her once he saw that she was set on helping. Katara, with help from Sokka, Aang, Toph, and Appa, drove the Fire Nation troops from the village permanently, and later helped the village clean up the polluted river.",
      "links": [
        {
          "body": "Jang Hui",
          "key": "${link_0}",
          "target": {
            "href": "Jang_Hui",
            "page": "Jang_Hui"
          }
        },
        {
          "body": "Fire Nation Army factory",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_Army_factory",
            "page": "Fire_Nation_Army_factory"
          }
        },
        {
          "body": "Xu",
          "key": "${link_2}",
          "target": {
            "href": "Dock/Xu/Bushi",
            "page": "Dock/Xu/Bushi"
          }
        },
        {
          "body": "Painted Lady",
          "key": "${link_3}",
          "target": {
            "href": "Painted_Lady",
            "page": "Painted_Lady"
          }
        },
        {
          "body": "jet skis",
          "key": "${link_4}",
          "target": {
            "href": "Jet_ski",
            "page": "Jet_ski"
          }
        }
      ],
      "text": "The group journeyed to the fishing village of Jang Hui, which was in a deep depression. Many villagers were sick, and there was a lack of food due to water pollution caused by a nearby Fire Nation Army factory. Katara wished to help the people, but Sokka argued that their overall mission was too important for the team to become preoccupied with helping every needy group they encountered. That night, Sokka tried to rearrange their schedule to compensate for the time lost during their detour in the village. In the morning, Appa was found lying on his side, seemingly ill and his tongue an unnatural purple color. The team visited the village, seeking medicinal herbs for the bison where they found the villagers in higher spirits than before. The shop keeper, Xu, said that the Painted Lady, a local river spirit, had come during the night and delivered food and medicine to the town. Sokka skeptically noted that the Painted Lady's work would be all for nothing unless she consistently helped the settlement, being that the factory was still present, and jokingly suggested that the spirit use her \"spirit magic\" to destroy it. Unaware that Katara had been impersonating the Painted Lady and secretly aiding the village, his suggestion prompted the waterbender to actually demolish the factory that night with the help of Aang. Katara and Aang quietly returned to the camp in the morning only to find Sokka and Toph waiting for them, the latter two having discovered the truth of Katara's actions. Angered by her deception, Sokka declared that they would leave the village immediately. As they prepared to depart, however, they saw a squad of Fire Nation troops heading toward the town on jet skis, and realized that the soldiers believed the villagers had sabotaged the factory. Katara determinedly resolved to stop them, and despite their argument, Sokka readily agreed to help her once he saw that she was set on helping. Katara, with help from Sokka, Aang, Toph, and Appa, drove the Fire Nation troops from the village permanently, and later helped the village clean up the polluted river."
    },
    {
      "body": "${link_0} making ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "his sword",
          "key": "${link_1}",
          "target": {
            "href": "Sokka%27s_sword",
            "page": "Sokka%27s_sword"
          }
        }
      ],
      "text": "Sokka making his sword."
    },
    {
      "body": "The group later settled outside the town of ${link_0} to watch a ${link_1} shower when a meteorite suddenly landed near the town. The resulting fire from the collision prompted Team Avatar into action with Toph, Aang, and Katara extinguishing the fire using their various bending abilities; Sokka, however, could do little other than watch over ${link_2} as this was ongoing. The next day, while the group ate in Shu Jing, Sokka seemed downcast. He revealed that he felt ordinary and, by extension, inferior, compared to the others, who exhibited such amazing abilities. In an attempt to console the warrior, Katara suggested the group go shopping at a local weaponry store, which cheered Sokka up noticeably. While trying out various weapons, Sokka came across an ornate sword which, according to the shopkeeper, was crafted by the best sword maker and swordsman in Fire Nation history, ${link_3}. Katara suggested that Sokka seek out the master's help, as all the other team members had been trained under mentors.",
      "links": [
        {
          "body": "Shu Jing",
          "key": "${link_0}",
          "target": {
            "href": "Shu_Jing",
            "page": "Shu_Jing"
          }
        },
        {
          "body": "meteor",
          "key": "${link_1}",
          "target": {
            "href": "Meteor",
            "page": "Meteor"
          }
        },
        {
          "body": "Momo",
          "key": "${link_2}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        },
        {
          "body": "Piandao",
          "key": "${link_3}",
          "target": {
            "href": "Piandao",
            "page": "Piandao"
          }
        }
      ],
      "text": "The group later settled outside the town of Shu Jing to watch a meteor shower when a meteorite suddenly landed near the town. The resulting fire from the collision prompted Team Avatar into action with Toph, Aang, and Katara extinguishing the fire using their various bending abilities; Sokka, however, could do little other than watch over Momo as this was ongoing. The next day, while the group ate in Shu Jing, Sokka seemed downcast. He revealed that he felt ordinary and, by extension, inferior, compared to the others, who exhibited such amazing abilities. In an attempt to console the warrior, Katara suggested the group go shopping at a local weaponry store, which cheered Sokka up noticeably. While trying out various weapons, Sokka came across an ornate sword which, according to the shopkeeper, was crafted by the best sword maker and swordsman in Fire Nation history, Piandao. Katara suggested that Sokka seek out the master's help, as all the other team members had been trained under mentors."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Piandao",
          "key": "${link_1}",
          "target": {
            "href": "Piandao",
            "page": "Piandao"
          }
        }
      ],
      "text": "Sokka and Piandao."
    },
    {
      "body": "Resolving to do so, Sokka paid a visit to ${link_0} where he was greeted by the ${link_1}. The butler informed him that Piandao often turned away those who applied for tutelage, but allowed Sokka to present his case regardless. Entering the room where the swordsman was practicing calligraphy, Sokka introduced himself and, when suspected by Piandao of having come out of arrogant pride in his fighting skill, confessed that he felt worthless, despite having traveled the world. His words were met with Piandao's invitation for them to see just how worthy he was and his agreement to train Sokka. Piandao offered several training exercises meant to build skills outside of mere use of the sword; tasks Sokka performed included painting a landscape he was able to view for only a few seconds to teach him to grasp the landscape in the heat of battle, and rock gardening to teach him to manipulate the landscape in his favor. At the end of the day, Sokka felt he had botched every exercise, but Piandao disagreed; he argued that though he had messed up in every exercise, he did so in a very \"special\" way, exhibiting cunning, creativity, and spirit in each.",
      "links": [
        {
          "body": "Piandao's castle",
          "key": "${link_0}",
          "target": {
            "href": "Piandao%27s_castle",
            "page": "Piandao%27s_castle"
          }
        },
        {
          "body": "butler",
          "key": "${link_1}",
          "target": {
            "href": "Fat",
            "page": "Fat"
          }
        }
      ],
      "text": "Resolving to do so, Sokka paid a visit to Piandao's castle where he was greeted by the butler. The butler informed him that Piandao often turned away those who applied for tutelage, but allowed Sokka to present his case regardless. Entering the room where the swordsman was practicing calligraphy, Sokka introduced himself and, when suspected by Piandao of having come out of arrogant pride in his fighting skill, confessed that he felt worthless, despite having traveled the world. His words were met with Piandao's invitation for them to see just how worthy he was and his agreement to train Sokka. Piandao offered several training exercises meant to build skills outside of mere use of the sword; tasks Sokka performed included painting a landscape he was able to view for only a few seconds to teach him to grasp the landscape in the heat of battle, and rock gardening to teach him to manipulate the landscape in his favor. At the end of the day, Sokka felt he had botched every exercise, but Piandao disagreed; he argued that though he had messed up in every exercise, he did so in a very \"special\" way, exhibiting cunning, creativity, and spirit in each."
    },
    {
      "body": "Therefore, after only the first day, Piandao told Sokka that he was ready to possess a real sword. However, rather than giving Sokka one of his own, Piandao announced that the warrior would craft his own sword, since it was an extension of himself. Rather than using materials on hand, Sokka opted to bring his own material. He returned to the group, who greeted him ecstatically after his long absence, and enlisted their help to roll the meteorite which fell the day before to the mansion of the master. Once this was done, Sokka and Piandao broke the meteorite into smaller pieces, melted them, and forged the sword. As soon as it was completed, Piandao presented Sokka with the finished blade, a black blade due to the unique material used to forge it. He proclaimed that Sokka had been the most worthy apprentice he had ever trained. At this, Sokka could no longer bear to uphold the lie he had told, as being a Fire Nation citizen, and revealed his true identity and origin to the master.",
      "links": [],
      "text": "Therefore, after only the first day, Piandao told Sokka that he was ready to possess a real sword. However, rather than giving Sokka one of his own, Piandao announced that the warrior would craft his own sword, since it was an extension of himself. Rather than using materials on hand, Sokka opted to bring his own material. He returned to the group, who greeted him ecstatically after his long absence, and enlisted their help to roll the meteorite which fell the day before to the mansion of the master. Once this was done, Sokka and Piandao broke the meteorite into smaller pieces, melted them, and forged the sword. As soon as it was completed, Piandao presented Sokka with the finished blade, a black blade due to the unique material used to forge it. He proclaimed that Sokka had been the most worthy apprentice he had ever trained. At this, Sokka could no longer bear to uphold the lie he had told, as being a Fire Nation citizen, and revealed his true identity and origin to the master."
    },
    {
      "body": "${link_0} ready to fight.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Sokka ready to fight."
    },
    {
      "body": "Piandao seemingly appeared dismayed upon learning this truth and attacked Sokka without warning, although the latter was quickly able to defend himself. The other team members moved to aid him; however, Sokka told them not to interfere, as this was his fight. The two moved to the dueling grounds, where Sokka deftly avoided the man's strikes, using various tactics he had learned like manipulating the environment, fighting from the high ground, utilizing his superior agility, and blinding the master, with Piandao complimenting his pupil several times for all the reasons. Piandao finally disarmed Sokka, but when the others moved to help him, Piandao relented with a smile and divulged that he was a little old to fight the Avatar, surprising the team. The master said that he had known Sokka was from the Water Tribe upon first meeting him, and lightly suggested that Sokka consider using a less ethnically-associated name, such as Lee, which he comically stated to be a popular name. He also told Sokka, when asked why he trained him if he knew the truth, that \"the way of the sword\" did not belong to one nation alone just as it did not belong to a single person. He encouraged Sokka to train every day, saying that if he continued to walk that path, he would become an even greater master than he himself was. When leaving, Sokka was given a ${link_0} tile, the ${link_1}, by Piandao. Sokka later presented Toph with a fragment of the meteorite that he had saved, as a small gift, which she later molded into a bracelet.",
      "links": [
        {
          "body": "Pai Sho",
          "key": "${link_0}",
          "target": {
            "href": "Pai_Sho",
            "page": "Pai_Sho"
          }
        },
        {
          "body": "white lotus",
          "key": "${link_1}",
          "target": {
            "href": "Pai_Sho#White_lotus_tile",
            "page": "Pai_Sho"
          }
        }
      ],
      "text": "Piandao seemingly appeared dismayed upon learning this truth and attacked Sokka without warning, although the latter was quickly able to defend himself. The other team members moved to aid him; however, Sokka told them not to interfere, as this was his fight. The two moved to the dueling grounds, where Sokka deftly avoided the man's strikes, using various tactics he had learned like manipulating the environment, fighting from the high ground, utilizing his superior agility, and blinding the master, with Piandao complimenting his pupil several times for all the reasons. Piandao finally disarmed Sokka, but when the others moved to help him, Piandao relented with a smile and divulged that he was a little old to fight the Avatar, surprising the team. The master said that he had known Sokka was from the Water Tribe upon first meeting him, and lightly suggested that Sokka consider using a less ethnically-associated name, such as Lee, which he comically stated to be a popular name. He also told Sokka, when asked why he trained him if he knew the truth, that \"the way of the sword\" did not belong to one nation alone just as it did not belong to a single person. He encouraged Sokka to train every day, saying that if he continued to walk that path, he would become an even greater master than he himself was. When leaving, Sokka was given a Pai Sho tile, the white lotus, by Piandao. Sokka later presented Toph with a fragment of the meteorite that he had saved, as a small gift, which she later molded into a bracelet."
    },
    {
      "body": "While relaxing in an ${link_0}, Aang unknowingly revealed his identity as the Avatar to two Fire Nation soldiers patrolling the area. The soldiers sent a message to the Fire Lord on a ${link_1} upon this discovery. However, the hawk was attacked during its journey, its message being intercepted by a ${link_2} and delivered to an assassin, later deemed ${link_3}, hired by Prince Zuko to eliminate Aang. The assassin successfully located the group and launched a sudden attack on them while they slept, although they all managed to escape on Appa.",
      "links": [
        {
          "body": "isolated quarry",
          "key": "${link_0}",
          "target": {
            "href": "Secluded_hot_springs",
            "page": "Secluded_hot_springs"
          }
        },
        {
          "body": "messenger hawk",
          "key": "${link_1}",
          "target": {
            "href": "Messenger_hawk",
            "page": "Messenger_hawk"
          }
        },
        {
          "body": "raven eagle",
          "key": "${link_2}",
          "target": {
            "href": "Raven_eagle",
            "page": "Raven_eagle"
          }
        },
        {
          "body": "Combustion Man",
          "key": "${link_3}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        }
      ],
      "text": "While relaxing in an isolated quarry, Aang unknowingly revealed his identity as the Avatar to two Fire Nation soldiers patrolling the area. The soldiers sent a message to the Fire Lord on a messenger hawk upon this discovery. However, the hawk was attacked during its journey, its message being intercepted by a raven eagle and delivered to an assassin, later deemed Combustion Man, hired by Prince Zuko to eliminate Aang. The assassin successfully located the group and launched a sudden attack on them while they slept, although they all managed to escape on Appa."
    },
    {
      "body": "Sokka and the others later journeyed to ${link_0}'s old home, known simply as ${link_1}. Aang meditated there and entered the ${link_2}, where Avatar Roku shared his history with him. When asked at one point if the Spirit World had bathrooms, Sokka replied that it did not. He later joined the team members in holding hands as a testament to their friendships with one another.",
      "links": [
        {
          "body": "Roku",
          "key": "${link_0}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Roku's island",
          "key": "${link_1}",
          "target": {
            "href": "Roku%27s_island",
            "page": "Roku%27s_island"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Sokka and the others later journeyed to Roku's old home, known simply as Roku's island. Aang meditated there and entered the Spirit World, where Avatar Roku shared his history with him. When asked at one point if the Spirit World had bathrooms, Sokka replied that it did not. He later joined the team members in holding hands as a testament to their friendships with one another."
    },
    {
      "body": "${link_0} aiding ${link_1} in her scams for money.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Sokka aiding Toph in her scams for money."
    },
    {
      "body": "When the group came to the ${link_0}, Toph began habitually scamming the locals for money. While this started a feud between her and a highly disapproving Katara, Sokka and Aang willingly joined Toph in her stings and reaped in the rewards. Sokka used some of the money to buy a ${link_1} which he named ${link_2}. However, shortly afterward, he found a wanted poster for Toph, who had been branded \"The Runaway\", hanging in the public square. He tore it down frantically and later showed it to Toph as a way of warning her against her deceitful actions. Toph, however, was delighted at the nickname and the amount of money being offered for her capture; using money as a bribe, she encouraged Sokka to remain silent about the poster to the rest of the team. Following an argument that later erupted after Katara's discovery of the wanted poster, Sokka spoke to Toph to try to mend the rift between her and Katara. Unaware that she was bathing in the water directly below the cliff on which they sat, they discussed how Katara's motherly instincts helped them. Sokka revealed that after their mother's death, Katara held the family together and took on many responsibilities, filling the void left in their mother's absence; he confessed that her care was to the extent that whenever he tried remembering what his mother physically looked like, all he could picture was Katara. This heartfelt discussion ultimately allowed Toph and Katara to make amends. When the group was later found by ${link_3}, they were forced to flee once more.",
      "links": [
        {
          "body": "Fire Fountain City",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Fountain_City",
            "page": "Fire_Fountain_City"
          }
        },
        {
          "body": "messenger hawk",
          "key": "${link_1}",
          "target": {
            "href": "Messenger_hawk",
            "page": "Messenger_hawk"
          }
        },
        {
          "body": "Hawky",
          "key": "${link_2}",
          "target": {
            "href": "Hawky",
            "page": "Hawky"
          }
        },
        {
          "body": "Combustion Man",
          "key": "${link_3}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        }
      ],
      "text": "When the group came to the Fire Fountain City, Toph began habitually scamming the locals for money. While this started a feud between her and a highly disapproving Katara, Sokka and Aang willingly joined Toph in her stings and reaped in the rewards. Sokka used some of the money to buy a messenger hawk which he named Hawky. However, shortly afterward, he found a wanted poster for Toph, who had been branded \"The Runaway\", hanging in the public square. He tore it down frantically and later showed it to Toph as a way of warning her against her deceitful actions. Toph, however, was delighted at the nickname and the amount of money being offered for her capture; using money as a bribe, she encouraged Sokka to remain silent about the poster to the rest of the team. Following an argument that later erupted after Katara's discovery of the wanted poster, Sokka spoke to Toph to try to mend the rift between her and Katara. Unaware that she was bathing in the water directly below the cliff on which they sat, they discussed how Katara's motherly instincts helped them. Sokka revealed that after their mother's death, Katara held the family together and took on many responsibilities, filling the void left in their mother's absence; he confessed that her care was to the extent that whenever he tried remembering what his mother physically looked like, all he could picture was Katara. This heartfelt discussion ultimately allowed Toph and Katara to make amends. When the group was later found by Combustion Man, they were forced to flee once more."
    },
    {
      "body": "Later, the gang traveled to a mysterious ${link_0} where there had been reports of several disappearances of local residents. An old innkeeper, ${link_1}, kindly offered them shelter at her ${link_2}; however, Sokka became highly suspicious of the elderly woman. His suspicion temporarily dissipated when he and the rest discovered that Hama originated from the Southern Water Tribe and had been a prisoner of the Fire Nation for many years. However, his skepticism was renewed upon discovering that Hama was secretly behind the strange kidnappings of the villagers. He and Aang assisted Katara in dueling Hama and she was eventually arrested, for the second time.",
      "links": [
        {
          "body": "village",
          "key": "${link_0}",
          "target": {
            "href": "Hama%27s_village",
            "page": "Hama%27s_village"
          }
        },
        {
          "body": "Hama",
          "key": "${link_1}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "inn",
          "key": "${link_2}",
          "target": {
            "href": "Hama%27s_inn",
            "page": "Hama%27s_inn"
          }
        }
      ],
      "text": "Later, the gang traveled to a mysterious village where there had been reports of several disappearances of local residents. An old innkeeper, Hama, kindly offered them shelter at her inn; however, Sokka became highly suspicious of the elderly woman. His suspicion temporarily dissipated when he and the rest discovered that Hama originated from the Southern Water Tribe and had been a prisoner of the Fire Nation for many years. However, his skepticism was renewed upon discovering that Hama was secretly behind the strange kidnappings of the villagers. He and Aang assisted Katara in dueling Hama and she was eventually arrested, for the second time."
    },
    {
      "body": "Several weeks later, Sokka and the gang arrived at the ${link_0}, a small uninhabited island where the entire invasion force would assemble on the ${link_1}. They had arrived four days prior to the day of the invasion, during which time Aang suffered from lack of sleep and hallucinations as he worried about his upcoming duel with ${link_2} ${link_3}. Along with Katara and Toph, Sokka attempted to help Aang by acting as his therapist, donning the same beard and mustache from his disguise as \"Wang Fire\". The group was eventually successful in putting Aang's fears to rest, assuring him that he was in fact ready for the battle due to his extensive bending prowess.",
      "links": [
        {
          "body": "Black Cliffs",
          "key": "${link_0}",
          "target": {
            "href": "Black_Cliffs",
            "page": "Black_Cliffs"
          }
        },
        {
          "body": "Day of Black Sun",
          "key": "${link_1}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_3}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Several weeks later, Sokka and the gang arrived at the Black Cliffs, a small uninhabited island where the entire invasion force would assemble on the Day of Black Sun. They had arrived four days prior to the day of the invasion, during which time Aang suffered from lack of sleep and hallucinations as he worried about his upcoming duel with Fire Lord Ozai. Along with Katara and Toph, Sokka attempted to help Aang by acting as his therapist, donning the same beard and mustache from his disguise as \"Wang Fire\". The group was eventually successful in putting Aang's fears to rest, assuring him that he was in fact ready for the battle due to his extensive bending prowess."
    },
    {
      "body": "${link_0}'s speech.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Sokka's speech."
    },
    {
      "body": "On the Day of Black Sun, the entire invasion force arrived at the Black Cliffs, led by Sokka's father, ${link_0}. The invasion force comprised of many of the team's old allies, among them ${link_1}, ${link_2}, ${link_3}, the ${link_4}, and many others. The mechanist had, in fact, spent months designing and manufacturing various weapons for the invasion, although Sokka's original sketches had been \"hard to interpret\". Among these weapons were ${link_5}, ${link_6}, and ${link_7} for ${link_8} troops. The invasion force assembled for the announcement of the battle plans, which Sokka was to dictate; during the speech, however, he got stage fright in front of the crowd and let his father take over. Sokka felt ashamed of his performance, but Aang assured him that it was his actions on the battlefield that would really matter. Sokka, wearing the traditional ${link_9} of the Southern Water Tribe, led the invasion force alongside his friends, his father, and Bato toward the Fire Nation Capital, where they succeeded in destroying dozens of tanks and forcing the surprised ${link_10} to go on the defensive. When Hakoda was severely wounded while destroying a Fire Nation battlement, Sokka assumed the position as leader and piloted the invasion force in storming the Royal Plaza, displaying remarkable swordsmanship against the firebenders in the process. Meanwhile, Aang went off to face Fire Lord Ozai.",
      "links": [
        {
          "body": "Hakoda",
          "key": "${link_0}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Bato",
          "key": "${link_1}",
          "target": {
            "href": "Bato",
            "page": "Bato"
          }
        },
        {
          "body": "Haru",
          "key": "${link_2}",
          "target": {
            "href": "Haru",
            "page": "Haru"
          }
        },
        {
          "body": "Teo",
          "key": "${link_3}",
          "target": {
            "href": "Teo",
            "page": "Teo"
          }
        },
        {
          "body": "mechanist",
          "key": "${link_4}",
          "target": {
            "href": "Mechanist",
            "page": "Mechanist"
          }
        },
        {
          "body": "eclipse glasses",
          "key": "${link_5}",
          "target": {
            "href": "Eclipse_glasses",
            "page": "Eclipse_glasses"
          }
        },
        {
          "body": "submarines for underwater infiltration",
          "key": "${link_6}",
          "target": {
            "href": "Waterbending-powered_submarine",
            "page": "Waterbending-powered_submarine"
          }
        },
        {
          "body": "treaded tanks",
          "key": "${link_7}",
          "target": {
            "href": "Earthbending-powered_tank",
            "page": "Earthbending-powered_tank"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_8}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "armor",
          "key": "${link_9}",
          "target": {
            "href": "Water_Tribe_wolf_armor",
            "page": "Water_Tribe_wolf_armor"
          }
        },
        {
          "body": "firebenders",
          "key": "${link_10}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "On the Day of Black Sun, the entire invasion force arrived at the Black Cliffs, led by Sokka's father, Hakoda. The invasion force comprised of many of the team's old allies, among them Bato, Haru, Teo, the mechanist, and many others. The mechanist had, in fact, spent months designing and manufacturing various weapons for the invasion, although Sokka's original sketches had been \"hard to interpret\". Among these weapons were eclipse glasses, submarines for underwater infiltration, and treaded tanks for Earth Kingdom troops. The invasion force assembled for the announcement of the battle plans, which Sokka was to dictate; during the speech, however, he got stage fright in front of the crowd and let his father take over. Sokka felt ashamed of his performance, but Aang assured him that it was his actions on the battlefield that would really matter. Sokka, wearing the traditional armor of the Southern Water Tribe, led the invasion force alongside his friends, his father, and Bato toward the Fire Nation Capital, where they succeeded in destroying dozens of tanks and forcing the surprised firebenders to go on the defensive. When Hakoda was severely wounded while destroying a Fire Nation battlement, Sokka assumed the position as leader and piloted the invasion force in storming the Royal Plaza, displaying remarkable swordsmanship against the firebenders in the process. Meanwhile, Aang went off to face Fire Lord Ozai."
    },
    {
      "body": "${link_0} leading the ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "invasion",
          "key": "${link_1}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "text": "Sokka leading the invasion."
    },
    {
      "body": "Sokka continued to lead the invasion force while ${link_0} healed their wounded father. Everything went well until Aang came back to tell them that Ozai was not at the ${link_1} and that the whole ${link_2} was deserted. Sokka quickly realized that the Fire Nation knew they were coming, and after everyone agreed that they must press on, Sokka and Toph accompanied Aang to the capital, where Sokka deduced that the Fire Lord may be hiding in an ${link_3}. Using her ${link_4}, Toph easily found it, much to Sokka's joy. However, it was Princess ${link_5} who was at the bunker, not the Fire Lord. She revealed that she knew about the invasion for months and that she deduced that Aang survived her lightning attack. However, Azula's ${link_6} was disabled by the eclipse, so Sokka demanded that she reveal the Fire Lord's true position. She refused, instead sending a pair of ${link_7} agents from ${link_8} to fight them. The group eventually defeated the agents, but Azula was very fast for them to defeat her. Sokka stopped his two friends from attacking, realizing that Azula was distracting them in the caves in order to waste their eclipse time, so they went off to find Ozai.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Royal Palace",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_Royal_Palace",
            "page": "Fire_Nation_Royal_Palace"
          }
        },
        {
          "body": "capital",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        },
        {
          "body": "underground bunker",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation_Capital#Fire_Lord.27s_Bunker",
            "page": "Fire_Nation_Capital"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_4}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Azula",
          "key": "${link_5}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "firebending",
          "key": "${link_6}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_7}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_8}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "Sokka continued to lead the invasion force while Katara healed their wounded father. Everything went well until Aang came back to tell them that Ozai was not at the Royal Palace and that the whole capital was deserted. Sokka quickly realized that the Fire Nation knew they were coming, and after everyone agreed that they must press on, Sokka and Toph accompanied Aang to the capital, where Sokka deduced that the Fire Lord may be hiding in an underground bunker. Using her earthbending, Toph easily found it, much to Sokka's joy. However, it was Princess Azula who was at the bunker, not the Fire Lord. She revealed that she knew about the invasion for months and that she deduced that Aang survived her lightning attack. However, Azula's firebending was disabled by the eclipse, so Sokka demanded that she reveal the Fire Lord's true position. She refused, instead sending a pair of Dai Li agents from Ba Sing Se to fight them. The group eventually defeated the agents, but Azula was very fast for them to defeat her. Sokka stopped his two friends from attacking, realizing that Azula was distracting them in the caves in order to waste their eclipse time, so they went off to find Ozai."
    },
    {
      "body": "${link_0} threatening ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Sokka threatening Azula."
    },
    {
      "body": "Suddenly, Azula revealed that she knew who Sokka was because her \"${link_0}\" used to insist that Sokka would one day rescue her. She also claimed that she gave up on him because he never came. Sokka immediately knew that she was referring to ${link_1}, his girlfriend from ${link_2}. Filled with rage, Sokka attacked Azula, and Toph narrowly stopped her from stabbing him with a knife. Sokka demanded that Azula reveal Suki's location, but she stood there silently. Suddenly, the eclipse ended and she escaped with her firebending, revealing Ozai's location. Sokka blamed himself for ruining the invasion, but his friends assured him that it was not his fault. When Aang insisted that he should fight the Fire Lord without the eclipse, Sokka convinced him not to, assuring him that there would be a next time.",
      "links": [
        {
          "body": "favorite prisoner",
          "key": "${link_0}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Suki",
          "key": "${link_1}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_2}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        }
      ],
      "text": "Suddenly, Azula revealed that she knew who Sokka was because her \"favorite prisoner\" used to insist that Sokka would one day rescue her. She also claimed that she gave up on him because he never came. Sokka immediately knew that she was referring to Suki, his girlfriend from Kyoshi Island. Filled with rage, Sokka attacked Azula, and Toph narrowly stopped her from stabbing him with a knife. Sokka demanded that Azula reveal Suki's location, but she stood there silently. Suddenly, the eclipse ended and she escaped with her firebending, revealing Ozai's location. Sokka blamed himself for ruining the invasion, but his friends assured him that it was not his fault. When Aang insisted that he should fight the Fire Lord without the eclipse, Sokka convinced him not to, assuring him that there would be a next time."
    },
    {
      "body": "Sokka informed the troops of Azula's trap and ordered an evacuation. A force of Fire Nation zeppelins showed up out of nowhere and destroyed the submarines long before the group could escape, so Hakoda, now mostly recovered, insisted that Sokka and all younger members of the group flee the country, while all the elder members surrendering. Sokka and Katara said farewell to their father and promised to come back as soon as possible to save them. Sokka, Katara, Aang, and all of their younger allies from the invasion force escaped to the ${link_0} on ${link_1}, where the group would seek temporary refuge until Azula's attack.",
      "links": [
        {
          "body": "Western Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Sokka informed the troops of Azula's trap and ordered an evacuation. A force of Fire Nation zeppelins showed up out of nowhere and destroyed the submarines long before the group could escape, so Hakoda, now mostly recovered, insisted that Sokka and all younger members of the group flee the country, while all the elder members surrendering. Sokka and Katara said farewell to their father and promised to come back as soon as possible to save them. Sokka, Katara, Aang, and all of their younger allies from the invasion force escaped to the Western Air Temple on Appa, where the group would seek temporary refuge until Azula's attack."
    },
    {
      "body": "Encountering ${link_0} again, with claims that he was a different person now who wanted to help them, Sokka showed distrust, and later rage, when Zuko clumsily let out that he sent Combustion Man after them. He openly threatened to attack Zuko if he did not leave.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Encountering Zuko again, with claims that he was a different person now who wanted to help them, Sokka showed distrust, and later rage, when Zuko clumsily let out that he sent Combustion Man after them. He openly threatened to attack Zuko if he did not leave."
    },
    {
      "body": "Later, when the assassin attacked the group, Sokka used his boomerang to defeat Combustion Man by calculating his trajectory. He allowed Zuko to join the team, trusting Aang's judgment on the matter. Even though Sokka voiced hanging around with Zuko \"was really weird\", he soon became much more comfortable with the matter, often the subject of his sarcastic remarks such as \"jerkbending\" and \"jumping into a volcano\".",
      "links": [],
      "text": "Later, when the assassin attacked the group, Sokka used his boomerang to defeat Combustion Man by calculating his trajectory. He allowed Zuko to join the team, trusting Aang's judgment on the matter. Even though Sokka voiced hanging around with Zuko \"was really weird\", he soon became much more comfortable with the matter, often the subject of his sarcastic remarks such as \"jerkbending\" and \"jumping into a volcano\"."
    },
    {
      "body": "${link_0} and ${link_1} on the ${link_2}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "balloon",
          "key": "${link_2}",
          "target": {
            "href": "Hot_air_balloon",
            "page": "Hot_air_balloon"
          }
        }
      ],
      "text": "Sokka and Zuko on the balloon."
    },
    {
      "body": "Zuko was serving the group tea while Sokka sulked in a corner. When Zuko came to bring him his tea, Sokka asked to speak to him alone. When ${link_0} joined him, Sokka asked where the Fire Nation would keep war prisoners, as many members of the Invasion Force were captured by the Fire Nation. Zuko first tried to avoid telling him, stating that \"knowing would just make [him] feel worse\". Eventually Zuko told him that his best guess would be the ${link_1} prison, a maximum-security facility located in the middle of a boiling lake in between the Fire Nation and where they are. When Zuko asked why Sokka is asking about it, Sokka only said that \"Just knowing makes me feel better\" and walked away with Zuko watching him. The following morning, Sokka woke up a few hours earlier than the others and sneaked quietly toward Appa. When he got there, he found Zuko waiting for him, unsurprised to see that he was leaving. Sokka admitted that he was going to the Boiling Rock. He said that, because the invasion plan was his idea, it was his responsibility to free the prisoners and that he \"needed his honor back\". Zuko replied he understood, and also that it was a bad idea to go alone and offered to go with him. At first, Sokka refused, until Zuko pointed out that it would be impossible to get there on Appa, and that they should instead take his ${link_2}. Sokka agreed, and the two of them set out to the Boiling Rock, leaving the others a letter saying they were out to get meat.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_1}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "war balloon",
          "key": "${link_2}",
          "target": {
            "href": "Hot_air_balloon",
            "page": "Hot_air_balloon"
          }
        }
      ],
      "text": "Zuko was serving the group tea while Sokka sulked in a corner. When Zuko came to bring him his tea, Sokka asked to speak to him alone. When Zuko joined him, Sokka asked where the Fire Nation would keep war prisoners, as many members of the Invasion Force were captured by the Fire Nation. Zuko first tried to avoid telling him, stating that \"knowing would just make [him] feel worse\". Eventually Zuko told him that his best guess would be the Boiling Rock prison, a maximum-security facility located in the middle of a boiling lake in between the Fire Nation and where they are. When Zuko asked why Sokka is asking about it, Sokka only said that \"Just knowing makes me feel better\" and walked away with Zuko watching him. The following morning, Sokka woke up a few hours earlier than the others and sneaked quietly toward Appa. When he got there, he found Zuko waiting for him, unsurprised to see that he was leaving. Sokka admitted that he was going to the Boiling Rock. He said that, because the invasion plan was his idea, it was his responsibility to free the prisoners and that he \"needed his honor back\". Zuko replied he understood, and also that it was a bad idea to go alone and offered to go with him. At first, Sokka refused, until Zuko pointed out that it would be impossible to get there on Appa, and that they should instead take his war balloon. Sokka agreed, and the two of them set out to the Boiling Rock, leaving the others a letter saying they were out to get meat."
    },
    {
      "body": "The two of them were awkward around each other at first while on the balloon. Eventually, they began talking more naturally about their histories. Sokka claimed that it must have been hard for Zuko to leave his home to help them. Zuko told him it was not hard, which surprised Sokka, who asked if there was anyone he left behind and cared about. Zuko stated that he had a girlfriend, Mai, to which Sokka became interested. Sokka stated that his first girlfriend turned into the moon, referring to Yue. Zuko responded by saying \"That's rough, buddy\", showing just how much his attitude had changed, the prime example being when Zuko disrespectfully referred to Sokka as a \"Water Tribe peasant\".",
      "links": [],
      "text": "The two of them were awkward around each other at first while on the balloon. Eventually, they began talking more naturally about their histories. Sokka claimed that it must have been hard for Zuko to leave his home to help them. Zuko told him it was not hard, which surprised Sokka, who asked if there was anyone he left behind and cared about. Zuko stated that he had a girlfriend, Mai, to which Sokka became interested. Sokka stated that his first girlfriend turned into the moon, referring to Yue. Zuko responded by saying \"That's rough, buddy\", showing just how much his attitude had changed, the prime example being when Zuko disrespectfully referred to Sokka as a \"Water Tribe peasant\"."
    },
    {
      "body": "They arrived at the Boiling Rock and the balloon started going down. Sokka realized that the air outside the balloon was just as hot as the air inside, so they could not fly. They crash landed the balloon by the side of the island. Sokka claimed that he figured this would happen and that they will find a way off the island. He pushed the destroyed balloon into the lake, since it did not work anymore and they could not let anyone find it.",
      "links": [],
      "text": "They arrived at the Boiling Rock and the balloon started going down. Sokka realized that the air outside the balloon was just as hot as the air inside, so they could not fly. They crash landed the balloon by the side of the island. Sokka claimed that he figured this would happen and that they will find a way off the island. He pushed the destroyed balloon into the lake, since it did not work anymore and they could not let anyone find it."
    },
    {
      "body": "They later sneaked into the prison. Inside, they found some guard uniforms and began posing as guards until they were called out into the yard. There, they found ${link_0} being harassed by a guard. Eventually, the guard provoked the prisoner into firebending, prompting him to be taken to the cooler. Sokka was ordered to help and told Zuko to meet him in an hour. He took note of the function of the cooler in how cold it was and how well it insulated against heat.",
      "links": [
        {
          "body": "Chit Sang",
          "key": "${link_0}",
          "target": {
            "href": "Chit_Sang",
            "page": "Chit_Sang"
          }
        }
      ],
      "text": "They later sneaked into the prison. Inside, they found some guard uniforms and began posing as guards until they were called out into the yard. There, they found Chit Sang being harassed by a guard. Eventually, the guard provoked the prisoner into firebending, prompting him to be taken to the cooler. Sokka was ordered to help and told Zuko to meet him in an hour. He took note of the function of the cooler in how cold it was and how well it insulated against heat."
    },
    {
      "body": "${link_0} and ${link_1} reunited.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Suki",
          "key": "${link_1}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        }
      ],
      "text": "Sokka and Suki reunited."
    },
    {
      "body": "Later, he met Zuko, who told him that he had been asking around the prison and there were no Water Tribe prisoners. Sokka at first became disheartened and figured he had once again failed until he saw Suki in the yard. He and Zuko decided to go meet her and form an escape plan. Sokka went to Suki's cell while Zuko stood guard outside. At first, Suki did not recognize Sokka and pushed him back when he tried to kiss her. When his helmet fell off, Suki realized who it was and they embraced. He told her that he was here to bust her out of prison. She told him how happy she was, to see him and that she never gave up hope that she would be saved. The two subsequently kissed.",
      "links": [],
      "text": "Later, he met Zuko, who told him that he had been asking around the prison and there were no Water Tribe prisoners. Sokka at first became disheartened and figured he had once again failed until he saw Suki in the yard. He and Zuko decided to go meet her and form an escape plan. Sokka went to Suki's cell while Zuko stood guard outside. At first, Suki did not recognize Sokka and pushed him back when he tried to kiss her. When his helmet fell off, Suki realized who it was and they embraced. He told her that he was here to bust her out of prison. She told him how happy she was, to see him and that she never gave up hope that she would be saved. The two subsequently kissed."
    },
    {
      "body": "${link_0} making his escape plan.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Sokka making his escape plan."
    },
    {
      "body": "Meanwhile, Zuko was caught by a guard. As Sokka was leaving the cell, he saw Zuko wrestling with her and helped the guard, knowing that they would have no chance of escape otherwise. He whispered to Zuko that he would figure something out. He met both Suki and Zuko later while they were on mopping duty. He told them that his plan for escape was to use the cooler as a boat to get off the island. He explained that the cooler made an ideal boat because of its way of insulating heat. He was overheard by Chit Sang who wanted in on the plan. The rest of them agreed and staged a fight between Chit Sang and Zuko to get Zuko in the Cooler to unbolt it. Later, Sokka met Zuko, who had unhooked it from its screws. While inside, they both heard that new prisoners would soon arrive. The two of them moved it to the lake with Suki. There, they met Chit Sang and his friends. They were all about to leave when Sokka, Zuko and Suki decided to stay behind to see if Hakoda was among them. Finally, after all of the prisoners had been unloaded, Sokka saw his father among them.",
      "links": [],
      "text": "Meanwhile, Zuko was caught by a guard. As Sokka was leaving the cell, he saw Zuko wrestling with her and helped the guard, knowing that they would have no chance of escape otherwise. He whispered to Zuko that he would figure something out. He met both Suki and Zuko later while they were on mopping duty. He told them that his plan for escape was to use the cooler as a boat to get off the island. He explained that the cooler made an ideal boat because of its way of insulating heat. He was overheard by Chit Sang who wanted in on the plan. The rest of them agreed and staged a fight between Chit Sang and Zuko to get Zuko in the Cooler to unbolt it. Later, Sokka met Zuko, who had unhooked it from its screws. While inside, they both heard that new prisoners would soon arrive. The two of them moved it to the lake with Suki. There, they met Chit Sang and his friends. They were all about to leave when Sokka, Zuko and Suki decided to stay behind to see if Hakoda was among them. Finally, after all of the prisoners had been unloaded, Sokka saw his father among them."
    },
    {
      "body": "Sokka joined the line of ${link_0} in the yard while the ${link_1} interviewed the new prisoners. Sokka witnessed Hakoda's insolence and secretly chuckled. Later, he met Hakoda in his cell and said that he was glad to see he was okay. Hakoda did not recognize him due to his uniform, so Sokka took off his helmet. The two had a touching reunion. Hakoda told him where the other prisoners were, as well as that he met the Kyoshi Warriors. The two of them began planning a new escape attempt. Sokka later went to Zuko's cell before Zuko was taken away by the guards to see Mai. Sokka also visited Suki again, and told her his and his father's plan was to start a prison riot as a distraction, commandeer the gondola, and take the warden hostage so they would not cut the line.",
      "links": [
        {
          "body": "guards",
          "key": "${link_0}",
          "target": {
            "href": "Gondola_guards",
            "page": "Gondola_guards"
          }
        },
        {
          "body": "warden",
          "key": "${link_1}",
          "target": {
            "href": "Warden_(Boiling_Rock)",
            "page": "Warden_(Boiling_Rock)"
          }
        }
      ],
      "text": "Sokka joined the line of guards in the yard while the warden interviewed the new prisoners. Sokka witnessed Hakoda's insolence and secretly chuckled. Later, he met Hakoda in his cell and said that he was glad to see he was okay. Hakoda did not recognize him due to his uniform, so Sokka took off his helmet. The two had a touching reunion. Hakoda told him where the other prisoners were, as well as that he met the Kyoshi Warriors. The two of them began planning a new escape attempt. Sokka later went to Zuko's cell before Zuko was taken away by the guards to see Mai. Sokka also visited Suki again, and told her his and his father's plan was to start a prison riot as a distraction, commandeer the gondola, and take the warden hostage so they would not cut the line."
    },
    {
      "body": "${link_0} reuniting with ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "his father",
          "key": "${link_1}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        }
      ],
      "text": "Sokka reuniting with his father."
    },
    {
      "body": "After he left Suki's cell, he was taken by the guards under orders from the warden. He was subsequently put into a lineup with his mask off so that ${link_0}, who had been tortured by the warden after getting caught, could identify him. However, the prisoner identified another guard instead. Sokka went to the technician operating the doors and told him he had orders from the warden to let the prisoners into the yard. When the guard questioned him, Sokka only said that the warden was being angry and irrational. Frightened, the guard opened the doors.",
      "links": [
        {
          "body": "Chit Sang",
          "key": "${link_0}",
          "target": {
            "href": "Chit_Sang",
            "page": "Chit_Sang"
          }
        }
      ],
      "text": "After he left Suki's cell, he was taken by the guards under orders from the warden. He was subsequently put into a lineup with his mask off so that Chit Sang, who had been tortured by the warden after getting caught, could identify him. However, the prisoner identified another guard instead. Sokka went to the technician operating the doors and told him he had orders from the warden to let the prisoners into the yard. When the guard questioned him, Sokka only said that the warden was being angry and irrational. Frightened, the guard opened the doors."
    },
    {
      "body": "Sokka met with Hakoda and Suki and told them that it was time to start a riot. After Hakoda failed in his attempt, Chit Sang met the three of them where he started one. They were joined shortly by Zuko. Suki climbed the wall up to the warden and took him prisoner while the others followed. The group made its way to the gondola and used the warden to get past the guards. As the gondola made its way across the lake, it was attacked by Azula and Ty Lee. When the two girls made their way to the roof, Zuko, Sokka, and Suki went up to meet them. While Suki fought ${link_0}, Sokka and Zuko dueled Azula.",
      "links": [
        {
          "body": "Ty Lee",
          "key": "${link_0}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "text": "Sokka met with Hakoda and Suki and told them that it was time to start a riot. After Hakoda failed in his attempt, Chit Sang met the three of them where he started one. They were joined shortly by Zuko. Suki climbed the wall up to the warden and took him prisoner while the others followed. The group made its way to the gondola and used the warden to get past the guards. As the gondola made its way across the lake, it was attacked by Azula and Ty Lee. When the two girls made their way to the roof, Zuko, Sokka, and Suki went up to meet them. While Suki fought Ty Lee, Sokka and Zuko dueled Azula."
    },
    {
      "body": "During the fight, the warden managed to untie his handcuffs and yelled at the guards to cut the line to prevent the prisoners from escaping. Azula and Ty Lee fled the gondola so they would not fall into the boiling water below. Mai, however, attacked the guards who were cutting the line to save Zuko, or \"the jerk who dumped her.\" After gondola made it across the lake, the group stole Azula's airship and traveled back to the Western Air Temple. Sokka and Zuko came back to the group and revealed that they had been to a Fire Nation prison, and when asked if they returned with meat, Sokka said that they had brought \"the meat of friendship and fatherhood\", and Hakoda, Suki, and Chit Sang stepped out of the ${link_0}.",
      "links": [
        {
          "body": "airship",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        }
      ],
      "text": "During the fight, the warden managed to untie his handcuffs and yelled at the guards to cut the line to prevent the prisoners from escaping. Azula and Ty Lee fled the gondola so they would not fall into the boiling water below. Mai, however, attacked the guards who were cutting the line to save Zuko, or \"the jerk who dumped her.\" After gondola made it across the lake, the group stole Azula's airship and traveled back to the Western Air Temple. Sokka and Zuko came back to the group and revealed that they had been to a Fire Nation prison, and when asked if they returned with meat, Sokka said that they had brought \"the meat of friendship and fatherhood\", and Hakoda, Suki, and Chit Sang stepped out of the airship."
    },
    {
      "body": "${link_0}, ${link_1}, and ${link_2} about to invade the ${link_3}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Suki",
          "key": "${link_2}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Fire Nation airships",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        }
      ],
      "text": "Sokka, Toph, and Suki about to invade the Fire Nation airships."
    },
    {
      "body": "During the final battle of the Hundred Year War, Sokka, along with Toph and Suki, were in charge of destroying the Fire Nation airship fleet. After successfully commandeering one of the airships, Sokka, posed as the captain and ordered all the crew members to gather at the bomb bay to celebrate a birthday. After everyone reported at the bomb bay, Sokka released the hatch in the floor, causing all of them to fall into the ocean below. The trio subsequently attempted to flag down Ozai's airship, but soon recognized this as a futile effort. Diverting his focus toward demolishing the air fleet, Sokka managed to steer the airship in a way that caused it to change course and collide with the other airships, destroying them. As Sokka, Suki, and Toph exited to the top of the ship to safety, it broke apart, causing Suki to be left behind.",
      "links": [],
      "text": "During the final battle of the Hundred Year War, Sokka, along with Toph and Suki, were in charge of destroying the Fire Nation airship fleet. After successfully commandeering one of the airships, Sokka, posed as the captain and ordered all the crew members to gather at the bomb bay to celebrate a birthday. After everyone reported at the bomb bay, Sokka released the hatch in the floor, causing all of them to fall into the ocean below. The trio subsequently attempted to flag down Ozai's airship, but soon recognized this as a futile effort. Diverting his focus toward demolishing the air fleet, Sokka managed to steer the airship in a way that caused it to change course and collide with the other airships, destroying them. As Sokka, Suki, and Toph exited to the top of the ship to safety, it broke apart, causing Suki to be left behind."
    },
    {
      "body": "At Suki's urging, Sokka and Toph continued their mission to annihilate the remaining airships. While doing so, however, they were confronted by Imperial Firebenders who promptly attacked. In escaping their attackers, the two fell off the airship. Sokka saved them both from death by breaking the fall with his sword, but hurt his leg in the process and left the two teetering precariously on a ledge. As Sokka held on to Toph, who was hanging from the ship, with one arm, Fire Nation soldiers surrounded them. Acting quickly, Sokka used his boomerang and his sword to knock over some of the guards, resulting in the loss of both weapons. It proved futile, as more guards arrived, prepared to strike. The two were saved, however, by an oncoming airship controlled by Suki. Sokka, Toph, and Suki managed to destroy all the airships, ceasing the attack on the ${link_0}. Afterward, Sokka, along with Toph and Suki, joined together to berate the now fallen Ozai and commented on how impressive Aang looked while fighting.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "At Suki's urging, Sokka and Toph continued their mission to annihilate the remaining airships. While doing so, however, they were confronted by Imperial Firebenders who promptly attacked. In escaping their attackers, the two fell off the airship. Sokka saved them both from death by breaking the fall with his sword, but hurt his leg in the process and left the two teetering precariously on a ledge. As Sokka held on to Toph, who was hanging from the ship, with one arm, Fire Nation soldiers surrounded them. Acting quickly, Sokka used his boomerang and his sword to knock over some of the guards, resulting in the loss of both weapons. It proved futile, as more guards arrived, prepared to strike. The two were saved, however, by an oncoming airship controlled by Suki. Sokka, Toph, and Suki managed to destroy all the airships, ceasing the attack on the Earth Kingdom. Afterward, Sokka, along with Toph and Suki, joined together to berate the now fallen Ozai and commented on how impressive Aang looked while fighting."
    },
    {
      "body": "${link_0} painting a portrait of ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Sokka painting a portrait of Team Avatar."
    },
    {
      "body": "After Ozai was defeated, all the war prisoners were released, and Sokka and Katara were once again reunited with their father. Suki and the freed Kyoshi Warriors arrived in full uniform, with Sokka remarking he had missed Suki's face paint. Upon noticing ${link_0} among the warriors, Sokka initially suspected her of being in disguise again and stepped in to warn and protect Suki. The latter informed him, however, to his shock, that Ty Lee had bonded with the warriors in prison and later joined them, becoming the first Kyoshi Warrior from the Fire Nation.",
      "links": [
        {
          "body": "Ty Lee",
          "key": "${link_0}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "text": "After Ozai was defeated, all the war prisoners were released, and Sokka and Katara were once again reunited with their father. Suki and the freed Kyoshi Warriors arrived in full uniform, with Sokka remarking he had missed Suki's face paint. Upon noticing Ty Lee among the warriors, Sokka initially suspected her of being in disguise again and stepped in to warn and protect Suki. The latter informed him, however, to his shock, that Ty Lee had bonded with the warriors in prison and later joined them, becoming the first Kyoshi Warrior from the Fire Nation."
    },
    {
      "body": "Later, Sokka accompanied his companions to the Earth Kingdom Royal Palace, coming up with a name for Earth King Kuei's plan for removing the Fire Nation colonies, calling it the \"${link_0}\". He was later seen with Aang, Katara, Toph, Mai, Zuko, Suki, and Iroh at the ${link_1}, all of whom, except Aang, were garbed in Earth Kingdom clothes. Sokka created a painting to capture the scene, but everyone noted that it was extremely crude - Katara's \"hair loopies\" looked like Momo's ears, Zuko's hair was too spiky, Mai looked like a man, Iroh's belly was too round, and Suki was inexplicably firebending, to which Sokka replied that it looked \"more exciting\". Only Toph, who of course could not see the painting, said that they \"all looked perfect\" and everyone laughed.",
      "links": [
        {
          "body": "Harmony Restoration Movement",
          "key": "${link_0}",
          "target": {
            "href": "Harmony_Restoration_Movement",
            "page": "Harmony_Restoration_Movement"
          }
        },
        {
          "body": "Jasmine Dragon",
          "key": "${link_1}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "text": "Later, Sokka accompanied his companions to the Earth Kingdom Royal Palace, coming up with a name for Earth King Kuei's plan for removing the Fire Nation colonies, calling it the \"Harmony Restoration Movement\". He was later seen with Aang, Katara, Toph, Mai, Zuko, Suki, and Iroh at the Jasmine Dragon, all of whom, except Aang, were garbed in Earth Kingdom clothes. Sokka created a painting to capture the scene, but everyone noted that it was extremely crude - Katara's \"hair loopies\" looked like Momo's ears, Zuko's hair was too spiky, Mai looked like a man, Iroh's belly was too round, and Suki was inexplicably firebending, to which Sokka replied that it looked \"more exciting\". Only Toph, who of course could not see the painting, said that they \"all looked perfect\" and everyone laughed."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Sokka_(Summer_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Sokka_(Summer_100_AG).html",
    "page": "History_of_Sokka_(Summer_100_AG)",
    "title": "History of Sokka (Summer 100 AG)"
  }
}