{
  "categories": [
    {
      "body": "A-class articles",
      "target": {
        "href": "Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "Katara",
      "target": {
        "href": "Category_Katara",
        "page": "Category_Katara"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "After mastering ${link_0} with the guidance of Master ${link_1}, ${link_2} left the ${link_3} with ${link_4} and ${link_5} and journeyed to the ${link_6} for the ${link_7} to master ${link_8}.",
      "links": [
        {
          "body": "waterbending",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Pakku",
          "key": "${link_1}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "North Pole",
          "key": "${link_3}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Aang",
          "key": "${link_4}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_5}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_6}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_7}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_8}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "After mastering waterbending with the guidance of Master Pakku, Katara left the North Pole with Aang and Sokka and journeyed to the Earth Kingdom for the Avatar to master earthbending."
    },
    {
      "body": "${link_0} being buried by ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Fong",
          "key": "${link_1}",
          "target": {
            "href": "Fong",
            "page": "Fong"
          }
        }
      ],
      "text": "Katara being buried by Fong."
    },
    {
      "body": "After ${link_0} ${link_1}'s unsuccessful ${link_2}, Katara and the group left the North Pole on a Water Tribe ship. Master Pakku presented Katara with an amulet containing ${link_3} from the ${link_4}, telling her the water had unique healing properties. After leaving Master Pakku and the other members of the Northern Water Tribe, the group traveled to an ${link_5} where they were to be escorted to ${link_6}, where Aang would learn earthbending under the tutelage of ${link_7}, the ${link_8} of the city. Katara and ${link_9} met General ${link_10}, who believed Aang was wasting time mastering ${link_11}, and instead suggested a plan to aid Aang in triggering the ${link_12}, which would grant him the power to defeat ${link_13} ${link_14}. Aang consented, but Katara opposed this shortcut, trying but failing to convince Aang to resume learning to bend the four elements one at a time. After several unsuccessful attempts to induce the Avatar State, Fong attempted to trigger it by ordering his troops to attack Aang. When this failed, Fong used earthbending to bury Katara, pretending to kill her. This enraged Aang, who fell under the Avatar State. Realizing the power Aang possessed being under the influence of the state, Fong attempted to explain that he faked Katara's death to trigger the Avatar State; however, his attempt to calm Aang fell on deaf ears, as the Avatar used a powerful wave of earthbending to defeat Fong and his troops. Afterward, the group abandoned the base and flew away on ${link_15}, resuming their journey to King Bumi.",
      "links": [
        {
          "body": "Admiral",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Fire_Nation#Admiral",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Siege of the North",
          "key": "${link_2}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        },
        {
          "body": "water",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_water",
            "page": "Spirit_water"
          }
        },
        {
          "body": "Spirit Oasis",
          "key": "${link_4}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "Earth Kingdom base",
          "key": "${link_5}",
          "target": {
            "href": "General_Fong%27s_fortress",
            "page": "General_Fong%27s_fortress"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_6}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_7}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "king",
          "key": "${link_8}",
          "target": {
            "href": "King_of_Omashu",
            "page": "King_of_Omashu"
          }
        },
        {
          "body": "the team",
          "key": "${link_9}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Fong",
          "key": "${link_10}",
          "target": {
            "href": "Fong",
            "page": "Fong"
          }
        },
        {
          "body": "the elements",
          "key": "${link_11}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_12}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_13}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_14}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Appa",
          "key": "${link_15}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "After Admiral Zhao's unsuccessful Siege of the North, Katara and the group left the North Pole on a Water Tribe ship. Master Pakku presented Katara with an amulet containing water from the Spirit Oasis, telling her the water had unique healing properties. After leaving Master Pakku and the other members of the Northern Water Tribe, the group traveled to an Earth Kingdom base where they were to be escorted to Omashu, where Aang would learn earthbending under the tutelage of Bumi, the king of the city. Katara and the team met General Fong, who believed Aang was wasting time mastering the elements, and instead suggested a plan to aid Aang in triggering the Avatar State, which would grant him the power to defeat Fire Lord Ozai. Aang consented, but Katara opposed this shortcut, trying but failing to convince Aang to resume learning to bend the four elements one at a time. After several unsuccessful attempts to induce the Avatar State, Fong attempted to trigger it by ordering his troops to attack Aang. When this failed, Fong used earthbending to bury Katara, pretending to kill her. This enraged Aang, who fell under the Avatar State. Realizing the power Aang possessed being under the influence of the state, Fong attempted to explain that he faked Katara's death to trigger the Avatar State; however, his attempt to calm Aang fell on deaf ears, as the Avatar used a powerful wave of earthbending to defeat Fong and his troops. Afterward, the group abandoned the base and flew away on Appa, resuming their journey to King Bumi."
    },
    {
      "body": "While the team relaxed by a lakeside, a group of Earth Kingdom nomads, including ${link_0}, ${link_1}, and ${link_2}, appeared, displaying the characteristics of carefree and nature-loving people. When the group revealed their intention to travel to Omashu, Chong spoke of a shortcut through tunnels passing beneath a ${link_3}. Although Sokka remained distrustful of the nomads, the team later followed them to the tunnels after an unsuccessful attempt to fly over the mountains.",
      "links": [
        {
          "body": "Chong",
          "key": "${link_0}",
          "target": {
            "href": "Chong",
            "page": "Chong"
          }
        },
        {
          "body": "Lily",
          "key": "${link_1}",
          "target": {
            "href": "Lily",
            "page": "Lily"
          }
        },
        {
          "body": "Moku",
          "key": "${link_2}",
          "target": {
            "href": "Moku",
            "page": "Moku"
          }
        },
        {
          "body": "mountain",
          "key": "${link_3}",
          "target": {
            "href": "Kolau_Mountains",
            "page": "Kolau_Mountains"
          }
        }
      ],
      "text": "While the team relaxed by a lakeside, a group of Earth Kingdom nomads, including Chong, Lily, and Moku, appeared, displaying the characteristics of carefree and nature-loving people. When the group revealed their intention to travel to Omashu, Chong spoke of a shortcut through tunnels passing beneath a mountain. Although Sokka remained distrustful of the nomads, the team later followed them to the tunnels after an unsuccessful attempt to fly over the mountains."
    },
    {
      "body": "Chong explained the tunnels formed ${link_0} protected by a curse where only those who put their trust in love could navigate their way through; those who did not would be lost forever. Sokka created a map while traveling though the labyrinth, but his attempts were useless because the tunnels consistently changed around them. Things grew even worse when Appa, after becoming frightened by fire, ran wildly around the cave. His rampage caused the ceiling to cave in, separating the group. After Aang pushed Katara out of the way of falling rocks, they and Appa were forced to continue their travels alone.",
      "links": [
        {
          "body": "a labyrinth",
          "key": "${link_0}",
          "target": {
            "href": "Cave_of_Two_Lovers",
            "page": "Cave_of_Two_Lovers"
          }
        }
      ],
      "text": "Chong explained the tunnels formed a labyrinth protected by a curse where only those who put their trust in love could navigate their way through; those who did not would be lost forever. Sokka created a map while traveling though the labyrinth, but his attempts were useless because the tunnels consistently changed around them. Things grew even worse when Appa, after becoming frightened by fire, ran wildly around the cave. His rampage caused the ceiling to cave in, separating the group. After Aang pushed Katara out of the way of falling rocks, they and Appa were forced to continue their travels alone."
    },
    {
      "body": "${link_0} and ${link_1} preparing to kiss in the ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Cave of Two Lovers",
          "key": "${link_2}",
          "target": {
            "href": "Cave_of_Two_Lovers",
            "page": "Cave_of_Two_Lovers"
          }
        }
      ],
      "text": "Katara and Aang preparing to kiss in the Cave of Two Lovers."
    },
    {
      "body": "After traveling for what was estimated at three hours, Aang and Katara discovered a large ${link_0} designed for the two lovers spoken of in lore. By reading script carved into the walls, they discovered the true story of the two lovers. The final line in the script stated \"love is brightest in the dark.\" Katara, inspired by this statement, suggested a possible way to solve the labyrinth: by following the example of the lovers and kissing in the hopes that she and Aang could find the way out. Although Aang found this idea highly intriguing due to his yet unexpressed but growing affection for Katara, he attempted to reassure an embarrassed Katara that he could not imagine kissing her. When she seemed insulted by this response, he assured her he would rather kiss her than die, which he insisted was a compliment in order to calm her down; instead, it only served to frustrate Katara further. She stormed off, which cooled the ardor between them for a while, but later, as the torch began dying out, desperation, and possibly affection, led them to dare the unknown. As the torchlight faded, they leaned toward each other, closing their eyes, and kissed. In the resulting darkness, Aang and Katara discovered the two lovers navigated the tunnels by putting out their lights and following the ceiling of glowing crystals that only lit up in the dark. They finally found their way out of the tunnel and were soon reunited with the others, with Aang explaining to Sokka that they had let love lead the way out. When the nomads departed in song of love, Katara was left blushing in silence. Concluding this, Aang, Sokka, and Katara finally arrived at Omashu only to find the great city had been conquered by the ${link_1}.",
      "links": [
        {
          "body": "tomb",
          "key": "${link_0}",
          "target": {
            "href": "Tomb_of_the_Two_Lovers",
            "page": "Tomb_of_the_Two_Lovers"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "After traveling for what was estimated at three hours, Aang and Katara discovered a large tomb designed for the two lovers spoken of in lore. By reading script carved into the walls, they discovered the true story of the two lovers. The final line in the script stated \"love is brightest in the dark.\" Katara, inspired by this statement, suggested a possible way to solve the labyrinth: by following the example of the lovers and kissing in the hopes that she and Aang could find the way out. Although Aang found this idea highly intriguing due to his yet unexpressed but growing affection for Katara, he attempted to reassure an embarrassed Katara that he could not imagine kissing her. When she seemed insulted by this response, he assured her he would rather kiss her than die, which he insisted was a compliment in order to calm her down; instead, it only served to frustrate Katara further. She stormed off, which cooled the ardor between them for a while, but later, as the torch began dying out, desperation, and possibly affection, led them to dare the unknown. As the torchlight faded, they leaned toward each other, closing their eyes, and kissed. In the resulting darkness, Aang and Katara discovered the two lovers navigated the tunnels by putting out their lights and following the ceiling of glowing crystals that only lit up in the dark. They finally found their way out of the tunnel and were soon reunited with the others, with Aang explaining to Sokka that they had let love lead the way out. When the nomads departed in song of love, Katara was left blushing in silence. Concluding this, Aang, Sokka, and Katara finally arrived at Omashu only to find the great city had been conquered by the Fire Nation."
    },
    {
      "body": "Despite the dangers of being caught, Aang decided to infiltrate the city to find Bumi, despite Katara's beliefs that Aang should seek a different earthbending teacher. She was convinced, however, when Aang explained that Bumi was a friend as well as an earthbending teacher. The team found their way into the city by traveling through a sewer; they emerged from the pipes unharmed, except for Sokka, who had several ${link_0} stuck to his face. They turned out to be harmless and Aang removed them easily. Suddenly, they were discovered by two Fire Nation soldiers who questioned why they were out past curfew. Aang quickly covered his arrow tattoo with a piece of cloth as Katara stated they were just on their way home and the soldiers decided to let them go. Just as they began leaving, however, the soldiers noticed the marks left by the pentapuses and grew suspicious, interrogating the group as to how Sokka received the markings. Katara quickly claimed that Sokka had \"${link_1}\", a very contagious disease. The soldiers ran away in fear, thereby allowing the group to avoid capture.",
      "links": [
        {
          "body": "purple pentapuses",
          "key": "${link_0}",
          "target": {
            "href": "Purple_pentapus",
            "page": "Purple_pentapus"
          }
        },
        {
          "body": "pentapox",
          "key": "${link_1}",
          "target": {
            "href": "Pentapox",
            "page": "Pentapox"
          }
        }
      ],
      "text": "Despite the dangers of being caught, Aang decided to infiltrate the city to find Bumi, despite Katara's beliefs that Aang should seek a different earthbending teacher. She was convinced, however, when Aang explained that Bumi was a friend as well as an earthbending teacher. The team found their way into the city by traveling through a sewer; they emerged from the pipes unharmed, except for Sokka, who had several purple pentapuses stuck to his face. They turned out to be harmless and Aang removed them easily. Suddenly, they were discovered by two Fire Nation soldiers who questioned why they were out past curfew. Aang quickly covered his arrow tattoo with a piece of cloth as Katara stated they were just on their way home and the soldiers decided to let them go. Just as they began leaving, however, the soldiers noticed the marks left by the pentapuses and grew suspicious, interrogating the group as to how Sokka received the markings. Katara quickly claimed that Sokka had \"pentapox\", a very contagious disease. The soldiers ran away in fear, thereby allowing the group to avoid capture."
    },
    {
      "body": "${link_0} fighting ${link_1} in ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Mai",
          "key": "${link_1}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_2}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        }
      ],
      "text": "Katara fighting Mai in Omashu."
    },
    {
      "body": "In Omashu, the ${link_0} of the city, ${link_1}, ${link_2}, and daughter, ${link_3}, discovered Aang's presence in the city. The trio ended up in an underground cavern where an Earth Kingdom officer, Captain ${link_4}, revealed that King Bumi had surrendered to the Fire Nation, an account that surprised all of them. When Yung insisted on fighting the Fire Nation, Aang opposed his idea by suggesting they leave Omashu to which Yung reluctantly agreed. Sokka devised a plan where all the citizens were to have \"pentapox\". After seeing all the \"sick\" citizens, the Fire Nation governor ordered them to be evacuated immediately.",
      "links": [
        {
          "body": "new Fire Nation governor",
          "key": "${link_0}",
          "target": {
            "href": "Ukano",
            "page": "Ukano"
          }
        },
        {
          "body": "his wife",
          "key": "${link_1}",
          "target": {
            "href": "Michi",
            "page": "Michi"
          }
        },
        {
          "body": "baby son",
          "key": "${link_2}",
          "target": {
            "href": "Tom-Tom",
            "page": "Tom-Tom"
          }
        },
        {
          "body": "Mai",
          "key": "${link_3}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Yung",
          "key": "${link_4}",
          "target": {
            "href": "Yung_(captain)",
            "page": "Yung_(captain)"
          }
        }
      ],
      "text": "In Omashu, the new Fire Nation governor of the city, his wife, baby son, and daughter, Mai, discovered Aang's presence in the city. The trio ended up in an underground cavern where an Earth Kingdom officer, Captain Yung, revealed that King Bumi had surrendered to the Fire Nation, an account that surprised all of them. When Yung insisted on fighting the Fire Nation, Aang opposed his idea by suggesting they leave Omashu to which Yung reluctantly agreed. Sokka devised a plan where all the citizens were to have \"pentapox\". After seeing all the \"sick\" citizens, the Fire Nation governor ordered them to be evacuated immediately."
    },
    {
      "body": "Once outside of Omashu, Katara took an instant liking to ${link_0}, the governor's son who, out of curiosity, had followed the citizens. She cuddled and praised him and even insisted that Sokka gave in to Tom-Tom's desire to hold ${link_1}. When the leader of the resistance warned her that \"he'll be a killer\" once he grew up, Katara responded, \"Does this look like the face of a killer to you?\" while holding Tom-Tom up.",
      "links": [
        {
          "body": "Tom-Tom",
          "key": "${link_0}",
          "target": {
            "href": "Tom-Tom",
            "page": "Tom-Tom"
          }
        },
        {
          "body": "his club",
          "key": "${link_1}",
          "target": {
            "href": "Sokka%27s_weapons#Battle_club",
            "page": "Sokka%27s_weapons"
          }
        }
      ],
      "text": "Once outside of Omashu, Katara took an instant liking to Tom-Tom, the governor's son who, out of curiosity, had followed the citizens. She cuddled and praised him and even insisted that Sokka gave in to Tom-Tom's desire to hold his club. When the leader of the resistance warned her that \"he'll be a killer\" once he grew up, Katara responded, \"Does this look like the face of a killer to you?\" while holding Tom-Tom up."
    },
    {
      "body": "When the resistance received a note demanding they return Tom-Tom to his family in exchange for Bumi, the trio went to the meeting place, where they found ${link_0}, Mai, and ${link_1} waiting for them. A fight ensued when Azula recognized Aang as the Avatar. While she and the Avatar fought on the mail chute, Katara battled Mai, freezing her arm in ice as Ty Lee targeted Sokka, who had narrowly kept Tom-Tom from falling to his death, only for Katara to use a water whip to pull her away. The duel continued between her and Mai; Katara momentarily gained the upperhand until Ty Lee ${link_2} her chi which disabled her waterbending abilities. Mai tauntingly asked, \"How are you going to fight without your bending?\" and prepared to strike her with a ${link_3}, but Sokka intervened and saved Katara. The team left Omashu after Bumi advised Aang to seek a different earthbending teacher.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_1}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "blocked",
          "key": "${link_2}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        },
        {
          "body": "sai",
          "key": "${link_3}",
          "target": {
            "href": "Mai%27s_weapons#Sai",
            "page": "Mai%27s_weapons"
          }
        }
      ],
      "text": "When the resistance received a note demanding they return Tom-Tom to his family in exchange for Bumi, the trio went to the meeting place, where they found Azula, Mai, and Ty Lee waiting for them. A fight ensued when Azula recognized Aang as the Avatar. While she and the Avatar fought on the mail chute, Katara battled Mai, freezing her arm in ice as Ty Lee targeted Sokka, who had narrowly kept Tom-Tom from falling to his death, only for Katara to use a water whip to pull her away. The duel continued between her and Mai; Katara momentarily gained the upperhand until Ty Lee blocked her chi which disabled her waterbending abilities. Mai tauntingly asked, \"How are you going to fight without your bending?\" and prepared to strike her with a sai, but Sokka intervened and saved Katara. The team left Omashu after Bumi advised Aang to seek a different earthbending teacher."
    },
    {
      "body": "When the team was flying on Appa above a giant ${link_0}, Aang stared down at it in a sort of hypnotic trance and unknowingly guided Appa lower and lower above the area. Sokka noticed their strange descent and inquired as to why they were flying downward which snapped Aang out of his trance. Katara asked him if something was wrong to which Aang replied that he felt the swamp was calling to him. Aang stated Bumi's advice, which was to listen to the earth and felt strongly obligated to land. However, strong objections by the rest of the group changed his mind and he agreed to keep flying. However just as he did so, a tornado appeared and knocked the group down into the depths of the swamp.",
      "links": [
        {
          "body": "swamp",
          "key": "${link_0}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        }
      ],
      "text": "When the team was flying on Appa above a giant swamp, Aang stared down at it in a sort of hypnotic trance and unknowingly guided Appa lower and lower above the area. Sokka noticed their strange descent and inquired as to why they were flying downward which snapped Aang out of his trance. Katara asked him if something was wrong to which Aang replied that he felt the swamp was calling to him. Aang stated Bumi's advice, which was to listen to the earth and felt strongly obligated to land. However, strong objections by the rest of the group changed his mind and he agreed to keep flying. However just as he did so, a tornado appeared and knocked the group down into the depths of the swamp."
    },
    {
      "body": "${link_0} crying after realizing what she thought was ${link_1} in a vision is revealed to be a stump.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "her mother",
          "key": "${link_1}",
          "target": {
            "href": "Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        }
      ],
      "text": "Katara crying after realizing what she thought was her mother in a vision is revealed to be a stump."
    },
    {
      "body": "After the fall, Aang, Katara, and Sokka became separated from Appa and ${link_0}. Aang began to search for them, but to no avail. While searching, he discovered the tornado had mysteriously disappeared. The trio, led by Sokka, started searching for their animal friends, with Sokka chopping away at everything in sight with his machete. Aang urged him to treat the swamp more respectively. Katara agreed with Aang, as she felt some supernatural qualities were present within the swamp. She claimed that it felt alive, but Sokka ignored their warnings and dismissed their concerns. Things became stranger when the group decided to camp out for the night; they saw glowing eyes within the darkness and had a strange sense they were being secretly watched. In the midst of the night, strong vines emerged from within the undergrowth and jarred the sleeping trio awake by suddenly dragging them away screaming. After each of the three successfully broke free from their captor of vines, they were completely separated from each other.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "After the fall, Aang, Katara, and Sokka became separated from Appa and Momo. Aang began to search for them, but to no avail. While searching, he discovered the tornado had mysteriously disappeared. The trio, led by Sokka, started searching for their animal friends, with Sokka chopping away at everything in sight with his machete. Aang urged him to treat the swamp more respectively. Katara agreed with Aang, as she felt some supernatural qualities were present within the swamp. She claimed that it felt alive, but Sokka ignored their warnings and dismissed their concerns. Things became stranger when the group decided to camp out for the night; they saw glowing eyes within the darkness and had a strange sense they were being secretly watched. In the midst of the night, strong vines emerged from within the undergrowth and jarred the sleeping trio awake by suddenly dragging them away screaming. After each of the three successfully broke free from their captor of vines, they were completely separated from each other."
    },
    {
      "body": "Katara, now looking for Sokka and Aang, saw a strange figure in the distance. She identified it as ${link_0} and began to run up to her. However, when she turned to face her mother, she realized it was only a hallucination. The figure she thought was her mother turned out to be an ordinary stump. She broke down into tears at this reality. Eventually, the group reunited and all confessed they had witnessed visions while traveling through the swamp. They found themselves at the center of the swamp which Aang believed was \"calling\" to them. Sokka objected saying there were no supernatural events happening, but was proved wrong when a terrifying swamp monster emerged from the water and attacked them. A fight soon erupted; Katara's prominent waterbending skills proved to be a challenge for the monster.",
      "links": [
        {
          "body": "her mother",
          "key": "${link_0}",
          "target": {
            "href": "Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        }
      ],
      "text": "Katara, now looking for Sokka and Aang, saw a strange figure in the distance. She identified it as her mother and began to run up to her. However, when she turned to face her mother, she realized it was only a hallucination. The figure she thought was her mother turned out to be an ordinary stump. She broke down into tears at this reality. Eventually, the group reunited and all confessed they had witnessed visions while traveling through the swamp. They found themselves at the center of the swamp which Aang believed was \"calling\" to them. Sokka objected saying there were no supernatural events happening, but was proved wrong when a terrifying swamp monster emerged from the water and attacked them. A fight soon erupted; Katara's prominent waterbending skills proved to be a challenge for the monster."
    },
    {
      "body": "${link_0} fighting the swamp monster.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Katara fighting the swamp monster."
    },
    {
      "body": "Aang and Katara finally defeated the swamp monster who was really a waterbender named ${link_0} bending the water in the vines. He went on to explain that, in reality, the swamp was one ${link_1} spread over miles and miles of land. He taught how everything on ${link_2} was connected and had the same origins. When Katara asked him about the meaning of their visions, he explained that oftentimes people envisioned loved ones in the swamp which was a way to communicate to them that all people, dead or alive, were connected. Aang's vision continued to perplex him because he was certain he had never met the girl he had envisioned, but realized he will meet her in the future. From Huu's statement, the Avatar also realized that if everything were connected, he could find Appa and Momo, so he touched the tree and used his chi to connect with the roots around him to locate them. When they did, Aang and Katara persuaded the natives to free their friends.",
      "links": [
        {
          "body": "Huu",
          "key": "${link_0}",
          "target": {
            "href": "Huu",
            "page": "Huu"
          }
        },
        {
          "body": "enormous tree",
          "key": "${link_1}",
          "target": {
            "href": "Banyan-grove_tree",
            "page": "Banyan-grove_tree"
          }
        },
        {
          "body": "Earth",
          "key": "${link_2}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "Aang and Katara finally defeated the swamp monster who was really a waterbender named Huu bending the water in the vines. He went on to explain that, in reality, the swamp was one enormous tree spread over miles and miles of land. He taught how everything on Earth was connected and had the same origins. When Katara asked him about the meaning of their visions, he explained that oftentimes people envisioned loved ones in the swamp which was a way to communicate to them that all people, dead or alive, were connected. Aang's vision continued to perplex him because he was certain he had never met the girl he had envisioned, but realized he will meet her in the future. From Huu's statement, the Avatar also realized that if everything were connected, he could find Appa and Momo, so he touched the tree and used his chi to connect with the roots around him to locate them. When they did, Aang and Katara persuaded the natives to free their friends."
    },
    {
      "body": "${link_0} fighting a ${link_1} on his ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Yuyan Archer",
          "key": "${link_1}",
          "target": {
            "href": "Yuyan_Archers",
            "page": "Yuyan_Archers"
          }
        },
        {
          "body": "komodo rhino",
          "key": "${link_2}",
          "target": {
            "href": "Komodo_rhino",
            "page": "Komodo_rhino"
          }
        }
      ],
      "text": "Katara fighting a Yuyan Archer on his komodo rhino."
    },
    {
      "body": "When visiting ${link_0}, Katara and the gang witnessed the annual ${link_1}, denouncing the Avatar. Horrified at this scene, they questioned the leader, Mayor ${link_2}, who told Aang he was not welcome to the village after the murder of their great leader, ${link_3}, by one of his past lives. Aang was ${link_4} and beckoned Sokka and Katara to find evidence to clear his name. The two consented and began searching for evidence; their investigation eventually led them to ${link_5}. After arriving back at the village, a trial was held and Aang was found guilty of murder. However, when a Fire Nation group, known as the ${link_6}, invaded the town; the Avatar was excused from his trial in order to defend the town. The team's brave victory over the Rough Rhinos resulted in the celebration of a new Avatar Day; instead of denouncing the Avatar, the Avatar would be honored from that point on.",
      "links": [
        {
          "body": "Chin Village",
          "key": "${link_0}",
          "target": {
            "href": "Chin_Village",
            "page": "Chin_Village"
          }
        },
        {
          "body": "Avatar Day festival",
          "key": "${link_1}",
          "target": {
            "href": "Avatar_Day_festival",
            "page": "Avatar_Day_festival"
          }
        },
        {
          "body": "Tong",
          "key": "${link_2}",
          "target": {
            "href": "Tong",
            "page": "Tong"
          }
        },
        {
          "body": "Chin",
          "key": "${link_3}",
          "target": {
            "href": "Chin",
            "page": "Chin"
          }
        },
        {
          "body": "jailed",
          "key": "${link_4}",
          "target": {
            "href": "Chin_Village_prison",
            "page": "Chin_Village_prison"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_5}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "Rough Rhinos",
          "key": "${link_6}",
          "target": {
            "href": "Rough_Rhinos",
            "page": "Rough_Rhinos"
          }
        }
      ],
      "text": "When visiting Chin Village, Katara and the gang witnessed the annual Avatar Day festival, denouncing the Avatar. Horrified at this scene, they questioned the leader, Mayor Tong, who told Aang he was not welcome to the village after the murder of their great leader, Chin, by one of his past lives. Aang was jailed and beckoned Sokka and Katara to find evidence to clear his name. The two consented and began searching for evidence; their investigation eventually led them to Kyoshi Island. After arriving back at the village, a trial was held and Aang was found guilty of murder. However, when a Fire Nation group, known as the Rough Rhinos, invaded the town; the Avatar was excused from his trial in order to defend the town. The team's brave victory over the Rough Rhinos resulted in the celebration of a new Avatar Day; instead of denouncing the Avatar, the Avatar would be honored from that point on."
    },
    {
      "body": "The trio journeyed to the town of ${link_0} on their continuous search for an earthbending teacher. Aang received a free earthbending lesson from Master ${link_1}, but he found that he cared more about his lesson payment than teaching him earthbending. Afterward, they overheard a ${link_2} talking about ${link_3}, a tournament featuring several powerful earthbenders. The boys were not very inclined to direct Aang to the location, until Katara used her \"feminine charm\", which involved freezing them to the walls, to procure the needed information.",
      "links": [
        {
          "body": "Gaoling",
          "key": "${link_0}",
          "target": {
            "href": "Gaoling",
            "page": "Gaoling"
          }
        },
        {
          "body": "Yu",
          "key": "${link_1}",
          "target": {
            "href": "Yu",
            "page": "Yu"
          }
        },
        {
          "body": "pair of students",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending_academy_teenagers",
            "page": "Earthbending_academy_teenagers"
          }
        },
        {
          "body": "Earth Rumble VI",
          "key": "${link_3}",
          "target": {
            "href": "Earth_Rumble_VI",
            "page": "Earth_Rumble_VI"
          }
        }
      ],
      "text": "The trio journeyed to the town of Gaoling on their continuous search for an earthbending teacher. Aang received a free earthbending lesson from Master Yu, but he found that he cared more about his lesson payment than teaching him earthbending. Afterward, they overheard a pair of students talking about Earth Rumble VI, a tournament featuring several powerful earthbenders. The boys were not very inclined to direct Aang to the location, until Katara used her \"feminine charm\", which involved freezing them to the walls, to procure the needed information."
    },
    {
      "body": "At the tournament, they witnessed a powerful earthbender named ${link_0}, who defeated every challenger he came across. Sokka became engrossed in the tournament, but Aang was not very impressed, saying that The Boulder was \"just listening to his big muscles\". The Boulder defeated several other contenders, until he worked his way up to the current champion, The Blind Bandit, a blind earthbender who happened to be ${link_1}, a twelve-year-old girl. Aang noticed the Bandit's techniques, especially how she waited and listened carefully to the movements of her opponent and realized she was the type of person that Bumi said would make a good earthbending teacher. He also realized that she was the girl in white he saw in his vision in the Foggy Swamp.",
      "links": [
        {
          "body": "The Boulder",
          "key": "${link_0}",
          "target": {
            "href": "The_Boulder",
            "page": "The_Boulder"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "At the tournament, they witnessed a powerful earthbender named The Boulder, who defeated every challenger he came across. Sokka became engrossed in the tournament, but Aang was not very impressed, saying that The Boulder was \"just listening to his big muscles\". The Boulder defeated several other contenders, until he worked his way up to the current champion, The Blind Bandit, a blind earthbender who happened to be Toph, a twelve-year-old girl. Aang noticed the Bandit's techniques, especially how she waited and listened carefully to the movements of her opponent and realized she was the type of person that Bumi said would make a good earthbending teacher. He also realized that she was the girl in white he saw in his vision in the Foggy Swamp."
    },
    {
      "body": "After the Blind Bandit easily defeated The Boulder, the announcer of the tournament, ${link_0}, offered a large sum of ${link_1} to whoever could defeat the Blind Bandit. Seeing an opportunity to talk to the Bandit, Aang accepted the challenge. The Bandit was ready for a fight, however, and she refused to engage in conversation. She was not expecting to face an airbender and was defeated when Aang blew her out of the ring. The Bandit took badly to her loss and stormed off, refusing to even listen to Aang.",
      "links": [
        {
          "body": "Xin Fu",
          "key": "${link_0}",
          "target": {
            "href": "Xin_Fu",
            "page": "Xin_Fu"
          }
        },
        {
          "body": "gold",
          "key": "${link_1}",
          "target": {
            "href": "Currency",
            "page": "Currency"
          }
        }
      ],
      "text": "After the Blind Bandit easily defeated The Boulder, the announcer of the tournament, Xin Fu, offered a large sum of gold to whoever could defeat the Blind Bandit. Seeing an opportunity to talk to the Bandit, Aang accepted the challenge. The Bandit was ready for a fight, however, and she refused to engage in conversation. She was not expecting to face an airbender and was defeated when Aang blew her out of the ring. The Bandit took badly to her loss and stormed off, refusing to even listen to Aang."
    },
    {
      "body": "${link_0} making threats.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Katara making threats."
    },
    {
      "body": "Later, Aang and the others returned to ${link_0} to try to discover where the Blind Bandit lived. Questioning the same boys Katara \"asked\" about the tournament, who were now quite intimidated by her, they did not receive much information, until Aang remembered the ${link_1} he also saw with the girl in his vision. The boys told them the flying boar was the symbol of the ${link_2}, the wealthiest family in the town.",
      "links": [
        {
          "body": "Master Yu's Earthbending Academy",
          "key": "${link_0}",
          "target": {
            "href": "Master_Yu%27s_Earthbending_Academy",
            "page": "Master_Yu%27s_Earthbending_Academy"
          }
        },
        {
          "body": "flying boar",
          "key": "${link_1}",
          "target": {
            "href": "Flying_boar",
            "page": "Flying_boar"
          }
        },
        {
          "body": "Beifong family",
          "key": "${link_2}",
          "target": {
            "href": "Beifong_family",
            "page": "Beifong_family"
          }
        }
      ],
      "text": "Later, Aang and the others returned to Master Yu's Earthbending Academy to try to discover where the Blind Bandit lived. Questioning the same boys Katara \"asked\" about the tournament, who were now quite intimidated by her, they did not receive much information, until Aang remembered the flying boar he also saw with the girl in his vision. The boys told them the flying boar was the symbol of the Beifong family, the wealthiest family in the town."
    },
    {
      "body": "Aang and company traveled to the family's house, where they were accosted by the Bandit, now wearing the same dress Aang saw her wearing in the swamp. The girl refused to help them, and called the house guards to chase them off.",
      "links": [],
      "text": "Aang and company traveled to the family's house, where they were accosted by the Bandit, now wearing the same dress Aang saw her wearing in the swamp. The girl refused to help them, and called the house guards to chase them off."
    },
    {
      "body": "That evening, Aang used his status as the Avatar to gain a formal audience with the entire Beifong family. He tried to persuade Toph's father, ${link_0}, into helping him, but Toph used her earthbending to keep Aang from revealing any information about her life as The Blind Bandit. She wished for her parents and teacher to be completely unaware about her true skill. After numerous earthbending interruptions, Aang retaliated, bringing the dinner to both a premature end and into everybody's face.",
      "links": [
        {
          "body": "Lao Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Lao_Beifong",
            "page": "Lao_Beifong"
          }
        }
      ],
      "text": "That evening, Aang used his status as the Avatar to gain a formal audience with the entire Beifong family. He tried to persuade Toph's father, Lao Beifong, into helping him, but Toph used her earthbending to keep Aang from revealing any information about her life as The Blind Bandit. She wished for her parents and teacher to be completely unaware about her true skill. After numerous earthbending interruptions, Aang retaliated, bringing the dinner to both a premature end and into everybody's face."
    },
    {
      "body": "After dinner, Toph and Aang took a stroll through the garden to talk things out only to be captured by Xin Fu and his team, who thought the two had plotted together and stole his money in the tournament. After Katara and Sokka sought help and earned Toph's freedom, Toph showed her true talent when Xin Fu refused to release Aang. She single-handedly defeated all the enemies, allowing Katara and Sokka to work together to free Aang from his metal holding cell. With her skill now revealed to her parents, Toph openly confessed that the obedient, helpless blind girl did not reflect her character. However, her parents did not see it that way and instead felt she needed more guarding. As Katara and the others prepared to leave, Toph ran up to them, saying that her father had changed his mind and allowed her to travel with them, to which Sokka wisely offered to leave quickly before her father \"changed his mind again\". Toph was prepared to depart, but not before she exacted revenge on Aang by promptly launching him into a tree. Toph, declaring them even, demanded to have her championship belt returned.",
      "links": [],
      "text": "After dinner, Toph and Aang took a stroll through the garden to talk things out only to be captured by Xin Fu and his team, who thought the two had plotted together and stole his money in the tournament. After Katara and Sokka sought help and earned Toph's freedom, Toph showed her true talent when Xin Fu refused to release Aang. She single-handedly defeated all the enemies, allowing Katara and Sokka to work together to free Aang from his metal holding cell. With her skill now revealed to her parents, Toph openly confessed that the obedient, helpless blind girl did not reflect her character. However, her parents did not see it that way and instead felt she needed more guarding. As Katara and the others prepared to leave, Toph ran up to them, saying that her father had changed his mind and allowed her to travel with them, to which Sokka wisely offered to leave quickly before her father \"changed his mind again\". Toph was prepared to depart, but not before she exacted revenge on Aang by promptly launching him into a tree. Toph, declaring them even, demanded to have her championship belt returned."
    },
    {
      "body": "Not long after Toph joined the group, she began feuding with Katara. As the group set up camp, Katara noticed Toph slumping lazily against a rock. Katara informed her that they usually divided the work among the group, implying she would like Toph to aid them. Toph breezily told her not to worry, stating she could carry her own weight and proceeded to earthbend a makeshift tent around her. Katara rephrased her last statement, citing each member's responsibilities, including Momo, who appeared on her shoulder with berries. Toph refuted that she did not feel obligated to help anyone else, because no one needed to aid her. Katara attempted once more to suggest her to contribute to the construction of the campsite, but this only further irritated her. Katara finally surrendered to Toph's desires and walked back to their campsite. Later on, Katara tried to rectify with Toph for the previous argument, apologizing and noting they were all just a little tired. Toph, rather than sharing the blame and accepting her overture, simply agreed that Katara did seem a bit too tired and lay down to sleep. Katara, though clearly incensed by the insulting retort, brought herself to half-heartedly tell Toph goodnight and walked back to her own tent.",
      "links": [],
      "text": "Not long after Toph joined the group, she began feuding with Katara. As the group set up camp, Katara noticed Toph slumping lazily against a rock. Katara informed her that they usually divided the work among the group, implying she would like Toph to aid them. Toph breezily told her not to worry, stating she could carry her own weight and proceeded to earthbend a makeshift tent around her. Katara rephrased her last statement, citing each member's responsibilities, including Momo, who appeared on her shoulder with berries. Toph refuted that she did not feel obligated to help anyone else, because no one needed to aid her. Katara attempted once more to suggest her to contribute to the construction of the campsite, but this only further irritated her. Katara finally surrendered to Toph's desires and walked back to their campsite. Later on, Katara tried to rectify with Toph for the previous argument, apologizing and noting they were all just a little tired. Toph, rather than sharing the blame and accepting her overture, simply agreed that Katara did seem a bit too tired and lay down to sleep. Katara, though clearly incensed by the insulting retort, brought herself to half-heartedly tell Toph goodnight and walked back to her own tent."
    },
    {
      "body": "During the night, Toph suddenly awoke. Feeling vibrations in the ground, she sensed something approaching and alerted the rest of the group. When asked exactly what was approaching, she replied that she was unable to identify it. They abandoned the scene and flew far off to another location in the woods. When asked by Katara to help set up their campsite, Toph once again refused. Angrily, Katara stated that Toph had shown nothing but selfishness since she had joined the group and the two girls began feuding. It ended with Toph earthbending another makeshift tent around her and ignoring Katara, only infuriating the latter.",
      "links": [],
      "text": "During the night, Toph suddenly awoke. Feeling vibrations in the ground, she sensed something approaching and alerted the rest of the group. When asked exactly what was approaching, she replied that she was unable to identify it. They abandoned the scene and flew far off to another location in the woods. When asked by Katara to help set up their campsite, Toph once again refused. Angrily, Katara stated that Toph had shown nothing but selfishness since she had joined the group and the two girls began feuding. It ended with Toph earthbending another makeshift tent around her and ignoring Katara, only infuriating the latter."
    },
    {
      "body": "${link_0} yelling at ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Toph yelling at Katara."
    },
    {
      "body": "During the night, Toph sensed the strange object heading toward them again, forcing them to desert the site. In the morning, sleep-deprived and cranky, Katara blamed Toph for their tedious situation stating that, had Toph aided them when setting up camp, they would have gotten some sleep. Toph became enraged and left the group with her belongings.",
      "links": [],
      "text": "During the night, Toph sensed the strange object heading toward them again, forcing them to desert the site. In the morning, sleep-deprived and cranky, Katara blamed Toph for their tedious situation stating that, had Toph aided them when setting up camp, they would have gotten some sleep. Toph became enraged and left the group with her belongings."
    },
    {
      "body": "After having time to reconsider recent events, Katara reconciled that she needed to find Toph and apologize to her. However, there was no time for that. She conceded with her brother and Aang they needed to heed Toph's last advice, to take care of Appa's shedding problem, in order to lose the ${link_0} chasing them.",
      "links": [
        {
          "body": "tank train",
          "key": "${link_0}",
          "target": {
            "href": "Tank_train",
            "page": "Tank_train"
          }
        }
      ],
      "text": "After having time to reconsider recent events, Katara reconciled that she needed to find Toph and apologize to her. However, there was no time for that. She conceded with her brother and Aang they needed to heed Toph's last advice, to take care of Appa's shedding problem, in order to lose the tank train chasing them."
    },
    {
      "body": "Aang split from the group to mislead the pursuing Fire Nation team using a bag of gathered fur from his bison. Katara left with Sokka but as Appa took flight he clipped a tree, breaking the top of it off, which shortly led Mai and Ty Lee to track them down.",
      "links": [],
      "text": "Aang split from the group to mislead the pursuing Fire Nation team using a bag of gathered fur from his bison. Katara left with Sokka but as Appa took flight he clipped a tree, breaking the top of it off, which shortly led Mai and Ty Lee to track them down."
    },
    {
      "body": "Appa crash-landed, exhausted, beside a river, leaving Katara and Sokka to face off with Mai and Ty Lee. Katara initially battled Ty Lee, fearing her from their last encounter and ensuring to keep her a safe distance by attacking with her waterbending. Sokka engaged Mai briefly, fending off her darts with skill. However, when the two switched opponents, Sokka found himself chi blocked, unable to move his limbs, and Katara found herself pinned to a tree. It was only by Appa's aid with a heavy airbending blast to send Mai and Ty Lee sailing into the river that the party escaped the battle.",
      "links": [],
      "text": "Appa crash-landed, exhausted, beside a river, leaving Katara and Sokka to face off with Mai and Ty Lee. Katara initially battled Ty Lee, fearing her from their last encounter and ensuring to keep her a safe distance by attacking with her waterbending. Sokka engaged Mai briefly, fending off her darts with skill. However, when the two switched opponents, Sokka found himself chi blocked, unable to move his limbs, and Katara found herself pinned to a tree. It was only by Appa's aid with a heavy airbending blast to send Mai and Ty Lee sailing into the river that the party escaped the battle."
    },
    {
      "body": "Not long after this encounter, Katara and Sokka traveled toward ${link_0} to rejoin Aang. Here, Katara found Aang trapped in a burning building, and intervened against Azula to save Aang's life. Having distracted the prodigy Princess, Katara bolted into the street where Toph rejoined the group unexpectedly, participating in their duel against Azula. Azula attacked Iroh, who was helping Team Avatar at the time, along with ${link_1}, and managed to escape the scene, unharmed. Katara offered to heal Iroh, but was violently refused by a grief-stricken Zuko.",
      "links": [
        {
          "body": "Tu Zin",
          "key": "${link_0}",
          "target": {
            "href": "Tu_Zin",
            "page": "Tu_Zin"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Not long after this encounter, Katara and Sokka traveled toward Tu Zin to rejoin Aang. Here, Katara found Aang trapped in a burning building, and intervened against Azula to save Aang's life. Having distracted the prodigy Princess, Katara bolted into the street where Toph rejoined the group unexpectedly, participating in their duel against Azula. Azula attacked Iroh, who was helping Team Avatar at the time, along with Zuko, and managed to escape the scene, unharmed. Katara offered to heal Iroh, but was violently refused by a grief-stricken Zuko."
    },
    {
      "body": "The group arrived at a quarry campsite where Aang began his ${link_0} with Toph. Despite his futile efforts to follow Toph's demonstrations, he found himself unable to perform earthbending. When Toph became angry at his struggles to learn the basic forms of the bending art, Katara confronted her, advising that she needed to be more patient and kind toward Aang and that, as his former teacher, she had come to notice that Aang responded well to positive teaching methods. She later confronted Aang on his difficulties learning earthbending, assuring him that he would master the art soon. Like the others, she was thrilled upon seeing Aang successfully earthbend after a rigorous day of training.",
      "links": [
        {
          "body": "earthbending training",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending_training",
            "page": "Earthbending_training"
          }
        }
      ],
      "text": "The group arrived at a quarry campsite where Aang began his earthbending training with Toph. Despite his futile efforts to follow Toph's demonstrations, he found himself unable to perform earthbending. When Toph became angry at his struggles to learn the basic forms of the bending art, Katara confronted her, advising that she needed to be more patient and kind toward Aang and that, as his former teacher, she had come to notice that Aang responded well to positive teaching methods. She later confronted Aang on his difficulties learning earthbending, assuring him that he would master the art soon. Like the others, she was thrilled upon seeing Aang successfully earthbend after a rigorous day of training."
    },
    {
      "body": "Each of the team members decided to take a little \"mini-vacation\", as a way to unwind after all the work they had done; Sokka, on the other hand, thought the group should be working on getting intelligence on the Fire Nation, most specifically a map, for when Aang needed to face the Fire Lord. However, the final decision of the group was to go to the ${link_0}, Katara's chosen vacation site. There they met Professor ${link_1}, who told them he was searching for a legendary library said to be in the middle of the ${link_2}; ${link_3}, said to have been created by the Spirit of Knowledge and his ${link_4}, held more valuable tomes than any other place in the world. Sokka, believing he may be able to get information on the Fire Nation there, dedicated his \"vacation\" to finding this library.",
      "links": [
        {
          "body": "Misty Palms Oasis",
          "key": "${link_0}",
          "target": {
            "href": "Misty_Palms_Oasis",
            "page": "Misty_Palms_Oasis"
          }
        },
        {
          "body": "Zei",
          "key": "${link_1}",
          "target": {
            "href": "Zei",
            "page": "Zei"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_2}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        },
        {
          "body": "the library",
          "key": "${link_3}",
          "target": {
            "href": "Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "fox servants",
          "key": "${link_4}",
          "target": {
            "href": "Knowledge_Seekers",
            "page": "Knowledge_Seekers"
          }
        }
      ],
      "text": "Each of the team members decided to take a little \"mini-vacation\", as a way to unwind after all the work they had done; Sokka, on the other hand, thought the group should be working on getting intelligence on the Fire Nation, most specifically a map, for when Aang needed to face the Fire Lord. However, the final decision of the group was to go to the Misty Palms Oasis, Katara's chosen vacation site. There they met Professor Zei, who told them he was searching for a legendary library said to be in the middle of the Si Wong Desert; the library, said to have been created by the Spirit of Knowledge and his fox servants, held more valuable tomes than any other place in the world. Sokka, believing he may be able to get information on the Fire Nation there, dedicated his \"vacation\" to finding this library."
    },
    {
      "body": "${link_0} contributing her water scroll to the library.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Katara contributing her water scroll to the library."
    },
    {
      "body": "Flying on Appa, Team Avatar and Zei soon found the library. Most of the structure being buried in the sand, except for its single, highest tower. Aang, Katara, Sokka, Momo, and the professor entered the library through a window. Appa stayed outside, as did Toph, who could not read since she was blind.",
      "links": [],
      "text": "Flying on Appa, Team Avatar and Zei soon found the library. Most of the structure being buried in the sand, except for its single, highest tower. Aang, Katara, Sokka, Momo, and the professor entered the library through a window. Appa stayed outside, as did Toph, who could not read since she was blind."
    },
    {
      "body": "When the group entered the library, they met the spirit ${link_0}, who constructed the library. Taking the form of a large owl, the spirit initially did not trust them since he disliked the fact that humans only used knowledge to get an advantage over other humans. He brought up the last human to have discovered his library, who happened to be Admiral Zhao, and believed the group only wanted to obtain information to help them defeat their enemies, which was, of course, true. They managed to convince the spirit otherwise.",
      "links": [
        {
          "body": "Wan Shi Tong",
          "key": "${link_0}",
          "target": {
            "href": "Wan_Shi_Tong",
            "page": "Wan_Shi_Tong"
          }
        }
      ],
      "text": "When the group entered the library, they met the spirit Wan Shi Tong, who constructed the library. Taking the form of a large owl, the spirit initially did not trust them since he disliked the fact that humans only used knowledge to get an advantage over other humans. He brought up the last human to have discovered his library, who happened to be Admiral Zhao, and believed the group only wanted to obtain information to help them defeat their enemies, which was, of course, true. They managed to convince the spirit otherwise."
    },
    {
      "body": "Sokka found a burned scrap of paper that mentioned \"the Fire Nation's darkest day.\" Eager for more information, they decided to go to the section of the library containing information on the Fire Nation, but it turned out that Zhao, before leaving, apparently destroyed every other bit of information about the Fire Nation, probably to prevent exactly what Sokka and the others were trying to do. However, a fox, who was one of Wan Shi Tong's animal helpers, found the group and led them to a ${link_0}. There, a date could be entered on a stone wheel, which subsequently showed ${link_1} on that particular date. When Sokka entered the date of \"the darkest day\", it showed a ${link_2} occurring. The group realized that solar eclipses must weaken or take away firebending power, in the same way ${link_3} affect waterbending. With this knowledge, they realized they could use this information to plan an attack on the Fire Nation forces.",
      "links": [
        {
          "body": "room dedicated to astronomy",
          "key": "${link_0}",
          "target": {
            "href": "Planetary_calendar_room",
            "page": "Planetary_calendar_room"
          }
        },
        {
          "body": "the heavens",
          "key": "${link_1}",
          "target": {
            "href": "Outer_space",
            "page": "Outer_space"
          }
        },
        {
          "body": "solar eclipse",
          "key": "${link_2}",
          "target": {
            "href": "Astronomy_in_the_World_of_Avatar#Solar_Eclipse",
            "page": "Astronomy_in_the_World_of_Avatar"
          }
        },
        {
          "body": "lunar eclipses",
          "key": "${link_3}",
          "target": {
            "href": "Astronomy_in_the_World_of_Avatar#Lunar_Eclipse",
            "page": "Astronomy_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Sokka found a burned scrap of paper that mentioned \"the Fire Nation's darkest day.\" Eager for more information, they decided to go to the section of the library containing information on the Fire Nation, but it turned out that Zhao, before leaving, apparently destroyed every other bit of information about the Fire Nation, probably to prevent exactly what Sokka and the others were trying to do. However, a fox, who was one of Wan Shi Tong's animal helpers, found the group and led them to a room dedicated to astronomy. There, a date could be entered on a stone wheel, which subsequently showed the heavens on that particular date. When Sokka entered the date of \"the darkest day\", it showed a solar eclipse occurring. The group realized that solar eclipses must weaken or take away firebending power, in the same way lunar eclipses affect waterbending. With this knowledge, they realized they could use this information to plan an attack on the Fire Nation forces."
    },
    {
      "body": "${link_0} running from ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Wan Shi Tong",
          "key": "${link_1}",
          "target": {
            "href": "Wan_Shi_Tong",
            "page": "Wan_Shi_Tong"
          }
        }
      ],
      "text": "Katara running from Wan Shi Tong."
    },
    {
      "body": "Soon, however, Wan Shi Tong uncovered their plans, and decreed that he would no longer allow humans to misuse his beloved information. He attacked the group and began to sink the library so no human could abuse its knowledge again. During their escape, Sokka turned back for the planetarium with Aang in a hasty attempt to discover the date of the next solar eclipse, which was discovered to only be a few months away.",
      "links": [],
      "text": "Soon, however, Wan Shi Tong uncovered their plans, and decreed that he would no longer allow humans to misuse his beloved information. He attacked the group and began to sink the library so no human could abuse its knowledge again. During their escape, Sokka turned back for the planetarium with Aang in a hasty attempt to discover the date of the next solar eclipse, which was discovered to only be a few months away."
    },
    {
      "body": "Katara and Momo attempted to escape the angry spirit on their own, as the professor diverted his attention to books. Soon, she found herself facing down Wan Shi Tong, preparing to battle the creature as she had no escape route left; the spirit, however, did not fear her bending, claiming that he had vast knowledge on all three styles of waterbending. Katara was subsequently saved by Sokka, who intervened by landing on its head to knock it unconscious.",
      "links": [],
      "text": "Katara and Momo attempted to escape the angry spirit on their own, as the professor diverted his attention to books. Soon, she found herself facing down Wan Shi Tong, preparing to battle the creature as she had no escape route left; the spirit, however, did not fear her bending, claiming that he had vast knowledge on all three styles of waterbending. Katara was subsequently saved by Sokka, who intervened by landing on its head to knock it unconscious."
    },
    {
      "body": "The group promptly resumed their escape, except for Professor Zei, who said he would rather spend an eternity in the library than see it vanish forever; the others had no choice but to leave him, so they escaped before the library was sunk into the sand. They planned on giving the knowledge they had learned of the solar eclipse to the Earth Kingdom armies of ${link_0} to support the war effort. However, their enthusiasm over the gained information quickly subsided when they learned that Appa had been abducted.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "The group promptly resumed their escape, except for Professor Zei, who said he would rather spend an eternity in the library than see it vanish forever; the others had no choice but to leave him, so they escaped before the library was sunk into the sand. They planned on giving the knowledge they had learned of the solar eclipse to the Earth Kingdom armies of Ba Sing Se to support the war effort. However, their enthusiasm over the gained information quickly subsided when they learned that Appa had been abducted."
    },
    {
      "body": "Angry at Toph for having allowed the sandbenders to sneak up on her and steal Appa, Aang began to take his anger out on her verbally to which Katara replied by trying to calm him down. When Aang decided to go off looking for Appa on his own, she objected, but could not stop him from leaving. After watching him go, she decided it would be best if the rest of the group continued making their way toward Ba Sing Se. While lost in the desert, Katara evidently became the prominent figure in the group; with Aang depressed and uncooperative, Toph unable to \"see\" well among the sand and Sokka hallucinating due to cactus juice, it became her duty to keep the gang united. On their travels, they met up with a tribe of sandbenders, one of the members being identified by Toph as the one who stole Appa. Aang was so impacted by this that he went into the Avatar State; Katara embraced him and soothed his anger.",
      "links": [],
      "text": "Angry at Toph for having allowed the sandbenders to sneak up on her and steal Appa, Aang began to take his anger out on her verbally to which Katara replied by trying to calm him down. When Aang decided to go off looking for Appa on his own, she objected, but could not stop him from leaving. After watching him go, she decided it would be best if the rest of the group continued making their way toward Ba Sing Se. While lost in the desert, Katara evidently became the prominent figure in the group; with Aang depressed and uncooperative, Toph unable to \"see\" well among the sand and Sokka hallucinating due to cactus juice, it became her duty to keep the gang united. On their travels, they met up with a tribe of sandbenders, one of the members being identified by Toph as the one who stole Appa. Aang was so impacted by this that he went into the Avatar State; Katara embraced him and soothed his anger."
    },
    {
      "body": "${link_0} ${link_1} a safe passage.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Katara waterbending a safe passage."
    },
    {
      "body": "After leaving the desert, they met a refugee family traveling to Ba Sing Se. The group helped escort the family to an underground ferry way that led to the city. While there, Sokka and the others were reunited with the ${link_0} ${link_1}, who was there helping war refugees. Later, the refugee family lost their documents so Aang, Katara, Toph, Sokka, and Suki agreed to help them cross the ${link_2}.",
      "links": [
        {
          "body": "Kyoshi Warrior",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Suki",
          "key": "${link_1}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Serpent's Pass",
          "key": "${link_2}",
          "target": {
            "href": "Serpent%27s_Pass",
            "page": "Serpent%27s_Pass"
          }
        }
      ],
      "text": "After leaving the desert, they met a refugee family traveling to Ba Sing Se. The group helped escort the family to an underground ferry way that led to the city. While there, Sokka and the others were reunited with the Kyoshi Warrior Suki, who was there helping war refugees. Later, the refugee family lost their documents so Aang, Katara, Toph, Sokka, and Suki agreed to help them cross the Serpent's Pass."
    },
    {
      "body": "As the group traveled along a sheer cliff side of the pass, Suki pointed out Fire Nation forces patrolling the water, telling them that they were rumored to be working on a secret project. As they continued, ${link_0} fell when the ground under him crumbled. Toph saved him, but the falling rocks drew the attention of the patrol ship, which launched a fireball at them. Aang leaped into action, knocking the ball back and striking their engines. The ship returned fire, hitting the rockface above them, and sending debris falling toward Suki. Sokka pushed Suki out of the way, and Toph saved him by deflecting the rocks. Sokka was too worried about Suki's safety to be thankful to Toph for saving his life, which annoyed her. The group ran to the shelter of an outcropping wall of rock, leaving the ship behind to tend to its damage.",
      "links": [
        {
          "body": "Than",
          "key": "${link_0}",
          "target": {
            "href": "Than",
            "page": "Than"
          }
        }
      ],
      "text": "As the group traveled along a sheer cliff side of the pass, Suki pointed out Fire Nation forces patrolling the water, telling them that they were rumored to be working on a secret project. As they continued, Than fell when the ground under him crumbled. Toph saved him, but the falling rocks drew the attention of the patrol ship, which launched a fireball at them. Aang leaped into action, knocking the ball back and striking their engines. The ship returned fire, hitting the rockface above them, and sending debris falling toward Suki. Sokka pushed Suki out of the way, and Toph saved him by deflecting the rocks. Sokka was too worried about Suki's safety to be thankful to Toph for saving his life, which annoyed her. The group ran to the shelter of an outcropping wall of rock, leaving the ship behind to tend to its damage."
    },
    {
      "body": "While camping out for the night, Katara found Aang silently overlooking the water and confronted him about his recent behavior. She questioned him why he had seemingly stopped caring for Appa to which he replied that it was his way of controlling his emotions; the events in the Si Wong Desert had had a profound impact on his state of mind and, to suppress the anger he felt, he decided to act rather distant and uncaring. Katara identified with his feelings, saying she knew that sometimes it hurt more to care. She offered Aang a hug to which he replied by politely thanking her for her concern and walking away, leaving her disappointed.",
      "links": [],
      "text": "While camping out for the night, Katara found Aang silently overlooking the water and confronted him about his recent behavior. She questioned him why he had seemingly stopped caring for Appa to which he replied that it was his way of controlling his emotions; the events in the Si Wong Desert had had a profound impact on his state of mind and, to suppress the anger he felt, he decided to act rather distant and uncaring. Katara identified with his feelings, saying she knew that sometimes it hurt more to care. She offered Aang a hug to which he replied by politely thanking her for her concern and walking away, leaving her disappointed."
    },
    {
      "body": "${link_0} fighting the ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "serpent",
          "key": "${link_1}",
          "target": {
            "href": "Serpent",
            "page": "Serpent"
          }
        }
      ],
      "text": "Katara fighting the serpent."
    },
    {
      "body": "Next morning, Aang's group came to a large setback: a portion of the pass was submerged underwater. Katara stepped forward, parting the waters to allow them to pass. As the path got deeper, Aang helped her, forming a bubble of air for them to walk underwater safely. Momo, seeing the fish swimming by, jumped out into the water to catch one, but quickly jumped back in when something huge swam by. As it turns out, the Serpent's Pass was named and feared not for its shape, but for the ${link_0} that swam in the surrounding waters. The serpent attacked the bubble, forcing Toph to raise the seafloor under their feet to bring them up to the surface. This stranded them in the middle of the water, with the serpent circling around. Aang attacked the serpent, telling Katara to get the others across while he distracted it. Katara created an ice bridge for the others to cross before leaping across the water to help Aang without a second thought. Together, they managed to drive off the serpent, using currents to slam it into the cliff. The group finally crossed the Serpent's Pass, just in time for the mother to go into labor. Katara, who had experience in birthing children, quickly took charge.",
      "links": [
        {
          "body": "gigantic sea serpent",
          "key": "${link_0}",
          "target": {
            "href": "Serpent",
            "page": "Serpent"
          }
        }
      ],
      "text": "Next morning, Aang's group came to a large setback: a portion of the pass was submerged underwater. Katara stepped forward, parting the waters to allow them to pass. As the path got deeper, Aang helped her, forming a bubble of air for them to walk underwater safely. Momo, seeing the fish swimming by, jumped out into the water to catch one, but quickly jumped back in when something huge swam by. As it turns out, the Serpent's Pass was named and feared not for its shape, but for the gigantic sea serpent that swam in the surrounding waters. The serpent attacked the bubble, forcing Toph to raise the seafloor under their feet to bring them up to the surface. This stranded them in the middle of the water, with the serpent circling around. Aang attacked the serpent, telling Katara to get the others across while he distracted it. Katara created an ice bridge for the others to cross before leaping across the water to help Aang without a second thought. Together, they managed to drive off the serpent, using currents to slam it into the cliff. The group finally crossed the Serpent's Pass, just in time for the mother to go into labor. Katara, who had experience in birthing children, quickly took charge."
    },
    {
      "body": "The baby, a girl, was born with no complications, thanks to Katara. Aang, seeing the family coming together, renewed his hope, which was what the family decided to name the baby: ${link_0}. A short time later, outside, Aang confessed to Katara that he was truthfully running away from his emotions by acting distant and uncaring. He said that seeing the family of refugees so close and loving reminded him of his feelings toward Appa and her. Touched by this, she and Aang hugged. Before flying off to the city to find Appa, Katara reassured him that he would reunite with his bison. Aang flew over to the wall of Ba Sing Se, where he made a terrible discovery: a massive ${link_1}, escorted by Fire Nation tanks, was approaching the wall of the city.",
      "links": [
        {
          "body": "Hope",
          "key": "${link_0}",
          "target": {
            "href": "Hope",
            "page": "Hope"
          }
        },
        {
          "body": "drill",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        }
      ],
      "text": "The baby, a girl, was born with no complications, thanks to Katara. Aang, seeing the family coming together, renewed his hope, which was what the family decided to name the baby: Hope. A short time later, outside, Aang confessed to Katara that he was truthfully running away from his emotions by acting distant and uncaring. He said that seeing the family of refugees so close and loving reminded him of his feelings toward Appa and her. Touched by this, she and Aang hugged. Before flying off to the city to find Appa, Katara reassured him that he would reunite with his bison. Aang flew over to the wall of Ba Sing Se, where he made a terrible discovery: a massive drill, escorted by Fire Nation tanks, was approaching the wall of the city."
    },
    {
      "body": "${link_0} and ${link_1} helping to destroy the ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Fire Nation drill",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        }
      ],
      "text": "Katara and Toph helping to destroy the Fire Nation drill."
    },
    {
      "body": "After making the discovery, Aang flew on his glider back to where the rest of the gang and the refugees were making their way toward Ba Sing Se and informed them of the perilous situation. The duty of destroying the drill before it broke through the walls of Ba Sing Se fell into their hands. Sokka developed a plan to take the drill down by hitting its main pressure points which turned out to be large metal braces connecting the two main parts of the drill. The team, except Toph who decided to stay in a place where she could \"see\", entered the drill. Aang and Katara used waterbending to slice through the braces and weaken them; it was decided that Aang would go to the top of the drill and deliver a final blow that would destroy the drill completely. However, midway through their sabotage, Azula and her friends discovered them and attacked. The group split up with Aang going to the top of the drill and Katara and Sokka escaping by traveling down a slurry pipeline. Ty Lee chased after them persistently, but Katara used waterbending to plug up the exit to the drill, trapping her. Toph soon came along and aided her in building up the pressure that would lead to the machine's downfall. Aang was able to successfully deliver the final blow which caused the drill to break down, thus, marking their victory.",
      "links": [],
      "text": "After making the discovery, Aang flew on his glider back to where the rest of the gang and the refugees were making their way toward Ba Sing Se and informed them of the perilous situation. The duty of destroying the drill before it broke through the walls of Ba Sing Se fell into their hands. Sokka developed a plan to take the drill down by hitting its main pressure points which turned out to be large metal braces connecting the two main parts of the drill. The team, except Toph who decided to stay in a place where she could \"see\", entered the drill. Aang and Katara used waterbending to slice through the braces and weaken them; it was decided that Aang would go to the top of the drill and deliver a final blow that would destroy the drill completely. However, midway through their sabotage, Azula and her friends discovered them and attacked. The group split up with Aang going to the top of the drill and Katara and Sokka escaping by traveling down a slurry pipeline. Ty Lee chased after them persistently, but Katara used waterbending to plug up the exit to the drill, trapping her. Toph soon came along and aided her in building up the pressure that would lead to the machine's downfall. Aang was able to successfully deliver the final blow which caused the drill to break down, thus, marking their victory."
    },
    {
      "body": "The group later joined up together at the top of the Outer Wall marveling at their victory. Sokka enthusiastically began brainstorming nicknames for their group. Katara, like the others, was seemingly annoyed by this.",
      "links": [],
      "text": "The group later joined up together at the top of the Outer Wall marveling at their victory. Sokka enthusiastically began brainstorming nicknames for their group. Katara, like the others, was seemingly annoyed by this."
    },
    {
      "body": "Riding the monorail, the group finally entered Ba Sing Se. Sokka was confident that they would easily find Appa, but the city was bigger than they imagined. Soon after they arrived, Aang and his friends were met by ${link_0}, a cheerful, incessantly smiling woman assigned to guide them around the city. Attempts by Sokka to try and get their guide to talk about the War and a possible audience with the Earth King were invariably ignored.",
      "links": [
        {
          "body": "Joo Dee",
          "key": "${link_0}",
          "target": {
            "href": "Joo_Dee",
            "page": "Joo_Dee"
          }
        }
      ],
      "text": "Riding the monorail, the group finally entered Ba Sing Se. Sokka was confident that they would easily find Appa, but the city was bigger than they imagined. Soon after they arrived, Aang and his friends were met by Joo Dee, a cheerful, incessantly smiling woman assigned to guide them around the city. Attempts by Sokka to try and get their guide to talk about the War and a possible audience with the Earth King were invariably ignored."
    },
    {
      "body": "In the Upper Ring, Aang and his group were finally taken to their new ${link_0}. When a possible audience with the ${link_1} was finally heard by Joo Dee, she informed them that they would have to wait at least a month. It soon became apparent that within the walls of the city, no one wanted to talk or even think about the War raging in the rest of the world. Even Aang's attempts to find Appa bore no fruit as no one seemed willing to divulge any information to them, thanks to some meaningful glances from Joo Dee. Along the way, they also saw members of the Dai Li — elite guards who safeguard Ba Sing Se's culture and society.",
      "links": [
        {
          "body": "house",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar%27s_Upper_Ring_house",
            "page": "Team_Avatar%27s_Upper_Ring_house"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_1}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "In the Upper Ring, Aang and his group were finally taken to their new house. When a possible audience with the Earth King was finally heard by Joo Dee, she informed them that they would have to wait at least a month. It soon became apparent that within the walls of the city, no one wanted to talk or even think about the War raging in the rest of the world. Even Aang's attempts to find Appa bore no fruit as no one seemed willing to divulge any information to them, thanks to some meaningful glances from Joo Dee. Along the way, they also saw members of the Dai Li — elite guards who safeguard Ba Sing Se's culture and society."
    },
    {
      "body": "${link_0} and ${link_1} dressed up as fancy ladies.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Katara and Toph dressed up as fancy ladies."
    },
    {
      "body": "When a notice arrived about a party being held at the Royal Palace, Katara decided it was a good way to reach the Earth King. Toph said that since the gang was mostly commoners, they would be spotted right away if they went to the event as they had not learned proper society manners. In the end, Toph decided that Katara could pass off as a high born girl, and both of them dressed up in formal attire. They subsequently headed for the palace while Aang and Sokka entered as servants. The girls were initially refused entry by a guard, who rejected even ${link_0}. They eventually got inside by tagging along with an official named ${link_1}, but their attempts to sneak Aang and Sokka inside were stymied by Long Feng himself, who seemed determined to personally help them out. Soon the ${link_2} bound and gagged Katara and Toph with earthbending. Before they could meet the king, the team was taken to a library, where they confronted Long Feng and questioned him as to why they were not permitted to see the Earth King. When told that Long Feng was the head of all the resources including the military while the king's job was to merely oversee the preservation of the city's cultural heritage, Katara and the rest came to the conclusion that the king was simply a figurehead.",
      "links": [
        {
          "body": "Toph's family seal",
          "key": "${link_0}",
          "target": {
            "href": "Toph%27s_passport",
            "page": "Toph%27s_passport"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_1}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_2}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "When a notice arrived about a party being held at the Royal Palace, Katara decided it was a good way to reach the Earth King. Toph said that since the gang was mostly commoners, they would be spotted right away if they went to the event as they had not learned proper society manners. In the end, Toph decided that Katara could pass off as a high born girl, and both of them dressed up in formal attire. They subsequently headed for the palace while Aang and Sokka entered as servants. The girls were initially refused entry by a guard, who rejected even Toph's family seal. They eventually got inside by tagging along with an official named Long Feng, but their attempts to sneak Aang and Sokka inside were stymied by Long Feng himself, who seemed determined to personally help them out. Soon the Dai Li bound and gagged Katara and Toph with earthbending. Before they could meet the king, the team was taken to a library, where they confronted Long Feng and questioned him as to why they were not permitted to see the Earth King. When told that Long Feng was the head of all the resources including the military while the king's job was to merely oversee the preservation of the city's cultural heritage, Katara and the rest came to the conclusion that the king was simply a figurehead."
    },
    {
      "body": "Later, in their home, the group was busily cleaning themselves up for the day, aside from Toph who had yet to wake up. When Katara woke her, Toph presented herself with her hair a mess and her body covered in dust, or \"a healthy coating of earth!\" like she described it, considering herself ready. Katara suggested they have a \"girl's day out\", and took her to the ${link_0}. Toph agreed, warning her that the spa workers had better not touch her feet. This request was denied and Toph sent one of the attendants through the wall during a pedicure. The girls later took a mud bath where Toph used her earthbending to make creepy faces with the mud and scare away the attendant. Finally, the two relaxed in a sauna, using their bending to both feed the fire and create the steam.",
      "links": [
        {
          "body": "Fancy Lady Day Spa",
          "key": "${link_0}",
          "target": {
            "href": "Fancy_Lady_Day_Spa",
            "page": "Fancy_Lady_Day_Spa"
          }
        }
      ],
      "text": "Later, in their home, the group was busily cleaning themselves up for the day, aside from Toph who had yet to wake up. When Katara woke her, Toph presented herself with her hair a mess and her body covered in dust, or \"a healthy coating of earth!\" like she described it, considering herself ready. Katara suggested they have a \"girl's day out\", and took her to the Fancy Lady Day Spa. Toph agreed, warning her that the spa workers had better not touch her feet. This request was denied and Toph sent one of the attendants through the wall during a pedicure. The girls later took a mud bath where Toph used her earthbending to make creepy faces with the mud and scare away the attendant. Finally, the two relaxed in a sauna, using their bending to both feed the fire and create the steam."
    },
    {
      "body": "${link_0} and ${link_1} at the ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "spa",
          "key": "${link_2}",
          "target": {
            "href": "Fancy_Lady_Day_Spa",
            "page": "Fancy_Lady_Day_Spa"
          }
        }
      ],
      "text": "Katara and Toph at the spa."
    },
    {
      "body": "When the girls left the sauna now with make-up on their faces, they crossed a bridge, where a girl named ${link_0} and her friends made fun of Toph's make-up. Toph was upset by these remarks and Katara tried to urge her to ignore them. Toph, however, laughed back at the girls and earthbent the rock of the bridge from under them, dropping them into the water. Katara finished with her own parting shot by waterbending the girls downstream.",
      "links": [
        {
          "body": "Star",
          "key": "${link_0}",
          "target": {
            "href": "Star",
            "page": "Star"
          }
        }
      ],
      "text": "When the girls left the sauna now with make-up on their faces, they crossed a bridge, where a girl named Star and her friends made fun of Toph's make-up. Toph was upset by these remarks and Katara tried to urge her to ignore them. Toph, however, laughed back at the girls and earthbent the rock of the bridge from under them, dropping them into the water. Katara finished with her own parting shot by waterbending the girls downstream."
    },
    {
      "body": "Katara tried to console Toph as they continued walking on. The earthbender claimed that because she was blind, she did not have to worry so much about personal appearance or the approval of others, but added that the words of the girls still hurt her all the same as she shed a few tears. Katara complimented that Toph was not only confident and self-assured, but also pretty, to which Toph proclaimed she would like to return the compliment but had no idea what Katara looked like. Katara laughed at this and Toph gave her a friendly, although rather hard, punch on the arm.",
      "links": [],
      "text": "Katara tried to console Toph as they continued walking on. The earthbender claimed that because she was blind, she did not have to worry so much about personal appearance or the approval of others, but added that the words of the girls still hurt her all the same as she shed a few tears. Katara complimented that Toph was not only confident and self-assured, but also pretty, to which Toph proclaimed she would like to return the compliment but had no idea what Katara looked like. Katara laughed at this and Toph gave her a friendly, although rather hard, punch on the arm."
    },
    {
      "body": "${link_0} fighting ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Jet",
          "key": "${link_1}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        }
      ],
      "text": "Katara fighting Jet."
    },
    {
      "body": "Out in the city, the gang was putting up posters for the lost Appa when Katara ran into ${link_0}. Still furious from their last encounter, Katara immediately attacked him, completely ignoring his offer to help her find the ${link_1}. Jet tried to prove his honesty by dropping his ${link_2}, allowing Katara to pin him to the wall with ice spikes. When the others arrived, drawn by the noise, Jet tried again to explain himself. He admitted that he was a troubled person, but now a changed man who had put both his past and gang behind him. Jet showed them one of the missing Appa fliers and claimed his true intentions which were to help the gang find the lost bison. Toph, reading Jet's heartbeat and breathing patterns, pronounced that he was telling the truth. Katara remained distrustful, but agreed to follow his lead. Jet led them to a large empty warehouse, where he said they may have been holding Appa. Toph confirmed it by finding a tuft of Appa's fur. An ${link_3} said that Appa had been sent off to ${link_4}, down near the South Pole. Despite the stretch of the journey, the group agreed to travel there with Jet offering to come with them, but Katara once again became accusing of him. When asked by Toph if Jet was once her boyfriend, she denied it only to have Toph mockingly state that she could detect her lie.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        },
        {
          "body": "bison",
          "key": "${link_1}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "hook swords",
          "key": "${link_2}",
          "target": {
            "href": "Hook_swords",
            "page": "Hook_swords"
          }
        },
        {
          "body": "old cleaning man",
          "key": "${link_3}",
          "target": {
            "href": "Old_Sweepy",
            "page": "Old_Sweepy"
          }
        },
        {
          "body": "Whaletail Island",
          "key": "${link_4}",
          "target": {
            "href": "Whaletail_Island",
            "page": "Whaletail_Island"
          }
        }
      ],
      "text": "Out in the city, the gang was putting up posters for the lost Appa when Katara ran into Jet. Still furious from their last encounter, Katara immediately attacked him, completely ignoring his offer to help her find the bison. Jet tried to prove his honesty by dropping his hook swords, allowing Katara to pin him to the wall with ice spikes. When the others arrived, drawn by the noise, Jet tried again to explain himself. He admitted that he was a troubled person, but now a changed man who had put both his past and gang behind him. Jet showed them one of the missing Appa fliers and claimed his true intentions which were to help the gang find the lost bison. Toph, reading Jet's heartbeat and breathing patterns, pronounced that he was telling the truth. Katara remained distrustful, but agreed to follow his lead. Jet led them to a large empty warehouse, where he said they may have been holding Appa. Toph confirmed it by finding a tuft of Appa's fur. An old cleaning man said that Appa had been sent off to Whaletail Island, down near the South Pole. Despite the stretch of the journey, the group agreed to travel there with Jet offering to come with them, but Katara once again became accusing of him. When asked by Toph if Jet was once her boyfriend, she denied it only to have Toph mockingly state that she could detect her lie."
    },
    {
      "body": "On their way out, the group was sidetracked when ${link_0} and ${link_1} happened to come across them, inquiring Jet where he had been in the past days. Katara once again turned on Jet, saying she thought he had left his gang behind. Jet insisted that he had been living alone in the city, but Smellerbee claimed that he was dragged away by the Dai Li. Toph realized they were both telling the truth, even though their stories did not match. Sokka quickly figured that Jet had been ${link_2} by the Dai Li, which Katara tried to soothe using her ${link_3} techniques. This aided Jet in remembering that he had been taken to a secret facility under a lake. Hearing this, Sokka remembered Joo Dee had mentioned she had taken a \"vacation\" to Lake Laogai, which led Jet to fully recover his memory. The group made their way to the lake and Toph quickly found and uncovered the underwater entrance. They went inside, quietly making their way through the dark corridors.",
      "links": [
        {
          "body": "Smellerbee",
          "key": "${link_0}",
          "target": {
            "href": "Smellerbee",
            "page": "Smellerbee"
          }
        },
        {
          "body": "Longshot",
          "key": "${link_1}",
          "target": {
            "href": "Longshot",
            "page": "Longshot"
          }
        },
        {
          "body": "brainwashed",
          "key": "${link_2}",
          "target": {
            "href": "Brainwashing",
            "page": "Brainwashing"
          }
        },
        {
          "body": "healing",
          "key": "${link_3}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "On their way out, the group was sidetracked when Smellerbee and Longshot happened to come across them, inquiring Jet where he had been in the past days. Katara once again turned on Jet, saying she thought he had left his gang behind. Jet insisted that he had been living alone in the city, but Smellerbee claimed that he was dragged away by the Dai Li. Toph realized they were both telling the truth, even though their stories did not match. Sokka quickly figured that Jet had been brainwashed by the Dai Li, which Katara tried to soothe using her healing techniques. This aided Jet in remembering that he had been taken to a secret facility under a lake. Hearing this, Sokka remembered Joo Dee had mentioned she had taken a \"vacation\" to Lake Laogai, which led Jet to fully recover his memory. The group made their way to the lake and Toph quickly found and uncovered the underwater entrance. They went inside, quietly making their way through the dark corridors."
    },
    {
      "body": "${link_0} trying to ${link_1} ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "heal",
          "key": "${link_1}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        },
        {
          "body": "Jet",
          "key": "${link_2}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        }
      ],
      "text": "Katara trying to heal Jet."
    },
    {
      "body": "The gang found themselves confronted by Long Feng and several Dai Li agents. A battle quickly broke out. Long Feng escaped, with Aang and Jet in hot pursuit. After dealing a grievous blow to Jet, Long Feng escaped as the others entered the chamber. Katara tried to heal Jet, and realized just how badly he was injured. Longshot, to the surprise of all, speaking for the first time in front of the Avatar and his friends, told the team they should go and find Appa, and leave Jet to Smellerbee and himself. Jet tried to assure Katara that he would be fine, but as they left, Toph sorrowfully said that Jet was lying. Jet eventually died from his injuries.",
      "links": [],
      "text": "The gang found themselves confronted by Long Feng and several Dai Li agents. A battle quickly broke out. Long Feng escaped, with Aang and Jet in hot pursuit. After dealing a grievous blow to Jet, Long Feng escaped as the others entered the chamber. Katara tried to heal Jet, and realized just how badly he was injured. Longshot, to the surprise of all, speaking for the first time in front of the Avatar and his friends, told the team they should go and find Appa, and leave Jet to Smellerbee and himself. Jet tried to assure Katara that he would be fine, but as they left, Toph sorrowfully said that Jet was lying. Jet eventually died from his injuries."
    },
    {
      "body": "After Team Avatar exited the underground base, they were surrounded by Long Feng and Dai Li agents, but Appa appeared and defeated all of them. Aang and his friends were finally able reunite with the bison. Having now reunited with one another, Katara and Toph both insisted they leave Ba Sing Se. On the other hand, Sokka wanted to stay to inform the Earth King of all that was taking place within Ba Sing Se, as well as the approaching solar eclipse, as this was their entire reason for coming in the first place. Aang agreed with him and, ultimately, the others agreed, so all four rode Appa back to Ba Sing Se's Upper Ring, and managed to break into the palace, tearing their way through the ${link_0}, despite a strong defense.",
      "links": [
        {
          "body": "Royal Guards",
          "key": "${link_0}",
          "target": {
            "href": "Royal_Earthbender_Guards",
            "page": "Royal_Earthbender_Guards"
          }
        }
      ],
      "text": "After Team Avatar exited the underground base, they were surrounded by Long Feng and Dai Li agents, but Appa appeared and defeated all of them. Aang and his friends were finally able reunite with the bison. Having now reunited with one another, Katara and Toph both insisted they leave Ba Sing Se. On the other hand, Sokka wanted to stay to inform the Earth King of all that was taking place within Ba Sing Se, as well as the approaching solar eclipse, as this was their entire reason for coming in the first place. Aang agreed with him and, ultimately, the others agreed, so all four rode Appa back to Ba Sing Se's Upper Ring, and managed to break into the palace, tearing their way through the Royal Guards, despite a strong defense."
    },
    {
      "body": "At the palace, Katara and her friends finally reached the Earth King's throne room, where they were encountered by Long Feng and the Dai Li, who stood before the Earth King as a last defense. Aang went on to explain the various events going on of which the Earth King was unaware: a war outside Ba Sing Se's walls, Long Feng and the Dai Li's ${link_0}, the imprisonment of Appa, and the brainwashing of Jet and countless other individuals. The king, under the influence of Long Feng's deceitful lies, remained convinced there was no war and doubted their claims. After several attempts to convince the king, they finally decided to show the Earth King the Outer Wall, which had been earlier penetrated by the Fire Nation's drill. The king refused at first, but Sokka quickly convinced him to continue the investigation by letting him ride on Appa.",
      "links": [
        {
          "body": "conspiracy",
          "key": "${link_0}",
          "target": {
            "href": "Conspiracy_of_Ba_Sing_Se",
            "page": "Conspiracy_of_Ba_Sing_Se"
          }
        }
      ],
      "text": "At the palace, Katara and her friends finally reached the Earth King's throne room, where they were encountered by Long Feng and the Dai Li, who stood before the Earth King as a last defense. Aang went on to explain the various events going on of which the Earth King was unaware: a war outside Ba Sing Se's walls, Long Feng and the Dai Li's conspiracy, the imprisonment of Appa, and the brainwashing of Jet and countless other individuals. The king, under the influence of Long Feng's deceitful lies, remained convinced there was no war and doubted their claims. After several attempts to convince the king, they finally decided to show the Earth King the Outer Wall, which had been earlier penetrated by the Fire Nation's drill. The king refused at first, but Sokka quickly convinced him to continue the investigation by letting him ride on Appa."
    },
    {
      "body": "The Earth King arrived at the Outer Wall, and was shocked to see the remains of the Fire Nation's drill leading right up to and through Ba Sing Se's Outer Wall. Completely convinced that the War was in fact real, he had Long Feng arrested. Afterward, the group split up and Katara sacrificed an opportunity to see her father ${link_0} again, deciding to stay and assist the Earth King and letting her brother meet him instead. Aang came close to confessing his feelings for Katara, but was interrupted at the last moment by an enthusiastic Sokka.",
      "links": [
        {
          "body": "Hakoda",
          "key": "${link_0}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        }
      ],
      "text": "The Earth King arrived at the Outer Wall, and was shocked to see the remains of the Fire Nation's drill leading right up to and through Ba Sing Se's Outer Wall. Completely convinced that the War was in fact real, he had Long Feng arrested. Afterward, the group split up and Katara sacrificed an opportunity to see her father Hakoda again, deciding to stay and assist the Earth King and letting her brother meet him instead. Aang came close to confessing his feelings for Katara, but was interrupted at the last moment by an enthusiastic Sokka."
    },
    {
      "body": "${link_0} with the ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Council of Five",
          "key": "${link_1}",
          "target": {
            "href": "Council_of_Five",
            "page": "Council_of_Five"
          }
        }
      ],
      "text": "Katara with the Council of Five."
    },
    {
      "body": "The ${link_0} reviewed the invasion plan with Katara, who was accompanied by Momo. General ${link_1} explained that General Fong's base would be the staging point of the attack where they would send in troops, demonstrating the motion by earthbending several stone pieces representing Earth Kingdom forces, across a world map. Momo suddenly darted across the board and knocked the pillars over. Katara laughed at the lemur's actions and attempted to joke with the five generals, who were not amused by this. General How asked Katara to take a scroll detailing the invasion plans so that it would receive the seal of the Earth King, which would finalize the plan.",
      "links": [
        {
          "body": "Council of Five",
          "key": "${link_0}",
          "target": {
            "href": "Council_of_Five",
            "page": "Council_of_Five"
          }
        },
        {
          "body": "How",
          "key": "${link_1}",
          "target": {
            "href": "How",
            "page": "How"
          }
        }
      ],
      "text": "The Council of Five reviewed the invasion plan with Katara, who was accompanied by Momo. General How explained that General Fong's base would be the staging point of the attack where they would send in troops, demonstrating the motion by earthbending several stone pieces representing Earth Kingdom forces, across a world map. Momo suddenly darted across the board and knocked the pillars over. Katara laughed at the lemur's actions and attempted to joke with the five generals, who were not amused by this. General How asked Katara to take a scroll detailing the invasion plans so that it would receive the seal of the Earth King, which would finalize the plan."
    },
    {
      "body": "${link_0} defeated by ${link_1}, ${link_2}, and ${link_3}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Mai",
          "key": "${link_2}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_3}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "text": "Katara defeated by Azula, Mai, and Ty Lee."
    },
    {
      "body": "In Ba Sing Se, Katara and Momo decided to stop at a ${link_0} just before going to see the Earth King. As she entered, Katara saw Zuko reciting an order for tea to Iroh in the back of the shop and gasped in surprise before running off to warn the king. Katara rushed into the palace and told Azula, whom she believed was Suki, that Prince Zuko and Iroh had infiltrated the city. She urged them to inform the Earth King. As Azula calmly replied that that would not be necessary, Katara realized her mistake and recognized the Fire Nation's princess when she stepped into the light. Ty Lee hurtled into the air and disabled her. Azula and her friends stood over Katara's prone form and she remarked that it was time she should reunite with her brother Zuko again.",
      "links": [
        {
          "body": "new tea house",
          "key": "${link_0}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "text": "In Ba Sing Se, Katara and Momo decided to stop at a new tea house just before going to see the Earth King. As she entered, Katara saw Zuko reciting an order for tea to Iroh in the back of the shop and gasped in surprise before running off to warn the king. Katara rushed into the palace and told Azula, whom she believed was Suki, that Prince Zuko and Iroh had infiltrated the city. She urged them to inform the Earth King. As Azula calmly replied that that would not be necessary, Katara realized her mistake and recognized the Fire Nation's princess when she stepped into the light. Ty Lee hurtled into the air and disabled her. Azula and her friends stood over Katara's prone form and she remarked that it was time she should reunite with her brother Zuko again."
    },
    {
      "body": "${link_0} attempting to ${link_1} ${link_2}'s scar.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "heal",
          "key": "${link_1}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_2}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Katara attempting to heal Zuko's scar."
    },
    {
      "body": "Katara stood in a dark, ${link_0} cave when suddenly a light showed. Above, the entrance opened and Zuko was thrown down. When he first came into the cave Katara became defensive. She was initially furious to see him and told him that all he cared about was capturing the Avatar and how spreading war, violence, and hatred was in ${link_1}. When she tearfully said that he did not know the pain of the Fire Nation killing her mother, Zuko apologized and said that was something they both had in common, suddenly opening her heart to his loss.",
      "links": [
        {
          "body": "crystal-lighted",
          "key": "${link_0}",
          "target": {
            "href": "Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        },
        {
          "body": "his blood",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_Royal_Family",
            "page": "Fire_Nation_Royal_Family"
          }
        }
      ],
      "text": "Katara stood in a dark, crystal-lighted cave when suddenly a light showed. Above, the entrance opened and Zuko was thrown down. When he first came into the cave Katara became defensive. She was initially furious to see him and told him that all he cared about was capturing the Avatar and how spreading war, violence, and hatred was in his blood. When she tearfully said that he did not know the pain of the Fire Nation killing her mother, Zuko apologized and said that was something they both had in common, suddenly opening her heart to his loss."
    },
    {
      "body": "Down below in their prison, Katara apologized to Zuko for how she yelled at him and told him that for a long time, whenever she saw the face of the enemy, she saw Zuko's face. He turned away, touching his scar, assuming she was referencing it, a mark he felt was once symbol to his banishment and to his \"destiny\" of chasing the Avatar forever. In this brief time, he had gained Katara's trust to the point that she offered to heal his scar using the water from the Spirit Oasis. However, before she could do anything, Aang and Iroh broke into their holding cell, as Iroh ran to embrace his nephew and Katara bolted away to embrace Aang.",
      "links": [],
      "text": "Down below in their prison, Katara apologized to Zuko for how she yelled at him and told him that for a long time, whenever she saw the face of the enemy, she saw Zuko's face. He turned away, touching his scar, assuming she was referencing it, a mark he felt was once symbol to his banishment and to his \"destiny\" of chasing the Avatar forever. In this brief time, he had gained Katara's trust to the point that she offered to heal his scar using the water from the Spirit Oasis. However, before she could do anything, Aang and Iroh broke into their holding cell, as Iroh ran to embrace his nephew and Katara bolted away to embrace Aang."
    },
    {
      "body": "${link_0} fighting ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Katara fighting Azula."
    },
    {
      "body": "Zuko and Aang exchanged glares with each other, as the Fire Nation Prince grew angry that Iroh was with the Avatar, even attempting to attack Aang although quickly interrupted by Iroh who sent Katara and Aang off to help Sokka and Toph.",
      "links": [],
      "text": "Zuko and Aang exchanged glares with each other, as the Fire Nation Prince grew angry that Iroh was with the Avatar, even attempting to attack Aang although quickly interrupted by Iroh who sent Katara and Aang off to help Sokka and Toph."
    },
    {
      "body": "Aang and Katara rushed to save Toph and Sokka, however, Azula attacked them before the could leave. Without a moment's hesitation, Aang and Katara engaged in battle with the Fire Nation Princess. Just as Aang and Katara had her cornered, Zuko joined the scene. After a brief moment of dramatic tension, Zuko began fighting on Azula's side, to everyone's amazement. Katara fought against Azula for a few moments and almost managed to defeat her by entrapping her limbs with waterbending, but Azula was saved by Zuko. In the midst of the battle, the two pairs switched off, with Zuko now fighting Katara, both using elemental whips on opposite sides of a river. Katara expressed her furious disappointment in Zuko, how she thought he had changed. He replied inscrutably, \"I have changed.\" Meanwhile, Aang and Azula charged at one another; Azula sent a blast of fire, sending Aang soaring into the air.",
      "links": [],
      "text": "Aang and Katara rushed to save Toph and Sokka, however, Azula attacked them before the could leave. Without a moment's hesitation, Aang and Katara engaged in battle with the Fire Nation Princess. Just as Aang and Katara had her cornered, Zuko joined the scene. After a brief moment of dramatic tension, Zuko began fighting on Azula's side, to everyone's amazement. Katara fought against Azula for a few moments and almost managed to defeat her by entrapping her limbs with waterbending, but Azula was saved by Zuko. In the midst of the battle, the two pairs switched off, with Zuko now fighting Katara, both using elemental whips on opposite sides of a river. Katara expressed her furious disappointment in Zuko, how she thought he had changed. He replied inscrutably, \"I have changed.\" Meanwhile, Aang and Azula charged at one another; Azula sent a blast of fire, sending Aang soaring into the air."
    },
    {
      "body": "${link_0} leaving with ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Katara leaving with Aang."
    },
    {
      "body": "The fight continued with Katara taking on both Zuko and Azula, but taking on both skilled firebenders at once swiftly turned the tides and she was blown into a wall of crystal where she fell briefly unconscious. Thankfully, at this time Aang managed to rebound from the devastating blow he had last received from Azula. He slammed into the ground, creating a tidal wave of earth, barreling toward Azula and Zuko, but was stopped by the Dai Li. Soon, dozens of Dai Li poured into the catacombs, joining Zuko and Azula. During this time, Katara came to and climbed to her feet, having spotted Aang facing off a horde of Dai Li as well as Zuko and Azula. However, she was forced to swiftly enter a waterbending octopus form to defend herself from nearly a dozen Dai Li.",
      "links": [],
      "text": "The fight continued with Katara taking on both Zuko and Azula, but taking on both skilled firebenders at once swiftly turned the tides and she was blown into a wall of crystal where she fell briefly unconscious. Thankfully, at this time Aang managed to rebound from the devastating blow he had last received from Azula. He slammed into the ground, creating a tidal wave of earth, barreling toward Azula and Zuko, but was stopped by the Dai Li. Soon, dozens of Dai Li poured into the catacombs, joining Zuko and Azula. During this time, Katara came to and climbed to her feet, having spotted Aang facing off a horde of Dai Li as well as Zuko and Azula. However, she was forced to swiftly enter a waterbending octopus form to defend herself from nearly a dozen Dai Li."
    },
    {
      "body": "Horribly outmatched, Aang realized there was no other choice and did the only thing of which he could think. Creating a quick crystal shelter with earthbending, he meditated and decided to release his attachment to Katara in order to enter the Avatar State. Having successfully triggered the Avatar State, he rose into the air, but Azula shot him down with a lightning bolt to the back, killing him. At that moment, the Avatar Spirit fell from the plane of existence. As Aang fell back to the ground, Katara created and rode a large wave, overtaking all her enemies below, and caught him before he hit the ground. Falling to her knees and cradling Aang's lifeless body in her arms, she descended to tears, defenseless, as Azula and Zuko closed in on her. However, Iroh suddenly blasted fire between the two sides, intervening on Katara's behalf. He demanded her to escape while he held off Azula and the others for as long as he could. Regaining her senses, she escaped with Aang, before Iroh surrendered himself to the Dai Li and stared directly at Zuko, quickly turning his head away in shame.",
      "links": [],
      "text": "Horribly outmatched, Aang realized there was no other choice and did the only thing of which he could think. Creating a quick crystal shelter with earthbending, he meditated and decided to release his attachment to Katara in order to enter the Avatar State. Having successfully triggered the Avatar State, he rose into the air, but Azula shot him down with a lightning bolt to the back, killing him. At that moment, the Avatar Spirit fell from the plane of existence. As Aang fell back to the ground, Katara created and rode a large wave, overtaking all her enemies below, and caught him before he hit the ground. Falling to her knees and cradling Aang's lifeless body in her arms, she descended to tears, defenseless, as Azula and Zuko closed in on her. However, Iroh suddenly blasted fire between the two sides, intervening on Katara's behalf. He demanded her to escape while he held off Azula and the others for as long as he could. Regaining her senses, she escaped with Aang, before Iroh surrendered himself to the Dai Li and stared directly at Zuko, quickly turning his head away in shame."
    },
    {
      "body": "${link_0} reviving ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Katara reviving Aang."
    },
    {
      "body": "Katara carried Aang with her and joined up with Sokka, Toph, the Earth King, and ${link_0}. As they escaped Ba Sing Se on Appa, Katara used her Spirit Oasis water in an attempt to revive Aang. After a quick flash of light, Aang showed no response; Katara began to cry and held him close. Aang's tattoos glowed shortly thereafter and he opened his eyes and smiled at her. Overwhelmed and relieved that he was okay, Katara embraced him closer.",
      "links": [
        {
          "body": "Bosco",
          "key": "${link_0}",
          "target": {
            "href": "Bosco",
            "page": "Bosco"
          }
        }
      ],
      "text": "Katara carried Aang with her and joined up with Sokka, Toph, the Earth King, and Bosco. As they escaped Ba Sing Se on Appa, Katara used her Spirit Oasis water in an attempt to revive Aang. After a quick flash of light, Aang showed no response; Katara began to cry and held him close. Aang's tattoos glowed shortly thereafter and he opened his eyes and smiled at her. Overwhelmed and relieved that he was okay, Katara embraced him closer."
    },
    {
      "body": "Aang survived the lightning, but ended up in a comatose state. Azula was firmly in control of the city and as the Earth King, Bosco, and Team Avatar flew atop Appa's back over the Outer Wall and out of the city, the Earth King looked back and sadly proclaimed, \"The Earth Kingdom ... has fallen.\"",
      "links": [],
      "text": "Aang survived the lightning, but ended up in a comatose state. Azula was firmly in control of the city and as the Earth King, Bosco, and Team Avatar flew atop Appa's back over the Outer Wall and out of the city, the Earth King looked back and sadly proclaimed, \"The Earth Kingdom ... has fallen.\""
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Katara_(Spring_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Katara_(Spring_100_AG).html",
    "page": "History_of_Katara_(Spring_100_AG)",
    "title": "History of Katara (Spring 100 AG)"
  }
}