{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} was orphaned when he was six, but was taken care of by his brother, ${link_1}, in any way possible, even if that meant doing some illegal acts. Bolin's kind nature led him to reach out to a fallen ${link_2}, and in return, the old pro-bender took them in, offering the brothers a place to stay and a purpose, namely becoming a professional pro-bender.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Toza",
          "key": "${link_2}",
          "target": {
            "href": "Toza",
            "page": "Toza"
          }
        }
      ],
      "text": "Bolin was orphaned when he was six, but was taken care of by his brother, Mako, in any way possible, even if that meant doing some illegal acts. Bolin's kind nature led him to reach out to a fallen Toza, and in return, the old pro-bender took them in, offering the brothers a place to stay and a purpose, namely becoming a professional pro-bender."
    },
    {
      "body": "${link_0} stunned after learning of ${link_1}'s identity.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Bolin stunned after learning of Korra's identity."
    },
    {
      "body": "Bolin first encountered Korra when Toza caught her exploring the training gym inside the ${link_0}. He introduced himself to her and invited her to stay for the match that his team was competing in, much to Mako's displeasure. After his team defeated the ${link_1}, he found out Korra was the ${link_2} and taught her a few pro-bending basics in the art of earthbending.",
      "links": [
        {
          "body": "Pro-bending Arena",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "Golden Temple Tigerdillos",
          "key": "${link_1}",
          "target": {
            "href": "Golden_Temple_Tigerdillos",
            "page": "Golden_Temple_Tigerdillos"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Bolin first encountered Korra when Toza caught her exploring the training gym inside the Pro-bending Arena. He introduced himself to her and invited her to stay for the match that his team was competing in, much to Mako's displeasure. After his team defeated the Golden Temple Tigerdillos, he found out Korra was the Avatar and taught her a few pro-bending basics in the art of earthbending."
    },
    {
      "body": "Later, the ${link_0}' spot in the championship was endangered when ${link_1} did not show up for a match. Korra volunteered to take his place and Bolin agreed, forging the new team. In round three of their match against the ${link_2}, he and Mako were cornered while Korra fell back to zone three. However, after Korra held her own ground and the opposition exhausted themselves, Bolin and Mako fought back, eventually winning by a knockout and clinching a spot in the tournament.",
      "links": [
        {
          "body": "Fire Ferrets",
          "key": "${link_0}",
          "target": {
            "href": "Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        },
        {
          "body": "Hasook",
          "key": "${link_1}",
          "target": {
            "href": "Hasook",
            "page": "Hasook"
          }
        },
        {
          "body": "Pinnacle Palace Platypus Bears",
          "key": "${link_2}",
          "target": {
            "href": "Pinnacle_Palace_Platypus_Bears",
            "page": "Pinnacle_Palace_Platypus_Bears"
          }
        }
      ],
      "text": "Later, the Fire Ferrets' spot in the championship was endangered when Hasook did not show up for a match. Korra volunteered to take his place and Bolin agreed, forging the new team. In round three of their match against the Pinnacle Palace Platypus Bears, he and Mako were cornered while Korra fell back to zone three. However, after Korra held her own ground and the opposition exhausted themselves, Bolin and Mako fought back, eventually winning by a knockout and clinching a spot in the tournament."
    },
    {
      "body": "${link_0} and ${link_1} being kidnapped by ${link_2}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Shady Shin",
          "key": "${link_1}",
          "target": {
            "href": "Shady_Shin",
            "page": "Shady_Shin"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_2}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        }
      ],
      "text": "Bolin and Shady Shin being kidnapped by Equalists."
    },
    {
      "body": "Despite receiving a large sum of prize money for winning their last pro-bending match, the Fire Ferrets were still short on the funds they needed for the championship pot, having exhausted their funds by paying for gym usage and other necessities required as a pro-bending team. Bolin decided to use ${link_0} to earn some money at ${link_1} utilizing some circus tricks he had taught him, but his efforts were futile.",
      "links": [
        {
          "body": "Pabu",
          "key": "${link_0}",
          "target": {
            "href": "Pabu",
            "page": "Pabu"
          }
        },
        {
          "body": "Central City Station",
          "key": "${link_1}",
          "target": {
            "href": "Central_City_Station",
            "page": "Central_City_Station"
          }
        }
      ],
      "text": "Despite receiving a large sum of prize money for winning their last pro-bending match, the Fire Ferrets were still short on the funds they needed for the championship pot, having exhausted their funds by paying for gym usage and other necessities required as a pro-bending team. Bolin decided to use Pabu to earn some money at Central City Station utilizing some circus tricks he had taught him, but his efforts were futile."
    },
    {
      "body": "Downcast over the lean yield, he was approached by ${link_0}, who offered him big money in exchange for helping the Triple Threat Triad with security. Later that day, ${link_1}, Shady Shin, some other triad members, and Bolin were captured by Equalists to be the benders that would be exhibited in ${link_2}'s \"${link_3}\". There, Bolin witnessed Amon use his ability to remove people's bending on his prisoners.",
      "links": [
        {
          "body": "Shady Shin",
          "key": "${link_0}",
          "target": {
            "href": "Shady_Shin",
            "page": "Shady_Shin"
          }
        },
        {
          "body": "Lightning Bolt Zolt",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_Bolt_Zolt",
            "page": "Lightning_Bolt_Zolt"
          }
        },
        {
          "body": "Amon",
          "key": "${link_2}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "revelation",
          "key": "${link_3}",
          "target": {
            "href": "The_Revelation",
            "page": "The_Revelation"
          }
        }
      ],
      "text": "Downcast over the lean yield, he was approached by Shady Shin, who offered him big money in exchange for helping the Triple Threat Triad with security. Later that day, Lightning Bolt Zolt, Shady Shin, some other triad members, and Bolin were captured by Equalists to be the benders that would be exhibited in Amon's \"revelation\". There, Bolin witnessed Amon use his ability to remove people's bending on his prisoners."
    },
    {
      "body": "Just as Bolin's earthbending was about to be removed permanently, Korra caused a steam explosion to cover Mako while he rescued Bolin. The brothers escaped the ${link_0}, but once outside they were intercepted by Amon's ${link_1}. After both were defeated, Korra launched a surprise attack against the Lieutenant, incapacitating him long enough to call ${link_2}. Bolin was carried out of there in Naga's mouth, much to his displeasure.",
      "links": [
        {
          "body": "building",
          "key": "${link_0}",
          "target": {
            "href": "Rally_building",
            "page": "Rally_building"
          }
        },
        {
          "body": "lieutenant",
          "key": "${link_1}",
          "target": {
            "href": "Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "Naga",
          "key": "${link_2}",
          "target": {
            "href": "Naga",
            "page": "Naga"
          }
        }
      ],
      "text": "Just as Bolin's earthbending was about to be removed permanently, Korra caused a steam explosion to cover Mako while he rescued Bolin. The brothers escaped the building, but once outside they were intercepted by Amon's lieutenant. After both were defeated, Korra launched a surprise attack against the Lieutenant, incapacitating him long enough to call Naga. Bolin was carried out of there in Naga's mouth, much to his displeasure."
    },
    {
      "body": "${link_0} explaining to ${link_1} that the rose and pastry are his way to thank her for saving him from ${link_2}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Amon",
          "key": "${link_2}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        }
      ],
      "text": "Bolin explaining to Korra that the rose and pastry are his way to thank her for saving him from Amon."
    },
    {
      "body": "A few days later, Bolin showed up at ${link_0} to give Korra a rose and a pastry to thank her for helping him escape Amon. Simultaneously, ${link_1} of ${link_2} arrived with flowers and a large gift basket which overshadowed Bolin's small gift. Jealous, he asked Korra if Tarrlok was bothering her, stating he could \"have a word with him\". Amused by his suggestion, Korra refuted his claims, stating that Tarrlok was just some \"old guy\", which eased his mind considerably.",
      "links": [
        {
          "body": "Air Temple Island",
          "key": "${link_0}",
          "target": {
            "href": "Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "a messenger",
          "key": "${link_1}",
          "target": {
            "href": "Council_page",
            "page": "Council_page"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_2}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        }
      ],
      "text": "A few days later, Bolin showed up at Air Temple Island to give Korra a rose and a pastry to thank her for helping him escape Amon. Simultaneously, a messenger of Tarrlok arrived with flowers and a large gift basket which overshadowed Bolin's small gift. Jealous, he asked Korra if Tarrlok was bothering her, stating he could \"have a word with him\". Amused by his suggestion, Korra refuted his claims, stating that Tarrlok was just some \"old guy\", which eased his mind considerably."
    },
    {
      "body": "He attended a gala Tarrlok hosted in honor of Korra at ${link_0}, where he excitedly told her the news about ${link_1} sponsoring the Fire Ferrets.",
      "links": [
        {
          "body": "City Hall",
          "key": "${link_0}",
          "target": {
            "href": "City_Hall",
            "page": "City_Hall"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_1}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        }
      ],
      "text": "He attended a gala Tarrlok hosted in honor of Korra at City Hall, where he excitedly told her the news about Hiroshi Sato sponsoring the Fire Ferrets."
    },
    {
      "body": "Prior to the Pro-bending Tournament, Bolin attempted to approach Korra after a training practice. They were alone since Mako had left with ${link_0} for a lunch date. His advances were in vain, however, as Korra explained she needed to go back to Air Temple Island for ${link_1} training with ${link_2}. Back at home, while giving Pabu a bath, Bolin asked his brother what he thought of Korra \"in a girlfriend sorta way\". However, Mako advised against pursuing a relationship with a teammate; when Bolin still seemed doubtful, Mako explained that there was too much at stake with the tournament.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "airbending",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_2}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        }
      ],
      "text": "Prior to the Pro-bending Tournament, Bolin attempted to approach Korra after a training practice. They were alone since Mako had left with Asami for a lunch date. His advances were in vain, however, as Korra explained she needed to go back to Air Temple Island for airbending training with Tenzin. Back at home, while giving Pabu a bath, Bolin asked his brother what he thought of Korra \"in a girlfriend sorta way\". However, Mako advised against pursuing a relationship with a teammate; when Bolin still seemed doubtful, Mako explained that there was too much at stake with the tournament."
    },
    {
      "body": "${link_0} and ${link_1} having fun on their date.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Bolin and Korra having fun on their date."
    },
    {
      "body": "During their first match, Bolin and the Fire Ferrets, very much in-sync, defeated the ${link_0} in short order. After the match, he approached a slightly depressed Korra, who had just been rejected by Mako, and, after reassuring her with compliments, asked her to go on a date with him. Korra, encouraged by his praise, decided that she \"could use some fun\" and agreed to go. Bolin took Korra out to ${link_1}, a noodle shop that serves Water Tribe cuisine.",
      "links": [
        {
          "body": "Red Sands Rabaroos",
          "key": "${link_0}",
          "target": {
            "href": "Red_Sands_Rabaroos",
            "page": "Red_Sands_Rabaroos"
          }
        },
        {
          "body": "Narook's Seaweed Noodlery",
          "key": "${link_1}",
          "target": {
            "href": "Narook%27s_Seaweed_Noodlery",
            "page": "Narook%27s_Seaweed_Noodlery"
          }
        }
      ],
      "text": "During their first match, Bolin and the Fire Ferrets, very much in-sync, defeated the Red Sands Rabaroos in short order. After the match, he approached a slightly depressed Korra, who had just been rejected by Mako, and, after reassuring her with compliments, asked her to go on a date with him. Korra, encouraged by his praise, decided that she \"could use some fun\" and agreed to go. Bolin took Korra out to Narook's Seaweed Noodlery, a noodle shop that serves Water Tribe cuisine."
    },
    {
      "body": "During their date, they encountered ${link_0}. Bolin explained that he was a member of the reigning pro-bending champion team for three years, the ${link_1}, and advised Korra against confrontation. Korra ignored his advice and glared at Tahno, which resulted in his approach. Once at their table, he trash-talked the Fire Ferrets and almost succeeded in getting a rise out of Korra. Before things could get out of hand, Bolin warned her that fighting Tahno would lead to the Fire Ferrets' disqualification from the tournament.",
      "links": [
        {
          "body": "Tahno",
          "key": "${link_0}",
          "target": {
            "href": "Tahno",
            "page": "Tahno"
          }
        },
        {
          "body": "White Falls Wolfbats",
          "key": "${link_1}",
          "target": {
            "href": "White_Falls_Wolfbats",
            "page": "White_Falls_Wolfbats"
          }
        }
      ],
      "text": "During their date, they encountered Tahno. Bolin explained that he was a member of the reigning pro-bending champion team for three years, the White Falls Wolfbats, and advised Korra against confrontation. Korra ignored his advice and glared at Tahno, which resulted in his approach. Once at their table, he trash-talked the Fire Ferrets and almost succeeded in getting a rise out of Korra. Before things could get out of hand, Bolin warned her that fighting Tahno would lead to the Fire Ferrets' disqualification from the tournament."
    },
    {
      "body": "Korra instead called Naga, who roared at the Wolfbats' waterbender, startling him. Bolin had never seen Tahno that scared, and after seeing Korra's approach to the situation he declared her \"one of a kind\". Shortly after, the pair shared a drink at a bar. Bolin accidentally belched, becoming slightly embarrassed, but was pleased when Korra imitated him. This led to a belching competition, which continued until they burst into laughter. Afterward, they went sight-seeing at ${link_0}, which overlooks several locations in Republic City.",
      "links": [
        {
          "body": "Harmony Tower",
          "key": "${link_0}",
          "target": {
            "href": "Harmony_Tower",
            "page": "Harmony_Tower"
          }
        }
      ],
      "text": "Korra instead called Naga, who roared at the Wolfbats' waterbender, startling him. Bolin had never seen Tahno that scared, and after seeing Korra's approach to the situation he declared her \"one of a kind\". Shortly after, the pair shared a drink at a bar. Bolin accidentally belched, becoming slightly embarrassed, but was pleased when Korra imitated him. This led to a belching competition, which continued until they burst into laughter. Afterward, they went sight-seeing at Harmony Tower, which overlooks several locations in Republic City."
    },
    {
      "body": "In the quarterfinals of the Pro-bending Tournament against the Boar-q-pines, the team struggled. Bolin noticed that Mako and Korra were clearly out of sync, and he stepped up his attacks in light of this. He led the team to a critical second-round victory to keep them alive after a first-round defeat. When the third round ended in a tie, Mako stepped forward to fight out the one-on-one tiebreaker, but was halted by Bolin, who, commenting that Mako did not have his head \"in the game\", took his place. In a brief, but intense duel, Bolin successfully defeated the Boar-q-pines' earthbender, Chung, winning the match for the Fire Ferrets and displayed not only his exceptional abilities as an earthbender, but previously unseen assertiveness toward his older brother.",
      "links": [],
      "text": "In the quarterfinals of the Pro-bending Tournament against the Boar-q-pines, the team struggled. Bolin noticed that Mako and Korra were clearly out of sync, and he stepped up his attacks in light of this. He led the team to a critical second-round victory to keep them alive after a first-round defeat. When the third round ended in a tie, Mako stepped forward to fight out the one-on-one tiebreaker, but was halted by Bolin, who, commenting that Mako did not have his head \"in the game\", took his place. In a brief, but intense duel, Bolin successfully defeated the Boar-q-pines' earthbender, Chung, winning the match for the Fire Ferrets and displayed not only his exceptional abilities as an earthbender, but previously unseen assertiveness toward his older brother."
    },
    {
      "body": "${link_0} witnessing ${link_1} and ${link_2} kiss.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Bolin witnessing Mako and Korra kiss."
    },
    {
      "body": "That night, Bolin went to deliver a large bouquet of flowers to Korra, but was shocked to see her and Mako kissing. The sight left Bolin devastated, and he ran away from the arena crying. Bolin went to Narook's with Pabu, where he spent the night. The next morning, he was found by Mako, who had come to take him home. Bolin refused, stating Mako was no longer his brother, rather a \"brother-betrayer\", and Pabu was now the only one he could trust. Despite his protests Mako lifted him onto his shoulders and carried him home as the earthbender continued to cry.",
      "links": [],
      "text": "That night, Bolin went to deliver a large bouquet of flowers to Korra, but was shocked to see her and Mako kissing. The sight left Bolin devastated, and he ran away from the arena crying. Bolin went to Narook's with Pabu, where he spent the night. The next morning, he was found by Mako, who had come to take him home. Bolin refused, stating Mako was no longer his brother, rather a \"brother-betrayer\", and Pabu was now the only one he could trust. Despite his protests Mako lifted him onto his shoulders and carried him home as the earthbender continued to cry."
    },
    {
      "body": "During the semifinal, Bolin vomited in the middle of the first round after being pelted in the stomach. The Fire Ferrets continued to fall out of sync as the match progressed. Bolin was knocked out of the ring in the second and third rounds. In the last, his shoulder was seriously injured by the opposing earthbender before he was thrown out of the ring, shortly after his brother. This left Korra to face the other team on her own. On the way out of the pit, the brothers apologized to each other for letting their interests in Korra divide them. They subsequently watched the Avatar score a \"knockout\" in one fell swoop, allowing the team to advance to the final of the tournament.",
      "links": [],
      "text": "During the semifinal, Bolin vomited in the middle of the first round after being pelted in the stomach. The Fire Ferrets continued to fall out of sync as the match progressed. Bolin was knocked out of the ring in the second and third rounds. In the last, his shoulder was seriously injured by the opposing earthbender before he was thrown out of the ring, shortly after his brother. This left Korra to face the other team on her own. On the way out of the pit, the brothers apologized to each other for letting their interests in Korra divide them. They subsequently watched the Avatar score a \"knockout\" in one fell swoop, allowing the team to advance to the final of the tournament."
    },
    {
      "body": "Once they were out of the ring, Korra apologized for hurting Bolin's feelings as she ${link_0} Bolin's shoulder, and he forgave her, reaffirming their friendship.",
      "links": [
        {
          "body": "healed",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "Once they were out of the ring, Korra apologized for hurting Bolin's feelings as she healed Bolin's shoulder, and he forgave her, reaffirming their friendship."
    },
    {
      "body": "Bolin and his team were later preparing for the final match when they heard Amon interrupt a ${link_0} broadcast. The Equalist leader made a request to the ${link_1} to shut down the Pro-bending Arena or they would face \"severe consequences\". The team traveled on Naga to City Hall, hoping to discourage the Council from shutting down the arena, but by the time they got there, the Council had already unanimously agreed to do so, much to their disappointment. Just before the decision was made final, ${link_2} entered the meeting. She offered to bring the ${link_3} along for security detail if the match continued on as planned. This offer was accepted by Tarrlok and most of the Council, who decided to allow the match to continue, much to the Ferrets' excitement.",
      "links": [
        {
          "body": "radio",
          "key": "${link_0}",
          "target": {
            "href": "Radio",
            "page": "Radio"
          }
        },
        {
          "body": "United Republic Council",
          "key": "${link_1}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_2}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Metalbending Police Force",
          "key": "${link_3}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        }
      ],
      "text": "Bolin and his team were later preparing for the final match when they heard Amon interrupt a radio broadcast. The Equalist leader made a request to the United Republic Council to shut down the Pro-bending Arena or they would face \"severe consequences\". The team traveled on Naga to City Hall, hoping to discourage the Council from shutting down the arena, but by the time they got there, the Council had already unanimously agreed to do so, much to their disappointment. Just before the decision was made final, Lin Beifong entered the meeting. She offered to bring the Metalbending Police Force along for security detail if the match continued on as planned. This offer was accepted by Tarrlok and most of the Council, who decided to allow the match to continue, much to the Ferrets' excitement."
    },
    {
      "body": "Bolin dressed Pabu up in a miniature uniform and brought him out to the arena floor to perform tricks before the match started. In a close but controversially officiated match, the Fire Ferrets lost via a knockout in round three.",
      "links": [],
      "text": "Bolin dressed Pabu up in a miniature uniform and brought him out to the arena floor to perform tricks before the match started. In a close but controversially officiated match, the Fire Ferrets lost via a knockout in round three."
    },
    {
      "body": "${link_0} asking ${link_1} to start biting the ropes.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Pabu",
          "key": "${link_1}",
          "target": {
            "href": "Pabu",
            "page": "Pabu"
          }
        }
      ],
      "text": "Bolin asking Pabu to start biting the ropes."
    },
    {
      "body": "After the knockout, Equalists attacked the arena. By use of their ${link_0}, they stunned several members of the Metalbending Police Force. Bolin and the Fire Ferrets were stunned by the Lieutenant through use of his ${link_1} and subsequently tied up against a wooden post that held up the arena.",
      "links": [
        {
          "body": "electrified gloves",
          "key": "${link_0}",
          "target": {
            "href": "Electrified_glove",
            "page": "Electrified_glove"
          }
        },
        {
          "body": "electrified kali sticks",
          "key": "${link_1}",
          "target": {
            "href": "Electrified_kali_sticks",
            "page": "Electrified_kali_sticks"
          }
        }
      ],
      "text": "After the knockout, Equalists attacked the arena. By use of their electrified gloves, they stunned several members of the Metalbending Police Force. Bolin and the Fire Ferrets were stunned by the Lieutenant through use of his electrified kali sticks and subsequently tied up against a wooden post that held up the arena."
    },
    {
      "body": "Bolin soon spotted Pabu swimming in the water and motioned for him to bite through the rope that held the team together. After Pabu broke them free, Bolin and Mako awaited Korra's return from going after Amon and the Equalists. Lin brought the Avatar to safety, and the brothers met her for a hug.",
      "links": [],
      "text": "Bolin soon spotted Pabu swimming in the water and motioned for him to bite through the rope that held the team together. After Pabu broke them free, Bolin and Mako awaited Korra's return from going after Amon and the Equalists. Lin brought the Avatar to safety, and the brothers met her for a hug."
    },
    {
      "body": "After the attack at the championship, the Pro-bending Arena was shut down and Bolin and Mako were forced to leave their home. Accepting Asami's invitation, the brothers went to live at the ${link_0}, much to the earthbender's excitement, stating it was going to be \"the lap of luxury\" for them. After Korra refused Asami's offer to visit them the next day, Bolin, manipulating Pabu's legs and making his voice higher to make it look like Pabu was talking, encouraged the Avatar to take a break from the Equalist investigation and visit them at the estate, to which she finally agreed. When Korra arrived to the mansion, the group was swimming in the house's indoor pool. Bolin proceeded to show Korra the comforts and luxuries of the place by asking a ${link_1} to dry him and Pabu off. He and the rest of the group were soon invited by Asami to watch the racetrack where new ${link_2} are tested out.",
      "links": [
        {
          "body": "Sato estate",
          "key": "${link_0}",
          "target": {
            "href": "Sato_estate",
            "page": "Sato_estate"
          }
        },
        {
          "body": "butler",
          "key": "${link_1}",
          "target": {
            "href": "Butler",
            "page": "Butler"
          }
        },
        {
          "body": "Satomobiles",
          "key": "${link_2}",
          "target": {
            "href": "Satomobile",
            "page": "Satomobile"
          }
        }
      ],
      "text": "After the attack at the championship, the Pro-bending Arena was shut down and Bolin and Mako were forced to leave their home. Accepting Asami's invitation, the brothers went to live at the Sato estate, much to the earthbender's excitement, stating it was going to be \"the lap of luxury\" for them. After Korra refused Asami's offer to visit them the next day, Bolin, manipulating Pabu's legs and making his voice higher to make it look like Pabu was talking, encouraged the Avatar to take a break from the Equalist investigation and visit them at the estate, to which she finally agreed. When Korra arrived to the mansion, the group was swimming in the house's indoor pool. Bolin proceeded to show Korra the comforts and luxuries of the place by asking a butler to dry him and Pabu off. He and the rest of the group were soon invited by Asami to watch the racetrack where new Satomobiles are tested out."
    },
    {
      "body": "${link_0} tripping and taking out ${link_1} ${link_2}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Officer",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "Song",
          "key": "${link_2}",
          "target": {
            "href": "Song_(officer)",
            "page": "Song_(officer)"
          }
        }
      ],
      "text": "Bolin tripping and taking out Officer Song."
    },
    {
      "body": "After Korra overheard Hiroshi talking about a \"strike\" plan, his connection to the Equalists began to be suspected. When the investigation eventually yielded substantial evidence to incriminate Hiroshi; Lin, Tenzin, Korra, and some metalbending officers searched the Sato estate, which eventually led to the discovery of a tunnel that led to a ${link_0} beneath the Sato estate. The chief ordered Bolin, Mako, and Asami to wait inside the room where the tunnel was found, under the watch of ${link_1}. However, when they heard a clangorous sound underground, Bolin and Mako tricked the guard and managed to subdue him. The brothers left Asami and made their way down the tunnel, successfully being able to sneak in the factory.",
      "links": [
        {
          "body": "secret factory",
          "key": "${link_0}",
          "target": {
            "href": "Equalist_factory",
            "page": "Equalist_factory"
          }
        },
        {
          "body": "Officer Song",
          "key": "${link_1}",
          "target": {
            "href": "Song_(officer)",
            "page": "Song_(officer)"
          }
        }
      ],
      "text": "After Korra overheard Hiroshi talking about a \"strike\" plan, his connection to the Equalists began to be suspected. When the investigation eventually yielded substantial evidence to incriminate Hiroshi; Lin, Tenzin, Korra, and some metalbending officers searched the Sato estate, which eventually led to the discovery of a tunnel that led to a secret factory beneath the Sato estate. The chief ordered Bolin, Mako, and Asami to wait inside the room where the tunnel was found, under the watch of Officer Song. However, when they heard a clangorous sound underground, Bolin and Mako tricked the guard and managed to subdue him. The brothers left Asami and made their way down the tunnel, successfully being able to sneak in the factory."
    },
    {
      "body": "Once inside, the two discovered that Hiroshi had knocked Korra, Tenzin, Lin, and the other officers unconscious. Bolin managed to carry Tenzin on his back in order to save him, but he and his brother were soon cornered by Hiroshi, who confirmed their accusations that supporting the Fire Ferrets had been nothing but a ruse in order to gain their trust. Asami later entered the underground factory and electroshocked her father, thus saving Bolin and the other benders. The three helped the others escape the Sato estate via ${link_0}, but were forced to leave Lin's officers behind.",
      "links": [
        {
          "body": "airship",
          "key": "${link_0}",
          "target": {
            "href": "Police_airship",
            "page": "Police_airship"
          }
        }
      ],
      "text": "Once inside, the two discovered that Hiroshi had knocked Korra, Tenzin, Lin, and the other officers unconscious. Bolin managed to carry Tenzin on his back in order to save him, but he and his brother were soon cornered by Hiroshi, who confirmed their accusations that supporting the Fire Ferrets had been nothing but a ruse in order to gain their trust. Asami later entered the underground factory and electroshocked her father, thus saving Bolin and the other benders. The three helped the others escape the Sato estate via airship, but were forced to leave Lin's officers behind."
    },
    {
      "body": "While on the airship, Korra and Mako smoothed things over, and Korra invited her now homeless friends to live on Air Temple Island with her and Tenzin's family.",
      "links": [],
      "text": "While on the airship, Korra and Mako smoothed things over, and Korra invited her now homeless friends to live on Air Temple Island with her and Tenzin's family."
    },
    {
      "body": "${link_0} being arrested by the ${link_1}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Metalbending Police Force",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        }
      ],
      "text": "Bolin being arrested by the Metalbending Police Force."
    },
    {
      "body": "Not long after moving to Air Temple Island; Bolin, Mako, Asami, and Korra formed what Bolin called the new ${link_0}. The four used Asami's Satomobile to patrol the city looking for Equalists. On their first night they fought, defeated, and captured several Equalists, much to Tarrlok's dismay. The next night, they went out again only to find the police arresting innocent nonbenders. When Mako tried to stop the police after the Councilman's order to arrest Asami, he and Bolin were also arrested.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "text": "Not long after moving to Air Temple Island; Bolin, Mako, Asami, and Korra formed what Bolin called the new Team Avatar. The four used Asami's Satomobile to patrol the city looking for Equalists. On their first night they fought, defeated, and captured several Equalists, much to Tarrlok's dismay. The next night, they went out again only to find the police arresting innocent nonbenders. When Mako tried to stop the police after the Councilman's order to arrest Asami, he and Bolin were also arrested."
    },
    {
      "body": "After their arrest by the police, Mako and Bolin were placed in the same cell. As Bolin suffered from the lack of privacy while urinating, Lin busted the brothers out and relayed the message that Korra had gone missing. Worried, the brothers joined her, Tenzin, and Asami in a search for the Avatar. Before he could exit the cell, however, Lin metalbent Bolin's zipper up, much to his embarrassment.",
      "links": [],
      "text": "After their arrest by the police, Mako and Bolin were placed in the same cell. As Bolin suffered from the lack of privacy while urinating, Lin busted the brothers out and relayed the message that Korra had gone missing. Worried, the brothers joined her, Tenzin, and Asami in a search for the Avatar. Before he could exit the cell, however, Lin metalbent Bolin's zipper up, much to his embarrassment."
    },
    {
      "body": "Under the impression that Korra had been abducted by the Equalists, Bolin commented that he remembered riding through a tunnel when he was kidnapped himself. With this information, Lin used her ${link_0} abilities to discover an underground tunnel not far from the place where Mako had seen the Equalists take Bolin. Venturing underground, Asami asked Bolin whether he knew if Mako cherished more than feelings of friendship for Korra. Alarmed by this question, Bolin attempted to cover for his brother, but his evasive answers were quickly brushed aside and he was forced to tell the truth. In an attempt to cheer Asami up, he said that Mako and Korra's kiss probably meant nothing, and that he had been able to overcome it as well.",
      "links": [
        {
          "body": "seismic sense",
          "key": "${link_0}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        }
      ],
      "text": "Under the impression that Korra had been abducted by the Equalists, Bolin commented that he remembered riding through a tunnel when he was kidnapped himself. With this information, Lin used her seismic sense abilities to discover an underground tunnel not far from the place where Mako had seen the Equalists take Bolin. Venturing underground, Asami asked Bolin whether he knew if Mako cherished more than feelings of friendship for Korra. Alarmed by this question, Bolin attempted to cover for his brother, but his evasive answers were quickly brushed aside and he was forced to tell the truth. In an attempt to cheer Asami up, he said that Mako and Korra's kiss probably meant nothing, and that he had been able to overcome it as well."
    },
    {
      "body": "${link_0} euphorically challenging the ${link_1} to ${link_2} his attack after thwarting their advance with his ${link_3}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_1}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "chi block",
          "key": "${link_2}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_3}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Bolin euphorically challenging the Equalists to chi block his attack after thwarting their advance with his earthbending."
    },
    {
      "body": "When Lin overpowered two chi blockers moments later, she ordered Bolin and Asami to stand guard while the rest ventured further down the Equalists' base. After their presence had been discovered by the other Equalists, Bolin urged the group to get on a train-like vehicle to escape. The Equalists gave chase, but Bolin thwarted their advance by collapsing the tunnel with his earthbending, triumphantly calling out that they should try to \"chi block that\" and escaped along with the others through a makeshift exit.",
      "links": [],
      "text": "When Lin overpowered two chi blockers moments later, she ordered Bolin and Asami to stand guard while the rest ventured further down the Equalists' base. After their presence had been discovered by the other Equalists, Bolin urged the group to get on a train-like vehicle to escape. The Equalists gave chase, but Bolin thwarted their advance by collapsing the tunnel with his earthbending, triumphantly calling out that they should try to \"chi block that\" and escaped along with the others through a makeshift exit."
    },
    {
      "body": "They soon returned to City Hall in an attempt to expose Tarrlok for the kidnapping of Korra. The ${link_0} confirmed their suspicions by informing them that the Councilman was a ${link_1} and had taken the Avatar away the previous night. However, before anyone could undertake any action, Tarrlok incapacitated them with his bloodbending. While regaining consciousness, Bolin thought it had been a dream, but was pointed to the reality of it all by Asami. Later that evening, he watched Mako carry Korra onto Oogi after they had found Naga wandering through the city with Korra riding on her back.",
      "links": [
        {
          "body": "council page",
          "key": "${link_0}",
          "target": {
            "href": "Council_page",
            "page": "Council_page"
          }
        },
        {
          "body": "bloodbender",
          "key": "${link_1}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        }
      ],
      "text": "They soon returned to City Hall in an attempt to expose Tarrlok for the kidnapping of Korra. The council page confirmed their suspicions by informing them that the Councilman was a bloodbender and had taken the Avatar away the previous night. However, before anyone could undertake any action, Tarrlok incapacitated them with his bloodbending. While regaining consciousness, Bolin thought it had been a dream, but was pointed to the reality of it all by Asami. Later that evening, he watched Mako carry Korra onto Oogi after they had found Naga wandering through the city with Korra riding on her back."
    },
    {
      "body": "The next morning at breakfast, when Korra told everyone about what had happened to Tarrlok, Bolin seemed visibly upset about Amon's recent growth in power. Later, when Team Avatar left ${link_0} to fight the Equalists during the ${link_1}, Bolin questioned how they would pay for all of the tickets left on Asami's car, (when Korra had crashed it into a lamppost), to which Mako responded by burning the parking tickets.",
      "links": [
        {
          "body": "Air Temple Island",
          "key": "${link_0}",
          "target": {
            "href": "Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "attack on Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Battle_for_Republic_City",
            "page": "Battle_for_Republic_City"
          }
        }
      ],
      "text": "The next morning at breakfast, when Korra told everyone about what had happened to Tarrlok, Bolin seemed visibly upset about Amon's recent growth in power. Later, when Team Avatar left Air Temple Island to fight the Equalists during the attack on Republic City, Bolin questioned how they would pay for all of the tickets left on Asami's car, (when Korra had crashed it into a lamppost), to which Mako responded by burning the parking tickets."
    },
    {
      "body": "${link_0} using his ${link_1} to defeat a ${link_2}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "mecha tank",
          "key": "${link_2}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        }
      ],
      "text": "Bolin using his earthbending to defeat a mecha tank."
    },
    {
      "body": "Once the team reached the ${link_0}, where Tenzin had been nearly captured by Equalists, the team jumped out of the car as Bolin earthbent a ramp under the vehicle, sending it crashing into Equalist ${link_1}. After freeing Tenzin, a fight ensued between Team Avatar and the Equalists. After destroying the mecha tanks, Tenzin, Bolin, and the rest of Team Avatar quickly returned to Air Temple Island flying on ${link_2} after seeing that the island was being surrounded by ${link_3} in the distance. Once the group reached the island, they were instructed by Tenzin to flee and go into hiding. As soon as Tenzin's family flew away on Oogi, Team Avatar got on Naga and headed toward the waters surrounding the island. On their way down, however, Bolin noticed that the Lieutenant was attempting to attack them from a higher vantage point. Naga jumped and met the Lieutenant in mid-air and swiped him to the ground. Once the team made it to the edge of the water, Naga, who was still carrying all four members of the team, jumped into the water and began swimming toward the city as Korra waterbent a bubble of air around them. They soon arrived to one of the city's sewer lines, where Bolin and his friends looked out at the now Equalist-occupied Air Temple Island.",
      "links": [
        {
          "body": "police headquarters",
          "key": "${link_0}",
          "target": {
            "href": "Police_headquarters",
            "page": "Police_headquarters"
          }
        },
        {
          "body": "mecha tanks",
          "key": "${link_1}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "Oogi",
          "key": "${link_2}",
          "target": {
            "href": "Oogi",
            "page": "Oogi"
          }
        },
        {
          "body": "Equalist airships",
          "key": "${link_3}",
          "target": {
            "href": "Equalist_airship",
            "page": "Equalist_airship"
          }
        }
      ],
      "text": "Once the team reached the police headquarters, where Tenzin had been nearly captured by Equalists, the team jumped out of the car as Bolin earthbent a ramp under the vehicle, sending it crashing into Equalist mecha tanks. After freeing Tenzin, a fight ensued between Team Avatar and the Equalists. After destroying the mecha tanks, Tenzin, Bolin, and the rest of Team Avatar quickly returned to Air Temple Island flying on Oogi after seeing that the island was being surrounded by Equalist airships in the distance. Once the group reached the island, they were instructed by Tenzin to flee and go into hiding. As soon as Tenzin's family flew away on Oogi, Team Avatar got on Naga and headed toward the waters surrounding the island. On their way down, however, Bolin noticed that the Lieutenant was attempting to attack them from a higher vantage point. Naga jumped and met the Lieutenant in mid-air and swiped him to the ground. Once the team made it to the edge of the water, Naga, who was still carrying all four members of the team, jumped into the water and began swimming toward the city as Korra waterbent a bubble of air around them. They soon arrived to one of the city's sewer lines, where Bolin and his friends looked out at the now Equalist-occupied Air Temple Island."
    },
    {
      "body": "A few days after escaping the temple, Bolin and the rest of Team Avatar went into hiding underground with ${link_0}. As the vagabond was passing out dinner, Bolin told him that the food was \"the best-tasting street gruel he had ever had\". Later on, when ${link_1}'s fleet of ${link_2} ${link_3} arrived in Republic City's harbor and was immediately ambushed by Equalist ${link_4}, Bolin rhetorically asked how Hiroshi had found the time to constantly invent more \"evil machines\".",
      "links": [
        {
          "body": "Gommu",
          "key": "${link_0}",
          "target": {
            "href": "Gommu",
            "page": "Gommu"
          }
        },
        {
          "body": "General Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh_(United_Forces_general)",
            "page": "Iroh_(United_Forces_general)"
          }
        },
        {
          "body": "United Forces",
          "key": "${link_2}",
          "target": {
            "href": "United_Forces",
            "page": "United_Forces"
          }
        },
        {
          "body": "battleships",
          "key": "${link_3}",
          "target": {
            "href": "Battleship",
            "page": "Battleship"
          }
        },
        {
          "body": "biplanes",
          "key": "${link_4}",
          "target": {
            "href": "Biplane",
            "page": "Biplane"
          }
        }
      ],
      "text": "A few days after escaping the temple, Bolin and the rest of Team Avatar went into hiding underground with Gommu. As the vagabond was passing out dinner, Bolin told him that the food was \"the best-tasting street gruel he had ever had\". Later on, when General Iroh's fleet of United Forces battleships arrived in Republic City's harbor and was immediately ambushed by Equalist biplanes, Bolin rhetorically asked how Hiroshi had found the time to constantly invent more \"evil machines\"."
    },
    {
      "body": "${link_0} hugging ${link_1} before going their separate ways.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Bolin hugging Korra before going their separate ways."
    },
    {
      "body": "After the battleship fleet was destroyed and General Iroh was rescued by Korra, Bolin and the rest of the team once again requested the help of Gommu, this time to send a wire to ${link_0}, warning him not to bring his fleet of battleships into the harbor until they had dealt with the biplane problem. The group pinpointed the location of the ${link_1} on a map of Republic City, and Bolin, Iroh, and Asami decided that at dawn they were going to infiltrate the facility, while Korra and Mako opted to go after Amon. As they each said their goodbyes, Korra allowed Bolin to take Naga to the airfield, and the two wished each other luck, Bolin embracing the Avatar before her departure.",
      "links": [
        {
          "body": "Commander Bumi",
          "key": "${link_0}",
          "target": {
            "href": "Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Equalist airfield",
          "key": "${link_1}",
          "target": {
            "href": "Hiroshi%27s_secret_airfield",
            "page": "Hiroshi%27s_secret_airfield"
          }
        }
      ],
      "text": "After the battleship fleet was destroyed and General Iroh was rescued by Korra, Bolin and the rest of the team once again requested the help of Gommu, this time to send a wire to Commander Bumi, warning him not to bring his fleet of battleships into the harbor until they had dealt with the biplane problem. The group pinpointed the location of the Equalist airfield on a map of Republic City, and Bolin, Iroh, and Asami decided that at dawn they were going to infiltrate the facility, while Korra and Mako opted to go after Amon. As they each said their goodbyes, Korra allowed Bolin to take Naga to the airfield, and the two wished each other luck, Bolin embracing the Avatar before her departure."
    },
    {
      "body": "The next day, upon reaching the outskirts of the Equalist airfield, Bolin told Naga and Pabu to wait for them outside and not to follow them. As Bolin, Iroh, and Asami continued to approach the base, they were promptly electrocuted by an invisible fence surrounding the area. The group regained consciousness in prison, where they were visited by Hiroshi Sato. The former businessman told the group that he had intercepted General Iroh's wire to Bumi and that he knew exactly where his fleet was hiding. A few moments after Hiroshi left, Iroh asked Bolin if he knew how to ${link_0}, to which the earthbender replied that he did not. Moments later, Naga and Pabu broke into the airfield base and, using her incredible strength, the polar bear dog destroyed the iron bars that detained Bolin, Iroh, and Asami. Upon being freed, Bolin commented that they did not need metalbenders, as they had Naga. The group made their way outside in an attempt to intercept the Equalist counterattack.",
      "links": [
        {
          "body": "metalbend",
          "key": "${link_0}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        }
      ],
      "text": "The next day, upon reaching the outskirts of the Equalist airfield, Bolin told Naga and Pabu to wait for them outside and not to follow them. As Bolin, Iroh, and Asami continued to approach the base, they were promptly electrocuted by an invisible fence surrounding the area. The group regained consciousness in prison, where they were visited by Hiroshi Sato. The former businessman told the group that he had intercepted General Iroh's wire to Bumi and that he knew exactly where his fleet was hiding. A few moments after Hiroshi left, Iroh asked Bolin if he knew how to metalbend, to which the earthbender replied that he did not. Moments later, Naga and Pabu broke into the airfield base and, using her incredible strength, the polar bear dog destroyed the iron bars that detained Bolin, Iroh, and Asami. Upon being freed, Bolin commented that they did not need metalbenders, as they had Naga. The group made their way outside in an attempt to intercept the Equalist counterattack."
    },
    {
      "body": "${link_0} launching rocks at ${link_1}'s ${link_2}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_1}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "mecha tank",
          "key": "${link_2}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        }
      ],
      "text": "Bolin launching rocks at Hiroshi Sato's mecha tank."
    },
    {
      "body": "Bolin exited the hangar and utilized his earthbending to destroy the airstrips, effectively preventing any more biplanes from taking off. While he was doing this, however, three mecha tanks approached him from behind and launched metal cables at him. Before the cables reached Bolin, however, they were intercepted by Naga, who caught them with her mouth and proceeded to use them to swing at and destroy the mecha tanks. A few moments later, Bolin discovered that Asami and her father were engaging in a mecha tank battle in the hangar; he intervened by launching an onslaught of earthbending attacks at Hiroshi's tank as he called Hiroshi a \"horrible father\". Bolin, Asami, and Naga soon captured the Equalist.",
      "links": [],
      "text": "Bolin exited the hangar and utilized his earthbending to destroy the airstrips, effectively preventing any more biplanes from taking off. While he was doing this, however, three mecha tanks approached him from behind and launched metal cables at him. Before the cables reached Bolin, however, they were intercepted by Naga, who caught them with her mouth and proceeded to use them to swing at and destroy the mecha tanks. A few moments later, Bolin discovered that Asami and her father were engaging in a mecha tank battle in the hangar; he intervened by launching an onslaught of earthbending attacks at Hiroshi's tank as he called Hiroshi a \"horrible father\". Bolin, Asami, and Naga soon captured the Equalist."
    },
    {
      "body": "Later on, after Amon had escaped Republic City, Bolin was with the team on Air Temple Island trying to brighten Korra up by saying that at least she successfully airbent, however, this only earned him a number of sour looks from the others, causing him to back away quietly.",
      "links": [],
      "text": "Later on, after Amon had escaped Republic City, Bolin was with the team on Air Temple Island trying to brighten Korra up by saying that at least she successfully airbent, however, this only earned him a number of sour looks from the others, causing him to back away quietly."
    },
    {
      "body": "Bolin joined his friends at the ${link_0} as Korra was visiting Katara, who was attempting to restore her bending. After Katara failed to restore Korra's connection to water, earth, and fire, Bolin was visibly upset. Shortly after running away, Korra had an encounter with Avatar ${link_1}'s spirit, who restored her bending and transferred the knowledge of ${link_2} to her. Bolin, along with everyone else, was astonished at Korra's new power.",
      "links": [
        {
          "body": "Southern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "energybending",
          "key": "${link_2}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        }
      ],
      "text": "Bolin joined his friends at the Southern Water Tribe as Korra was visiting Katara, who was attempting to restore her bending. After Katara failed to restore Korra's connection to water, earth, and fire, Bolin was visibly upset. Shortly after running away, Korra had an encounter with Avatar Aang's spirit, who restored her bending and transferred the knowledge of energybending to her. Bolin, along with everyone else, was astonished at Korra's new power."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Bolin_(154_AG_-_170_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Bolin_(154_AG_-_170_AG).html",
    "page": "History_of_Bolin_(154_AG_-_170_AG)",
    "title": "History of Bolin (154 AG – 170 AG)"
  }
}