{
  "categories": [
    {
      "body": "Toph Beifong",
      "target": {
        "href": "Category_Toph_Beifong",
        "page": "Category_Toph_Beifong"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "After the ${link_0} stronghold, ${link_1}, was conquered by the ${link_2}, the members of ${link_3}, including ${link_4}, traveled to the Fire Nation archipelago to prepare for a ${link_5} of the ${link_6} during the ${link_7}.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Toph Beifong",
          "key": "${link_4}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "planned invasion",
          "key": "${link_5}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        },
        {
          "body": "Fire Nation Capital",
          "key": "${link_6}",
          "target": {
            "href": "Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        },
        {
          "body": "Day of Black Sun",
          "key": "${link_7}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        }
      ],
      "text": "After the Earth Kingdom stronghold, Ba Sing Se, was conquered by the Fire Nation, the members of Team Avatar, including Toph Beifong, traveled to the Fire Nation archipelago to prepare for a planned invasion of the Fire Nation Capital during the Day of Black Sun."
    },
    {
      "body": "${link_0} used her ${link_1} to ready a projectile aimed at the enemy ship.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Toph used her earthbending to ready a projectile aimed at the enemy ship."
    },
    {
      "body": "After fleeing Ba Sing Se, Toph and the rest of the team, now accompanied by ${link_0}, ${link_1}, ${link_2}, ${link_3}, and other friends, commandeered a ${link_4} and journeyed seaward toward the Fire Nation. Shortly after ${link_5} awoke from his coma, they encountered another Fire Nation ship. While the others hid, Hakoda and Bato, disguised in Fire Nation uniforms, confronted the ship's commander and fabricated replies to the latter's inquiries. After brief conversation, the officer prepared to depart, seemingly intending to allow the ship to continue its progress westward. However, after receiving information from the guards accompanying him that discredited the two men's claims, the officer correctly deduced that the ship had been captured and quietly expressed his intent to sink the vessel. Toph overheard this order and warned the others while swiftly dropping the captain and his guards into the water by way of ${link_6}. ${link_7} created distance between the two ships with a huge wave that nearly capsized the enemy ship. Despite the tremendous efforts of Katara and Toph, the ship took heavy damage from the pursuing Fire Nation ship. The situation worsened when the serpent of the Serpent's Pass emerged from the water; the serpent, however, was struck by a stray fireball launched by the enemy ship and, in retaliation, coiled itself around the vessel, thus halting the officer's pursuit of Team Avatar. When Aang later fled the ship, under the belief he must confront the Fire Lord independently, Toph, ${link_8}, and Katara split with Hakoda and the others to search for him; they eventually found Aang on ${link_9}.",
      "links": [
        {
          "body": "Hakoda",
          "key": "${link_0}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Bato",
          "key": "${link_1}",
          "target": {
            "href": "Bato",
            "page": "Bato"
          }
        },
        {
          "body": "Pipsqueak",
          "key": "${link_2}",
          "target": {
            "href": "Pipsqueak",
            "page": "Pipsqueak"
          }
        },
        {
          "body": "The Duke",
          "key": "${link_3}",
          "target": {
            "href": "The_Duke",
            "page": "The_Duke"
          }
        },
        {
          "body": "Fire Nation ship",
          "key": "${link_4}",
          "target": {
            "href": "Fire_Nation_cruiser",
            "page": "Fire_Nation_cruiser"
          }
        },
        {
          "body": "Aang",
          "key": "${link_5}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "metalbending",
          "key": "${link_6}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "Katara",
          "key": "${link_7}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_8}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Crescent Island",
          "key": "${link_9}",
          "target": {
            "href": "Crescent_Island",
            "page": "Crescent_Island"
          }
        }
      ],
      "text": "After fleeing Ba Sing Se, Toph and the rest of the team, now accompanied by Hakoda, Bato, Pipsqueak, The Duke, and other friends, commandeered a Fire Nation ship and journeyed seaward toward the Fire Nation. Shortly after Aang awoke from his coma, they encountered another Fire Nation ship. While the others hid, Hakoda and Bato, disguised in Fire Nation uniforms, confronted the ship's commander and fabricated replies to the latter's inquiries. After brief conversation, the officer prepared to depart, seemingly intending to allow the ship to continue its progress westward. However, after receiving information from the guards accompanying him that discredited the two men's claims, the officer correctly deduced that the ship had been captured and quietly expressed his intent to sink the vessel. Toph overheard this order and warned the others while swiftly dropping the captain and his guards into the water by way of metalbending. Katara created distance between the two ships with a huge wave that nearly capsized the enemy ship. Despite the tremendous efforts of Katara and Toph, the ship took heavy damage from the pursuing Fire Nation ship. The situation worsened when the serpent of the Serpent's Pass emerged from the water; the serpent, however, was struck by a stray fireball launched by the enemy ship and, in retaliation, coiled itself around the vessel, thus halting the officer's pursuit of Team Avatar. When Aang later fled the ship, under the belief he must confront the Fire Lord independently, Toph, Sokka, and Katara split with Hakoda and the others to search for him; they eventually found Aang on Crescent Island."
    },
    {
      "body": "${link_0} disguised herself as a ${link_1} citizen.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "Toph disguised herself as a Fire Nation citizen."
    },
    {
      "body": "Toph and the others ventured into Fire Nation territory with Aang using cloud manipulation to conceal ${link_0}. They took temporary shelter in a ${link_1} and sought out new clothes and accessories with which they could better blend into the Fire Nation. Toph ripped out the soles of her new shoes to maintain direct contact with the earth. When Aang decided to host a dance party in the cave for a class of ${link_2} students, Toph aided in reconstructing the place with ${link_3}.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "cave",
          "key": "${link_1}",
          "target": {
            "href": "Beach_cave",
            "page": "Beach_cave"
          }
        },
        {
          "body": "Fire Nation school",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation_school",
            "page": "Fire_Nation_school"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_3}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Toph and the others ventured into Fire Nation territory with Aang using cloud manipulation to conceal Appa. They took temporary shelter in a cave and sought out new clothes and accessories with which they could better blend into the Fire Nation. Toph ripped out the soles of her new shoes to maintain direct contact with the earth. When Aang decided to host a dance party in the cave for a class of Fire Nation school students, Toph aided in reconstructing the place with earthbending."
    },
    {
      "body": "When the gang traveled to the polluted fishing village in the middle of the ${link_0}, Katara became stricken with compassion for the poor people living there. For the next few nights, she disguised herself as the ${link_1} and helped the villagers, even destroying a ${link_2} which was polluting the river. The next day, Toph and the others, discovering that Katara had been feeding Appa berries to make him look ill and stay there to help the villagers, aided her in driving out the ${link_3}, who were terrorizing the village and used earthbending to clean the mud out of the river.",
      "links": [
        {
          "body": "Jang Hui River",
          "key": "${link_0}",
          "target": {
            "href": "Jang_Hui_River",
            "page": "Jang_Hui_River"
          }
        },
        {
          "body": "Painted Lady",
          "key": "${link_1}",
          "target": {
            "href": "Painted_Lady",
            "page": "Painted_Lady"
          }
        },
        {
          "body": "Fire Nation Army factory",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation_Army_factory",
            "page": "Fire_Nation_Army_factory"
          }
        },
        {
          "body": "Fire Nation soldiers",
          "key": "${link_3}",
          "target": {
            "href": "Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        }
      ],
      "text": "When the gang traveled to the polluted fishing village in the middle of the Jang Hui River, Katara became stricken with compassion for the poor people living there. For the next few nights, she disguised herself as the Painted Lady and helped the villagers, even destroying a Fire Nation Army factory which was polluting the river. The next day, Toph and the others, discovering that Katara had been feeding Appa berries to make him look ill and stay there to help the villagers, aided her in driving out the Fire Nation soldiers, who were terrorizing the village and used earthbending to clean the mud out of the river."
    },
    {
      "body": "Sokka, later, gave Toph a small piece of a ${link_0} that had fallen during a recent meteor shower. It instantly became a prized possession of hers and she began wearing it as a ${link_1}, which she used even after the end of the Hundred Year War.",
      "links": [
        {
          "body": "meteorite",
          "key": "${link_0}",
          "target": {
            "href": "Meteor",
            "page": "Meteor"
          }
        },
        {
          "body": "bracelet",
          "key": "${link_1}",
          "target": {
            "href": "Toph%27s_bracelet",
            "page": "Toph%27s_bracelet"
          }
        }
      ],
      "text": "Sokka, later, gave Toph a small piece of a meteorite that had fallen during a recent meteor shower. It instantly became a prized possession of hers and she began wearing it as a bracelet, which she used even after the end of the Hundred Year War."
    },
    {
      "body": "After their money started to run dangerously low, Toph used her earthbending to make money for the group by scamming people off the streets, mostly in games. After winning large amounts because of Toph, who was flaunting her blindness, and seeing many people being cheated because of it, Katara began to think the idea was wrong. Katara objected at the immorality of the idea and argued with Toph over the issue. Toph retorted and called her a \"motherly\" figure and complained bitterly that Katara was not her, Sokka or Aang's mother. Due to remarks made by Katara, Toph went on to say how much she hated her own parents.",
      "links": [],
      "text": "After their money started to run dangerously low, Toph used her earthbending to make money for the group by scamming people off the streets, mostly in games. After winning large amounts because of Toph, who was flaunting her blindness, and seeing many people being cheated because of it, Katara began to think the idea was wrong. Katara objected at the immorality of the idea and argued with Toph over the issue. Toph retorted and called her a \"motherly\" figure and complained bitterly that Katara was not her, Sokka or Aang's mother. Due to remarks made by Katara, Toph went on to say how much she hated her own parents."
    },
    {
      "body": "${link_0} exercised her ${link_1} talents to fool a con artist.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Toph exercised her earthbending talents to fool a con artist."
    },
    {
      "body": "Sokka found a wanted poster for 'The Runaway', the new alias of Toph in the city. After Sokka read it aloud, Toph was delighted at the nickname. After hearing how much money was being offered for her return, Toph convinced Sokka to keep the wanted poster as a secret by giving him funds for Appa's armor, as well as an atlas of the Fire Nation. Later, while going through Toph's possessions, Katara discovered the wanted poster and had an argument with her, to which Toph angrily replied again that Katara was not her mother and should not tell her what to do. Sokka later talked to Toph to try to mend the rift between her and Katara. As they discussed Katara's motherly instincts, Toph was brought to admitting that she appreciated the fact that Katara cared for her more than her real mother had, wiping away a tear at the fact. She demanded Sokka not to tell anyone about the vulnerabilities she had admitted to him, while unbeknownst to either of them Katara was bathing in the water below the cliff they were perched, having heard the whole thing and been brought to tears as well. When Toph and Sokka finally finished their talk, he left her to apologize to his sister for pulling the scams despite her qualms; though she was willing to do this and even interrupted Katara in order to get message acrossed, a touched Katara surprised her by suggesting that she and Toph would work together to make a cheat and collect the bounty that Toph had accumulated as the 'ultimate scam' and Toph would escape using metalbending.",
      "links": [],
      "text": "Sokka found a wanted poster for 'The Runaway', the new alias of Toph in the city. After Sokka read it aloud, Toph was delighted at the nickname. After hearing how much money was being offered for her return, Toph convinced Sokka to keep the wanted poster as a secret by giving him funds for Appa's armor, as well as an atlas of the Fire Nation. Later, while going through Toph's possessions, Katara discovered the wanted poster and had an argument with her, to which Toph angrily replied again that Katara was not her mother and should not tell her what to do. Sokka later talked to Toph to try to mend the rift between her and Katara. As they discussed Katara's motherly instincts, Toph was brought to admitting that she appreciated the fact that Katara cared for her more than her real mother had, wiping away a tear at the fact. She demanded Sokka not to tell anyone about the vulnerabilities she had admitted to him, while unbeknownst to either of them Katara was bathing in the water below the cliff they were perched, having heard the whole thing and been brought to tears as well. When Toph and Sokka finally finished their talk, he left her to apologize to his sister for pulling the scams despite her qualms; though she was willing to do this and even interrupted Katara in order to get message acrossed, a touched Katara surprised her by suggesting that she and Toph would work together to make a cheat and collect the bounty that Toph had accumulated as the 'ultimate scam' and Toph would escape using metalbending."
    },
    {
      "body": "${link_0} was detained as a result of her actions in the city.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Toph was detained as a result of her actions in the city."
    },
    {
      "body": "After faking handing her in to the police, it turned out to be a trap set by Combustion Man. Katara and Toph were placed in a prison made of wood, a material that neither of them can bend. Combustion Man, on the other hand, used them to lure Aang to the jail, allowing him kill the Avatar. As Aang and Sokka fought against Combustion Man, Katara bent her own sweat as a source of water to escape the prison. They raced to help Aang, and arrived just in time. Toph hurled a boulder at Combustion Man to divert his attention, which he exploded causing a pebble-sized fragment to hit him in his third eye. He got up and attempted to shoot only to find his chi blocked, and due to this, the group managed to escape unharmed. Later, Toph admitted she did not hate her parents, but missed them and felt guilty about what she did to them. With Katara acting as a scribe, she wrote down a heartfelt message for her parents. It was delivered using Sokka's newly adopted ${link_0}, ${link_1}, without Sokka's permission.",
      "links": [
        {
          "body": "messenger hawk",
          "key": "${link_0}",
          "target": {
            "href": "Messenger_hawk",
            "page": "Messenger_hawk"
          }
        },
        {
          "body": "Hawky",
          "key": "${link_1}",
          "target": {
            "href": "Hawky",
            "page": "Hawky"
          }
        }
      ],
      "text": "After faking handing her in to the police, it turned out to be a trap set by Combustion Man. Katara and Toph were placed in a prison made of wood, a material that neither of them can bend. Combustion Man, on the other hand, used them to lure Aang to the jail, allowing him kill the Avatar. As Aang and Sokka fought against Combustion Man, Katara bent her own sweat as a source of water to escape the prison. They raced to help Aang, and arrived just in time. Toph hurled a boulder at Combustion Man to divert his attention, which he exploded causing a pebble-sized fragment to hit him in his third eye. He got up and attempted to shoot only to find his chi blocked, and due to this, the group managed to escape unharmed. Later, Toph admitted she did not hate her parents, but missed them and felt guilty about what she did to them. With Katara acting as a scribe, she wrote down a heartfelt message for her parents. It was delivered using Sokka's newly adopted messenger hawk, Hawky, without Sokka's permission."
    },
    {
      "body": "${link_0} fought alongside two of her former competitors in ${link_1}: ${link_2} and ${link_3}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Earth Rumble VI",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Rumble_VI",
            "page": "Earth_Rumble_VI"
          }
        },
        {
          "body": "The Boulder",
          "key": "${link_2}",
          "target": {
            "href": "The_Boulder",
            "page": "The_Boulder"
          }
        },
        {
          "body": "The Hippo",
          "key": "${link_3}",
          "target": {
            "href": "The_Big_Bad_Hippo",
            "page": "The_Big_Bad_Hippo"
          }
        }
      ],
      "text": "Toph fought alongside two of her former competitors in Earth Rumble VI: The Boulder and The Hippo."
    },
    {
      "body": "Toph served as an earthbending soldier in the Invasion Force during the ${link_0}. When the Day of Black Sun began and the invasion force arrived on the island, she was introduced to ${link_1} and ${link_2}. She also encountered her former enemies, ${link_3} and ${link_4}; at first she prepared to fight them again, until The Boulder told her that they were fighting for their kingdom now, rather than for others' entertainment. At this point, they maintained a friendly partnership. When the invasion force traveled in the ${link_5}, designed by Sokka and the ${link_6}, she felt nauseous and threw up in The Duke's helmet. When the battle began, Toph fought alongside the other soldiers and most especially with The Boulder and The Hippo against the Fire Nation. She was seen hurling boulders against Fire Nation guard towers.",
      "links": [
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        },
        {
          "body": "Tyro",
          "key": "${link_1}",
          "target": {
            "href": "Tyro",
            "page": "Tyro"
          }
        },
        {
          "body": "Haru",
          "key": "${link_2}",
          "target": {
            "href": "Haru",
            "page": "Haru"
          }
        },
        {
          "body": "The Big Bad Hippo",
          "key": "${link_3}",
          "target": {
            "href": "The_Big_Bad_Hippo",
            "page": "The_Big_Bad_Hippo"
          }
        },
        {
          "body": "The Boulder",
          "key": "${link_4}",
          "target": {
            "href": "The_Boulder",
            "page": "The_Boulder"
          }
        },
        {
          "body": "waterbending-powered submarines",
          "key": "${link_5}",
          "target": {
            "href": "Waterbending-powered_submarine",
            "page": "Waterbending-powered_submarine"
          }
        },
        {
          "body": "mechanist",
          "key": "${link_6}",
          "target": {
            "href": "Mechanist",
            "page": "Mechanist"
          }
        }
      ],
      "text": "Toph served as an earthbending soldier in the Invasion Force during the invasion of the Fire Nation. When the Day of Black Sun began and the invasion force arrived on the island, she was introduced to Tyro and Haru. She also encountered her former enemies, The Big Bad Hippo and The Boulder; at first she prepared to fight them again, until The Boulder told her that they were fighting for their kingdom now, rather than for others' entertainment. At this point, they maintained a friendly partnership. When the invasion force traveled in the waterbending-powered submarines, designed by Sokka and the mechanist, she felt nauseous and threw up in The Duke's helmet. When the battle began, Toph fought alongside the other soldiers and most especially with The Boulder and The Hippo against the Fire Nation. She was seen hurling boulders against Fire Nation guard towers."
    },
    {
      "body": "Toph joined Sokka behind a wall of ${link_0} while he was commanding the invasion, due to his father being injured. Soon, they were joined by Hakoda and Katara and shortly afterward by Aang, who told them that the entire palace city was abandoned, and the ${link_1} was not there, leading Sokka to realize that they must had known about the invasion. While Aang believed that the Fire Lord must be away on a remote island, Sokka reasoned that he would have a secret bunker underneath the city where he could still be close enough to lead his nation. Toph volunteered to find this bunker and went off with Sokka, Aang and Appa to the base of the volcano. There, she used her ability to feel into earth with vibrations to locate the outer wall of the metallic bunker, and used earth and metalbending to open a hole for them. She leaded them inside and took them in the right direction, saying that the other way was a dead end. She continued to lead them through the bunker until they reached a river of lava, which Aang flew them over with his ${link_2}. They reached a large metal door, which Toph easily broke through, prompting Sokka to say he was \"so glad [they] added her to the group\". Eventually, they encountered ${link_3} ${link_4}, who quickly told them where the secret Fire Lord's throne room was. Just as the eclipse began, they reached the outer entrance of the throne room, which Aang broke through. However, instead of finding the Fire Lord, they found ${link_5} sitting on the throne.",
      "links": [
        {
          "body": "tanks",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending-powered_tank",
            "page": "Earthbending-powered_tank"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "staff",
          "key": "${link_2}",
          "target": {
            "href": "Airbender_staff",
            "page": "Airbender_staff"
          }
        },
        {
          "body": "War Minister",
          "key": "${link_3}",
          "target": {
            "href": "War_Minister",
            "page": "War_Minister"
          }
        },
        {
          "body": "Qin",
          "key": "${link_4}",
          "target": {
            "href": "Qin",
            "page": "Qin"
          }
        },
        {
          "body": "Azula",
          "key": "${link_5}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Toph joined Sokka behind a wall of tanks while he was commanding the invasion, due to his father being injured. Soon, they were joined by Hakoda and Katara and shortly afterward by Aang, who told them that the entire palace city was abandoned, and the Fire Lord was not there, leading Sokka to realize that they must had known about the invasion. While Aang believed that the Fire Lord must be away on a remote island, Sokka reasoned that he would have a secret bunker underneath the city where he could still be close enough to lead his nation. Toph volunteered to find this bunker and went off with Sokka, Aang and Appa to the base of the volcano. There, she used her ability to feel into earth with vibrations to locate the outer wall of the metallic bunker, and used earth and metalbending to open a hole for them. She leaded them inside and took them in the right direction, saying that the other way was a dead end. She continued to lead them through the bunker until they reached a river of lava, which Aang flew them over with his staff. They reached a large metal door, which Toph easily broke through, prompting Sokka to say he was \"so glad [they] added her to the group\". Eventually, they encountered War Minister Qin, who quickly told them where the secret Fire Lord's throne room was. Just as the eclipse began, they reached the outer entrance of the throne room, which Aang broke through. However, instead of finding the Fire Lord, they found Azula sitting on the throne."
    },
    {
      "body": "${link_0} easily evaded the ${link_1}'s assails in ${link_2}'s chamber.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_1}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Azula",
          "key": "${link_2}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Toph easily evaded the Dai Li's assails in Azula's chamber."
    },
    {
      "body": "Azula taunted them until the group began questioning her about her father's whereabouts. Toph warned her that she would be able to notice it if she was lying, until Azula successfully fooled her senses. Toph admitted she was good, but encased her body in stone and warned her to tell the truth anyway. However, the stone mysteriously broke apart. The group was shocked for a moment, before Azula revealed that she brought back two ${link_0} from Ba Sing Se. A furious battle ensued, with Aang and Toph fighting the Dai Li agents while trying to corner Azula. Eventually, both agents became trapped while Aang and Toph chased after Azula. Sokka realized that Azula was trying to keep the group here and wasted their eclipse time to defeat Ozai. After a furious confrontation during which Azula goaded Sokka into furiously questioning her for a minute, she regained her firebending and escaped. Aang wanted to fight the Fire Lord anyway, but Sokka and Toph agreed to leave, and they quickly escaped the bunker.",
      "links": [
        {
          "body": "Dai Li agents",
          "key": "${link_0}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "Azula taunted them until the group began questioning her about her father's whereabouts. Toph warned her that she would be able to notice it if she was lying, until Azula successfully fooled her senses. Toph admitted she was good, but encased her body in stone and warned her to tell the truth anyway. However, the stone mysteriously broke apart. The group was shocked for a moment, before Azula revealed that she brought back two Dai Li agents from Ba Sing Se. A furious battle ensued, with Aang and Toph fighting the Dai Li agents while trying to corner Azula. Eventually, both agents became trapped while Aang and Toph chased after Azula. Sokka realized that Azula was trying to keep the group here and wasted their eclipse time to defeat Ozai. After a furious confrontation during which Azula goaded Sokka into furiously questioning her for a minute, she regained her firebending and escaped. Aang wanted to fight the Fire Lord anyway, but Sokka and Toph agreed to leave, and they quickly escaped the bunker."
    },
    {
      "body": "Outside, Toph quickly joined the Invasion Force's escape, until they were cut off when the ${link_0} destroyed the submarines. The oldest members of the forces agreed to save the young people, while the others would be captured by the Fire Nation to escape later. So, Toph, the rest of the team and Teo, Haru and The Duke escaped to the ${link_1}, where they would take refuge, until Azula's attack.",
      "links": [
        {
          "body": "Fire Nation airships",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_1}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "text": "Outside, Toph quickly joined the Invasion Force's escape, until they were cut off when the Fire Nation airships destroyed the submarines. The oldest members of the forces agreed to save the young people, while the others would be captured by the Fire Nation to escape later. So, Toph, the rest of the team and Teo, Haru and The Duke escaped to the Western Air Temple, where they would take refuge, until Azula's attack."
    },
    {
      "body": "${link_0} scurried away from ${link_1} after he accidentally scorched her feet.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Toph scurried away from Zuko after he accidentally scorched her feet."
    },
    {
      "body": "After the invasion, the group dejectedly made its way to the Western Air Temple. When they crossed into the edge of a canyon, Toph excitedly announced that they had made it. While only Aang seemed to know what she was talking about, Toph said that the Temple was amazing. They found that the Temple was carved upside-down out of the canyon.",
      "links": [],
      "text": "After the invasion, the group dejectedly made its way to the Western Air Temple. When they crossed into the edge of a canyon, Toph excitedly announced that they had made it. While only Aang seemed to know what she was talking about, Toph said that the Temple was amazing. They found that the Temple was carved upside-down out of the canyon."
    },
    {
      "body": "While Teo, The Duke and Haru set out to explore the temple, Toph, Sokka, Katara and Aang decided to talk about their future plans to defeat the Fire Nation and Ozai, though Aang seemed reluctant. They discussed Aang finding a firebending teacher, but were unable to come up with any viable person. Aang ran off to play in the temple, while the others followed him. They landed next to a large fountain. While Aang tried to show them different parts of the temple, Toph announced that that would have to wait, and pointed out that Zuko was there.",
      "links": [],
      "text": "While Teo, The Duke and Haru set out to explore the temple, Toph, Sokka, Katara and Aang decided to talk about their future plans to defeat the Fire Nation and Ozai, though Aang seemed reluctant. They discussed Aang finding a firebending teacher, but were unable to come up with any viable person. Aang ran off to play in the temple, while the others followed him. They landed next to a large fountain. While Aang tried to show them different parts of the temple, Toph announced that that would have to wait, and pointed out that Zuko was there."
    },
    {
      "body": "Zuko told the others that he had changed and that he wished to join their group to teach Aang firebending. While the others immediately shot Zuko down and refused him, Toph stayed mostly silent and thoughtful. After Zuko left, the others angrily talked against him. When Katara called Zuko a liar, Toph told them that he was not lying and that he had been sincere the entire time. While the others continued to act angry, Toph recommended that they should at least consider Zuko as a possibility, since they were trying to find a firebending teacher for Aang and that he was the only one they knew. However, Aang, Katara and Sokka all flatly refused and Toph stormed off, angrily shouting that she wondered who was really the blind one among them.",
      "links": [],
      "text": "Zuko told the others that he had changed and that he wished to join their group to teach Aang firebending. While the others immediately shot Zuko down and refused him, Toph stayed mostly silent and thoughtful. After Zuko left, the others angrily talked against him. When Katara called Zuko a liar, Toph told them that he was not lying and that he had been sincere the entire time. While the others continued to act angry, Toph recommended that they should at least consider Zuko as a possibility, since they were trying to find a firebending teacher for Aang and that he was the only one they knew. However, Aang, Katara and Sokka all flatly refused and Toph stormed off, angrily shouting that she wondered who was really the blind one among them."
    },
    {
      "body": "Later that night, Toph found Zuko's campsite and approached him. However, Zuko was only just waking up and was startled by the sounds of someone approaching. When Toph did not immediately identify herself, he firebent at her in panicked self-defense. Toph tried to shield herself from the fire, but she stepped back while the fire was spreading and it burned her feet, causing her to panic and flee because she cannot see. Zuko followed, insisting that he wanted to help her even as she frantically earthbent at him in self-defense. Eventually he was hit and lost her. Toph rejoined the group, unable to walk because of her burned feet. While Katara attempted to ${link_0} her, Toph explained that she went to see Zuko last night and he burned her feet. She said that it was an accident but conceded that Zuko did a dangerous thing, firebending at her.",
      "links": [
        {
          "body": "heal",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "Later that night, Toph found Zuko's campsite and approached him. However, Zuko was only just waking up and was startled by the sounds of someone approaching. When Toph did not immediately identify herself, he firebent at her in panicked self-defense. Toph tried to shield herself from the fire, but she stepped back while the fire was spreading and it burned her feet, causing her to panic and flee because she cannot see. Zuko followed, insisting that he wanted to help her even as she frantically earthbent at him in self-defense. Eventually he was hit and lost her. Toph rejoined the group, unable to walk because of her burned feet. While Katara attempted to heal her, Toph explained that she went to see Zuko last night and he burned her feet. She said that it was an accident but conceded that Zuko did a dangerous thing, firebending at her."
    },
    {
      "body": "${link_0} agreed that ${link_1} should join them, stating that it would give her time to get back at him for burning her feet.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Toph agreed that Zuko should join them, stating that it would give her time to get back at him for burning her feet."
    },
    {
      "body": "Just when they were planning a retaliation attack on Zuko for harming Toph, they were attacked by Combustion Man. Zuko noticed this and intervened, and tried to get Combustion Man to stop his attack, but the assassin ignored him and even attacked him. Eventually, Combustion Man was taken out by Sokka's boomerang, but he stood up again and was finally defeated by Zuko. Aang thanked Zuko and he explained himself fully; the gang finally accepted him in the team, while Toph was the first to forgive him. She added that she had plenty of time now to pay him back for her feet, though there was no evidence of her ever trying to do so.",
      "links": [],
      "text": "Just when they were planning a retaliation attack on Zuko for harming Toph, they were attacked by Combustion Man. Zuko noticed this and intervened, and tried to get Combustion Man to stop his attack, but the assassin ignored him and even attacked him. Eventually, Combustion Man was taken out by Sokka's boomerang, but he stood up again and was finally defeated by Zuko. Aang thanked Zuko and he explained himself fully; the gang finally accepted him in the team, while Toph was the first to forgive him. She added that she had plenty of time now to pay him back for her feet, though there was no evidence of her ever trying to do so."
    },
    {
      "body": "Toph seemed to be more comfortable around Zuko than the others were, due to the fact that she did not have the emotional baggage of being constantly pursued by him like the others. Later, she informed the group how she learned to bend from the original source of earthbending, badgermoles, helpfully suggesting that Zuko try to find the original source of firebending in order to regain his powers.",
      "links": [],
      "text": "Toph seemed to be more comfortable around Zuko than the others were, due to the fact that she did not have the emotional baggage of being constantly pursued by him like the others. Later, she informed the group how she learned to bend from the original source of earthbending, badgermoles, helpfully suggesting that Zuko try to find the original source of firebending in order to regain his powers."
    },
    {
      "body": "After Sokka and Zuko rescued Hakoda from the ${link_0}, the Fire Nation attacked the Western Air Temple, and Toph's earthbending proved essential in saving her friends and allies as they escaped through the ruins.",
      "links": [
        {
          "body": "Boiling Rock",
          "key": "${link_0}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        }
      ],
      "text": "After Sokka and Zuko rescued Hakoda from the Boiling Rock, the Fire Nation attacked the Western Air Temple, and Toph's earthbending proved essential in saving her friends and allies as they escaped through the ruins."
    },
    {
      "body": "${link_0} was portrayed as a man in the play ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "The Boy in the Iceberg",
          "key": "${link_1}",
          "target": {
            "href": "The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        }
      ],
      "text": "Toph was portrayed as a man in the play The Boy in the Iceberg."
    },
    {
      "body": "Toph accompanied her group, now with ${link_0}, to ${link_1}, a play about themselves being shown on ${link_2}. She took great pleasure at teasing her friends about how \"accurate\" their portrayals on stage are. Toph was inaccurately portrayed by a large muscular man who claimed to see by letting out a \"sonic wave\" through the mouth and said that they call her Toph, because it sounded like \"Tough\". Toph, however, was thrilled at her \"tough guy\" image. During the play's intermission, Toph talked to Zuko about Iroh, who was reminded of him by the play. He was ashamed, remembering how he had betrayed him at Ba Sing Se.",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "The Boy in the Iceberg",
          "key": "${link_1}",
          "target": {
            "href": "The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        },
        {
          "body": "Ember Island",
          "key": "${link_2}",
          "target": {
            "href": "Ember_Island",
            "page": "Ember_Island"
          }
        }
      ],
      "text": "Toph accompanied her group, now with Suki, to The Boy in the Iceberg, a play about themselves being shown on Ember Island. She took great pleasure at teasing her friends about how \"accurate\" their portrayals on stage are. Toph was inaccurately portrayed by a large muscular man who claimed to see by letting out a \"sonic wave\" through the mouth and said that they call her Toph, because it sounded like \"Tough\". Toph, however, was thrilled at her \"tough guy\" image. During the play's intermission, Toph talked to Zuko about Iroh, who was reminded of him by the play. He was ashamed, remembering how he had betrayed him at Ba Sing Se."
    },
    {
      "body": "Toph comforted Zuko by telling him how ${link_0} had told her about him and that his uncle had faith that Zuko would find his way. Through this conversation, Toph was able to begin bonding with Zuko as the others had done on their previous field trips with him. She demonstrated her affection by punching him, much like she did with her other friends.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Toph comforted Zuko by telling him how Iroh had told her about him and that his uncle had faith that Zuko would find his way. Through this conversation, Toph was able to begin bonding with Zuko as the others had done on their previous field trips with him. She demonstrated her affection by punching him, much like she did with her other friends."
    },
    {
      "body": "When the play ended, Toph agreed with her group that it was a terrible show. This was due to its unpleasant ending, as she seemed to enjoy the beginning.",
      "links": [],
      "text": "When the play ended, Toph agreed with her group that it was a terrible show. This was due to its unpleasant ending, as she seemed to enjoy the beginning."
    },
    {
      "body": "${link_0} grabbed onto ${link_1}, hoping they would have a life-changing field trip.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Toph grabbed onto Zuko, hoping they would have a life-changing field trip."
    },
    {
      "body": "Prior to the arrival of ${link_0}, Toph and her friends had a beach party on Ember Island in ${link_1}, where she instantaneously ${link_2} a miniature model of Ba Sing Se. She challenged Sokka to try and top this sand construction, which he promptly failed to do by creating a giant blob of sand which was supposed to be a sculpture of Suki; Toph joked to Suki about the idea of breaking up with Sokka over how horrible it was, which Suki responded to by saying it was sweet of Sokka to have made it (despite the fact the results of his efforts were terrible). This party was promptly interrupted by Zuko when he attacked Aang in an effort to get the group to pay attention to their main goal, informing the group of Ozai's plot to destroy the Earth Kingdom on the day of the comet once they were finally paying attention due to his surprising actions. As the group drilled for their final assault, Toph played the Melon Lord. She really got into her role, nearly hitting Sokka with her earthbending, and refusing to listen to the name \"Toph\" as she was now \"Melon Lord\". When Aang disappeared, Toph eagerly joined Zuko in his search for Aang, as it was her turn for a \"life changing field trip\" with him. However, when she started talking about her family issues, Zuko curtly shut her down, leading her to remark that it was the \"worst field trip ever\".",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Ozai's beach house",
          "key": "${link_1}",
          "target": {
            "href": "Ozai%27s_beach_house",
            "page": "Ozai%27s_beach_house"
          }
        },
        {
          "body": "sandbent",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending#Special_techniques",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Prior to the arrival of Sozin's Comet, Toph and her friends had a beach party on Ember Island in Ozai's beach house, where she instantaneously sandbent a miniature model of Ba Sing Se. She challenged Sokka to try and top this sand construction, which he promptly failed to do by creating a giant blob of sand which was supposed to be a sculpture of Suki; Toph joked to Suki about the idea of breaking up with Sokka over how horrible it was, which Suki responded to by saying it was sweet of Sokka to have made it (despite the fact the results of his efforts were terrible). This party was promptly interrupted by Zuko when he attacked Aang in an effort to get the group to pay attention to their main goal, informing the group of Ozai's plot to destroy the Earth Kingdom on the day of the comet once they were finally paying attention due to his surprising actions. As the group drilled for their final assault, Toph played the Melon Lord. She really got into her role, nearly hitting Sokka with her earthbending, and refusing to listen to the name \"Toph\" as she was now \"Melon Lord\". When Aang disappeared, Toph eagerly joined Zuko in his search for Aang, as it was her turn for a \"life changing field trip\" with him. However, when she started talking about her family issues, Zuko curtly shut her down, leading her to remark that it was the \"worst field trip ever\"."
    },
    {
      "body": "${link_0} began the airship assault with her refined metalbending.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Toph began the airship assault with her refined metalbending."
    },
    {
      "body": "As the team was unable to find Aang even with ${link_0} and ${link_1}'s help, Zuko decided to request his uncle's help, as only he could defeat Ozai if Aang had disappeared. After they met and made a plan with the ${link_2}, Toph traveled with Sokka and Suki to Ba Sing Se to launch an attack on the Fire Lord's airship fleet and participated in the ${link_3}. Toph defeated the crew at the controls of an airship by bending a large metal door into a suit of armor, and easily overwhelming the crew with metalbending. The trio used the airship to destroy and ram into the rest of the ships, but Suki was separated in the process when the airship they were riding on split in half. With Suki telling them to complete the mission, Toph felt the forward half of the airship, which they were on, falling and warned Sokka that maybe they should jump, knowing that Suki could make it. After jumping onto another airship, with Sokka helping her, Toph forced the airships to crash into each other by bending their rudders, causing Sokka to admire her invention of metalbending. A Fire Nation soldier came out to inspect and discovered them. The soldier shot a giant fire blast at them, causing them to slip off the vessel while trying to avoid the fire. Sokka used his sword to slow their fall, which succeeded partially, but injured his leg upon landing. He grabbed Toph's hand as she fell overboard and managed to hold her while fighting off two Fire Nation guards, losing his ${link_4} in the process. Toph slipped more and more, each second and just as Toph was only hanging by a few fingers, Suki came in with an airship and saved the two.",
      "links": [
        {
          "body": "June",
          "key": "${link_0}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "Nyla",
          "key": "${link_1}",
          "target": {
            "href": "Nyla",
            "page": "Nyla"
          }
        },
        {
          "body": "Order of the White Lotus",
          "key": "${link_2}",
          "target": {
            "href": "Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        },
        {
          "body": "final battle",
          "key": "${link_3}",
          "target": {
            "href": "Battle_at_Wulong_Forest",
            "page": "Battle_at_Wulong_Forest"
          }
        },
        {
          "body": "sword and boomerang",
          "key": "${link_4}",
          "target": {
            "href": "Sokka%27s_weapons",
            "page": "Sokka%27s_weapons"
          }
        }
      ],
      "text": "As the team was unable to find Aang even with June and Nyla's help, Zuko decided to request his uncle's help, as only he could defeat Ozai if Aang had disappeared. After they met and made a plan with the Order of the White Lotus, Toph traveled with Sokka and Suki to Ba Sing Se to launch an attack on the Fire Lord's airship fleet and participated in the final battle. Toph defeated the crew at the controls of an airship by bending a large metal door into a suit of armor, and easily overwhelming the crew with metalbending. The trio used the airship to destroy and ram into the rest of the ships, but Suki was separated in the process when the airship they were riding on split in half. With Suki telling them to complete the mission, Toph felt the forward half of the airship, which they were on, falling and warned Sokka that maybe they should jump, knowing that Suki could make it. After jumping onto another airship, with Sokka helping her, Toph forced the airships to crash into each other by bending their rudders, causing Sokka to admire her invention of metalbending. A Fire Nation soldier came out to inspect and discovered them. The soldier shot a giant fire blast at them, causing them to slip off the vessel while trying to avoid the fire. Sokka used his sword to slow their fall, which succeeded partially, but injured his leg upon landing. He grabbed Toph's hand as she fell overboard and managed to hold her while fighting off two Fire Nation guards, losing his sword and boomerang in the process. Toph slipped more and more, each second and just as Toph was only hanging by a few fingers, Suki came in with an airship and saved the two."
    },
    {
      "body": "${link_0} happily taunted a defeated Ozai.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Toph happily taunted a defeated Ozai."
    },
    {
      "body": "The battle ended in a complete victory for the trio as all of the airships were destroyed and they soon reunited with Aang, who already had defeated Ozai. Toph and Sokka teased the defeated Ozai and Toph gently advised Suki to \"leave the nicknames to us\", after Suki failed to come up with an original joke.",
      "links": [],
      "text": "The battle ended in a complete victory for the trio as all of the airships were destroyed and they soon reunited with Aang, who already had defeated Ozai. Toph and Sokka teased the defeated Ozai and Toph gently advised Suki to \"leave the nicknames to us\", after Suki failed to come up with an original joke."
    },
    {
      "body": "After Zuko was crowned Fire Lord and the Hundred Year War ended, Toph joined the gang at ${link_0} in Ba Sing Se where they celebrated their victory. When everyone was complaining about Sokka's drawing she jokingly said that she thought they all looked \"perfect\".",
      "links": [
        {
          "body": "Iroh's tea shop",
          "key": "${link_0}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "text": "After Zuko was crowned Fire Lord and the Hundred Year War ended, Toph joined the gang at Iroh's tea shop in Ba Sing Se where they celebrated their victory. When everyone was complaining about Sokka's drawing she jokingly said that she thought they all looked \"perfect\"."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Toph_Beifong_(Summer_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Toph_Beifong_(Summer_100_AG).html",
    "page": "History_of_Toph_Beifong_(Summer_100_AG)",
    "title": "History of Toph Beifong (Summer 100 AG)"
  }
}