{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "After ${link_0} ${link_1} passed away, ${link_2} became the new Avatar. Her journey commenced after she traveled to ${link_3} to learn ${link_4} under ${link_5}'s tutelage. She discovered the metropolis to be out of balance due to the presence of ${link_6} and his ${link_7}.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_3}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "airbending",
          "key": "${link_4}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_5}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Amon",
          "key": "${link_6}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_7}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        }
      ],
      "text": "After Avatar Aang passed away, Korra became the new Avatar. Her journey commenced after she traveled to Republic City to learn airbending under Tenzin's tutelage. She discovered the metropolis to be out of balance due to the presence of Amon and his Equalists."
    },
    {
      "body": "Four-year-old ${link_0} proving herself as the ${link_1}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Four-year-old Korra proving herself as the Avatar."
    },
    {
      "body": "Korra was born to two waterbenders named ${link_0} and ${link_1} in the Southern Water Tribe, immediately following the death of Avatar Aang. At the age of four, she discovered her identity as the Avatar, a fact she proudly announced to the ${link_2} when they visited her home at her family's request. After performing waterbending, earthbending, and firebending before them, her identity as the Avatar was established, and her training to become a fully realized Avatar began in earnest under the Order's watchful eye.",
      "links": [
        {
          "body": "Tonraq",
          "key": "${link_0}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Senna",
          "key": "${link_1}",
          "target": {
            "href": "Senna",
            "page": "Senna"
          }
        },
        {
          "body": "Order of the White Lotus",
          "key": "${link_2}",
          "target": {
            "href": "Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        }
      ],
      "text": "Korra was born to two waterbenders named Tonraq and Senna in the Southern Water Tribe, immediately following the death of Avatar Aang. At the age of four, she discovered her identity as the Avatar, a fact she proudly announced to the Order of the White Lotus when they visited her home at her family's request. After performing waterbending, earthbending, and firebending before them, her identity as the Avatar was established, and her training to become a fully realized Avatar began in earnest under the Order's watchful eye."
    },
    {
      "body": "A year after Korra's identity as the Avatar was established, four members of the ${link_0} named ${link_1}, ${link_2}, ${link_3}, and ${link_4} attempted to kidnap her to train her in the ways of the Red Lotus. However, due to the efforts of Tonraq, ${link_5}, ${link_6}, and Tenzin, the attempt was thwarted and the criminals were apprehended. After the incident, Tonraq and Tenzin, Korra's eventual airbending master, came to a decision to have Korra secluded in the ${link_7} for her own safety. Around this time, the Water Tribe ${link_8} ${link_9} constantly sought Tonraq's permission to train Korra in the spiritual ways of the Water Tribe, but his estranged brother shot down his offers.",
      "links": [
        {
          "body": "Red Lotus",
          "key": "${link_0}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_1}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Ghazan",
          "key": "${link_2}",
          "target": {
            "href": "Ghazan",
            "page": "Ghazan"
          }
        },
        {
          "body": "Ming-Hua",
          "key": "${link_3}",
          "target": {
            "href": "Ming-Hua",
            "page": "Ming-Hua"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_4}",
          "target": {
            "href": "P%27Li",
            "page": "P%27Li"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_5}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_6}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Southern Water Tribe compound",
          "key": "${link_7}",
          "target": {
            "href": "Southern_Water_Tribe_compound",
            "page": "Southern_Water_Tribe_compound"
          }
        },
        {
          "body": "Chief",
          "key": "${link_8}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_9}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        }
      ],
      "text": "A year after Korra's identity as the Avatar was established, four members of the Red Lotus named Zaheer, Ghazan, Ming-Hua, and P'Li attempted to kidnap her to train her in the ways of the Red Lotus. However, due to the efforts of Tonraq, Sokka, Zuko, and Tenzin, the attempt was thwarted and the criminals were apprehended. After the incident, Tonraq and Tenzin, Korra's eventual airbending master, came to a decision to have Korra secluded in the Southern Water Tribe compound for her own safety. Around this time, the Water Tribe Chief Unalaq constantly sought Tonraq's permission to train Korra in the spiritual ways of the Water Tribe, but his estranged brother shot down his offers."
    },
    {
      "body": "Over the next thirteen years, Korra demonstrated a prodigious talent which allowed her to quickly master the arts of waterbending, earthbending, and firebending, as she completed her training of the latter by 170 ${link_0}. During her youth, she met and tamed a female ${link_1}, whom she named ${link_2} and who served as her animal companion.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "polar bear dog",
          "key": "${link_1}",
          "target": {
            "href": "Polar_bear_dog",
            "page": "Polar_bear_dog"
          }
        },
        {
          "body": "Naga",
          "key": "${link_2}",
          "target": {
            "href": "Naga",
            "page": "Naga"
          }
        }
      ],
      "text": "Over the next thirteen years, Korra demonstrated a prodigious talent which allowed her to quickly master the arts of waterbending, earthbending, and firebending, as she completed her training of the latter by 170 AG. During her youth, she met and tamed a female polar bear dog, whom she named Naga and who served as her animal companion."
    },
    {
      "body": "At the age of seventeen, Korra demonstrated her impressive firebending prowess to the Order of the White Lotus and ${link_0}, her waterbending teacher. Although completely controlling the sparring match against three firebending opponents, her spectators expressed concern over her lack of restraint and ignorance of spiritual matters. Despite this, and at Katara's suggestion that Korra was ready, the ${link_1} decided that she had successfully mastered fire, her third element, and was ready to commence her ${link_2} and gain spiritual enlightenment under Tenzin's tutelage. However, Korra's training was put on hold when Tenzin announced to Korra and Katara that the unrest in Republic City would prevent him from relocating to the Southern Water Tribe as planned. Unhappy with the news, Korra decided that if Tenzin could not come to her, she would go to him. With Katara's blessing and having said goodbye to her parents, she and Naga stowed away on a cargo ship heading for the city.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "White Lotus leader",
          "key": "${link_1}",
          "target": {
            "href": "White_Lotus_leader",
            "page": "White_Lotus_leader"
          }
        },
        {
          "body": "airbending training",
          "key": "${link_2}",
          "target": {
            "href": "Airbending_training",
            "page": "Airbending_training"
          }
        }
      ],
      "text": "At the age of seventeen, Korra demonstrated her impressive firebending prowess to the Order of the White Lotus and Katara, her waterbending teacher. Although completely controlling the sparring match against three firebending opponents, her spectators expressed concern over her lack of restraint and ignorance of spiritual matters. Despite this, and at Katara's suggestion that Korra was ready, the White Lotus leader decided that she had successfully mastered fire, her third element, and was ready to commence her airbending training and gain spiritual enlightenment under Tenzin's tutelage. However, Korra's training was put on hold when Tenzin announced to Korra and Katara that the unrest in Republic City would prevent him from relocating to the Southern Water Tribe as planned. Unhappy with the news, Korra decided that if Tenzin could not come to her, she would go to him. With Katara's blessing and having said goodbye to her parents, she and Naga stowed away on a cargo ship heading for the city."
    },
    {
      "body": "${link_0} being interrogated by ${link_1} ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Chief",
          "key": "${link_1}",
          "target": {
            "href": "Chief_of_Police",
            "page": "Chief_of_Police"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_2}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        }
      ],
      "text": "Korra being interrogated by Chief Lin Beifong."
    },
    {
      "body": "Upon their arrival in Republic City, Korra and Naga roamed the city streets, discovering for themselves just how out of balance the city really was, with its unequal division of wealth and rampant street crime. In a local ${link_0}, Korra came across an Equalist ${link_1} trying to rile up a crowd of nonbenders and convince them to join ${link_2} and the ${link_3}. After she called bending \"the coolest thing in the world\" and openly threatened to waterbend the protester off of his platform, the protester took advantage of her statements to rally the nonbenders against her and benders' oppressive nature and Korra retreated, leading Naga back onto the streets. Lost in the mazes of streets of the city, the Avatar halted to ask for directions. Her conversation was interrupted, however, after she noticed three members of the ${link_4} intimidating a local ${link_5}. Eager for a fight, she provoked and easily overwhelmed them, forcing them on the run. She thwarted their exit by catapulting their ${link_6} into a nearby shop with her earthbending. At that moment, the ${link_7} arrived and apprehended the triad members, but also charged Korra with destruction of private and city property. She attempted to flee to ${link_8}, but was subsequently caught by the ${link_9} officers and taken to the ${link_10}, where she was interrogated by a displeased ${link_11} ${link_12}. Although Tenzin managed to persuade her to drop all the charges against Korra, Lin made it very clear that she would keep an eye on the young Avatar.",
      "links": [
        {
          "body": "park",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Korra_Park",
            "page": "Avatar_Korra_Park"
          }
        },
        {
          "body": "protester",
          "key": "${link_1}",
          "target": {
            "href": "Protester",
            "page": "Protester"
          }
        },
        {
          "body": "Amon",
          "key": "${link_2}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_3}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Triple Threat Triad",
          "key": "${link_4}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "shopkeeper",
          "key": "${link_5}",
          "target": {
            "href": "Chung",
            "page": "Chung"
          }
        },
        {
          "body": "Satomobile",
          "key": "${link_6}",
          "target": {
            "href": "Satomobile",
            "page": "Satomobile"
          }
        },
        {
          "body": "Metalbending Police Force",
          "key": "${link_7}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "Air Temple Island",
          "key": "${link_8}",
          "target": {
            "href": "Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "metalbending",
          "key": "${link_9}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "police headquarters",
          "key": "${link_10}",
          "target": {
            "href": "Police_headquarters",
            "page": "Police_headquarters"
          }
        },
        {
          "body": "Chief",
          "key": "${link_11}",
          "target": {
            "href": "Chief_of_Police",
            "page": "Chief_of_Police"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_12}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        }
      ],
      "text": "Upon their arrival in Republic City, Korra and Naga roamed the city streets, discovering for themselves just how out of balance the city really was, with its unequal division of wealth and rampant street crime. In a local park, Korra came across an Equalist protester trying to rile up a crowd of nonbenders and convince them to join Amon and the Equalists. After she called bending \"the coolest thing in the world\" and openly threatened to waterbend the protester off of his platform, the protester took advantage of her statements to rally the nonbenders against her and benders' oppressive nature and Korra retreated, leading Naga back onto the streets. Lost in the mazes of streets of the city, the Avatar halted to ask for directions. Her conversation was interrupted, however, after she noticed three members of the Triple Threat Triad intimidating a local shopkeeper. Eager for a fight, she provoked and easily overwhelmed them, forcing them on the run. She thwarted their exit by catapulting their Satomobile into a nearby shop with her earthbending. At that moment, the Metalbending Police Force arrived and apprehended the triad members, but also charged Korra with destruction of private and city property. She attempted to flee to Air Temple Island, but was subsequently caught by the metalbending officers and taken to the police headquarters, where she was interrogated by a displeased Chief Lin Beifong. Although Tenzin managed to persuade her to drop all the charges against Korra, Lin made it very clear that she would keep an eye on the young Avatar."
    },
    {
      "body": "Even though Tenzin had promised to send her back home again, Korra managed to persuade him to let her stay and commence her airbending training under his tutelage. Her decision to take up residence at Air Temple Island was publicly announced at a press conference in front of ${link_0}, during which she stated that \"Avatar Aang meant for this city to be the center of peace and balance in the world,\" and that she would strive to attain that goal.",
      "links": [
        {
          "body": "City Hall",
          "key": "${link_0}",
          "target": {
            "href": "City_Hall",
            "page": "City_Hall"
          }
        }
      ],
      "text": "Even though Tenzin had promised to send her back home again, Korra managed to persuade him to let her stay and commence her airbending training under his tutelage. Her decision to take up residence at Air Temple Island was publicly announced at a press conference in front of City Hall, during which she stated that \"Avatar Aang meant for this city to be the center of peace and balance in the world,\" and that she would strive to attain that goal."
    },
    {
      "body": "${link_0} became enamored with the ${link_1} at the ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "pro-bending",
          "key": "${link_1}",
          "target": {
            "href": "Pro-bending",
            "page": "Pro-bending"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_2}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        }
      ],
      "text": "Korra became enamored with the pro-bending at the Pro-bending Arena."
    },
    {
      "body": "Despite Tenzin's expert guidance in airbending, Korra found herself struggling with mastering the element. She was continually frustrated at her inability to airbend and the fact that Tenzin would not allow her to attend a ${link_0} match, something she had wanted to do since childhood.",
      "links": [
        {
          "body": "pro-bending",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending",
            "page": "Pro-bending"
          }
        }
      ],
      "text": "Despite Tenzin's expert guidance in airbending, Korra found herself struggling with mastering the element. She was continually frustrated at her inability to airbend and the fact that Tenzin would not allow her to attend a pro-bending match, something she had wanted to do since childhood."
    },
    {
      "body": "Unwilling to sit idly on the island, Korra sneaked off at night so she could finally attend a match at the ${link_0}. Upon arriving, she was caught exploring the arena's gym by ${link_1}, but was bailed out by ${link_2}, who stated she was \"with him\". Following her rescuer, she was guided to the playing area where she was introduced to Bolin's brother, ${link_3}. Mako, however, scarcely acknowledged Korra, assuming she was just another one of Bolin's \"fangirls\". Korra hung around for the match and became enthralled with the sport and the brothers' team, the ${link_4}. After they had won, Korra expressed her admiration to Mako of his single-handed defeat of the ${link_5} in the third round, but he still remained distant, and even after learning Korra was the Avatar, his attitude showed little change.",
      "links": [
        {
          "body": "Pro-bending Arena",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "Toza",
          "key": "${link_1}",
          "target": {
            "href": "Toza",
            "page": "Toza"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_2}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_3}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Fire Ferrets",
          "key": "${link_4}",
          "target": {
            "href": "Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        },
        {
          "body": "Golden Temple Tigerdillos",
          "key": "${link_5}",
          "target": {
            "href": "Golden_Temple_Tigerdillos",
            "page": "Golden_Temple_Tigerdillos"
          }
        }
      ],
      "text": "Unwilling to sit idly on the island, Korra sneaked off at night so she could finally attend a match at the Pro-bending Arena. Upon arriving, she was caught exploring the arena's gym by Toza, but was bailed out by Bolin, who stated she was \"with him\". Following her rescuer, she was guided to the playing area where she was introduced to Bolin's brother, Mako. Mako, however, scarcely acknowledged Korra, assuming she was just another one of Bolin's \"fangirls\". Korra hung around for the match and became enthralled with the sport and the brothers' team, the Fire Ferrets. After they had won, Korra expressed her admiration to Mako of his single-handed defeat of the Golden Temple Tigerdillos in the third round, but he still remained distant, and even after learning Korra was the Avatar, his attitude showed little change."
    },
    {
      "body": "After the match, Bolin taught Korra some of the basics of pro-bending, and despite her lack of experience, Korra proved to be a natural. However, while her pro-bending skills showed great promise, her airbending training continued to show no visible progress, and ended with her destroying a priceless ${link_0} training tool with firebending in a fit of rage and turning her anger and frustration on Tenzin.",
      "links": [
        {
          "body": "Air Nomad",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "text": "After the match, Bolin taught Korra some of the basics of pro-bending, and despite her lack of experience, Korra proved to be a natural. However, while her pro-bending skills showed great promise, her airbending training continued to show no visible progress, and ended with her destroying a priceless Air Nomad training tool with firebending in a fit of rage and turning her anger and frustration on Tenzin."
    },
    {
      "body": "${link_0} joining the ${link_1} in her first ${link_2} match.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Fire Ferrets",
          "key": "${link_1}",
          "target": {
            "href": "Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        },
        {
          "body": "pro-bending",
          "key": "${link_2}",
          "target": {
            "href": "Pro-bending",
            "page": "Pro-bending"
          }
        }
      ],
      "text": "Korra joining the Fire Ferrets in her first pro-bending match."
    },
    {
      "body": "When the Fire Ferrets' waterbender, ${link_0}, appeared to be a \"no-show\" for the final match, Korra jumped at the chance to take his spot and compete. Her inexperience showed early on, however, as she struggled with the rules and pace of the game, and committed two successive fouls, prior to revealing herself as the Avatar by earthbending. After a short deliberation, the ${link_1} ruled she could continue to compete, but had to stick with waterbending. The opposing team seized upon Korra's lack of experience, directing attack after attack at her, eventually forcing her into the water below. As she surfaced, Korra found herself face to face with Tenzin, who had earlier discovered Korra's deception. Tenzin ordered her to return to Air Temple Island, but Korra refused, suggesting that she did not need to learn airbending, and that it was more important for her to learn modern styles of fighting, something pro-bending could help her with. Tenzin attempted to argue back, but Korra subsequently left to finish the match.",
      "links": [
        {
          "body": "Hasook",
          "key": "${link_0}",
          "target": {
            "href": "Hasook",
            "page": "Hasook"
          }
        },
        {
          "body": "official",
          "key": "${link_1}",
          "target": {
            "href": "Pro-bending_referees",
            "page": "Pro-bending_referees"
          }
        }
      ],
      "text": "When the Fire Ferrets' waterbender, Hasook, appeared to be a \"no-show\" for the final match, Korra jumped at the chance to take his spot and compete. Her inexperience showed early on, however, as she struggled with the rules and pace of the game, and committed two successive fouls, prior to revealing herself as the Avatar by earthbending. After a short deliberation, the official ruled she could continue to compete, but had to stick with waterbending. The opposing team seized upon Korra's lack of experience, directing attack after attack at her, eventually forcing her into the water below. As she surfaced, Korra found herself face to face with Tenzin, who had earlier discovered Korra's deception. Tenzin ordered her to return to Air Temple Island, but Korra refused, suggesting that she did not need to learn airbending, and that it was more important for her to learn modern styles of fighting, something pro-bending could help her with. Tenzin attempted to argue back, but Korra subsequently left to finish the match."
    },
    {
      "body": "In the third and final round, Korra found herself isolated from her teammates, and was quickly pushed back into the third zone. She was close to being knocked off the ring for a second time, but with grim determination, she managed to overcome her initial struggles, and applied some of her airbending lessons by moving around in her zone like \"a leaf in the wind\", proving to Tenzin, who was still watching, that his teachings were not all lost on her. This change in tactics surprised the opposing team, and together with Mako and Bolin, she managed to knock all three of the ring, thereby winning the match, and gaining the team access to the official ${link_0}. In contrast to his initial attitude, Mako appeared genuinely impressed at Korra's improvement, complimenting her on the abilities she had displayed during the match. Arriving back at Air Temple Island, Korra apologised to Tenzin for her previous comments, who in turn apologised for his own attitude, suggesting that pro-bending was the \"perfect teaching tool\" for Korra to learn airbending.",
      "links": [
        {
          "body": "Pro-bending Championship Tournament",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending#Pro-bending_Tournament",
            "page": "Pro-bending"
          }
        }
      ],
      "text": "In the third and final round, Korra found herself isolated from her teammates, and was quickly pushed back into the third zone. She was close to being knocked off the ring for a second time, but with grim determination, she managed to overcome her initial struggles, and applied some of her airbending lessons by moving around in her zone like \"a leaf in the wind\", proving to Tenzin, who was still watching, that his teachings were not all lost on her. This change in tactics surprised the opposing team, and together with Mako and Bolin, she managed to knock all three of the ring, thereby winning the match, and gaining the team access to the official Pro-bending Championship Tournament. In contrast to his initial attitude, Mako appeared genuinely impressed at Korra's improvement, complimenting her on the abilities she had displayed during the match. Arriving back at Air Temple Island, Korra apologised to Tenzin for her previous comments, who in turn apologised for his own attitude, suggesting that pro-bending was the \"perfect teaching tool\" for Korra to learn airbending."
    },
    {
      "body": "While Korra was practicing airbending on Air Temple Island with Jinora and Ikki, demonstrating considerable progress in her airbender maneuvers, the two sisters noticed Mako approaching from behind her and asked the Avatar about her feelings toward the firebender. Embarrassed, Korra promptly launched the girls into the air with earthbending before turning to greet Mako, who inquired as to whether she had seen Bolin. Korra replied that she had not, and after some insistence, she convinced Mako to let her help look for Bolin in the city. In ${link_0}, they met ${link_1}, who told them he had been recruited as extra security by the Triple Threat Triad. When Mako and Korra made it to the ${link_2}, they witnessed Bolin being kidnapped by chi blockers, and attempted to chase him down. However, the duo was defeated, and they lost Bolin's trail.",
      "links": [
        {
          "body": "Central City Station",
          "key": "${link_0}",
          "target": {
            "href": "Central_City_Station",
            "page": "Central_City_Station"
          }
        },
        {
          "body": "Skoochy",
          "key": "${link_1}",
          "target": {
            "href": "Skoochy",
            "page": "Skoochy"
          }
        },
        {
          "body": "triad's headquarters",
          "key": "${link_2}",
          "target": {
            "href": "Triple_Threat_Triad_headquarters",
            "page": "Triple_Threat_Triad_headquarters"
          }
        }
      ],
      "text": "While Korra was practicing airbending on Air Temple Island with Jinora and Ikki, demonstrating considerable progress in her airbender maneuvers, the two sisters noticed Mako approaching from behind her and asked the Avatar about her feelings toward the firebender. Embarrassed, Korra promptly launched the girls into the air with earthbending before turning to greet Mako, who inquired as to whether she had seen Bolin. Korra replied that she had not, and after some insistence, she convinced Mako to let her help look for Bolin in the city. In Central City Station, they met Skoochy, who told them he had been recruited as extra security by the Triple Threat Triad. When Mako and Korra made it to the triad's headquarters, they witnessed Bolin being kidnapped by chi blockers, and attempted to chase him down. However, the duo was defeated, and they lost Bolin's trail."
    },
    {
      "body": "Roaming around without direction, Korra suddenly remembered the anti-bender protester she had encountered when she first arrived, and decided to seek him out in hopes of gaining information about where Bolin was taken. Mako and Korra spent the night in Republic City Park, where the protester would be during the day. While there, Mako told Korra that his parents were murdered and that the scarf he wore was all he had left of his dad. The two fell asleep against each other, to awake the next day by the voice of the protester rallying people. They confronted the protester, who told them that Bolin was likely taken to the ${link_0} called \"${link_1}\".",
      "links": [
        {
          "body": "Equalist rally",
          "key": "${link_0}",
          "target": {
            "href": "Rally_building",
            "page": "Rally_building"
          }
        },
        {
          "body": "The Revelation",
          "key": "${link_1}",
          "target": {
            "href": "The_Revelation",
            "page": "The_Revelation"
          }
        }
      ],
      "text": "Roaming around without direction, Korra suddenly remembered the anti-bender protester she had encountered when she first arrived, and decided to seek him out in hopes of gaining information about where Bolin was taken. Mako and Korra spent the night in Republic City Park, where the protester would be during the day. While there, Mako told Korra that his parents were murdered and that the scarf he wore was all he had left of his dad. The two fell asleep against each other, to awake the next day by the voice of the protester rallying people. They confronted the protester, who told them that Bolin was likely taken to the Equalist rally called \"The Revelation\"."
    },
    {
      "body": "${link_0} witnessing ${link_1}'s ability.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Amon",
          "key": "${link_1}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        }
      ],
      "text": "Korra witnessing Amon's ability."
    },
    {
      "body": "After reaching the location, Korra and Mako disguised themselves as a nonbending couple to get past the ${link_0}. At the rally, they discovered that Amon possessed the ability to permanently remove one's bending, a skill thus far believed only to be obtainable by Avatars. During Amon's demonstration on the captured benders, one of whom was Bolin, Korra produced a large cover of steam from some nearby pipes, which created panic and distracted the Equalists long enough to allow Mako to rescue Bolin. When the brothers were overpowered by the ${link_1}, Korra arrived just in time to save them with her earthbending, and they made their escape on Naga. As soon as Korra got back to Air Temple Island, she informed Tenzin and consequently the ${link_2} of Amon's ability to strip another of their bending abilities.",
      "links": [
        {
          "body": "guard",
          "key": "${link_0}",
          "target": {
            "href": "Doorman",
            "page": "Doorman"
          }
        },
        {
          "body": "Lieutenant",
          "key": "${link_1}",
          "target": {
            "href": "Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "United Republic Council",
          "key": "${link_2}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        }
      ],
      "text": "After reaching the location, Korra and Mako disguised themselves as a nonbending couple to get past the guard. At the rally, they discovered that Amon possessed the ability to permanently remove one's bending, a skill thus far believed only to be obtainable by Avatars. During Amon's demonstration on the captured benders, one of whom was Bolin, Korra produced a large cover of steam from some nearby pipes, which created panic and distracted the Equalists long enough to allow Mako to rescue Bolin. When the brothers were overpowered by the Lieutenant, Korra arrived just in time to save them with her earthbending, and they made their escape on Naga. As soon as Korra got back to Air Temple Island, she informed Tenzin and consequently the United Republic Council of Amon's ability to strip another of their bending abilities."
    },
    {
      "body": "The encounter with the Equalists and their leader left a profound impression on Korra, as she had nightmares about being immobilized by their ${link_0} and subsequently being stripped of her bending by Amon. For the first time in her life, Korra found herself afraid of something, although she refused to admit it. This fear held her back in her daily life, and when ${link_1} ${link_2} approached her with the offer to lead a ${link_3} with him to take down Amon, she politely refused with the excuse that she needed to focus on her airbending training. However, Tarrlok persisted, sending her gifts such as a Satomobile, and throwing a gala in her honor. At the gala, several important figures living in Republic City attended as well as numerous journalists and photographers. Mako and Bolin attended as well, and Mako came with a date, ${link_4}. This moderately caused Korra to have feelings of jealousy, but she only got to speak to her friends briefly because Tarrlok approached Korra and tricked her into holding a press conference. During the conference, Korra buckled under the accusing questions of the ${link_5}, the most troubling of which for Korra was a question if she was scared of Amon. To this, Korra loudly responded that she was not afraid of anybody, and stated that she would join Tarrlok's task force to help fight Amon, if that was what the city needed.",
      "links": [
        {
          "body": "chi blocking",
          "key": "${link_0}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        },
        {
          "body": "Councilman",
          "key": "${link_1}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_2}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "special task force",
          "key": "${link_3}",
          "target": {
            "href": "Tarrlok%27s_task_force",
            "page": "Tarrlok%27s_task_force"
          }
        },
        {
          "body": "Asami Sato",
          "key": "${link_4}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "journalists",
          "key": "${link_5}",
          "target": {
            "href": "Republic_City_press",
            "page": "Republic_City_press"
          }
        }
      ],
      "text": "The encounter with the Equalists and their leader left a profound impression on Korra, as she had nightmares about being immobilized by their chi blocking and subsequently being stripped of her bending by Amon. For the first time in her life, Korra found herself afraid of something, although she refused to admit it. This fear held her back in her daily life, and when Councilman Tarrlok approached her with the offer to lead a special task force with him to take down Amon, she politely refused with the excuse that she needed to focus on her airbending training. However, Tarrlok persisted, sending her gifts such as a Satomobile, and throwing a gala in her honor. At the gala, several important figures living in Republic City attended as well as numerous journalists and photographers. Mako and Bolin attended as well, and Mako came with a date, Asami Sato. This moderately caused Korra to have feelings of jealousy, but she only got to speak to her friends briefly because Tarrlok approached Korra and tricked her into holding a press conference. During the conference, Korra buckled under the accusing questions of the journalists, the most troubling of which for Korra was a question if she was scared of Amon. To this, Korra loudly responded that she was not afraid of anybody, and stated that she would join Tarrlok's task force to help fight Amon, if that was what the city needed."
    },
    {
      "body": "${link_0} breaking down after admitting her fears for the first time.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Korra breaking down after admitting her fears for the first time."
    },
    {
      "body": "Eager to prove to everyone, including herself, that she was not afraid of anyone, Korra successfully apprehended several Equalists, with the help of Tarrlok's special task force, and publicly challenged Amon to a one-on-one midnight duel at ${link_0}. At midnight, when there was no apparent sign of the Equalist leader, the Avatar assumed he was a no-show and began to leave. As she passed the entrance to the island's museum, she was caught off-guard and dragged into the darkness, where she was quickly overpowered by Amon's chi blockers. When Amon emerged from the shadows, Korra was terrified that he was going to take her bending away. However, he did not, and instead revealed that he had a plan to rid the world of benders and that he was saving her for last in order to prevent her from becoming a martyr. Following Amon's monologue, he knocked her unconscious, where she experienced several flashbacks surrounding Avatar Aang, ${link_1}, ${link_2}, and a mysterious man in what appeared to be a court room. When she regained consciousness, Tenzin was running toward her. After telling him what happened, Korra broke down and finally admitted that she was terrified of Amon and the Equalists and that she did not know what to do.",
      "links": [
        {
          "body": "Aang Memorial Island",
          "key": "${link_0}",
          "target": {
            "href": "Aang_Memorial_Island",
            "page": "Aang_Memorial_Island"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Toph",
          "key": "${link_2}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Eager to prove to everyone, including herself, that she was not afraid of anyone, Korra successfully apprehended several Equalists, with the help of Tarrlok's special task force, and publicly challenged Amon to a one-on-one midnight duel at Aang Memorial Island. At midnight, when there was no apparent sign of the Equalist leader, the Avatar assumed he was a no-show and began to leave. As she passed the entrance to the island's museum, she was caught off-guard and dragged into the darkness, where she was quickly overpowered by Amon's chi blockers. When Amon emerged from the shadows, Korra was terrified that he was going to take her bending away. However, he did not, and instead revealed that he had a plan to rid the world of benders and that he was saving her for last in order to prevent her from becoming a martyr. Following Amon's monologue, he knocked her unconscious, where she experienced several flashbacks surrounding Avatar Aang, Sokka, Toph, and a mysterious man in what appeared to be a court room. When she regained consciousness, Tenzin was running toward her. After telling him what happened, Korra broke down and finally admitted that she was terrified of Amon and the Equalists and that she did not know what to do."
    },
    {
      "body": "When Korra first joined the Fire Ferrets, she had a tough time impressing Mako, but Bolin was always encouraging her. However, after Korra helped the Fire Ferrets win an impressive victory, Mako genuinely complimented Korra and started to respect her. After her encounter with Amon and his chi blockers, Korra took a break from Tarrlok's task force to prepare for the upcoming Pro-bending Tournament. However, her feelings for Mako continued to grow, and she became jealous of Asami's relationship with him. During this time, Bolin made some advances on Korra, which she declined by saying she had to return to Air Temple Island for further training with Tenzin. She later spoke with Jinora and Ikki, hoping for advice on how to approach Mako. Pema overheard the conversation and told Korra to just be honest with him.",
      "links": [],
      "text": "When Korra first joined the Fire Ferrets, she had a tough time impressing Mako, but Bolin was always encouraging her. However, after Korra helped the Fire Ferrets win an impressive victory, Mako genuinely complimented Korra and started to respect her. After her encounter with Amon and his chi blockers, Korra took a break from Tarrlok's task force to prepare for the upcoming Pro-bending Tournament. However, her feelings for Mako continued to grow, and she became jealous of Asami's relationship with him. During this time, Bolin made some advances on Korra, which she declined by saying she had to return to Air Temple Island for further training with Tenzin. She later spoke with Jinora and Ikki, hoping for advice on how to approach Mako. Pema overheard the conversation and told Korra to just be honest with him."
    },
    {
      "body": "${link_0} and ${link_1} having fun on their \"date\".",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        }
      ],
      "text": "Korra and Bolin having fun on their \"date\"."
    },
    {
      "body": "After Korra and the Fire Ferrets earned a quick and decisive victory in the first round of the tournament, she followed Pema's advice and confessed her true feelings to Mako. However, he turned her down, telling her that he was with Asami and did not see her in the same way. Seeing her downbeat, Bolin again invited Korra for a night out, and this time, she accepted, much to Mako's annoyance. The two enjoyed a dinner at ${link_0}, but were interrupted by ${link_1}, who attempted to provoke them into a fight. Bolin urged Korra to ignore Tahno's approach, warning her that harming him outside of the arena would disqualify the Fire Ferrets from the tournament. Heeding the warning, Korra called on Naga instead, who intimidated Tahno with a loud roar. After this little interruption, the two continued their night out together, enjoying drinks in a bar and the panoramic view of Republic City at night from atop ${link_2}.",
      "links": [
        {
          "body": "Narook's Seaweed Noodlery",
          "key": "${link_0}",
          "target": {
            "href": "Narook%27s_Seaweed_Noodlery",
            "page": "Narook%27s_Seaweed_Noodlery"
          }
        },
        {
          "body": "Tahno",
          "key": "${link_1}",
          "target": {
            "href": "Tahno",
            "page": "Tahno"
          }
        },
        {
          "body": "Harmony Tower",
          "key": "${link_2}",
          "target": {
            "href": "Harmony_Tower",
            "page": "Harmony_Tower"
          }
        }
      ],
      "text": "After Korra and the Fire Ferrets earned a quick and decisive victory in the first round of the tournament, she followed Pema's advice and confessed her true feelings to Mako. However, he turned her down, telling her that he was with Asami and did not see her in the same way. Seeing her downbeat, Bolin again invited Korra for a night out, and this time, she accepted, much to Mako's annoyance. The two enjoyed a dinner at Narook's Seaweed Noodlery, but were interrupted by Tahno, who attempted to provoke them into a fight. Bolin urged Korra to ignore Tahno's approach, warning her that harming him outside of the arena would disqualify the Fire Ferrets from the tournament. Heeding the warning, Korra called on Naga instead, who intimidated Tahno with a loud roar. After this little interruption, the two continued their night out together, enjoying drinks in a bar and the panoramic view of Republic City at night from atop Harmony Tower."
    },
    {
      "body": "${link_0} and ${link_1} arguing over his true feelings for her.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "Korra and Mako arguing over his true feelings for her."
    },
    {
      "body": "When Korra returned to the ${link_0} the following night, Mako was waiting for her, inquiring what kind of game she was playing with Bolin to get back at him. Korra immediately saw through his attitude and called his reaction jealousy. However, when she asked Mako to be honest and admit that he liked her, the two got into an argument, which nearly cost them the next match against the Boar-q-pines.",
      "links": [
        {
          "body": "Pro-bending Arena",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        }
      ],
      "text": "When Korra returned to the Pro-bending Arena the following night, Mako was waiting for her, inquiring what kind of game she was playing with Bolin to get back at him. Korra immediately saw through his attitude and called his reaction jealousy. However, when she asked Mako to be honest and admit that he liked her, the two got into an argument, which nearly cost them the next match against the Boar-q-pines."
    },
    {
      "body": "Korra was approached by Mako after the match, who admitted that he had not been honest with her. He explained that he did have feelings for her, but was confused due to his relationship with Asami. Korra impulsively kissed Mako, and was kissed back in return. When she broke it off, she noticed Bolin standing nearby and looked away in shame, and was blamed by Mako for breaking Bolin's heart.",
      "links": [],
      "text": "Korra was approached by Mako after the match, who admitted that he had not been honest with her. He explained that he did have feelings for her, but was confused due to his relationship with Asami. Korra impulsively kissed Mako, and was kissed back in return. When she broke it off, she noticed Bolin standing nearby and looked away in shame, and was blamed by Mako for breaking Bolin's heart."
    },
    {
      "body": "The next day, the semifinals began against the ${link_0}. The romantic struggles presented a serious problem during the match and further divided the team. Frustrated, Korra excessively roughed up the opposing firebender with waterbending and even assaulted an official. At the start of round three, having lost the first two rounds convincingly, Korra tried to motivate her dejected teammates to not give up, albeit to no avail. Stubbornly refusing to give up herself, Korra fought the match of her life by herself, and secured a spot in the final by knocking all the Buzzard Wasps off the field with one powerful attack. Afterward, the team made amends, putting their romantic problems aside to let friendship prevail. Korra was later complimented by Asami for her hat trick victory, and returned this kind gesture by sincerely thanking her and ${link_1} for their financial aid.",
      "links": [
        {
          "body": "Bau Ling Buzzard Wasps",
          "key": "${link_0}",
          "target": {
            "href": "Bau_Ling_Buzzard_Wasps",
            "page": "Bau_Ling_Buzzard_Wasps"
          }
        },
        {
          "body": "her father",
          "key": "${link_1}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        }
      ],
      "text": "The next day, the semifinals began against the Bau Ling Buzzard Wasps. The romantic struggles presented a serious problem during the match and further divided the team. Frustrated, Korra excessively roughed up the opposing firebender with waterbending and even assaulted an official. At the start of round three, having lost the first two rounds convincingly, Korra tried to motivate her dejected teammates to not give up, albeit to no avail. Stubbornly refusing to give up herself, Korra fought the match of her life by herself, and secured a spot in the final by knocking all the Buzzard Wasps off the field with one powerful attack. Afterward, the team made amends, putting their romantic problems aside to let friendship prevail. Korra was later complimented by Asami for her hat trick victory, and returned this kind gesture by sincerely thanking her and her father for their financial aid."
    },
    {
      "body": "${link_0} and her teammates attempting to convince the ${link_1} to keep the ${link_2} open.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "council",
          "key": "${link_1}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "arena",
          "key": "${link_2}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        }
      ],
      "text": "Korra and her teammates attempting to convince the council to keep the arena open."
    },
    {
      "body": "The day of the final match of the Championship Tournament, Korra, along with Bolin and Mako, were feeling in top form for the finals when their training session was interrupted by a radio broadcast from Amon. After hearing him threaten \"severe consequences\" if the United Republic Council would not shut down the Pro-bending Arena, the three friends rode to City Hall to convince the ${link_0} not to cancel the final. Korra pointed out that they could not give in to Amon's threats, however, to no avail as the Council had already unanimously agreed to do so. She found an unlikely ally in Chief Lin Beifong, and due to the chief's interference, the Council members changed their minds and let the match be played. Korra wanted to thank Lin for her help, but the metalbender ignored her on the way out. When she complained to Tenzin about Lin's hostile attitude, she came to the conclusion that Lin's issues were with Tenzin rather than with her.",
      "links": [
        {
          "body": "council members",
          "key": "${link_0}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        }
      ],
      "text": "The day of the final match of the Championship Tournament, Korra, along with Bolin and Mako, were feeling in top form for the finals when their training session was interrupted by a radio broadcast from Amon. After hearing him threaten \"severe consequences\" if the United Republic Council would not shut down the Pro-bending Arena, the three friends rode to City Hall to convince the council members not to cancel the final. Korra pointed out that they could not give in to Amon's threats, however, to no avail as the Council had already unanimously agreed to do so. She found an unlikely ally in Chief Lin Beifong, and due to the chief's interference, the Council members changed their minds and let the match be played. Korra wanted to thank Lin for her help, but the metalbender ignored her on the way out. When she complained to Tenzin about Lin's hostile attitude, she came to the conclusion that Lin's issues were with Tenzin rather than with her."
    },
    {
      "body": "In the match for the championship, the Fire Ferrets faced off against the ${link_0}. Korra was disgusted by Tahno's arrogance during the match, claiming she was going to \"knock his stupid hair off his stupid head\". With cheating and some help from the bribed referees, the Wolfbats almost won the match in the first round with a knockout, but Korra managed to keep her team in play by holding onto the edge of the field. However, she fell in the water when she threw Mako back in play. The second round was to be decided with a ${link_1}, and Korra immediately took the chance to face off with Tahno, which resulted in an easy victory for the Avatar. However, despite this success, the Wolfbats defeated the Fire Ferrets in the third round with a knockout that even Shiro Shinobi was certain would be declared illegal.",
      "links": [
        {
          "body": "White Falls Wolfbats",
          "key": "${link_0}",
          "target": {
            "href": "White_Falls_Wolfbats",
            "page": "White_Falls_Wolfbats"
          }
        },
        {
          "body": "tiebreaker",
          "key": "${link_1}",
          "target": {
            "href": "Pro-bending#Tiebreakers",
            "page": "Pro-bending"
          }
        }
      ],
      "text": "In the match for the championship, the Fire Ferrets faced off against the White Falls Wolfbats. Korra was disgusted by Tahno's arrogance during the match, claiming she was going to \"knock his stupid hair off his stupid head\". With cheating and some help from the bribed referees, the Wolfbats almost won the match in the first round with a knockout, but Korra managed to keep her team in play by holding onto the edge of the field. However, she fell in the water when she threw Mako back in play. The second round was to be decided with a tiebreaker, and Korra immediately took the chance to face off with Tahno, which resulted in an easy victory for the Avatar. However, despite this success, the Wolfbats defeated the Fire Ferrets in the third round with a knockout that even Shiro Shinobi was certain would be declared illegal."
    },
    {
      "body": "${link_0} fighting ${link_1} on top of the ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_1}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_2}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        }
      ],
      "text": "Korra fighting Equalists on top of the Pro-bending Arena."
    },
    {
      "body": "When the match ended, Amon and the Equalists ambushed the Pro-bending Arena, and Korra, who was still in the pool under the ring, was quickly immobilized by the Lieutenant when he touched the water with his ${link_0}. Falling unconscious, Korra had another vision of Aang fighting someone in the ${link_1} with Toph alongside him. When she came, she and her teammates were tied to one of the support beams of the arena platform, but they were soon freed by Pabu who saved them by biting through the ropes. Korra immediately created a waterspout to give chase to Amon and the Equalists who were escaping through the roof. With the help of Lin Beifong, she managed to reach the ${link_2} and knocked off the Lieutenant and an Equalist before being knocked off herself. A battle between the four Equalists and Korra, assisted by Lin, soon ensued in which Korra mainly focused on the Lieutenant, whom she managed to overpower and knock off the roof. However, the strain of the fight was too much for the arena's glass dome and Korra fell through, but was saved by Lin. After she thanked the police chief for the rescue, Mako, Bolin, and Tenzin joined them and together they watched the Equalists escape, realizing that they were now officially at war with them.",
      "links": [
        {
          "body": "electrified kali sticks",
          "key": "${link_0}",
          "target": {
            "href": "Electrified_kali_sticks",
            "page": "Electrified_kali_sticks"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_1}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Equalist airship",
          "key": "${link_2}",
          "target": {
            "href": "Equalist_airship",
            "page": "Equalist_airship"
          }
        }
      ],
      "text": "When the match ended, Amon and the Equalists ambushed the Pro-bending Arena, and Korra, who was still in the pool under the ring, was quickly immobilized by the Lieutenant when he touched the water with his electrified kali sticks. Falling unconscious, Korra had another vision of Aang fighting someone in the Avatar State with Toph alongside him. When she came, she and her teammates were tied to one of the support beams of the arena platform, but they were soon freed by Pabu who saved them by biting through the ropes. Korra immediately created a waterspout to give chase to Amon and the Equalists who were escaping through the roof. With the help of Lin Beifong, she managed to reach the Equalist airship and knocked off the Lieutenant and an Equalist before being knocked off herself. A battle between the four Equalists and Korra, assisted by Lin, soon ensued in which Korra mainly focused on the Lieutenant, whom she managed to overpower and knock off the roof. However, the strain of the fight was too much for the arena's glass dome and Korra fell through, but was saved by Lin. After she thanked the police chief for the rescue, Mako, Bolin, and Tenzin joined them and together they watched the Equalists escape, realizing that they were now officially at war with them."
    },
    {
      "body": "During the closure of the Pro-bending Arena, Korra visited Mako and Bolin in the attic of the building. She told the brothers that they did not have to worry about living on the streets again, as Tenzin had agreed to let them live on Air Temple Island. They were humbled by the offer, but informed her that Asami had already offered them a place to stay at the ${link_0}. Korra, though uncomfortable with this, did not say anything and made up an excuse to leave. Asami stopped her and invited the Avatar to visit the estate the next day, to which Korra at first refused saying she had \"Avatar stuff\" to do, but was promptly convinced by Bolin to do so.",
      "links": [
        {
          "body": "Sato estate",
          "key": "${link_0}",
          "target": {
            "href": "Sato_estate",
            "page": "Sato_estate"
          }
        }
      ],
      "text": "During the closure of the Pro-bending Arena, Korra visited Mako and Bolin in the attic of the building. She told the brothers that they did not have to worry about living on the streets again, as Tenzin had agreed to let them live on Air Temple Island. They were humbled by the offer, but informed her that Asami had already offered them a place to stay at the Sato estate. Korra, though uncomfortable with this, did not say anything and made up an excuse to leave. Asami stopped her and invited the Avatar to visit the estate the next day, to which Korra at first refused saying she had \"Avatar stuff\" to do, but was promptly convinced by Bolin to do so."
    },
    {
      "body": "Despite her initial impression of her, ${link_0} begins to warm up to ${link_1} after seeing her tougher side for the first time.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "text": "Despite her initial impression of her, Korra begins to warm up to Asami after seeing her tougher side for the first time."
    },
    {
      "body": "When Korra visited the Sato estate the following day, she found Mako, Bolin, Asami, and Pabu having fun in the pool. The hostess later took the group to a racetrack and offered to take Korra \"for a spin\", to which the Avatar agreed enthusiastically. Korra sat in the backseat of a car with Asami at the wheel as they competed against another driver, finally winning the race. After witnessing Asami's assertiveness and skill behind a wheel, she finally warmed up to Asami.",
      "links": [],
      "text": "When Korra visited the Sato estate the following day, she found Mako, Bolin, Asami, and Pabu having fun in the pool. The hostess later took the group to a racetrack and offered to take Korra \"for a spin\", to which the Avatar agreed enthusiastically. Korra sat in the backseat of a car with Asami at the wheel as they competed against another driver, finally winning the race. After witnessing Asami's assertiveness and skill behind a wheel, she finally warmed up to Asami."
    },
    {
      "body": "Back at the mansion, Korra overheard Hiroshi Sato talking on the phone about the recent Cabbage Corp investigation and an upcoming \"strike\". She immediately left the mansion and contacted Tenzin and Lin Beifong, theorizing that Hiroshi could be working with the Equalists. The three of them went back to the estate and questioned the businessman. After getting permission from Hiroshi to search all of Future Industries' factories, Chief Beifong had her officers search for any evidence that could link Hiroshi to the Equalists. However, no evidence was found. During a search in one the warehouses, Korra received a tip from a worker, who asked to meet underneath Silk Road Bridge. She immediately informed Tenzin and Lin, who accompanied her to the bridge, where the worker informed them that Hiroshi had manufactured the weapons the Equalists had used during the attack on the arena, and was creating more new weapons for them in a ${link_0} under his mansion.",
      "links": [
        {
          "body": "hidden factory",
          "key": "${link_0}",
          "target": {
            "href": "Equalist_factory",
            "page": "Equalist_factory"
          }
        }
      ],
      "text": "Back at the mansion, Korra overheard Hiroshi Sato talking on the phone about the recent Cabbage Corp investigation and an upcoming \"strike\". She immediately left the mansion and contacted Tenzin and Lin Beifong, theorizing that Hiroshi could be working with the Equalists. The three of them went back to the estate and questioned the businessman. After getting permission from Hiroshi to search all of Future Industries' factories, Chief Beifong had her officers search for any evidence that could link Hiroshi to the Equalists. However, no evidence was found. During a search in one the warehouses, Korra received a tip from a worker, who asked to meet underneath Silk Road Bridge. She immediately informed Tenzin and Lin, who accompanied her to the bridge, where the worker informed them that Hiroshi had manufactured the weapons the Equalists had used during the attack on the arena, and was creating more new weapons for them in a hidden factory under his mansion."
    },
    {
      "body": "${link_0} and the others facing ${link_1}'s ${link_2}, ultimately confirming his association with the ${link_3}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_1}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "mecha tank",
          "key": "${link_2}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_3}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        }
      ],
      "text": "Korra and the others facing Hiroshi Sato's mecha tank, ultimately confirming his association with the Equalists."
    },
    {
      "body": "Korra, Tenzin, Lin, and a number of police officers went back to Sato's home via ${link_0}, eventually finding a tunnel leading to the underground factory. There, the group discovered that the new weapons were large ${link_1}. The tanks suddenly sprang to life as Hiroshi's voice could be heard coming from one of them, and Korra realized that the informant's tip had been a setup. Controlled by Sato and other Equalists, the tanks attacked the intruders, easily overpowering and knocking them unconscious. As the Equalists were loading the captured officers into their ${link_2}, Mako and Bolin found their way into the factory and started carrying Korra, Tenzin, and Lin out, but were stopped by Hiroshi. Asami later arrived at the factory and confronted her father and the Lieutenant, allowing the group to escape safely.",
      "links": [
        {
          "body": "airship",
          "key": "${link_0}",
          "target": {
            "href": "Police_airship",
            "page": "Police_airship"
          }
        },
        {
          "body": "mecha tanks",
          "key": "${link_1}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "trucks",
          "key": "${link_2}",
          "target": {
            "href": "Equalist_truck",
            "page": "Equalist_truck"
          }
        }
      ],
      "text": "Korra, Tenzin, Lin, and a number of police officers went back to Sato's home via airship, eventually finding a tunnel leading to the underground factory. There, the group discovered that the new weapons were large mecha tanks. The tanks suddenly sprang to life as Hiroshi's voice could be heard coming from one of them, and Korra realized that the informant's tip had been a setup. Controlled by Sato and other Equalists, the tanks attacked the intruders, easily overpowering and knocking them unconscious. As the Equalists were loading the captured officers into their trucks, Mako and Bolin found their way into the factory and started carrying Korra, Tenzin, and Lin out, but were stopped by Hiroshi. Asami later arrived at the factory and confronted her father and the Lieutenant, allowing the group to escape safely."
    },
    {
      "body": "While heading back toward Republic City, Korra told Mako that he, Bolin, and Asami were all welcome to live on Air Temple Island with her and Tenzin's family.",
      "links": [],
      "text": "While heading back toward Republic City, Korra told Mako that he, Bolin, and Asami were all welcome to live on Air Temple Island with her and Tenzin's family."
    },
    {
      "body": "After Mako, Bolin, and Asami moved to Air Temple Island, Tenzin and Korra left for ${link_0}'s inauguration as the new Chief of Police. While there, the Avatar and the airbender confronted Tarrlok, questioning his actions, but the Councilman requested that Korra rejoin his task force, to which she refused. Tarrlok responded by alluding to the Avatar's lack of progress on her airbending, which caused her to worry about her airbending and spiritual block. She later spoke with Tenzin about the matter, mentioning that she was confused about the visions she had had. Tenzin advised her to meditate on these visions, believing Aang's spirit was trying to contact her.",
      "links": [
        {
          "body": "Saikhan",
          "key": "${link_0}",
          "target": {
            "href": "Saikhan",
            "page": "Saikhan"
          }
        }
      ],
      "text": "After Mako, Bolin, and Asami moved to Air Temple Island, Tenzin and Korra left for Saikhan's inauguration as the new Chief of Police. While there, the Avatar and the airbender confronted Tarrlok, questioning his actions, but the Councilman requested that Korra rejoin his task force, to which she refused. Tarrlok responded by alluding to the Avatar's lack of progress on her airbending, which caused her to worry about her airbending and spiritual block. She later spoke with Tenzin about the matter, mentioning that she was confused about the visions she had had. Tenzin advised her to meditate on these visions, believing Aang's spirit was trying to contact her."
    },
    {
      "body": "Unable to overcome her ${link_0} block, ${link_1} was convinced she was a failure as an ${link_2}.",
      "links": [
        {
          "body": "airbending",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Unable to overcome her airbending block, Korra was convinced she was a failure as an Avatar."
    },
    {
      "body": "Later, when she was crying while looking out at Aang's statue, her friends found her and cheered her up by assuring her they had her back. As the new ${link_0}, they decided to patrol Republic City in order to protect it from the Equalists. After arresting several escaped Equalist prisoners, Tarrlok confronted the team and warned them to stay out of his way. Later on, at a supposed Equalist rally in the ${link_1}, Korra and her friends spotted a significant power outage in the area, which turned out to be caused by Tarrlok and several metalbending officers in accordance with a new law against nonbenders. The nonbenders pleaded for Korra's help, who confronted Tarrlok but without success. She decided to intervene and attempted to free the innocent nonbenders, much to the Councilman's displeasure, who took all of Korra's friends into custody. Later that night, Korra and Tenzin spoke with Saikhan at the police headquarters, requesting that he release her friends and the nonbenders, but the chief refused.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Dragon Flats borough",
          "key": "${link_1}",
          "target": {
            "href": "Dragon_Flats_borough",
            "page": "Dragon_Flats_borough"
          }
        }
      ],
      "text": "Later, when she was crying while looking out at Aang's statue, her friends found her and cheered her up by assuring her they had her back. As the new Team Avatar, they decided to patrol Republic City in order to protect it from the Equalists. After arresting several escaped Equalist prisoners, Tarrlok confronted the team and warned them to stay out of his way. Later on, at a supposed Equalist rally in the Dragon Flats borough, Korra and her friends spotted a significant power outage in the area, which turned out to be caused by Tarrlok and several metalbending officers in accordance with a new law against nonbenders. The nonbenders pleaded for Korra's help, who confronted Tarrlok but without success. She decided to intervene and attempted to free the innocent nonbenders, much to the Councilman's displeasure, who took all of Korra's friends into custody. Later that night, Korra and Tenzin spoke with Saikhan at the police headquarters, requesting that he release her friends and the nonbenders, but the chief refused."
    },
    {
      "body": "${link_0} was immobilized by ${link_1}'s ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_1}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "bloodbending",
          "key": "${link_2}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        }
      ],
      "text": "Korra was immobilized by Tarrlok's bloodbending."
    },
    {
      "body": "Later that evening, Korra left the island on Naga and went to City Hall, where she confronted Tarrlok regarding his radical actions. He proposed that if she agreed to work for him, her friends would be released, but the Avatar refused and compared him to Amon, which infuriated the Councilman and caused him to attack her. A duel ensued between the two. Korra appeared to have won the duel when she knocked the Councilman out of his office and down to the Council's meeting room with a large earthbending attack, leaving Tarrlok without a source of water. However, just as she prepared two send fire blasts in his direction to end the duel, Tarrlok used bloodbending to control Korra's body and throw her across the room, knocking her unconscious. She had another vision of Aang, Sokka, Toph, and the same unknown man, who bloodbent the entire room while Aang tried to stop him. As Korra awoke, she found herself tied up in the back of a police car, as Tarrlok told her she would never see Republic City again, and he was taking her where no one could ever find her.",
      "links": [],
      "text": "Later that evening, Korra left the island on Naga and went to City Hall, where she confronted Tarrlok regarding his radical actions. He proposed that if she agreed to work for him, her friends would be released, but the Avatar refused and compared him to Amon, which infuriated the Councilman and caused him to attack her. A duel ensued between the two. Korra appeared to have won the duel when she knocked the Councilman out of his office and down to the Council's meeting room with a large earthbending attack, leaving Tarrlok without a source of water. However, just as she prepared two send fire blasts in his direction to end the duel, Tarrlok used bloodbending to control Korra's body and throw her across the room, knocking her unconscious. She had another vision of Aang, Sokka, Toph, and the same unknown man, who bloodbent the entire room while Aang tried to stop him. As Korra awoke, she found herself tied up in the back of a police car, as Tarrlok told her she would never see Republic City again, and he was taking her where no one could ever find her."
    },
    {
      "body": "Through meditating while imprisoned by ${link_0}, ${link_1} finally establishes a spiritual connection with ${link_2}.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Through meditating while imprisoned by Tarrlok, Korra finally establishes a spiritual connection with Aang."
    },
    {
      "body": "Tarrlok took Korra to the mountains and locked her in a metal container in the basement of a small building. After realizing there was no way out, Korra decided to meditate on the meaning of her previous visions and received additional ones of Aang dealing with a powerful, criminal bloodbender named Yakone. During a trial where he was found guilty, he bloodbent the entire court into submission, knocking Aang unconscious and forcing Toph to release him from his restraints. Yakone escaped, but Aang entered the Avatar State and chased Yakone down, where he fought, cornered, and stripped the bloodbender of his bending abilities. Korra promptly realized that Aang was trying to warn her about Tarrlok and his relation to Yakone. The Councilman later returned to the \"prison\", where Korra told him about her visions, pressing him to tell her the truth and admit his wrongdoing. He finally admitted that Yakone was his father, and that he would now leave Republic City forever with Korra as his hostage.",
      "links": [],
      "text": "Tarrlok took Korra to the mountains and locked her in a metal container in the basement of a small building. After realizing there was no way out, Korra decided to meditate on the meaning of her previous visions and received additional ones of Aang dealing with a powerful, criminal bloodbender named Yakone. During a trial where he was found guilty, he bloodbent the entire court into submission, knocking Aang unconscious and forcing Toph to release him from his restraints. Yakone escaped, but Aang entered the Avatar State and chased Yakone down, where he fought, cornered, and stripped the bloodbender of his bending abilities. Korra promptly realized that Aang was trying to warn her about Tarrlok and his relation to Yakone. The Councilman later returned to the \"prison\", where Korra told him about her visions, pressing him to tell her the truth and admit his wrongdoing. He finally admitted that Yakone was his father, and that he would now leave Republic City forever with Korra as his hostage."
    },
    {
      "body": "Before anything else could happen however, the prison was raided by the Equalists, led by Amon. Korra overheard Tarrlok being stripped of his bending, and Amon ordering his chi blockers to subdue Korra by electrocuting the box in which Korra was trapped. Korra ingeniously took one of her arm bands and wrapped one end around one of the metal bars at the top of the box and held onto the fabric, where she received a very mild electric shock but remained conscious. She escaped the box, eluding the other Equalists and escaping from Amon. She slid down a snowy hill and tripped over a branch, hurtling toward a tree. The blow knocked her unconscious, but Naga, having tracked her from Republic City, discovered her and carried her home.",
      "links": [],
      "text": "Before anything else could happen however, the prison was raided by the Equalists, led by Amon. Korra overheard Tarrlok being stripped of his bending, and Amon ordering his chi blockers to subdue Korra by electrocuting the box in which Korra was trapped. Korra ingeniously took one of her arm bands and wrapped one end around one of the metal bars at the top of the box and held onto the fabric, where she received a very mild electric shock but remained conscious. She escaped the box, eluding the other Equalists and escaping from Amon. She slid down a snowy hill and tripped over a branch, hurtling toward a tree. The blow knocked her unconscious, but Naga, having tracked her from Republic City, discovered her and carried her home."
    },
    {
      "body": "Upon being reunited, ${link_0} is glad to be with ${link_1} again.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "Upon being reunited, Korra is glad to be with Mako again."
    },
    {
      "body": "They wandered through the forest until they reached Republic City, where Naga roamed the streets. Team Avatar – along with Lin and Tenzin – eventually found her, having heard Naga's howls while searching for Korra on Oogi. Mako, visibly worried about Korra beforehand, told everyone to \"give her some space\", shoving his way past Lin and Tenzin who were crowding around Korra. He proceeded to pick the Avatar up off Naga, cradling her in his arms. Mako, after retrieving Korra from Naga's back, laid her down on Oogi, brushing hair from her face assuring her, \"You're safe now.\" She smiled in return, happy to be near him again. Team Avatar, Lin, and Tenzin flew her home on Oogi, relieved that the Avatar was safe and sound.",
      "links": [],
      "text": "They wandered through the forest until they reached Republic City, where Naga roamed the streets. Team Avatar – along with Lin and Tenzin – eventually found her, having heard Naga's howls while searching for Korra on Oogi. Mako, visibly worried about Korra beforehand, told everyone to \"give her some space\", shoving his way past Lin and Tenzin who were crowding around Korra. He proceeded to pick the Avatar up off Naga, cradling her in his arms. Mako, after retrieving Korra from Naga's back, laid her down on Oogi, brushing hair from her face assuring her, \"You're safe now.\" She smiled in return, happy to be near him again. Team Avatar, Lin, and Tenzin flew her home on Oogi, relieved that the Avatar was safe and sound."
    },
    {
      "body": "After being found unharmed, Korra was taken back to Air Temple Island by the rest of ${link_0}, Lin, and Tenzin. As Korra attempted to recover from the ordeal, Mako remained at her bedside and even held Korra's hand, while a hurt Asami watched secretly at the door. Soon after, Team Avatar, Lin, and Tenzin enjoyed a meal with Pema and the airbender kids. After eating for a bit, Korra admitted that Pema's food was starting to \"make [her] feel like [herself] again.\" Tenzin encouraged her to tell her harrowing tale. Korra explained that Tarrlok was Yakone's son, surprising both Lin and Tenzin. When asked how she escaped and where Tarrlok was, Korra responded that Amon had shown up out of nowhere, took Tarrlok's bending, and captured him. She also told how she was almost captured as well. Tenzin expressed his fear of Amon becoming emboldened and that his taking out a councilman and nearly capturing the Avatar was increasingly worrisome. He told the group that he was afraid that \"Amon was beginning to execute his endgame.\"",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "text": "After being found unharmed, Korra was taken back to Air Temple Island by the rest of Team Avatar, Lin, and Tenzin. As Korra attempted to recover from the ordeal, Mako remained at her bedside and even held Korra's hand, while a hurt Asami watched secretly at the door. Soon after, Team Avatar, Lin, and Tenzin enjoyed a meal with Pema and the airbender kids. After eating for a bit, Korra admitted that Pema's food was starting to \"make [her] feel like [herself] again.\" Tenzin encouraged her to tell her harrowing tale. Korra explained that Tarrlok was Yakone's son, surprising both Lin and Tenzin. When asked how she escaped and where Tarrlok was, Korra responded that Amon had shown up out of nowhere, took Tarrlok's bending, and captured him. She also told how she was almost captured as well. Tenzin expressed his fear of Amon becoming emboldened and that his taking out a councilman and nearly capturing the Avatar was increasingly worrisome. He told the group that he was afraid that \"Amon was beginning to execute his endgame.\""
    },
    {
      "body": "${link_0} defeating a ${link_1} with ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "mecha tank",
          "key": "${link_1}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_2}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Korra defeating a mecha tank with waterbending."
    },
    {
      "body": "The next day, the Equalists began their attack on Republic City, starting with the capture of all council members, with the exception of Tenzin, who was able to fend off his attackers. Seeing the devastation from the island, Korra and her friends traveled to the city in hopes of aiding in the battle against the Equalists. Using Asami's Satomobile, they drove to the police headquarters where Tenzin was under attack by the Equalists. The gang, along with Tenzin, defeated the mecha tanks, preventing the airbending master's capture. Upon seeing an Equalist airship close in on Air Temple Island, they traveled on Oogi and arrived at the island. Successfully repelling the attackers, Tenzin ordered the evacuation of the island knowing that more airships would arrive soon. Tenzin told Korra to hide and be patient for the time being, promising her that he would return upon ensuring his family's safety. He assured her that the ${link_0} would soon arrive and help turn the tide against the Equalist threat. Korra agreed and vacated the island on Naga with Mako, Bolin, and Asami. They subsequently fled to Republic City, where she and the rest of Team Avatar went to a secluded water pipeline. There, Korra sadly gazed at the destroyed Air Temple until Mako told her to keep moving. He wrapped his arm around Korra as they continued to walk down the pipeline.",
      "links": [
        {
          "body": "United Forces",
          "key": "${link_0}",
          "target": {
            "href": "United_Forces",
            "page": "United_Forces"
          }
        }
      ],
      "text": "The next day, the Equalists began their attack on Republic City, starting with the capture of all council members, with the exception of Tenzin, who was able to fend off his attackers. Seeing the devastation from the island, Korra and her friends traveled to the city in hopes of aiding in the battle against the Equalists. Using Asami's Satomobile, they drove to the police headquarters where Tenzin was under attack by the Equalists. The gang, along with Tenzin, defeated the mecha tanks, preventing the airbending master's capture. Upon seeing an Equalist airship close in on Air Temple Island, they traveled on Oogi and arrived at the island. Successfully repelling the attackers, Tenzin ordered the evacuation of the island knowing that more airships would arrive soon. Tenzin told Korra to hide and be patient for the time being, promising her that he would return upon ensuring his family's safety. He assured her that the United Forces would soon arrive and help turn the tide against the Equalist threat. Korra agreed and vacated the island on Naga with Mako, Bolin, and Asami. They subsequently fled to Republic City, where she and the rest of Team Avatar went to a secluded water pipeline. There, Korra sadly gazed at the destroyed Air Temple until Mako told her to keep moving. He wrapped his arm around Korra as they continued to walk down the pipeline."
    },
    {
      "body": "Soon after, the wire Tenzin had sent to the United Forces was received, reporting that the city had fallen under the Equalists' control. A large force had been dispatched to aid the city, led by ${link_0}. Iroh told his subordinate to respond that his forces would arrive in three days' time, and that together they would take back the city.",
      "links": [
        {
          "body": "General Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh_(United_Forces_general)",
            "page": "Iroh_(United_Forces_general)"
          }
        }
      ],
      "text": "Soon after, the wire Tenzin had sent to the United Forces was received, reporting that the city had fallen under the Equalists' control. A large force had been dispatched to aid the city, led by General Iroh. Iroh told his subordinate to respond that his forces would arrive in three days' time, and that together they would take back the city."
    },
    {
      "body": "${link_0} and ${link_1} sharing their feelings for one another.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "Korra and Mako sharing their feelings for one another."
    },
    {
      "body": "While hiding within the city's sewer system, Korra and Mako stole chi blocker uniforms and infiltrated various Equalist rallies to stay up-to-date on Amon's movements. Korra was growing restless and increasingly more agitated at being branded a coward for \"running away\", saying they should go back up there and \"knock some heads\", but Mako advised her to be patient, reassuring her that when General Iroh arrived, \"Amon would be the one who's running\". After leaving the Equalist rally, the two rejoined Bolin and Asami and ate dinner with Gommu. Later that night, when neither of them could sleep, Mako told Korra that because of everything that had happened, he could not imagine his life without her. He went on to say Korra was the most loyal, brave, and selfless person he had ever known. While Korra was flattered and reciprocated his feelings, she suggested that they get some rest before the United Forces arrived in the morning.",
      "links": [],
      "text": "While hiding within the city's sewer system, Korra and Mako stole chi blocker uniforms and infiltrated various Equalist rallies to stay up-to-date on Amon's movements. Korra was growing restless and increasingly more agitated at being branded a coward for \"running away\", saying they should go back up there and \"knock some heads\", but Mako advised her to be patient, reassuring her that when General Iroh arrived, \"Amon would be the one who's running\". After leaving the Equalist rally, the two rejoined Bolin and Asami and ate dinner with Gommu. Later that night, when neither of them could sleep, Mako told Korra that because of everything that had happened, he could not imagine his life without her. He went on to say Korra was the most loyal, brave, and selfless person he had ever known. While Korra was flattered and reciprocated his feelings, she suggested that they get some rest before the United Forces arrived in the morning."
    },
    {
      "body": "${link_0} rescuing ${link_1} from drowning.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh_(United_Forces_general)",
            "page": "Iroh_(United_Forces_general)"
          }
        }
      ],
      "text": "Korra rescuing Iroh from drowning."
    },
    {
      "body": "When General Iroh approached the city, the United Forces fleet was swiftly destroyed by the Equalists using their newly crafted airplanes. Korra and the fleet tried to fend the airplanes off, but to no avail. She managed to rescue Iroh from his fall into the ocean and he graciously thanked her for saving his life. As Korra treated Iroh's burns, the General decided that with the Equalist airplanes around it would be impossible for the reinforcement fleet to take back the city. With the group's help, Iroh deduced the location of the Equalist airfield, and everyone prepared to leave. Korra, however, refused to go, as she believed it was her duty to stay in the city and confront Amon. Mako decided to accompany Korra while Bolin, Asami, and Iroh took down the airplanes. Iroh was reluctant to let Korra stay, but said that his grandfather, ${link_0}, would trust the Avatar's instincts, therefore he would too. Korra and Bolin hugged each other goodbye, and she left Naga with him.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "When General Iroh approached the city, the United Forces fleet was swiftly destroyed by the Equalists using their newly crafted airplanes. Korra and the fleet tried to fend the airplanes off, but to no avail. She managed to rescue Iroh from his fall into the ocean and he graciously thanked her for saving his life. As Korra treated Iroh's burns, the General decided that with the Equalist airplanes around it would be impossible for the reinforcement fleet to take back the city. With the group's help, Iroh deduced the location of the Equalist airfield, and everyone prepared to leave. Korra, however, refused to go, as she believed it was her duty to stay in the city and confront Amon. Mako decided to accompany Korra while Bolin, Asami, and Iroh took down the airplanes. Iroh was reluctant to let Korra stay, but said that his grandfather, Zuko, would trust the Avatar's instincts, therefore he would too. Korra and Bolin hugged each other goodbye, and she left Naga with him."
    },
    {
      "body": "${link_0} and ${link_1} upon being told the truth about ${link_2} from ${link_3}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Amon",
          "key": "${link_2}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_3}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        }
      ],
      "text": "Korra and Mako upon being told the truth about Amon from Tarrlok."
    },
    {
      "body": "Korra and Mako returned to Air Temple Island hoping to ambush Amon, but they instead found Tarrlok. The former Councilman told Korra and Mako that he and Amon were brothers. He proceeded to tell them about their childhood, and that Amon was actually a very powerful bloodbender. Korra realized trying to ambush Amon directly would be a horrible idea. Instead, she devised a plan to expose him as a bender in front of his supporters, knowing the Revolution would crumble if she did. The two left to attend ${link_0} at the former Pro-bending Arena, and Tarrlok apologized to Korra for his actions, asking them to stop Amon and \"put an end to this sad story\". Korra opted to free Tarrlok, but he refused, saying it would tip off his brother.",
      "links": [
        {
          "body": "Amon's rally",
          "key": "${link_0}",
          "target": {
            "href": "Equalist_victory_rally",
            "page": "Equalist_victory_rally"
          }
        }
      ],
      "text": "Korra and Mako returned to Air Temple Island hoping to ambush Amon, but they instead found Tarrlok. The former Councilman told Korra and Mako that he and Amon were brothers. He proceeded to tell them about their childhood, and that Amon was actually a very powerful bloodbender. Korra realized trying to ambush Amon directly would be a horrible idea. Instead, she devised a plan to expose him as a bender in front of his supporters, knowing the Revolution would crumble if she did. The two left to attend Amon's rally at the former Pro-bending Arena, and Tarrlok apologized to Korra for his actions, asking them to stop Amon and \"put an end to this sad story\". Korra opted to free Tarrlok, but he refused, saying it would tip off his brother."
    },
    {
      "body": "Once Korra and Mako arrived at the arena, the Avatar told Amon's supporters that he was really a bloodbender. However, Amon showed his face and the firebending \"scars\" he was given, making his supporters think Korra was the liar. Korra was dumbfounded and Mako opted for the two of them to escape. Amon told Korra to stay and watch, and revealed that he had captured Tenzin and his family. Korra became distraught, begging Amon to spare the last airbenders. Mako shot a bolt of lightning at Amon, which he barely dodged. Mako and Korra used firebending to propel themselves toward the stage, free Tenzin and his family, and escape out into the corridor.",
      "links": [],
      "text": "Once Korra and Mako arrived at the arena, the Avatar told Amon's supporters that he was really a bloodbender. However, Amon showed his face and the firebending \"scars\" he was given, making his supporters think Korra was the liar. Korra was dumbfounded and Mako opted for the two of them to escape. Amon told Korra to stay and watch, and revealed that he had captured Tenzin and his family. Korra became distraught, begging Amon to spare the last airbenders. Mako shot a bolt of lightning at Amon, which he barely dodged. Mako and Korra used firebending to propel themselves toward the stage, free Tenzin and his family, and escape out into the corridor."
    },
    {
      "body": "Subdued by ${link_0}, ${link_1} loses her ${link_2} to ${link_3}.",
      "links": [
        {
          "body": "bloodbending",
          "key": "${link_0}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "bending",
          "key": "${link_2}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Amon",
          "key": "${link_3}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        }
      ],
      "text": "Subdued by bloodbending, Korra loses her bending to Amon."
    },
    {
      "body": "While Tenzin and his children escaped to save Pema and Rohan, Mako and Korra retreated and hid in one of the fitness rooms. Amon pursued them, bloodbending Korra into submission. Mako attempted to stop him, but was subdued in turn. Korra was subsequently stripped of her bending abilities, while Mako observed the event in horror and anger. Korra tried to stand and fight Amon, but she was too weak and collapsed. The revolutionary quickly approached Mako, intending to also remove his bending. However, Mako blasted Amon with a bolt of lightning, subsequently breaking out of the latter's bloodbending. Mako picked up a barely conscious Korra, who weakly lamented over her lost bending. Amon quickly recovered and followed Mako, bending his blood once again in preparation to remove his firebending. However, at the last moment, Korra reacted instinctively to defend Mako and knocked Amon away with a blast of air.",
      "links": [],
      "text": "While Tenzin and his children escaped to save Pema and Rohan, Mako and Korra retreated and hid in one of the fitness rooms. Amon pursued them, bloodbending Korra into submission. Mako attempted to stop him, but was subdued in turn. Korra was subsequently stripped of her bending abilities, while Mako observed the event in horror and anger. Korra tried to stand and fight Amon, but she was too weak and collapsed. The revolutionary quickly approached Mako, intending to also remove his bending. However, Mako blasted Amon with a bolt of lightning, subsequently breaking out of the latter's bloodbending. Mako picked up a barely conscious Korra, who weakly lamented over her lost bending. Amon quickly recovered and followed Mako, bending his blood once again in preparation to remove his firebending. However, at the last moment, Korra reacted instinctively to defend Mako and knocked Amon away with a blast of air."
    },
    {
      "body": "Amon was taken aback by Korra's airbending, though Korra herself was just as surprised at her newfound abilities. She began to blast air punches at Amon, who was unable to regain his ground. When Amon tried to subdue her again with his bloodbending, Korra was able to resist his hold, and airbent him out a window into the harbor. Amon's mask was knocked off his face and his \"scars\", which were only makeup the Equalist leader applied to his face, washed off in the water. As Amon was about to drown, he utilized his waterbending to propel himself out of the water in front of the crowd, which became disillusioned after his lies were exposed. Amon fled the battle, having lost the support of his Equalists, while Mako attempted to subdue him without success. Mako warmly embraced Korra, who was still weak from losing her bending.",
      "links": [],
      "text": "Amon was taken aback by Korra's airbending, though Korra herself was just as surprised at her newfound abilities. She began to blast air punches at Amon, who was unable to regain his ground. When Amon tried to subdue her again with his bloodbending, Korra was able to resist his hold, and airbent him out a window into the harbor. Amon's mask was knocked off his face and his \"scars\", which were only makeup the Equalist leader applied to his face, washed off in the water. As Amon was about to drown, he utilized his waterbending to propel himself out of the water in front of the crowd, which became disillusioned after his lies were exposed. Amon fled the battle, having lost the support of his Equalists, while Mako attempted to subdue him without success. Mako warmly embraced Korra, who was still weak from losing her bending."
    },
    {
      "body": "Mako and Korra reunited with Bolin, Tenzin and his family, Lin, Asami, and Iroh on Air Temple Island and watched Commander Bumi arrive with the rest of the fleet. Tenzin praised Korra for saving Republic City, but she was distraught both that Amon had escaped and that her identity as the Avatar was seemingly altered beyond repair.",
      "links": [],
      "text": "Mako and Korra reunited with Bolin, Tenzin and his family, Lin, Asami, and Iroh on Air Temple Island and watched Commander Bumi arrive with the rest of the fleet. Tenzin praised Korra for saving Republic City, but she was distraught both that Amon had escaped and that her identity as the Avatar was seemingly altered beyond repair."
    },
    {
      "body": "${link_0} at her lowest point, caused by the loss of her ${link_1}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "bending",
          "key": "${link_1}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "Korra at her lowest point, caused by the loss of her bending."
    },
    {
      "body": "Everyone accompanied Korra to the Southern Water Tribe, where she reunited with her parents and Katara. Despite her best efforts, Katara was unable to mend the spiritual block that was keeping Korra from bending the other three elements. A saddened Korra emerged and, despite reassurances from her friends and family that things would be all right, she quietly stepped outside, saying that they would not be.",
      "links": [],
      "text": "Everyone accompanied Korra to the Southern Water Tribe, where she reunited with her parents and Katara. Despite her best efforts, Katara was unable to mend the spiritual block that was keeping Korra from bending the other three elements. A saddened Korra emerged and, despite reassurances from her friends and family that things would be all right, she quietly stepped outside, saying that they would not be."
    },
    {
      "body": "Recognizing her moment of need, Mako followed her, intent on consoling her. With sad hostility, Korra told him to return to Republic City, saying that, as she was no longer the Avatar, Mako no longer owed her any favors. Mako told her he did not care if she was the Avatar or not, and he explained how he \"went crazy\" when she was kidnapped by Tarrlok because he was afraid he would \"never see [her] again\". He told Korra that he loved her, but she was too caught up in frustration and despair to say the same, so much so that she ran away on Naga, crying.",
      "links": [],
      "text": "Recognizing her moment of need, Mako followed her, intent on consoling her. With sad hostility, Korra told him to return to Republic City, saying that, as she was no longer the Avatar, Mako no longer owed her any favors. Mako told her he did not care if she was the Avatar or not, and he explained how he \"went crazy\" when she was kidnapped by Tarrlok because he was afraid he would \"never see [her] again\". He told Korra that he loved her, but she was too caught up in frustration and despair to say the same, so much so that she ran away on Naga, crying."
    },
    {
      "body": "Korra ran out onto the edge of the tundra overlooking the ocean and collapsed. She began to sob uncontrollably as she saw a man in ${link_0} attire standing behind her. Assuming that it was Tenzin, she told him to go away, but the man responded, \"But you called me here.\" Upon turning around, Korra discovered the man was Avatar Aang, proclaiming an end to her inability to connect with the spirits of past Avatars.",
      "links": [
        {
          "body": "Air Nomad",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "text": "Korra ran out onto the edge of the tundra overlooking the ocean and collapsed. She began to sob uncontrollably as she saw a man in Air Nomad attire standing behind her. Assuming that it was Tenzin, she told him to go away, but the man responded, \"But you called me here.\" Upon turning around, Korra discovered the man was Avatar Aang, proclaiming an end to her inability to connect with the spirits of past Avatars."
    },
    {
      "body": "${link_0} and ${link_1} admitting their feelings for each other.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "Korra and Mako admitting their feelings for each other."
    },
    {
      "body": "Korra was surprised to see Aang, who told her that she finally connected with her spiritual self. When Korra asked how, Aang told her, \"When we hit our lowest point, we are open to the greatest change.\" All of the previous incarnations of the Avatar appeared behind Aang and he used ${link_0} to restore Korra's bending. As her past lives faded away, Korra entered the Avatar State and bent all four elements for the first time. When she came out of the Avatar State, she turned around and saw an awestruck Mako standing near Naga. He smiled at her warmly and approached her. In return, she ran into his arms and kissed him, finally reaffirming her love toward him.",
      "links": [
        {
          "body": "energybending",
          "key": "${link_0}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        }
      ],
      "text": "Korra was surprised to see Aang, who told her that she finally connected with her spiritual self. When Korra asked how, Aang told her, \"When we hit our lowest point, we are open to the greatest change.\" All of the previous incarnations of the Avatar appeared behind Aang and he used energybending to restore Korra's bending. As her past lives faded away, Korra entered the Avatar State and bent all four elements for the first time. When she came out of the Avatar State, she turned around and saw an awestruck Mako standing near Naga. He smiled at her warmly and approached her. In return, she ran into his arms and kissed him, finally reaffirming her love toward him."
    },
    {
      "body": "Korra and Mako returned to their friends and family, and using energybending, she restored Lin Beifong's earthbending. Everyone watched in awe and admiration as Lin lifted several massive stones, confirming that her bending had returned. Lin thanked Korra and Tenzin approached her, saying how proud he was of her and addressed her as \"Avatar Korra\".",
      "links": [],
      "text": "Korra and Mako returned to their friends and family, and using energybending, she restored Lin Beifong's earthbending. Everyone watched in awe and admiration as Lin lifted several massive stones, confirming that her bending had returned. Lin thanked Korra and Tenzin approached her, saying how proud he was of her and addressed her as \"Avatar Korra\"."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Korra_(153_AG_-_170_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Korra_(153_AG_-_170_AG).html",
    "page": "History_of_Korra_(153_AG_-_170_AG)",
    "title": "History of Korra (153 AG – 170 AG)"
  }
}