{
  "categories": [
    {
      "body": "Katara",
      "target": {
        "href": "Category_Katara",
        "page": "Category_Katara"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "After the ${link_0} of ${link_1}, ${link_2} and her friends hid away in the ${link_3}, stole ${link_4} to disguise themselves, and planned for the ${link_5}.",
      "links": [
        {
          "body": "fall",
          "key": "${link_0}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "clothes",
          "key": "${link_4}",
          "target": {
            "href": "Fashion_in_the_World_of_Avatar",
            "page": "Fashion_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Invasion",
          "key": "${link_5}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "text": "After the fall of Ba Sing Se, Katara and her friends hid away in the Fire Nation, stole clothes to disguise themselves, and planned for the Invasion."
    },
    {
      "body": "At the start of the summer of 100 ${link_0}, ${link_1} learned he had been unconscious for a few weeks after having been shot with lightning. Katara informed Aang that he had grown a head of hair and remarked her admiration of this aspect. ${link_2} approached to formally introduce himself to Aang. Katara became angered at his remark of being ${link_3} and Katara's father seeing as she had just called him \"dad\". After she demanded privacy from her father, Aang asked if she was angry at him, a statement she denied. Aang, still feeling pain from his injuries, went back to his room with Katara to undergo healing. During the healing session, Aang recalled the battle in Ba Sing Se and realized that he was \"gone\" before Katara brought him back. The next day, Sokka informed Aang about their return to ${link_4} after he was injured. The gang found her father and later captured a ${link_5}. Hakoda told Aang that despite the Fire Nation's capture of Ba Sing Se, they still planned to invade the Fire Nation on the Day of Black Sun. In an angered tone, Katara corrected him, stating it was Sokka's plan, surprising her father with this remark. Sokka revealed to Aang that the eclipse was not even their biggest advantage and that they had a secret, being Aang. He explained how the whole world thinks the ${link_6} is dead which upset Aang.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Hakoda",
          "key": "${link_2}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_3}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Chameleon Bay",
          "key": "${link_4}",
          "target": {
            "href": "Chameleon_Bay",
            "page": "Chameleon_Bay"
          }
        },
        {
          "body": "Fire Nation ship",
          "key": "${link_5}",
          "target": {
            "href": "Fire_Nation_cruiser",
            "page": "Fire_Nation_cruiser"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_6}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "At the start of the summer of 100 AG, Aang learned he had been unconscious for a few weeks after having been shot with lightning. Katara informed Aang that he had grown a head of hair and remarked her admiration of this aspect. Hakoda approached to formally introduce himself to Aang. Katara became angered at his remark of being Sokka and Katara's father seeing as she had just called him \"dad\". After she demanded privacy from her father, Aang asked if she was angry at him, a statement she denied. Aang, still feeling pain from his injuries, went back to his room with Katara to undergo healing. During the healing session, Aang recalled the battle in Ba Sing Se and realized that he was \"gone\" before Katara brought him back. The next day, Sokka informed Aang about their return to Chameleon Bay after he was injured. The gang found her father and later captured a Fire Nation ship. Hakoda told Aang that despite the Fire Nation's capture of Ba Sing Se, they still planned to invade the Fire Nation on the Day of Black Sun. In an angered tone, Katara corrected him, stating it was Sokka's plan, surprising her father with this remark. Sokka revealed to Aang that the eclipse was not even their biggest advantage and that they had a secret, being Aang. He explained how the whole world thinks the Avatar is dead which upset Aang."
    },
    {
      "body": "${link_0} covered the ${link_1} in mist.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Fire Nation cruiser",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_cruiser",
            "page": "Fire_Nation_cruiser"
          }
        }
      ],
      "text": "Katara covered the Fire Nation cruiser in mist."
    },
    {
      "body": "Katara and the others ran into another Fire Nation ship. The ship captain interrogated ${link_0} and Hakoda, disguised as Fire Nation soldiers, but soon figured out their ship had been captured and arranged plans to sink it. ${link_1} overheard the plans and metalbent the ship to a point that caused the other soldiers to fall off. Katara nearly capsized the enemy ship through the use of ${link_2} and the team attempted to escape. Despite the tremendous efforts of Katara and Toph, the ship took heavy damage from the pursuing Fire Nation ship. Out of sheer misfortune, the serpent of the ${link_3} appeared only to be struck by a stray fireball. The heroes escaped as the enraged serpent attacks the enemy Fire Nation ship. Later on, Katara, Toph and Sokka walked into Aang's room, stating they were going to a market to get dinner. Sokka encouraged Aang to wear a headband to obscure his arrow tattoos, but Aang refused. While Toph and Sokka go to the market, Katara stayed behind to talk with Aang, attempting to console him after he stated his feelings of failure. Shortly after she left, Aang, feeling helpless and useless during the fight and guilty about failing in Ba Sing Se, flew off alone on a mission to regain his honor. Katara, after discovering that Aang was missing, broke down in horror and confronted her father on her feelings about him leaving her and Sokka to fight in the War. She was the first to hug Aang when they found him on the shores of the Fire Nation and was greatly relieved upon seeing he is safe.",
      "links": [
        {
          "body": "Bato",
          "key": "${link_0}",
          "target": {
            "href": "Bato",
            "page": "Bato"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_2}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Serpent's Pass",
          "key": "${link_3}",
          "target": {
            "href": "Serpent%27s_Pass",
            "page": "Serpent%27s_Pass"
          }
        }
      ],
      "text": "Katara and the others ran into another Fire Nation ship. The ship captain interrogated Bato and Hakoda, disguised as Fire Nation soldiers, but soon figured out their ship had been captured and arranged plans to sink it. Toph overheard the plans and metalbent the ship to a point that caused the other soldiers to fall off. Katara nearly capsized the enemy ship through the use of waterbending and the team attempted to escape. Despite the tremendous efforts of Katara and Toph, the ship took heavy damage from the pursuing Fire Nation ship. Out of sheer misfortune, the serpent of the Serpent's Pass appeared only to be struck by a stray fireball. The heroes escaped as the enraged serpent attacks the enemy Fire Nation ship. Later on, Katara, Toph and Sokka walked into Aang's room, stating they were going to a market to get dinner. Sokka encouraged Aang to wear a headband to obscure his arrow tattoos, but Aang refused. While Toph and Sokka go to the market, Katara stayed behind to talk with Aang, attempting to console him after he stated his feelings of failure. Shortly after she left, Aang, feeling helpless and useless during the fight and guilty about failing in Ba Sing Se, flew off alone on a mission to regain his honor. Katara, after discovering that Aang was missing, broke down in horror and confronted her father on her feelings about him leaving her and Sokka to fight in the War. She was the first to hug Aang when they found him on the shores of the Fire Nation and was greatly relieved upon seeing he is safe."
    },
    {
      "body": "${link_0} disguised herself as a ${link_1} ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "citizen",
          "key": "${link_2}",
          "target": {
            "href": "Society_in_the_World_of_Avatar#Fire_Nation",
            "page": "Society_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Katara disguised herself as a Fire Nation citizen."
    },
    {
      "body": "Katara and the others traveled to the Fire Nation with Aang, using ${link_0} and waterbending to hide themselves and ${link_1} in a cloud cover. They took temporary shelter in a cave and decided to seek out new clothes to help them better blend into the Fire Nation. They found an unattended clothesline, stole some outfits and went to town to buy some accessories. Katara sadly removed her ${link_2} to replace it with a Fire Nation one after it was pointed out to be too obviously Water Tribe by Aang.",
      "links": [
        {
          "body": "airbending",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "mother's Water Tribe necklace",
          "key": "${link_2}",
          "target": {
            "href": "Katara%27s_necklace",
            "page": "Katara%27s_necklace"
          }
        }
      ],
      "text": "Katara and the others traveled to the Fire Nation with Aang, using airbending and waterbending to hide themselves and Appa in a cloud cover. They took temporary shelter in a cave and decided to seek out new clothes to help them better blend into the Fire Nation. They found an unattended clothesline, stole some outfits and went to town to buy some accessories. Katara sadly removed her mother's Water Tribe necklace to replace it with a Fire Nation one after it was pointed out to be too obviously Water Tribe by Aang."
    },
    {
      "body": "Aang enrolled in a ${link_0} and got into trouble for \"roughing up\" a favored student of the ${link_1}, resulting in a parent-teacher conference. Sokka and Katara attended the conference acting as Aang's parents, calling themselves \"Mr. Wang Fire\" and \"Mrs. Sapphire Fire\". After the conference, Aang insisted on helping the children in the school and decided to hold a secret dance party for them in the cave. When Aang asked Katara to dance, she began making multiple excuses out of shyness; at last she accepted his offer and took Aang's hand. She became embarrassed by the amount of attention they received from other students, however, Aang smoothly reassured her, leaving her blushing before they became serious. They performed a combination of neijia drills and capoeira in synchronization, which appeared to be an acrobatic dance. However, the headmaster and several teachers appeared on the scene, having been told of the dance by ${link_2}. The crew managed to slip away in the opening behind the cave. While the party flew off on Appa, Toph complimented Aang on his efforts, which she believed had a serious impact on the students. Katara agreed and kissed Aang on the cheek which caused him to blush.",
      "links": [
        {
          "body": "Fire Nation school",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_school",
            "page": "Fire_Nation_school"
          }
        },
        {
          "body": "Headmaster",
          "key": "${link_1}",
          "target": {
            "href": "Headmaster",
            "page": "Headmaster"
          }
        },
        {
          "body": "Hide",
          "key": "${link_2}",
          "target": {
            "href": "Hide",
            "page": "Hide"
          }
        }
      ],
      "text": "Aang enrolled in a Fire Nation school and got into trouble for \"roughing up\" a favored student of the Headmaster, resulting in a parent-teacher conference. Sokka and Katara attended the conference acting as Aang's parents, calling themselves \"Mr. Wang Fire\" and \"Mrs. Sapphire Fire\". After the conference, Aang insisted on helping the children in the school and decided to hold a secret dance party for them in the cave. When Aang asked Katara to dance, she began making multiple excuses out of shyness; at last she accepted his offer and took Aang's hand. She became embarrassed by the amount of attention they received from other students, however, Aang smoothly reassured her, leaving her blushing before they became serious. They performed a combination of neijia drills and capoeira in synchronization, which appeared to be an acrobatic dance. However, the headmaster and several teachers appeared on the scene, having been told of the dance by Hide. The crew managed to slip away in the opening behind the cave. While the party flew off on Appa, Toph complimented Aang on his efforts, which she believed had a serious impact on the students. Katara agreed and kissed Aang on the cheek which caused him to blush."
    },
    {
      "body": "The group floated downstream in the middle of a river heavily polluted by brown sludge deposited by a nearby military factory. With little chance of catching any food, they decided to buy some at a nearby village floating in the middle of the river. Many villagers were sick because of lack of food or medicine and the polluted water. Katara wished to help the people, but Sokka said their overall mission should remain their primary focus. Katara berated him for his thoughtlessness toward the poor people, but was soon convinced their mission must be given prime importance. When a small child asked her for spare food, however, Katara gave him one of the fish they had bought.",
      "links": [],
      "text": "The group floated downstream in the middle of a river heavily polluted by brown sludge deposited by a nearby military factory. With little chance of catching any food, they decided to buy some at a nearby village floating in the middle of the river. Many villagers were sick because of lack of food or medicine and the polluted water. Katara wished to help the people, but Sokka said their overall mission should remain their primary focus. Katara berated him for his thoughtlessness toward the poor people, but was soon convinced their mission must be given prime importance. When a small child asked her for spare food, however, Katara gave him one of the fish they had bought."
    },
    {
      "body": "${link_0} assumed the persona of the ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Painted Lady",
          "key": "${link_1}",
          "target": {
            "href": "Painted_Lady",
            "page": "Painted_Lady"
          }
        }
      ],
      "text": "Katara assumed the persona of the Painted Lady."
    },
    {
      "body": "In the morning, Appa was found lying on his side, his tongue purple. Katara suggested the village might have herbs with which to heal him. When they arrived at the village, everyone appeared to be in much better spirits. According to ${link_0}, a legendary local river spirit known as the ${link_1} came and delivered food the previous night. When he stated that no medicine was available, Katara suggested they let Appa rest for another day. That night, a thick mist descended upon the village and the Painted Lady arrived to heal several of the sick. The child Katara helped earlier thanked her and the Painted Lady, actually Katara in disguise, left across the water.",
      "links": [
        {
          "body": "Xu",
          "key": "${link_0}",
          "target": {
            "href": "Dock/Xu/Bushi",
            "page": "Dock/Xu/Bushi"
          }
        },
        {
          "body": "Painted Lady",
          "key": "${link_1}",
          "target": {
            "href": "Painted_Lady",
            "page": "Painted_Lady"
          }
        }
      ],
      "text": "In the morning, Appa was found lying on his side, his tongue purple. Katara suggested the village might have herbs with which to heal him. When they arrived at the village, everyone appeared to be in much better spirits. According to Xu, a legendary local river spirit known as the Painted Lady came and delivered food the previous night. When he stated that no medicine was available, Katara suggested they let Appa rest for another day. That night, a thick mist descended upon the village and the Painted Lady arrived to heal several of the sick. The child Katara helped earlier thanked her and the Painted Lady, actually Katara in disguise, left across the water."
    },
    {
      "body": "With Appa still sick the next day, they returned to the village. The village, in even higher spirits, had erected a large statue of the Painted Lady in gratitude for healing their sick. Dock suggested that perhaps the Painted Lady could heal Appa. Sokka skeptically noted that the Painted Lady's work would be all for nothing unless she continually helped them for as long as the factory should stand. He jokingly suggested that the spirit should use her \"spirit magic\" to destroy the building.",
      "links": [],
      "text": "With Appa still sick the next day, they returned to the village. The village, in even higher spirits, had erected a large statue of the Painted Lady in gratitude for healing their sick. Dock suggested that perhaps the Painted Lady could heal Appa. Sokka skeptically noted that the Painted Lady's work would be all for nothing unless she continually helped them for as long as the factory should stand. He jokingly suggested that the spirit should use her \"spirit magic\" to destroy the building."
    },
    {
      "body": "That night, Katara once again disguised herself, accidentally waking both ${link_0} and Aang upon her departure. Seeing the Painted Lady, Aang attempted to persuade her to aid their group, prompting Katara to flee. Aang chased her to the village where he discovered her scheme. Appa's illness was the result of her feeding him berries that stained his tongue. Katara sadly confessed her actions and the assumption of her identity as the Painted Lady. She apologized for delaying them, however, Aang stated his approval of the idea. Together, the two infiltrated the factory and destroyed it, stopping the flow of the polluted sludge.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "That night, Katara once again disguised herself, accidentally waking both Momo and Aang upon her departure. Seeing the Painted Lady, Aang attempted to persuade her to aid their group, prompting Katara to flee. Aang chased her to the village where he discovered her scheme. Appa's illness was the result of her feeding him berries that stained his tongue. Katara sadly confessed her actions and the assumption of her identity as the Painted Lady. She apologized for delaying them, however, Aang stated his approval of the idea. Together, the two infiltrated the factory and destroyed it, stopping the flow of the polluted sludge."
    },
    {
      "body": "${link_0} was approached by the real ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Painted Lady",
          "key": "${link_1}",
          "target": {
            "href": "Painted_Lady",
            "page": "Painted_Lady"
          }
        }
      ],
      "text": "Katara was approached by the real Painted Lady."
    },
    {
      "body": "Upon returning to the campsite, they realized Toph and Sokka had unfolded their plot. As they prepared to leave, they caught sight of a squad of Fire Nation troops heading toward the town on speeders and realized they must believe the villagers had sabotaged the factory. Determined to stop them, Katara and Aang, with help from Appa, Toph and Sokka providing spooky sound effects, staged an encounter with the Painted Lady to defeat the troops and drive them away.",
      "links": [],
      "text": "Upon returning to the campsite, they realized Toph and Sokka had unfolded their plot. As they prepared to leave, they caught sight of a squad of Fire Nation troops heading toward the town on speeders and realized they must believe the villagers had sabotaged the factory. Determined to stop them, Katara and Aang, with help from Appa, Toph and Sokka providing spooky sound effects, staged an encounter with the Painted Lady to defeat the troops and drive them away."
    },
    {
      "body": "The team stayed behind long enough to help the villagers clean the ${link_0}. That night, as Katara examined the water, a thick mist appeared and the real Painted Lady appeared to express her gratitude.",
      "links": [
        {
          "body": "Jang Hui River",
          "key": "${link_0}",
          "target": {
            "href": "Jang_Hui_River",
            "page": "Jang_Hui_River"
          }
        }
      ],
      "text": "The team stayed behind long enough to help the villagers clean the Jang Hui River. That night, as Katara examined the water, a thick mist appeared and the real Painted Lady appeared to express her gratitude."
    },
    {
      "body": "Katara and the others witnessed a ${link_0} shower one night when a meteorite suddenly soared past them and collided into the earth, resulting in a fire. With a village lying nearby, the team raced to the scene of the incident to extinguish the fire. Katara used waterbending to douse the flames.",
      "links": [
        {
          "body": "meteor",
          "key": "${link_0}",
          "target": {
            "href": "Meteor",
            "page": "Meteor"
          }
        }
      ],
      "text": "Katara and the others witnessed a meteor shower one night when a meteorite suddenly soared past them and collided into the earth, resulting in a fire. With a village lying nearby, the team raced to the scene of the incident to extinguish the fire. Katara used waterbending to douse the flames."
    },
    {
      "body": "${link_0} suggested to go shopping in order to cheer up ${link_1}, a decision that eventually led to him starting his ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "swordsmanship training",
          "key": "${link_2}",
          "target": {
            "href": "Swordsmanship_training",
            "page": "Swordsmanship_training"
          }
        }
      ],
      "text": "Katara suggested to go shopping in order to cheer up Sokka, a decision that eventually led to him starting his swordsmanship training."
    },
    {
      "body": "After successfully extinguishing the fire, Sokka began to brood on the fact that he did not possess bending abilities as opposed to the rest. Katara suggested they go shopping to cheer him up. When he discovered a sword to his liking in the weaponry store, the shop owner informed him it was crafted by the greatest sword master and sword maker in Fire Nation history, ${link_0}, who lived nearby. Katara suggested to Sokka to study under him. Sokka took her advice and traveled to ${link_1} to learn the ways of the sword while Katara, Aang and Toph waited impatiently for his return. He later returned, appealing for help in taking the extinguished meteorite to Piandao's palace where he proceeded to craft his own sword.",
      "links": [
        {
          "body": "Piandao",
          "key": "${link_0}",
          "target": {
            "href": "Piandao",
            "page": "Piandao"
          }
        },
        {
          "body": "Piandao's castle",
          "key": "${link_1}",
          "target": {
            "href": "Piandao%27s_castle",
            "page": "Piandao%27s_castle"
          }
        }
      ],
      "text": "After successfully extinguishing the fire, Sokka began to brood on the fact that he did not possess bending abilities as opposed to the rest. Katara suggested they go shopping to cheer him up. When he discovered a sword to his liking in the weaponry store, the shop owner informed him it was crafted by the greatest sword master and sword maker in Fire Nation history, Piandao, who lived nearby. Katara suggested to Sokka to study under him. Sokka took her advice and traveled to Piandao's castle to learn the ways of the sword while Katara, Aang and Toph waited impatiently for his return. He later returned, appealing for help in taking the extinguished meteorite to Piandao's palace where he proceeded to craft his own sword."
    },
    {
      "body": "When Piandao presented him with his meteorite sword, Sokka revealed he was from the ${link_0}, not the Fire Nation. When Piandao suddenly engaged him in a duel, the others ran to Sokka's aid only to be halted by their friend, who claimed this to be his fight alone. Katara, Aang and Toph witnessed the duel, eventually resulting in Piandao's overpowering of Sokka. Sensing him to be in danger, they rushed to his aid only to be paused by Piandao who praised his skills and signals the end of the battle. The swordmaster revealed his knowledge of Aang being the Avatar and Sokka hailing from the Water Tribe and addressed Sokka himself, claiming he would gradually become a more superior swordmaster. The team soon departed from the palace.",
      "links": [
        {
          "body": "Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        }
      ],
      "text": "When Piandao presented him with his meteorite sword, Sokka revealed he was from the Water Tribe, not the Fire Nation. When Piandao suddenly engaged him in a duel, the others ran to Sokka's aid only to be halted by their friend, who claimed this to be his fight alone. Katara, Aang and Toph witnessed the duel, eventually resulting in Piandao's overpowering of Sokka. Sensing him to be in danger, they rushed to his aid only to be paused by Piandao who praised his skills and signals the end of the battle. The swordmaster revealed his knowledge of Aang being the Avatar and Sokka hailing from the Water Tribe and addressed Sokka himself, claiming he would gradually become a more superior swordmaster. The team soon departed from the palace."
    },
    {
      "body": "Katara and the others rested in an isolated quarry where Aang unknowingly revealed his identity to two Fire Nation soldiers patrolling the area nearby. Stunned to discover the Avatar was secretly alive, they sent a message to the ${link_0} on a ${link_1}; however, the journey was intercepted by a ${link_2} owned by ${link_3}, the assassin that ${link_4} ${link_5} had hired to eliminate Aang. That night, while sleeping, Combustion Man attacked them, using a special ${link_6} technique that enabled him to shoot fire from his third eye. After an initial attack, Katara created a wave from the lake in order to fight the assassin, but it was intercepted by an explosion, engulfing the crater in steam. A short duel broke out against Combustion Man and Aang, allowing Katara, as well as the rest of ${link_7}, to escape on Appa.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "messenger hawk",
          "key": "${link_1}",
          "target": {
            "href": "Messenger_hawk",
            "page": "Messenger_hawk"
          }
        },
        {
          "body": "raven eagle",
          "key": "${link_2}",
          "target": {
            "href": "Raven_eagle",
            "page": "Raven_eagle"
          }
        },
        {
          "body": "Combustion Man",
          "key": "${link_3}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        },
        {
          "body": "Prince",
          "key": "${link_4}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_5}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebending",
          "key": "${link_6}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_7}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Katara and the others rested in an isolated quarry where Aang unknowingly revealed his identity to two Fire Nation soldiers patrolling the area nearby. Stunned to discover the Avatar was secretly alive, they sent a message to the Fire Lord on a messenger hawk; however, the journey was intercepted by a raven eagle owned by Combustion Man, the assassin that Prince Zuko had hired to eliminate Aang. That night, while sleeping, Combustion Man attacked them, using a special firebending technique that enabled him to shoot fire from his third eye. After an initial attack, Katara created a wave from the lake in order to fight the assassin, but it was intercepted by an explosion, engulfing the crater in steam. A short duel broke out against Combustion Man and Aang, allowing Katara, as well as the rest of Team Avatar, to escape on Appa."
    },
    {
      "body": "Aang and his friends traveled to the island that was once Avatar Roku's home, after Roku himself approached Aang in a dream. Once there, Aang meditated and ventured into the Spirit World. At one point, Katara asked Sokka whether there were bathrooms in the Spirit World to which Sokka replied that there were not. When Aang returned to the physical world and told of his adventure with Roku, Katara expressed shock at learning how Fire Lord Sozin betrayed Roku. She, along with the others, held hands at the end.",
      "links": [],
      "text": "Aang and his friends traveled to the island that was once Avatar Roku's home, after Roku himself approached Aang in a dream. Once there, Aang meditated and ventured into the Spirit World. At one point, Katara asked Sokka whether there were bathrooms in the Spirit World to which Sokka replied that there were not. When Aang returned to the physical world and told of his adventure with Roku, Katara expressed shock at learning how Fire Lord Sozin betrayed Roku. She, along with the others, held hands at the end."
    },
    {
      "body": "The team briefly resided near a Fire Nation Fountain City where Toph began using her ${link_0} skills to scam local residents for money. Katara immediately became displeased with Toph's behavior, accusing Toph's motive behind her actions as an attempt to avoid thinking about her parents whom she ran away from. When Katara discovered a wanted poster of Toph, nicknaming her \"The Runaway\", things only grew worse.",
      "links": [
        {
          "body": "earthbending",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "The team briefly resided near a Fire Nation Fountain City where Toph began using her earthbending skills to scam local residents for money. Katara immediately became displeased with Toph's behavior, accusing Toph's motive behind her actions as an attempt to avoid thinking about her parents whom she ran away from. When Katara discovered a wanted poster of Toph, nicknaming her \"The Runaway\", things only grew worse."
    },
    {
      "body": "${link_0} and ${link_1} got into an argument about the latter's recklessness.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Katara and Toph got into an argument about the latter's recklessness."
    },
    {
      "body": "Another argument broke out between the two with Toph ranting about how Katara was acting too motherly which upsets the latter greatly. Later, while bathing in the water, Katara overheard a conversation between Toph and Sokka. Sokka confessed to Toph that although Katara did become bossy at times, the maternal role she took on when their mother died was so great that he had since replaced his image of his mother with his sister's face. Toph also revealed that she thought Katara's bossy nature was not always bad, as Katara actually cared about who Toph really was, which was more than even her own mother did for her.",
      "links": [],
      "text": "Another argument broke out between the two with Toph ranting about how Katara was acting too motherly which upsets the latter greatly. Later, while bathing in the water, Katara overheard a conversation between Toph and Sokka. Sokka confessed to Toph that although Katara did become bossy at times, the maternal role she took on when their mother died was so great that he had since replaced his image of his mother with his sister's face. Toph also revealed that she thought Katara's bossy nature was not always bad, as Katara actually cared about who Toph really was, which was more than even her own mother did for her."
    },
    {
      "body": "Katara was deeply touched by this conversation and later devised a scam with Toph, much to everyone's surprise. Things did not turn out the way she had expected, however, when both she and Toph became imprisoned in a wooden cell by Combustion Man. The two girls managed to escape when Katara realized that she could bend her sweat, and doing so she was able to slice through the wooden cell holding them captive. The relationship between the two was finally mended when Katara agreed to help Toph send a letter to her parents.",
      "links": [],
      "text": "Katara was deeply touched by this conversation and later devised a scam with Toph, much to everyone's surprise. Things did not turn out the way she had expected, however, when both she and Toph became imprisoned in a wooden cell by Combustion Man. The two girls managed to escape when Katara realized that she could bend her sweat, and doing so she was able to slice through the wooden cell holding them captive. The relationship between the two was finally mended when Katara agreed to help Toph send a letter to her parents."
    },
    {
      "body": "As the team continued on their journey, they stopped in a forest and started telling ghost stories. Sokka told one about a haunted sword which failed to scare anyone. Katara proceeded to tell a story of her mother's friend, Nini, who mysteriously disappeared during a snowstorm, which managed to frighten everyone. Toph suddenly stated she heard screaming coming from under the mountain only for the noise to abruptly cease. An old woman named ${link_0} suddenly appeared, offering them a safe place to stay for the night. The group accepted her offer to stay at her inn where they learn of mysterious disappearances occurring on nights of the full moon.",
      "links": [
        {
          "body": "Hama",
          "key": "${link_0}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        }
      ],
      "text": "As the team continued on their journey, they stopped in a forest and started telling ghost stories. Sokka told one about a haunted sword which failed to scare anyone. Katara proceeded to tell a story of her mother's friend, Nini, who mysteriously disappeared during a snowstorm, which managed to frighten everyone. Toph suddenly stated she heard screaming coming from under the mountain only for the noise to abruptly cease. An old woman named Hama suddenly appeared, offering them a safe place to stay for the night. The group accepted her offer to stay at her inn where they learn of mysterious disappearances occurring on nights of the full moon."
    },
    {
      "body": "The next day, Hama led her guests on a shopping trip, wherein Sokka overheard some of the locals talking about the disappearances during the full moon. When Hama sent her guests back to the inn, Sokka investigated the house for anything suspicious. Their search resulted in the discovery of a cupboard of wooden puppets and a small chest lying in an empty room in the attic. Before they managed to open the box, Hama walked in and caught them in the act. The team surrendered the chest where Hama proceeded to open it herself, revealing there to be a Whale tooth comb stored inside. She claimed it to be her greatest treasure and last possession she owned from being raised in the ${link_0}. She went on to explain her knowledge of Katara and Sokka being raised in the Southern Tribe as well, a revelation that stunned the team.",
      "links": [
        {
          "body": "Southern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "The next day, Hama led her guests on a shopping trip, wherein Sokka overheard some of the locals talking about the disappearances during the full moon. When Hama sent her guests back to the inn, Sokka investigated the house for anything suspicious. Their search resulted in the discovery of a cupboard of wooden puppets and a small chest lying in an empty room in the attic. Before they managed to open the box, Hama walked in and caught them in the act. The team surrendered the chest where Hama proceeded to open it herself, revealing there to be a Whale tooth comb stored inside. She claimed it to be her greatest treasure and last possession she owned from being raised in the Southern Water Tribe. She went on to explain her knowledge of Katara and Sokka being raised in the Southern Tribe as well, a revelation that stunned the team."
    },
    {
      "body": "${link_0} received ${link_1} training from ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Hama",
          "key": "${link_2}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        }
      ],
      "text": "Katara received waterbending training from Hama."
    },
    {
      "body": "During dinner that night, Hama revealed herself to be a waterbender and a victim of the devastating Southern Water Tribe raids, having been captured as a young woman and detained in a facility specifically designed to hold waterbenders. Hama also revealed to be the only one who managed to escape, but was too upset to explain more. She offered to tutor Katara in order to carry on the tradition of the Southern waterbenders to which the young waterbender happily agreed, wanting to learn more about her tribe's cultural heritage. The next day, Hama personally trained Katara and explained to her that water can be found in unexpected places. She demonstrated to her several useful techniques including the manipulation of water vapor and the ambient channeling of water from fire lilies, flowers native to the Fire Nation. She told Katara of one more technique she had to teach, one that could only be utilized under the full moon. When Katara expressed hesitance due to rumors of the disappearances, Hama reassured her, stating that two master waterbenders beneath a full moon should be able to handle anything.",
      "links": [],
      "text": "During dinner that night, Hama revealed herself to be a waterbender and a victim of the devastating Southern Water Tribe raids, having been captured as a young woman and detained in a facility specifically designed to hold waterbenders. Hama also revealed to be the only one who managed to escape, but was too upset to explain more. She offered to tutor Katara in order to carry on the tradition of the Southern waterbenders to which the young waterbender happily agreed, wanting to learn more about her tribe's cultural heritage. The next day, Hama personally trained Katara and explained to her that water can be found in unexpected places. She demonstrated to her several useful techniques including the manipulation of water vapor and the ambient channeling of water from fire lilies, flowers native to the Fire Nation. She told Katara of one more technique she had to teach, one that could only be utilized under the full moon. When Katara expressed hesitance due to rumors of the disappearances, Hama reassured her, stating that two master waterbenders beneath a full moon should be able to handle anything."
    },
    {
      "body": "That night, Hama took Katara into the woods where the alleged disappearances have occurred. She recounted her time spent in prison and discovery of a dark technique known as ${link_0}, controlling the water in another body, which could only be used under the influence of the full moon enhancing her abilities. Horrified by the idea of controlling another person's body, Katara refused to learn bloodbending. This led Katara to realize that Hama had been causing the villagers to disappear, but Hama angrily stated that the people of the Fire Nation deserve the same treatment that they gave to the Southern waterbenders. Hearing this causes Katara to adamantly refuse to learn bloodbending and attempted to stop Hama from further terrorizing the town.",
      "links": [
        {
          "body": "bloodbending",
          "key": "${link_0}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        }
      ],
      "text": "That night, Hama took Katara into the woods where the alleged disappearances have occurred. She recounted her time spent in prison and discovery of a dark technique known as bloodbending, controlling the water in another body, which could only be used under the influence of the full moon enhancing her abilities. Horrified by the idea of controlling another person's body, Katara refused to learn bloodbending. This led Katara to realize that Hama had been causing the villagers to disappear, but Hama angrily stated that the people of the Fire Nation deserve the same treatment that they gave to the Southern waterbenders. Hearing this causes Katara to adamantly refuse to learn bloodbending and attempted to stop Hama from further terrorizing the town."
    },
    {
      "body": "${link_0} ${link_1} ${link_2} in order to protect ${link_3} and ${link_4}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "bloodbent",
          "key": "${link_1}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "Hama",
          "key": "${link_2}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_4}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Katara bloodbent Hama in order to protect Aang and Sokka."
    },
    {
      "body": "Hama used the technique to temporarily force Katara into submission, however, the latter quickly regained control of her body, telling Hama that she not only draws power from the full moon as well, but her bending was far more powerful. The two began to battle, each drawing water from the grass and trees surrounding them; it quickly became obvious that they were equally matched. When Katara seemingly gained the upper hand, Aang and Sokka arrived to assist her. Hama, using bloodbending, sent them flying first Katara and soon at each other, with Sokka's sword pointing straight at Aang. At the last second, Katara used bloodbending to subdue Hama and protect Aang and Sokka. Toph arrived with the other villagers, who handcuffed Hama and took her away, vowing to imprison her forever. Hama remarked that her work is done, as Katara had already willfully used bloodbending and laughs as she was dragged off. Katara subsequently broke down in tears, with Aang, Sokka and Toph's comfort.",
      "links": [],
      "text": "Hama used the technique to temporarily force Katara into submission, however, the latter quickly regained control of her body, telling Hama that she not only draws power from the full moon as well, but her bending was far more powerful. The two began to battle, each drawing water from the grass and trees surrounding them; it quickly became obvious that they were equally matched. When Katara seemingly gained the upper hand, Aang and Sokka arrived to assist her. Hama, using bloodbending, sent them flying first Katara and soon at each other, with Sokka's sword pointing straight at Aang. At the last second, Katara used bloodbending to subdue Hama and protect Aang and Sokka. Toph arrived with the other villagers, who handcuffed Hama and took her away, vowing to imprison her forever. Hama remarked that her work is done, as Katara had already willfully used bloodbending and laughs as she was dragged off. Katara subsequently broke down in tears, with Aang, Sokka and Toph's comfort."
    },
    {
      "body": "${link_0}, ${link_1}, and ${link_2} worked together to reassure ${link_3} that he was ready to take on ${link_4} ${link_5} and helped him relax in the days prior.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Toph",
          "key": "${link_2}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_4}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_5}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Katara, Sokka, and Toph worked together to reassure Aang that he was ready to take on Fire Lord Ozai and helped him relax in the days prior."
    },
    {
      "body": "Within the following days, Katara and the rest of the team arrived to the uninhabited ${link_0} located in the Fire Nation, the rendezvous point for the entire invasion force. Aang learned there were only four days left until the invasion and felt unprepared, having not learned firebending. He started having nightmares about his duel with Fire Lord ${link_1} and trained relentlessly, depriving him of sleep. He started having hallucinations and grew increasingly tired, so Katara and the others attempted to help. Katara attempted to relax Aang with a few yoga sessions inside a nearby soothing hot spring. However, the heat from the water reminded Aang of the Fire Lord's firebending, causing him to panic even more. When Aang continued to train nonstop, Katara managed to persuade him to sleep for a while. The day before the invasion, Aang talked to Katara, telling her his lack of sleep had helped him to realize that while he was fighting the Fire Lord to save the world, he was also doing it for her. He confessed that he loved her and kissed her passionately. However, this turned out to be a mere hallucination, with Aang having to explain his behavior to a confused Katara by lying that he daydreamed about living underwater, much to her amusement. He suffered a severe hallucination later that day, prompting Katara and her friends to shave an entire herd of ${link_2} and use their wool to create a large bed for Aang. When he refused to sleep due to his lack of confidence in the upcoming battle, Katara reassured him that he was prepared to fight. She recounted that since the day they met, Aang had trained for this battle and had become incredibly strong, brave and smart, displaying great prowess in battle and a great love for his friends and allies. Because of Katara and the others, Aang finally got some decent sleep, now fully confident in his ability to defeat Ozai.",
      "links": [
        {
          "body": "Black Cliffs",
          "key": "${link_0}",
          "target": {
            "href": "Black_Cliffs",
            "page": "Black_Cliffs"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_1}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "koala sheep",
          "key": "${link_2}",
          "target": {
            "href": "Koala_sheep",
            "page": "Koala_sheep"
          }
        }
      ],
      "text": "Within the following days, Katara and the rest of the team arrived to the uninhabited Black Cliffs located in the Fire Nation, the rendezvous point for the entire invasion force. Aang learned there were only four days left until the invasion and felt unprepared, having not learned firebending. He started having nightmares about his duel with Fire Lord Ozai and trained relentlessly, depriving him of sleep. He started having hallucinations and grew increasingly tired, so Katara and the others attempted to help. Katara attempted to relax Aang with a few yoga sessions inside a nearby soothing hot spring. However, the heat from the water reminded Aang of the Fire Lord's firebending, causing him to panic even more. When Aang continued to train nonstop, Katara managed to persuade him to sleep for a while. The day before the invasion, Aang talked to Katara, telling her his lack of sleep had helped him to realize that while he was fighting the Fire Lord to save the world, he was also doing it for her. He confessed that he loved her and kissed her passionately. However, this turned out to be a mere hallucination, with Aang having to explain his behavior to a confused Katara by lying that he daydreamed about living underwater, much to her amusement. He suffered a severe hallucination later that day, prompting Katara and her friends to shave an entire herd of koala sheep and use their wool to create a large bed for Aang. When he refused to sleep due to his lack of confidence in the upcoming battle, Katara reassured him that he was prepared to fight. She recounted that since the day they met, Aang had trained for this battle and had become incredibly strong, brave and smart, displaying great prowess in battle and a great love for his friends and allies. Because of Katara and the others, Aang finally got some decent sleep, now fully confident in his ability to defeat Ozai."
    },
    {
      "body": "The day of the Invasion arrived at last with many former allies and familiar characters reuniting with ${link_0}. During the ${link_1}, Katara assisted in the operation of the Mechanist's submarines, utilizing waterbending to control their buoyancy. When they resurfaced, she stated her pride in Aang, saying he was no longer the goofy kid she rescued from the iceberg. Aang suddenly kissed Katara, to which she reacted by leaning in. He left on his glider and she proceeded to jump on Appa and continued along with the submarines on their journey toward the Fire Nation.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Day of Black Sun",
          "key": "${link_1}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        }
      ],
      "text": "The day of the Invasion arrived at last with many former allies and familiar characters reuniting with Team Avatar. During the Day of Black Sun, Katara assisted in the operation of the Mechanist's submarines, utilizing waterbending to control their buoyancy. When they resurfaced, she stated her pride in Aang, saying he was no longer the goofy kid she rescued from the iceberg. Aang suddenly kissed Katara, to which she reacted by leaning in. He left on his glider and she proceeded to jump on Appa and continued along with the submarines on their journey toward the Fire Nation."
    },
    {
      "body": "Katara assisted in the battle against the firebenders, proving to be a worthy foe in combat once again. When her father was severely injured, she used her healing abilities to heal him, giving him the strength needed to carry on. Katara did not join Sokka, Toph and Aang in their pursuit of Fire Lord Ozai, opting instead to help her father move around.",
      "links": [],
      "text": "Katara assisted in the battle against the firebenders, proving to be a worthy foe in combat once again. When her father was severely injured, she used her healing abilities to heal him, giving him the strength needed to carry on. Katara did not join Sokka, Toph and Aang in their pursuit of Fire Lord Ozai, opting instead to help her father move around."
    },
    {
      "body": "${link_0} helped destroy the fleet of ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "war balloons",
          "key": "${link_1}",
          "target": {
            "href": "Hot_air_balloon",
            "page": "Hot_air_balloon"
          }
        }
      ],
      "text": "Katara helped destroy the fleet of war balloons."
    },
    {
      "body": "After having secured the ${link_0}, Bato asked ${link_1} if something should have happened by that time. Katara gave a dejected expression after hearing her father's view on the subject; since the eclipse was over, they would probably soon be bombarded by Fire Nation soldiers. Katara soon realized the truth of this assessment since, as she turned her head to the sky, she noticed a fleet of Fire Nation ${link_2} and ${link_3}. After Aang, Sokka, and Toph had returned from their failed attempt to defeat the ${link_4}, Katara mounted Appa to assist Aang in destroying the balloons. While initially successful, the abundance of firebending soldiers overwhelmed them, and they were forced to rejoin the invasion force. To make matters worse, the entire force could not escape because the Fire Nation destroyed their submarines, so Aang and all of the younger members of the force fled to the ${link_5} while the elders surrendered. Upset at having to separate from their father again, Katara and Sokka both embraced him. Shortly thereafter, Katara comforted a tearful Aang with a hand on his shoulder and a reassuring smile.",
      "links": [
        {
          "body": "Royal Palace",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_Royal_Palace",
            "page": "Fire_Nation_Royal_Palace"
          }
        },
        {
          "body": "Hakoda",
          "key": "${link_1}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "war balloons",
          "key": "${link_2}",
          "target": {
            "href": "Hot_air_balloon",
            "page": "Hot_air_balloon"
          }
        },
        {
          "body": "airships",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_4}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_5}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "text": "After having secured the Royal Palace, Bato asked Hakoda if something should have happened by that time. Katara gave a dejected expression after hearing her father's view on the subject; since the eclipse was over, they would probably soon be bombarded by Fire Nation soldiers. Katara soon realized the truth of this assessment since, as she turned her head to the sky, she noticed a fleet of Fire Nation war balloons and airships. After Aang, Sokka, and Toph had returned from their failed attempt to defeat the Fire Lord, Katara mounted Appa to assist Aang in destroying the balloons. While initially successful, the abundance of firebending soldiers overwhelmed them, and they were forced to rejoin the invasion force. To make matters worse, the entire force could not escape because the Fire Nation destroyed their submarines, so Aang and all of the younger members of the force fled to the Western Air Temple while the elders surrendered. Upset at having to separate from their father again, Katara and Sokka both embraced him. Shortly thereafter, Katara comforted a tearful Aang with a hand on his shoulder and a reassuring smile."
    },
    {
      "body": "Katara and the group arrived at the Western Air Temple and began discussing who would be Aang's firebending teacher. She suggested ${link_0}, but Aang retorted this suggestion, saying there was no way of finding him again. When Zuko showed up at the Temple, Katara became enraged and prepared to attack only for Zuko to announce that he had changed and now wanted to teach Aang firebending. Katara was the most opposed to trusting him and attacked him using waterbending when he insisted that he be taken as their prisoner. Katara later confessed to the gang that when she and Zuko were imprisoned in Ba Sing Se, he won her sympathy for him when he lamented the loss of his mother, ${link_1}; when he betrayed her by joining Azula, she vowed never to trust him again. Toph pointed out to the group that Zuko was being honest in his apologies over his past crimes and that he was the only available person to teach Aang firebending. However, Katara and the others shot her down with their disinterest, causing Toph to storm off.",
      "links": [
        {
          "body": "Jeong Jeong",
          "key": "${link_0}",
          "target": {
            "href": "Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        },
        {
          "body": "Ursa",
          "key": "${link_1}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        }
      ],
      "text": "Katara and the group arrived at the Western Air Temple and began discussing who would be Aang's firebending teacher. She suggested Jeong Jeong, but Aang retorted this suggestion, saying there was no way of finding him again. When Zuko showed up at the Temple, Katara became enraged and prepared to attack only for Zuko to announce that he had changed and now wanted to teach Aang firebending. Katara was the most opposed to trusting him and attacked him using waterbending when he insisted that he be taken as their prisoner. Katara later confessed to the gang that when she and Zuko were imprisoned in Ba Sing Se, he won her sympathy for him when he lamented the loss of his mother, Ursa; when he betrayed her by joining Azula, she vowed never to trust him again. Toph pointed out to the group that Zuko was being honest in his apologies over his past crimes and that he was the only available person to teach Aang firebending. However, Katara and the others shot her down with their disinterest, causing Toph to storm off."
    },
    {
      "body": "The next day, Toph returned to reveal that Zuko had burned her feet when she tried to talk to him about joining the group. It was an honest accident as he had mistaken her for an attacker, but the fact that he used firebending on her was enough to convince Sokka and the others to hunt Zuko down. While tending to Toph's wounds, Combustion Man attacked, pinning the group down. Katara and Aang's attacks proved useless, however, Zuko bought the gang enough time for Sokka to defeat the assassin with his ${link_0}. Zuko apologized once again to the group for his misdeeds and proved to the gang that he had in fact changed for the better. Aang, Toph and Sokka immediately saw the good in Zuko and accepted him, however, Katara only allowed him to join because of Aang's need to learn firebending. Zuko became clearly nervous when she pondered her choice, knowing full well that she had little reason to trust him. Katara later confronted Zuko in his room in the temple.",
      "links": [
        {
          "body": "boomerang",
          "key": "${link_0}",
          "target": {
            "href": "Sokka%27s_weapons",
            "page": "Sokka%27s_weapons"
          }
        }
      ],
      "text": "The next day, Toph returned to reveal that Zuko had burned her feet when she tried to talk to him about joining the group. It was an honest accident as he had mistaken her for an attacker, but the fact that he used firebending on her was enough to convince Sokka and the others to hunt Zuko down. While tending to Toph's wounds, Combustion Man attacked, pinning the group down. Katara and Aang's attacks proved useless, however, Zuko bought the gang enough time for Sokka to defeat the assassin with his boomerang. Zuko apologized once again to the group for his misdeeds and proved to the gang that he had in fact changed for the better. Aang, Toph and Sokka immediately saw the good in Zuko and accepted him, however, Katara only allowed him to join because of Aang's need to learn firebending. Zuko became clearly nervous when she pondered her choice, knowing full well that she had little reason to trust him. Katara later confronted Zuko in his room in the temple."
    },
    {
      "body": "${link_0} threatened ${link_1} not to hurt ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Katara threatened Zuko not to hurt Aang."
    },
    {
      "body": "In other words, if she detected any act of treachery, she would not hesitate to take his life. She left a very stunned and silent Zuko to ponder on these scathing words.",
      "links": [],
      "text": "In other words, if she detected any act of treachery, she would not hesitate to take his life. She left a very stunned and silent Zuko to ponder on these scathing words."
    },
    {
      "body": "She still expressed hostility toward Zuko, openly mocking his loss of firebending and the irony that if he had lost his skills much earlier, it would have helped them greatly. Her hostility toward Zuko did lessen somewhat; she mocked him after he failed to tell a joke properly, but in a less vindictive way.",
      "links": [],
      "text": "She still expressed hostility toward Zuko, openly mocking his loss of firebending and the irony that if he had lost his skills much earlier, it would have helped them greatly. Her hostility toward Zuko did lessen somewhat; she mocked him after he failed to tell a joke properly, but in a less vindictive way."
    },
    {
      "body": "Later, a fleet of ${link_0} led by Azula assaulted the Western Air Temple. When a bomb struck the ceiling, a number of heavy stones fell to the ground, nearly crushing Katara, until Zuko saved her. This act irritated her, however, and she ungratefully shoved him off her. The group attempted to escape through a tunnel, while Zuko held off Azula and the fleet. When they were unable to get Appa through the tunnel, Sokka suggested they split up. Katara fiercely objected, arguing that the Fire Nation should not be allowed to break up their family again. Hakoda reassured her they would not be apart forever and bid farewell to Katara and Sokka. Katara and the gang escaped on Appa; she even saved Zuko when he fell off Azula's airship.",
      "links": [
        {
          "body": "Fire Nation airships",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        }
      ],
      "text": "Later, a fleet of Fire Nation airships led by Azula assaulted the Western Air Temple. When a bomb struck the ceiling, a number of heavy stones fell to the ground, nearly crushing Katara, until Zuko saved her. This act irritated her, however, and she ungratefully shoved him off her. The group attempted to escape through a tunnel, while Zuko held off Azula and the fleet. When they were unable to get Appa through the tunnel, Sokka suggested they split up. Katara fiercely objected, arguing that the Fire Nation should not be allowed to break up their family again. Hakoda reassured her they would not be apart forever and bid farewell to Katara and Sokka. Katara and the gang escaped on Appa; she even saved Zuko when he fell off Azula's airship."
    },
    {
      "body": "${link_0} yelled at ${link_1} for previously betraying her trust.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Katara yelled at Zuko for previously betraying her trust."
    },
    {
      "body": "Later, the group camped out on an unnamed island and celebrated Zuko's heroism. Katara, however, did not enjoy the celebrations, or Zuko's joke about trying to capture them. When Zuko said he did not deserve their praise, Katara agreed with him and stormed off. Zuko followed her and said that her continued animosity was not fair as everyone else trusted him. She angrily replied that she was the first person to trust him and he betrayed her. When he repentantly asked how he can make up to her, she angrily said:",
      "links": [],
      "text": "Later, the group camped out on an unnamed island and celebrated Zuko's heroism. Katara, however, did not enjoy the celebrations, or Zuko's joke about trying to capture them. When Zuko said he did not deserve their praise, Katara agreed with him and stormed off. Zuko followed her and said that her continued animosity was not fair as everyone else trusted him. She angrily replied that she was the first person to trust him and he betrayed her. When he repentantly asked how he can make up to her, she angrily said:"
    },
    {
      "body": "After a discussion with Sokka, Zuko discovered the ${link_0} were the ones responsible for ${link_1} death. He waited outside Katara's tent until she awakened. When she came out, she irritatedly asked him what he wanted. Katara was surprised when Zuko revealed he had knowledge of who killed her mother and offered to help her track him down.",
      "links": [
        {
          "body": "Southern Raiders",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Raiders",
            "page": "Southern_Raiders"
          }
        },
        {
          "body": "Sokka and Katara's mother's",
          "key": "${link_1}",
          "target": {
            "href": "Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        }
      ],
      "text": "After a discussion with Sokka, Zuko discovered the Southern Raiders were the ones responsible for Sokka and Katara's mother's death. He waited outside Katara's tent until she awakened. When she came out, she irritatedly asked him what he wanted. Katara was surprised when Zuko revealed he had knowledge of who killed her mother and offered to help her track him down."
    },
    {
      "body": "${link_0} offered to help ${link_1} find the ${link_2} who killed ${link_3}, much to the young ${link_4}'s surprise.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "man",
          "key": "${link_2}",
          "target": {
            "href": "Yon_Rha",
            "page": "Yon_Rha"
          }
        },
        {
          "body": "her mother",
          "key": "${link_3}",
          "target": {
            "href": "Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        },
        {
          "body": "waterbender",
          "key": "${link_4}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Zuko offered to help Katara find the man who killed her mother, much to the young waterbender's surprise."
    },
    {
      "body": "A furious Katara took up the offer. When they asked Aang if they could borrow Appa, Aang jokingly asked whether it was Katara's turn to take a field trip with Zuko. When Katara confirmed this, Aang asked as to what was happening. Zuko revealed to him and Sokka that he knew who murdered Katara's mother and that they intended to find him. An argument ensued, with Zuko and Katara claiming that she needed to achieve emotional resolution, while Aang and Sokka both claimed it to be a bad idea as both violence and vengeance were never the answer. The argument ended with Katara angrily storming off. That night, Katara and Zuko sneaked out to take Appa anyway; Aang unfolded their scheme, however, he allowed them to embark on the journey. Before departure, he urged Katara not to kill the man who killed her mother, but to forgive him.",
      "links": [],
      "text": "A furious Katara took up the offer. When they asked Aang if they could borrow Appa, Aang jokingly asked whether it was Katara's turn to take a field trip with Zuko. When Katara confirmed this, Aang asked as to what was happening. Zuko revealed to him and Sokka that he knew who murdered Katara's mother and that they intended to find him. An argument ensued, with Zuko and Katara claiming that she needed to achieve emotional resolution, while Aang and Sokka both claimed it to be a bad idea as both violence and vengeance were never the answer. The argument ended with Katara angrily storming off. That night, Katara and Zuko sneaked out to take Appa anyway; Aang unfolded their scheme, however, he allowed them to embark on the journey. Before departure, he urged Katara not to kill the man who killed her mother, but to forgive him."
    },
    {
      "body": "She and Zuko ventured to a Fire Navy communication tower. After infiltrating the tower, they found the scroll showing the Raiders' whereabouts, at ${link_0}. Katara guided them there in a day's time without rest and told Zuko what she remembered of her mother's death.",
      "links": [
        {
          "body": "Whaletail Island",
          "key": "${link_0}",
          "target": {
            "href": "Whaletail_Island",
            "page": "Whaletail_Island"
          }
        }
      ],
      "text": "She and Zuko ventured to a Fire Navy communication tower. After infiltrating the tower, they found the scroll showing the Raiders' whereabouts, at Whaletail Island. Katara guided them there in a day's time without rest and told Zuko what she remembered of her mother's death."
    },
    {
      "body": "When they arrived at the Southern Raiders' ship, on the night of a full moon, Katara effortlessly took out almost all the ship's crew. The two of them forced their way toward the leader, with Katara blasting a metal door open with waterbending. When the leader fought back and firebent at Zuko, she willingly used bloodbending to subdue him. After looking him in the eyes, however, she realized that he was not the same man who had killed her mother. When Zuko interrogated him, he revealed the man they were searching for is ${link_0}, the former leader of the Southern Raiders who had retired four years prior when Katara was ten years old.",
      "links": [
        {
          "body": "Yon Rha",
          "key": "${link_0}",
          "target": {
            "href": "Yon_Rha",
            "page": "Yon_Rha"
          }
        }
      ],
      "text": "When they arrived at the Southern Raiders' ship, on the night of a full moon, Katara effortlessly took out almost all the ship's crew. The two of them forced their way toward the leader, with Katara blasting a metal door open with waterbending. When the leader fought back and firebent at Zuko, she willingly used bloodbending to subdue him. After looking him in the eyes, however, she realized that he was not the same man who had killed her mother. When Zuko interrogated him, he revealed the man they were searching for is Yon Rha, the former leader of the Southern Raiders who had retired four years prior when Katara was ten years old."
    },
    {
      "body": "${link_0} ultimately forgave ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Katara ultimately forgave Zuko."
    },
    {
      "body": "She and Zuko traced his whereabouts to a Fire Nation ${link_0} and ambushed him. After several harsh demands from Katara, Yon Rha realized she was the Water Tribe girl he had seen six years earlier. He revealed that he had been ordered to find and kill the last waterbender of the Southern Water Tribe and that Katara's mother had claimed it was her. An enraged Katara said her mother had deliberately lied to protect the last Southern waterbender: herself. She promptly created a dome from the rain; she proceeded to transform the water into dozens of ice spikes, which she hurled at the man, intent on finishing him. However, she halted at the last minute. Yon Rha pleaded with her to spare him and even offered his own mother's life in exchange. Katara merely stated she realizes how sad, pathetic and empty he was, going on to reveal that no matter how much she hated him, she could not kill him. She and Zuko left, while Yon Rha cried. When they rejoined the group, Aang said he was proud of her for forgiving Yon Rha. Katara replied that she had not forgiven him; however, she did forgive Zuko and gave him a warm hug, thawing any remaining bitterness.",
      "links": [
        {
          "body": "village",
          "key": "${link_0}",
          "target": {
            "href": "Yon_Rha%27s_village",
            "page": "Yon_Rha%27s_village"
          }
        }
      ],
      "text": "She and Zuko traced his whereabouts to a Fire Nation village and ambushed him. After several harsh demands from Katara, Yon Rha realized she was the Water Tribe girl he had seen six years earlier. He revealed that he had been ordered to find and kill the last waterbender of the Southern Water Tribe and that Katara's mother had claimed it was her. An enraged Katara said her mother had deliberately lied to protect the last Southern waterbender: herself. She promptly created a dome from the rain; she proceeded to transform the water into dozens of ice spikes, which she hurled at the man, intent on finishing him. However, she halted at the last minute. Yon Rha pleaded with her to spare him and even offered his own mother's life in exchange. Katara merely stated she realizes how sad, pathetic and empty he was, going on to reveal that no matter how much she hated him, she could not kill him. She and Zuko left, while Yon Rha cried. When they rejoined the group, Aang said he was proud of her for forgiving Yon Rha. Katara replied that she had not forgiven him; however, she did forgive Zuko and gave him a warm hug, thawing any remaining bitterness."
    },
    {
      "body": "The gang retreated to ${link_0} where Zuko and Aang continued their firebending training. Katara questioned if it was safe to hide from the Fire Lord in his own beach house, a concern Zuko quickly dismissed. Sokka and ${link_1} arrived, suggesting the group went to see ${link_2} about themselves to which the others reluctantly agreed. Like all the others, with the exception of Toph, Katara was displeased with her portrayal. Her character was played by a much older and more developed actress and portrayed as very melodramatic and exaggeratedly preoccupied with hope, often bursting into tears and histrionic speeches for the occasion. In one such scene, when Sokka asked Katara why she stole the ${link_3}, she answered while crying, \"It just gave me so much hope\", much to the dismay of the real Katara. When the play reached the point where Zuko betrayed ${link_4}, Katara asked an upset Zuko if he did in fact state that he \"hates his uncle\". A sullen Zuko replied that he might as well have.",
      "links": [
        {
          "body": "Ozai's old beach house",
          "key": "${link_0}",
          "target": {
            "href": "Ozai%27s_beach_house",
            "page": "Ozai%27s_beach_house"
          }
        },
        {
          "body": "Suki",
          "key": "${link_1}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "a play",
          "key": "${link_2}",
          "target": {
            "href": "The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        },
        {
          "body": "waterbending scroll",
          "key": "${link_3}",
          "target": {
            "href": "Waterbending_scroll",
            "page": "Waterbending_scroll"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_4}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "The gang retreated to Ozai's old beach house where Zuko and Aang continued their firebending training. Katara questioned if it was safe to hide from the Fire Lord in his own beach house, a concern Zuko quickly dismissed. Sokka and Suki arrived, suggesting the group went to see a play about themselves to which the others reluctantly agreed. Like all the others, with the exception of Toph, Katara was displeased with her portrayal. Her character was played by a much older and more developed actress and portrayed as very melodramatic and exaggeratedly preoccupied with hope, often bursting into tears and histrionic speeches for the occasion. In one such scene, when Sokka asked Katara why she stole the waterbending scroll, she answered while crying, \"It just gave me so much hope\", much to the dismay of the real Katara. When the play reached the point where Zuko betrayed Iroh, Katara asked an upset Zuko if he did in fact state that he \"hates his uncle\". A sullen Zuko replied that he might as well have."
    },
    {
      "body": "${link_0} and ${link_1} discussed the state of their relationship during the intermission of \"${link_2}\".",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "The Boy in the Iceberg",
          "key": "${link_2}",
          "target": {
            "href": "The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        }
      ],
      "text": "Katara and Aang discussed the state of their relationship during the intermission of \"The Boy in the Iceberg\"."
    },
    {
      "body": "The play continued and portrayed the scene involving Katara and Zuko's time spent imprisoned in the ${link_0} of Ba Sing Se, with Actress Katara hitting on Actor Zuko, making their real life counterparts slightly uncomfortable. When Actor Zuko claimed her to be the Avatar's girl, Actress Katara assured him the Avatar was merely a brotherly figure and one she did not love romantically; the two proceeded to embrace. Aang became enraged and stormed off. During intermission, Katara found Aang sulking outside; Aang stated his true feelings for her only for Katara to confess her current confusion. She admitted that she was not seeking to be in a relationship at the moment. When Aang suddenly kissed her, she became upset, noting her confusion and went inside, leaving Aang heartbroken.",
      "links": [
        {
          "body": "Crystal Catacombs",
          "key": "${link_0}",
          "target": {
            "href": "Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        }
      ],
      "text": "The play continued and portrayed the scene involving Katara and Zuko's time spent imprisoned in the Crystal Catacombs of Ba Sing Se, with Actress Katara hitting on Actor Zuko, making their real life counterparts slightly uncomfortable. When Actor Zuko claimed her to be the Avatar's girl, Actress Katara assured him the Avatar was merely a brotherly figure and one she did not love romantically; the two proceeded to embrace. Aang became enraged and stormed off. During intermission, Katara found Aang sulking outside; Aang stated his true feelings for her only for Katara to confess her current confusion. She admitted that she was not seeking to be in a relationship at the moment. When Aang suddenly kissed her, she became upset, noting her confusion and went inside, leaving Aang heartbroken."
    },
    {
      "body": "Like the rest of the group, Katara was displeased with the ending to the play with the Fire Nation emerging victorious in the War.",
      "links": [],
      "text": "Like the rest of the group, Katara was displeased with the ending to the play with the Fire Nation emerging victorious in the War."
    },
    {
      "body": "When Zuko berated the others for having beach parties when the comet was three days away, Katara stated the Fire Nation had, in essence, won the ${link_0} when they conquered Ba Sing Se. She revealed the team's plan to wait until after ${link_1} to battle the Fire Lord. Dismayed, Zuko revealed Ozai's plan to burn the ${link_2} down with enhanced firebending and warned Aang that he needed to defeat the Fire Lord before the comet arrived if he still wanted there to be a world to save. The following day, the group discovered that Aang and Momo were missing and searched the entire island. Their mission turned up unsuccessful, so they turned to Zuko, who had experience in tracking Aang down. The group flew to the Earth Kingdom, where Zuko asked ${link_3} to track Aang down using the scent of his ${link_4}. When ${link_5} was unable to do so, he instead asked that she found Iroh, offering one of his smelly sandals for guidance. June tracked him down to Ba Sing Se and left. During the evening, the group was approached by members of the ${link_6}, namely ${link_7}, who revealed himself to be Katara and Sokka's step-grandfather, having married ${link_8}. Alongside him were other White Lotus masters the group had met before: ${link_9}, Jeong Jeong, and Piandao. They took them to the ${link_10}, where they met Iroh. It was later decided that Katara would return to the Fire Nation to help Zuko usurp the throne from Azula when Ozai was defeated.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_1}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "June",
          "key": "${link_3}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "glider",
          "key": "${link_4}",
          "target": {
            "href": "Airbender_staff",
            "page": "Airbender_staff"
          }
        },
        {
          "body": "her shirshu",
          "key": "${link_5}",
          "target": {
            "href": "Nyla",
            "page": "Nyla"
          }
        },
        {
          "body": "Order of the White Lotus",
          "key": "${link_6}",
          "target": {
            "href": "Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        },
        {
          "body": "Pakku",
          "key": "${link_7}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "Kanna",
          "key": "${link_8}",
          "target": {
            "href": "Kanna",
            "page": "Kanna"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_9}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "Order's campsite",
          "key": "${link_10}",
          "target": {
            "href": "White_Lotus_camp",
            "page": "White_Lotus_camp"
          }
        }
      ],
      "text": "When Zuko berated the others for having beach parties when the comet was three days away, Katara stated the Fire Nation had, in essence, won the Hundred Year War when they conquered Ba Sing Se. She revealed the team's plan to wait until after Sozin's Comet to battle the Fire Lord. Dismayed, Zuko revealed Ozai's plan to burn the Earth Kingdom down with enhanced firebending and warned Aang that he needed to defeat the Fire Lord before the comet arrived if he still wanted there to be a world to save. The following day, the group discovered that Aang and Momo were missing and searched the entire island. Their mission turned up unsuccessful, so they turned to Zuko, who had experience in tracking Aang down. The group flew to the Earth Kingdom, where Zuko asked June to track Aang down using the scent of his glider. When her shirshu was unable to do so, he instead asked that she found Iroh, offering one of his smelly sandals for guidance. June tracked him down to Ba Sing Se and left. During the evening, the group was approached by members of the Order of the White Lotus, namely Pakku, who revealed himself to be Katara and Sokka's step-grandfather, having married Kanna. Alongside him were other White Lotus masters the group had met before: Bumi, Jeong Jeong, and Piandao. They took them to the Order's campsite, where they met Iroh. It was later decided that Katara would return to the Fire Nation to help Zuko usurp the throne from Azula when Ozai was defeated."
    },
    {
      "body": "${link_0} imprisoned ${link_1} in ice.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Katara imprisoned Azula in ice."
    },
    {
      "body": "The two left on Appa and headed toward the Fire Nation. On the way there, Katara tried to reassure Zuko's worries of Aang not being able to defeat the Fire Lord, despite being concerned herself. They arrived at the ${link_0} during Azula's coronation where the princess challenged Zuko to an ${link_1} to which he accepted. While Katara watched the battle from the sidelines, Zuko dueled Azula, eventually gaining the upper hand. When he mockingly asked Azula whether her refusal to ${link_2} is due to a fear of him ${link_3} the bolt, she took the bait and generated lightning. Instead of targeting Zuko, she aimed and fired the attack at Katara. Zuko barely blocked the lightning, saving Katara's life, but took the blast to his chest, injuring him badly. Katara tried ${link_4} her friend, but was thwarted in her attempts by Azula. Katara proceeded to fight Azula who attempted to drive her away from any source of water. She eventually managed to trick Azula into walking directly over a grate of water. Freezing her in a mass of ice, Katara was able to chain the princess to the grate before rushing to Zuko and healing him. Zuko thanked her, to which Katara stated it was she who should express gratitude toward him. She was present at Zuko's coronation, after the team's successful victory in the century-long war.",
      "links": [
        {
          "body": "Fire Nation Capital",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_1}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        },
        {
          "body": "generate lightning",
          "key": "${link_2}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "redirecting",
          "key": "${link_3}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        },
        {
          "body": "to heal",
          "key": "${link_4}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "The two left on Appa and headed toward the Fire Nation. On the way there, Katara tried to reassure Zuko's worries of Aang not being able to defeat the Fire Lord, despite being concerned herself. They arrived at the Fire Nation Capital during Azula's coronation where the princess challenged Zuko to an Agni Kai to which he accepted. While Katara watched the battle from the sidelines, Zuko dueled Azula, eventually gaining the upper hand. When he mockingly asked Azula whether her refusal to generate lightning is due to a fear of him redirecting the bolt, she took the bait and generated lightning. Instead of targeting Zuko, she aimed and fired the attack at Katara. Zuko barely blocked the lightning, saving Katara's life, but took the blast to his chest, injuring him badly. Katara tried to heal her friend, but was thwarted in her attempts by Azula. Katara proceeded to fight Azula who attempted to drive her away from any source of water. She eventually managed to trick Azula into walking directly over a grate of water. Freezing her in a mass of ice, Katara was able to chain the princess to the grate before rushing to Zuko and healing him. Zuko thanked her, to which Katara stated it was she who should express gratitude toward him. She was present at Zuko's coronation, after the team's successful victory in the century-long war."
    },
    {
      "body": "${link_0} and ${link_1} began their relationship.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Katara and Aang began their relationship."
    },
    {
      "body": "When she was later at the ${link_0}, along with the other members of Team Avatar, she followed Aang outside after he had left for some fresh air, going on to hug him. She and Aang subsequently looked at each other lovingly before she instigated a romantic kiss.",
      "links": [
        {
          "body": "Jasmine Dragon",
          "key": "${link_0}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "text": "When she was later at the Jasmine Dragon, along with the other members of Team Avatar, she followed Aang outside after he had left for some fresh air, going on to hug him. She and Aang subsequently looked at each other lovingly before she instigated a romantic kiss."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Katara_(Summer_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Katara_(Summer_100_AG).html",
    "page": "History_of_Katara_(Summer_100_AG)",
    "title": "History of Katara (Summer 100 AG)"
  }
}