{
  "categories": [
    {
      "body": "Sokka",
      "target": {
        "href": "Category_Sokka",
        "page": "Category_Sokka"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0}, born and raised as a ${link_1} in the ${link_2}, was on a fishing trip with his younger sister ${link_3} when they discovered ${link_4} ${link_5} frozen in an iceberg. After learning that he was the Avatar, the three formed a group and traveled to the ${link_6} where Aang and Katara could learn ${link_7}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "warrior",
          "key": "${link_1}",
          "target": {
            "href": "Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_4}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_5}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "North Pole",
          "key": "${link_6}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_7}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Sokka, born and raised as a warrior in the Southern Water Tribe, was on a fishing trip with his younger sister Katara when they discovered Avatar Aang frozen in an iceberg. After learning that he was the Avatar, the three formed a group and traveled to the North Pole where Aang and Katara could learn waterbending."
    },
    {
      "body": "${link_0} attempting to defend ${link_1} during the ${link_2}' ${link_3}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "his tribe",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Southern Raiders",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Raiders",
            "page": "Southern_Raiders"
          }
        },
        {
          "body": "attack",
          "key": "${link_3}",
          "target": {
            "href": "Southern_Water_Tribe_raids#Final_raid",
            "page": "Southern_Water_Tribe_raids"
          }
        }
      ],
      "text": "Sokka attempting to defend his tribe during the Southern Raiders' attack."
    },
    {
      "body": "Sokka was born in the Southern Water Tribe to ${link_0} ${link_1} and his wife, ${link_2}. He was raised from a young age to be a warrior, and possessed much knowledge of Water Tribe ${link_3} and tactics. When he was young, his mother was killed in a ${link_4}, when the Raiders' leader, ${link_5} was charged by ${link_6} ${link_7} to find and dispose of the last remaining waterbender in the tribe. Yon Rha interrogated Kya to find the last bender's location, but she tricked him into believing that she herself was the last bender to protect the real waterbender, her daughter, ${link_8}. The firebender executed Kya on the spot. Several years before finding Avatar Aang, his father along with all the other warriors left the Water Tribe to fight in the ${link_9}, and Sokka was left in the care of his ${link_10} and little sister, Katara, though he also devoted some time to constructing crude defenses for what remained of his tribe. Sokka took the defense of the tribe very seriously, as his father had entrusted him with protecting the tribe.",
      "links": [
        {
          "body": "Chief",
          "key": "${link_0}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Hakoda",
          "key": "${link_1}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Kya",
          "key": "${link_2}",
          "target": {
            "href": "Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        },
        {
          "body": "weapons",
          "key": "${link_3}",
          "target": {
            "href": "Weaponry_in_the_World_of_Avatar#Water_Tribes",
            "page": "Weaponry_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Fire Nation raid",
          "key": "${link_4}",
          "target": {
            "href": "Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        },
        {
          "body": "Yon Rha",
          "key": "${link_5}",
          "target": {
            "href": "Yon_Rha",
            "page": "Yon_Rha"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_6}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Azulon",
          "key": "${link_7}",
          "target": {
            "href": "Azulon",
            "page": "Azulon"
          }
        },
        {
          "body": "Katara",
          "key": "${link_8}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_9}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "grandmother",
          "key": "${link_10}",
          "target": {
            "href": "Kanna",
            "page": "Kanna"
          }
        }
      ],
      "text": "Sokka was born in the Southern Water Tribe to Chief Hakoda and his wife, Kya. He was raised from a young age to be a warrior, and possessed much knowledge of Water Tribe weapons and tactics. When he was young, his mother was killed in a Fire Nation raid, when the Raiders' leader, Yon Rha was charged by Fire Lord Azulon to find and dispose of the last remaining waterbender in the tribe. Yon Rha interrogated Kya to find the last bender's location, but she tricked him into believing that she herself was the last bender to protect the real waterbender, her daughter, Katara. The firebender executed Kya on the spot. Several years before finding Avatar Aang, his father along with all the other warriors left the Water Tribe to fight in the Hundred Year War, and Sokka was left in the care of his grandmother and little sister, Katara, though he also devoted some time to constructing crude defenses for what remained of his tribe. Sokka took the defense of the tribe very seriously, as his father had entrusted him with protecting the tribe."
    },
    {
      "body": "${link_0} meeting ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Sokka meeting Aang."
    },
    {
      "body": "While on a fishing expedition for their village, Sokka and Katara accidentally steered their canoe into a rip current, where it was crushed between ice floes. Sokka blamed Katara for their predicament, and she began to yell angrily about his inconsiderate behavior, gesturing emphatically as she did so. However, she did not realize that she was involuntarily waterbending, causing cracks in a massive iceberg directly behind her. The iceberg cracked, and a large, spherical underwater portion bobbed to the surface, revealing Aang, along with his ${link_0}, ${link_1}, trapped in a state of suspended animation. Katara grabbed ${link_2} and shattered the iceberg to free them. As she did so, a vertical column of bright blue light shot up from their position into the sky like a beacon. The boy climbed out of the ice and collapsed into Katara's arms. Once he regained consciousness, he introduced himself as Aang, an ${link_3}. Sokka reacted skeptically, suspecting that Aang could be a member of the ${link_4}, using the light to signify their location to them. Sokka and Appa got off on the wrong start because the flying bison sneezed on him. Eventually, he accepted Aang's offer to escort them home on Appa, as they had no other way of returning, since their canoe was crushed in the riptide. At their diminutive village, Sokka grew increasingly irritated at Aang's childish antics, angrily stating that there was no time for play with the Hundred Year War raging on.",
      "links": [
        {
          "body": "flying bison",
          "key": "${link_0}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Sokka's club",
          "key": "${link_2}",
          "target": {
            "href": "Sokka%27s_weapons#club",
            "page": "Sokka%27s_weapons"
          }
        },
        {
          "body": "airbender",
          "key": "${link_3}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_4}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "While on a fishing expedition for their village, Sokka and Katara accidentally steered their canoe into a rip current, where it was crushed between ice floes. Sokka blamed Katara for their predicament, and she began to yell angrily about his inconsiderate behavior, gesturing emphatically as she did so. However, she did not realize that she was involuntarily waterbending, causing cracks in a massive iceberg directly behind her. The iceberg cracked, and a large, spherical underwater portion bobbed to the surface, revealing Aang, along with his flying bison, Appa, trapped in a state of suspended animation. Katara grabbed Sokka's club and shattered the iceberg to free them. As she did so, a vertical column of bright blue light shot up from their position into the sky like a beacon. The boy climbed out of the ice and collapsed into Katara's arms. Once he regained consciousness, he introduced himself as Aang, an airbender. Sokka reacted skeptically, suspecting that Aang could be a member of the Fire Nation, using the light to signify their location to them. Sokka and Appa got off on the wrong start because the flying bison sneezed on him. Eventually, he accepted Aang's offer to escort them home on Appa, as they had no other way of returning, since their canoe was crushed in the riptide. At their diminutive village, Sokka grew increasingly irritated at Aang's childish antics, angrily stating that there was no time for play with the Hundred Year War raging on."
    },
    {
      "body": "${link_0} in warrior paint.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Sokka in warrior paint."
    },
    {
      "body": "After Aang accidentally activated a tripwire that released a flare on an abandoned ${link_0}, Sokka became enraged and banished him from the tribe. He accused Aang of collaborating with the Fire Nation, releasing the flare to lead the enemy straight to the village. When their village was indeed attacked by a ${link_1}, led by ${link_2} ${link_3}, Sokka and Katara learned that Aang was indeed the Avatar. The siblings tracked down ${link_4} by use of Appa, and were able to rescue Aang from it. Katara mused that they might find a waterbending teacher at the North Pole, and Aang quickly brightened up, suggesting they learn waterbending together, along with Sokka, who decided to come along under the excuse of this being an opportunity to knock the heads of some ${link_5}, they decided to journey together to the North Pole.",
      "links": [
        {
          "body": "shipwreck",
          "key": "${link_0}",
          "target": {
            "href": "Shipwreck",
            "page": "Shipwreck"
          }
        },
        {
          "body": "Fire Nation ship",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_cruiser",
            "page": "Fire_Nation_cruiser"
          }
        },
        {
          "body": "Prince",
          "key": "${link_2}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_3}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Zuko's ship",
          "key": "${link_4}",
          "target": {
            "href": "Zuko%27s_ship",
            "page": "Zuko%27s_ship"
          }
        },
        {
          "body": "firebenders",
          "key": "${link_5}",
          "target": {
            "href": "Firebending#Notable_firebenders",
            "page": "Firebending"
          }
        }
      ],
      "text": "After Aang accidentally activated a tripwire that released a flare on an abandoned shipwreck, Sokka became enraged and banished him from the tribe. He accused Aang of collaborating with the Fire Nation, releasing the flare to lead the enemy straight to the village. When their village was indeed attacked by a Fire Nation ship, led by Prince Zuko, Sokka and Katara learned that Aang was indeed the Avatar. The siblings tracked down Zuko's ship by use of Appa, and were able to rescue Aang from it. Katara mused that they might find a waterbending teacher at the North Pole, and Aang quickly brightened up, suggesting they learn waterbending together, along with Sokka, who decided to come along under the excuse of this being an opportunity to knock the heads of some firebenders, they decided to journey together to the North Pole."
    },
    {
      "body": "The three friends soon journeyed to Aang's childhood home at the ${link_0}. Sokka was left very hungry, especially after Aang had used his blubbered seal jerky to light a campfire. Aang showed them around the temple, and even engaged Sokka in a game of ${link_1}, which Sokka lost. However, Sokka was primarily concerned with hiding evidence of the ${link_2} from Aang, stating to Katara that she could not protect him forever when she concealed some evidence with a heap of snow.",
      "links": [
        {
          "body": "Southern Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        },
        {
          "body": "airball",
          "key": "${link_1}",
          "target": {
            "href": "Airball",
            "page": "Airball"
          }
        },
        {
          "body": "Air Nomad Genocide",
          "key": "${link_2}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        }
      ],
      "text": "The three friends soon journeyed to Aang's childhood home at the Southern Air Temple. Sokka was left very hungry, especially after Aang had used his blubbered seal jerky to light a campfire. Aang showed them around the temple, and even engaged Sokka in a game of airball, which Sokka lost. However, Sokka was primarily concerned with hiding evidence of the Air Nomad Genocide from Aang, stating to Katara that she could not protect him forever when she concealed some evidence with a heap of snow."
    },
    {
      "body": "Aang later led them to a room that contained statues of past Avatars, to which Sokka was disappointed that still no food was around. They soon saw what they thought to be the shadow of an approaching ${link_0}, but it turned out to be a ${link_1}. Sokka chased after it against Aang, as the former saw nothing but an opportunity for food. The chase eventually led Sokka to later discover that Aang found the skeleton of his close friend and mentor, Monk ${link_2}. Sokka tried to comfort Aang, but instead, the Avatar's sadness caused him to enter the ${link_3}.",
      "links": [
        {
          "body": "firebender",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "winged lemur",
          "key": "${link_1}",
          "target": {
            "href": "Winged_lemur",
            "page": "Winged_lemur"
          }
        },
        {
          "body": "Gyatso",
          "key": "${link_2}",
          "target": {
            "href": "Gyatso",
            "page": "Gyatso"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_3}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "Aang later led them to a room that contained statues of past Avatars, to which Sokka was disappointed that still no food was around. They soon saw what they thought to be the shadow of an approaching firebender, but it turned out to be a winged lemur. Sokka chased after it against Aang, as the former saw nothing but an opportunity for food. The chase eventually led Sokka to later discover that Aang found the skeleton of his close friend and mentor, Monk Gyatso. Sokka tried to comfort Aang, but instead, the Avatar's sadness caused him to enter the Avatar State."
    },
    {
      "body": "Eventually, after Katara calmed Aang out of his rage, Sokka joined her in promising the young airbender that they were his family now, and would not let anything happen to him.",
      "links": [],
      "text": "Eventually, after Katara calmed Aang out of his rage, Sokka joined her in promising the young airbender that they were his family now, and would not let anything happen to him."
    },
    {
      "body": "Sokka, Katara, and Aang were flying on Appa with Sokka indicating Aang's lack of navigational skills. Aang landed on a small ${link_0} island, where he stated that it was the best place to ride ${link_1}, but Sokka and Katara informed him that they had taken too many detours recently, which they could not afford if they wanted to reach the North Pole. Suddenly, the group was ambushed by a mysterious group of warriors, who were, as Sokka later remarked, \"a bunch of girls\". The gang was subsequently tied to a pole, and after having removed the cloth covering Aang, Katara and Sokka's eyes, Sokka uttered a remark about how they could not have been beaten by a bunch of girls. Aang stated that he was the Avatar, and was able to get his friends out of trouble. The group learned that they were now on ${link_2}, an island made by Avatar ${link_3}. Aang and Katara enjoyed a delicious meal of desserts and treats, charitably given from the town while Sokka lay on the floor, angry because he was bested by females. Sokka went to the ${link_4} and he was asked if he wanted to show off some of his 'moves'. He tried to demonstrate his techniques, but was brought down by the lead warrior, ${link_5}. He simply stated that he was going easy on her and ultimately failed again, being tied arm to leg and swung to the ground. He subsequently left out of embarrassment.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "elephant koi",
          "key": "${link_1}",
          "target": {
            "href": "Elephant_koi",
            "page": "Elephant_koi"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_2}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_3}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_4}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Suki",
          "key": "${link_5}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        }
      ],
      "text": "Sokka, Katara, and Aang were flying on Appa with Sokka indicating Aang's lack of navigational skills. Aang landed on a small Earth Kingdom island, where he stated that it was the best place to ride elephant koi, but Sokka and Katara informed him that they had taken too many detours recently, which they could not afford if they wanted to reach the North Pole. Suddenly, the group was ambushed by a mysterious group of warriors, who were, as Sokka later remarked, \"a bunch of girls\". The gang was subsequently tied to a pole, and after having removed the cloth covering Aang, Katara and Sokka's eyes, Sokka uttered a remark about how they could not have been beaten by a bunch of girls. Aang stated that he was the Avatar, and was able to get his friends out of trouble. The group learned that they were now on Kyoshi Island, an island made by Avatar Kyoshi. Aang and Katara enjoyed a delicious meal of desserts and treats, charitably given from the town while Sokka lay on the floor, angry because he was bested by females. Sokka went to the Kyoshi Warriors and he was asked if he wanted to show off some of his 'moves'. He tried to demonstrate his techniques, but was brought down by the lead warrior, Suki. He simply stated that he was going easy on her and ultimately failed again, being tied arm to leg and swung to the ground. He subsequently left out of embarrassment."
    },
    {
      "body": "Sokka returned to the training area and bowed before Suki, admitting he would be honored to be trained by her. She made sure he would not care to be trained by a girl, and he accepted that he said some inappropriate things before. She agreed if he underwent all of their traditions. After donning the Kyoshi Warrior outfit, he complained about being in a dress, but Suki called it \"a symbol of honor and bravery.\" Aang promptly walked by, giggling, and complimented Sokka on his \"dress\". Suki began training Sokka in the art of Kyoshi style fighting. After a little while of training, Sokka believed he was starting to understand the form but inevitably chucks his weapon out the door. Suki laughed, saying it was not about strength, but about using your opponent's force against them and to wait until the right moment to strike. Sokka promptly knocked down Suki, who was quite embarrassed. She claimed that she let him knock her over on purpose, but admitted she was knocked down and asked him to try it again.",
      "links": [],
      "text": "Sokka returned to the training area and bowed before Suki, admitting he would be honored to be trained by her. She made sure he would not care to be trained by a girl, and he accepted that he said some inappropriate things before. She agreed if he underwent all of their traditions. After donning the Kyoshi Warrior outfit, he complained about being in a dress, but Suki called it \"a symbol of honor and bravery.\" Aang promptly walked by, giggling, and complimented Sokka on his \"dress\". Suki began training Sokka in the art of Kyoshi style fighting. After a little while of training, Sokka believed he was starting to understand the form but inevitably chucks his weapon out the door. Suki laughed, saying it was not about strength, but about using your opponent's force against them and to wait until the right moment to strike. Sokka promptly knocked down Suki, who was quite embarrassed. She claimed that she let him knock her over on purpose, but admitted she was knocked down and asked him to try it again."
    },
    {
      "body": "${link_0} kissing ${link_1}'s cheek just before his departure.",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Suki kissing Sokka's cheek just before his departure."
    },
    {
      "body": "After the town was attacked by Prince Zuko and his forces, Aang decided that if they left, so would the prince. Suki and Sokka teamed up and tried their best to fend off Prince Zuko and his men. Suki urged Sokka to hurry and leave, but he said he would not leave her, at least not without an apology. She asked why and he explained that he treated her like a girl instead of a warrior. Suki kissed Sokka on the cheek, telling him that she was a warrior but a girl, too. Aang, Katara, and Sokka left as the town was being set on fire, and Zuko and his followers pursued Aang again. Feeling guilty for abandoning the village that was being destroyed, Aang leapt off Appa and forced the ${link_0} in the bay to spew water onto the fires, extinguishing them.",
      "links": [
        {
          "body": "unagi",
          "key": "${link_0}",
          "target": {
            "href": "Unagi",
            "page": "Unagi"
          }
        }
      ],
      "text": "After the town was attacked by Prince Zuko and his forces, Aang decided that if they left, so would the prince. Suki and Sokka teamed up and tried their best to fend off Prince Zuko and his men. Suki urged Sokka to hurry and leave, but he said he would not leave her, at least not without an apology. She asked why and he explained that he treated her like a girl instead of a warrior. Suki kissed Sokka on the cheek, telling him that she was a warrior but a girl, too. Aang, Katara, and Sokka left as the town was being set on fire, and Zuko and his followers pursued Aang again. Feeling guilty for abandoning the village that was being destroyed, Aang leapt off Appa and forced the unagi in the bay to spew water onto the fires, extinguishing them."
    },
    {
      "body": "After leaving Kyoshi Island, Aang flew the two Water Tribe siblings to the great Earth Kingdom metropolis of ${link_0}, a grand city and stronghold boasting a superb ${link_1}. Entering the city under individual aliases, the Avatar and his friends decided to take a joy ride through the city on one of the mail carts. The ride resulted in considerable damage to various homes and shops throughout Omashu and the trio's arrest. They were brought before the elderly ${link_2} of the city who, much to their surprise, treated them as royalty and threw a feast.",
      "links": [
        {
          "body": "Omashu",
          "key": "${link_0}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "mailing system",
          "key": "${link_1}",
          "target": {
            "href": "Omashu_delivery_system",
            "page": "Omashu_delivery_system"
          }
        },
        {
          "body": "king",
          "key": "${link_2}",
          "target": {
            "href": "King_of_Omashu",
            "page": "King_of_Omashu"
          }
        }
      ],
      "text": "After leaving Kyoshi Island, Aang flew the two Water Tribe siblings to the great Earth Kingdom metropolis of Omashu, a grand city and stronghold boasting a superb mailing system. Entering the city under individual aliases, the Avatar and his friends decided to take a joy ride through the city on one of the mail carts. The ride resulted in considerable damage to various homes and shops throughout Omashu and the trio's arrest. They were brought before the elderly king of the city who, much to their surprise, treated them as royalty and threw a feast."
    },
    {
      "body": "${link_0} and ${link_1} being encased in ${link_2} to blackmail ${link_3}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "jennamite",
          "key": "${link_2}",
          "target": {
            "href": "Jennamite",
            "page": "Jennamite"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Sokka and Katara being encased in jennamite to blackmail Aang."
    },
    {
      "body": "When Aang unintentionally revealed himself to be the Avatar, the king ordered the three to be confined within a newly refurbished prison chamber, and challenged Aang with three deadly tasks. To add to the pressure, the king had pure ${link_0} rings placed over both Katara and Sokka's fingers. The jennamite rings proved impossible to remove and slowly grew to encase their entire bodies. Aang was able to successfully complete all three challenges as well as an additional assignment, which was to identify the king, whom he learned was his old friend, ${link_1}, from before the War. Sokka and Katara were thus saved and the trio eventually left the city to continue on their travels.",
      "links": [
        {
          "body": "jennamite",
          "key": "${link_0}",
          "target": {
            "href": "Jennamite",
            "page": "Jennamite"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        }
      ],
      "text": "When Aang unintentionally revealed himself to be the Avatar, the king ordered the three to be confined within a newly refurbished prison chamber, and challenged Aang with three deadly tasks. To add to the pressure, the king had pure jennamite rings placed over both Katara and Sokka's fingers. The jennamite rings proved impossible to remove and slowly grew to encase their entire bodies. Aang was able to successfully complete all three challenges as well as an additional assignment, which was to identify the king, whom he learned was his old friend, Bumi, from before the War. Sokka and Katara were thus saved and the trio eventually left the city to continue on their travels."
    },
    {
      "body": "Sometime later, while Team Avatar was setting up camp and seeking dinner options, they were startled by loud noises in the distance. Sokka and the others ventured to a ${link_0} after a strange encounter with a mysterious young ${link_1}. The young earthbender turned out to be a sixteen-year-old boy named ${link_2}, who lived with his ${link_3}, after ${link_4} had been captured, in the village that had been occupied by the Fire Nation for five years. The town strictly forbade the practicing of the art of earthbending. After Haru earthbent out of desperation to save an old man caught in a mine, he was arrested by the Fire Nation.",
      "links": [
        {
          "body": "mining village",
          "key": "${link_0}",
          "target": {
            "href": "Mining_village",
            "page": "Mining_village"
          }
        },
        {
          "body": "earthbender",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Haru",
          "key": "${link_2}",
          "target": {
            "href": "Haru",
            "page": "Haru"
          }
        },
        {
          "body": "mother",
          "key": "${link_3}",
          "target": {
            "href": "Haru%27s_mother",
            "page": "Haru%27s_mother"
          }
        },
        {
          "body": "his father",
          "key": "${link_4}",
          "target": {
            "href": "Tyro",
            "page": "Tyro"
          }
        }
      ],
      "text": "Sometime later, while Team Avatar was setting up camp and seeking dinner options, they were startled by loud noises in the distance. Sokka and the others ventured to a mining village after a strange encounter with a mysterious young earthbender. The young earthbender turned out to be a sixteen-year-old boy named Haru, who lived with his mother, after his father had been captured, in the village that had been occupied by the Fire Nation for five years. The town strictly forbade the practicing of the art of earthbending. After Haru earthbent out of desperation to save an old man caught in a mine, he was arrested by the Fire Nation."
    },
    {
      "body": "Katara orchestrated a fake argument with her brother in which she feigned being able to earthbend, with Aang's help, which consequently got her arrested by the Fire Nation and sent to the prison rig where Haru was. Katara, upon seeing the broken souls of the imprisoned earthbenders, became determined to break them free. Despite Sokka's protests against the dangers of organizing a rebellion of the prisoners, the group eventually devised a plan to channel coal being burnt as fuel up to the surface where the prisoners were. After an intense fight, the Fire Nation forces were defeated and the prisoners were liberated.",
      "links": [],
      "text": "Katara orchestrated a fake argument with her brother in which she feigned being able to earthbend, with Aang's help, which consequently got her arrested by the Fire Nation and sent to the prison rig where Haru was. Katara, upon seeing the broken souls of the imprisoned earthbenders, became determined to break them free. Despite Sokka's protests against the dangers of organizing a rebellion of the prisoners, the group eventually devised a plan to channel coal being burnt as fuel up to the surface where the prisoners were. After an intense fight, the Fire Nation forces were defeated and the prisoners were liberated."
    },
    {
      "body": "The team later made their way to ${link_0} after an ${link_1} found them in a charred forest. It was revealed that a black and white spirit named ${link_2} was terrorizing it, and that Aang needed to end the attacks. While it was on a rampage, Sokka tried to assist Aang, but was kidnapped by the Hei Bai and found himself trapped in the ${link_3} for twenty-four hours. Aang was ultimately able to halt the spirit's rampage, thus freeing him and the other kidnapped villagers.",
      "links": [
        {
          "body": "Senlin Village",
          "key": "${link_0}",
          "target": {
            "href": "Senlin_Village",
            "page": "Senlin_Village"
          }
        },
        {
          "body": "old wanderer",
          "key": "${link_1}",
          "target": {
            "href": "Old_wanderer",
            "page": "Old_wanderer"
          }
        },
        {
          "body": "Hei Bai",
          "key": "${link_2}",
          "target": {
            "href": "Hei_Bai",
            "page": "Hei_Bai"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "The team later made their way to Senlin Village after an old wanderer found them in a charred forest. It was revealed that a black and white spirit named Hei Bai was terrorizing it, and that Aang needed to end the attacks. While it was on a rampage, Sokka tried to assist Aang, but was kidnapped by the Hei Bai and found himself trapped in the Spirit World for twenty-four hours. Aang was ultimately able to halt the spirit's rampage, thus freeing him and the other kidnapped villagers."
    },
    {
      "body": "Sokka and Katara later accompanied Aang to the ${link_0} in the ${link_1}, so Aang could speak to Roku during the ${link_2}. They bravely fought their way past ${link_3}'s fleet, with the ${link_4} intent on capturing the Avatar.",
      "links": [
        {
          "body": "Fire Temple",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Temple",
            "page": "Fire_Temple"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "winter solstice",
          "key": "${link_2}",
          "target": {
            "href": "Winter_solstice",
            "page": "Winter_solstice"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_3}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "commander",
          "key": "${link_4}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#Commander",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Sokka and Katara later accompanied Aang to the Fire Temple in the Fire Nation, so Aang could speak to Roku during the winter solstice. They bravely fought their way past Zhao's fleet, with the commander intent on capturing the Avatar."
    },
    {
      "body": "${link_0} attempting to get the ${link_1} sanctuary door open with bombs.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Fire Temple",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Temple",
            "page": "Fire_Temple"
          }
        }
      ],
      "text": "Team Avatar attempting to get the Fire Temple sanctuary door open with bombs."
    },
    {
      "body": "They entered the temple and found that the ${link_0} were trying to capture them. After a chase, they discovered ${link_1}, a sage who was still loyal to their original purpose of protecting the Avatar. The team followed Shyu to the chamber where Aang could speak with Avatar ${link_2}.",
      "links": [
        {
          "body": "Fire Sages",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Shyu",
          "key": "${link_1}",
          "target": {
            "href": "Shyu",
            "page": "Shyu"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        }
      ],
      "text": "They entered the temple and found that the Fire Sages were trying to capture them. After a chase, they discovered Shyu, a sage who was still loyal to their original purpose of protecting the Avatar. The team followed Shyu to the chamber where Aang could speak with Avatar Roku."
    },
    {
      "body": "When they were able to reach the chamber, however, the found that the door could only be opened by firebending. Sokka used five of his bombs to imitate the art, though the door did not open. However, one of his statements gave Katara the idea to send Momo, who could get inside the door, inside and lead the Fire Sages to open the door themselves. When the door was finally opened, Aang could not enter it, as he was captured by Zuko. The Fire Sage he was holding took advantage of this distraction and now held the Avatar's friends down. Aang managed to escape from Zuko's grasp, and was able to speak with Avatar Roku, who warned him of an impending ${link_0} that would grant the firebenders unbelievable power, and would allow them to win the War. When his discussion with the previous Avatar ended, Roku helped him by taking over his successor's body, and defeating the Fire Sages and Zhao, and also melting the chains which bound the Water Tribe siblings and Shyu. They helped Aang to get up when Roku's influence ended, and they escaped on Appa.",
      "links": [
        {
          "body": "comet",
          "key": "${link_0}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "text": "When they were able to reach the chamber, however, the found that the door could only be opened by firebending. Sokka used five of his bombs to imitate the art, though the door did not open. However, one of his statements gave Katara the idea to send Momo, who could get inside the door, inside and lead the Fire Sages to open the door themselves. When the door was finally opened, Aang could not enter it, as he was captured by Zuko. The Fire Sage he was holding took advantage of this distraction and now held the Avatar's friends down. Aang managed to escape from Zuko's grasp, and was able to speak with Avatar Roku, who warned him of an impending comet that would grant the firebenders unbelievable power, and would allow them to win the War. When his discussion with the previous Avatar ended, Roku helped him by taking over his successor's body, and defeating the Fire Sages and Zhao, and also melting the chains which bound the Water Tribe siblings and Shyu. They helped Aang to get up when Roku's influence ended, and they escaped on Appa."
    },
    {
      "body": "After this encounter, the team settled down at the ${link_0}, where Katara tried to teach Aang in basic waterbending while Sokka cleaned out Appa's toes. A large wave crafted by Aang washed their supplies away, forcing them to go to a nearby town to get more. They eventually were lured to a ${link_1}, where Sokka was interested in its weaponry. As they left, they were chased by pirates, but eventually escaped back to the lagoon, where Sokka was distraught to find out that Katara had stolen a ${link_2}.",
      "links": [
        {
          "body": "waterfall lagoon",
          "key": "${link_0}",
          "target": {
            "href": "Waterfall_lagoon",
            "page": "Waterfall_lagoon"
          }
        },
        {
          "body": "pirate ship boutique",
          "key": "${link_1}",
          "target": {
            "href": "Pirate_ship_boutique",
            "page": "Pirate_ship_boutique"
          }
        },
        {
          "body": "waterbending scroll",
          "key": "${link_2}",
          "target": {
            "href": "Waterbending_scroll",
            "page": "Waterbending_scroll"
          }
        }
      ],
      "text": "After this encounter, the team settled down at the waterfall lagoon, where Katara tried to teach Aang in basic waterbending while Sokka cleaned out Appa's toes. A large wave crafted by Aang washed their supplies away, forcing them to go to a nearby town to get more. They eventually were lured to a pirate ship boutique, where Sokka was interested in its weaponry. As they left, they were chased by pirates, but eventually escaped back to the lagoon, where Sokka was distraught to find out that Katara had stolen a waterbending scroll."
    },
    {
      "body": "The pirates, now working with Prince Zuko, later tracked the team down, with the pirates capturing Sokka and Aang, while Zuko captured Katara. However, the pirates refused to trade the Avatar and Sokka for the scroll, which Zuko held, after Sokka convinced them that the Avatar would fetch much more money. An angered Zuko started a fight, while the team escaped on the pirate ship. They were subsequently pursued by the pirates, eventually to the edge of the waterfall. An incoming collision from the boat the pirates used forced them to jump, but they successfully landed on the incoming Appa, allowing them to fly away safely. Sokka revealed that he managed to get the scroll back during the fight, allowing them to keep it as long as Katara had learned her lesson about theft.",
      "links": [],
      "text": "The pirates, now working with Prince Zuko, later tracked the team down, with the pirates capturing Sokka and Aang, while Zuko captured Katara. However, the pirates refused to trade the Avatar and Sokka for the scroll, which Zuko held, after Sokka convinced them that the Avatar would fetch much more money. An angered Zuko started a fight, while the team escaped on the pirate ship. They were subsequently pursued by the pirates, eventually to the edge of the waterfall. An incoming collision from the boat the pirates used forced them to jump, but they successfully landed on the incoming Appa, allowing them to fly away safely. Sokka revealed that he managed to get the scroll back during the fight, allowing them to keep it as long as Katara had learned her lesson about theft."
    },
    {
      "body": "The team temporarily camped out in a forested area where Momo, lured by a pile of ${link_0}, accidentally became caught in a ${link_1}. After freeing the lemur and two ${link_2} from their cages, the team examined the traps and identified them as being the work of the Fire Nation. Upon discovering this, Sokka decided they disassemble their campsite and continue their journey northward. He opposed Aang and Katara's desires to fly off on Appa, claiming the flying bison to be \"too noticeable\". This prompted Katara to question his level of authority in the group, to which Sokka proclaimed himself the leader, much to her amusement. After a brief confrontation in which Sokka stated that he wished to rely on his instincts to lead the group, the team set off on their journey by foot.",
      "links": [
        {
          "body": "lychee nuts",
          "key": "${link_0}",
          "target": {
            "href": "Lychee_nut",
            "page": "Lychee_nut"
          }
        },
        {
          "body": "trap",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_trap",
            "page": "Fire_Nation_trap"
          }
        },
        {
          "body": "hog monkeys",
          "key": "${link_2}",
          "target": {
            "href": "Hog_monkey",
            "page": "Hog_monkey"
          }
        }
      ],
      "text": "The team temporarily camped out in a forested area where Momo, lured by a pile of lychee nuts, accidentally became caught in a trap. After freeing the lemur and two hog monkeys from their cages, the team examined the traps and identified them as being the work of the Fire Nation. Upon discovering this, Sokka decided they disassemble their campsite and continue their journey northward. He opposed Aang and Katara's desires to fly off on Appa, claiming the flying bison to be \"too noticeable\". This prompted Katara to question his level of authority in the group, to which Sokka proclaimed himself the leader, much to her amusement. After a brief confrontation in which Sokka stated that he wished to rely on his instincts to lead the group, the team set off on their journey by foot."
    },
    {
      "body": "Things took a turn for the worse when the group accidentally wandered into a camp where several Fire Nation soldiers were stationed. Sokka unsuccessfully attempted to bargain with the soldiers, stating they would cause no harm if the soldiers would let them pass. The situation seemed hopeless until a band of rebel fighters suddenly emerged from hiding and ambushed the Fire Nation men. The leader of the group, a teenaged boy who fought with ${link_0}, proved himself to be a valiant fighter, ousting Sokka in defeating soldiers which upset the latter greatly. The soldiers were soon defeated and the leader introduced himself as ${link_1}, and his group as the ${link_2}.",
      "links": [
        {
          "body": "hook swords",
          "key": "${link_0}",
          "target": {
            "href": "Hook_swords",
            "page": "Hook_swords"
          }
        },
        {
          "body": "Jet",
          "key": "${link_1}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        },
        {
          "body": "Freedom Fighters",
          "key": "${link_2}",
          "target": {
            "href": "Freedom_Fighters",
            "page": "Freedom_Fighters"
          }
        }
      ],
      "text": "Things took a turn for the worse when the group accidentally wandered into a camp where several Fire Nation soldiers were stationed. Sokka unsuccessfully attempted to bargain with the soldiers, stating they would cause no harm if the soldiers would let them pass. The situation seemed hopeless until a band of rebel fighters suddenly emerged from hiding and ambushed the Fire Nation men. The leader of the group, a teenaged boy who fought with hook swords, proved himself to be a valiant fighter, ousting Sokka in defeating soldiers which upset the latter greatly. The soldiers were soon defeated and the leader introduced himself as Jet, and his group as the Freedom Fighters."
    },
    {
      "body": "${link_0} preventing ${link_1} from harming the ${link_2}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Jet",
          "key": "${link_1}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        },
        {
          "body": "old man",
          "key": "${link_2}",
          "target": {
            "href": "Old_Fire_Nation_civilian",
            "page": "Old_Fire_Nation_civilian"
          }
        }
      ],
      "text": "Sokka preventing Jet from harming the old man."
    },
    {
      "body": "While Katara took an instant liking to Jet, Sokka remained highly skeptical of him. He even openly mocked the Freedom Fighter, once saying, \"Yeah, nothing's braver than a guy in a tree house\", \"tree house\" referring to the band's ${link_0} among the trees. Sokka's dislike of Jet only increased during a scouting mission later on where Jet ambushed a harmless ${link_1}. When the Freedom Fighter prepared to beat the elder, who happened to be a citizen of the Fire Nation, Sokka intervened, convincing them to leave the man be. Although Jet refrained from attacking the man any further, he and a couple of others proceeded to steal his possessions.",
      "links": [
        {
          "body": "hideout",
          "key": "${link_0}",
          "target": {
            "href": "Treetop_hideout",
            "page": "Treetop_hideout"
          }
        },
        {
          "body": "old man",
          "key": "${link_1}",
          "target": {
            "href": "Old_Fire_Nation_civilian",
            "page": "Old_Fire_Nation_civilian"
          }
        }
      ],
      "text": "While Katara took an instant liking to Jet, Sokka remained highly skeptical of him. He even openly mocked the Freedom Fighter, once saying, \"Yeah, nothing's braver than a guy in a tree house\", \"tree house\" referring to the band's hideout among the trees. Sokka's dislike of Jet only increased during a scouting mission later on where Jet ambushed a harmless old man. When the Freedom Fighter prepared to beat the elder, who happened to be a citizen of the Fire Nation, Sokka intervened, convincing them to leave the man be. Although Jet refrained from attacking the man any further, he and a couple of others proceeded to steal his possessions."
    },
    {
      "body": "From that point on, Sokka tried desperately to convince Katara and Aang of Jet's true nature. These attempts, however, were unsuccessful and the two remained incredulous. That night, the warrior awoke to the sound of Jet and a few other Freedom Fighters sneaking out into the forest. He silently followed them to the location of a cliff overlooking a river, where he discovered Jet's plans to blow up a dam protecting the ${link_0} village of ${link_1} from potentially disastrous flooding. He himself was discovered hidden among the brush and apprehended by ${link_2} and ${link_3}, who took him on a \"long walk\" per Jet's orders.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Gaipan",
          "key": "${link_1}",
          "target": {
            "href": "Gaipan",
            "page": "Gaipan"
          }
        },
        {
          "body": "Smellerbee",
          "key": "${link_2}",
          "target": {
            "href": "Smellerbee",
            "page": "Smellerbee"
          }
        },
        {
          "body": "Pipsqueak",
          "key": "${link_3}",
          "target": {
            "href": "Pipsqueak",
            "page": "Pipsqueak"
          }
        }
      ],
      "text": "From that point on, Sokka tried desperately to convince Katara and Aang of Jet's true nature. These attempts, however, were unsuccessful and the two remained incredulous. That night, the warrior awoke to the sound of Jet and a few other Freedom Fighters sneaking out into the forest. He silently followed them to the location of a cliff overlooking a river, where he discovered Jet's plans to blow up a dam protecting the Earth Kingdom village of Gaipan from potentially disastrous flooding. He himself was discovered hidden among the brush and apprehended by Smellerbee and Pipsqueak, who took him on a \"long walk\" per Jet's orders."
    },
    {
      "body": "Sokka was able to outsmart the two, sneakily leading them to the location of the traps in which Momo was caught before, and Smellerbee and Pipsqueak soon became caught in the cages themselves. With knowledge of Jet's intentions, Sokka made his way to Gaipan where he warned everyone of the oncoming danger. Although disbelieved at first and assumed to be a spy by the Fire Nation also occupying the village, the old man Jet had attacked earlier vouched for him, and all the villagers were successfully led out of the village before it was flooded. He later returned on Appa to the outskirts of the forest where Aang and Katara were confronting Jet, who was frozen to a tree, now aware of his true nature. The three abandoned him with Sokka telling Jet that he had become a traitor when he \"stopped protecting innocent people\", as they departed.",
      "links": [],
      "text": "Sokka was able to outsmart the two, sneakily leading them to the location of the traps in which Momo was caught before, and Smellerbee and Pipsqueak soon became caught in the cages themselves. With knowledge of Jet's intentions, Sokka made his way to Gaipan where he warned everyone of the oncoming danger. Although disbelieved at first and assumed to be a spy by the Fire Nation also occupying the village, the old man Jet had attacked earlier vouched for him, and all the villagers were successfully led out of the village before it was flooded. He later returned on Appa to the outskirts of the forest where Aang and Katara were confronting Jet, who was frozen to a tree, now aware of his true nature. The three abandoned him with Sokka telling Jet that he had become a traitor when he \"stopped protecting innocent people\", as they departed."
    },
    {
      "body": "Sokka and the others continued their travels to the North Pole, briefly making a pit stop to the ${link_0}, the largest canyon in the Earth Kingdom. Unlike Katara and Aang, Sokka expressed little appreciation for the fascinating view it provided. While there, they met two tribes, the ${link_1} and the ${link_2}, both of whom were differing in their culture and had been feuding for the past one hundred years. Aang was eventually able to persuade them into traversing the canyon on foot. Sokka favored the Zhang as opposed to Katara, who favored the Gan Jin, stating he only chose their side because they fed him overnight. He joined the two tribes in a combined effort to harness the predatory ${link_3} that inhabited the canyon and the entirety of the traveling group was able to successfully escape the gorge by riding atop their backs. The Water Tribe warrior was later present to witness Aang devise a false story to settle the feud between the two tribes.",
      "links": [
        {
          "body": "Great Divide",
          "key": "${link_0}",
          "target": {
            "href": "Great_Divide",
            "page": "Great_Divide"
          }
        },
        {
          "body": "Zhang",
          "key": "${link_1}",
          "target": {
            "href": "Zhang",
            "page": "Zhang"
          }
        },
        {
          "body": "Gan Jin",
          "key": "${link_2}",
          "target": {
            "href": "Gan_Jin",
            "page": "Gan_Jin"
          }
        },
        {
          "body": "canyon crawlers",
          "key": "${link_3}",
          "target": {
            "href": "Canyon_crawler",
            "page": "Canyon_crawler"
          }
        }
      ],
      "text": "Sokka and the others continued their travels to the North Pole, briefly making a pit stop to the Great Divide, the largest canyon in the Earth Kingdom. Unlike Katara and Aang, Sokka expressed little appreciation for the fascinating view it provided. While there, they met two tribes, the Zhang and the Gan Jin, both of whom were differing in their culture and had been feuding for the past one hundred years. Aang was eventually able to persuade them into traversing the canyon on foot. Sokka favored the Zhang as opposed to Katara, who favored the Gan Jin, stating he only chose their side because they fed him overnight. He joined the two tribes in a combined effort to harness the predatory canyon crawlers that inhabited the canyon and the entirety of the traveling group was able to successfully escape the gorge by riding atop their backs. The Water Tribe warrior was later present to witness Aang devise a false story to settle the feud between the two tribes."
    },
    {
      "body": "${link_0} stupefied upon learning ${link_1}'s story about ${link_2} and ${link_3} was a total lie.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Jin Wei",
          "key": "${link_2}",
          "target": {
            "href": "Jin_Wei",
            "page": "Jin_Wei"
          }
        },
        {
          "body": "Wei Jin",
          "key": "${link_3}",
          "target": {
            "href": "Wei_Jin",
            "page": "Wei_Jin"
          }
        }
      ],
      "text": "Sokka stupefied upon learning Aang's story about Jin Wei and Wei Jin was a total lie."
    },
    {
      "body": "Later on, while camping out on a beach, the team discovered they were out of food and flew to a marketplace in a ${link_0}. The three overheard a ${link_1} and ${link_2} arguing nearby, with the wife trying to persuade her husband not to go out to sea due to an oncoming storm, a statement the latter refused to believe. After hearing the fisherman tell his wife that he would hire someone else and pay them twice as much, Sokka volunteered to accompany him and was hired on the spot.",
      "links": [
        {
          "body": "harbor town",
          "key": "${link_0}",
          "target": {
            "href": "Harbor_town",
            "page": "Harbor_town"
          }
        },
        {
          "body": "fisherman",
          "key": "${link_1}",
          "target": {
            "href": "Fisherman",
            "page": "Fisherman"
          }
        },
        {
          "body": "his wife",
          "key": "${link_2}",
          "target": {
            "href": "Fisherman%27s_wife",
            "page": "Fisherman%27s_wife"
          }
        }
      ],
      "text": "Later on, while camping out on a beach, the team discovered they were out of food and flew to a marketplace in a harbor town. The three overheard a fisherman and his wife arguing nearby, with the wife trying to persuade her husband not to go out to sea due to an oncoming storm, a statement the latter refused to believe. After hearing the fisherman tell his wife that he would hire someone else and pay them twice as much, Sokka volunteered to accompany him and was hired on the spot."
    },
    {
      "body": "The wife's predictions of an oncoming storm turned out to be true and, while out at sea, the fishing boat on which they were riding capsized. Both Sokka and the fisherman were in a hopeless situation until Aang and Katara arrived on Appa to rescue them, a mission which resulted in success and the safe return of both.",
      "links": [],
      "text": "The wife's predictions of an oncoming storm turned out to be true and, while out at sea, the fishing boat on which they were riding capsized. Both Sokka and the fisherman were in a hopeless situation until Aang and Katara arrived on Appa to rescue them, a mission which resulted in success and the safe return of both."
    },
    {
      "body": "Sokka contracted a cold as a result from being caught out at sea. The team took shelter in a derelict building near the ruins of ${link_0} where Katara tended to his illness. While sick, Sokka fell under a hallucinated state, making nonsensical comments on Appa's sense of humor and his non-existent earthbending skills. Katara subsequently caught Sokka's cold. When Aang was unable to find ginger root for ${link_1}, he traveled to an ${link_2} where he was captured by the ${link_3} and taken to a prison under Admiral ${link_4}'s command, leaving Katara worried about his whereabouts.",
      "links": [
        {
          "body": "Taku",
          "key": "${link_0}",
          "target": {
            "href": "Taku",
            "page": "Taku"
          }
        },
        {
          "body": "tea",
          "key": "${link_1}",
          "target": {
            "href": "Tea",
            "page": "Tea"
          }
        },
        {
          "body": "herbalist institute",
          "key": "${link_2}",
          "target": {
            "href": "Taku#Herbalist_institute",
            "page": "Taku"
          }
        },
        {
          "body": "Yuyan Archers",
          "key": "${link_3}",
          "target": {
            "href": "Yuyan_Archers",
            "page": "Yuyan_Archers"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_4}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        }
      ],
      "text": "Sokka contracted a cold as a result from being caught out at sea. The team took shelter in a derelict building near the ruins of Taku where Katara tended to his illness. While sick, Sokka fell under a hallucinated state, making nonsensical comments on Appa's sense of humor and his non-existent earthbending skills. Katara subsequently caught Sokka's cold. When Aang was unable to find ginger root for tea, he traveled to an herbalist institute where he was captured by the Yuyan Archers and taken to a prison under Admiral Zhao's command, leaving Katara worried about his whereabouts."
    },
    {
      "body": "Aang was able to escape imprisonment, with the aid of Zuko disguised as the mysterious Blue Spirit, and returned to his friends, giving them frozen ${link_0} from the nearby valley swamp on which to suck, a method advised by the ${link_1}. Sokka commented on the apparently tasty flavor of the frozen frog, only for the creature to thaw out and come to life. This left both him and his sister cured, yet disgusted. After this incident, Sokka claimed to have had a wart on his uvula for a week, a claim Katara adamantly refused to believe.",
      "links": [
        {
          "body": "wood frogs",
          "key": "${link_0}",
          "target": {
            "href": "Wood_frog",
            "page": "Wood_frog"
          }
        },
        {
          "body": "herbalist",
          "key": "${link_1}",
          "target": {
            "href": "Herbalist",
            "page": "Herbalist"
          }
        }
      ],
      "text": "Aang was able to escape imprisonment, with the aid of Zuko disguised as the mysterious Blue Spirit, and returned to his friends, giving them frozen wood frogs from the nearby valley swamp on which to suck, a method advised by the herbalist. Sokka commented on the apparently tasty flavor of the frozen frog, only for the creature to thaw out and come to life. This left both him and his sister cured, yet disgusted. After this incident, Sokka claimed to have had a wart on his uvula for a week, a claim Katara adamantly refused to believe."
    },
    {
      "body": "Sometime later, the group camped out near a river where they met a ${link_0} being attacked by a ${link_1}. The man remained perfectly calm, despite being in the face of danger, based on a prediction by his town's ${link_2} that he would have a safe journey. Aang and Katara decide to travel to the ${link_3}, thinking it would be fun to have their fortunes told. Sokka expressed displeasure at this, protesting that fortunetelling was pure nonsense, but the team went to see the fortuneteller regardless.",
      "links": [
        {
          "body": "man",
          "key": "${link_0}",
          "target": {
            "href": "Calm_man",
            "page": "Calm_man"
          }
        },
        {
          "body": "platypus bear",
          "key": "${link_1}",
          "target": {
            "href": "Platypus_bear",
            "page": "Platypus_bear"
          }
        },
        {
          "body": "fortuneteller",
          "key": "${link_2}",
          "target": {
            "href": "Wu_(fortuneteller)",
            "page": "Wu_(fortuneteller)"
          }
        },
        {
          "body": "village",
          "key": "${link_3}",
          "target": {
            "href": "Makapu_Village",
            "page": "Makapu_Village"
          }
        }
      ],
      "text": "Sometime later, the group camped out near a river where they met a man being attacked by a platypus bear. The man remained perfectly calm, despite being in the face of danger, based on a prediction by his town's fortuneteller that he would have a safe journey. Aang and Katara decide to travel to the village, thinking it would be fun to have their fortunes told. Sokka expressed displeasure at this, protesting that fortunetelling was pure nonsense, but the team went to see the fortuneteller regardless."
    },
    {
      "body": "The trip proved extremely frustrating for Sokka, whom the fortuneteller, Aunt Wu, predicted would have a future filled with self-inflicted struggle and anguish. He repeatedly attempted to prove her predictions wrong, which only succeeded in further frustration. Aang once approached Sokka for advice on talking to girls, implying Katara, to which the warrior gladly agreed. Sokka, however, was oblivious of the fact that Aang had meant Katara and mistook his crush as Aunt Wu's assistant, ${link_0}, a ten-year-old who had fallen for Aang. He urged Aang to act aloof, as though he did not really care, advice that the latter willingly took and acted upon.",
      "links": [
        {
          "body": "Meng",
          "key": "${link_0}",
          "target": {
            "href": "Meng",
            "page": "Meng"
          }
        }
      ],
      "text": "The trip proved extremely frustrating for Sokka, whom the fortuneteller, Aunt Wu, predicted would have a future filled with self-inflicted struggle and anguish. He repeatedly attempted to prove her predictions wrong, which only succeeded in further frustration. Aang once approached Sokka for advice on talking to girls, implying Katara, to which the warrior gladly agreed. Sokka, however, was oblivious of the fact that Aang had meant Katara and mistook his crush as Aunt Wu's assistant, Meng, a ten-year-old who had fallen for Aang. He urged Aang to act aloof, as though he did not really care, advice that the latter willingly took and acted upon."
    },
    {
      "body": "${link_0} attempting to alert Aunt ${link_1} of ${link_2}'s imminent eruption.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Wu",
          "key": "${link_1}",
          "target": {
            "href": "Wu_(fortuneteller)",
            "page": "Wu_(fortuneteller)"
          }
        },
        {
          "body": "Mt. Makapu",
          "key": "${link_2}",
          "target": {
            "href": "Mt",
            "page": "Mt"
          }
        }
      ],
      "text": "Sokka attempting to alert Aunt Wu of Mt. Makapu's imminent eruption."
    },
    {
      "body": "Aang's attempts to catch Katara's attention by remaining aloof were unsuccessful and he instead decided to get her a rare ${link_0} flower from the rim of the ${link_1}. He took Sokka along with him, much to the latter's annoyance. Upon arrival at the rim, the two discovered the volcano filled with lava and ready to erupt, contrary to Aunt Wu's earlier prediction that the caldera would remain dormant for another year. They flew back to the village on ${link_2} and informed Katara of the oncoming danger. They attempted to persuade the villagers to accept the truth that Aunt Wu was wrong, but to no avail. Quickly running out of time, the team came up with a plan in which Aang would borrow Wu's ${link_3}, and he and Katara would use bending to shape the clouds into the symbol for volcanic doom.",
      "links": [
        {
          "body": "panda lily",
          "key": "${link_0}",
          "target": {
            "href": "Panda_lily",
            "page": "Panda_lily"
          }
        },
        {
          "body": "Makapu volcano",
          "key": "${link_1}",
          "target": {
            "href": "Mt",
            "page": "Mt"
          }
        },
        {
          "body": "Aang's glider",
          "key": "${link_2}",
          "target": {
            "href": "Airbender_staff",
            "page": "Airbender_staff"
          }
        },
        {
          "body": "cloud-reading book",
          "key": "${link_3}",
          "target": {
            "href": "Book_of_Clouds",
            "page": "Book_of_Clouds"
          }
        }
      ],
      "text": "Aang's attempts to catch Katara's attention by remaining aloof were unsuccessful and he instead decided to get her a rare panda lily flower from the rim of the Makapu volcano. He took Sokka along with him, much to the latter's annoyance. Upon arrival at the rim, the two discovered the volcano filled with lava and ready to erupt, contrary to Aunt Wu's earlier prediction that the caldera would remain dormant for another year. They flew back to the village on Aang's glider and informed Katara of the oncoming danger. They attempted to persuade the villagers to accept the truth that Aunt Wu was wrong, but to no avail. Quickly running out of time, the team came up with a plan in which Aang would borrow Wu's cloud-reading book, and he and Katara would use bending to shape the clouds into the symbol for volcanic doom."
    },
    {
      "body": "Their strategy was successful and, now fully aware of the danger, the villagers accepted Sokka's plan to dig a trench and channel the lava into the nearby river. These actions, along with an impressive display of Aang's ${link_0} power, saved the village from being destroyed. Sokka expressed his hopes that the event would teach the civilians not to rely too much on fortunetelling, only to be told by the calm man that Wu's prediction that the village would not be destroyed by the volcano had come true because it was ultimately saved. Sokka said through gritted teeth, \"I hate you\", and had to be led away by Katara.",
      "links": [
        {
          "body": "airbending",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Their strategy was successful and, now fully aware of the danger, the villagers accepted Sokka's plan to dig a trench and channel the lava into the nearby river. These actions, along with an impressive display of Aang's airbending power, saved the village from being destroyed. Sokka expressed his hopes that the event would teach the civilians not to rely too much on fortunetelling, only to be told by the calm man that Wu's prediction that the village would not be destroyed by the volcano had come true because it was ultimately saved. Sokka said through gritted teeth, \"I hate you\", and had to be led away by Katara."
    },
    {
      "body": "During their travels, the group encountered an old friend from their Water Tribe village, a warrior named ${link_0}, who had been injured and left behind by Hakoda and the other warriors. They headed back to his current home in an ${link_1} of nuns who made perfumes and cures. Because they spent so much time reminiscing, they neglected Aang, who could not help but feel jealous. They suddenly started talking about how Katara and Sokka might be able to visit their father, Hakoda, and that a ${link_2} was arriving soon about Hakoda's whereabouts. Aang ran off feeling hurt that Katara and Sokka might leave him to go find their father instead of helping him. While Aang was contemplating their possible departure, a messenger arrived with the news from Hakoda and instead of giving it to them, Aang hid it.",
      "links": [
        {
          "body": "Bato",
          "key": "${link_0}",
          "target": {
            "href": "Bato",
            "page": "Bato"
          }
        },
        {
          "body": "abbey",
          "key": "${link_1}",
          "target": {
            "href": "Abbey",
            "page": "Abbey"
          }
        },
        {
          "body": "message",
          "key": "${link_2}",
          "target": {
            "href": "Rendezvous_map",
            "page": "Rendezvous_map"
          }
        }
      ],
      "text": "During their travels, the group encountered an old friend from their Water Tribe village, a warrior named Bato, who had been injured and left behind by Hakoda and the other warriors. They headed back to his current home in an abbey of nuns who made perfumes and cures. Because they spent so much time reminiscing, they neglected Aang, who could not help but feel jealous. They suddenly started talking about how Katara and Sokka might be able to visit their father, Hakoda, and that a message was arriving soon about Hakoda's whereabouts. Aang ran off feeling hurt that Katara and Sokka might leave him to go find their father instead of helping him. While Aang was contemplating their possible departure, a messenger arrived with the news from Hakoda and instead of giving it to them, Aang hid it."
    },
    {
      "body": "The next day, Bato took Sokka on a coming-of-age ritual called \"${link_0}\". Instead of ice, though, they navigated jagged rocks, as there was no ice in the Earth Kingdom. With the help from Katara and Aang, they passed the tests, and the three received a ceremonial mark for their ${link_1}, ${link_2}, and ${link_3}. However, when Aang received the mark of trust, he could not contain his guilt of hiding the map any longer and gave the message to Katara and Sokka. A furious Sokka and a disappointed Katara decided to go off to find Hakoda and left Aang to go to the North Pole on his own. Aang herded Appa back to the beach.",
      "links": [
        {
          "body": "ice dodging",
          "key": "${link_0}",
          "target": {
            "href": "Ice_dodging",
            "page": "Ice_dodging"
          }
        },
        {
          "body": "wisdom",
          "key": "${link_1}",
          "target": {
            "href": "Body_markings_in_the_World_of_Avatar#Mark_of_the_Wise",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        },
        {
          "body": "bravery",
          "key": "${link_2}",
          "target": {
            "href": "Body_markings_in_the_World_of_Avatar#Mark_of_the_Brave",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        },
        {
          "body": "trust",
          "key": "${link_3}",
          "target": {
            "href": "Body_markings_in_the_World_of_Avatar#Mark_of_the_Trusted",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "The next day, Bato took Sokka on a coming-of-age ritual called \"ice dodging\". Instead of ice, though, they navigated jagged rocks, as there was no ice in the Earth Kingdom. With the help from Katara and Aang, they passed the tests, and the three received a ceremonial mark for their wisdom, bravery, and trust. However, when Aang received the mark of trust, he could not contain his guilt of hiding the map any longer and gave the message to Katara and Sokka. A furious Sokka and a disappointed Katara decided to go off to find Hakoda and left Aang to go to the North Pole on his own. Aang herded Appa back to the beach."
    },
    {
      "body": "${link_0} and ${link_1} with ${link_2}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Bato",
          "key": "${link_2}",
          "target": {
            "href": "Bato",
            "page": "Bato"
          }
        }
      ],
      "text": "Sokka and Katara with Bato."
    },
    {
      "body": "Soon down their path, Bato, Katara, and Sokka heard a wolf cry. Katara suggested that the wolf was hurt, but Bato told them that the wolf had been separated from its pack. He explained how he knew this by telling about when he was wounded in battle and left in the abbey to heal by his fellow warriors, feeling the loneliest he had ever felt. This incident reminded Sokka of when Hakoda left to fight in the Hundred Year War, and he told Sokka that he could not come along and fight with him. Hakoda had told Sokka that being \"a man\" was about \"knowing where you're needed the most\", and that for Sokka, it was at the Southern Water Tribe, to protect his sister. Sokka and Katara realized their mistake and turned around to apologize and resume their journeys with Aang.",
      "links": [],
      "text": "Soon down their path, Bato, Katara, and Sokka heard a wolf cry. Katara suggested that the wolf was hurt, but Bato told them that the wolf had been separated from its pack. He explained how he knew this by telling about when he was wounded in battle and left in the abbey to heal by his fellow warriors, feeling the loneliest he had ever felt. This incident reminded Sokka of when Hakoda left to fight in the Hundred Year War, and he told Sokka that he could not come along and fight with him. Hakoda had told Sokka that being \"a man\" was about \"knowing where you're needed the most\", and that for Sokka, it was at the Southern Water Tribe, to protect his sister. Sokka and Katara realized their mistake and turned around to apologize and resume their journeys with Aang."
    },
    {
      "body": "As they were walking back to find Aang, Zuko, June and Iroh appeared on ${link_0}, and quickly subdued them. June commented that it was no wonder Katara left Zuko as she was too pretty for him. A furious Zuko questioned them about Aang's whereabouts, but they did not know as they were separated. Even though the Avatar was not with Sokka and Katara, the ${link_1} found a new scent: the message that Aang had held before. They headed back to the abbey as Aang came to the rescue.",
      "links": [
        {
          "body": "Nyla",
          "key": "${link_0}",
          "target": {
            "href": "Nyla",
            "page": "Nyla"
          }
        },
        {
          "body": "shirshu",
          "key": "${link_1}",
          "target": {
            "href": "Shirshu",
            "page": "Shirshu"
          }
        }
      ],
      "text": "As they were walking back to find Aang, Zuko, June and Iroh appeared on Nyla, and quickly subdued them. June commented that it was no wonder Katara left Zuko as she was too pretty for him. A furious Zuko questioned them about Aang's whereabouts, but they did not know as they were separated. Even though the Avatar was not with Sokka and Katara, the shirshu found a new scent: the message that Aang had held before. They headed back to the abbey as Aang came to the rescue."
    },
    {
      "body": "Aang battled Zuko among the rooftops, while Appa took on June and the shirshu. Aang managed to get Katara's necklace back, but was soon trapped by the shirshu and Zuko.",
      "links": [],
      "text": "Aang battled Zuko among the rooftops, while Appa took on June and the shirshu. Aang managed to get Katara's necklace back, but was soon trapped by the shirshu and Zuko."
    },
    {
      "body": "Meanwhile, Sokka and Katara were revived, as they were paralyzed by Nyla, by some perfume given to them by the nuns, and suddenly Sokka had an idea. The nuns poured out all their perfumes and Katara started waterbending them into a thick mist. Since the shirshu could only \"see\" by smelling with its nose, it got confused and started attacking random people with its poisonous tongue. Aang and the others used this opportunity to escape.",
      "links": [],
      "text": "Meanwhile, Sokka and Katara were revived, as they were paralyzed by Nyla, by some perfume given to them by the nuns, and suddenly Sokka had an idea. The nuns poured out all their perfumes and Katara started waterbending them into a thick mist. Since the shirshu could only \"see\" by smelling with its nose, it got confused and started attacking random people with its poisonous tongue. Aang and the others used this opportunity to escape."
    },
    {
      "body": "Later, the kids were flying on Appa, and Aang asked what the plan was now. Sokka and Katara told him they were going to get him to the North Pole because he was their family, too. Aang gave Katara back her necklace, and Katara went over and kissed him on the cheek. Aang blushed and twiddled with his thumbs to hide his face as they all flew off into the sunset.",
      "links": [],
      "text": "Later, the kids were flying on Appa, and Aang asked what the plan was now. Sokka and Katara told him they were going to get him to the North Pole because he was their family, too. Aang gave Katara back her necklace, and Katara went over and kissed him on the cheek. Aang blushed and twiddled with his thumbs to hide his face as they all flew off into the sunset."
    },
    {
      "body": "After hearing rumors of supposed \"air walkers\" living at the ${link_0} from an elderly storyteller, Team Avatar traveled to the temple in the hopes of finding still-living airbenders there. Instead, what they discovered was a colony of Earth Kingdom citizens led by a ${link_1} along with his ${link_2}. The villagers had settled there after a flood had destroyed their home. It was discovered that the mechanist was a genius inventor who had installed several technological upgrades to the ancient temple. This impressed Sokka tremendously, but disheartened Aang, who saw the innovations as an offense to his people's culture.",
      "links": [
        {
          "body": "Northern Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        },
        {
          "body": "mechanist",
          "key": "${link_1}",
          "target": {
            "href": "Mechanist",
            "page": "Mechanist"
          }
        },
        {
          "body": "paraplegic son",
          "key": "${link_2}",
          "target": {
            "href": "Teo",
            "page": "Teo"
          }
        }
      ],
      "text": "After hearing rumors of supposed \"air walkers\" living at the Northern Air Temple from an elderly storyteller, Team Avatar traveled to the temple in the hopes of finding still-living airbenders there. Instead, what they discovered was a colony of Earth Kingdom citizens led by a mechanist along with his paraplegic son. The villagers had settled there after a flood had destroyed their home. It was discovered that the mechanist was a genius inventor who had installed several technological upgrades to the ancient temple. This impressed Sokka tremendously, but disheartened Aang, who saw the innovations as an offense to his people's culture."
    },
    {
      "body": "${link_0} and the ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "mechanist",
          "key": "${link_1}",
          "target": {
            "href": "Mechanist",
            "page": "Mechanist"
          }
        }
      ],
      "text": "Sokka and the mechanist."
    },
    {
      "body": "Enthralled by the developments, Sokka spent plenty of time with the mechanist. He studied his work and praised his inventions, once complimenting him by calling him \"a genius\". At one point, the two ventured down a dark cavern to a room filled with natural gas. Concerned with the threat of the gas chamber causing a massive explosion if inflamed, Sokka devised a plan to fill the chamber with rotten eggs; in this way, should a gas leak occur, the foul smell would alert them of the danger. The two also made advancements to a ${link_0} design, with the young Water Tribe warrior's help.",
      "links": [
        {
          "body": "war balloon",
          "key": "${link_0}",
          "target": {
            "href": "Hot_air_balloon",
            "page": "Hot_air_balloon"
          }
        }
      ],
      "text": "Enthralled by the developments, Sokka spent plenty of time with the mechanist. He studied his work and praised his inventions, once complimenting him by calling him \"a genius\". At one point, the two ventured down a dark cavern to a room filled with natural gas. Concerned with the threat of the gas chamber causing a massive explosion if inflamed, Sokka devised a plan to fill the chamber with rotten eggs; in this way, should a gas leak occur, the foul smell would alert them of the danger. The two also made advancements to a war balloon design, with the young Water Tribe warrior's help."
    },
    {
      "body": "Meanwhile, Aang, Katara and Teo discovered that the once sacred ${link_0} had been transformed into a workshop for creating ${link_1} for the Fire Nation. The mechanist confessed that he was coerced into producing weapons for the Fire Nation with the threat that, should he not comply, the entire temple would be destroyed by the enemy. Not long after, ${link_2} ${link_3} came to the temple, seeking the promised weapons. When Aang refused and attacked the war minister, the latter vowed vengeance and left to assemble an army of Fire Nation soldiers. With Fire Nation forces quickly approaching the temple, the Earth Kingdom colonists and Team Avatar worked together to fend them off, using their power over air to their advantage and unleashing bomb after bomb.",
      "links": [
        {
          "body": "air temple sanctuary",
          "key": "${link_0}",
          "target": {
            "href": "Air_temple_sanctuaries#Northern_Sanctuary",
            "page": "Air_temple_sanctuaries"
          }
        },
        {
          "body": "weapons",
          "key": "${link_1}",
          "target": {
            "href": "Weaponry_in_the_World_of_Avatar",
            "page": "Weaponry_in_the_World_of_Avatar"
          }
        },
        {
          "body": "War Minister",
          "key": "${link_2}",
          "target": {
            "href": "War_Minister",
            "page": "War_Minister"
          }
        },
        {
          "body": "Qin",
          "key": "${link_3}",
          "target": {
            "href": "Qin",
            "page": "Qin"
          }
        }
      ],
      "text": "Meanwhile, Aang, Katara and Teo discovered that the once sacred air temple sanctuary had been transformed into a workshop for creating weapons for the Fire Nation. The mechanist confessed that he was coerced into producing weapons for the Fire Nation with the threat that, should he not comply, the entire temple would be destroyed by the enemy. Not long after, War Minister Qin came to the temple, seeking the promised weapons. When Aang refused and attacked the war minister, the latter vowed vengeance and left to assemble an army of Fire Nation soldiers. With Fire Nation forces quickly approaching the temple, the Earth Kingdom colonists and Team Avatar worked together to fend them off, using their power over air to their advantage and unleashing bomb after bomb."
    },
    {
      "body": "Despite their efforts, the troops still advanced and they soon ran out of bombs. At that moment, Sokka and the mechanist appeared, riding a war balloon. Being that the balloon bore the Fire Nation emblem, the Fire Nation troops themselves did not attack, thinking that they were allies. After releasing the bombs the war balloon was carrying, Sokka and the mechanist found themselves in a desperate situation, until Sokka, cleverly, threw their fuel supply that kept the balloon going into a crevice where natural gas was escaping. This action caused an explosion that defeated the Fire Nation forces which forced them to retreat, and the colonists and Team Avatar celebrated their victory. What they did not realize was that Qin found the war balloon that had to be abandoned because of the loss of the fuel supply. He sinisterly remarked that their defeat would be the \"gateway to many victories.\"",
      "links": [],
      "text": "Despite their efforts, the troops still advanced and they soon ran out of bombs. At that moment, Sokka and the mechanist appeared, riding a war balloon. Being that the balloon bore the Fire Nation emblem, the Fire Nation troops themselves did not attack, thinking that they were allies. After releasing the bombs the war balloon was carrying, Sokka and the mechanist found themselves in a desperate situation, until Sokka, cleverly, threw their fuel supply that kept the balloon going into a crevice where natural gas was escaping. This action caused an explosion that defeated the Fire Nation forces which forced them to retreat, and the colonists and Team Avatar celebrated their victory. What they did not realize was that Qin found the war balloon that had to be abandoned because of the loss of the fuel supply. He sinisterly remarked that their defeat would be the \"gateway to many victories.\""
    },
    {
      "body": "After Sokka complained that Appa was flying too slowly, Aang defensively replied that they should all climb on Sokka's back and he could fly them to the North Pole. Katara tried to smooth the situation, remarking that they were all tired and cranky as a result of flying for two days straight. Just as Sokka was voicing his doubts about finding the Northern Water Tribe, the group was attacked by northern waterbenders who led them to their destination. While touring the city by gondola, Sokka saw ${link_0} ${link_1} for the first time, and fell in love with her.",
      "links": [
        {
          "body": "Princess",
          "key": "${link_0}",
          "target": {
            "href": "Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_1}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        }
      ],
      "text": "After Sokka complained that Appa was flying too slowly, Aang defensively replied that they should all climb on Sokka's back and he could fly them to the North Pole. Katara tried to smooth the situation, remarking that they were all tired and cranky as a result of flying for two days straight. Just as Sokka was voicing his doubts about finding the Northern Water Tribe, the group was attacked by northern waterbenders who led them to their destination. While touring the city by gondola, Sokka saw Princess Yue for the first time, and fell in love with her."
    },
    {
      "body": "${link_0} falling in love with ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Yue",
          "key": "${link_1}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        }
      ],
      "text": "Sokka falling in love with Yue."
    },
    {
      "body": "Outside the great palace of the Northern Water Tribe, Sokka and Katara were celebrated as family from the Southern Tribe, and Aang was honored as a special guest. The sixteenth birthday of the princess, Yue, was also celebrated, coming of marrying age. Sokka was far more interested in the food at the banquet and Princess Yue who was sitting next to him, rather than the celebration. He broke an awkward silence by telling Yue that back in his tribe he was \"kind of like a prince himself.\" This statement was heard by Katara, who derisively asked him what he was the prince of. Embarrassed, Sokka replied that he was the prince \"of a lot of things\" and that he was in the middle of a conversation. He told Yue that he would be in town for a while and asked if she would like to \"do an activity\" with him. The next day, Sokka made plans with Princess Yue to meet on a bridge above the canal.",
      "links": [],
      "text": "Outside the great palace of the Northern Water Tribe, Sokka and Katara were celebrated as family from the Southern Tribe, and Aang was honored as a special guest. The sixteenth birthday of the princess, Yue, was also celebrated, coming of marrying age. Sokka was far more interested in the food at the banquet and Princess Yue who was sitting next to him, rather than the celebration. He broke an awkward silence by telling Yue that back in his tribe he was \"kind of like a prince himself.\" This statement was heard by Katara, who derisively asked him what he was the prince of. Embarrassed, Sokka replied that he was the prince \"of a lot of things\" and that he was in the middle of a conversation. He told Yue that he would be in town for a while and asked if she would like to \"do an activity\" with him. The next day, Sokka made plans with Princess Yue to meet on a bridge above the canal."
    },
    {
      "body": "Sokka met with Princess Yue on the bridge, presenting her with a carved fish, which she mistook for a bear. However, Yue told Sokka that she had made a mistake inviting him there and ran away, leaving Sokka looking devastated and causing him to throw his carving into the water out of anger. Later, when the gang met in their living quarters, they were all unhappy with how their day went. Sokka was confused and upset by Yue's mixed messages and Aang and Katara were unhappy that Katara was not allowed to learn waterbending. Sokka suggested that at night, Aang could teach Katara everything he had learned during the day.",
      "links": [],
      "text": "Sokka met with Princess Yue on the bridge, presenting her with a carved fish, which she mistook for a bear. However, Yue told Sokka that she had made a mistake inviting him there and ran away, leaving Sokka looking devastated and causing him to throw his carving into the water out of anger. Later, when the gang met in their living quarters, they were all unhappy with how their day went. Sokka was confused and upset by Yue's mixed messages and Aang and Katara were unhappy that Katara was not allowed to learn waterbending. Sokka suggested that at night, Aang could teach Katara everything he had learned during the day."
    },
    {
      "body": "After being caught practicing, Katara challenged the cynical waterbending master to a duel and was subsequently defeated. Master ${link_0} told Katara that her grandmother left an arranged marriage to him to begin her life in the South Pole. Katara understood that she refused to let her tribe's customs rule her life. This revelation made Princess Yue burst into tears and run away. Sokka followed her and found her on the bridge where they had met. Yue weeped softly while Sokka told her he wanted nothing from her, but to tell her that she was beautiful, and that he never would have thought she would even notice a guy like him. Yue told him that he did not understand, but Sokka believed he did: she was a princess and he was just a Southern Tribe peasant. He turned to leave, but Yue kissed him, making Sokka happy but extremely confused. Yue explained that she had also fallen for Sokka, but they could not be together, and not for the reason Sokka thought. She sadly pulled down the furs about her neck to reveal a ${link_1}, explaining that she was engaged to ${link_2}. She apologized and left Sokka alone on the bridge.",
      "links": [
        {
          "body": "Pakku",
          "key": "${link_0}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "betrothal necklace",
          "key": "${link_1}",
          "target": {
            "href": "Betrothal_necklace",
            "page": "Betrothal_necklace"
          }
        },
        {
          "body": "Hahn",
          "key": "${link_2}",
          "target": {
            "href": "Hahn",
            "page": "Hahn"
          }
        }
      ],
      "text": "After being caught practicing, Katara challenged the cynical waterbending master to a duel and was subsequently defeated. Master Pakku told Katara that her grandmother left an arranged marriage to him to begin her life in the South Pole. Katara understood that she refused to let her tribe's customs rule her life. This revelation made Princess Yue burst into tears and run away. Sokka followed her and found her on the bridge where they had met. Yue weeped softly while Sokka told her he wanted nothing from her, but to tell her that she was beautiful, and that he never would have thought she would even notice a guy like him. Yue told him that he did not understand, but Sokka believed he did: she was a princess and he was just a Southern Tribe peasant. He turned to leave, but Yue kissed him, making Sokka happy but extremely confused. Yue explained that she had also fallen for Sokka, but they could not be together, and not for the reason Sokka thought. She sadly pulled down the furs about her neck to reveal a betrothal necklace, explaining that she was engaged to Hahn. She apologized and left Sokka alone on the bridge."
    },
    {
      "body": "${link_0} inspecting the soot-contaminated snow after seeing it fall.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Sokka inspecting the soot-contaminated snow after seeing it fall."
    },
    {
      "body": "As Admiral ${link_0} began to launch his attack against the Northern Water Tribe, Sokka took Princess Yue for a ride on Appa, during which they nearly kissed. Soot suddenly began to fall, and Sokka recognized it from when his tribe was attacked; due to the amount of soot, he knew that a massive attack force was approaching.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        }
      ],
      "text": "As Admiral Zhao began to launch his attack against the Northern Water Tribe, Sokka took Princess Yue for a ride on Appa, during which they nearly kissed. Soot suddenly began to fall, and Sokka recognized it from when his tribe was attacked; due to the amount of soot, he knew that a massive attack force was approaching."
    },
    {
      "body": "The Northern Water Tribe prepared to defend itself from invasion, and Sokka volunteered for a dangerous mission where several warriors would be forced to infiltrate the Fire Nation fleet. As the walls of the prestigious city began to fall, Aang felt duty bound to prevent the same fate that befell the ${link_0} and the Southern Water Tribe. However, he found that against such a vast fleet, he did not stand a chance and retreated in exhaustion.",
      "links": [
        {
          "body": "Air Nomads",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "text": "The Northern Water Tribe prepared to defend itself from invasion, and Sokka volunteered for a dangerous mission where several warriors would be forced to infiltrate the Fire Nation fleet. As the walls of the prestigious city began to fall, Aang felt duty bound to prevent the same fate that befell the Air Nomads and the Southern Water Tribe. However, he found that against such a vast fleet, he did not stand a chance and retreated in exhaustion."
    },
    {
      "body": "After some critical remarks from Sokka during a briefing, mainly about the ${link_0} uniforms, Chief ${link_1} decided to have him advise ${link_2}, the leader of the infiltration mission and Yue's betrothed. Hahn, however, was found to be a \"self-absorbed weasel\", according to Sokka, with a greater interest in rising in rank than Yue herself. The two got into a fight and Arnook pulled Sokka off the mission. A disgruntled Sokka was left behind until Arnook revealed the real reason behind the act: he wanted Sokka to protect Yue and be her bodyguard.",
      "links": [
        {
          "body": "Fire Navy",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "Arnook",
          "key": "${link_1}",
          "target": {
            "href": "Arnook",
            "page": "Arnook"
          }
        },
        {
          "body": "Hahn",
          "key": "${link_2}",
          "target": {
            "href": "Hahn",
            "page": "Hahn"
          }
        }
      ],
      "text": "After some critical remarks from Sokka during a briefing, mainly about the Fire Navy uniforms, Chief Arnook decided to have him advise Hahn, the leader of the infiltration mission and Yue's betrothed. Hahn, however, was found to be a \"self-absorbed weasel\", according to Sokka, with a greater interest in rising in rank than Yue herself. The two got into a fight and Arnook pulled Sokka off the mission. A disgruntled Sokka was left behind until Arnook revealed the real reason behind the act: he wanted Sokka to protect Yue and be her bodyguard."
    },
    {
      "body": "After Aang came out of the ${link_0}, he noticed that he had been taken by Zuko. Aang was saved by the timely arrival of Katara, Sokka and Princess Yue on Appa. Zuko and Katara had a rematch, but due to the moon being out this time, Katara easily defeated him in a matter of seconds. Aang took the unconscious Zuko with him, despite some disagreement from Sokka and Katara.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "After Aang came out of the Spirit World, he noticed that he had been taken by Zuko. Aang was saved by the timely arrival of Katara, Sokka and Princess Yue on Appa. Zuko and Katara had a rematch, but due to the moon being out this time, Katara easily defeated him in a matter of seconds. Aang took the unconscious Zuko with him, despite some disagreement from Sokka and Katara."
    },
    {
      "body": "${link_0} kissing ${link_1} as a spirit.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Yue",
          "key": "${link_1}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        }
      ],
      "text": "Sokka kissing Yue as a spirit."
    },
    {
      "body": "While returning to the ${link_0}, Zhao had already captured the white koi fish. Promptly, the moon glowed red, creating a lunar eclipse and color seeped from the world. Immediately, the fighting waterbenders were rendered helpless. Zhao was creating titles for himself until ${link_1} jumped on his head. After Zhao attempted to get the lemur off, Momo rejoined the group. Zhao threatened to murder the ${link_2}, only for Iroh to intervene and warn against his actions. Threatened by Iroh with severe consequences if he did not comply, the admiral released the koi back into the water. However, he suddenly threw fire at the spirit, killing it. The moon vanished altogether from the sky, leaving complete darkness in the world. Iroh and Katara attempted to revive the Moon Spirit, but it was too late, as Tui had already died. Angered, Aang suddenly entered the Avatar State and fused with the ${link_3}, turning into a giant fish-like creature of water. In this state, Aang scoured the entire Northern City and massacred the Fire Nation's invasion force, while leaving the citizens of the Water Tribe, who bowed in worship, unharmed in a manner similar to the Passover.",
      "links": [
        {
          "body": "oasis",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "Momo",
          "key": "${link_1}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        },
        {
          "body": "Moon Spirit",
          "key": "${link_2}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Ocean Spirit",
          "key": "${link_3}",
          "target": {
            "href": "La",
            "page": "La"
          }
        }
      ],
      "text": "While returning to the oasis, Zhao had already captured the white koi fish. Promptly, the moon glowed red, creating a lunar eclipse and color seeped from the world. Immediately, the fighting waterbenders were rendered helpless. Zhao was creating titles for himself until Momo jumped on his head. After Zhao attempted to get the lemur off, Momo rejoined the group. Zhao threatened to murder the Moon Spirit, only for Iroh to intervene and warn against his actions. Threatened by Iroh with severe consequences if he did not comply, the admiral released the koi back into the water. However, he suddenly threw fire at the spirit, killing it. The moon vanished altogether from the sky, leaving complete darkness in the world. Iroh and Katara attempted to revive the Moon Spirit, but it was too late, as Tui had already died. Angered, Aang suddenly entered the Avatar State and fused with the Ocean Spirit, turning into a giant fish-like creature of water. In this state, Aang scoured the entire Northern City and massacred the Fire Nation's invasion force, while leaving the citizens of the Water Tribe, who bowed in worship, unharmed in a manner similar to the Passover."
    },
    {
      "body": "Princess Yue, who at birth was saved from death by the Moon Spirit, sacrificed herself to give the white koi the bit of its life force that was inside her. She became the reincarnation of Tui, the Moon Spirit, and gave Sokka one final kiss as she faded away and restored the balance of the spirit. The moon reappeared and La, the Ocean Spirit, dissipated and left Aang on a cliff. While returning to the Oasis, La attacked Admiral Zhao and dragged him into the water, killing him. After the battle, Arnook revealed to Sokka that despite all his attempts, he had known his daughter's destiny to become the incarnation of the moon spirit from the time it had given her life.",
      "links": [],
      "text": "Princess Yue, who at birth was saved from death by the Moon Spirit, sacrificed herself to give the white koi the bit of its life force that was inside her. She became the reincarnation of Tui, the Moon Spirit, and gave Sokka one final kiss as she faded away and restored the balance of the spirit. The moon reappeared and La, the Ocean Spirit, dissipated and left Aang on a cliff. While returning to the Oasis, La attacked Admiral Zhao and dragged him into the water, killing him. After the battle, Arnook revealed to Sokka that despite all his attempts, he had known his daughter's destiny to become the incarnation of the moon spirit from the time it had given her life."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Sokka_(84_AG_-_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Sokka_(84_AG_-_100_AG).html",
    "page": "History_of_Sokka_(84_AG_-_100_AG)",
    "title": "History of Sokka (84 AG – 100 AG)"
  }
}