{
  "categories": [
    {
      "body": "Azula",
      "target": {
        "href": "Category_Azula",
        "page": "Category_Azula"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "With ${link_0} finally conquered, ${link_1} returned home to await the ${link_2}'s victory after the supposed death of ${link_3} ${link_4}.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_4}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "With Ba Sing Se finally conquered, Azula returned home to await the Fire Nation's victory after the supposed death of Avatar Aang."
    },
    {
      "body": "After the ${link_0}, Azula made arrangements for her and ${link_1}'s returns to the Fire Nation. One such arrangement was passing her position as ruler of Ba Sing Se over to ${link_2}, whom she viewed as the perfect person to leave in her stead, dubbing the former tour guide Supreme Bureaucratic Administrator. Azula refused a reluctant Zuko's choice to remain in Ba Sing Se. Gathering ${link_3}, the ${link_4} schemed to use ${link_5} and Zuko's mutual childhood crushes to entice her brother's decision. With the false report of a meeting with ${link_6} Liang, she set the two up on a Fire Nation-themed dinner date, featuring the ${link_7} agents serving as waiters. However, the ruse was uncovered when Zuko overheard Azula and Ty Lee giggling in the nearby bushes. The princess attempted to catch herself, claiming that she was just telling Ty Lee to stop messing around in the bushes. Neither Zuko nor Mai bought into the tale and they left off on a private walk around Ba Sing Se.",
      "links": [
        {
          "body": "fall of Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Joo Dee",
          "key": "${link_2}",
          "target": {
            "href": "Joo_Dee",
            "page": "Joo_Dee"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_3}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "princess",
          "key": "${link_4}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Mai",
          "key": "${link_5}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Admiral",
          "key": "${link_6}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_7}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "After the fall of Ba Sing Se, Azula made arrangements for her and Zuko's returns to the Fire Nation. One such arrangement was passing her position as ruler of Ba Sing Se over to Joo Dee, whom she viewed as the perfect person to leave in her stead, dubbing the former tour guide Supreme Bureaucratic Administrator. Azula refused a reluctant Zuko's choice to remain in Ba Sing Se. Gathering Ty Lee, the princess schemed to use Mai and Zuko's mutual childhood crushes to entice her brother's decision. With the false report of a meeting with Admiral Liang, she set the two up on a Fire Nation-themed dinner date, featuring the Dai Li agents serving as waiters. However, the ruse was uncovered when Zuko overheard Azula and Ty Lee giggling in the nearby bushes. The princess attempted to catch herself, claiming that she was just telling Ty Lee to stop messing around in the bushes. Neither Zuko nor Mai bought into the tale and they left off on a private walk around Ba Sing Se."
    },
    {
      "body": "The following day, while boarding the ships, Azula looked over at Zuko and Mai speaking affectionately with one another and concluded that her plan seemed to have been quite successful after all. She subsequently turned to her chained ${link_0} and wondered aloud if the prisoner would even survive the trip home. As she bade her brother farewell, Zuko suddenly made the resolve to come with them back to the Fire Nation. Azula slyly told her brother to do whatever he wanted as it was his decision.",
      "links": [
        {
          "body": "uncle",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "The following day, while boarding the ships, Azula looked over at Zuko and Mai speaking affectionately with one another and concluded that her plan seemed to have been quite successful after all. She subsequently turned to her chained uncle and wondered aloud if the prisoner would even survive the trip home. As she bade her brother farewell, Zuko suddenly made the resolve to come with them back to the Fire Nation. Azula slyly told her brother to do whatever he wanted as it was his decision."
    },
    {
      "body": "${link_0} casually and mockingly implying to ${link_1} that she only gave him credit for defeating the ${link_2} because she suspects he might have survived.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Azula casually and mockingly implying to Zuko that she only gave him credit for defeating the Avatar because she suspects he might have survived."
    },
    {
      "body": "Azula and Zuko returned home, and both were welcomed with open arms by the people during a rally held in their honor, praising their successful efforts at the ${link_0} capital. Later, at the old ${link_1} pond, Azula and Zuko conversed about Zuko's long-awaited meeting with ${link_2}. Zuko was anxious not only about the upcoming audience, but also that he must return to his father without the Avatar. Azula shrugged it off, once again restating her position that the debt was repaid by the Avatar being dead. Zuko was hesitant to agree, prompting Azula to ask if he believed the Avatar somehow survived. Zuko agreed with Azula, who momentarily stared at him. Azula, however, appeared to disregard it and simply walked away.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "turtle duck",
          "key": "${link_1}",
          "target": {
            "href": "Turtle_duck",
            "page": "Turtle_duck"
          }
        },
        {
          "body": "their father",
          "key": "${link_2}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Azula and Zuko returned home, and both were welcomed with open arms by the people during a rally held in their honor, praising their successful efforts at the Earth Kingdom capital. Later, at the old turtle duck pond, Azula and Zuko conversed about Zuko's long-awaited meeting with their father. Zuko was anxious not only about the upcoming audience, but also that he must return to his father without the Avatar. Azula shrugged it off, once again restating her position that the debt was repaid by the Avatar being dead. Zuko was hesitant to agree, prompting Azula to ask if he believed the Avatar somehow survived. Zuko agreed with Azula, who momentarily stared at him. Azula, however, appeared to disregard it and simply walked away."
    },
    {
      "body": "When Zuko at last met his father, it was revealed that Azula misinformed Ozai that he was the one who killed the Avatar rather than herself. Perplexed, Zuko immediately went to Azula's chamber to question her actions. Azula claimed that she saw how worried Zuko was about not having captured the Avatar and decided to give him the credit for his demise out of a generous gesture to repay his aid in the takeover of Ba Sing Se. Zuko refused to believe her explanation, accusing her of retaining an ulterior motive. Azula nonchalantly pointed out how letting him have all the glory for slaying the Avatar could do little to benefit her, but insidiously acknowledged the fact that should it be discovered that the Avatar was indeed alive, all that glory would swiftly turn into shame and foolishness. She assured Zuko that he has nothing to worry about, as he already said himself that there was no way the Avatar could have survived. In essence, she was using Zuko as a scapegoat. With that, the princess bid her deeply incensed brother goodnight.",
      "links": [],
      "text": "When Zuko at last met his father, it was revealed that Azula misinformed Ozai that he was the one who killed the Avatar rather than herself. Perplexed, Zuko immediately went to Azula's chamber to question her actions. Azula claimed that she saw how worried Zuko was about not having captured the Avatar and decided to give him the credit for his demise out of a generous gesture to repay his aid in the takeover of Ba Sing Se. Zuko refused to believe her explanation, accusing her of retaining an ulterior motive. Azula nonchalantly pointed out how letting him have all the glory for slaying the Avatar could do little to benefit her, but insidiously acknowledged the fact that should it be discovered that the Avatar was indeed alive, all that glory would swiftly turn into shame and foolishness. She assured Zuko that he has nothing to worry about, as he already said himself that there was no way the Avatar could have survived. In essence, she was using Zuko as a scapegoat. With that, the princess bid her deeply incensed brother goodnight."
    },
    {
      "body": "While on a romantic picnic together, Zuko and Mai were abruptly interrupted by Azula, who wished to speak with her brother privately. She sent Mai off by telling her that Ty Lee needed help untying her braid. Mai left the two alone, but shot a poisonous glare at the princess as she walked away. When alone, Azula told Zuko of her awareness that he had been to see Uncle Iroh, branded a traitor, in his prison cell. Instead of threatening or manipulating Zuko, however, she simply stated that she was looking out for him and warned him that his visits could arouse suspicion among civilians and casually told him to watch his actions.",
      "links": [],
      "text": "While on a romantic picnic together, Zuko and Mai were abruptly interrupted by Azula, who wished to speak with her brother privately. She sent Mai off by telling her that Ty Lee needed help untying her braid. Mai left the two alone, but shot a poisonous glare at the princess as she walked away. When alone, Azula told Zuko of her awareness that he had been to see Uncle Iroh, branded a traitor, in his prison cell. Instead of threatening or manipulating Zuko, however, she simply stated that she was looking out for him and warned him that his visits could arouse suspicion among civilians and casually told him to watch his actions."
    },
    {
      "body": "${link_0}'s obsessive and overbearing behavior extending even to her leisure time.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Azula's obsessive and overbearing behavior extending even to her leisure time."
    },
    {
      "body": "Azula, Mai, Ty Lee and Zuko all traveled to ${link_0} for a brief vacation while the ${link_1} conferred with his advisers in private. Azula took advantage of this opportunity to experience life as a normal person for the very first time, choosing to keep her and Zuko's true identity a secret. At the beach, ${link_2} and his friend, ${link_3}, were impressed by Ty Lee and Mai and decided to invite the two to a party at Chan's house. Azula promptly interrupted Chan, insisting that she and Zuko be invited as well to which Chan reluctantly agreed. When Azula and the others arrived at his house, she mentioned that his \"sharp\" outfit was so sharp that it could \"puncture the hull of an ${link_4}, leaving thousands to drown at sea.\" This \"compliment\" was bizarre to Chan and he awkwardly thanked her. Later, after shooting down Ty Lee, she confided in her old friend that she was jealous of all the attention Ty Lee was getting and needed help talking to boys. After a very short and awkward lesson, Azula insisted that Chan give her a tour of the house. He led her out onto the deck and started making a few jokes, at which Azula laughed. Chan moved in and kissed Azula, calling her pretty to which she replied, \"Together, you and I will be the strongest couple in the entire world! We will dominate the earth!\" This statement was coupled with a small display of her unique blue flames. A startled Chan promptly made an excuse to leave, which left Azula disappointed.",
      "links": [
        {
          "body": "Ember Island",
          "key": "${link_0}",
          "target": {
            "href": "Ember_Island",
            "page": "Ember_Island"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Chan",
          "key": "${link_2}",
          "target": {
            "href": "Chan",
            "page": "Chan"
          }
        },
        {
          "body": "Ruon-Jian",
          "key": "${link_3}",
          "target": {
            "href": "Ruon-Jian",
            "page": "Ruon-Jian"
          }
        },
        {
          "body": "empire-class battleship",
          "key": "${link_4}",
          "target": {
            "href": "Empire-class_battleship",
            "page": "Empire-class_battleship"
          }
        }
      ],
      "text": "Azula, Mai, Ty Lee and Zuko all traveled to Ember Island for a brief vacation while the Fire Lord conferred with his advisers in private. Azula took advantage of this opportunity to experience life as a normal person for the very first time, choosing to keep her and Zuko's true identity a secret. At the beach, Chan and his friend, Ruon-Jian, were impressed by Ty Lee and Mai and decided to invite the two to a party at Chan's house. Azula promptly interrupted Chan, insisting that she and Zuko be invited as well to which Chan reluctantly agreed. When Azula and the others arrived at his house, she mentioned that his \"sharp\" outfit was so sharp that it could \"puncture the hull of an empire-class battleship, leaving thousands to drown at sea.\" This \"compliment\" was bizarre to Chan and he awkwardly thanked her. Later, after shooting down Ty Lee, she confided in her old friend that she was jealous of all the attention Ty Lee was getting and needed help talking to boys. After a very short and awkward lesson, Azula insisted that Chan give her a tour of the house. He led her out onto the deck and started making a few jokes, at which Azula laughed. Chan moved in and kissed Azula, calling her pretty to which she replied, \"Together, you and I will be the strongest couple in the entire world! We will dominate the earth!\" This statement was coupled with a small display of her unique blue flames. A startled Chan promptly made an excuse to leave, which left Azula disappointed."
    },
    {
      "body": "${link_0} killing her romance with ${link_1} with her power-hungry ambition.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Chan",
          "key": "${link_1}",
          "target": {
            "href": "Chan",
            "page": "Chan"
          }
        }
      ],
      "text": "Azula killing her romance with Chan with her power-hungry ambition."
    },
    {
      "body": "Later, Azula played the role of interpreter as the group took turns telling stories which provided deep insight about how their lives had been. When her turn came, Azula stated she did not have a pathetic \"sob story.\" However, she did softly admit that she was aware that ${link_0} loved Zuko more and thought she was a monster. After a moment of silence, she callously added that although her mother was right, it still hurt. It was later hinted that Azula harbored repressed feelings of rage toward her mother for this. For the first time, she was seen as almost completely vulnerable and almost seemed to have resigned herself to what she was in the absence of her mother. As a testament of their special day, Azula proceeded to lead the others into disrupting the party and trashing Chan's home.",
      "links": [
        {
          "body": "her mother",
          "key": "${link_0}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        }
      ],
      "text": "Later, Azula played the role of interpreter as the group took turns telling stories which provided deep insight about how their lives had been. When her turn came, Azula stated she did not have a pathetic \"sob story.\" However, she did softly admit that she was aware that her mother loved Zuko more and thought she was a monster. After a moment of silence, she callously added that although her mother was right, it still hurt. It was later hinted that Azula harbored repressed feelings of rage toward her mother for this. For the first time, she was seen as almost completely vulnerable and almost seemed to have resigned herself to what she was in the absence of her mother. As a testament of their special day, Azula proceeded to lead the others into disrupting the party and trashing Chan's home."
    },
    {
      "body": "Azula spent much of the rest of the weekend at the Ember Island Arcade, beating younger children at the new mechanical fighting game called ${link_0}. When Zuko and Mai wandered by, Azula dragged her brother into playing, ${link_1} to activate a secret super-move for her figure. When Zuko tried the same trick himself, however, he ended up overdoing it and blowing up the game, forcing the four kids to find some other form of entertainment and leaving the game's owner horrified.",
      "links": [
        {
          "body": "Street Bender",
          "key": "${link_0}",
          "target": {
            "href": "Recreation_in_the_World_of_Avatar#Street_Bender",
            "page": "Recreation_in_the_World_of_Avatar"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Azula spent much of the rest of the weekend at the Ember Island Arcade, beating younger children at the new mechanical fighting game called Street Bender. When Zuko and Mai wandered by, Azula dragged her brother into playing, firebending to activate a secret super-move for her figure. When Zuko tried the same trick himself, however, he ended up overdoing it and blowing up the game, forcing the four kids to find some other form of entertainment and leaving the game's owner horrified."
    },
    {
      "body": "Azula, along with her father, brother, and all the high-ranking military officials in the Fire Nation, attended an important all-day war meeting. It was later revealed that at that meeting, Azula was the one who suggested burning the entire Earth Kingdom to ashes, using the power of ${link_0}, a plan that Ozai readily adopted, much to Zuko's dismay.",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "text": "Azula, along with her father, brother, and all the high-ranking military officials in the Fire Nation, attended an important all-day war meeting. It was later revealed that at that meeting, Azula was the one who suggested burning the entire Earth Kingdom to ashes, using the power of Sozin's Comet, a plan that Ozai readily adopted, much to Zuko's dismay."
    },
    {
      "body": "${link_0} presenting her trump cards to make up for her ${link_1}: two ${link_2} agents.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "disabled firebending",
          "key": "${link_1}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_2}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "Azula presenting her trump cards to make up for her disabled firebending: two Dai Li agents."
    },
    {
      "body": "Just as the solar eclipse began, when ${link_0}, ${link_1}, and ${link_2} managed to locate and burst into the Fire Lord's underground room, they were confounded to find Azula instead. Not surprised by Aang's arrival, she revealed that she had not only had a hunch Aang was still alive, but she had also known about the invasion for months and was fully prepared to face and delay the attackers. Azula commanded two Dai Li agents she brought from Ba Sing Se to attack the trio while she ran away, closely pursued by Aang, Sokka and Toph. Once the agents had been defeated and Azula was cornered, Sokka realized that she was merely wasting their time. He urged the others to forget her in favor of searching for Ozai. As they started to leave, Azula mentioned ${link_3} to Sokka, stating that she gave up the hope of him ever rescuing her from her imprisonment. This revelation prompted Sokka to charge at her in blind rage. Azula pulled out a shuriken, but Toph sensed it and pinned her to the wall. Sokka furiously demanded to know where Suki was while Azula simply remained silent. When the eclipse ended, Azula broke her restraints and coyly informed the trio of Ozai's precise location before running down the hall. As the invasion drew to a close, the princess was shown observing the Avatar and his friends escape aboard ${link_4} from her ${link_5}. However, she chose not to pursue them, knowing that they were too fast and that sooner or later, they would be back.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_2}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Suki",
          "key": "${link_3}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Appa",
          "key": "${link_4}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "airship",
          "key": "${link_5}",
          "target": {
            "href": "Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        }
      ],
      "text": "Just as the solar eclipse began, when Aang, Toph, and Sokka managed to locate and burst into the Fire Lord's underground room, they were confounded to find Azula instead. Not surprised by Aang's arrival, she revealed that she had not only had a hunch Aang was still alive, but she had also known about the invasion for months and was fully prepared to face and delay the attackers. Azula commanded two Dai Li agents she brought from Ba Sing Se to attack the trio while she ran away, closely pursued by Aang, Sokka and Toph. Once the agents had been defeated and Azula was cornered, Sokka realized that she was merely wasting their time. He urged the others to forget her in favor of searching for Ozai. As they started to leave, Azula mentioned Suki to Sokka, stating that she gave up the hope of him ever rescuing her from her imprisonment. This revelation prompted Sokka to charge at her in blind rage. Azula pulled out a shuriken, but Toph sensed it and pinned her to the wall. Sokka furiously demanded to know where Suki was while Azula simply remained silent. When the eclipse ended, Azula broke her restraints and coyly informed the trio of Ozai's precise location before running down the hall. As the invasion drew to a close, the princess was shown observing the Avatar and his friends escape aboard Appa from her airship. However, she chose not to pursue them, knowing that they were too fast and that sooner or later, they would be back."
    },
    {
      "body": "During Azula's confrontation with the group, Zuko confronted his father, Ozai, and told him that Azula lied to him by saying that Zuko killed the Avatar when in reality Azula struck him down. He revealed that the Avatar managed to survive in the end. Ironically, Ozai seemed to have pardoned his daughter for these crimes as she showed no evidence of having faced any punishment.",
      "links": [],
      "text": "During Azula's confrontation with the group, Zuko confronted his father, Ozai, and told him that Azula lied to him by saying that Zuko killed the Avatar when in reality Azula struck him down. He revealed that the Avatar managed to survive in the end. Ironically, Ozai seemed to have pardoned his daughter for these crimes as she showed no evidence of having faced any punishment."
    },
    {
      "body": "Azula arrived at the ${link_0} prison with Ty Lee and Mai, who did not accompany her, but instead visited Zuko. The princess interrupted ${link_1}'s interrogation of ${link_2} who was accused of taking part in a failed prison-escape attempt, only to inform him of his mistake: the guard was not one of the group responsible. She had her own suspicions of who was responsible for the escape plan: ${link_3}.",
      "links": [
        {
          "body": "Boiling Rock",
          "key": "${link_0}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "the warden",
          "key": "${link_1}",
          "target": {
            "href": "Warden_(Boiling_Rock)",
            "page": "Warden_(Boiling_Rock)"
          }
        },
        {
          "body": "a guard",
          "key": "${link_2}",
          "target": {
            "href": "Bully_guard",
            "page": "Bully_guard"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Azula arrived at the Boiling Rock prison with Ty Lee and Mai, who did not accompany her, but instead visited Zuko. The princess interrupted the warden's interrogation of a guard who was accused of taking part in a failed prison-escape attempt, only to inform him of his mistake: the guard was not one of the group responsible. She had her own suspicions of who was responsible for the escape plan: Team Avatar."
    },
    {
      "body": "She and Ty Lee later battled Sokka, Suki, and Zuko on one of the prison's ${link_0}, trying to keep the prisoners from escaping. While Ty Lee fought Suki, Azula took on Zuko and Sokka. Zuko managed to block her fire blasts while Sokka moved in to strike her with his ${link_1}. Despite their efforts, neither Zuko nor Sokka managed to land a solid blow. As the guards began to cut the lines and drop the gondola into the boiling lake below, she and Ty Lee back flipped onto a passing-by gondola, believing to have thwarted the escape plan. Much to her surprise and dismay, she found her friend, Mai, defeating the guards in order to save Zuko and his friends.",
      "links": [
        {
          "body": "gondolas",
          "key": "${link_0}",
          "target": {
            "href": "Gondola",
            "page": "Gondola"
          }
        },
        {
          "body": "sword",
          "key": "${link_1}",
          "target": {
            "href": "Sokka%27s_sword",
            "page": "Sokka%27s_sword"
          }
        }
      ],
      "text": "She and Ty Lee later battled Sokka, Suki, and Zuko on one of the prison's gondolas, trying to keep the prisoners from escaping. While Ty Lee fought Suki, Azula took on Zuko and Sokka. Zuko managed to block her fire blasts while Sokka moved in to strike her with his sword. Despite their efforts, neither Zuko nor Sokka managed to land a solid blow. As the guards began to cut the lines and drop the gondola into the boiling lake below, she and Ty Lee back flipped onto a passing-by gondola, believing to have thwarted the escape plan. Much to her surprise and dismay, she found her friend, Mai, defeating the guards in order to save Zuko and his friends."
    },
    {
      "body": "${link_0} seething in rage, having been betrayed by ${link_1} and ${link_2} by ${link_3}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Mai",
          "key": "${link_1}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "struck down",
          "key": "${link_2}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_3}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "text": "Azula seething in rage, having been betrayed by Mai and struck down by Ty Lee."
    },
    {
      "body": "After the battle, Azula confronted Mai, who told the princess that she had acted this way because she loved Zuko more than she feared her. The idea of an emotion she had never fully experienced, being stronger than her ability to instill fear and control, sent Azula over the edge. As the tension rose, Azula and Mai prepared to fight until Azula was incapacitated when Ty Lee suddenly blocked off two of her ${link_0} paths and paralyzed her, much to the surprise of all three girls. The guards came to Azula's aid, and Mai and Ty Lee were taken into custody.",
      "links": [
        {
          "body": "chi",
          "key": "${link_0}",
          "target": {
            "href": "Chi",
            "page": "Chi"
          }
        }
      ],
      "text": "After the battle, Azula confronted Mai, who told the princess that she had acted this way because she loved Zuko more than she feared her. The idea of an emotion she had never fully experienced, being stronger than her ability to instill fear and control, sent Azula over the edge. As the tension rose, Azula and Mai prepared to fight until Azula was incapacitated when Ty Lee suddenly blocked off two of her chi paths and paralyzed her, much to the surprise of all three girls. The guards came to Azula's aid, and Mai and Ty Lee were taken into custody."
    },
    {
      "body": "This event, however, marked an important turning point in Azula's life, because following the betrayal by her friends, she never displayed her cold merciless precision and clarity of mind again. She became gradually more and more paranoid, eventually banishing nearly every one of her loyal courtiers for a number of imagined slights as she was about to be crowned as Fire Lord in her father's stead.",
      "links": [],
      "text": "This event, however, marked an important turning point in Azula's life, because following the betrayal by her friends, she never displayed her cold merciless precision and clarity of mind again. She became gradually more and more paranoid, eventually banishing nearly every one of her loyal courtiers for a number of imagined slights as she was about to be crowned as Fire Lord in her father's stead."
    },
    {
      "body": "${link_0} leading the attack on the ${link_1}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_1}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "text": "Azula leading the attack on the Western Air Temple."
    },
    {
      "body": "A few days after her defeat at the Boiling Rock, Azula tracked Zuko and Sokka down to the ${link_0}. She attacked with a full fleet of airships, intent on killing Zuko, claiming to be celebrating becoming an only child. Zuko attacked, creating a diversion while Aang and the others escaped. As the battle progressed, Zuko and Azula seemed evenly matched until the fight was abruptly ended when their flaming fists met one another, resulting in an explosion. They were both thrown backward off the airship. Zuko was saved from falling to his death by Appa and Team Avatar while Azula propelled herself to safety by firebending and, using her hairclip, latched onto the nearby cliff-side.",
      "links": [
        {
          "body": "Western Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "text": "A few days after her defeat at the Boiling Rock, Azula tracked Zuko and Sokka down to the Western Air Temple. She attacked with a full fleet of airships, intent on killing Zuko, claiming to be celebrating becoming an only child. Zuko attacked, creating a diversion while Aang and the others escaped. As the battle progressed, Zuko and Azula seemed evenly matched until the fight was abruptly ended when their flaming fists met one another, resulting in an explosion. They were both thrown backward off the airship. Zuko was saved from falling to his death by Appa and Team Avatar while Azula propelled herself to safety by firebending and, using her hairclip, latched onto the nearby cliff-side."
    },
    {
      "body": "${link_0} hallucinating a confrontation with ${link_1} with a weakened mentality due to the course of events.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "her mother",
          "key": "${link_1}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        }
      ],
      "text": "Azula hallucinating a confrontation with her mother with a weakened mentality due to the course of events."
    },
    {
      "body": "When Ozai crowned himself ${link_0}, he appointed Azula to be the new Fire Lord after a short discussion in which Azula felt he was looking down on her in the same way he did to Zuko. Azula, however, had already begun to lose her grip on reality, and her father not wanting her with him only made it worse. She began banishing her subjects out of fear and paranoia, including ${link_1} for leaving a pit in one of her cherries, which she took as a crime against her life. She later banished the Dai Li for taking five minutes to arrive after being summoned and the ${link_2} for their potential to betray her. When ${link_3} confronted the princess on her well being, she became enraged and ordered the twins to fight an ${link_4}. When Lo and Li said they could not because they were not firebenders, Azula banished Lo while pointing at Li, confusing them as to who was banished. With all her subjects banished, she attempted to fix her hair herself. Instead, however, she cut off a large portion of her trademark bangs. It also appeared that she was not sleeping well, as she had dark circles under her eyes by this point, possibly afraid someone might kill her while sleeping. She was haunted by a hallucination of her mother. In her hallucination, her mother showed sorrow as her daughter was, in her mind, confused. After Ursa told Azula she loved her, Azula threw her hairbrush at her mirror in a fit of emotional rage, ending the hallucination. Azula subsequently fell to her knees, bitterly sobbing to herself.",
      "links": [
        {
          "body": "Phoenix King",
          "key": "${link_0}",
          "target": {
            "href": "Phoenix_King",
            "page": "Phoenix_King"
          }
        },
        {
          "body": "a servant",
          "key": "${link_1}",
          "target": {
            "href": "Banished_servant",
            "page": "Banished_servant"
          }
        },
        {
          "body": "Imperial Firebenders",
          "key": "${link_2}",
          "target": {
            "href": "Royal_Procession",
            "page": "Royal_Procession"
          }
        },
        {
          "body": "Lo and Li",
          "key": "${link_3}",
          "target": {
            "href": "Lo_and_Li",
            "page": "Lo_and_Li"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_4}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        }
      ],
      "text": "When Ozai crowned himself Phoenix King, he appointed Azula to be the new Fire Lord after a short discussion in which Azula felt he was looking down on her in the same way he did to Zuko. Azula, however, had already begun to lose her grip on reality, and her father not wanting her with him only made it worse. She began banishing her subjects out of fear and paranoia, including a servant for leaving a pit in one of her cherries, which she took as a crime against her life. She later banished the Dai Li for taking five minutes to arrive after being summoned and the Imperial Firebenders for their potential to betray her. When Lo and Li confronted the princess on her well being, she became enraged and ordered the twins to fight an Agni Kai. When Lo and Li said they could not because they were not firebenders, Azula banished Lo while pointing at Li, confusing them as to who was banished. With all her subjects banished, she attempted to fix her hair herself. Instead, however, she cut off a large portion of her trademark bangs. It also appeared that she was not sleeping well, as she had dark circles under her eyes by this point, possibly afraid someone might kill her while sleeping. She was haunted by a hallucination of her mother. In her hallucination, her mother showed sorrow as her daughter was, in her mind, confused. After Ursa told Azula she loved her, Azula threw her hairbrush at her mirror in a fit of emotional rage, ending the hallucination. Azula subsequently fell to her knees, bitterly sobbing to herself."
    },
    {
      "body": "${link_0} ${link_1} at ${link_2} to gain an advantage during her ${link_3} against ${link_4}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "firing lightning",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Comet-Enhanced Agni Kai",
          "key": "${link_3}",
          "target": {
            "href": "Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_4}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Azula firing lightning at Katara to gain an advantage during her Comet-Enhanced Agni Kai against Zuko."
    },
    {
      "body": "Her coronation, without the Fire Nation subjects and only the ${link_0} that were present, was interrupted by her brother and ${link_1}. When Zuko proclaimed that he would be Fire Lord, Azula challenged Zuko to an ${link_2} which Zuko accepted, noticing that something was off about her. At first, they seemed to be evenly matched, but as Azula continued to slip into insanity, she began to wear herself out. Zuko managed to strike her down despite her enraged and advanced moves. Seeing Azula growing frustrated, Zuko taunted her, declaring she was afraid to hit him with lightning. Azula took the bait, shouting, \"I'll show you lightning!\" She generated a dangerous amount of lightning and prepared to fire it at Zuko, but realized Katara was vulnerable and shot the bolt at her instead. Zuko intervened her attack and took the lightning bolt head-on, trying to redirect it in mid-air. Even though he succeeded, some of it still remained in his body, seriously harming him and removing him from the fight.",
      "links": [
        {
          "body": "Fire Sages",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_2}",
          "target": {
            "href": "Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        }
      ],
      "text": "Her coronation, without the Fire Nation subjects and only the Fire Sages that were present, was interrupted by her brother and Katara. When Zuko proclaimed that he would be Fire Lord, Azula challenged Zuko to an Agni Kai which Zuko accepted, noticing that something was off about her. At first, they seemed to be evenly matched, but as Azula continued to slip into insanity, she began to wear herself out. Zuko managed to strike her down despite her enraged and advanced moves. Seeing Azula growing frustrated, Zuko taunted her, declaring she was afraid to hit him with lightning. Azula took the bait, shouting, \"I'll show you lightning!\" She generated a dangerous amount of lightning and prepared to fire it at Zuko, but realized Katara was vulnerable and shot the bolt at her instead. Zuko intervened her attack and took the lightning bolt head-on, trying to redirect it in mid-air. Even though he succeeded, some of it still remained in his body, seriously harming him and removing him from the fight."
    },
    {
      "body": "${link_0} crying in despair as her state of mind crumbles upon her defeat.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Azula crying in despair as her state of mind crumbles upon her defeat."
    },
    {
      "body": "Azula quickly moved on to Katara, who was distraught over Zuko's injury. Azula did her best to keep Katara away from any water and frequently insulted the duo, calling her a filthy peasant and saying, \"Zuzu, you don't look so good.\" Katara eventually immobilized her in a frozen splash of water from an underground canal and used the opportunity to chain her to the floor. When Azula saw her brother stand after Katara's healing, she finally cracked. She began to breathe fire in a fit of rage while rolling around the floor, screaming and crying uncontrollably. Reduced to this feral state, she was completely lost within her own madness. She was no longer the composed, calculated, and methodical princess she once was, having suffered a complete mental breakdown.",
      "links": [],
      "text": "Azula quickly moved on to Katara, who was distraught over Zuko's injury. Azula did her best to keep Katara away from any water and frequently insulted the duo, calling her a filthy peasant and saying, \"Zuzu, you don't look so good.\" Katara eventually immobilized her in a frozen splash of water from an underground canal and used the opportunity to chain her to the floor. When Azula saw her brother stand after Katara's healing, she finally cracked. She began to breathe fire in a fit of rage while rolling around the floor, screaming and crying uncontrollably. Reduced to this feral state, she was completely lost within her own madness. She was no longer the composed, calculated, and methodical princess she once was, having suffered a complete mental breakdown."
    },
    {
      "body": "After her Agni Kai, Azula was transferred to a mental health facility on a nearby island where she was continuously monitored.",
      "links": [],
      "text": "After her Agni Kai, Azula was transferred to a mental health facility on a nearby island where she was continuously monitored."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Azula_(Summer_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Azula_(Summer_100_AG).html",
    "page": "History_of_Azula_(Summer_100_AG)",
    "title": "History of Azula (Summer 100 AG)"
  }
}