{
  "categories": [
    {
      "body": "Zuko",
      "target": {
        "href": "Category_Zuko",
        "page": "Category_Zuko"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "After being branded as traitors, ${link_0} and his uncle ${link_1} were forced to live as fugitives in the ${link_2}. Together, they traveled to ${link_3} in the hopes of being able to live among the numerous other refugees. While there, however, they encountered Zuko's sister, ${link_4}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Azula",
          "key": "${link_4}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "After being branded as traitors, Zuko and his uncle Iroh were forced to live as fugitives in the Earth Kingdom. Together, they traveled to Ba Sing Se in the hopes of being able to live among the numerous other refugees. While there, however, they encountered Zuko's sister, Azula."
    },
    {
      "body": "${link_0} deceived ${link_1} regarding ${link_2}'s true motives for allowing the ${link_3} to return home.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_2}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "prince",
          "key": "${link_3}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "text": "Azula deceived Zuko regarding Ozai's true motives for allowing the prince to return home."
    },
    {
      "body": "Zuko and Iroh reached a ${link_0} ${link_1}, where Iroh received a massage, while Zuko brooded over the three-year anniversary of his banishment. He expressed his desire to fulfill his goal of capturing the ${link_2} and regaining his honor, the throne, and his ${link_3}'s respect. Iroh tried to console him, saying, \"Why would he banish you if he didn't care?\" but to no avail.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "village resort",
          "key": "${link_1}",
          "target": {
            "href": "Village_resort",
            "page": "Village_resort"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "father",
          "key": "${link_3}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Zuko and Iroh reached a Fire Nation village resort, where Iroh received a massage, while Zuko brooded over the three-year anniversary of his banishment. He expressed his desire to fulfill his goal of capturing the Avatar and regaining his honor, the throne, and his father's respect. Iroh tried to console him, saying, \"Why would he banish you if he didn't care?\" but to no avail."
    },
    {
      "body": "Upon returning to their place of stay, the two found Azula waiting for them. They exchanged cold greetings, in which Azula mocked Zuko with jibes about becoming uncivilized and called him \"Zuzu\". Azula informed them that Ozai had heard of plans to overthrow him, and intended to surround himself with the only people he could trust, his family. She told Zuko that their father regretted his banishment, and wished for him to come home, news that shocked Zuko. Azula left, giving him time to mull it over.",
      "links": [],
      "text": "Upon returning to their place of stay, the two found Azula waiting for them. They exchanged cold greetings, in which Azula mocked Zuko with jibes about becoming uncivilized and called him \"Zuzu\". Azula informed them that Ozai had heard of plans to overthrow him, and intended to surround himself with the only people he could trust, his family. She told Zuko that their father regretted his banishment, and wished for him to come home, news that shocked Zuko. Azula left, giving him time to mull it over."
    },
    {
      "body": "Zuko believed his sister, and was ecstatic at the prospect of going home. Iroh, however, remained skeptical, as he had never known Ozai to forgive anyone. Zuko insisted that his father truly cared about him, but Iroh suspected that the invitation to return home was fraudulent. Zuko grew angry, calling him lazy, selfish, and jealous, and stormed off.",
      "links": [],
      "text": "Zuko believed his sister, and was ecstatic at the prospect of going home. Iroh, however, remained skeptical, as he had never known Ozai to forgive anyone. Zuko insisted that his father truly cared about him, but Iroh suspected that the invitation to return home was fraudulent. Zuko grew angry, calling him lazy, selfish, and jealous, and stormed off."
    },
    {
      "body": "${link_0} fought ${link_1} after discovering the truth about his sister's trip.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Zuko fought Azula after discovering the truth about his sister's trip."
    },
    {
      "body": "The next morning, Zuko proceeded to meet Azula alone when he was suddenly approached by Iroh; the retired general had ultimately chosen to accompany Zuko, although he remained somewhat suspicious. When they arrived at the harbor where Azula's ship was docked, Azula welcomed both of them warmly. Her treachery, however, was revealed when her ${link_0} referred to them as \"prisoners\". There was momentary silence at this revelation before Iroh sprang into action and began fighting her guards. Zuko threw the captain overboard and yelled at his sister for lying to him. Azula just sneered at him, and two of her guards attacked him. He defeated them easily, and took a stance against the princess. He created two fire daggers, and attacked her, and Azula fought him off with her hand-to-hand skills, twisting his arms out of her way and using his weight to manipulate his movements. When she finally gained the high ground on a set of stairs, Azula blasted Zuko away with a fire attack. She prepared to finish him with a ${link_1}, but Iroh interceded, ${link_2}, kicking her overboard and escaping with Zuko.",
      "links": [
        {
          "body": "ship's captain",
          "key": "${link_0}",
          "target": {
            "href": "Azula%27s_ship_captain",
            "page": "Azula%27s_ship_captain"
          }
        },
        {
          "body": "lightning attack",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "redirecting the lightning",
          "key": "${link_2}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "text": "The next morning, Zuko proceeded to meet Azula alone when he was suddenly approached by Iroh; the retired general had ultimately chosen to accompany Zuko, although he remained somewhat suspicious. When they arrived at the harbor where Azula's ship was docked, Azula welcomed both of them warmly. Her treachery, however, was revealed when her ship's captain referred to them as \"prisoners\". There was momentary silence at this revelation before Iroh sprang into action and began fighting her guards. Zuko threw the captain overboard and yelled at his sister for lying to him. Azula just sneered at him, and two of her guards attacked him. He defeated them easily, and took a stance against the princess. He created two fire daggers, and attacked her, and Azula fought him off with her hand-to-hand skills, twisting his arms out of her way and using his weight to manipulate his movements. When she finally gained the high ground on a set of stairs, Azula blasted Zuko away with a fire attack. She prepared to finish him with a lightning attack, but Iroh interceded, redirecting the lightning, kicking her overboard and escaping with Zuko."
    },
    {
      "body": "The duo ran into the forest until they came far enough away. They sat by a stream, and Zuko pulled out his ${link_0} Iroh had given him years earlier. He cut off his top-knot as a symbol of severance from his family and the Fire Nation, and gave the dagger to his uncle, who did the same. The two ran off into the countryside as fugitives.",
      "links": [
        {
          "body": "dagger",
          "key": "${link_0}",
          "target": {
            "href": "Zuko%27s_pearl-handled_dagger",
            "page": "Zuko%27s_pearl-handled_dagger"
          }
        }
      ],
      "text": "The duo ran into the forest until they came far enough away. They sat by a stream, and Zuko pulled out his dagger Iroh had given him years earlier. He cut off his top-knot as a symbol of severance from his family and the Fire Nation, and gave the dagger to his uncle, who did the same. The two ran off into the countryside as fugitives."
    },
    {
      "body": "${link_0} rebuffed ${link_1}'s attempt to touch his scar.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Song",
          "key": "${link_1}",
          "target": {
            "href": "Song",
            "page": "Song"
          }
        }
      ],
      "text": "Zuko rebuffed Song's attempt to touch his scar."
    },
    {
      "body": "Iroh and Zuko struggled to live off the land. Iroh mistakenly ingested a ${link_0}, and they were forced to seek aid from a young Earth Kingdom herbalist named ${link_1}. Song tried to reach out to Zuko repeatedly, but he rebuffed her. However, when she displayed her own burn scars caused by the Fire Nation, he seemed taken aback and dismayed. When she asked him if his father was involved in the Hundred Year War, he only replied, \"Yes, he is.\" Despite Song's compassion, as Zuko and Iroh departed, Zuko stole Song's ${link_2}, ignoring Iroh's protests.",
      "links": [
        {
          "body": "deadly plant",
          "key": "${link_0}",
          "target": {
            "href": "White_jade_bush",
            "page": "White_jade_bush"
          }
        },
        {
          "body": "Song",
          "key": "${link_1}",
          "target": {
            "href": "Song",
            "page": "Song"
          }
        },
        {
          "body": "ostrich horse",
          "key": "${link_2}",
          "target": {
            "href": "Ostrich_horse",
            "page": "Ostrich_horse"
          }
        }
      ],
      "text": "Iroh and Zuko struggled to live off the land. Iroh mistakenly ingested a deadly plant, and they were forced to seek aid from a young Earth Kingdom herbalist named Song. Song tried to reach out to Zuko repeatedly, but he rebuffed her. However, when she displayed her own burn scars caused by the Fire Nation, he seemed taken aback and dismayed. When she asked him if his father was involved in the Hundred Year War, he only replied, \"Yes, he is.\" Despite Song's compassion, as Zuko and Iroh departed, Zuko stole Song's ostrich horse, ignoring Iroh's protests."
    },
    {
      "body": "The two grew more desperate and Zuko fumed as Iroh was forced to panhandle for money. After watching Iroh being harassed by ${link_0}, Zuko once again donned the guise of the Blue Spirit and resorted to stealing from local merchants. Iroh, worried about Zuko, confronted him about his suspicious acquisitions and his honor. When he went further and pointed out that capturing the Avatar at this point would likely not improve their situation or return Zuko to his \"rightful place\" in the Fire Nation, Zuko pulled away from Iroh and walked off. When he returned, he declared that, after reflection, he decided that they no longer had anything to gain by traveling together and parted ways with Iroh.",
      "links": [
        {
          "body": "a local",
          "key": "${link_0}",
          "target": {
            "href": "Broadsword_man",
            "page": "Broadsword_man"
          }
        }
      ],
      "text": "The two grew more desperate and Zuko fumed as Iroh was forced to panhandle for money. After watching Iroh being harassed by a local, Zuko once again donned the guise of the Blue Spirit and resorted to stealing from local merchants. Iroh, worried about Zuko, confronted him about his suspicious acquisitions and his honor. When he went further and pointed out that capturing the Avatar at this point would likely not improve their situation or return Zuko to his \"rightful place\" in the Fire Nation, Zuko pulled away from Iroh and walked off. When he returned, he declared that, after reflection, he decided that they no longer had anything to gain by traveling together and parted ways with Iroh."
    },
    {
      "body": "Zuko wandered through the Earth Kingdom, passing through forbidding and uninhabited areas. Despite his worsening hunger and lack of supplies, he decided not to rob a young couple when he noticed that the ${link_0} was pregnant. Eventually, he stumbled upon a ${link_1} that was regularly harassed by a troop of unscrupulous Earth Kingdom soldiers. Zuko stood up to those soldiers, impressing a young boy named ${link_2}, who invited Zuko back to his ${link_3} for food and shelter. He spent the day helping with chores, and thinking of his own, far less happy childhood. Zuko acted as something of a substitute brother for Lee, whose ${link_4} was off fighting in the war, even giving Lee a quick lesson in how to use ${link_5} when Lee's curiosity prompted him to take them. As Zuko was preparing to leave, the Earth Kingdom soldiers rode to the house and gave the news that Lee's older brother's battalion had been captured. ${link_6} decided to join the ${link_7} to try to get his son back. Lee asked Zuko to stay and take care of them, but Zuko declined. Before leaving, Zuko gave Lee the dagger that he received from Iroh as a boy.",
      "links": [
        {
          "body": "woman",
          "key": "${link_0}",
          "target": {
            "href": "Ying",
            "page": "Ying"
          }
        },
        {
          "body": "small town",
          "key": "${link_1}",
          "target": {
            "href": "Plains_village",
            "page": "Plains_village"
          }
        },
        {
          "body": "Lee",
          "key": "${link_2}",
          "target": {
            "href": "Lee",
            "page": "Lee"
          }
        },
        {
          "body": "family's farm",
          "key": "${link_3}",
          "target": {
            "href": "Lee_Family_Pig_Farm",
            "page": "Lee_Family_Pig_Farm"
          }
        },
        {
          "body": "older brother",
          "key": "${link_4}",
          "target": {
            "href": "Sensu",
            "page": "Sensu"
          }
        },
        {
          "body": "dual broadswords",
          "key": "${link_5}",
          "target": {
            "href": "Dual_broadswords",
            "page": "Dual_broadswords"
          }
        },
        {
          "body": "Lee's father",
          "key": "${link_6}",
          "target": {
            "href": "Gansu",
            "page": "Gansu"
          }
        },
        {
          "body": "army",
          "key": "${link_7}",
          "target": {
            "href": "Military_of_the_Earth_Kingdom",
            "page": "Military_of_the_Earth_Kingdom"
          }
        }
      ],
      "text": "Zuko wandered through the Earth Kingdom, passing through forbidding and uninhabited areas. Despite his worsening hunger and lack of supplies, he decided not to rob a young couple when he noticed that the woman was pregnant. Eventually, he stumbled upon a small town that was regularly harassed by a troop of unscrupulous Earth Kingdom soldiers. Zuko stood up to those soldiers, impressing a young boy named Lee, who invited Zuko back to his family's farm for food and shelter. He spent the day helping with chores, and thinking of his own, far less happy childhood. Zuko acted as something of a substitute brother for Lee, whose older brother was off fighting in the war, even giving Lee a quick lesson in how to use dual broadswords when Lee's curiosity prompted him to take them. As Zuko was preparing to leave, the Earth Kingdom soldiers rode to the house and gave the news that Lee's older brother's battalion had been captured. Lee's father decided to join the army to try to get his son back. Lee asked Zuko to stay and take care of them, but Zuko declined. Before leaving, Zuko gave Lee the dagger that he received from Iroh as a boy."
    },
    {
      "body": "${link_0} revealed himself as a ${link_1} to a crowd of ${link_2} villagers.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebender",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Zuko revealed himself as a firebender to a crowd of Earth Kingdom villagers."
    },
    {
      "body": "After Zuko left town, ${link_0} came to him, telling him how the soldiers had come back after her husband left to harass the family and took Lee away when he threatened them with the dagger. Having no one else to turn to, she asked Zuko to save him. Zuko denounced the soldiers as common bullies and defeated most of them easily, but the ringleader was an ${link_1} and Zuko was unable to beat him using only his broadswords. After recalling ${link_2} last words to him before her disappearance, to \"never forget who you are\", Zuko firebent to save himself and announced his identity proudly to the town. He retrieved his dagger from the beaten ${link_3} and tried to give the knife to Lee, but Lee declined and claimed his hatred for Zuko due to his former alliance with the Fire Nation. Despite what he had done for them, the townspeople rejected Zuko because of his identity and he departed, alone, with his dagger.",
      "links": [
        {
          "body": "Lee's mother",
          "key": "${link_0}",
          "target": {
            "href": "Sensu",
            "page": "Sensu"
          }
        },
        {
          "body": "earthbender",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending#Notable_earthbenders",
            "page": "Earthbending"
          }
        },
        {
          "body": "his mother's",
          "key": "${link_2}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        },
        {
          "body": "ringleader",
          "key": "${link_3}",
          "target": {
            "href": "Gow",
            "page": "Gow"
          }
        }
      ],
      "text": "After Zuko left town, Lee's mother came to him, telling him how the soldiers had come back after her husband left to harass the family and took Lee away when he threatened them with the dagger. Having no one else to turn to, she asked Zuko to save him. Zuko denounced the soldiers as common bullies and defeated most of them easily, but the ringleader was an earthbender and Zuko was unable to beat him using only his broadswords. After recalling his mother's last words to him before her disappearance, to \"never forget who you are\", Zuko firebent to save himself and announced his identity proudly to the town. He retrieved his dagger from the beaten ringleader and tried to give the knife to Lee, but Lee declined and claimed his hatred for Zuko due to his former alliance with the Fire Nation. Despite what he had done for them, the townspeople rejected Zuko because of his identity and he departed, alone, with his dagger."
    },
    {
      "body": "${link_0} and ${link_1} reunited in the town of ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Tu Zin",
          "key": "${link_2}",
          "target": {
            "href": "Tu_Zin",
            "page": "Tu_Zin"
          }
        }
      ],
      "text": "Zuko and Iroh reunited in the town of Tu Zin."
    },
    {
      "body": "Zuko followed the progression of a ${link_0} belonging to Azula, who was in turn relentlessly hunting and harrying ${link_1} and company. He eventually came across Azula in a ${link_2} where she and Aang were about to face off. He assumed a fighting stance and warned his sister to leave Aang's capture to him. Not willing to budge, she prepared to battle herself. The three stood off, waiting for one to make the first attack. Eventually, Azula fired at Zuko, knocking him over. When she proceeded to attack Aang, a three-way battle ensued.",
      "links": [
        {
          "body": "tank train",
          "key": "${link_0}",
          "target": {
            "href": "Tank_train",
            "page": "Tank_train"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "deserted town",
          "key": "${link_2}",
          "target": {
            "href": "Tu_Zin",
            "page": "Tu_Zin"
          }
        }
      ],
      "text": "Zuko followed the progression of a tank train belonging to Azula, who was in turn relentlessly hunting and harrying Aang and company. He eventually came across Azula in a deserted town where she and Aang were about to face off. He assumed a fighting stance and warned his sister to leave Aang's capture to him. Not willing to budge, she prepared to battle herself. The three stood off, waiting for one to make the first attack. Eventually, Azula fired at Zuko, knocking him over. When she proceeded to attack Aang, a three-way battle ensued."
    },
    {
      "body": "Azula dominated the fight by launching many powerful attacks and keeping Aang and Zuko on the defensive. Zuko traded several fire attacks with her, and pursued her into a building, where she finally landed a knock-out blow to Zuko. After several minutes, Iroh, who had been following Zuko and watching over his nephew from afar, shook Zuko out of unconsciousness. The two of them joined Aang and his friends, who had joined him earlier. All six cornered Azula, who feigned surrender, only to attack and badly wound Iroh in a moment of distraction. Zuko, Aang, Katara, and ${link_0} each launched an elemental attack, but Azula disappeared, utilizing a clever firebending move. Zuko ran to his wounded uncle, grief-stricken. When Aang and his companions approached, he angrily demanded that they leave. Katara offered help, but Zuko launched a fire blast at them. They ran away, leaving Zuko to tend to his uncle's injuries.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Azula dominated the fight by launching many powerful attacks and keeping Aang and Zuko on the defensive. Zuko traded several fire attacks with her, and pursued her into a building, where she finally landed a knock-out blow to Zuko. After several minutes, Iroh, who had been following Zuko and watching over his nephew from afar, shook Zuko out of unconsciousness. The two of them joined Aang and his friends, who had joined him earlier. All six cornered Azula, who feigned surrender, only to attack and badly wound Iroh in a moment of distraction. Zuko, Aang, Katara, and Toph each launched an elemental attack, but Azula disappeared, utilizing a clever firebending move. Zuko ran to his wounded uncle, grief-stricken. When Aang and his companions approached, he angrily demanded that they leave. Katara offered help, but Zuko launched a fire blast at them. They ran away, leaving Zuko to tend to his uncle's injuries."
    },
    {
      "body": "${link_0} failed repeatedly in his attempts to ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "generate lightning",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        }
      ],
      "text": "Zuko failed repeatedly in his attempts to generate lightning."
    },
    {
      "body": "Zuko took Iroh to a small shack on the outskirts of the town to tend to his wound. He bandaged it and prepared tea. When Iroh woke up, Zuko explained what happened, and offered him the tea which Iroh did not like, but gracefully accepted. Aware that he would eventually encounter Azula again, Zuko appealed to his uncle for instruction in more advanced ${link_0}. He anticipated an argument, predicting that his uncle would say he should try to get along with Azula. He was surprised, however, when Iroh agreed and told him Azula was \"crazy and [needed] to go down\". They began to resume Zuko's training.",
      "links": [
        {
          "body": "firebending",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Zuko took Iroh to a small shack on the outskirts of the town to tend to his wound. He bandaged it and prepared tea. When Iroh woke up, Zuko explained what happened, and offered him the tea which Iroh did not like, but gracefully accepted. Aware that he would eventually encounter Azula again, Zuko appealed to his uncle for instruction in more advanced firebending. He anticipated an argument, predicting that his uncle would say he should try to get along with Azula. He was surprised, however, when Iroh agreed and told him Azula was \"crazy and [needed] to go down\". They began to resume Zuko's training."
    },
    {
      "body": "Iroh began teaching him about the nature of lightning. He explained that lightning required calm and peace of mind, and that it was not fueled by rage or emotion. The two of them went out to the cliff side, where Iroh explained the process more fully and demonstrated lightning generation. Zuko eagerly proclaimed he was ready to try it. When he did attempt it, however, he only created an explosion that knocked him back. He persisted, but each attempt to produce lightning just exploded in his face. When he got frustrated, Iroh explained that Zuko's emotional turmoil was preventing him from feeling the calm needed to produce lightning. He told Zuko that he would be unable to produce lightning until he got over the shame that he felt.",
      "links": [],
      "text": "Iroh began teaching him about the nature of lightning. He explained that lightning required calm and peace of mind, and that it was not fueled by rage or emotion. The two of them went out to the cliff side, where Iroh explained the process more fully and demonstrated lightning generation. Zuko eagerly proclaimed he was ready to try it. When he did attempt it, however, he only created an explosion that knocked him back. He persisted, but each attempt to produce lightning just exploded in his face. When he got frustrated, Iroh explained that Zuko's emotional turmoil was preventing him from feeling the calm needed to produce lightning. He told Zuko that he would be unable to produce lightning until he got over the shame that he felt."
    },
    {
      "body": "${link_0} learned how to ${link_1} from ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "redirect lightning",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        },
        {
          "body": "his uncle",
          "key": "${link_2}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Zuko learned how to redirect lightning from his uncle."
    },
    {
      "body": "Instead of lightning generation, Iroh offered to teach Zuko a firebending technique he himself had invented. He began the lesson by giving a lecture about each of the ${link_0}. He told Zuko that he had to draw his knowledge and power from more than one source, and that looking to other cultures and the other elements could help him become whole. When Zuko compared this to the Avatar, Iroh told him that incorporating ideas from all four nations could empower him, like the Avatar. He told Zuko that the technique he was about to teach him was one he learned by studying the ${link_1}: ${link_2}. He taught Zuko the smooth, flowing movements of waterbending, entailing absorbing and redirecting energy, necessary for the technique. Eventually, Zuko mastered it.",
      "links": [
        {
          "body": "four nations",
          "key": "${link_0}",
          "target": {
            "href": "Four_nations",
            "page": "Four_nations"
          }
        },
        {
          "body": "waterbenders",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "lightning redirection",
          "key": "${link_2}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "text": "Instead of lightning generation, Iroh offered to teach Zuko a firebending technique he himself had invented. He began the lesson by giving a lecture about each of the four nations. He told Zuko that he had to draw his knowledge and power from more than one source, and that looking to other cultures and the other elements could help him become whole. When Zuko compared this to the Avatar, Iroh told him that incorporating ideas from all four nations could empower him, like the Avatar. He told Zuko that the technique he was about to teach him was one he learned by studying the waterbenders: lightning redirection. He taught Zuko the smooth, flowing movements of waterbending, entailing absorbing and redirecting energy, necessary for the technique. Eventually, Zuko mastered it."
    },
    {
      "body": "When Iroh praised him, Zuko eagerly asked to try it out with real lightning. Iroh was shocked, and refused, even going to the extent of calling him insane. He declared that lightning was too dangerous, and that if Zuko was lucky, he would never have to use this technique. Zuko, seeing a thunderstorm in the distance, told his uncle he would find his own lightning. He climbed up a mountain in the middle of the storm, intent on accomplishing the task. He raged at the storm and the world in general when no lightning came close enough until finally, exhausted and emotionally spent, he broke down bitterly in tears.",
      "links": [],
      "text": "When Iroh praised him, Zuko eagerly asked to try it out with real lightning. Iroh was shocked, and refused, even going to the extent of calling him insane. He declared that lightning was too dangerous, and that if Zuko was lucky, he would never have to use this technique. Zuko, seeing a thunderstorm in the distance, told his uncle he would find his own lightning. He climbed up a mountain in the middle of the storm, intent on accomplishing the task. He raged at the storm and the world in general when no lightning came close enough until finally, exhausted and emotionally spent, he broke down bitterly in tears."
    },
    {
      "body": "Zuko and Iroh traveled to ${link_0} where Iroh made contact with a secret society of which he was a member: the ${link_1}. Zuko and Iroh found out that the Fire Nation had placed a large bounty on their heads when ${link_2} and Master ${link_3} tried to claim their bounties. However, the White Lotus aided them in dodging bounty hunters and garnered documentation so that Iroh and Zuko could pass into the Earth Kingdom's capital city, Ba Sing Se.",
      "links": [
        {
          "body": "a desert oasis",
          "key": "${link_0}",
          "target": {
            "href": "Misty_Palms_Oasis",
            "page": "Misty_Palms_Oasis"
          }
        },
        {
          "body": "Order of the White Lotus",
          "key": "${link_1}",
          "target": {
            "href": "Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        },
        {
          "body": "Xin Fu",
          "key": "${link_2}",
          "target": {
            "href": "Xin_Fu",
            "page": "Xin_Fu"
          }
        },
        {
          "body": "Yu",
          "key": "${link_3}",
          "target": {
            "href": "Yu",
            "page": "Yu"
          }
        }
      ],
      "text": "Zuko and Iroh traveled to a desert oasis where Iroh made contact with a secret society of which he was a member: the Order of the White Lotus. Zuko and Iroh found out that the Fire Nation had placed a large bounty on their heads when Xin Fu and Master Yu tried to claim their bounties. However, the White Lotus aided them in dodging bounty hunters and garnered documentation so that Iroh and Zuko could pass into the Earth Kingdom's capital city, Ba Sing Se."
    },
    {
      "body": "While traveling there, they encountered ${link_0}, also headed toward Ba Sing Se for a new life. Jet befriended Zuko before noticing Iroh employing subtle firebending to heat his tea. Furious, Jet became determined to expose them.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        }
      ],
      "text": "While traveling there, they encountered Jet, also headed toward Ba Sing Se for a new life. Jet befriended Zuko before noticing Iroh employing subtle firebending to heat his tea. Furious, Jet became determined to expose them."
    },
    {
      "body": "${link_0} defended himself against ${link_1} after the latter accused him of being a ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Jet",
          "key": "${link_1}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        },
        {
          "body": "firebender",
          "key": "${link_2}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Zuko defended himself against Jet after the latter accused him of being a firebender."
    },
    {
      "body": "Zuko and Iroh settled in Ba Sing Se, although Zuko remained highly displeased, having no desire to make a life in the \"prison\" that was Ba Sing Se. They both took jobs in ${link_0} as servers, and Iroh soon took it upon himself to greatly improve the quality of the local tea, which gave him a degree of fame. Meanwhile, Jet made various surreptitious attempts to prove that Zuko and Iroh were ${link_1}, albeit unsuccessfully. His frustration boiling over, Jet finally walked into the tea shop and challenged them to a fight, hoping to force one of them to firebend in self-defense. Instead brandishing dual dao swords, Zuko took up Jet's challenge and the two began an extended, even battle until the Dai Li arrived on scene. Various witnesses stated that Jet's attack on the tea shop employees was completely unprovoked, leading to Jet's arrest.",
      "links": [
        {
          "body": "a tea house",
          "key": "${link_0}",
          "target": {
            "href": "Pao_Family_Tea_House",
            "page": "Pao_Family_Tea_House"
          }
        },
        {
          "body": "firebenders",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Zuko and Iroh settled in Ba Sing Se, although Zuko remained highly displeased, having no desire to make a life in the \"prison\" that was Ba Sing Se. They both took jobs in a tea house as servers, and Iroh soon took it upon himself to greatly improve the quality of the local tea, which gave him a degree of fame. Meanwhile, Jet made various surreptitious attempts to prove that Zuko and Iroh were firebenders, albeit unsuccessfully. His frustration boiling over, Jet finally walked into the tea shop and challenged them to a fight, hoping to force one of them to firebend in self-defense. Instead brandishing dual dao swords, Zuko took up Jet's challenge and the two began an extended, even battle until the Dai Li arrived on scene. Various witnesses stated that Jet's attack on the tea shop employees was completely unprovoked, leading to Jet's arrest."
    },
    {
      "body": "Zuko remained reluctant to adapt to living in Ba Sing Se, perhaps best typified by his awkward date with ${link_0}, a young girl who was a regular customer of the tea house where he worked and who had developed a crush on Zuko. Toward the end of their date, she lightly kissed him, a gesture he reciprocated before pulling away, claiming, \"It's complicated,\" and leaving the scene. Upon arriving back at his apartment, Iroh inquired about his date; Zuko went straight into his room without answering, but after a few seconds, he cracked open the door and quietly remarked that \"it was nice\".",
      "links": [
        {
          "body": "Jin",
          "key": "${link_0}",
          "target": {
            "href": "Jin",
            "page": "Jin"
          }
        }
      ],
      "text": "Zuko remained reluctant to adapt to living in Ba Sing Se, perhaps best typified by his awkward date with Jin, a young girl who was a regular customer of the tea house where he worked and who had developed a crush on Zuko. Toward the end of their date, she lightly kissed him, a gesture he reciprocated before pulling away, claiming, \"It's complicated,\" and leaving the scene. Upon arriving back at his apartment, Iroh inquired about his date; Zuko went straight into his room without answering, but after a few seconds, he cracked open the door and quietly remarked that \"it was nice\"."
    },
    {
      "body": "${link_0} dreamt of himself with ${link_1} ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "airbender",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "tattoos",
          "key": "${link_2}",
          "target": {
            "href": "Body_markings_in_the_World_of_Avatar#Airbending_master_tattoos",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Zuko dreamt of himself with airbender tattoos."
    },
    {
      "body": "Zuko learned that Aang was in the city after seeing a flier that Aang and company had made during their search for the missing ${link_0}. Zuko decided to hunt for Appa and use him as bait for Aang. In his Blue Spirit disguise, he forced a ${link_1} agent to disclose Appa's whereabouts. He infiltrated the Dai Li's secret base beneath ${link_2} and found Appa in his cell, but was confronted by Iroh. Iroh, in an uncharacteristically sharp manner, berated Zuko's rashness, questioning the course of action the latter planned to take once he had Appa in his possession. He attempted to persuade Zuko into giving up his search for the Avatar, the destiny imposed upon him by his father, and follow his own path. Zuko cried out in agony and indecision, but decided to free Appa. When they left Lake Laogai, he threw his Blue Spirit mask into the lake.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_1}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Lake Laogai",
          "key": "${link_2}",
          "target": {
            "href": "Lake_Laogai",
            "page": "Lake_Laogai"
          }
        }
      ],
      "text": "Zuko learned that Aang was in the city after seeing a flier that Aang and company had made during their search for the missing Appa. Zuko decided to hunt for Appa and use him as bait for Aang. In his Blue Spirit disguise, he forced a Dai Li agent to disclose Appa's whereabouts. He infiltrated the Dai Li's secret base beneath Lake Laogai and found Appa in his cell, but was confronted by Iroh. Iroh, in an uncharacteristically sharp manner, berated Zuko's rashness, questioning the course of action the latter planned to take once he had Appa in his possession. He attempted to persuade Zuko into giving up his search for the Avatar, the destiny imposed upon him by his father, and follow his own path. Zuko cried out in agony and indecision, but decided to free Appa. When they left Lake Laogai, he threw his Blue Spirit mask into the lake."
    },
    {
      "body": "When Zuko and Iroh returned to ${link_0}, Zuko collapsed with a terrible fever. Iroh deduced that Zuko's great internal struggle over his future and his destiny had in effect carried over to his body. Iroh likened this period of time to a metamorphosis, and stated that in the end Zuko would emerge as the person he was truly meant to be. While suffering this illness, Zuko had a series of dreams and hallucinations; in one of them, he saw himself as the ${link_1}, without his scar, while a blue ${link_2} with Azula's voice and a red dragon with Iroh's voice gave him differing advice. He also saw images of his vanished ${link_3} begging him for help. At one point, Zuko finally seemed to awaken. He got up and splashed water on his face, only to look into a mirror and see that he had Aang's bald head and airbender tattoos. Zuko quickly woke up with a cry of horror and immediately touched the scar on his face.",
      "links": [
        {
          "body": "their apartment",
          "key": "${link_0}",
          "target": {
            "href": "Iroh_and_Zuko%27s_apartment",
            "page": "Iroh_and_Zuko%27s_apartment"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "dragon",
          "key": "${link_2}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        },
        {
          "body": "mother",
          "key": "${link_3}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        }
      ],
      "text": "When Zuko and Iroh returned to their apartment, Zuko collapsed with a terrible fever. Iroh deduced that Zuko's great internal struggle over his future and his destiny had in effect carried over to his body. Iroh likened this period of time to a metamorphosis, and stated that in the end Zuko would emerge as the person he was truly meant to be. While suffering this illness, Zuko had a series of dreams and hallucinations; in one of them, he saw himself as the Fire Lord, without his scar, while a blue dragon with Azula's voice and a red dragon with Iroh's voice gave him differing advice. He also saw images of his vanished mother begging him for help. At one point, Zuko finally seemed to awaken. He got up and splashed water on his face, only to look into a mirror and see that he had Aang's bald head and airbender tattoos. Zuko quickly woke up with a cry of horror and immediately touched the scar on his face."
    },
    {
      "body": "${link_0} and ${link_1} bonded briefly during their imprisonment in the ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Crystal Catacombs",
          "key": "${link_2}",
          "target": {
            "href": "Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        }
      ],
      "text": "Zuko and Katara bonded briefly during their imprisonment in the Crystal Catacombs."
    },
    {
      "body": "Upon recovering from his fever, Zuko displayed a more optimistic view of his life in Ba Sing Se. He was enthusiastic at the opening of Iroh's new tea shop, and at the invitation for the two of them to come to the ${link_0}'s ${link_1} to serve him tea. The invitation, however, was a trap set by Azula, who had agreed with the Dai Li to perform a ${link_2} to overthrow the Earth King. Iroh managed to flee to safety, encouraging Zuko to follow him; Zuko, however, chose to confront Azula. He challenged Azula to an ${link_3}, but Azula laughed off his challenge and had the Dai Li arrest him and imprison him in a ${link_4} with ${link_5}. There, Katara berated Zuko, who sat silently and absorbed the abuse until Katara mentioned how the Fire Nation had taken her mother away from her, something with which Zuko could sympathize and relate. This was a bonding point for the two where Katara apologized, explaining that Zuko's face had long been the face of the enemy in her mind, causing Zuko to acknowledge his scar and how it marked him. Katara offered to attempt to heal Zuko's scar and prepared to do so when Iroh and Aang arrived on scene to rescue them.",
      "links": [
        {
          "body": "Earth King",
          "key": "${link_0}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "palace",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        },
        {
          "body": "coup",
          "key": "${link_2}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_3}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        },
        {
          "body": "cave",
          "key": "${link_4}",
          "target": {
            "href": "Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        },
        {
          "body": "Katara",
          "key": "${link_5}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Upon recovering from his fever, Zuko displayed a more optimistic view of his life in Ba Sing Se. He was enthusiastic at the opening of Iroh's new tea shop, and at the invitation for the two of them to come to the Earth King's palace to serve him tea. The invitation, however, was a trap set by Azula, who had agreed with the Dai Li to perform a coup to overthrow the Earth King. Iroh managed to flee to safety, encouraging Zuko to follow him; Zuko, however, chose to confront Azula. He challenged Azula to an Agni Kai, but Azula laughed off his challenge and had the Dai Li arrest him and imprison him in a cave with Katara. There, Katara berated Zuko, who sat silently and absorbed the abuse until Katara mentioned how the Fire Nation had taken her mother away from her, something with which Zuko could sympathize and relate. This was a bonding point for the two where Katara apologized, explaining that Zuko's face had long been the face of the enemy in her mind, causing Zuko to acknowledge his scar and how it marked him. Katara offered to attempt to heal Zuko's scar and prepared to do so when Iroh and Aang arrived on scene to rescue them."
    },
    {
      "body": "${link_0} ultimately chose to ally himself with ${link_1} and fought against ${link_2} and ${link_3}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Zuko ultimately chose to ally himself with Azula and fought against Aang and Katara."
    },
    {
      "body": "Despite having seemingly changed for the better, Zuko still held a great deal of anger toward Aang; within moments, the two old adversaries nearly came to blows, until Iroh restrained Zuko, and encouraged Aang and Katara to leave and find their friends. When Katara and Aang exited the cavern, Iroh attempted to dissuade Zuko from continuing his pursuit once again. Azula arrived, accompanied by two Dai Li agents, who incapacitated Iroh in crystal. Azula sought his assistance in capturing the Avatar, claiming that joining forces with her would earn Zuko his honor and father's praise. Iroh retorted that the redemption she offered was not for him and pleaded with Zuko to seek his own destiny. When Azula left to fight Aang and Katara, Zuko later joined the battle and ultimately teamed up with Azula in attacking Aang, doing so with manic zeal. Zuko assisted his sister directly several times, freeing her from Katara's grasp at one point. When Aang was knocked into a wall by Azula, Katara was left to battle both Zuko and Azula. Katara used water shields to deflect the blasts, but the siblings quickly overpowered her, leaving her defenseless.",
      "links": [],
      "text": "Despite having seemingly changed for the better, Zuko still held a great deal of anger toward Aang; within moments, the two old adversaries nearly came to blows, until Iroh restrained Zuko, and encouraged Aang and Katara to leave and find their friends. When Katara and Aang exited the cavern, Iroh attempted to dissuade Zuko from continuing his pursuit once again. Azula arrived, accompanied by two Dai Li agents, who incapacitated Iroh in crystal. Azula sought his assistance in capturing the Avatar, claiming that joining forces with her would earn Zuko his honor and father's praise. Iroh retorted that the redemption she offered was not for him and pleaded with Zuko to seek his own destiny. When Azula left to fight Aang and Katara, Zuko later joined the battle and ultimately teamed up with Azula in attacking Aang, doing so with manic zeal. Zuko assisted his sister directly several times, freeing her from Katara's grasp at one point. When Aang was knocked into a wall by Azula, Katara was left to battle both Zuko and Azula. Katara used water shields to deflect the blasts, but the siblings quickly overpowered her, leaving her defenseless."
    },
    {
      "body": "At the end of the battle, following Aang's fatal injury from Azula's lightning fire, Iroh arrived on the scene and covered Katara and Aang's escape; he held off the siblings and scored off Dai Li agents until they had safely exited the cavern. Iroh subsequently let himself be captured; Azula and Zuko triumphantly returned to the Earth King's palace. Growing uncertain once more, Zuko questioned his actions and expressed regret at having betrayed Iroh. Azula turned this aside, though, telling Zuko that it was Iroh who had betrayed him. She subsequently expressed confidence that Zuko had restored his own honor. Zuko, however, still appeared conflicted about his decision.",
      "links": [],
      "text": "At the end of the battle, following Aang's fatal injury from Azula's lightning fire, Iroh arrived on the scene and covered Katara and Aang's escape; he held off the siblings and scored off Dai Li agents until they had safely exited the cavern. Iroh subsequently let himself be captured; Azula and Zuko triumphantly returned to the Earth King's palace. Growing uncertain once more, Zuko questioned his actions and expressed regret at having betrayed Iroh. Azula turned this aside, though, telling Zuko that it was Iroh who had betrayed him. She subsequently expressed confidence that Zuko had restored his own honor. Zuko, however, still appeared conflicted about his decision."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Zuko_(Spring_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Zuko_(Spring_100_AG).html",
    "page": "History_of_Zuko_(Spring_100_AG)",
    "title": "History of Zuko (Spring 100 AG)"
  }
}