{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} is the youngest child of ${link_1} ${link_2} and ${link_3} and their only ${link_4} child. Trained to be an airbending master, Tenzin became ${link_5}'s bending and spiritual teacher after the new ${link_6} completed her training in the other three ${link_7}. While he had much to teach her, so did he have much to learn from the new Avatar.",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "airbending",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Korra",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "bending arts",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)"
      ],
      "text": "Tenzin is the youngest child of Avatar Aang and Katara and their only airbending child. Trained to be an airbending master, Tenzin became Korra's bending and spiritual teacher after the new Avatar completed her training in the other three bending arts. While he had much to teach her, so did he have much to learn from the new Avatar."
    },
    {
      "body": "As a child, Tenzin was often the subject of the rough games his siblings, ${link_0} and ${link_1}, liked to play with him, which even led him to be afraid of his sister, fearing that she would rough him up. However, he maintained a healthy relationship with them, and he was supportive of Kya when she revealed her sexual orientation to him.",
      "links": [
        {
          "body": "Bumi",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Kya",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kya",
            "page": "Kya"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "Early life"
      ],
      "text": "As a child, Tenzin was often the subject of the rough games his siblings, Bumi and Kya, liked to play with him, which even led him to be afraid of his sister, fearing that she would rough him up. However, he maintained a healthy relationship with them, and he was supportive of Kya when she revealed her sexual orientation to him."
    },
    {
      "body": "As the only airbender to be born in over a hundred years, Tenzin was extensively taught the traditions and customs of the Air Nomads by his father. He went on vacations with his father to locations such as ${link_0} and ${link_1} for recreational and training purposes. He eventually earned the traditional Air Nomad arrow ${link_2}, symbolizing his status as an airbending master. Tenzin also received mementos his father collected during the ${link_3}.",
      "links": [
        {
          "body": "Kyoshi Island",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "Ember Island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ember_Island",
            "page": "Ember_Island"
          }
        },
        {
          "body": "tattoos",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Body_markings_in_the_World_of_Avatar#Airbending_masters",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "Early life"
      ],
      "text": "As the only airbender to be born in over a hundred years, Tenzin was extensively taught the traditions and customs of the Air Nomads by his father. He went on vacations with his father to locations such as Kyoshi Island and Ember Island for recreational and training purposes. He eventually earned the traditional Air Nomad arrow tattoos, symbolizing his status as an airbending master. Tenzin also received mementos his father collected during the Hundred Year War."
    },
    {
      "body": "In 158 AG, after Korra's identity as the new Avatar was revealed, Tenzin joined forces with Southern ${link_0} ${link_1}, ${link_2} ${link_3}, and Korra's father, ${link_4}, to prevent a kidnapping threat forged by ${link_5}, ${link_6}, ${link_7}, and ${link_8}. They were able to defeat and apprehend the criminals and imprison them in four separate and specially-designed ${link_9} that would neutralize their combative abilities. Because of this threat, Tenzin and Tonraq decided to move Korra to the ${link_10} where she could safely train.",
      "links": [
        {
          "body": "Chief",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Ghazan",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Ghazan",
            "page": "Ghazan"
          }
        },
        {
          "body": "Ming-Hua",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Ming-Hua",
            "page": "Ming-Hua"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/P%27Li",
            "page": "P%27Li"
          }
        },
        {
          "body": "prisons",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/White_Lotus_prisons",
            "page": "White_Lotus_prisons"
          }
        },
        {
          "body": "Southern Water Tribe compound",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_compound",
            "page": "Southern_Water_Tribe_compound"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "Early life"
      ],
      "text": "In 158 AG, after Korra's identity as the new Avatar was revealed, Tenzin joined forces with Southern Chief Sokka, Fire Lord Zuko, and Korra's father, Tonraq, to prevent a kidnapping threat forged by Zaheer, Ghazan, Ming-Hua, and P'Li. They were able to defeat and apprehend the criminals and imprison them in four separate and specially-designed prisons that would neutralize their combative abilities. Because of this threat, Tenzin and Tonraq decided to move Korra to the Southern Water Tribe compound where she could safely train."
    },
    {
      "body": "Tenzin has been friends with ${link_0} since they were children, and the two of them were at one point a couple. However, their romantic relationship eventually deteriorated, partially because Tenzin wanted children while Lin did not. As their relationship was slowly falling apart, Pema approached the airbender and confessed her feelings for him, causing Tenzin to break up with Lin and start a new relationship with Pema instead. Tenzin and Pema eventually married, and by 170 AG, their family consisted of three children: two daughters, Jinora and Ikki, a son named Meelo, and a fourth child on the way. He succeeded an Air Acolyte in being the representative of the Air Nation on the United Republic Council.",
      "links": [
        {
          "body": "Lin Beifong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "Early life"
      ],
      "text": "Tenzin has been friends with Lin Beifong since they were children, and the two of them were at one point a couple. However, their romantic relationship eventually deteriorated, partially because Tenzin wanted children while Lin did not. As their relationship was slowly falling apart, Pema approached the airbender and confessed her feelings for him, causing Tenzin to break up with Lin and start a new relationship with Pema instead. Tenzin and Pema eventually married, and by 170 AG, their family consisted of three children: two daughters, Jinora and Ikki, a son named Meelo, and a fourth child on the way. He succeeded an Air Acolyte in being the representative of the Air Nation on the United Republic Council."
    },
    {
      "body": "In 170 AG, Tenzin was supposed to relocate to the ${link_0} in order to begin Avatar Korra's ${link_1}. Due to instability in Republic City at the time, Tenzin turned the Avatar down, as he had to focus on his duties as a councilman. An eager to learn Korra suggested that she join him in the city, but Tenzin promptly refused, deeming it to be too dangerous. Despite this, Korra traveled to the city as a stowaway in pursuit of him, but ran into trouble with the ${link_2}, and was arrested. Tenzin was informed of Korra's detention, and journeyed to the ${link_3} to bail her out. He managed to persuade Lin Beifong, despite her initial stubborn attitude to let the Avatar go, ensuring her that he would take full responsibility for what had happened, and cover the cost of the damage Korra had caused. As they waited to collect ${link_4}, Tenzin admonished Korra for disobeying his wishes, brushing aside her response that Katara had supported her decision, and her belief that she, as the Avatar, was needed in the city as well. Arriving back at Air Temple Island, however, Tenzin informed Korra that he had come to realize she was right, and that the city indeed needed its Avatar once more. Much to Korra's delight, he invited her to stay with him on the island and begin her airbending training.",
      "links": [
        {
          "body": "Southern Water Tribe",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "airbending training",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending_training",
            "page": "Airbending_training"
          }
        },
        {
          "body": "Metalbending Police Force",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "police headquarters",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Police_headquarters",
            "page": "Police_headquarters"
          }
        },
        {
          "body": "Naga",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Naga",
            "page": "Naga"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Training Avatar Korra"
      ],
      "text": "In 170 AG, Tenzin was supposed to relocate to the Southern Water Tribe in order to begin Avatar Korra's airbending training. Due to instability in Republic City at the time, Tenzin turned the Avatar down, as he had to focus on his duties as a councilman. An eager to learn Korra suggested that she join him in the city, but Tenzin promptly refused, deeming it to be too dangerous. Despite this, Korra traveled to the city as a stowaway in pursuit of him, but ran into trouble with the Metalbending Police Force, and was arrested. Tenzin was informed of Korra's detention, and journeyed to the police headquarters to bail her out. He managed to persuade Lin Beifong, despite her initial stubborn attitude to let the Avatar go, ensuring her that he would take full responsibility for what had happened, and cover the cost of the damage Korra had caused. As they waited to collect Naga, Tenzin admonished Korra for disobeying his wishes, brushing aside her response that Katara had supported her decision, and her belief that she, as the Avatar, was needed in the city as well. Arriving back at Air Temple Island, however, Tenzin informed Korra that he had come to realize she was right, and that the city indeed needed its Avatar once more. Much to Korra's delight, he invited her to stay with him on the island and begin her airbending training."
    },
    {
      "body": "The following day, Korra and Tenzin enjoyed breakfast together, during which Korra invited Tenzin to visit the ${link_0} that evening in order to catch a few ${link_1} matches. However, as a follower of the ancient ways, Tenzin dismissed the notion of pro-bending, deeming the sport to be a mockery of the noble traditions of ${link_2}. He ordered her to stay on the island, as he believed that Korra required a calm and quiet environment, free from any distractions, in order to learn airbending.",
      "links": [
        {
          "body": "Pro-bending Arena",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "pro-bending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending",
            "page": "Pro-bending"
          }
        },
        {
          "body": "bending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Training Avatar Korra"
      ],
      "text": "The following day, Korra and Tenzin enjoyed breakfast together, during which Korra invited Tenzin to visit the Pro-bending Arena that evening in order to catch a few pro-bending matches. However, as a follower of the ancient ways, Tenzin dismissed the notion of pro-bending, deeming the sport to be a mockery of the noble traditions of bending. He ordered her to stay on the island, as he believed that Korra required a calm and quiet environment, free from any distractions, in order to learn airbending."
    },
    {
      "body": "When it became time for the first lesson, Tenzin theorized that Korra's struggles to learn airbending were because the art was opposite of her hotheaded nature, and he emphasized that she just needed to be patient, as Aang too had struggled to learn the element opposite of his pacifist nature. They subsequently made their way to the temple's training area, where Tenzin tasked Korra to make her way through a series of spinning gates, instructing her to flow with the movements of her surroundings. As Jinora demonstrated how to move through the gates, Tenzin explained the fundamentals of airbending. However, when it became Korra's turn, he watched her fail miserably, as she ended up being knocked out by one of the gates.",
      "links": [],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Training Avatar Korra"
      ],
      "text": "When it became time for the first lesson, Tenzin theorized that Korra's struggles to learn airbending were because the art was opposite of her hotheaded nature, and he emphasized that she just needed to be patient, as Aang too had struggled to learn the element opposite of his pacifist nature. They subsequently made their way to the temple's training area, where Tenzin tasked Korra to make her way through a series of spinning gates, instructing her to flow with the movements of her surroundings. As Jinora demonstrated how to move through the gates, Tenzin explained the fundamentals of airbending. However, when it became Korra's turn, he watched her fail miserably, as she ended up being knocked out by one of the gates."
    },
    {
      "body": "That evening, Korra's frustration over her inability to airbend resulted in a first argument with Tenzin over the fact that she had been listening to a pro-bending match over a ${link_0}. When they started the meditation exercises the next day, Tenzin told Korra that she needed to let her mind and spirit be free, as airbending was the element of freedom. Much to his annoyance, the Avatar scoffed at his words of wisdom, accusing him of letting her be everything but free while being there on the island with him, referring back to the radio incident of the previous night. He implored her to be patient and to let his teachings sink in, though Korra got fed up with the exercise and left against Tenzin's will.",
      "links": [
        {
          "body": "radio",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Radio",
            "page": "Radio"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Training Avatar Korra"
      ],
      "text": "That evening, Korra's frustration over her inability to airbend resulted in a first argument with Tenzin over the fact that she had been listening to a pro-bending match over a radio. When they started the meditation exercises the next day, Tenzin told Korra that she needed to let her mind and spirit be free, as airbending was the element of freedom. Much to his annoyance, the Avatar scoffed at his words of wisdom, accusing him of letting her be everything but free while being there on the island with him, referring back to the radio incident of the previous night. He implored her to be patient and to let his teachings sink in, though Korra got fed up with the exercise and left against Tenzin's will."
    },
    {
      "body": "When Tenzin let Korra try to pass through the airbending gates again, he witnessed her destroy the gates with her firebending in a fit of rage over her constant failure. Shocked over the destruction of the two-thousand-year-old mechanism, he turned to Korra in frustration, getting into an argument during which Korra snapped at him, stating him to be a bad teacher. Tenzin remained behind as Korra stormed off.",
      "links": [],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Training Avatar Korra"
      ],
      "text": "When Tenzin let Korra try to pass through the airbending gates again, he witnessed her destroy the gates with her firebending in a fit of rage over her constant failure. Shocked over the destruction of the two-thousand-year-old mechanism, he turned to Korra in frustration, getting into an argument during which Korra snapped at him, stating him to be a bad teacher. Tenzin remained behind as Korra stormed off."
    },
    {
      "body": "Hours later, when he was looking for Korra, he discovered that she was at a pro-bending match through a radio broadcast. Angered, he went to the arena to retrieve her, but Korra again refused. They got into another argument over the necessity of airbending and the purpose of the Avatar. As Korra walked off to participate in the third round of her match, Tenzin stayed, witnessing how she finally demonstrated airbending movements while dodging attacks from her opponents, rallying her team to win the match. Ecstatic about the development, Tenzin cheered the team on, though immediately calmed himself after realizing what he just did.",
      "links": [],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Training Avatar Korra"
      ],
      "text": "Hours later, when he was looking for Korra, he discovered that she was at a pro-bending match through a radio broadcast. Angered, he went to the arena to retrieve her, but Korra again refused. They got into another argument over the necessity of airbending and the purpose of the Avatar. As Korra walked off to participate in the third round of her match, Tenzin stayed, witnessing how she finally demonstrated airbending movements while dodging attacks from her opponents, rallying her team to win the match. Ecstatic about the development, Tenzin cheered the team on, though immediately calmed himself after realizing what he just did."
    },
    {
      "body": "After the match, Tenzin returned to the island to oversee the repair of the airbending gates. When Korra came and apologized for taking out her frustrations on him, Tenzin apologized too, stating that while he was teaching her patience, he lost his own in the process. The two reconciled, with Tenzin even complimenting Korra about her pro-bending gameplay, stating that the sport proved to be the training tool Korra needed. However, he sighed deeply upon learning that Korra had permanently joined the ${link_0} and would compete in the ${link_1} in a couple of weeks.",
      "links": [
        {
          "body": "Fire Ferrets",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        },
        {
          "body": "Pro-bending Tournament",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending#Pro-bending_Tournament",
            "page": "Pro-bending"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Training Avatar Korra"
      ],
      "text": "After the match, Tenzin returned to the island to oversee the repair of the airbending gates. When Korra came and apologized for taking out her frustrations on him, Tenzin apologized too, stating that while he was teaching her patience, he lost his own in the process. The two reconciled, with Tenzin even complimenting Korra about her pro-bending gameplay, stating that the sport proved to be the training tool Korra needed. However, he sighed deeply upon learning that Korra had permanently joined the Fire Ferrets and would compete in the Pro-bending Tournament in a couple of weeks."
    },
    {
      "body": "After Korra returned from an Equalist rally and stated how ${link_0} had succeeded in taking away someone's bending ability, Tenzin stated that the ${link_1} was more dangerous than ever.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Revolution",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Anti-bending_Revolution",
            "page": "Anti-bending_Revolution"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Training Avatar Korra"
      ],
      "text": "After Korra returned from an Equalist rally and stated how Amon had succeeded in taking away someone's bending ability, Tenzin stated that the Revolution was more dangerous than ever."
    },
    {
      "body": "Realizing the threat Amon and the Equalists posed to everyone, Tenzin attended an important meeting with the United Republic Council, where a solution about the Equalist movement was going to be discussed. When Councilman ${link_0} proposed the formation of a ${link_1} to attack Amon head-on, Tenzin strongly opposed this, stating that such an aggressive action would only further the rift between benders and nonbenders. However, the airbender found himself outvoted by the remainder of the Council.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "task force",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tarrlok%27s_task_force",
            "page": "Tarrlok%27s_task_force"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Tarrlok's task force"
      ],
      "text": "Realizing the threat Amon and the Equalists posed to everyone, Tenzin attended an important meeting with the United Republic Council, where a solution about the Equalist movement was going to be discussed. When Councilman Tarrlok proposed the formation of a task force to attack Amon head-on, Tenzin strongly opposed this, stating that such an aggressive action would only further the rift between benders and nonbenders. However, the airbender found himself outvoted by the remainder of the Council."
    },
    {
      "body": "Later, Tarrlok visited Air Temple Island and interrupted Tenzin in the middle of the prayer for the family dinner. Tenzin found himself obligated to let him pass, much to his wife's irritation. At Korra's refusal to join Tarrlok's task force, he was surprised, and interrupted the Northern waterbender before he could insist and try to convince her to change her mind, saying that Korra had already made a decision. Noting Tarrlok's increasingly extravagant gifts, Tenzin approached Korra and informed her that he, although glad she had refused the offer, hoped she had done it for the right reasons and knew it was okay to be afraid. However, at Korra's silence, he assured her he would be there to talk about anything if she needed it.",
      "links": [],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Tarrlok's task force"
      ],
      "text": "Later, Tarrlok visited Air Temple Island and interrupted Tenzin in the middle of the prayer for the family dinner. Tenzin found himself obligated to let him pass, much to his wife's irritation. At Korra's refusal to join Tarrlok's task force, he was surprised, and interrupted the Northern waterbender before he could insist and try to convince her to change her mind, saying that Korra had already made a decision. Noting Tarrlok's increasingly extravagant gifts, Tenzin approached Korra and informed her that he, although glad she had refused the offer, hoped she had done it for the right reasons and knew it was okay to be afraid. However, at Korra's silence, he assured her he would be there to talk about anything if she needed it."
    },
    {
      "body": "During a gala Tarrlok threw in Korra's honor at ${link_0}, an exasperated Tenzin had to deal with Meelo's antics, and, worriedly watched Korra's announcement to join the task force to the press. After Korra publicly challenged Amon to a duel, Tenzin flew to her location using a ${link_1}, trying to dissuade her, but without success. When Tenzin found her on Aang Memorial Island, he was concerned that Amon had taken her bending, but at Korra's denial, he was relieved and offered her comfort when she cried in fear of Amon.",
      "links": [
        {
          "body": "City Hall",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/City_Hall",
            "page": "City_Hall"
          }
        },
        {
          "body": "glider",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Airbender_staff",
            "page": "Airbender_staff"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Tarrlok's task force"
      ],
      "text": "During a gala Tarrlok threw in Korra's honor at City Hall, an exasperated Tenzin had to deal with Meelo's antics, and, worriedly watched Korra's announcement to join the task force to the press. After Korra publicly challenged Amon to a duel, Tenzin flew to her location using a glider, trying to dissuade her, but without success. When Tenzin found her on Aang Memorial Island, he was concerned that Amon had taken her bending, but at Korra's denial, he was relieved and offered her comfort when she cried in fear of Amon."
    },
    {
      "body": "After this encounter, Tenzin and the rest of the United Republic Council were threatened by Amon to shut down the ${link_0} or face \"severe consequences\". Despite Tenzin's disapproval, the rest of the Council voted to keep the arena open. Tenzin invited Lin to have a talk with him away from the others. In the hallway, he expressed his concern for her safety, stating that Tarrlok was simply playing her. When Lin bluntly rebuffed him, stating that she knew what she was doing, Tenzin announced that he would accompany her during the match.",
      "links": [
        {
          "body": "Pro-bending Arena",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "The Anti-bending Revolution"
      ],
      "text": "After this encounter, Tenzin and the rest of the United Republic Council were threatened by Amon to shut down the Pro-bending Arena or face \"severe consequences\". Despite Tenzin's disapproval, the rest of the Council voted to keep the arena open. Tenzin invited Lin to have a talk with him away from the others. In the hallway, he expressed his concern for her safety, stating that Tarrlok was simply playing her. When Lin bluntly rebuffed him, stating that she knew what she was doing, Tenzin announced that he would accompany her during the match."
    },
    {
      "body": "When Korra came up to the duo and passed Lin, Korra asked Tenzin what Aang had done to make Lin hate the Avatar, as the metalbender completely ignored her moments before. Tenzin explained that he was to blame for attitude, causing Korra to deduce that Lin and Tenzin used to be romantically involved. Taken aback by the statement, Tenzin began to explain their story, though stopped halfway through, saying that it was none of Korra's business and that they had moved passed it.",
      "links": [],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "The Anti-bending Revolution"
      ],
      "text": "When Korra came up to the duo and passed Lin, Korra asked Tenzin what Aang had done to make Lin hate the Avatar, as the metalbender completely ignored her moments before. Tenzin explained that he was to blame for attitude, causing Korra to deduce that Lin and Tenzin used to be romantically involved. Taken aback by the statement, Tenzin began to explain their story, though stopped halfway through, saying that it was none of Korra's business and that they had moved passed it."
    },
    {
      "body": "Later, Tenzin and Lin watched the match together, and he even protested a series of controversial calls made that allowed the ${link_0} to defeat the Fire Ferrets. After the match, the two were stunned and knocked unconscious by two Equalists with ${link_1}. After everyone was reunited safely, Tenzin tried to ease Lin's regrets of playing right into Amon's hands by suggesting that everyone was. He subsequently declared that \"Republic City [was] at war.\"",
      "links": [
        {
          "body": "White Falls Wolfbats",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/White_Falls_Wolfbats",
            "page": "White_Falls_Wolfbats"
          }
        },
        {
          "body": "electrified gloves",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Electrified_glove",
            "page": "Electrified_glove"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "The Anti-bending Revolution"
      ],
      "text": "Later, Tenzin and Lin watched the match together, and he even protested a series of controversial calls made that allowed the White Falls Wolfbats to defeat the Fire Ferrets. After the match, the two were stunned and knocked unconscious by two Equalists with electrified gloves. After everyone was reunited safely, Tenzin tried to ease Lin's regrets of playing right into Amon's hands by suggesting that everyone was. He subsequently declared that \"Republic City [was] at war.\""
    },
    {
      "body": "Later, Tenzin assisted Lin in her investigation of the arena attack, helping her interview the witnesses which included Hiroshi Sato and ${link_0}. Soon after, Korra overheard Hiroshi Sato while in his home saying that the ${link_1} investigation provided a decent distraction, and that he would \"strike\" soon; she immediately told Tenzin and Lin, who both agreed that Sato had the means and the motive to make weapons for the Equalists, so they decided to interrogate him again. Tenzin and Lin visited the ${link_2} and after informing him of their suspicions, the businessman assured them that he had no ties with the Equalists, and he gave them permission to search all of Future Industries' factories.",
      "links": [
        {
          "body": "Tahno",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tahno",
            "page": "Tahno"
          }
        },
        {
          "body": "Cabbage Corp",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Cabbage_Corp",
            "page": "Cabbage_Corp"
          }
        },
        {
          "body": "Sato estate",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Sato_estate",
            "page": "Sato_estate"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "The Anti-bending Revolution"
      ],
      "text": "Later, Tenzin assisted Lin in her investigation of the arena attack, helping her interview the witnesses which included Hiroshi Sato and Tahno. Soon after, Korra overheard Hiroshi Sato while in his home saying that the Cabbage Corp investigation provided a decent distraction, and that he would \"strike\" soon; she immediately told Tenzin and Lin, who both agreed that Sato had the means and the motive to make weapons for the Equalists, so they decided to interrogate him again. Tenzin and Lin visited the Sato estate and after informing him of their suspicions, the businessman assured them that he had no ties with the Equalists, and he gave them permission to search all of Future Industries' factories."
    },
    {
      "body": "While Tenzin and Lin were distracted after a search of Future Industries yielded no evidence, a worker slipped Korra a note to meet him beneath the Silk Road Bridge that night. The three arrived and the worker revealed that Sato was indeed manufacturing weapons in an ${link_0} under his home.",
      "links": [
        {
          "body": "hidden factory",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Equalist_factory",
            "page": "Equalist_factory"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "The Anti-bending Revolution"
      ],
      "text": "While Tenzin and Lin were distracted after a search of Future Industries yielded no evidence, a worker slipped Korra a note to meet him beneath the Silk Road Bridge that night. The three arrived and the worker revealed that Sato was indeed manufacturing weapons in an hidden factory under his home."
    },
    {
      "body": "Tenzin, Lin, Korra, and some metalbending officers investigated the mansion, finding the factory and Sato's ${link_0}. However, they soon discovered it was a trap, and Sato cornered the benders and began attacking them with the help of some Equalists. Tenzin was the last bender standing, and proceeded to fight the tanks himself. Despite putting up a long, strong fight, he too was eventually overpowered and knocked out. Sato ordered his men to bring the benders to Amon to have their bending taken away; however, ${link_1} and ${link_2} managed to sneak into the factory undetected, and began carrying the airbender, Korra, and Lin out. Sato cornered them before the brothers could escape, but he and the ${link_3} were suddenly attacked by ${link_4}, allowing the group to escape the Sato estate via ${link_5}, but they were forced to leave behind Lin's officers.",
      "links": [
        {
          "body": "mecha tanks",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Lieutenant",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "Asami",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "airship",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Police_airship",
            "page": "Police_airship"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "The Anti-bending Revolution"
      ],
      "text": "Tenzin, Lin, Korra, and some metalbending officers investigated the mansion, finding the factory and Sato's mecha tanks. However, they soon discovered it was a trap, and Sato cornered the benders and began attacking them with the help of some Equalists. Tenzin was the last bender standing, and proceeded to fight the tanks himself. Despite putting up a long, strong fight, he too was eventually overpowered and knocked out. Sato ordered his men to bring the benders to Amon to have their bending taken away; however, Mako and Bolin managed to sneak into the factory undetected, and began carrying the airbender, Korra, and Lin out. Sato cornered them before the brothers could escape, but he and the Lieutenant were suddenly attacked by Asami, allowing the group to escape the Sato estate via airship, but they were forced to leave behind Lin's officers."
    },
    {
      "body": "As Lin began to recover from the attack, she told Tenzin she was resigning as Chief of Police in light of her recent failures. Tenzin told her she could not give up, but the chief explained her decision had been made with the objective of taking down Amon without the restraints of the law.",
      "links": [],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "The Anti-bending Revolution"
      ],
      "text": "As Lin began to recover from the attack, she told Tenzin she was resigning as Chief of Police in light of her recent failures. Tenzin told her she could not give up, but the chief explained her decision had been made with the objective of taking down Amon without the restraints of the law."
    },
    {
      "body": "After Korra's friends moved into Air Temple Island, Tenzin took Korra to the police headquarters in order to attend the inauguration of the new police chief, ${link_0}. During the ceremony, both Tenzin and Korra became concerned when Saikhan announced that he would be directly reporting to Tarrlok on all matter relating to the Equalists. After the ceremony, the airbender and the Avatar confronted Tarrlok, the former suspecting that he blackmailed Saikhan but Tarrlok brushed off his concerns. On the way back to the island, Tenzin spoke with Korra about her block in airbending and asked if she had any contact with her past lives, so Korra told him about the visions she had of Aang. He advised her to meditate on them, believing that Aang's spirit was trying to contact her.",
      "links": [
        {
          "body": "Saikhan",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Saikhan",
            "page": "Saikhan"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "New Chief of Police"
      ],
      "text": "After Korra's friends moved into Air Temple Island, Tenzin took Korra to the police headquarters in order to attend the inauguration of the new police chief, Saikhan. During the ceremony, both Tenzin and Korra became concerned when Saikhan announced that he would be directly reporting to Tarrlok on all matter relating to the Equalists. After the ceremony, the airbender and the Avatar confronted Tarrlok, the former suspecting that he blackmailed Saikhan but Tarrlok brushed off his concerns. On the way back to the island, Tenzin spoke with Korra about her block in airbending and asked if she had any contact with her past lives, so Korra told him about the visions she had of Aang. He advised her to meditate on them, believing that Aang's spirit was trying to contact her."
    },
    {
      "body": "Later on, Korra contacted Tenzin at the police headquarters to help get her friends out of jail after being wrongly arrested. After Saikhan turned them down by telling them to talk to Tarrlok, he decided to speak with Tarrlok in the morning. Before leaving, though, Tenzin agreed with Korra that Saikhan was the \"worst Chief of Police ever!\"",
      "links": [],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "New Chief of Police"
      ],
      "text": "Later on, Korra contacted Tenzin at the police headquarters to help get her friends out of jail after being wrongly arrested. After Saikhan turned them down by telling them to talk to Tarrlok, he decided to speak with Tarrlok in the morning. Before leaving, though, Tenzin agreed with Korra that Saikhan was the \"worst Chief of Police ever!\""
    },
    {
      "body": "Tenzin awoke to Meelo crawling over his face to answer a phone call the next day; taking the phone from his son, Tenzin was alerted about a fight that went down at City Hall. Rushing over there, he learned that Korra had supposedly been kidnapped by the Equalists. Trying desperately to find her, he phoned every contact he had for a possible lead to her whereabouts, but was interrupted by Lin Beifong, who had broken Mako, Bolin, and Asami out of jail to help locate Korra. Together, they all set out to find her, and their search led them to an underground Equalist hideout. Confronting a chi blocker, they learned that Tarrlok had lied about the Equalist attack, making Tenzin realize that he was the one who was holding Korra captive.",
      "links": [],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Finding Avatar Korra"
      ],
      "text": "Tenzin awoke to Meelo crawling over his face to answer a phone call the next day; taking the phone from his son, Tenzin was alerted about a fight that went down at City Hall. Rushing over there, he learned that Korra had supposedly been kidnapped by the Equalists. Trying desperately to find her, he phoned every contact he had for a possible lead to her whereabouts, but was interrupted by Lin Beifong, who had broken Mako, Bolin, and Asami out of jail to help locate Korra. Together, they all set out to find her, and their search led them to an underground Equalist hideout. Confronting a chi blocker, they learned that Tarrlok had lied about the Equalist attack, making Tenzin realize that he was the one who was holding Korra captive."
    },
    {
      "body": "Returning to City Hall, Tenzin called the other Council members and Chief Saikhan and accused Tarrlok of detaining Korra. Before Tenzin could apprehend him, however, the ${link_0} used his ${link_1} skills to overpower Tenzin and the others and subdue them into semi-consciousness. Being roughly awakened some time later by Lin, he and the others resumed their search for Korra, patrolling the city from up above using Oogi. They found Korra when they heard Naga howl. Tenzin and Lin rushed to her side to inquire where Tarrlok was, but were pushed aside by Mako who demanded that they \"give her some space\".",
      "links": [
        {
          "body": "waterbender",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "bloodbending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bloodbending",
            "page": "Bloodbending"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Finding Avatar Korra"
      ],
      "text": "Returning to City Hall, Tenzin called the other Council members and Chief Saikhan and accused Tarrlok of detaining Korra. Before Tenzin could apprehend him, however, the waterbender used his bloodbending skills to overpower Tenzin and the others and subdue them into semi-consciousness. Being roughly awakened some time later by Lin, he and the others resumed their search for Korra, patrolling the city from up above using Oogi. They found Korra when they heard Naga howl. Tenzin and Lin rushed to her side to inquire where Tarrlok was, but were pushed aside by Mako who demanded that they \"give her some space\"."
    },
    {
      "body": "After Korra was found to be safe and sound, Team Avatar, Lin, and Tenzin returned to Air Temple Island to enjoy dinner from Pema. During the meal, Tenzin asked Korra to relate the events of her captivity by Tarrlok, learning that the former Councilman was ${link_0}'s son and that Amon had appeared \"out of nowhere\" to take away Tarrlok's bending, subsequently capturing him, to which the airbender said that Amon was becoming emboldened and was entering his \"endgame\".",
      "links": [
        {
          "body": "Yakone",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Yakone",
            "page": "Yakone"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Attack on Republic City"
      ],
      "text": "After Korra was found to be safe and sound, Team Avatar, Lin, and Tenzin returned to Air Temple Island to enjoy dinner from Pema. During the meal, Tenzin asked Korra to relate the events of her captivity by Tarrlok, learning that the former Councilman was Yakone's son and that Amon had appeared \"out of nowhere\" to take away Tarrlok's bending, subsequently capturing him, to which the airbender said that Amon was becoming emboldened and was entering his \"endgame\"."
    },
    {
      "body": "Before heading to City Hall to a council meeting, Tenzin left Lin in charge of protecting his family in the island. Once there, he was attacked by Equalists in the building's roof, but he could defeat them by performing an air spout. Tenzin met the Council page, who informed him about the abduction of the other members of the Council. The two observed several Equalists airships coming to the city and throwing bombs at different sectors. The Councilman quickly went to the police headquarters to plan a counter-attack with Saikhan. Being that the police force was spread too thin, Tenzin ordered a dispatch to be sent to the ${link_0} to send aid to the city; however, he was forced to escape from a gas attack in the building with the chief and some officers by creating a bubble of air to shelter. When they went outside, the group was ambushed by mecha tanks and, despite his best attempts to fend them off, Tenzin and the others were soon overpowered, but the airbender was saved by Team Avatar, who arrived at the scene in time. However, this victory was short-lived after they noticed an Equalist airship in the distance preparing to attack Air Temple Island.",
      "links": [
        {
          "body": "United Forces",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/United_Forces",
            "page": "United_Forces"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Attack on Republic City"
      ],
      "text": "Before heading to City Hall to a council meeting, Tenzin left Lin in charge of protecting his family in the island. Once there, he was attacked by Equalists in the building's roof, but he could defeat them by performing an air spout. Tenzin met the Council page, who informed him about the abduction of the other members of the Council. The two observed several Equalists airships coming to the city and throwing bombs at different sectors. The Councilman quickly went to the police headquarters to plan a counter-attack with Saikhan. Being that the police force was spread too thin, Tenzin ordered a dispatch to be sent to the United Forces to send aid to the city; however, he was forced to escape from a gas attack in the building with the chief and some officers by creating a bubble of air to shelter. When they went outside, the group was ambushed by mecha tanks and, despite his best attempts to fend them off, Tenzin and the others were soon overpowered, but the airbender was saved by Team Avatar, who arrived at the scene in time. However, this victory was short-lived after they noticed an Equalist airship in the distance preparing to attack Air Temple Island."
    },
    {
      "body": "Tenzin returned to the island to find the Equalist attackers defeated by his children and Lin. He rushed to Pema, who had just given birth to their second son, Rohan, but the tender moment did not last as Tenzin and his family were forced to flee from Republic City in order to preserve the airbending race. He also advised Team Avatar to go into hiding until the United Forces arrive to turn the tide of the war. As they attempted to escape on Oogi with Lin, two of the Equalist airships began to pursue them. Using her metal cables, Lin shot down a net and grabbed a rope connected to the ship, successfully taking one of them down, but being captured while attempting to take out the second. Meelo declared that \"that lady is [his] hero\", a statement to which Tenzin solemnly agreed.",
      "links": [],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Attack on Republic City"
      ],
      "text": "Tenzin returned to the island to find the Equalist attackers defeated by his children and Lin. He rushed to Pema, who had just given birth to their second son, Rohan, but the tender moment did not last as Tenzin and his family were forced to flee from Republic City in order to preserve the airbending race. He also advised Team Avatar to go into hiding until the United Forces arrive to turn the tide of the war. As they attempted to escape on Oogi with Lin, two of the Equalist airships began to pursue them. Using her metal cables, Lin shot down a net and grabbed a rope connected to the ship, successfully taking one of them down, but being captured while attempting to take out the second. Meelo declared that \"that lady is [his] hero\", a statement to which Tenzin solemnly agreed."
    },
    {
      "body": "Despite Lin's sacrifice, Equalists managed to capture Tenzin and his family. During an Equalist rally in the Pro-bending Arena, Amon revealed Tenzin and his children, announcing the world's riddance of airbending. Korra and Mako, who had attended the rally to expose Amon as a bender, intervened. Mako attacked Amon and his Equalists while Korra freed Tenzin and his children, asking about Pema, the baby, and Lin. Tenzin told her that Pema and the baby were in prison, and he had no idea on Lin's whereabouts. While Korra moved on to free his children, Tenzin assisted Mako in overpowering Amon and his Equalists. Tenzin and his children went on to save Pema and Rohan while Korra and Mako created a distraction.",
      "links": [],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Capture and release"
      ],
      "text": "Despite Lin's sacrifice, Equalists managed to capture Tenzin and his family. During an Equalist rally in the Pro-bending Arena, Amon revealed Tenzin and his children, announcing the world's riddance of airbending. Korra and Mako, who had attended the rally to expose Amon as a bender, intervened. Mako attacked Amon and his Equalists while Korra freed Tenzin and his children, asking about Pema, the baby, and Lin. Tenzin told her that Pema and the baby were in prison, and he had no idea on Lin's whereabouts. While Korra moved on to free his children, Tenzin assisted Mako in overpowering Amon and his Equalists. Tenzin and his children went on to save Pema and Rohan while Korra and Mako created a distraction."
    },
    {
      "body": "After Amon's defeat, Tenzin and his family, along with Lin and Team Avatar, reunited at the harbor of Air Temple Island. When the United Forces back-up fleet arrived, the captain was Tenzin's brother, Bumi. The kids were excited about their uncle's visit, but Tenzin was less than enthusiastic to meet him.",
      "links": [],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Capture and release"
      ],
      "text": "After Amon's defeat, Tenzin and his family, along with Lin and Team Avatar, reunited at the harbor of Air Temple Island. When the United Forces back-up fleet arrived, the captain was Tenzin's brother, Bumi. The kids were excited about their uncle's visit, but Tenzin was less than enthusiastic to meet him."
    },
    {
      "body": "Tenzin and his family were among the many people in a small Southern Water Tribe home, anxious to find out if his mother, Katara, could heal Korra. Katara came out from the back room, announcing that nothing was working and she could not restore Korra's powers. Tenzin wanted to comfort Korra when she came out from the back room, but Korra took off on Naga. Mako tried to follow her, but Tenzin restrained him, saying that she needed time to come to terms with what had happened to her. Korra went to a cliff and cried her heart out, sitting on the ground, her head buried in her arms. In the background, a person wearing Air Nomad attire walked up. Korra had mistaken the person for Tenzin, but when she looked she saw it was Aang, who subsequently restored her ability to bend. After Korra regained her bending, she was able to give bending abilities back to those who had it removed. When she gave Lin her ${link_0} back by using ${link_1}, Tenzin, who had been in awe watching her, walked up the steps and told her \"I am so proud of you, Avatar Korra.\"",
      "links": [
        {
          "body": "earthbending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "energybending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Energybending",
            "page": "Energybending"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "170 AG",
        "Avatar Korra"
      ],
      "text": "Tenzin and his family were among the many people in a small Southern Water Tribe home, anxious to find out if his mother, Katara, could heal Korra. Katara came out from the back room, announcing that nothing was working and she could not restore Korra's powers. Tenzin wanted to comfort Korra when she came out from the back room, but Korra took off on Naga. Mako tried to follow her, but Tenzin restrained him, saying that she needed time to come to terms with what had happened to her. Korra went to a cliff and cried her heart out, sitting on the ground, her head buried in her arms. In the background, a person wearing Air Nomad attire walked up. Korra had mistaken the person for Tenzin, but when she looked she saw it was Aang, who subsequently restored her ability to bend. After Korra regained her bending, she was able to give bending abilities back to those who had it removed. When she gave Lin her earthbending back by using energybending, Tenzin, who had been in awe watching her, walked up the steps and told her \"I am so proud of you, Avatar Korra.\""
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "See also"
      ],
      "text": "Tenzin"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Tenzin (171 AG - Harmonic Convergence)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Tenzin_(171_AG_-_Harmonic_Convergence)",
            "page": "History_of_Tenzin_(171_AG_-_Harmonic_Convergence)"
          }
        }
      ],
      "section": [
        "History of Tenzin (119 AG - 170 AG)",
        "See also"
      ],
      "text": "History of Tenzin (171 AG - Harmonic Convergence)"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Tenzin_(119_AG_-_170_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Tenzin_(119_AG_-_170_AG).html",
    "page": "History_of_Tenzin_(119_AG_-_170_AG)",
    "title": "History of Tenzin (119 AG - 170 AG)"
  }
}