{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Following the ${link_0}, ${link_1} was chosen by Prince ${link_2} to be his personal bodyguard. As such, he witnessed first hand how ${link_3} denounced the ${link_4}'s authority and appointed herself the ruler of the ${link_5}. In order to preserve the balance in the ${link_6}, he joined ${link_7} to help stop her from conquering the ${link_8}.",
      "links": [
        {
          "body": "insurrection of the Red Lotus",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Insurrection_of_the_Red_Lotus",
            "page": "Insurrection_of_the_Red_Lotus"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Wu",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Wu",
            "page": "Wu"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "royal",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Earth Empire",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        },
        {
          "body": "world",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "United Republic of Nations",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)"
      ],
      "text": "Following the insurrection of the Red Lotus, Mako was chosen by Prince Wu to be his personal bodyguard. As such, he witnessed first hand how Kuvira denounced the royal's authority and appointed herself the ruler of the Earth Empire. In order to preserve the balance in the world, he joined Team Avatar to help stop her from conquering the United Republic of Nations."
    },
    {
      "body": "Following the ${link_0}, Mako's accomplishments were shown in the local newspapers, which led to Earth Prince Wu handpicking him to be his bodyguard until his coronation as the new Earth King. At the grand reopening of ${link_1}, Mako stood behind the prince, ensuring no harm would befall him. When Wu was later flirting with ${link_2}, much to her annoyance, Mako stepped up to the prince and informed him that ${link_3} ${link_4} desired to discuss some royal matters with him. As the prince retreated, Mako commented sarcastically to the Sato heiress that the prince was a real charmer, which earned him the question how he could stand being the royal's bodyguard. Mako replied that he dealt with the issue by constantly reminding himself that once Wu was crowned king, he would be back to his role as detective, though added jokingly that he also smashed his head into the wall for an hour to relieve the stress. When Asami inquired about ${link_5}, Mako revealed that he had not talked to his brother for a while, though knew he was scheduled to arrive at ${link_6} in a few days for Wu's coronation. He also added that ${link_7} had mentioned that ${link_8} would arrive that night.",
      "links": [
        {
          "body": "insurrection of the Red Lotus",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Insurrection_of_the_Red_Lotus",
            "page": "Insurrection_of_the_Red_Lotus"
          }
        },
        {
          "body": "Central City Station",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Central_City_Station",
            "page": "Central_City_Station"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "President",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Lin",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Korra",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "Life as a bodyguard"
      ],
      "text": "Following the insurrection of the Red Lotus, Mako's accomplishments were shown in the local newspapers, which led to Earth Prince Wu handpicking him to be his bodyguard until his coronation as the new Earth King. At the grand reopening of Central City Station, Mako stood behind the prince, ensuring no harm would befall him. When Wu was later flirting with Asami, much to her annoyance, Mako stepped up to the prince and informed him that President Raiko desired to discuss some royal matters with him. As the prince retreated, Mako commented sarcastically to the Sato heiress that the prince was a real charmer, which earned him the question how he could stand being the royal's bodyguard. Mako replied that he dealt with the issue by constantly reminding himself that once Wu was crowned king, he would be back to his role as detective, though added jokingly that he also smashed his head into the wall for an hour to relieve the stress. When Asami inquired about Bolin, Mako revealed that he had not talked to his brother for a while, though knew he was scheduled to arrive at Republic City in a few days for Wu's coronation. He also added that Lin had mentioned that Korra would arrive that night."
    },
    {
      "body": "After the ceremony, Mako retreated with Wu to the prince's ${link_0}. As they made their way toward the exit, Mako wondered why they were already heading out, considering the planned dinner at ${link_1} was not until that evening and the prince was only getting a haircut. However, the ${link_2} was notified that their outing was going to be a complete spa treatment, which would at a minimum take up to four hours. Upon asking what could take up four hours, Mako was told about the specifics involving a rejuvenating tea leaf skin wrap, which he concluded to be disgusting. Upon exiting the hotel, Mako tried to caution the prince about the gathered crowd, posing the idea that not everyone was there to support him. While the prince merrily interacted with some of the people, Mako wearily eyed the crowd and noticed some figures clad in green start to suspiciously stalk toward Wu. Realizing the potential danger, he scooped the prince up and placed him inside the waiting ${link_3}, telling the driver to go as the vehicle was being barraged with strawberry pies. When Wu asked what happened, Mako told him that he suspected Kuvira supporters to have been among the crowd. As the prince noticed a stain on his clothes, he panicked, believing he had been hit, though Mako quickly calmed him down by pointing out it was merely a pie stain, emphasizing that being hit by the dessert was not a big deal. When Wu panicked again, dramatically falling to the floor while fearing an allergic reaction upon having ingested strawberries, an annoyed Mako firmly told the prince that he was only allergic to bee stings.",
      "links": [
        {
          "body": "hotel",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_Four_Elements",
            "page": "Republic_City_Four_Elements"
          }
        },
        {
          "body": "Air Temple Island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "firebender",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Satomobile",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Satomobile",
            "page": "Satomobile"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "Life as a bodyguard"
      ],
      "text": "After the ceremony, Mako retreated with Wu to the prince's hotel. As they made their way toward the exit, Mako wondered why they were already heading out, considering the planned dinner at Air Temple Island was not until that evening and the prince was only getting a haircut. However, the firebender was notified that their outing was going to be a complete spa treatment, which would at a minimum take up to four hours. Upon asking what could take up four hours, Mako was told about the specifics involving a rejuvenating tea leaf skin wrap, which he concluded to be disgusting. Upon exiting the hotel, Mako tried to caution the prince about the gathered crowd, posing the idea that not everyone was there to support him. While the prince merrily interacted with some of the people, Mako wearily eyed the crowd and noticed some figures clad in green start to suspiciously stalk toward Wu. Realizing the potential danger, he scooped the prince up and placed him inside the waiting Satomobile, telling the driver to go as the vehicle was being barraged with strawberry pies. When Wu asked what happened, Mako told him that he suspected Kuvira supporters to have been among the crowd. As the prince noticed a stain on his clothes, he panicked, believing he had been hit, though Mako quickly calmed him down by pointing out it was merely a pie stain, emphasizing that being hit by the dessert was not a big deal. When Wu panicked again, dramatically falling to the floor while fearing an allergic reaction upon having ingested strawberries, an annoyed Mako firmly told the prince that he was only allergic to bee stings."
    },
    {
      "body": "During the dinner at Air Temple Island, Mako grew annoyed upon hearing the prince gush about his spa treatment again and revealed to Lin that he was looking forward to the coronation as that meant that he would go back to being a detective. Much to his frustration and distress, Mako was told by Lin that he was permanently assigned as Wu's bodyguard and would accompany the prince to ${link_0}. He wondered how that could happen as he was part of the Republic City Police and not an ${link_1} citizen, left to sigh in annoyance as Lin told him that he had become a pawn in Raiko's diplomatic game.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "Life as a bodyguard"
      ],
      "text": "During the dinner at Air Temple Island, Mako grew annoyed upon hearing the prince gush about his spa treatment again and revealed to Lin that he was looking forward to the coronation as that meant that he would go back to being a detective. Much to his frustration and distress, Mako was told by Lin that he was permanently assigned as Wu's bodyguard and would accompany the prince to Ba Sing Se. He wondered how that could happen as he was part of the Republic City Police and not an Earth Kingdom citizen, left to sigh in annoyance as Lin told him that he had become a pawn in Raiko's diplomatic game."
    },
    {
      "body": "After an ${link_0} informed the group that a ${link_1} ship was arriving at the dock, Mako and the rest of the group went to greet Korra, but when ${link_2} told them she had left for Republic City six months prior, the firebender looked at him confusingly, wondering where the ${link_3} could be.",
      "links": [
        {
          "body": "Air Acolyte",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Acolytes",
            "page": "Air_Acolytes"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "Life as a bodyguard"
      ],
      "text": "After an Air Acolyte informed the group that a Southern Water Tribe ship was arriving at the dock, Mako and the rest of the group went to greet Korra, but when Tonraq told them she had left for Republic City six months prior, the firebender looked at him confusingly, wondering where the Avatar could be."
    },
    {
      "body": "The day before Wu's coronation as the fifty-fourth earth monarch, Mako accompanied the future king to ${link_0}, where he listed to an excited prince gush about the details of the coronation ceremony, which he predicted would be the most \"dynamite six-hour show\" Mako would have ever seen. Unfazed by Wu's enthusiasm, Mako asked about the preparations the prince had made to be ready to rule the kingdom, though was waved off and told that ministers would handle the actual governing, while the two of them would be living the high life, prompting sarcastic excitement from the firebender. After Raiko and Tenzin arrived and Wu dashed off to perform the \"Dance of the ${link_1}\", Mako asked the president if he was comfortable leaving the Earth Kingdom in Wu's hands and expressed his skepticism about Kuvira willingly turning power over to Wu.",
      "links": [
        {
          "body": "City Hall",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/City_Hall",
            "page": "City_Hall"
          }
        },
        {
          "body": "Badgermoles",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Badgermole",
            "page": "Badgermole"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "Coronation day"
      ],
      "text": "The day before Wu's coronation as the fifty-fourth earth monarch, Mako accompanied the future king to City Hall, where he listed to an excited prince gush about the details of the coronation ceremony, which he predicted would be the most \"dynamite six-hour show\" Mako would have ever seen. Unfazed by Wu's enthusiasm, Mako asked about the preparations the prince had made to be ready to rule the kingdom, though was waved off and told that ministers would handle the actual governing, while the two of them would be living the high life, prompting sarcastic excitement from the firebender. After Raiko and Tenzin arrived and Wu dashed off to perform the \"Dance of the Badgermoles\", Mako asked the president if he was comfortable leaving the Earth Kingdom in Wu's hands and expressed his skepticism about Kuvira willingly turning power over to Wu."
    },
    {
      "body": "Returning to the Four Republic City Four Elements, Mako saw Bolin standing in the lobby and the two brothers traded a mock punch before sharing a hug. Mako proudly complimented Bolin for having become \"all important\" and asked what it was like to work for Kuvira, as he had heard she could be harsh. After Bolin recalled all his accomplishments, Mako was ashamed to admit that all he had done in the meantime was working for Wu. As the earthbender changed the subject and inquired about Korra, Mako informed his brother that she had been missing for months.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "Coronation day"
      ],
      "text": "Returning to the Four Republic City Four Elements, Mako saw Bolin standing in the lobby and the two brothers traded a mock punch before sharing a hug. Mako proudly complimented Bolin for having become \"all important\" and asked what it was like to work for Kuvira, as he had heard she could be harsh. After Bolin recalled all his accomplishments, Mako was ashamed to admit that all he had done in the meantime was working for Wu. As the earthbender changed the subject and inquired about Korra, Mako informed his brother that she had been missing for months."
    },
    {
      "body": "The day of the coronation, Mako waited with Wu in the hall of City Hall for the arrival of ${link_0} and the rest of the royal cabinet. He watched in silence how Wu grew distraught over the news that his ceremony would not be extravagant. During the ceremony, Mako stood on the side with Asami, from where they witnessed Wu being crowned king and Kuvira denouncing his authority and dissolving the Earth Kingdom in favor of the Earth Empire under her rule.",
      "links": [
        {
          "body": "Gun",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Gun",
            "page": "Gun"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "Coronation day"
      ],
      "text": "The day of the coronation, Mako waited with Wu in the hall of City Hall for the arrival of Gun and the rest of the royal cabinet. He watched in silence how Wu grew distraught over the news that his ceremony would not be extravagant. During the ceremony, Mako stood on the side with Asami, from where they witnessed Wu being crowned king and Kuvira denouncing his authority and dissolving the Earth Kingdom in favor of the Earth Empire under her rule."
    },
    {
      "body": "Retiring to Wu's junior suite, Mako began to pack his clothes, listening to Wu lament about how he had lost his suite and throne, though when the king apologized for not being able to take Mako back to Ba Sing Se with him, believing it was crushing Mako's spirits, the firebender urged him not to worry about him, which earned him another compliment from the royal. When someone knocked on the door, Mako answered and found it was Bolin. Although Wu ordered him to get rid of the Kuvira associate, Mako stepped outside of the room to talk and told his brother that he could not keep working for Kuvira now that she was going against the wishes of the entire world. As Bolin tried to explain to he had a wrong view of Kuvira, Mako continued to be skeptical and was invited to join their cause, so he could see first-hand all the good they did and how they were making history. The firebender mused that they were making history by crushing everyone in their way, though was corrected by Bolin who relaying Kuvira's explanation that it was merely tough rhetoric to let people knew the Earth Empire was not to be fooled with. When Bolin drew a parallel between Kuvira and Korra, Mako grew annoyed and labeled Kuvira to be a dictator taking over the Earth Kingdom by force. Bolin retaliated by asking if Mako thought Wu would be a better leader than Kuvira, which forced the firebender to admit that he did not think so. As he wanted to continue voicing his protest against Kuvira, he was cut off by an angry Bolin and was blamed for wasting his time as Wu's glorified butler as opposed to helping make history. Irritated over the outburst, Mako mock-apologized for his unwillingness to work for a \"glorious emperor in her military dictatorship\", prompting Bolin to storm off. Returning to the room, the firebender expressed his disbelief over what just happened and softly accepted Wu's offer to go to the ${link_0} where he would be treated on a smoothie.",
      "links": [
        {
          "body": "Little Ba Sing Se Fashion Mall",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Little_Ba_Sing_Se_Fashion_Mall",
            "page": "Little_Ba_Sing_Se_Fashion_Mall"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "Coronation day"
      ],
      "text": "Retiring to Wu's junior suite, Mako began to pack his clothes, listening to Wu lament about how he had lost his suite and throne, though when the king apologized for not being able to take Mako back to Ba Sing Se with him, believing it was crushing Mako's spirits, the firebender urged him not to worry about him, which earned him another compliment from the royal. When someone knocked on the door, Mako answered and found it was Bolin. Although Wu ordered him to get rid of the Kuvira associate, Mako stepped outside of the room to talk and told his brother that he could not keep working for Kuvira now that she was going against the wishes of the entire world. As Bolin tried to explain to he had a wrong view of Kuvira, Mako continued to be skeptical and was invited to join their cause, so he could see first-hand all the good they did and how they were making history. The firebender mused that they were making history by crushing everyone in their way, though was corrected by Bolin who relaying Kuvira's explanation that it was merely tough rhetoric to let people knew the Earth Empire was not to be fooled with. When Bolin drew a parallel between Kuvira and Korra, Mako grew annoyed and labeled Kuvira to be a dictator taking over the Earth Kingdom by force. Bolin retaliated by asking if Mako thought Wu would be a better leader than Kuvira, which forced the firebender to admit that he did not think so. As he wanted to continue voicing his protest against Kuvira, he was cut off by an angry Bolin and was blamed for wasting his time as Wu's glorified butler as opposed to helping make history. Irritated over the outburst, Mako mock-apologized for his unwillingness to work for a \"glorious emperor in her military dictatorship\", prompting Bolin to storm off. Returning to the room, the firebender expressed his disbelief over what just happened and softly accepted Wu's offer to go to the Little Ba Sing Se Fashion Mall where he would be treated on a smoothie."
    },
    {
      "body": "Slurping his smoothie in the store's lower ring, a disinterested Mako listened to the king as he was excitedly detailing their shopping plans, though grew surprised as the royal suddenly spat on him and dashed off after two women wearing T-shirts with a Kuvira print on the front. After Wu antagonized a group of Kuvira supporters, hitting one with his smoothie, Mako grew alarmed upon seeing the angry crowd and quickly started pulling Wu along with him. With the crowd close behind them, Mako created a fire barrier under the cover of which he vanished with Wu in one of the mall's alleys.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "Coronation day"
      ],
      "text": "Slurping his smoothie in the store's lower ring, a disinterested Mako listened to the king as he was excitedly detailing their shopping plans, though grew surprised as the royal suddenly spat on him and dashed off after two women wearing T-shirts with a Kuvira print on the front. After Wu antagonized a group of Kuvira supporters, hitting one with his smoothie, Mako grew alarmed upon seeing the angry crowd and quickly started pulling Wu along with him. With the crowd close behind them, Mako created a fire barrier under the cover of which he vanished with Wu in one of the mall's alleys."
    },
    {
      "body": "The two sought refuge in the Upper Ring of the shopping mall, where they found a replica of the Earth Kingdom Royal Palace, which was in reality a restaurant. As Wu excitedly dashed inside, Mako followed him and found the king crying on a replica of the throne, donning the crown, scepter, and royal robe. As Wu declared it to be the worst day of his life, Mako briskly asked him if he truly wanted to be king and told him that it was no wonder that the people favored Kuvira over him, considering that even though she was a \"power-crazed dictator\", she had worked hard to better the Earth Kingdom, whereas Wu had not done anything of the sort. As Wu calmed down, Mako apologized for speaking out of line, though found the king to agree with him, labeling himself \"a joke who got what he deserved\". They were forced to flee again, however, when Mako spotted the angry Kuvira supporters. When Wu asked to be carried, Mako denied the request.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "Coronation day"
      ],
      "text": "The two sought refuge in the Upper Ring of the shopping mall, where they found a replica of the Earth Kingdom Royal Palace, which was in reality a restaurant. As Wu excitedly dashed inside, Mako followed him and found the king crying on a replica of the throne, donning the crown, scepter, and royal robe. As Wu declared it to be the worst day of his life, Mako briskly asked him if he truly wanted to be king and told him that it was no wonder that the people favored Kuvira over him, considering that even though she was a \"power-crazed dictator\", she had worked hard to better the Earth Kingdom, whereas Wu had not done anything of the sort. As Wu calmed down, Mako apologized for speaking out of line, though found the king to agree with him, labeling himself \"a joke who got what he deserved\". They were forced to flee again, however, when Mako spotted the angry Kuvira supporters. When Wu asked to be carried, Mako denied the request."
    },
    {
      "body": "Learning that Korra was back in Republic City, Mako made plans to have lunch with her and Asami. He reserved a table at a restaurant and when the girls arrived, Mako warmly hugged Korra, though glared at Wu when the prince interrupted their reunion by introducing himself as Mako's boss and whisking the Avatar away to their booth. Seating himself as well, he apologized to Asami for failing to ditch the prince before coming to the restaurant, though he did note that he made the royal promise to be on his best behavior. When the business woman revealed that she had been worried when Korra had told her that she could no longer go into the Avatar State, Mako asked when Korra had told her that. Not missing the girls giving each other a look, he inquired what was going on between them, learning that Korra had written to Asami during her absence. As she explained that she had not written to him or Bolin because she did not know what to say to either of them, Mako irritatingly crossed his arms, noting that a \"hello\" would have been nice. His annoyance increased when the prince tried to console him by pointing out that Korra had not written him either. The growing tension between the friends was interrupted when Wu announced he was going to the bathroom and snapped his fingers to spur Mako to action. The already irritated firebender snapped at his boss, stating that he was not going to hold his hand every time he needed to use the bathroom and told the prince to go by himself for once. As Wu left, Mako started to explain to Korra that he normally went with Wu to the bathroom to stand guard in his general vicinity, though halfway through his explanation, he decided that he did not want to talk about it.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "A tense reunion"
      ],
      "text": "Learning that Korra was back in Republic City, Mako made plans to have lunch with her and Asami. He reserved a table at a restaurant and when the girls arrived, Mako warmly hugged Korra, though glared at Wu when the prince interrupted their reunion by introducing himself as Mako's boss and whisking the Avatar away to their booth. Seating himself as well, he apologized to Asami for failing to ditch the prince before coming to the restaurant, though he did note that he made the royal promise to be on his best behavior. When the business woman revealed that she had been worried when Korra had told her that she could no longer go into the Avatar State, Mako asked when Korra had told her that. Not missing the girls giving each other a look, he inquired what was going on between them, learning that Korra had written to Asami during her absence. As she explained that she had not written to him or Bolin because she did not know what to say to either of them, Mako irritatingly crossed his arms, noting that a \"hello\" would have been nice. His annoyance increased when the prince tried to console him by pointing out that Korra had not written him either. The growing tension between the friends was interrupted when Wu announced he was going to the bathroom and snapped his fingers to spur Mako to action. The already irritated firebender snapped at his boss, stating that he was not going to hold his hand every time he needed to use the bathroom and told the prince to go by himself for once. As Wu left, Mako started to explain to Korra that he normally went with Wu to the bathroom to stand guard in his general vicinity, though halfway through his explanation, he decided that he did not want to talk about it."
    },
    {
      "body": "Mako grew suspicious when Wu had yet to return by the time their food was presented, noting that the royal was not one to miss out on lunch. He left to inspect the facilities while the girls waited for him in the hallway. Hearing Korra be attacked after having followed a lead of her own, Mako and Asami rushed out the back door to see if they could help, though they promptly turned around to retrieve Asami's car when Korra announced that Wu had been ${link_0}. When one of the kidnappers blocked their path by erecting an earth barricade, Mako told Asami to take the next turn in order to cut them off, though angrily snapped at her when she ignored his directions. Asami's decision brought them on a street parallel to the kidnappers' vehicle, albeit a level higher, and when Korra stood up to jump down, Mako ordered her to stay seated, though she did not listen.",
      "links": [
        {
          "body": "kidnapped",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Attempted_kidnapping_of_Prince_Wu",
            "page": "Attempted_kidnapping_of_Prince_Wu"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "A tense reunion"
      ],
      "text": "Mako grew suspicious when Wu had yet to return by the time their food was presented, noting that the royal was not one to miss out on lunch. He left to inspect the facilities while the girls waited for him in the hallway. Hearing Korra be attacked after having followed a lead of her own, Mako and Asami rushed out the back door to see if they could help, though they promptly turned around to retrieve Asami's car when Korra announced that Wu had been kidnapped. When one of the kidnappers blocked their path by erecting an earth barricade, Mako told Asami to take the next turn in order to cut them off, though angrily snapped at her when she ignored his directions. Asami's decision brought them on a street parallel to the kidnappers' vehicle, albeit a level higher, and when Korra stood up to jump down, Mako ordered her to stay seated, though she did not listen."
    },
    {
      "body": "When Asami pulled up alongside Korra, who had subdued the only kidnapper in the truck and informed Wu was not there, Mako roughly slammed the ${link_0} against the side of the vehicle, demanding to know where they had taken the prince. Not receiving a useful answer, Mako handcuffed Kuvira's agent and threw them in the back of a police car that arrived, telling the officer to book the agent for kidnapping, put out an all-points bulletin, and bring Chief Beifong up to speed about the prince's disappearance. When Asami pointed out that Wu could be in one of the thousands of cars in the city or being smuggled out via any other mode of transportation, Mako groaned in frustration, berating himself for letting the prince be kidnapped during the one time that he did not accompany the royal to the bathroom. His anger was replaced by curiousness, however, when he watched Korra place her hand on a spirit vine and declare that Wu was being taken toward Central City Station. En route, he was explained that she had learned from Toph Beifong to connect with people's energy via the vines and expressed his skepticism over being told that Toph was even more \"cranky and miserable\" than Lin.",
      "links": [
        {
          "body": "man",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bathroom_attendant",
            "page": "Bathroom_attendant"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "A tense reunion"
      ],
      "text": "When Asami pulled up alongside Korra, who had subdued the only kidnapper in the truck and informed Wu was not there, Mako roughly slammed the man against the side of the vehicle, demanding to know where they had taken the prince. Not receiving a useful answer, Mako handcuffed Kuvira's agent and threw them in the back of a police car that arrived, telling the officer to book the agent for kidnapping, put out an all-points bulletin, and bring Chief Beifong up to speed about the prince's disappearance. When Asami pointed out that Wu could be in one of the thousands of cars in the city or being smuggled out via any other mode of transportation, Mako groaned in frustration, berating himself for letting the prince be kidnapped during the one time that he did not accompany the royal to the bathroom. His anger was replaced by curiousness, however, when he watched Korra place her hand on a spirit vine and declare that Wu was being taken toward Central City Station. En route, he was explained that she had learned from Toph Beifong to connect with people's energy via the vines and expressed his skepticism over being told that Toph was even more \"cranky and miserable\" than Lin."
    },
    {
      "body": "Arriving at the station, the threesome ran inside, though upon witnessing a multitude of waiting trains without any clue on which one Wu was taken, they split up. Regrouping after an initial futile search, Korra urged them all to hop aboard the 4:15 train leaving the station for ${link_0}. Mako irritatingly asked Korra how she knew Wu was on that train and voiced his skepticism about having to trust her \"Avatar feelings\" being correct about the location. When Korra snapped back that he would not have to trust her if he had guarded the prince as he was directed, he asked in annoyance if it was thus his fault that Wu had been kidnapped. Making their way to the luggage cart, Asami broke up their bickering by ordering them to silence, enabling them all to hear a tapping coming from inside a chest. Mako clicked open the piece of luggage and the prince bolted upright, flailing about. Managing to calm the royal down, he told him that he was on a train. When Kuvira's ${link_1} started to close in on them, Mako and the others fled to the roof of the train, where he dragged Wu along with him. Switching carts, he threw the prince over to Korra, before jumping after them himself. Having his hands free to fight off their assailants, he tried to bend at the nearest attacker, though had his footing pulled from underneath him with a metal cable. Rising up, he used his firebending to sever the cable with which Korra was held and forced the attacker to retreat to the previous wagon. He was forced back himself, however, when another assailant started to metalbend the floor from underneath his feet, curling it back. He was grabbed by Korra, who encircled their little party with air, enabling them all to make a safe landing when they jumped off the speeding train and down a bridge.",
      "links": [
        {
          "body": "Omashu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "agents",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "A tense reunion"
      ],
      "text": "Arriving at the station, the threesome ran inside, though upon witnessing a multitude of waiting trains without any clue on which one Wu was taken, they split up. Regrouping after an initial futile search, Korra urged them all to hop aboard the 4:15 train leaving the station for Omashu. Mako irritatingly asked Korra how she knew Wu was on that train and voiced his skepticism about having to trust her \"Avatar feelings\" being correct about the location. When Korra snapped back that he would not have to trust her if he had guarded the prince as he was directed, he asked in annoyance if it was thus his fault that Wu had been kidnapped. Making their way to the luggage cart, Asami broke up their bickering by ordering them to silence, enabling them all to hear a tapping coming from inside a chest. Mako clicked open the piece of luggage and the prince bolted upright, flailing about. Managing to calm the royal down, he told him that he was on a train. When Kuvira's agents started to close in on them, Mako and the others fled to the roof of the train, where he dragged Wu along with him. Switching carts, he threw the prince over to Korra, before jumping after them himself. Having his hands free to fight off their assailants, he tried to bend at the nearest attacker, though had his footing pulled from underneath him with a metal cable. Rising up, he used his firebending to sever the cable with which Korra was held and forced the attacker to retreat to the previous wagon. He was forced back himself, however, when another assailant started to metalbend the floor from underneath his feet, curling it back. He was grabbed by Korra, who encircled their little party with air, enabling them all to make a safe landing when they jumped off the speeding train and down a bridge."
    },
    {
      "body": "When Mako pulled Wu to his feet, inquiring if he was all right, he was promptly hugged by the royal and thanked profusely. Being told that he was definitely getting a raise, Mako directed the prince's gratitude toward Korra, noting that they would have never found him if it was not for her. When Asami stated that their rescue mission reminded her of their old times, minus the \"getting on each other's nerves part\", Mako good-heartedly jabbed that annoying and be annoyed by Korra was normal for him. Mako and Asami readily accepted Korra's apology for the earlier tension and he revealed that it was great to have her back, embracing her warmly.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "A tense reunion"
      ],
      "text": "When Mako pulled Wu to his feet, inquiring if he was all right, he was promptly hugged by the royal and thanked profusely. Being told that he was definitely getting a raise, Mako directed the prince's gratitude toward Korra, noting that they would have never found him if it was not for her. When Asami stated that their rescue mission reminded her of their old times, minus the \"getting on each other's nerves part\", Mako good-heartedly jabbed that annoying and be annoyed by Korra was normal for him. Mako and Asami readily accepted Korra's apology for the earlier tension and he revealed that it was great to have her back, embracing her warmly."
    },
    {
      "body": "Searching for a place where they could safely leave Wu, Mako took him to the ${link_0}, where he would stay with the rest of his and Bolin's family already residing there. Upon arrival, he had to correct the royal that the mansion was not his, but Asami's. When Yin opened the door, Mako introduced his grandmother to Wu, though had to catch her when she fainted upon receiving a kiss on the hand by him. Explaining to the prince that his grandmother loved royalty, Wu thanked him for looking out for him by bringing him to a luxurious place with people who adored royalty.",
      "links": [
        {
          "body": "Sato estate",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sato_estate",
            "page": "Sato_estate"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "A tense reunion"
      ],
      "text": "Searching for a place where they could safely leave Wu, Mako took him to the Sato estate, where he would stay with the rest of his and Bolin's family already residing there. Upon arrival, he had to correct the royal that the mansion was not his, but Asami's. When Yin opened the door, Mako introduced his grandmother to Wu, though had to catch her when she fainted upon receiving a kiss on the hand by him. Explaining to the prince that his grandmother loved royalty, Wu thanked him for looking out for him by bringing him to a luxurious place with people who adored royalty."
    },
    {
      "body": "Later, Mako suggested that they \"toughen up\" the prince, so that he would be able to protect himself in the future. When the prince assumed a poor defensive stance, Mako easily punched him in the stomach, causing the royal to sag down, crying \"Wu down\". After Wu let himself be cradled by Yin and requested something to eat and drink, Mako berated him, deeming him to be so weak that \"Wu down\" was his catchphrase. When Wu tried to defend himself by pointing out that he was vastly different than Mako since he was not \"raised in the woods by a pack of cops\", the firebender noted that the prince did not know anything about him, because he never bothered to ask. Wu started asking Mako some personal questions and, when Mako revealed that he had once dated the Avatar, their self-defense class was promptly turned into a gab session.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "Reminiscing about the past"
      ],
      "text": "Later, Mako suggested that they \"toughen up\" the prince, so that he would be able to protect himself in the future. When the prince assumed a poor defensive stance, Mako easily punched him in the stomach, causing the royal to sag down, crying \"Wu down\". After Wu let himself be cradled by Yin and requested something to eat and drink, Mako berated him, deeming him to be so weak that \"Wu down\" was his catchphrase. When Wu tried to defend himself by pointing out that he was vastly different than Mako since he was not \"raised in the woods by a pack of cops\", the firebender noted that the prince did not know anything about him, because he never bothered to ask. Wu started asking Mako some personal questions and, when Mako revealed that he had once dated the Avatar, their self-defense class was promptly turned into a gab session."
    },
    {
      "body": "Mako started his story with his time as a Fire Ferret pro-bender, though was immediately interrupted by an excited Wu and asked in annoyance if the prince would just let him tell the story. He told how his aspirations of fame and fortune had changed after he met Korra, though was chided by Wu for his rude treatment of the Avatar the first time he met her. He countered, however, by pointing out that interrupting the story was also rude. He continued by relaying how his friendship with Korra grew, admitting that he felt they had a powerful connection after saving Bolin from the Equalists together. Since Wu believed he would then have kissed Korra, Mako revealed how he had met Asami next and was immediately made fun of by the royal for being stumped for words upon laying eyes on the Sato heiress. As Wu good-heartedly jabbed that he needed to work on his introductions, Mako smugly countered that someone with his charm did not need introductions. He continued to relay his budding love triangle with the two girls and when he told Wu about his kiss with Korra, Mako angrily ordered Tu to leave them alone, as he did not care for being chided by his cousin for having kissed Korra while being in a relationship with Asami. After being reprimanded by his grandmother for taking after his grandfather with his behavior, he tried to defend himself by pointing out that things were not so simple as they made it seem and that he was not dating Asami. When Tu declared him to be in denial, Mako relented and acknowledged that he had been dating Asami, though stressed that it was a very confusing situation. He was chided by Wu and Tu for his ambiguous breakup with Asami and later had to tell his grandmother that his relationship with Korra had not turned out well either. When he told everyone that he had kissed Asami again after her warehouse had been robbed clean, he preemptively defended himself by already pointing out that he had no right kissing her, though Wu deemed it acceptable, since he had not been dating anyone at that time. Mako was severely reprimanded by Wu and his family, however, when he told them that he had not explained to an amnesic Korra that they were no longer together and that he had rekindled his relationship with Asami, prompting Tu to point out that he seemed so afraid to disappoint anyone that he ended up disappointing everyone. Mako ended his story by saying that Korra had shown him the importance of placing others before himself and continued to be a source of inspiration to him. Mako was subsequently urged by Wu to resume their sparring match, though he was slapped on the armed by Yin after knocking the prince down with only one light punch.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "Reminiscing about the past"
      ],
      "text": "Mako started his story with his time as a Fire Ferret pro-bender, though was immediately interrupted by an excited Wu and asked in annoyance if the prince would just let him tell the story. He told how his aspirations of fame and fortune had changed after he met Korra, though was chided by Wu for his rude treatment of the Avatar the first time he met her. He countered, however, by pointing out that interrupting the story was also rude. He continued by relaying how his friendship with Korra grew, admitting that he felt they had a powerful connection after saving Bolin from the Equalists together. Since Wu believed he would then have kissed Korra, Mako revealed how he had met Asami next and was immediately made fun of by the royal for being stumped for words upon laying eyes on the Sato heiress. As Wu good-heartedly jabbed that he needed to work on his introductions, Mako smugly countered that someone with his charm did not need introductions. He continued to relay his budding love triangle with the two girls and when he told Wu about his kiss with Korra, Mako angrily ordered Tu to leave them alone, as he did not care for being chided by his cousin for having kissed Korra while being in a relationship with Asami. After being reprimanded by his grandmother for taking after his grandfather with his behavior, he tried to defend himself by pointing out that things were not so simple as they made it seem and that he was not dating Asami. When Tu declared him to be in denial, Mako relented and acknowledged that he had been dating Asami, though stressed that it was a very confusing situation. He was chided by Wu and Tu for his ambiguous breakup with Asami and later had to tell his grandmother that his relationship with Korra had not turned out well either. When he told everyone that he had kissed Asami again after her warehouse had been robbed clean, he preemptively defended himself by already pointing out that he had no right kissing her, though Wu deemed it acceptable, since he had not been dating anyone at that time. Mako was severely reprimanded by Wu and his family, however, when he told them that he had not explained to an amnesic Korra that they were no longer together and that he had rekindled his relationship with Asami, prompting Tu to point out that he seemed so afraid to disappoint anyone that he ended up disappointing everyone. Mako ended his story by saying that Korra had shown him the importance of placing others before himself and continued to be a source of inspiration to him. Mako was subsequently urged by Wu to resume their sparring match, though he was slapped on the armed by Yin after knocking the prince down with only one light punch."
    },
    {
      "body": "Mako later traveled back to Republic City with Wu, since the royal was invited to attend a meeting between the world leaders, sans the Water Tribes' representatives. He was shocked to find first Korra and Opal and later Bolin and Varrick interrupt the meeting. After the leaders concluded their meeting with the decision to fortify the United Republic's borders, Mako and Korra met up with Bolin outside of the building. Approaching his brother, Mako expressed his happiness over his return as he had been worried about him and embraced him warmly. When Bolin declared himself to be an idiot, apologized to Mako for having left in anger the last time they met after rejecting his advice, and Korra revealed that she felt like no one wanted her around anymore, Mako cheered them both up, telling Korra that if no one else, at least they wanted her around and clarifying to Bolin that he was not an idiot, as he had merely been doing what he thought was right, before they all shared another embrace.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "Supporting Korra"
      ],
      "text": "Mako later traveled back to Republic City with Wu, since the royal was invited to attend a meeting between the world leaders, sans the Water Tribes' representatives. He was shocked to find first Korra and Opal and later Bolin and Varrick interrupt the meeting. After the leaders concluded their meeting with the decision to fortify the United Republic's borders, Mako and Korra met up with Bolin outside of the building. Approaching his brother, Mako expressed his happiness over his return as he had been worried about him and embraced him warmly. When Bolin declared himself to be an idiot, apologized to Mako for having left in anger the last time they met after rejecting his advice, and Korra revealed that she felt like no one wanted her around anymore, Mako cheered them both up, telling Korra that if no one else, at least they wanted her around and clarifying to Bolin that he was not an idiot, as he had merely been doing what he thought was right, before they all shared another embrace."
    },
    {
      "body": "When Bolin left, Mako and Korra continued talking to one another, though their conversation was interrupted by Jinora's ${link_0}, who called for help as the spirit vines were taking her captive. Searching the ${link_1}, they were attacked by vines themselves. Although Mako tried to fight them off, he was captured and lifted up in the air. He was saved when Korra severed the vine with her firebending and they both retreated into a nearby building. Inside, Mako noticed some glowing pods and, upon learning they contained the bodies of the captured people, he prepared to forcefully extract them with firebending. He was stopped from doing so by Korra, however, since his action would have provoked the vines. When Korra gasped for air after failing to meditate into the Spirit World, Mako rushed to her side, asking what was wrong. Learning Zaheer's memory was still haunting her, he reassured her that he was there for her, offering his help in any way she needed it. As such, he accompanied her to ${link_2}, where she faced the airbender by herself, hoping it would give her peace of mind. As she returned, Korra told Mako that she felt whole again, since she was finally able to accept what had happened to her.",
      "links": [
        {
          "body": "spiritual projection",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spiritual_projection",
            "page": "Spiritual_projection"
          }
        },
        {
          "body": "Spirit Wilds",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "Zaheer's prison",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/White_Lotus_prisons#Zaheer.27s_prisons",
            "page": "White_Lotus_prisons"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "Supporting Korra"
      ],
      "text": "When Bolin left, Mako and Korra continued talking to one another, though their conversation was interrupted by Jinora's spiritual projection, who called for help as the spirit vines were taking her captive. Searching the Spirit Wilds, they were attacked by vines themselves. Although Mako tried to fight them off, he was captured and lifted up in the air. He was saved when Korra severed the vine with her firebending and they both retreated into a nearby building. Inside, Mako noticed some glowing pods and, upon learning they contained the bodies of the captured people, he prepared to forcefully extract them with firebending. He was stopped from doing so by Korra, however, since his action would have provoked the vines. When Korra gasped for air after failing to meditate into the Spirit World, Mako rushed to her side, asking what was wrong. Learning Zaheer's memory was still haunting her, he reassured her that he was there for her, offering his help in any way she needed it. As such, he accompanied her to Zaheer's prison, where she faced the airbender by herself, hoping it would give her peace of mind. As she returned, Korra told Mako that she felt whole again, since she was finally able to accept what had happened to her."
    },
    {
      "body": "Mako later accompanied Wu to a group meeting with President Raiko, Korra, Tenzin, Varrick, and Asami, during which the latter two revealed their plans to manufacture a ${link_0} that could fly in any direction. After the meeting was adjourned, Mako complimented Wu on his suggestion to start evacuation the city in case Kuvira attacked, noting that he was proud of him for starting to act like the kind of king he liked to work for. His mood was broken, however, when Wu stated that he only did so to have a chance of dating Korra.",
      "links": [
        {
          "body": "mecha suit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_suit",
            "page": "Mecha_suit"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "Supporting Korra"
      ],
      "text": "Mako later accompanied Wu to a group meeting with President Raiko, Korra, Tenzin, Varrick, and Asami, during which the latter two revealed their plans to manufacture a mecha suit that could fly in any direction. After the meeting was adjourned, Mako complimented Wu on his suggestion to start evacuation the city in case Kuvira attacked, noting that he was proud of him for starting to act like the kind of king he liked to work for. His mood was broken, however, when Wu stated that he only did so to have a chance of dating Korra."
    },
    {
      "body": "Some time later, Mako sat in on another meeting with Tenzin, Korra, Wu, and Raiko to discuss the progress of the evacuation. When Wu reported that they had barely evacuated eighteen families, Mako noted that the problem was that it was a voluntary evacuation and since the people did not feel like they were in any immediate danger, not many of them were willing to leave their home. After Raiko made the evacuation mandatory upon learning that Kuvira planned to ${link_0} two weeks later, Mako, Lin, and Wu traveled toward the police headquarters, where Mako was patched in on the emergency broadcast line, which reached every radio in the city. He alerted the people that an attack on the city was imminent and that they were ordered to evacuate. He referred them all to their evacuation handbooks for further instructions on where to go. When the radio operator notified Lin that they were receiving confused calls from all over the city, concluding that Mako was starting a panic, Mako indignantly asked how he was confusing people since he was giving specific instructions straight out of the manual, though nonetheless allowed Wu to take over. Impressed with how the royal managed to calm to people down and stop the influx of calls, Mako placed a supporting hand on his shoulder.",
      "links": [
        {
          "body": "attack the city",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "Defending Republic City"
      ],
      "text": "Some time later, Mako sat in on another meeting with Tenzin, Korra, Wu, and Raiko to discuss the progress of the evacuation. When Wu reported that they had barely evacuated eighteen families, Mako noted that the problem was that it was a voluntary evacuation and since the people did not feel like they were in any immediate danger, not many of them were willing to leave their home. After Raiko made the evacuation mandatory upon learning that Kuvira planned to attack the city two weeks later, Mako, Lin, and Wu traveled toward the police headquarters, where Mako was patched in on the emergency broadcast line, which reached every radio in the city. He alerted the people that an attack on the city was imminent and that they were ordered to evacuate. He referred them all to their evacuation handbooks for further instructions on where to go. When the radio operator notified Lin that they were receiving confused calls from all over the city, concluding that Mako was starting a panic, Mako indignantly asked how he was confusing people since he was giving specific instructions straight out of the manual, though nonetheless allowed Wu to take over. Impressed with how the royal managed to calm to people down and stop the influx of calls, Mako placed a supporting hand on his shoulder."
    },
    {
      "body": "Mako later talked to Korra, Bolin, and Asami and decided that they would try to take out the spirit energy cannon in order to increase the United Forces' chances of winning against Kuvira. Discovering the army the next day to only being hours away from the city, a week before they had been expecting them, Mako was baffled about the speed of their progress, since there were no train tracks to transport the cannon on. Discovering the enormous mecha suit and narrowly missing being shot out of the sky, Team Avatar returned to Air Temple Island, where they reported on Kuvira's progress. With her attack imminent, Mako, Bolin, Asami, Suyin, Wei, and Wing headed toward a Future Industries factory in an attempt to finish construction on a few ${link_0}. From there, he witnessed in shock how Kuvira destroyed the United Forces battleships in a matter of seconds.",
      "links": [
        {
          "body": "hummingbird mecha suits",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hummingbird_mecha_suit",
            "page": "Hummingbird_mecha_suit"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "Defending Republic City"
      ],
      "text": "Mako later talked to Korra, Bolin, and Asami and decided that they would try to take out the spirit energy cannon in order to increase the United Forces' chances of winning against Kuvira. Discovering the army the next day to only being hours away from the city, a week before they had been expecting them, Mako was baffled about the speed of their progress, since there were no train tracks to transport the cannon on. Discovering the enormous mecha suit and narrowly missing being shot out of the sky, Team Avatar returned to Air Temple Island, where they reported on Kuvira's progress. With her attack imminent, Mako, Bolin, Asami, Suyin, Wei, and Wing headed toward a Future Industries factory in an attempt to finish construction on a few hummingbird mecha suits. From there, he witnessed in shock how Kuvira destroyed the United Forces battleships in a matter of seconds."
    },
    {
      "body": "After Korra later brought a kidnapped ${link_0} to the factory as well, Mako stood by while she and Suyin tried to convince him to reveal how they could defeat the enormous mecha suit carrying the spirit energy weapon. After Baatar Jr. contacted Kuvira and seemingly succeeded to convince her to cease her conquest of the United Republic, Mako noticed that the enormous mecha suit was aiming the spirit cannon at their location. They all tried to evacuate the factory, though could not outrun the energy beam fired at them.",
      "links": [
        {
          "body": "Baatar Jr.",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Baatar_Jr",
            "page": "Baatar_Jr"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "Defending Republic City"
      ],
      "text": "After Korra later brought a kidnapped Baatar Jr. to the factory as well, Mako stood by while she and Suyin tried to convince him to reveal how they could defeat the enormous mecha suit carrying the spirit energy weapon. After Baatar Jr. contacted Kuvira and seemingly succeeded to convince her to cease her conquest of the United Republic, Mako noticed that the enormous mecha suit was aiming the spirit cannon at their location. They all tried to evacuate the factory, though could not outrun the energy beam fired at them."
    },
    {
      "body": "Mako managed to survive the explosion and emerged from the rubble with everyone else when Bolin lifted a large piece of concrete. He refused to leave the city to Kuvira, however, as he was worried that she would fire her weapon at Wu and the refugees he was with, killing them all. Mako joined Korra and the other benders on their quest to take down the spirit energy cannon, while Varrick and Asami worked on adjusting the prototypes of the hummingbird mecha suits in order to provide them with air support. He watched in worry from the cover of an alley with Bolin, Lin, Wei, and Wing how the airbenders assaulted Kuvira's machine with paint balloons, covering its windows and obscuring the vision of the pilots, enabling the earthbenders on the ground to tie down the suit's legs. When Kuvira shot the spirit energy cannon at the airbenders, who had been trying to blow the machine off balance, Mako rushed to the side of a female airbender who had been knocked down by the energy emanating from the beam that had nearly hit her. After helping her to her feet, he retreated with everyone else to Asami's office at Future Industries Tower.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "Defending Republic City"
      ],
      "text": "Mako managed to survive the explosion and emerged from the rubble with everyone else when Bolin lifted a large piece of concrete. He refused to leave the city to Kuvira, however, as he was worried that she would fire her weapon at Wu and the refugees he was with, killing them all. Mako joined Korra and the other benders on their quest to take down the spirit energy cannon, while Varrick and Asami worked on adjusting the prototypes of the hummingbird mecha suits in order to provide them with air support. He watched in worry from the cover of an alley with Bolin, Lin, Wei, and Wing how the airbenders assaulted Kuvira's machine with paint balloons, covering its windows and obscuring the vision of the pilots, enabling the earthbenders on the ground to tie down the suit's legs. When Kuvira shot the spirit energy cannon at the airbenders, who had been trying to blow the machine off balance, Mako rushed to the side of a female airbender who had been knocked down by the energy emanating from the beam that had nearly hit her. After helping her to her feet, he retreated with everyone else to Asami's office at Future Industries Tower."
    },
    {
      "body": "Mako took part in the new plan that was formed: the benders would relentlessly attack the mecha suit to distract Kuvira and enable the two hummingbird mecha suits to land on the enormous machine and cut a hole in it without being crushed. Their plan only partially worked, however, as he was shocked to see Kuvira crush Hiroshi to death in his hummingbird suit just as he completed his mission. Realizing they now had an opening, Mako used his firebending to propel himself atop the machine. As Korra used her waterbending to prevent the mecha suit from crushing them as well, he managed to dive inside the hole together with Suyin, Lin, Bolin, and Korra.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "Defending Republic City"
      ],
      "text": "Mako took part in the new plan that was formed: the benders would relentlessly attack the mecha suit to distract Kuvira and enable the two hummingbird mecha suits to land on the enormous machine and cut a hole in it without being crushed. Their plan only partially worked, however, as he was shocked to see Kuvira crush Hiroshi to death in his hummingbird suit just as he completed his mission. Realizing they now had an opening, Mako used his firebending to propel himself atop the machine. As Korra used her waterbending to prevent the mecha suit from crushing them as well, he managed to dive inside the hole together with Suyin, Lin, Bolin, and Korra."
    },
    {
      "body": "Inside, Mako was ordered by Korra to climb up to the engine room with Bolin and try to power the machine down. After Bolin cut through the locks on the hatch to grand them access to the room, Mako instantly went after the metalbender guarding one of the levers that could cut the power, while Bolin focused on the other. Dodging the incoming metal projectiles, he retaliated with his firebending, though was knocked back by a small explosion of the spirit vine core, when his bending arm was hit by a metal strip and he accidentally fired at the vines. He quickly recovered, however, and after verifying that Bolin had not been affected by the explosion, resumed his attack. After trading several blows, switching between offense and defense, Mako managed to get close enough to his opponent and throw him roughly to the ground with a shoulder-toss, rendering him unconscious. When Bolin yelled that he had also managed to secure his lever, Mako counted to coordinate their actions, Baatar Jr.'s instructions to simultaneously pull the levers to power down the suit in mind.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "Defending Republic City"
      ],
      "text": "Inside, Mako was ordered by Korra to climb up to the engine room with Bolin and try to power the machine down. After Bolin cut through the locks on the hatch to grand them access to the room, Mako instantly went after the metalbender guarding one of the levers that could cut the power, while Bolin focused on the other. Dodging the incoming metal projectiles, he retaliated with his firebending, though was knocked back by a small explosion of the spirit vine core, when his bending arm was hit by a metal strip and he accidentally fired at the vines. He quickly recovered, however, and after verifying that Bolin had not been affected by the explosion, resumed his attack. After trading several blows, switching between offense and defense, Mako managed to get close enough to his opponent and throw him roughly to the ground with a shoulder-toss, rendering him unconscious. When Bolin yelled that he had also managed to secure his lever, Mako counted to coordinate their actions, Baatar Jr.'s instructions to simultaneously pull the levers to power down the suit in mind."
    },
    {
      "body": "When nothing happened, Mako ran over to Bolin and noted that there had to be another way to shut down the power, relying on him to know what to do since he had spent time working with Baatar Jr. and Varrick. As Bolin revealed that all he knew about the vines was that if they were disturbed, they would explode, Mako ordered him to take all the engineers to safety and explained that he planned to zap the vines with lightning. Seeing no other way to shut the machine down, Mako brushed off Bolin's concerns about the dangers of his plan and, after promising him that he would get out as soon as he could and telling him he loved him, started to charge his attack. Hitting the vines with a continuous bolt of lightning, the power core started to overload and explode; even after being thrown back and having his arm burned by the strain the lightning put on it, Mako kept up his attack. He started to move toward the escape hatch, though before he could reach it, he was struck in his chest by a backlash of spirit energy, which rendered him unconscious. He was saved, however, by Bolin, who had returned for him and carried him to the lower parts of the suit to be protected from the devastating explosion of the power core that blasted the suit in half.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "Defending Republic City"
      ],
      "text": "When nothing happened, Mako ran over to Bolin and noted that there had to be another way to shut down the power, relying on him to know what to do since he had spent time working with Baatar Jr. and Varrick. As Bolin revealed that all he knew about the vines was that if they were disturbed, they would explode, Mako ordered him to take all the engineers to safety and explained that he planned to zap the vines with lightning. Seeing no other way to shut the machine down, Mako brushed off Bolin's concerns about the dangers of his plan and, after promising him that he would get out as soon as he could and telling him he loved him, started to charge his attack. Hitting the vines with a continuous bolt of lightning, the power core started to overload and explode; even after being thrown back and having his arm burned by the strain the lightning put on it, Mako kept up his attack. He started to move toward the escape hatch, though before he could reach it, he was struck in his chest by a backlash of spirit energy, which rendered him unconscious. He was saved, however, by Bolin, who had returned for him and carried him to the lower parts of the suit to be protected from the devastating explosion of the power core that blasted the suit in half."
    },
    {
      "body": "After they both regained consciousness, Mako was supported by Bolin and helped out of the wreckage of the mecha suit. As they emerged from a hatch, they were shocked to find that the Spirit Wilds had been blasted open, which happened when Kuvira had fired the spirit energy cannon from within the vegetation, and housed a new spirit portal in its center. Realizing Korra and Kuvira were nowhere to be found, Mako and the rest of Team Avatar set out to search the area for the Avatar. He made his way to the cockpit of the enormous suit, knowing the two women had been battling there, though when Jinora signaled it was deserted, he turned to Tenzin and relayed the news. Urged to keep looking, Mako watched in surprise how the spirits emerged a few moments later from the new portal, followed by Korra and Kuvira. After Kuvira was handcuffed and escorted away, he joined his friends in the group hug they bestowed on Korra.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "Defending Republic City"
      ],
      "text": "After they both regained consciousness, Mako was supported by Bolin and helped out of the wreckage of the mecha suit. As they emerged from a hatch, they were shocked to find that the Spirit Wilds had been blasted open, which happened when Kuvira had fired the spirit energy cannon from within the vegetation, and housed a new spirit portal in its center. Realizing Korra and Kuvira were nowhere to be found, Mako and the rest of Team Avatar set out to search the area for the Avatar. He made his way to the cockpit of the enormous suit, knowing the two women had been battling there, though when Jinora signaled it was deserted, he turned to Tenzin and relayed the news. Urged to keep looking, Mako watched in surprise how the spirits emerged a few moments later from the new portal, followed by Korra and Kuvira. After Kuvira was handcuffed and escorted away, he joined his friends in the group hug they bestowed on Korra."
    },
    {
      "body": "Mako joined up with Wu and the evacuees and was told by Tu that the royal had been level-headed during the stressful evacuation. He later attended the wedding ceremony of Varrick and Zhu Li at Air Temple Island, where he was seated next to King Wu and Asami. Afterward, during the dinner party, Mako revealed to Wu that he was impressed by the attitude he had sported during the evacuation and believed he would make a great leader, though immediately added that said belief did not mean he would help the royal get a date with Korra. When Wu announced to him and Korra that he planned to abolish the monarchy, Mako incredulously asked if he was joking, though after being explained that it was to establish independent states with a democratically elected government, he declared it to be a wise and mature move of Wu. After the royal left for dance floor, Mako was thanked by Korra for his help with Kuvira. He told her that he would always follow her into battle, emphasizing that he was there for her and always would be.",
      "links": [],
      "section": [
        "History of Mako (174 AG)",
        "Defending Republic City"
      ],
      "text": "Mako joined up with Wu and the evacuees and was told by Tu that the royal had been level-headed during the stressful evacuation. He later attended the wedding ceremony of Varrick and Zhu Li at Air Temple Island, where he was seated next to King Wu and Asami. Afterward, during the dinner party, Mako revealed to Wu that he was impressed by the attitude he had sported during the evacuation and believed he would make a great leader, though immediately added that said belief did not mean he would help the royal get a date with Korra. When Wu announced to him and Korra that he planned to abolish the monarchy, Mako incredulously asked if he was joking, though after being explained that it was to establish independent states with a democratically elected government, he declared it to be a wise and mature move of Wu. After the royal left for dance floor, Mako was thanked by Korra for his help with Kuvira. He told her that he would always follow her into battle, emphasizing that he was there for her and always would be."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "See also"
      ],
      "text": "Mako"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Mako (152 AG - 170 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Mako_(152_AG_-_170_AG)",
            "page": "History_of_Mako_(152_AG_-_170_AG)"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "See also"
      ],
      "text": "History of Mako (152 AG - 170 AG)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Mako (171 AG - Harmonic Convergence)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Mako_(171_AG_-_Harmonic_Convergence)",
            "page": "History_of_Mako_(171_AG_-_Harmonic_Convergence)"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "See also"
      ],
      "text": "History of Mako (171 AG - Harmonic Convergence)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Mako (late 171 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Mako_(late_171_AG)",
            "page": "History_of_Mako_(late_171_AG)"
          }
        }
      ],
      "section": [
        "History of Mako (174 AG)",
        "See also"
      ],
      "text": "History of Mako (late 171 AG)"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Mako_(174_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Mako_(174_AG).html",
    "page": "History_of_Mako_(174_AG)",
    "title": "History of Mako (174 AG)"
  }
}