{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "With a shift in the world's energy due to ${link_0}, ${link_1} and ${link_2} set out to scour the ${link_3} in search for the new ${link_4} to offer training and guidance. However, while the ${link_5} is slowly being rebuilt, Korra is faced with a new danger when ${link_6} and his fellow ${link_7} accomplices escape their respective prisons and set out to bring ${link_8} down and succumb the ${link_9} into anarchy. Their belief that disorder is the natural order poses a lethal threat to Korra, and she must fight to save not only the balance of the nations in the world, but also herself and the ${link_10} Cycle.",
      "links": [
        {
          "body": "Harmonic Convergence",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "her allies",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Air Nation",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomads#Rebirth_of_a_nation",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "all the nations",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Four_nations",
            "page": "Four_nations"
          }
        },
        {
          "body": "world",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)"
      ],
      "text": "With a shift in the world's energy due to Harmonic Convergence, Korra and her allies set out to scour the Earth Kingdom in search for the new airbenders to offer training and guidance. However, while the Air Nation is slowly being rebuilt, Korra is faced with a new danger when Zaheer and his fellow Red Lotus accomplices escape their respective prisons and set out to bring all the nations down and succumb the world into anarchy. Their belief that disorder is the natural order poses a lethal threat to Korra, and she must fight to save not only the balance of the nations in the world, but also herself and the Avatar Cycle."
    },
    {
      "body": "Shortly after the ${link_0}, Korra, ${link_1}, and ${link_2} participated in a ${link_3} tournament orchestrated to help raise funds to repair the damage ${link_4} sustained from the ${link_5}'s attack. During their match, the distracted brothers were quickly thrown into the water, leaving Korra to fend for herself. Despite the odds stacked against her, she managed to win the match with a knockout. While walking home after the fight, she noticed some ${link_6} members with an ${link_7} in a dark alley. Believing the mobsters to be threatening the old man, she approached, causing the Triple Threats to flee. Korra turned her attention to the old man to verify if he was all right, though he only laughed evilly while vanishing in the shadows, much to the Avatar's confusion. Caught off guard, Korra was attacked by ${link_8} darts, which rendered her unconscious.",
      "links": [
        {
          "body": "Unalaq Crisis",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq_Crisis",
            "page": "Unalaq_Crisis"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "pro-bending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending",
            "page": "Pro-bending"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Dark Avatar",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_Avatar",
            "page": "Dark_Avatar"
          }
        },
        {
          "body": "Triple Threat Triad",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "old man",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Hundun",
            "page": "Hundun"
          }
        },
        {
          "body": "chi blocking",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Chi_blocking",
            "page": "Chi_blocking"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Facing Hundun"
      ],
      "text": "Shortly after the Unalaq Crisis, Korra, Mako, and Bolin participated in a pro-bending tournament orchestrated to help raise funds to repair the damage Republic City sustained from the Dark Avatar's attack. During their match, the distracted brothers were quickly thrown into the water, leaving Korra to fend for herself. Despite the odds stacked against her, she managed to win the match with a knockout. While walking home after the fight, she noticed some Triple Threat Triad members with an old man in a dark alley. Believing the mobsters to be threatening the old man, she approached, causing the Triple Threats to flee. Korra turned her attention to the old man to verify if he was all right, though he only laughed evilly while vanishing in the shadows, much to the Avatar's confusion. Caught off guard, Korra was attacked by chi blocking darts, which rendered her unconscious."
    },
    {
      "body": "Korra later awoke to hear the old man ordering the ${link_0} blockers to finish her while she was still weak. As the old man disappeared, she attempted to bend at the chi blockers, though failed and was forced to run. As she navigated her way through the back allies and limited to use hand-to-hand combat to fight off the ${link_1}, Korra was amazed at how much longer the chi blocking was lasting than normal. Although she deduced that the old man was leading the Equalists with Amon gone, she had no idea why she was being targeted. Korra was eventually cornered and outnumbered by the Equalists. However, before they could capture her, ${link_2} came to her rescue and they sped away to safety. Korra headed toward ${link_3}, hoping that ${link_4} could help her unblock her bending.",
      "links": [
        {
          "body": "chi",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Chi",
            "page": "Chi"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Naga",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Naga",
            "page": "Naga"
          }
        },
        {
          "body": "Air Temple Island",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Facing Hundun"
      ],
      "text": "Korra later awoke to hear the old man ordering the chi blockers to finish her while she was still weak. As the old man disappeared, she attempted to bend at the chi blockers, though failed and was forced to run. As she navigated her way through the back allies and limited to use hand-to-hand combat to fight off the Equalists, Korra was amazed at how much longer the chi blocking was lasting than normal. Although she deduced that the old man was leading the Equalists with Amon gone, she had no idea why she was being targeted. Korra was eventually cornered and outnumbered by the Equalists. However, before they could capture her, Naga came to her rescue and they sped away to safety. Korra headed toward Air Temple Island, hoping that Tenzin could help her unblock her bending."
    },
    {
      "body": "Having crossed ${link_0}, Korra discovered Air Temple Island to be deserted, though ${link_1}'s ${link_2} to her, as the young airbender had sensed her distress and came to help. In an effort to help the Avatar regain access to her ${link_3}, Korra was advised to find jars containing spirit water on the island, though this task proved difficult as they were mixed with jars of regular water. Before Korra could locate enough water, however, she was shocked to learn that the Equalists and Triple Threat Triad had arrived on the island and were working together to defeat her. Despite these threats, she managed to find enough spirit water to regain her waterbending and with it, Korra purged Air Temple Island of chi blockers and Triple Threat Triad members. Still in need of answers as to what happened to her bending, she pursued them back into the city.",
      "links": [
        {
          "body": "Yue Bay",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Yue_Bay",
            "page": "Yue_Bay"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "spirit appeared",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Spiritual_projection",
            "page": "Spiritual_projection"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Facing Hundun"
      ],
      "text": "Having crossed Yue Bay, Korra discovered Air Temple Island to be deserted, though Jinora's spirit appeared to her, as the young airbender had sensed her distress and came to help. In an effort to help the Avatar regain access to her waterbending, Korra was advised to find jars containing spirit water on the island, though this task proved difficult as they were mixed with jars of regular water. Before Korra could locate enough water, however, she was shocked to learn that the Equalists and Triple Threat Triad had arrived on the island and were working together to defeat her. Despite these threats, she managed to find enough spirit water to regain her waterbending and with it, Korra purged Air Temple Island of chi blockers and Triple Threat Triad members. Still in need of answers as to what happened to her bending, she pursued them back into the city."
    },
    {
      "body": "After traversing the city, which had been riddled with holes caused by the ${link_0}, Korra encountered an Equalist ${link_1}. During the battle, she was once again aided by Jinora's spirit, who suggested to stand her ground and counter the opponent's moves in order to regain her ${link_2} abilities. Following up on the advice, Korra successfully accessed her earthbending and used it, along with her waterbending, to destroy the mecha tank. When more chi blockers showed up, she angrily asked how they got a mecha tank before quickly defeating them. The Equalist threat was replaced by a triad one, as ${link_3}, ${link_4}, and an earthbender appeared to fight her. After she defeated them too, Korra was told by Jinora's spirit that the answer to how her bending was taken could possibly be found in the ${link_5}. Before she could make her way to the Southern ${link_6}, however, she was attacked once more by a mecha tank. After destroying it, she questioned the pilot and learned that the old man she had seen earlier was indeed now leading the Equalists and had a plan to steal her chi to create order from chaos. After casting the pilot into Yue Bay, Korra headed for the ${link_7}.",
      "links": [
        {
          "body": "spirit vines",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "mecha tank",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Viper",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Viper",
            "page": "Viper"
          }
        },
        {
          "body": "Two Toed Ping",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Two_Toed_Ping",
            "page": "Two_Toed_Ping"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Facing Hundun"
      ],
      "text": "After traversing the city, which had been riddled with holes caused by the spirit vines, Korra encountered an Equalist mecha tank. During the battle, she was once again aided by Jinora's spirit, who suggested to stand her ground and counter the opponent's moves in order to regain her earthbending abilities. Following up on the advice, Korra successfully accessed her earthbending and used it, along with her waterbending, to destroy the mecha tank. When more chi blockers showed up, she angrily asked how they got a mecha tank before quickly defeating them. The Equalist threat was replaced by a triad one, as Viper, Two Toed Ping, and an earthbender appeared to fight her. After she defeated them too, Korra was told by Jinora's spirit that the answer to how her bending was taken could possibly be found in the Spirit World. Before she could make her way to the Southern spirit portal, however, she was attacked once more by a mecha tank. After destroying it, she questioned the pilot and learned that the old man she had seen earlier was indeed now leading the Equalists and had a plan to steal her chi to create order from chaos. After casting the pilot into Yue Bay, Korra headed for the Southern Water Tribe."
    },
    {
      "body": "Upon arriving at the ${link_0} after a week's journey, Korra encountered more Triple Threats and Equalists, who had been waiting for her. During this battle, Korra was once again aided by Jinora's spirit, who helped her unlock her ${link_1} by tapping into her aggression with relentless attacks and combos. Using the three elements at her disposal, Korra defeated all of her opponents and continued her journey to the spirit portal. Arriving, she found the old man accompanied by ${link_2} and was promptly attacked by the dark entities and more chi blockers, while the elder entered the Spirit World. During the fight, Korra unlocked her airbending by following Jinora's advice of utilizing evasive maneuvers. Although she defeated the chi blockers, she was launched into the spirit portal by the dark spirits.",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "dark spirits",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Facing Hundun"
      ],
      "text": "Upon arriving at the South Pole after a week's journey, Korra encountered more Triple Threats and Equalists, who had been waiting for her. During this battle, Korra was once again aided by Jinora's spirit, who helped her unlock her firebending by tapping into her aggression with relentless attacks and combos. Using the three elements at her disposal, Korra defeated all of her opponents and continued her journey to the spirit portal. Arriving, she found the old man accompanied by dark spirits and was promptly attacked by the dark entities and more chi blockers, while the elder entered the Spirit World. During the fight, Korra unlocked her airbending by following Jinora's advice of utilizing evasive maneuvers. Although she defeated the chi blockers, she was launched into the spirit portal by the dark spirits."
    },
    {
      "body": "In the Spirit World, after making her way past several dark spirits by ${link_0} them, Korra was able to confront the man in front of the ${link_1}. He introduced himself as Hundun, an ancient king and master of the Chaotic Attack, who had used his vast fortune and charisma to gain control of the Triple Threat Triad and Equalists, respectively. Korra was trapped in several illusions by him with the goal to have her soul tormented for eternity. Korra managed to break free, however, and faced the dark spirits the fallen king sent to attack her. Listening to Jinora's words again, Korra was able to tap into greater levels of the Avatar State's power and easily repelled all her attackers.",
      "links": [
        {
          "body": "spiritbending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Healing#Spiritbending",
            "page": "Healing"
          }
        },
        {
          "body": "Tree of Time",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Facing Hundun"
      ],
      "text": "In the Spirit World, after making her way past several dark spirits by spiritbending them, Korra was able to confront the man in front of the Tree of Time. He introduced himself as Hundun, an ancient king and master of the Chaotic Attack, who had used his vast fortune and charisma to gain control of the Triple Threat Triad and Equalists, respectively. Korra was trapped in several illusions by him with the goal to have her soul tormented for eternity. Korra managed to break free, however, and faced the dark spirits the fallen king sent to attack her. Listening to Jinora's words again, Korra was able to tap into greater levels of the Avatar State's power and easily repelled all her attackers."
    },
    {
      "body": "Korra was forced out of the Avatar State, however, as Hundun used his powers to lift the ground they were standing on into the air. As he calmly told her of his plan to extract her chi, she defied him and managed to defeat his remaining dark spirits. His allies beaten, Korra threatened Hundun to either retreat or be destroyed, a choice he laughed away. Telling her that she had yet to meet his brother, Korra noticed, to her shock, an extra pair of feet behind Hundun's, which turned out to be of his conjoined twin brother. Korra was attacked by the brothers and, under the power of their Chaotic Attack, she was pressured with great physical strength, earthbending, dark energy blasts, special barriers, and even dark energy pools from which more dark spirits emerged. However, Korra was eventually able to enter the Avatar State again, with which she easily repelled her opponents. With the brothers weakened enough, Korra used her spiritbending on them, causing them dissipate.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Facing Hundun"
      ],
      "text": "Korra was forced out of the Avatar State, however, as Hundun used his powers to lift the ground they were standing on into the air. As he calmly told her of his plan to extract her chi, she defied him and managed to defeat his remaining dark spirits. His allies beaten, Korra threatened Hundun to either retreat or be destroyed, a choice he laughed away. Telling her that she had yet to meet his brother, Korra noticed, to her shock, an extra pair of feet behind Hundun's, which turned out to be of his conjoined twin brother. Korra was attacked by the brothers and, under the power of their Chaotic Attack, she was pressured with great physical strength, earthbending, dark energy blasts, special barriers, and even dark energy pools from which more dark spirits emerged. However, Korra was eventually able to enter the Avatar State again, with which she easily repelled her opponents. With the brothers weakened enough, Korra used her spiritbending on them, causing them dissipate."
    },
    {
      "body": "After accepting that leaving the spirit portals open would lead to many unexpected events to come, Korra returned to Republic City. Later, she, along with Mako and Bolin, made it to the finals of the pro-bending tournament where they had a rematch against the ${link_0} and won.",
      "links": [
        {
          "body": "White Falls Wolfbats",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/White_Falls_Wolfbats",
            "page": "White_Falls_Wolfbats"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Facing Hundun"
      ],
      "text": "After accepting that leaving the spirit portals open would lead to many unexpected events to come, Korra returned to Republic City. Later, she, along with Mako and Bolin, made it to the finals of the pro-bending tournament where they had a rematch against the White Falls Wolfbats and won."
    },
    {
      "body": "In the following week since defeating Hundun, Korra continued to struggle with the changes that Harmonic Convergence brought. The spirit vines created by the Dark Avatar remained and had taken over parts of Republic City, leaving countless citizens homeless. Despite numerous efforts, Korra remained unable to remove them, causing her approval ratings to drop dramatically to eight percent. She also clashed with ${link_0} ${link_1}, who, facing his own low approval ratings, attempted to shift blame onto her. Regardless, the Avatar understood why she would have such ratings, believing she should be able to fix the situation.",
      "links": [
        {
          "body": "President",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Raiko",
            "page": "Raiko"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Rebirth of the Air Nation"
      ],
      "text": "In the following week since defeating Hundun, Korra continued to struggle with the changes that Harmonic Convergence brought. The spirit vines created by the Dark Avatar remained and had taken over parts of Republic City, leaving countless citizens homeless. Despite numerous efforts, Korra remained unable to remove them, causing her approval ratings to drop dramatically to eight percent. She also clashed with President Raiko, who, facing his own low approval ratings, attempted to shift blame onto her. Regardless, the Avatar understood why she would have such ratings, believing she should be able to fix the situation."
    },
    {
      "body": "Later, at dinner, Korra learned that ${link_0} had developed airbending abilities and witnessed them firsthand. The next day, while watching the retired commander attempt to replicate the feat, Korra wondered if it was because of her actions during Harmonic Convergence. Mako and ${link_1} soon arrived on the island, explaining there were other reports of airbenders within the city. She also questioned Mako as to why he did not just live on Air Temple Island, but the firebender dodged the question.",
      "links": [
        {
          "body": "Bumi",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Lin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Rebirth of the Air Nation"
      ],
      "text": "Later, at dinner, Korra learned that Bumi had developed airbending abilities and witnessed them firsthand. The next day, while watching the retired commander attempt to replicate the feat, Korra wondered if it was because of her actions during Harmonic Convergence. Mako and Lin soon arrived on the island, explaining there were other reports of airbenders within the city. She also questioned Mako as to why he did not just live on Air Temple Island, but the firebender dodged the question."
    },
    {
      "body": "Korra and ${link_0} soon went out for a drive, which the young Avatar struggled to do. The two had a discussion about Mako and what happened while they were involved with him. Korra was glad he did not come between them and was glad to have a girlfriend to hang out with. She soon drove up to a vine and quickly stopped before being confronted by an ${link_1}. She soon got an idea to rid the city of the vines after the spirit told her they were one and the same. However, Raiko and the ${link_2} soon approached, and Korra demanded they ask no questions. She subsequently entered the Avatar State and began using spiritbending, which appeared to have initial success as the vines receded into the water. Just as the press began asking her questions, however, the plants quickly regenerated and became even more numerous. Korra quickly evacuated a nearby building, flying up on her ${link_3} to save a boy who was trapped in an upper level. As its top spire began to collapse, she saved the boy by rapidly gliding him down, and spared the citizens of further injury by catching the spire with earthbending and easing it to the ground.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "angry spirit",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fruithog",
            "page": "Fruithog"
          }
        },
        {
          "body": "press",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_press",
            "page": "Republic_City_press"
          }
        },
        {
          "body": "glider",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Glider",
            "page": "Glider"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Rebirth of the Air Nation"
      ],
      "text": "Korra and Asami soon went out for a drive, which the young Avatar struggled to do. The two had a discussion about Mako and what happened while they were involved with him. Korra was glad he did not come between them and was glad to have a girlfriend to hang out with. She soon drove up to a vine and quickly stopped before being confronted by an angry spirit. She soon got an idea to rid the city of the vines after the spirit told her they were one and the same. However, Raiko and the press soon approached, and Korra demanded they ask no questions. She subsequently entered the Avatar State and began using spiritbending, which appeared to have initial success as the vines receded into the water. Just as the press began asking her questions, however, the plants quickly regenerated and became even more numerous. Korra quickly evacuated a nearby building, flying up on her glider to save a boy who was trapped in an upper level. As its top spire began to collapse, she saved the boy by rapidly gliding him down, and spared the citizens of further injury by catching the spire with earthbending and easing it to the ground."
    },
    {
      "body": "That evening, Korra attempted meditation to reach her past lives, but was unable to do so before Tenzin approached. She feared she had ruined everything by leaving the portals open, but her master assured her that she did what she thought was best, and things had changed as a result. She only further lamented her low standing with the city, but Tenzin further advised her that her duty was to the world's balance and that some would be happy and others not; the airbender was happy because the decision had given a second chance for the Air Nation, which in turn could only help to restore balance. Korra wished she could be wiser, and as Tenzin advised her wisdom would only come as one accepts things as they are, Bolin rushed in, alerting them that Mako had called, and the new airbender had been found, but refused to come down from the top of ${link_0}. Korra decided to forget the \"Avatar wisdom\" talk and help to rescue him; the group flew to the bridge on ${link_1}.",
      "links": [
        {
          "body": "Kyoshi Bridge",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Bridge",
            "page": "Kyoshi_Bridge"
          }
        },
        {
          "body": "Oogi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Oogi",
            "page": "Oogi"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Rebirth of the Air Nation"
      ],
      "text": "That evening, Korra attempted meditation to reach her past lives, but was unable to do so before Tenzin approached. She feared she had ruined everything by leaving the portals open, but her master assured her that she did what she thought was best, and things had changed as a result. She only further lamented her low standing with the city, but Tenzin further advised her that her duty was to the world's balance and that some would be happy and others not; the airbender was happy because the decision had given a second chance for the Air Nation, which in turn could only help to restore balance. Korra wished she could be wiser, and as Tenzin advised her wisdom would only come as one accepts things as they are, Bolin rushed in, alerting them that Mako had called, and the new airbender had been found, but refused to come down from the top of Kyoshi Bridge. Korra decided to forget the \"Avatar wisdom\" talk and help to rescue him; the group flew to the bridge on Oogi."
    },
    {
      "body": "The airbender, ${link_0}, refused to come down, believing himself to be dangerous; he blew away several ${link_1} who tried to reach him. Korra flew up to where he stood, wishing to talk to him. Daw revealed that he was scared, having no idea what he was doing, something with which she sympathized. She explained that these changes were her fault and that he was not alone. She could not \"make it stop\", as he requested, but instead offered to take him to Air Temple Island and help explain things, reaching out a hand. As he tried to take it, however, Daw slipped from the bridge, but just before he hit the ground, Korra caught him with her glider, much to the delight of a gathered crowd. Raiko, however, showed up and was infuriated, demanding if such crises would be the new norm. The Avatar told him that he would just have to deal with it, because such changes were there to stay. Raiko responded by saying she would not be there, demanding she leave the city, to which she angrily agreed. Approaching Tenzin, she promised to help find the new airbenders and rebuild the Air Nation.",
      "links": [
        {
          "body": "Daw",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Daw",
            "page": "Daw"
          }
        },
        {
          "body": "metalbender officers",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Rebirth of the Air Nation"
      ],
      "text": "The airbender, Daw, refused to come down, believing himself to be dangerous; he blew away several metalbender officers who tried to reach him. Korra flew up to where he stood, wishing to talk to him. Daw revealed that he was scared, having no idea what he was doing, something with which she sympathized. She explained that these changes were her fault and that he was not alone. She could not \"make it stop\", as he requested, but instead offered to take him to Air Temple Island and help explain things, reaching out a hand. As he tried to take it, however, Daw slipped from the bridge, but just before he hit the ground, Korra caught him with her glider, much to the delight of a gathered crowd. Raiko, however, showed up and was infuriated, demanding if such crises would be the new norm. The Avatar told him that he would just have to deal with it, because such changes were there to stay. Raiko responded by saying she would not be there, demanding she leave the city, to which she angrily agreed. Approaching Tenzin, she promised to help find the new airbenders and rebuild the Air Nation."
    },
    {
      "body": "The next day, Korra and her allies gathered at Air Temple Island's entrance as Asami brought a ${link_0} for the group to travel to ${link_1} with. Just before they left, Mako arrived with a map showing where airbenders were being sighted in the Earth Kingdom. Korra wanted him to come along, reminding the firebender that he was still a part of Team Avatar. Mako declined, though was later convinced by Bolin to join the journey. Seeing the map, the Avatar believed that they were about to bring the Air Nation back from the brink of extinction.",
      "links": [
        {
          "body": "Future Industries airship",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries_airship",
            "page": "Future_Industries_airship"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Searching for airbenders"
      ],
      "text": "The next day, Korra and her allies gathered at Air Temple Island's entrance as Asami brought a Future Industries airship for the group to travel to Ba Sing Se with. Just before they left, Mako arrived with a map showing where airbenders were being sighted in the Earth Kingdom. Korra wanted him to come along, reminding the firebender that he was still a part of Team Avatar. Mako declined, though was later convinced by Bolin to join the journey. Seeing the map, the Avatar believed that they were about to bring the Air Nation back from the brink of extinction."
    },
    {
      "body": "Arriving at the first village, Korra's group was welcomed by its leader and invited for a dinner with the airbender, ${link_0}, and his family. However, when the man refused to go with Tenzin, Korra tried to convince him and his family otherwise, saying he needed to learn about his culture, but she too was rebuffed. After leaving, Korra stated that she believed that it would play out differently. After Tenzin failed to recruit any other airbenders, Korra, Mako, and Bolin tried taking matters into their own hands. They met a twenty-two-year-old, ${link_1}, who was still living with his parents. Korra told his ${link_2} that he would have the chance to go to the Northern Air Temple, exciting her. Ryu, however, was not interested. Korra responded by taking him by the collar and throwing him into a kitchen chair, saying he had a responsibility as a world citizen, regardless of if he wanted to be an airbender or not. After he continued to state his lack of care, she seized him by the collar again and tried to drag him out the door, his mom trying to assist Korra. However, Ryu escaped her grip with an air blast, and before she could try and take him again, Bolin and Mako dragged her away.",
      "links": [
        {
          "body": "Kuon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuon",
            "page": "Kuon"
          }
        },
        {
          "body": "Ryu",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ryu",
            "page": "Ryu"
          }
        },
        {
          "body": "mother",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ryu%27s_mother",
            "page": "Ryu%27s_mother"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Searching for airbenders"
      ],
      "text": "Arriving at the first village, Korra's group was welcomed by its leader and invited for a dinner with the airbender, Kuon, and his family. However, when the man refused to go with Tenzin, Korra tried to convince him and his family otherwise, saying he needed to learn about his culture, but she too was rebuffed. After leaving, Korra stated that she believed that it would play out differently. After Tenzin failed to recruit any other airbenders, Korra, Mako, and Bolin tried taking matters into their own hands. They met a twenty-two-year-old, Ryu, who was still living with his parents. Korra told his mother that he would have the chance to go to the Northern Air Temple, exciting her. Ryu, however, was not interested. Korra responded by taking him by the collar and throwing him into a kitchen chair, saying he had a responsibility as a world citizen, regardless of if he wanted to be an airbender or not. After he continued to state his lack of care, she seized him by the collar again and tried to drag him out the door, his mom trying to assist Korra. However, Ryu escaped her grip with an air blast, and before she could try and take him again, Bolin and Mako dragged her away."
    },
    {
      "body": "Korra was disappointed by the results, thinking there would have been more enthusiasm among the airbenders to join their group. Bolin and Bumi both suggested an \"air show\", which Korra thought to be ridiculous but had a chance to work. With Tenzin willing to try \"anything\", the group arrived at a town and performed their show. Korra's role was to apprehend Mako, playing a firebending convict, using airbending. She lifted Mako onto a tornado, much to her and Asami's joy. Upon the show's completion, only one young orphan boy, ${link_0}, desired to join them. He managed to convince them with a story that involved the murder of his parents by outlaws. Before they left, they were confronted by the alleged outlaws, whom Korra managed to fight off. In reality, they were members of the town's police force, and Kai was a young thief who stole his foster family's savings. The young airbender defended himself by saying that it was the old him, and his new abilities had prompted him to change. Before the officers took him to prison, Korra decided to take Kai in, believing they could give him the guidance he needed, though she warned the boy to \"not make [her] regret it\". After a group hug, they continued onward to Ba Sing Se.",
      "links": [
        {
          "body": "Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kai",
            "page": "Kai"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Searching for airbenders"
      ],
      "text": "Korra was disappointed by the results, thinking there would have been more enthusiasm among the airbenders to join their group. Bolin and Bumi both suggested an \"air show\", which Korra thought to be ridiculous but had a chance to work. With Tenzin willing to try \"anything\", the group arrived at a town and performed their show. Korra's role was to apprehend Mako, playing a firebending convict, using airbending. She lifted Mako onto a tornado, much to her and Asami's joy. Upon the show's completion, only one young orphan boy, Kai, desired to join them. He managed to convince them with a story that involved the murder of his parents by outlaws. Before they left, they were confronted by the alleged outlaws, whom Korra managed to fight off. In reality, they were members of the town's police force, and Kai was a young thief who stole his foster family's savings. The young airbender defended himself by saying that it was the old him, and his new abilities had prompted him to change. Before the officers took him to prison, Korra decided to take Kai in, believing they could give him the guidance he needed, though she warned the boy to \"not make [her] regret it\". After a group hug, they continued onward to Ba Sing Se."
    },
    {
      "body": "As they finished their journey into the Earth Kingdom capital, Korra expressed her excitement to be on a diplomatic mission and asked her mentor what the ${link_0} was like, to which he said that she could be demanding, much to her worry. They went directly to the ${link_1} and were welcomed by ${link_2} ${link_3}, who led them to their quarters while giving them a lengthy list of rules, confusing Korra. Upon arrival, the rest of the group went to their rooms while the Avatar followed Gun to meet the queen, ${link_4}. When she first saw the queen, she was demanding her servants around before turning to Korra. Hou-Ting quickly berated her for the actions of her predecessor and Zuko, as they had forced Kuei to cede Earth Kingdom land for the ${link_5}, leaving the nation in ruin. Korra tried to apologize, though the monarch ignored her and continued to boss her servants around. When asked if she had problems with her servants, the Avatar replied she did not have such people in her stead. She proceeded to ask the queen for help finding Ba Sing Se's airbenders. Before accepting her request, Hou-Ting demanded Korra retrieve the kingdom's tax revenues from a vault in a town south of the capital due to barbarians constantly stealing it. The annoyed waterbender accepted and shoved Gun out of the way as she left.",
      "links": [
        {
          "body": "Earth Queen",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Earth Kingdom Royal Palace",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        },
        {
          "body": "Grand Secretariat",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Grand_Secretariat_of_Ba_Sing_Se",
            "page": "Grand_Secretariat_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Gun",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Gun",
            "page": "Gun"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Hou-Ting",
            "page": "Hou-Ting"
          }
        },
        {
          "body": "United Republic",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Ba Sing Se"
      ],
      "text": "As they finished their journey into the Earth Kingdom capital, Korra expressed her excitement to be on a diplomatic mission and asked her mentor what the Earth Queen was like, to which he said that she could be demanding, much to her worry. They went directly to the Earth Kingdom Royal Palace and were welcomed by Grand Secretariat Gun, who led them to their quarters while giving them a lengthy list of rules, confusing Korra. Upon arrival, the rest of the group went to their rooms while the Avatar followed Gun to meet the queen, Hou-Ting. When she first saw the queen, she was demanding her servants around before turning to Korra. Hou-Ting quickly berated her for the actions of her predecessor and Zuko, as they had forced Kuei to cede Earth Kingdom land for the United Republic, leaving the nation in ruin. Korra tried to apologize, though the monarch ignored her and continued to boss her servants around. When asked if she had problems with her servants, the Avatar replied she did not have such people in her stead. She proceeded to ask the queen for help finding Ba Sing Se's airbenders. Before accepting her request, Hou-Ting demanded Korra retrieve the kingdom's tax revenues from a vault in a town south of the capital due to barbarians constantly stealing it. The annoyed waterbender accepted and shoved Gun out of the way as she left."
    },
    {
      "body": "Korra, joined by Asami, ventured to the town in the Future Industries airship, trying to ease her friend's worries about them going alone by saying that ${link_0} awaited on guard and that the queen just enjoyed bossing her around. After arriving at the town, the Avatar did not like the looks of things, but informed the guards on duty to load the tax money onto the ship. At that moment, the girls saw a flare, followed by ${link_1} and his gang of barbarians riding in to surround them, causing Korra to rethink her decision to go without everyone else. Nonetheless, she and Asami took up their challenge. After tripping up the gang leader, she earthbent at them, launching their motorcycles into the air and also protecting Asami from a potential attack. The Avatar also airbent at another motorbike, defeating the two men riding it. After Asami defeated the last two gangsters, Korra knocked down Gombo with a slab of rock, causing the gang to retreat. As they left though, Gombo shouted at the Water Tribe girl that she was on the wrong side, and the money belonged to the people, leaving her feeling that he may indeed be right.",
      "links": [
        {
          "body": "Royal Earthbender Guards",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Royal_Earthbender_Guards",
            "page": "Royal_Earthbender_Guards"
          }
        },
        {
          "body": "Gombo",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Gombo",
            "page": "Gombo"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Ba Sing Se"
      ],
      "text": "Korra, joined by Asami, ventured to the town in the Future Industries airship, trying to ease her friend's worries about them going alone by saying that Royal Earthbender Guards awaited on guard and that the queen just enjoyed bossing her around. After arriving at the town, the Avatar did not like the looks of things, but informed the guards on duty to load the tax money onto the ship. At that moment, the girls saw a flare, followed by Gombo and his gang of barbarians riding in to surround them, causing Korra to rethink her decision to go without everyone else. Nonetheless, she and Asami took up their challenge. After tripping up the gang leader, she earthbent at them, launching their motorcycles into the air and also protecting Asami from a potential attack. The Avatar also airbent at another motorbike, defeating the two men riding it. After Asami defeated the last two gangsters, Korra knocked down Gombo with a slab of rock, causing the gang to retreat. As they left though, Gombo shouted at the Water Tribe girl that she was on the wrong side, and the money belonged to the people, leaving her feeling that he may indeed be right."
    },
    {
      "body": "After returning to Hou-Ting, the task having been completed, Korra wondered if she could meet the city's airbenders. The queen told her, however, that a search of the city by the ${link_0} came up empty, and thus her group could leave. Angered, Korra called out Hou-Ting on her extortion of the citizens and said that she knew there were airbenders in the city. The monarch simply ordered Korra be escorted out of the palace, but the Avatar again pushed Gun aside and declared to her that the situation was not over as she left angrily.",
      "links": [
        {
          "body": "Dai Li",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Ba Sing Se"
      ],
      "text": "After returning to Hou-Ting, the task having been completed, Korra wondered if she could meet the city's airbenders. The queen told her, however, that a search of the city by the Dai Li came up empty, and thus her group could leave. Angered, Korra called out Hou-Ting on her extortion of the citizens and said that she knew there were airbenders in the city. The monarch simply ordered Korra be escorted out of the palace, but the Avatar again pushed Gun aside and declared to her that the situation was not over as she left angrily."
    },
    {
      "body": "The next day, Korra vented her frustrations over the queen to Asami while punching and kicking practice pads on her arms. At that moment, Mako and Bolin returned; the latter breathlessly explained all that had happened to them. Mako clarified that they had heard about the Earth Queen rounding up airbenders, confirming Korra's suspicions. She was about to say what she would do to her, but Asami quickly alerted her that the monarch was coming. Hou-Ting arrived alongside Gun; the Grand Secretariat informed them that airbenders had been found in the Yang province. Korra thanked her but remained suspicious. Hou-Ting told the group they could leave by evening, but the Avatar attempted to tell her that they could not; Asami covered for her by saying they needed another night to repair their airship, for which Korra thanked her friend.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Ba Sing Se"
      ],
      "text": "The next day, Korra vented her frustrations over the queen to Asami while punching and kicking practice pads on her arms. At that moment, Mako and Bolin returned; the latter breathlessly explained all that had happened to them. Mako clarified that they had heard about the Earth Queen rounding up airbenders, confirming Korra's suspicions. She was about to say what she would do to her, but Asami quickly alerted her that the monarch was coming. Hou-Ting arrived alongside Gun; the Grand Secretariat informed them that airbenders had been found in the Yang province. Korra thanked her but remained suspicious. Hou-Ting told the group they could leave by evening, but the Avatar attempted to tell her that they could not; Asami covered for her by saying they needed another night to repair their airship, for which Korra thanked her friend."
    },
    {
      "body": "Later, the group reconvened at their home, where Korra expressed her frustration, believing the queen had no right to do what she was doing. She also assured Jinora, who was fearful of Kai being captured, that they would find him; they just needed to know where to look. Mako suggested ${link_0} because the Dai Li formerly had an underground base there. With Jinora assuring the group she could spiritually project into the base, Korra and Tenzin joined her on a trip to the lake. They watched as Jinora meditated to perform her technique, but were soon disappointed when she returned to inform them that the base was abandoned. Korra asked Jinora where else the airbenders could be, but was given almost every possible location under the city. The Avatar tried to help her by asking how she found her during Harmonic Convergence. After Jinora said she had felt a connection between her and Korra, the waterbender advised her to focus on the connection between her and Kai.",
      "links": [
        {
          "body": "Lake Laogai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lake_Laogai",
            "page": "Lake_Laogai"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Ba Sing Se"
      ],
      "text": "Later, the group reconvened at their home, where Korra expressed her frustration, believing the queen had no right to do what she was doing. She also assured Jinora, who was fearful of Kai being captured, that they would find him; they just needed to know where to look. Mako suggested Lake Laogai because the Dai Li formerly had an underground base there. With Jinora assuring the group she could spiritually project into the base, Korra and Tenzin joined her on a trip to the lake. They watched as Jinora meditated to perform her technique, but were soon disappointed when she returned to inform them that the base was abandoned. Korra asked Jinora where else the airbenders could be, but was given almost every possible location under the city. The Avatar tried to help her by asking how she found her during Harmonic Convergence. After Jinora said she had felt a connection between her and Korra, the waterbender advised her to focus on the connection between her and Kai."
    },
    {
      "body": "Korra and the others found out the airbenders were being held underneath the ${link_0}, angering her because they were \"right under [their] noses the whole time\". The group discussed a plan to free them before hearing a knock at the door. Believing it was the queen, Korra advised them to act normal, but to their surprise, it was actually Lin who had come to visit, informing the Avatar and Tenzin of the escape of four dangerous criminals who were after Korra. Not knowing who they were, Korra asked the two about them. Tenzin explained that shortly after finding out she was the Avatar, the criminals plotted to kidnap her, but were captured by him, her father, Zuko, and Sokka, and detained in four special ${link_1}. Korra soon understood that this threat was why she was sheltered in the compound. Lin insisted Korra return to Republic City, but she refused, saying she wanted to get the airbenders first; Lin promptly agreed to join the mission, and Korra told her their location.",
      "links": [
        {
          "body": "Earth Queen's Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Queen%27s_Temple",
            "page": "Earth_Queen%27s_Temple"
          }
        },
        {
          "body": "prisons",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/White_Lotus_prisons",
            "page": "White_Lotus_prisons"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Ba Sing Se"
      ],
      "text": "Korra and the others found out the airbenders were being held underneath the Earth Queen's Temple, angering her because they were \"right under [their] noses the whole time\". The group discussed a plan to free them before hearing a knock at the door. Believing it was the queen, Korra advised them to act normal, but to their surprise, it was actually Lin who had come to visit, informing the Avatar and Tenzin of the escape of four dangerous criminals who were after Korra. Not knowing who they were, Korra asked the two about them. Tenzin explained that shortly after finding out she was the Avatar, the criminals plotted to kidnap her, but were captured by him, her father, Zuko, and Sokka, and detained in four special prisons. Korra soon understood that this threat was why she was sheltered in the compound. Lin insisted Korra return to Republic City, but she refused, saying she wanted to get the airbenders first; Lin promptly agreed to join the mission, and Korra told her their location."
    },
    {
      "body": "That night, the group made their way to the temple and, after easily overcoming two ${link_0}, reached the underground hold. Korra went with Tenzin and Bumi to free the majority of the airbenders. She explained to the confused airbenders that she was the Avatar and was there to free them. Upon reaching above ground, Korra checked to make sure the coast was clear. Believing it was, she told the group to move, but they were soon confronted by Hou-Ting and several Dai Li agents. Korra protested that the airbenders should have the freedom to make their own decisions, to which she was warned by the queen that taking them would be considered an act of war and result in the force of the Earth Kingdom bearing down on her. Korra still refused to turn them over, prompting the queen to order the Dai Li to attack them. Upon their attack, the Avatar and Tenzin helped provide a burst of air to hold the agents off as Lin's airship arrived to retrieve the airbenders. While they made their way to the airship, Korra helped blast Dai Li forces off the scaffolding of the queen's temple before she and Tenzin were able to get away on Oogi. After seeing Bolin, Mako, and Jinora emerge with Kai, Korra directed the bison toward them, allowing the four to launch themselves onto its saddle, thus completing the full escape.",
      "links": [
        {
          "body": "Royal Earthbender Guards",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Royal_Earthbender_Guards",
            "page": "Royal_Earthbender_Guards"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Ba Sing Se"
      ],
      "text": "That night, the group made their way to the temple and, after easily overcoming two Royal Earthbender Guards, reached the underground hold. Korra went with Tenzin and Bumi to free the majority of the airbenders. She explained to the confused airbenders that she was the Avatar and was there to free them. Upon reaching above ground, Korra checked to make sure the coast was clear. Believing it was, she told the group to move, but they were soon confronted by Hou-Ting and several Dai Li agents. Korra protested that the airbenders should have the freedom to make their own decisions, to which she was warned by the queen that taking them would be considered an act of war and result in the force of the Earth Kingdom bearing down on her. Korra still refused to turn them over, prompting the queen to order the Dai Li to attack them. Upon their attack, the Avatar and Tenzin helped provide a burst of air to hold the agents off as Lin's airship arrived to retrieve the airbenders. While they made their way to the airship, Korra helped blast Dai Li forces off the scaffolding of the queen's temple before she and Tenzin were able to get away on Oogi. After seeing Bolin, Mako, and Jinora emerge with Kai, Korra directed the bison toward them, allowing the four to launch themselves onto its saddle, thus completing the full escape."
    },
    {
      "body": "The next morning, outside the city, the escaped airbenders chose to join Tenzin en route to the ${link_0} to train as Air Nomads. Before separating, Korra wished her master good luck and an assurance to send more airbenders his way should they find them. She also expressed her concerns of making new enemies everywhere she went, to which Tenzin assured her she made friends too and told her she had done well. The Avatar embraced the airbender, saying this was only the beginning. She soon went with her friends and Lin in the police airship to continue the search for airbenders.",
      "links": [
        {
          "body": "Northern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Ba Sing Se"
      ],
      "text": "The next morning, outside the city, the escaped airbenders chose to join Tenzin en route to the Northern Air Temple to train as Air Nomads. Before separating, Korra wished her master good luck and an assurance to send more airbenders his way should they find them. She also expressed her concerns of making new enemies everywhere she went, to which Tenzin assured her she made friends too and told her she had done well. The Avatar embraced the airbender, saying this was only the beginning. She soon went with her friends and Lin in the police airship to continue the search for airbenders."
    },
    {
      "body": "During a pit stop, Korra played a game of fetch with Naga, using airbending to launch a ball for her companion to chase. She urged the worried Lin to relax, saying no one beyond them knew where she was. When Naga brought the ball to Lin, Korra told her that she wanted the chief to throw it. At that point, Mako and Asami emerged from the airship, telling them about a report of an airbender in the city of ${link_0}, home to the ${link_1}. Korra asked Lin if she knew about it, but after receiving a negative answer and instead being told return to Republic City, the Avatar brushed Lin off, saying they would look for the airbender.",
      "links": [
        {
          "body": "Zaofu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zaofu",
            "page": "Zaofu"
          }
        },
        {
          "body": "Metal Clan",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Metal_Clan",
            "page": "Metal_Clan"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Zaofu"
      ],
      "text": "During a pit stop, Korra played a game of fetch with Naga, using airbending to launch a ball for her companion to chase. She urged the worried Lin to relax, saying no one beyond them knew where she was. When Naga brought the ball to Lin, Korra told her that she wanted the chief to throw it. At that point, Mako and Asami emerged from the airship, telling them about a report of an airbender in the city of Zaofu, home to the Metal Clan. Korra asked Lin if she knew about it, but after receiving a negative answer and instead being told return to Republic City, the Avatar brushed Lin off, saying they would look for the airbender."
    },
    {
      "body": "Upon their landing in Zaofu, Korra asked why Lin would not go with them nor wanted anyone telling the city about her, but Lin refused to tell, prompting Korra to call her \"Chief Crankypants\". They were greeted by the city's emissary, ${link_0}, who led them on a ${link_1} through the city. Korra stood in awe of the statue of ${link_2} as they passed it by and listened as Aiwei told them of what happened to her. They made their way to the airbender's home, but first, they met her mother and the city's matriarch, ${link_3}, who had been practicing for a dance recital with her troupe of dancers. Suyin was pleased to meet her, but was soon told by Aiwei that she had been lying about the number of people who had come with her. Korra asked Aiwei how he knew she was lying, to which she was told that he was able to ${link_4}. The Water Tribe girl confessed that Lin was with her, but was soon shocked to learn through Suyin that not only did she know Lin, but the two were siblings.",
      "links": [
        {
          "body": "Aiwei",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aiwei",
            "page": "Aiwei"
          }
        },
        {
          "body": "train",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Train",
            "page": "Train"
          }
        },
        {
          "body": "Toph Beifong",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Suyin Beifong",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "detect lies",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Seismic_sense#Lie_detection",
            "page": "Seismic_sense"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Zaofu"
      ],
      "text": "Upon their landing in Zaofu, Korra asked why Lin would not go with them nor wanted anyone telling the city about her, but Lin refused to tell, prompting Korra to call her \"Chief Crankypants\". They were greeted by the city's emissary, Aiwei, who led them on a train through the city. Korra stood in awe of the statue of Toph Beifong as they passed it by and listened as Aiwei told them of what happened to her. They made their way to the airbender's home, but first, they met her mother and the city's matriarch, Suyin Beifong, who had been practicing for a dance recital with her troupe of dancers. Suyin was pleased to meet her, but was soon told by Aiwei that she had been lying about the number of people who had come with her. Korra asked Aiwei how he knew she was lying, to which she was told that he was able to detect lies. The Water Tribe girl confessed that Lin was with her, but was soon shocked to learn through Suyin that not only did she know Lin, but the two were siblings."
    },
    {
      "body": "They all returned to the airship, where Korra asked Lin why she never told her about Suyin. The Avatar was again shocked to find out that they had not spoken in thirty years and wondered why, but the half-sisters just argued with each other. Suyin ended the argument and told Korra that her daughter was thrilled to meet her, and Korra told Lin that her niece was the airbender. The group ventured to Suyin's estate, where they were introduced first to ${link_0}, followed by ${link_1}, and finally the airbender, ${link_2}, whom Korra was pleased to meet. Suyin suggested Korra train Opal, but the latter believed the airbender could learn more at the Northern Air Temple, where they planned to transport her. Suyin dismissed the idea because Zaofu was the only home her daughter knew, and Korra conceded, saying she could give Opal a starting point. She also explained Lin's impatience by telling Suyin of the threat of the criminals pursuing her, to which the matriarch explained that Zaofu was the safest city in the world. Korra asked Lin what her problem with Suyin was and believed they could at least stay a little while.",
      "links": [
        {
          "body": "Wei and Wing",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wei_and_Wing",
            "page": "Wei_and_Wing"
          }
        },
        {
          "body": "Huan",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Huan",
            "page": "Huan"
          }
        },
        {
          "body": "Opal",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Opal",
            "page": "Opal"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Zaofu"
      ],
      "text": "They all returned to the airship, where Korra asked Lin why she never told her about Suyin. The Avatar was again shocked to find out that they had not spoken in thirty years and wondered why, but the half-sisters just argued with each other. Suyin ended the argument and told Korra that her daughter was thrilled to meet her, and Korra told Lin that her niece was the airbender. The group ventured to Suyin's estate, where they were introduced first to Wei and Wing, followed by Huan, and finally the airbender, Opal, whom Korra was pleased to meet. Suyin suggested Korra train Opal, but the latter believed the airbender could learn more at the Northern Air Temple, where they planned to transport her. Suyin dismissed the idea because Zaofu was the only home her daughter knew, and Korra conceded, saying she could give Opal a starting point. She also explained Lin's impatience by telling Suyin of the threat of the criminals pursuing her, to which the matriarch explained that Zaofu was the safest city in the world. Korra asked Lin what her problem with Suyin was and believed they could at least stay a little while."
    },
    {
      "body": "Before dinner, Korra began a basic training session with a nervous Opal, who said she was not very good, but Korra said they were in the same boat because she had never taught before. The Avatar showed her student some basic movements and stances, and the two moved around in a circle while gathering some basic swirls of air. The Water Tribe girl was impressed with Opal, calling her a natural.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Zaofu"
      ],
      "text": "Before dinner, Korra began a basic training session with a nervous Opal, who said she was not very good, but Korra said they were in the same boat because she had never taught before. The Avatar showed her student some basic movements and stances, and the two moved around in a circle while gathering some basic swirls of air. The Water Tribe girl was impressed with Opal, calling her a natural."
    },
    {
      "body": "At dinner, Suyin told Korra about her husband, ${link_0}, who had helped her design the city, but could not join the group for dinner because of a breakthrough on a construction project. When asked by the matriarch how the search for airbenders was going, Korra explained how they had freed several of them from the Earth Queen's captivity. Suyin discussed her dislike for the monarch, saying that she believed she could do whatever she wanted and her reign was outdated. Korra said she had not thought about it, to which Suyin advised her to do so as the world was changing. The waterbender soon watched as Lin stormed out of the room, urging her to come back, but to no avail.",
      "links": [
        {
          "body": "Baatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Baatar",
            "page": "Baatar"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Zaofu"
      ],
      "text": "At dinner, Suyin told Korra about her husband, Baatar, who had helped her design the city, but could not join the group for dinner because of a breakthrough on a construction project. When asked by the matriarch how the search for airbenders was going, Korra explained how they had freed several of them from the Earth Queen's captivity. Suyin discussed her dislike for the monarch, saying that she believed she could do whatever she wanted and her reign was outdated. Korra said she had not thought about it, to which Suyin advised her to do so as the world was changing. The waterbender soon watched as Lin stormed out of the room, urging her to come back, but to no avail."
    },
    {
      "body": "Afterward, Korra made her way to Suyin's office and gazed wondrously over a model of Zaofu, telling her that the city was amazing, thanked her for being welcoming, and apologized for Lin's behavior before asking her what happened between the half-sisters. Suyin told Korra about how they did not know their fathers while Toph was busy being police chief, and they had freedom to do what they pleased. Korra called it a good thing, but Suyin remarked it was in a way, but they wound up fighting for Toph's attention. As the Avatar listened to Suyin's story about how she eventually decided to build Zaofu and raise a family, she stated that Suyin appeared to have built the perfect life, but was upset to learn that the matriarch wanted Lin to be a part of it, but gave up hope on her coming around.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Zaofu"
      ],
      "text": "Afterward, Korra made her way to Suyin's office and gazed wondrously over a model of Zaofu, telling her that the city was amazing, thanked her for being welcoming, and apologized for Lin's behavior before asking her what happened between the half-sisters. Suyin told Korra about how they did not know their fathers while Toph was busy being police chief, and they had freedom to do what they pleased. Korra called it a good thing, but Suyin remarked it was in a way, but they wound up fighting for Toph's attention. As the Avatar listened to Suyin's story about how she eventually decided to build Zaofu and raise a family, she stated that Suyin appeared to have built the perfect life, but was upset to learn that the matriarch wanted Lin to be a part of it, but gave up hope on her coming around."
    },
    {
      "body": "Korra decided to look for Opal and found her having a moment with Bolin. She broke it up by clearing her throat and told Opal she needed her help with something. The two made their way to Lin's room, explaining she had brought someone who wanted to talk to her. However, when Lin coldly dismissed Opal's desire for her to join the family, an angered Korra asked Lin what her problem was, telling her not to blame Opal because she asked her to talk to Lin, believing it would help the chief break out of her funk. Lin simply told her to fix the world and not her family, and the annoyed Avatar answered by saying that Suyin was right and Lin would remain a bitter, lonely woman before storming out and slamming the door.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Zaofu"
      ],
      "text": "Korra decided to look for Opal and found her having a moment with Bolin. She broke it up by clearing her throat and told Opal she needed her help with something. The two made their way to Lin's room, explaining she had brought someone who wanted to talk to her. However, when Lin coldly dismissed Opal's desire for her to join the family, an angered Korra asked Lin what her problem was, telling her not to blame Opal because she asked her to talk to Lin, believing it would help the chief break out of her funk. Lin simply told her to fix the world and not her family, and the annoyed Avatar answered by saying that Suyin was right and Lin would remain a bitter, lonely woman before storming out and slamming the door."
    },
    {
      "body": "The next morning, the group, sans Lin, gathered for breakfast, which Korra believed was because she was sulking in her room. Wei and Wing turned up to grab a bite before their power disc match and asked Korra if she would like to join. The Avatar said she would not be of much competition because she was not a metalbender, to which Suyin asked why Lin never trained her. Korra gave a short summary of her many preoccupations back in Republic City, though chuckled at Suyin's belief about Lin being a bad teacher. The matriarch subsequently offered to train her in metalbending, to which she excitedly agreed. The diners soon ducked quickly as their dishes were all yanked from them by Varrick's magnetic suit.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Zaofu"
      ],
      "text": "The next morning, the group, sans Lin, gathered for breakfast, which Korra believed was because she was sulking in her room. Wei and Wing turned up to grab a bite before their power disc match and asked Korra if she would like to join. The Avatar said she would not be of much competition because she was not a metalbender, to which Suyin asked why Lin never trained her. Korra gave a short summary of her many preoccupations back in Republic City, though chuckled at Suyin's belief about Lin being a bad teacher. The matriarch subsequently offered to train her in metalbending, to which she excitedly agreed. The diners soon ducked quickly as their dishes were all yanked from them by Varrick's magnetic suit."
    },
    {
      "body": "Suyin began Korra's training with a piece of a rare meteorite. After watching her demonstrations in amazement, Korra began concentrating on the piece on her hand when she spotted Bolin spying on them. Bolin tried to say he was searching for ${link_0}, to which Korra said he was on his shoulder. Korra re-focused her attention on the meteorite and, using Suyin's advice to focus on the pieces of earth with the meteorite, she was able to morph it into a small shape. Korra later visited Lin again, suggesting that she apologize to Opal, but soon noted that the police chief was not in good shape, though her concerns were dismissed by Lin as she got up and walked away.",
      "links": [
        {
          "body": "Pabu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pabu",
            "page": "Pabu"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Zaofu"
      ],
      "text": "Suyin began Korra's training with a piece of a rare meteorite. After watching her demonstrations in amazement, Korra began concentrating on the piece on her hand when she spotted Bolin spying on them. Bolin tried to say he was searching for Pabu, to which Korra said he was on his shoulder. Korra re-focused her attention on the meteorite and, using Suyin's advice to focus on the pieces of earth with the meteorite, she was able to morph it into a small shape. Korra later visited Lin again, suggesting that she apologize to Opal, but soon noted that the police chief was not in good shape, though her concerns were dismissed by Lin as she got up and walked away."
    },
    {
      "body": "Korra instead returned to metalbending and successfully perfected the technique, which resulted in Suyin congratulating her for being the first metalbending Avatar. The group was joined by a now-eager Bolin, but just as he declared his desire to learn, they were interrupted by Lin, who wanted to take out her repressed anger at her half-sister. The Avatar watched as their verbal argument escalated into a physical fight. Korra asked Bolin if she should intervene, but the latter told her that fighting was a means of healing sibling tensions. Opal soon arrived to break the siblings up, and when Lin passed out from exhaustion, Korra caught her before her head hit the ground.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Zaofu"
      ],
      "text": "Korra instead returned to metalbending and successfully perfected the technique, which resulted in Suyin congratulating her for being the first metalbending Avatar. The group was joined by a now-eager Bolin, but just as he declared his desire to learn, they were interrupted by Lin, who wanted to take out her repressed anger at her half-sister. The Avatar watched as their verbal argument escalated into a physical fight. Korra asked Bolin if she should intervene, but the latter told her that fighting was a means of healing sibling tensions. Opal soon arrived to break the siblings up, and when Lin passed out from exhaustion, Korra caught her before her head hit the ground."
    },
    {
      "body": "Sixteen hours later, Korra, Bolin, and Mako made their way to Lin's room. The former two were hesitant to knock on Lin's door, so Mako went ahead. Lin soon opened her door and greeted them with a more pleasant demeanor, much to their surprise.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Zaofu"
      ],
      "text": "Sixteen hours later, Korra, Bolin, and Mako made their way to Lin's room. The former two were hesitant to knock on Lin's door, so Mako went ahead. Lin soon opened her door and greeted them with a more pleasant demeanor, much to their surprise."
    },
    {
      "body": "Korra later ${link_0} Tenzin at the Northern Air Temple to inform them about the recent developments at Zaofu, including their finding of Opal and that she would be sending her to Tenzin, though the radio was briefly taken from her by Bolin who, much to the Avatar's annoyance, used the time to fawn over Opal. After getting the radio back, Korra asked Tenzin how training was going, and was answered with his frustration about the airbenders' lack of interest in learning about their culture. Korra suggested that he take a break, suggesting the kids and even Bumi, because of his experience in commandeering military units, could help. Though believing Tenzin's remark about Bumi being his worst student to that point, Korra suggested he could take more responsibility by making him believe the idea was his. Tenzin complimented her for becoming a wise Avatar, to which she said conflict resolution was what she did.",
      "links": [
        {
          "body": "radioed",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Radio",
            "page": "Radio"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Arrival at Zaofu"
      ],
      "text": "Korra later radioed Tenzin at the Northern Air Temple to inform them about the recent developments at Zaofu, including their finding of Opal and that she would be sending her to Tenzin, though the radio was briefly taken from her by Bolin who, much to the Avatar's annoyance, used the time to fawn over Opal. After getting the radio back, Korra asked Tenzin how training was going, and was answered with his frustration about the airbenders' lack of interest in learning about their culture. Korra suggested that he take a break, suggesting the kids and even Bumi, because of his experience in commandeering military units, could help. Though believing Tenzin's remark about Bumi being his worst student to that point, Korra suggested he could take more responsibility by making him believe the idea was his. Tenzin complimented her for becoming a wise Avatar, to which she said conflict resolution was what she did."
    },
    {
      "body": "Sometime later, Korra tested her skills against Wing. She dodged two meteorite fragments and attempted to attack him with cables, but was taken down when her opponent stomped on them and bent them back at her, entangling Korra and knocking her down. She got back up, however, and managed to defeat Wing by tripping him up with the wire and declared herself metalbending champion in celebration.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Attempted kidnapping and investigation"
      ],
      "text": "Sometime later, Korra tested her skills against Wing. She dodged two meteorite fragments and attempted to attack him with cables, but was taken down when her opponent stomped on them and bent them back at her, entangling Korra and knocking her down. She got back up, however, and managed to defeat Wing by tripping him up with the wire and declared herself metalbending champion in celebration."
    },
    {
      "body": "Korra later joined her friends, Suyin, and her family for Opal's farewell dinner. During the meal, Varrick showed her and Asami his airbender finder, to which she asked if it really worked, but Varrick told them that it must be blown in. She subsequently joined in raising her glass in a toast to Opal and watched the airbender leave for the Northern Air Temple. The Avatar also laid a hand on an upset Bolin's shoulder as they made their way to their rooms for the night.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Attempted kidnapping and investigation"
      ],
      "text": "Korra later joined her friends, Suyin, and her family for Opal's farewell dinner. During the meal, Varrick showed her and Asami his airbender finder, to which she asked if it really worked, but Varrick told them that it must be blown in. She subsequently joined in raising her glass in a toast to Opal and watched the airbender leave for the Northern Air Temple. The Avatar also laid a hand on an upset Bolin's shoulder as they made their way to their rooms for the night."
    },
    {
      "body": "As she was sleeping, Korra soon found herself awoken when Naga was paralyzed by ${link_0} shot by ${link_1}. She jumped from her bed and tried to attack, but was hit in the leg by a dart, instantly leaving her defenseless and surrounded by ${link_2} and ${link_3}. The former carried her as the Red Lotus faced resistance from the estate's guards, Bolin, Mako, Lin, Suyin, Wei, and Wing. She was left to watch behind the foursome as the fight raged on. However, after Bolin blocked P'Li's chi, Korra was able to be rescued by Lin via metal cable. After the Red Lotus left, Korra was taken to Suyin's room, where she laid on a couch while Aiwei gave her an antidote to remove the effects of the spit dart. She rose and expressed her belief that one of the guards had to have tipped off her enemies as to how to breach the estate.",
      "links": [
        {
          "body": "shirshu-spit darts",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Shirshu-spit_darts",
            "page": "Shirshu-spit_darts"
          }
        },
        {
          "body": "Ming-Hua",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ming-Hua",
            "page": "Ming-Hua"
          }
        },
        {
          "body": "Ghazan",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ghazan",
            "page": "Ghazan"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/P%27Li",
            "page": "P%27Li"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Attempted kidnapping and investigation"
      ],
      "text": "As she was sleeping, Korra soon found herself awoken when Naga was paralyzed by shirshu-spit darts shot by Ming-Hua. She jumped from her bed and tried to attack, but was hit in the leg by a dart, instantly leaving her defenseless and surrounded by Ghazan and P'Li. The former carried her as the Red Lotus faced resistance from the estate's guards, Bolin, Mako, Lin, Suyin, Wei, and Wing. She was left to watch behind the foursome as the fight raged on. However, after Bolin blocked P'Li's chi, Korra was able to be rescued by Lin via metal cable. After the Red Lotus left, Korra was taken to Suyin's room, where she laid on a couch while Aiwei gave her an antidote to remove the effects of the spit dart. She rose and expressed her belief that one of the guards had to have tipped off her enemies as to how to breach the estate."
    },
    {
      "body": "The next day, Korra watched as Aiwei questioned the guards and even Varrick, whose description of his nightly routine left her a little queasy, about the night. Upon Lin's suggestion to question Suyin, Korra promptly dismissed her, saying Suyin had nothing to do with it, but the matriarch decided to allow for questioning, much to the Avatar's concern. When Suyin asserted her innocence, Korra declared the questioning a waste of time and asked for the next guard. At the discovery of a guard, ${link_0}, having been lying about his innocence, the waterbender glared at him and assisted in the search of his house for evidence. When Mako found something, she walked over to him as he read a rendezvous message while Asami presented a book of the guards' logs. The Avatar concluded that Hong Li knew everything and that it was time for him to talk, but Aiwei suggested they wait for him to break.",
      "links": [
        {
          "body": "Hong Li",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hong_Li",
            "page": "Hong_Li"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Discovering the truth"
      ],
      "text": "The next day, Korra watched as Aiwei questioned the guards and even Varrick, whose description of his nightly routine left her a little queasy, about the night. Upon Lin's suggestion to question Suyin, Korra promptly dismissed her, saying Suyin had nothing to do with it, but the matriarch decided to allow for questioning, much to the Avatar's concern. When Suyin asserted her innocence, Korra declared the questioning a waste of time and asked for the next guard. At the discovery of a guard, Hong Li, having been lying about his innocence, the waterbender glared at him and assisted in the search of his house for evidence. When Mako found something, she walked over to him as he read a rendezvous message while Asami presented a book of the guards' logs. The Avatar concluded that Hong Li knew everything and that it was time for him to talk, but Aiwei suggested they wait for him to break."
    },
    {
      "body": "After returning to the estate, Team Avatar walked around the scene of the battle. As Mako discussed his doubts over Hong Li's guilt, Korra felt the evidence was overwhelming; Varrick appeared at that point as he was collecting pumice stones. She and her friends were left grossed out at the sight of Zhu Li rubbing the industrialist's bare feet with them. He went on to explain to them that if one was trying to construct a conspiracy, they would single out someone as guilty and plant the evidence on them. When Mako realized that the only one who could keep such a secret was Aiwei, Korra and the others made their way to his house to search for clues.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Discovering the truth"
      ],
      "text": "After returning to the estate, Team Avatar walked around the scene of the battle. As Mako discussed his doubts over Hong Li's guilt, Korra felt the evidence was overwhelming; Varrick appeared at that point as he was collecting pumice stones. She and her friends were left grossed out at the sight of Zhu Li rubbing the industrialist's bare feet with them. He went on to explain to them that if one was trying to construct a conspiracy, they would single out someone as guilty and plant the evidence on them. When Mako realized that the only one who could keep such a secret was Aiwei, Korra and the others made their way to his house to search for clues."
    },
    {
      "body": "Once they sneaked in to the empty house, Korra tried looking at some books and by some windows, but made her way across the living room when Mako found that the bookshelf slid open to reveal an entrance to a secret tunnel. Korra asked what was down there, to which Mako believed it was the way the Red Lotus got in to the estate. They ran back when Asami alerted them about Aiwei's return to the house, but they were found by the emissary. Shooting Bolin a look for his poor attempt at a cover up, the Avatar answered by saying that things did not add up and they wondered if he had answers. Sitting them down and giving them tea, he asserted to Team Avatar that Hong Li was guilty, and asked them if they believed he himself had anything to do with it. She replied that they were merely looking for answers, to which she was told she had no idea what was coming for her. Aiwei promptly raised a metal wall and began to run. Korra slowly but surely was able to bend an opening in the wall, leading the team down the secret passage. When she opened the door, however, she found a bomb that promptly detonated. She quickly shielded herself and her friends with a sphere of air. They took a couple steps forward before realizing Aiwei had escaped, though Korra noticed a small opening in the wall, which she and Bolin revealed by bending the rubble out of its way. Upon Suyin and Lin's arrival, Korra alerted the former about the emissary's betrayal, deception, and escape, while noting that the tunnel allowed Zaheer's group to enter the estate.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Discovering the truth"
      ],
      "text": "Once they sneaked in to the empty house, Korra tried looking at some books and by some windows, but made her way across the living room when Mako found that the bookshelf slid open to reveal an entrance to a secret tunnel. Korra asked what was down there, to which Mako believed it was the way the Red Lotus got in to the estate. They ran back when Asami alerted them about Aiwei's return to the house, but they were found by the emissary. Shooting Bolin a look for his poor attempt at a cover up, the Avatar answered by saying that things did not add up and they wondered if he had answers. Sitting them down and giving them tea, he asserted to Team Avatar that Hong Li was guilty, and asked them if they believed he himself had anything to do with it. She replied that they were merely looking for answers, to which she was told she had no idea what was coming for her. Aiwei promptly raised a metal wall and began to run. Korra slowly but surely was able to bend an opening in the wall, leading the team down the secret passage. When she opened the door, however, she found a bomb that promptly detonated. She quickly shielded herself and her friends with a sphere of air. They took a couple steps forward before realizing Aiwei had escaped, though Korra noticed a small opening in the wall, which she and Bolin revealed by bending the rubble out of its way. Upon Suyin and Lin's arrival, Korra alerted the former about the emissary's betrayal, deception, and escape, while noting that the tunnel allowed Zaheer's group to enter the estate."
    },
    {
      "body": "The group regathered in Suyin's office. Korra decided to suspend their search for airbenders and track down Aiwei instead, noting Naga could follow his scent. Lin refused, wanting her to return to Republic City for her own safety, but Korra believed she would not be safe anywhere and that she had to stop him. She rebuffed Lin's belief that it was too dangerous and that tracking Zaheer and his associates down was her job. Suyin told her to listen to Lin, however, and promised that their foes would be brought to justice. Korra reluctantly gave in and returned with her friends to their accommodations.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Discovering the truth"
      ],
      "text": "The group regathered in Suyin's office. Korra decided to suspend their search for airbenders and track down Aiwei instead, noting Naga could follow his scent. Lin refused, wanting her to return to Republic City for her own safety, but Korra believed she would not be safe anywhere and that she had to stop him. She rebuffed Lin's belief that it was too dangerous and that tracking Zaheer and his associates down was her job. Suyin told her to listen to Lin, however, and promised that their foes would be brought to justice. Korra reluctantly gave in and returned with her friends to their accommodations."
    },
    {
      "body": "Later, Korra heard a knock at their door. She answered, seeing it was Suyin, who asked her if Naga could track Aiwei, which prompted an affirmative response. The matriarch handed her keys to a fully-supplied and readied jeep, confusing the Avatar. Suyin explained she wanted the group to hunt down Aiwei, adding that her earlier words were only what Lin wanted to hear and instead a plan to buy time. Korra embraced Suyin in gratitude before they left, the Avatar riding on Naga as they began their search.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Discovering the truth"
      ],
      "text": "Later, Korra heard a knock at their door. She answered, seeing it was Suyin, who asked her if Naga could track Aiwei, which prompted an affirmative response. The matriarch handed her keys to a fully-supplied and readied jeep, confusing the Avatar. Suyin explained she wanted the group to hunt down Aiwei, adding that her earlier words were only what Lin wanted to hear and instead a plan to buy time. Korra embraced Suyin in gratitude before they left, the Avatar riding on Naga as they began their search."
    },
    {
      "body": "Team Avatar, through Naga tracking down Aiwei's scent, made their way to just outside the ${link_0}; Korra complimented her companion on her abilities. They made their way to a tavern to find that the Earth Queen had distributed wanted posters of them because of their liberation of the airbenders. Korra defended her actions by saying they were not hers to keep while beginning to threaten the monarch, only for Asami to alert her that the patrons were glaring at them, ready to attack. She gestured at them as the team left.",
      "links": [
        {
          "body": "Misty Palms Oasis",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Misty_Palms_Oasis",
            "page": "Misty_Palms_Oasis"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Tracking down Zaheer and capture"
      ],
      "text": "Team Avatar, through Naga tracking down Aiwei's scent, made their way to just outside the Misty Palms Oasis; Korra complimented her companion on her abilities. They made their way to a tavern to find that the Earth Queen had distributed wanted posters of them because of their liberation of the airbenders. Korra defended her actions by saying they were not hers to keep while beginning to threaten the monarch, only for Asami to alert her that the patrons were glaring at them, ready to attack. She gestured at them as the team left."
    },
    {
      "body": "On the oasis' outskirts, Naga led them to a rock, which Korra earthbent to reveal Aiwei's jeep. The Avatar also realized she forgot to bring treats for her pet, which resulted in her getting slapped in the face with Naga's tail. When Mako proposed going back in to find Aiwei, Korra expressed her desire to go with Mako and Bolin, but was told to stay with Asami in case he came back, while also wanting to avoid attracting too much attention to themselves. As she watched over the oasis, she expressed her frustration about not knowing Zaheer's intent, but soon joined Asami when she found a note in Aiwei's vehicle, informing him to be at a place named \"${link_0}\" at sundown, which the Avatar deduced as where the emissary and Zaheer would meet. The two, however, were not able to find the location on the map. Mako and Bolin soon returned to inform them they found Aiwei at an inn, Korra proposed busting into his room and demanding answers, but Mako rebutted by saying it would cost them their element of surprise, instead suggesting a stakeout. Korra agreed, saying that Aiwei could lead them right to Zaheer.",
      "links": [
        {
          "body": "Xai Bau's Grove",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Xai_Bau%27s_Grove",
            "page": "Xai_Bau%27s_Grove"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Tracking down Zaheer and capture"
      ],
      "text": "On the oasis' outskirts, Naga led them to a rock, which Korra earthbent to reveal Aiwei's jeep. The Avatar also realized she forgot to bring treats for her pet, which resulted in her getting slapped in the face with Naga's tail. When Mako proposed going back in to find Aiwei, Korra expressed her desire to go with Mako and Bolin, but was told to stay with Asami in case he came back, while also wanting to avoid attracting too much attention to themselves. As she watched over the oasis, she expressed her frustration about not knowing Zaheer's intent, but soon joined Asami when she found a note in Aiwei's vehicle, informing him to be at a place named \"Xai Bau's Grove\" at sundown, which the Avatar deduced as where the emissary and Zaheer would meet. The two, however, were not able to find the location on the map. Mako and Bolin soon returned to inform them they found Aiwei at an inn, Korra proposed busting into his room and demanding answers, but Mako rebutted by saying it would cost them their element of surprise, instead suggesting a stakeout. Korra agreed, saying that Aiwei could lead them right to Zaheer."
    },
    {
      "body": "The team made their way to the ${link_0}, but the ${link_1} initially refused them service because teenagers had trashed a room last time. At that moment, they were found by two people named Lily and Macao. Because of their intimidating presence, the friends took an aggressive stance, Korra drawing fire knives. The two, however, instead revealed themselves to be fans of Bolin's mover, ${link_2}, and were seeking his autograph. Upon learning about their friend's status, the innkeeper relented and gave them a room. However, in seeking the room across from Aiwei's, they wound up in a small space, largely crammed in. Korra and Mako looked out the window, watching for any movements. While doing so, Bolin asked Korra to set official rules for the game of ${link_3}. Annoyed, she said she would \"put it on [her] list\" after her other priorities. Mako asked what they would do after they found Zaheer; Korra declared she would make him talk. An unsure Mako warned her they had not done so for thirteen years and would not start because they were threatened by bending. Still annoyed, the Avatar asked what they should do, to which she was answered to just keep spying.",
      "links": [
        {
          "body": "Misty Palms Inn",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Misty_Palms_Inn",
            "page": "Misty_Palms_Inn"
          }
        },
        {
          "body": "innkeeper",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Innkeeper",
            "page": "Innkeeper"
          }
        },
        {
          "body": "The Adventures of Nuktuk: Hero of the South",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/The_Adventures_of_Nuktuk__Hero_of_the_South",
            "page": "The_Adventures_of_Nuktuk__Hero_of_the_South"
          }
        },
        {
          "body": "Pai Sho",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Pai_Sho",
            "page": "Pai_Sho"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Tracking down Zaheer and capture"
      ],
      "text": "The team made their way to the Misty Palms Inn, but the innkeeper initially refused them service because teenagers had trashed a room last time. At that moment, they were found by two people named Lily and Macao. Because of their intimidating presence, the friends took an aggressive stance, Korra drawing fire knives. The two, however, instead revealed themselves to be fans of Bolin's mover, The Adventures of Nuktuk: Hero of the South, and were seeking his autograph. Upon learning about their friend's status, the innkeeper relented and gave them a room. However, in seeking the room across from Aiwei's, they wound up in a small space, largely crammed in. Korra and Mako looked out the window, watching for any movements. While doing so, Bolin asked Korra to set official rules for the game of Pai Sho. Annoyed, she said she would \"put it on [her] list\" after her other priorities. Mako asked what they would do after they found Zaheer; Korra declared she would make him talk. An unsure Mako warned her they had not done so for thirteen years and would not start because they were threatened by bending. Still annoyed, the Avatar asked what they should do, to which she was answered to just keep spying."
    },
    {
      "body": "After several hours of no apparent movement, Korra wondered why Aiwei had not left. She decided to go over despite Mako's warnings, but the group instead found him meditating. She soon realized that spirits who had tracked her and Asami down earlier were telling them Xai Bau's Grove was actually in the Spirit World. She meditated in herself, deciding to track him down. She quickly found Aiwei being confronted by Zaheer. Upon seeing the airbender grab him, Korra called out, but Zaheer promptly vanished. The Avatar, however, was soon reproached by her foe. She confirmed his suspicions of Aiwei having led them to him and asked what he did with him, to which she was told the emissary was thrown into the ${link_0}, leaving the two of them. Korra threatened him, but was instead calmly allowed to ask any questions she desired since neither of them could fight anyway.",
      "links": [
        {
          "body": "Fog of Lost Souls",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fog_of_Lost_Souls",
            "page": "Fog_of_Lost_Souls"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Tracking down Zaheer and capture"
      ],
      "text": "After several hours of no apparent movement, Korra wondered why Aiwei had not left. She decided to go over despite Mako's warnings, but the group instead found him meditating. She soon realized that spirits who had tracked her and Asami down earlier were telling them Xai Bau's Grove was actually in the Spirit World. She meditated in herself, deciding to track him down. She quickly found Aiwei being confronted by Zaheer. Upon seeing the airbender grab him, Korra called out, but Zaheer promptly vanished. The Avatar, however, was soon reproached by her foe. She confirmed his suspicions of Aiwei having led them to him and asked what he did with him, to which she was told the emissary was thrown into the Fog of Lost Souls, leaving the two of them. Korra threatened him, but was instead calmly allowed to ask any questions she desired since neither of them could fight anyway."
    },
    {
      "body": "Asking who they were and why they were threatening her, Korra was told Zaheer and his group were part of the Red Lotus, a group which broke away from the White Lotus because of the end of their secrecy and becoming servants of the Avatar and the four nations. Not satisfied, she asked why they had tried to take her as a child, which Zaheer noted to have been Unalaq's idea, and she realized Unalaq and Zaheer had planned all along to use her to open the portals while teaching her the Red Lotus' ways, a plan she interpreted as an attempt to brainwash her to further their own goals. Though Zaheer told her that is not really true as the Red Lotus is more interested in radically changing the world feeling that it is imbalanced the way it is.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Tracking down Zaheer and capture"
      ],
      "text": "Asking who they were and why they were threatening her, Korra was told Zaheer and his group were part of the Red Lotus, a group which broke away from the White Lotus because of the end of their secrecy and becoming servants of the Avatar and the four nations. Not satisfied, she asked why they had tried to take her as a child, which Zaheer noted to have been Unalaq's idea, and she realized Unalaq and Zaheer had planned all along to use her to open the portals while teaching her the Red Lotus' ways, a plan she interpreted as an attempt to brainwash her to further their own goals. Though Zaheer told her that is not really true as the Red Lotus is more interested in radically changing the world feeling that it is imbalanced the way it is."
    },
    {
      "body": "As this was happening, Ghazan and Ming-Hua came to the Misty Palms Inn. Korra's meditating form was taken by Asami on Naga to safety as Mako and Bolin held the criminals off.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Tracking down Zaheer and capture"
      ],
      "text": "As this was happening, Ghazan and Ming-Hua came to the Misty Palms Inn. Korra's meditating form was taken by Asami on Naga to safety as Mako and Bolin held the criminals off."
    },
    {
      "body": "Meanwhile, Korra wondered how her uncle escaped punishment, to which she was told he backed out of the plan, covered up his involvement afterward, and pursued his own goals. Learning that Unalaq becoming a Dark Avatar was not in the Red Lotus' plans, she asked what it truly was. The Avatar suggested their plans for balance were not the same, but her opening of the portals was actually a beginning. Zaheer told her the worlds should not be separate, nor should the nations be ruled by governments, such as the United Republic's presidency or the tyranny of the Earth Queen. Despite the problems she had encountered, Korra said taking out the governments was not the answer as it would bring chaos. She was told by Zaheer that this was the Red Lotus' goal, and was shocked to learn that the man who suggested that \"new growth could not arise without the destruction of the old\" was the wise airbender, ${link_0}. During this, Korra's meditating form, Naga, and Asami were soon captured in an earthen prison.",
      "links": [
        {
          "body": "Laghima",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Laghima",
            "page": "Laghima"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Tracking down Zaheer and capture"
      ],
      "text": "Meanwhile, Korra wondered how her uncle escaped punishment, to which she was told he backed out of the plan, covered up his involvement afterward, and pursued his own goals. Learning that Unalaq becoming a Dark Avatar was not in the Red Lotus' plans, she asked what it truly was. The Avatar suggested their plans for balance were not the same, but her opening of the portals was actually a beginning. Zaheer told her the worlds should not be separate, nor should the nations be ruled by governments, such as the United Republic's presidency or the tyranny of the Earth Queen. Despite the problems she had encountered, Korra said taking out the governments was not the answer as it would bring chaos. She was told by Zaheer that this was the Red Lotus' goal, and was shocked to learn that the man who suggested that \"new growth could not arise without the destruction of the old\" was the wise airbender, Laghima. During this, Korra's meditating form, Naga, and Asami were soon captured in an earthen prison."
    },
    {
      "body": "The Avatar tried to convince Zaheer to turn away from his goals, suggesting he could make a positive difference in the world especially now that he is an airbender. Korra did understand her foe's dissatisfaction with the state of the world, but did not believe overthrowing governments was the way to solve the problem. Zaheer told her change was a force that no one, not even the Avatar, could stop. Frustrated and losing patience, Korra said she was not interested in his \"philosophical mumbo-jumbo\" about change, instead asking to know what they would do to her when she was captured. She was told that she would know soon enough as the Red Lotus had likely captured her by that point; nonetheless, she tried to chase his vanishing form. When Korra returned to her body, she discovered both she and Asami were in chains, believing Zaheer had tricked them. When she asked Asami where the organization was, she was instead informed they were captured by the Earth Queen's forces and were on their way to Ba Sing Se.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Tracking down Zaheer and capture"
      ],
      "text": "The Avatar tried to convince Zaheer to turn away from his goals, suggesting he could make a positive difference in the world especially now that he is an airbender. Korra did understand her foe's dissatisfaction with the state of the world, but did not believe overthrowing governments was the way to solve the problem. Zaheer told her change was a force that no one, not even the Avatar, could stop. Frustrated and losing patience, Korra said she was not interested in his \"philosophical mumbo-jumbo\" about change, instead asking to know what they would do to her when she was captured. She was told that she would know soon enough as the Red Lotus had likely captured her by that point; nonetheless, she tried to chase his vanishing form. When Korra returned to her body, she discovered both she and Asami were in chains, believing Zaheer had tricked them. When she asked Asami where the organization was, she was instead informed they were captured by the Earth Queen's forces and were on their way to Ba Sing Se."
    },
    {
      "body": "At ${link_0}, Korra and Asami were loaded onto a ${link_1} for transport to the capital city, where she tried to convince the ${link_2} about the Red Lotus' threat and her conversation with Zaheer in the Spirit World, but was dismissed as insane. A guard, ${link_3}, chained her to a wall in the ship's prison hold. She tried to ask for water, but was told she could not have that, rocks, nor fire, and would not be released until they reached Ba Sing Se. Afterward, the Avatar, worried that Bolin and Mako had not come for them, hoped they were okay. She also told Asami that they had to get out before reaching the queen, to which she was assured that her friend had a plan. After Asami got out of her hold and dug below the floor for the keys, Korra was instructed to call for help in five minutes. The waterbender subsequently followed the instructions, thus distracting Arik while Asami, now holding the keys, knocked him out. She was promptly freed from her containment.",
      "links": [
        {
          "body": "Fort Bosco",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Si_Wong_Desert#Fort_Bosco",
            "page": "Si_Wong_Desert"
          }
        },
        {
          "body": "Ba Sing Se airship",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se_airship",
            "page": "Ba_Sing_Se_airship"
          }
        },
        {
          "body": "captain",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se_airship_captain",
            "page": "Ba_Sing_Se_airship_captain"
          }
        },
        {
          "body": "Arik",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Arik",
            "page": "Arik"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Escape from the airship and the Si Wong Desert"
      ],
      "text": "At Fort Bosco, Korra and Asami were loaded onto a Ba Sing Se airship for transport to the capital city, where she tried to convince the captain about the Red Lotus' threat and her conversation with Zaheer in the Spirit World, but was dismissed as insane. A guard, Arik, chained her to a wall in the ship's prison hold. She tried to ask for water, but was told she could not have that, rocks, nor fire, and would not be released until they reached Ba Sing Se. Afterward, the Avatar, worried that Bolin and Mako had not come for them, hoped they were okay. She also told Asami that they had to get out before reaching the queen, to which she was assured that her friend had a plan. After Asami got out of her hold and dug below the floor for the keys, Korra was instructed to call for help in five minutes. The waterbender subsequently followed the instructions, thus distracting Arik while Asami, now holding the keys, knocked him out. She was promptly freed from her containment."
    },
    {
      "body": "The two made their way to the cockpit, where Korra airbent the ${link_0} into the control panel, damaging the ship's controls and causing it to descend rapidly. When the co-pilot came after her, the Avatar again airbent him back, sending him into the captain and breaking the radio system. When Asami made note of this, Korra said it was not her fault that the airship was a \"hunk of junk\" before being told to hang on to something as they crashed into a sand dune.",
      "links": [
        {
          "body": "co-pilot",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se_airship_co-pilot",
            "page": "Ba_Sing_Se_airship_co-pilot"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Escape from the airship and the Si Wong Desert"
      ],
      "text": "The two made their way to the cockpit, where Korra airbent the co-pilot into the control panel, damaging the ship's controls and causing it to descend rapidly. When the co-pilot came after her, the Avatar again airbent him back, sending him into the captain and breaking the radio system. When Asami made note of this, Korra said it was not her fault that the airship was a \"hunk of junk\" before being told to hang on to something as they crashed into a sand dune."
    },
    {
      "body": "The two made their way to the ship's roof, where Korra asked Asami if anything could be done to get it going, to which she was told it would be challenging because, even if the Avatar metalbent the propellers into place, it would need to be dug out. As the ship's crew came to the roof, Korra asked if they were all right, though told an angered Arik she had to get free because there were dangerous forces at work they did not know about. The captain urged them to sit tight as he had radioed Ba Sing Se for another airship, but Korra stated they needed to leave at that point. The captain soon told them they were going nowhere and the two girls were still prisoners, angering Korra, who warned them she was the Avatar. However, upon seeing something moving under the sand, ${link_0} suggested it may be a spirit, which Korra angrily guessed was her fault too. She asked them if they wanted to get the ship fixed or wait to meet the creature, which convinced the crew to do the former.",
      "links": [
        {
          "body": "Kong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kong",
            "page": "Kong"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Escape from the airship and the Si Wong Desert"
      ],
      "text": "The two made their way to the ship's roof, where Korra asked Asami if anything could be done to get it going, to which she was told it would be challenging because, even if the Avatar metalbent the propellers into place, it would need to be dug out. As the ship's crew came to the roof, Korra asked if they were all right, though told an angered Arik she had to get free because there were dangerous forces at work they did not know about. The captain urged them to sit tight as he had radioed Ba Sing Se for another airship, but Korra stated they needed to leave at that point. The captain soon told them they were going nowhere and the two girls were still prisoners, angering Korra, who warned them she was the Avatar. However, upon seeing something moving under the sand, Kong suggested it may be a spirit, which Korra angrily guessed was her fault too. She asked them if they wanted to get the ship fixed or wait to meet the creature, which convinced the crew to do the former."
    },
    {
      "body": "The Avatar used her airbending to elevate the ship out of the sand and ultimately to clean all the sand from the engine room. She asked Asami of her progress, to which she was told the ship was operational again. However, just as Kong got the engine started again, the creature, a ${link_0}, emerged from underneath the sand and destroyed the airship. Recovering from the initial shock, Korra and the rest of the group ran as the ship and its supplies fell around them. Korra realized that the creature was not a spirit, but it did appear to be gone temporarily.",
      "links": [
        {
          "body": "sand shark",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sand_shark",
            "page": "Sand_shark"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Escape from the airship and the Si Wong Desert"
      ],
      "text": "The Avatar used her airbending to elevate the ship out of the sand and ultimately to clean all the sand from the engine room. She asked Asami of her progress, to which she was told the ship was operational again. However, just as Kong got the engine started again, the creature, a sand shark, emerged from underneath the sand and destroyed the airship. Recovering from the initial shock, Korra and the rest of the group ran as the ship and its supplies fell around them. Korra realized that the creature was not a spirit, but it did appear to be gone temporarily."
    },
    {
      "body": "Korra asked how far they were from the desert's edge, only to be told it was out of walking distance. She decided to accept Asami's suggestion of constructing a makeshift ${link_0} out of the remaining metal. Upon completion and seeing the creature reproach them, the group began their trek, the Avatar using her airbending to propel the sailer. She was briefly able to distance them from the creature, only for it to close in on them and attempt to swallow the group. Korra used a firebending blast to throw the beast down, allowing them to flee and thus reach the Misty Palms Oasis. There, she apologized to the captain for stranding them. He joked that the conflict between her and the queen was about his pay grade before the two shook hands and was wished good luck with a salute. The young woman was soon approached by Naga, who tackled and licked her.",
      "links": [
        {
          "body": "sand-sailer",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sand-sailer",
            "page": "Sand-sailer"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Escape from the airship and the Si Wong Desert"
      ],
      "text": "Korra asked how far they were from the desert's edge, only to be told it was out of walking distance. She decided to accept Asami's suggestion of constructing a makeshift sand-sailer out of the remaining metal. Upon completion and seeing the creature reproach them, the group began their trek, the Avatar using her airbending to propel the sailer. She was briefly able to distance them from the creature, only for it to close in on them and attempt to swallow the group. Korra used a firebending blast to throw the beast down, allowing them to flee and thus reach the Misty Palms Oasis. There, she apologized to the captain for stranding them. He joked that the conflict between her and the queen was about his pay grade before the two shook hands and was wished good luck with a salute. The young woman was soon approached by Naga, who tackled and licked her."
    },
    {
      "body": "Korra and Asami made their way to a tavern, where they found Tonraq, Lin, and Lord ${link_0}. She embraced her father and was reintroduced to the former Fire Lord, whom she was glad to see. She also apologized to Lin for ditching her back at Zaofu and asked how they found them, to which she was sarcastically reminded by Lin that she was a detective. The girls were also informed about Mako and Bolin's capture and Tonraq asked them if they knew what happened to the Earth Queen. After hearing a radio report that the queen had been overthrown and Ba Sing Se was in chaos, the Avatar realized it was the Red Lotus' doing, informing her unsure father that it was the group who was after her, while ominously warning their actions against the monarch were only the beginning.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Escape from the airship and the Si Wong Desert"
      ],
      "text": "Korra and Asami made their way to a tavern, where they found Tonraq, Lin, and Lord Zuko. She embraced her father and was reintroduced to the former Fire Lord, whom she was glad to see. She also apologized to Lin for ditching her back at Zaofu and asked how they found them, to which she was sarcastically reminded by Lin that she was a detective. The girls were also informed about Mako and Bolin's capture and Tonraq asked them if they knew what happened to the Earth Queen. After hearing a radio report that the queen had been overthrown and Ba Sing Se was in chaos, the Avatar realized it was the Red Lotus' doing, informing her unsure father that it was the group who was after her, while ominously warning their actions against the monarch were only the beginning."
    },
    {
      "body": "After Naga and Pabu found that Bolin and Mako had made their way to the Misty Palms Oasis, Korra and Asami emerged from the tavern. Korra hugged Mako tightly and told him and Bolin she was glad to see them. She was soon introduced by Mako to his and Bolin's grandmother, ${link_0}, who remarked that the Avatar was rather muscular for a woman. Off-guard, she sheepishly said Yin was the same. Mako and Bolin subsequently helped explain what happened to them to her; Korra was soon warned about Zaheer's message he had them deliver to her: she turn herself over or he would wipe out the new Air Nation. She realized they needed to warn Tenzin about the risk he and the airbenders faced, but there was no suitable radio nearby. Korra resolved they needed to return to Zaofu to access a suitable signal; thus, the group went on their way.",
      "links": [
        {
          "body": "Yin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Yin",
            "page": "Yin"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Warning Tenzin"
      ],
      "text": "After Naga and Pabu found that Bolin and Mako had made their way to the Misty Palms Oasis, Korra and Asami emerged from the tavern. Korra hugged Mako tightly and told him and Bolin she was glad to see them. She was soon introduced by Mako to his and Bolin's grandmother, Yin, who remarked that the Avatar was rather muscular for a woman. Off-guard, she sheepishly said Yin was the same. Mako and Bolin subsequently helped explain what happened to them to her; Korra was soon warned about Zaheer's message he had them deliver to her: she turn herself over or he would wipe out the new Air Nation. She realized they needed to warn Tenzin about the risk he and the airbenders faced, but there was no suitable radio nearby. Korra resolved they needed to return to Zaofu to access a suitable signal; thus, the group went on their way."
    },
    {
      "body": "Once there, Korra asked Suyin if they had any luck reaching the Northern Air Temple, only to be told she did not; despite a usable signal, no one was answering. They ventured to the radio room, where the operator continued to struggle in getting an answer. The frustrated Avatar knew she had to do something with time of the essence. She decided she would meditate into the Spirit World and over to Xai Bau's Grove, knowing Zaheer spent time there. She assured Lin she would be fine and left to meditate as Asami watched over her body.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Warning Tenzin"
      ],
      "text": "Once there, Korra asked Suyin if they had any luck reaching the Northern Air Temple, only to be told she did not; despite a usable signal, no one was answering. They ventured to the radio room, where the operator continued to struggle in getting an answer. The frustrated Avatar knew she had to do something with time of the essence. She decided she would meditate into the Spirit World and over to Xai Bau's Grove, knowing Zaheer spent time there. She assured Lin she would be fine and left to meditate as Asami watched over her body."
    },
    {
      "body": "Reaching the grove, Korra demanded Zaheer show himself. Upon seeing a shadowed presence, she initially believed it was Zaheer, but it turned out to be Iroh instead, much to her surprise. She explained to him that the \"maniac\" was threatening the Air Nation and she had no clue what to do, lamenting the loss of her connection to her past lives. Iroh told her of Aang and Zuko's close friendship, which prompted Korra to talk to Zuko about her situation. She thanked Iroh and realized he was correct about the Spirit World: One could find something they were not looking for and she expressed her gladness to find him again. Upon return, she told Asami of her experience and went to talk to Zuko.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Warning Tenzin"
      ],
      "text": "Reaching the grove, Korra demanded Zaheer show himself. Upon seeing a shadowed presence, she initially believed it was Zaheer, but it turned out to be Iroh instead, much to her surprise. She explained to him that the \"maniac\" was threatening the Air Nation and she had no clue what to do, lamenting the loss of her connection to her past lives. Iroh told her of Aang and Zuko's close friendship, which prompted Korra to talk to Zuko about her situation. She thanked Iroh and realized he was correct about the Spirit World: One could find something they were not looking for and she expressed her gladness to find him again. Upon return, she told Asami of her experience and went to talk to Zuko."
    },
    {
      "body": "Korra was surprised to find Zuko with his dragon, preparing to leave, but understood it was for the need of protecting his daughter, the Fire Lord. She asked him for advice as to what Aang would do if faced with the situation before her. Zuko told her Aang would be proud of her and would sacrifice anything to protect the rebuilt Air Nation. Although Zuko was unsure if Aang would sacrifice his own life, the retired Fire Lord emphasized that Aang cared for all people of all nations and knew better than anyone that the world needed its Avatar in times of turmoil. Korra thanked him and told him about speaking with his uncle in the Spirit World. At that moment, Mako came out to inform them they had gotten through to the Northern Air Temple.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Warning Tenzin"
      ],
      "text": "Korra was surprised to find Zuko with his dragon, preparing to leave, but understood it was for the need of protecting his daughter, the Fire Lord. She asked him for advice as to what Aang would do if faced with the situation before her. Zuko told her Aang would be proud of her and would sacrifice anything to protect the rebuilt Air Nation. Although Zuko was unsure if Aang would sacrifice his own life, the retired Fire Lord emphasized that Aang cared for all people of all nations and knew better than anyone that the world needed its Avatar in times of turmoil. Korra thanked him and told him about speaking with his uncle in the Spirit World. At that moment, Mako came out to inform them they had gotten through to the Northern Air Temple."
    },
    {
      "body": "In the radio room, seeing Bolin starting banter with Meelo over baby sky bison, Korra shoved her friend out of the way and demanded Meelo retrieve Tenzin. Once Tenzin responded, Korra warned him about Zaheer approaching the Northern Air Temple and to evacuate, only to be told it was too late as, at that moment, Zaheer and the Red Lotus arrived.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Warning Tenzin"
      ],
      "text": "In the radio room, seeing Bolin starting banter with Meelo over baby sky bison, Korra shoved her friend out of the way and demanded Meelo retrieve Tenzin. Once Tenzin responded, Korra warned him about Zaheer approaching the Northern Air Temple and to evacuate, only to be told it was too late as, at that moment, Zaheer and the Red Lotus arrived."
    },
    {
      "body": "Aboard the Zaofu airship bound for the Northern Air Temple, Korra sadly looked out the window as her friends, father, Suyin, and Lin discussed plans for attacking the Red Lotus. She believed there was nothing they could do as the Red Lotus would wipe out the airbenders the moment Zaheer would suspect something to be wrong and decided she had no choice but to give herself up. She told her friends the world needed the Air Nation back and they could not let Zaheer destroy everyone they loved, asking them to save the airbenders before saving her. After being assured by Tonraq and Suyin they would support her, Korra went to the ship's radio room to inform Zaheer she had agreed to his terms. She was instructed by Zaheer to go to the top of ${link_0} at noon alone; at that point, he would release the airbenders. After informing her allies of her decision, the Avatar went over to Suyin, who informed her of a plan to get both Korra and the airbenders out safely.",
      "links": [
        {
          "body": "Laghima's Peak",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Laghima%27s_Peak",
            "page": "Laghima%27s_Peak"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Capture by Zaheer"
      ],
      "text": "Aboard the Zaofu airship bound for the Northern Air Temple, Korra sadly looked out the window as her friends, father, Suyin, and Lin discussed plans for attacking the Red Lotus. She believed there was nothing they could do as the Red Lotus would wipe out the airbenders the moment Zaheer would suspect something to be wrong and decided she had no choice but to give herself up. She told her friends the world needed the Air Nation back and they could not let Zaheer destroy everyone they loved, asking them to save the airbenders before saving her. After being assured by Tonraq and Suyin they would support her, Korra went to the ship's radio room to inform Zaheer she had agreed to his terms. She was instructed by Zaheer to go to the top of Laghima's Peak at noon alone; at that point, he would release the airbenders. After informing her allies of her decision, the Avatar went over to Suyin, who informed her of a plan to get both Korra and the airbenders out safely."
    },
    {
      "body": "At the base of Laghima's Peak, Korra was given a radio by Lin. Afterward, she embraced Asami and Mako before being tightly hugged by Bolin, resting her head on his. Before leaving, she assured Tonraq she would be safe and embraced him while receiving words of praise. Korra told her father she loved him and, after separating from the hug, advised him to watch out for Zaheer because he was not fond of world leaders. She was simply told just to focus on her mission before they went their separate ways.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Capture by Zaheer"
      ],
      "text": "At the base of Laghima's Peak, Korra was given a radio by Lin. Afterward, she embraced Asami and Mako before being tightly hugged by Bolin, resting her head on his. Before leaving, she assured Tonraq she would be safe and embraced him while receiving words of praise. Korra told her father she loved him and, after separating from the hug, advised him to watch out for Zaheer because he was not fond of world leaders. She was simply told just to focus on her mission before they went their separate ways."
    },
    {
      "body": "Korra flew up to the top of the peak on her airbender staff and used the radio to ask Mako if her friends found the airbenders yet, to which she was told they had not. She found Zaheer and P'Li waiting for her; the former ordered the Avatar to drop her staff and surrender. Upon being told by Mako that Ghazan was with the airbenders, she demanded Zaheer tell Ghazan to stand down, but was refuted and ordered to surrender again. After Zaheer told Ghazan to wipe the captives out, Korra decided to surrender. She approached P'Li, dropping her staff and radio while raising her hands. P'Li shackled her wrists and ankles with platinum chains. Just as she was being led to the airship, however, Mako called out on the radio that they had been double-crossed. Korra jumped up and used her airbending to blast Zaheer and P'Li away for a moment. Limited to just the bottom of her feet for bending, she attempted to duel the former, but her attacks were dodged and she was knocked over by a blast of air. Zaheer began leading her to the airship again, but Tonraq, using water tendrils to ascend the peak, jumped up and threw him back. Korra briefly fell from the cliff when her enemy shoved her aside, but was saved when her father used his tendrils to freeze her wrists and pull her up. She promptly firebent at Zaheer and teamed up with Tonraq, resuming the duel.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Capture by Zaheer"
      ],
      "text": "Korra flew up to the top of the peak on her airbender staff and used the radio to ask Mako if her friends found the airbenders yet, to which she was told they had not. She found Zaheer and P'Li waiting for her; the former ordered the Avatar to drop her staff and surrender. Upon being told by Mako that Ghazan was with the airbenders, she demanded Zaheer tell Ghazan to stand down, but was refuted and ordered to surrender again. After Zaheer told Ghazan to wipe the captives out, Korra decided to surrender. She approached P'Li, dropping her staff and radio while raising her hands. P'Li shackled her wrists and ankles with platinum chains. Just as she was being led to the airship, however, Mako called out on the radio that they had been double-crossed. Korra jumped up and used her airbending to blast Zaheer and P'Li away for a moment. Limited to just the bottom of her feet for bending, she attempted to duel the former, but her attacks were dodged and she was knocked over by a blast of air. Zaheer began leading her to the airship again, but Tonraq, using water tendrils to ascend the peak, jumped up and threw him back. Korra briefly fell from the cliff when her enemy shoved her aside, but was saved when her father used his tendrils to freeze her wrists and pull her up. She promptly firebent at Zaheer and teamed up with Tonraq, resuming the duel."
    },
    {
      "body": "Korra tried kicking rocks at Zaheer, but her attacks were blocked or dodged. She cried out in horror for Tonraq when he was thrown off the cliff by Zaheer's airbending. However, when her foe was left stunned by P'Li's death, she attacked with firebending, but she again could not land a blow and was knocked out by a blade of air. Her unconscious form was taken by the airbender, who was able to unlock the long forgotten ability of flight, to an ${link_0}. She was suspended in chains and, upon being approached by Zaheer, Ghazan, and Ming-Hua, firebent at them, believing Zaheer had killed Tonraq. At that moment, a Red Lotus member brought a bowl of ${link_1} in to the hold.",
      "links": [
        {
          "body": "underground prison hold",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomad_caves",
            "page": "Air_Nomad_caves"
          }
        },
        {
          "body": "poison",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mercury",
            "page": "Mercury"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "Capture by Zaheer"
      ],
      "text": "Korra tried kicking rocks at Zaheer, but her attacks were blocked or dodged. She cried out in horror for Tonraq when he was thrown off the cliff by Zaheer's airbending. However, when her foe was left stunned by P'Li's death, she attacked with firebending, but she again could not land a blow and was knocked out by a blade of air. Her unconscious form was taken by the airbender, who was able to unlock the long forgotten ability of flight, to an underground prison hold. She was suspended in chains and, upon being approached by Zaheer, Ghazan, and Ming-Hua, firebent at them, believing Zaheer had killed Tonraq. At that moment, a Red Lotus member brought a bowl of poison in to the hold."
    },
    {
      "body": "Korra threatened to wipe out the Red Lotus, but was unable to free herself from the chains that snared her. She was told the poison would force her body into the Avatar State; the Avatar realized in horror that, once the substance killed her, the Avatar Cycle would end. The poison was painfully metalbent on and into her body, starting the process of triggering the Avatar State. As she tried to fight it off, she had a vision of Zaheer, Ghazan, and Ming-Hua warping into Amon, Unalaq, and Vaatu respectively, each telling her her time was over and she should just give up. Upon the full activation of the state, the Avatar used her enhanced strength to rip out the earth that her chains were tied to and throw Ming-Hua aside and airbend the lava Ghazan had made at her. She separated from the bonds and began fighting Zaheer once more, using jets of fire to launch herself at him as he tried to fly away.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Fighting Zaheer"
      ],
      "text": "Korra threatened to wipe out the Red Lotus, but was unable to free herself from the chains that snared her. She was told the poison would force her body into the Avatar State; the Avatar realized in horror that, once the substance killed her, the Avatar Cycle would end. The poison was painfully metalbent on and into her body, starting the process of triggering the Avatar State. As she tried to fight it off, she had a vision of Zaheer, Ghazan, and Ming-Hua warping into Amon, Unalaq, and Vaatu respectively, each telling her her time was over and she should just give up. Upon the full activation of the state, the Avatar used her enhanced strength to rip out the earth that her chains were tied to and throw Ming-Hua aside and airbend the lava Ghazan had made at her. She separated from the bonds and began fighting Zaheer once more, using jets of fire to launch herself at him as he tried to fly away."
    },
    {
      "body": "Once outside the prison hold, Korra charged at Zaheer, but was thrown down a stone pillar. She was able to maintain her balance with earthbending and charged again, using large fragments of rocks to attempt attacks. Jumping from rock-to-rock with occasional propulsion to keep up, she was able to pursue but her attacks wound up dodged. Korra was soon thrown back by air blasts and rolled down the mountain for a moment, but again recovered and used her enhanced bending to lift a large boulder at her foe, but he again dodged and came at her again. Descending into a pond, the Avatar used water whips and was able to freeze his ankle, causing Zaheer to descend rapidly. She used the opening to fly at him again, but her state was weakened by the poison and she fell onto the side of a cliff. She tried to recover, but was blasted down the cliff by the airbending criminal.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Fighting Zaheer"
      ],
      "text": "Once outside the prison hold, Korra charged at Zaheer, but was thrown down a stone pillar. She was able to maintain her balance with earthbending and charged again, using large fragments of rocks to attempt attacks. Jumping from rock-to-rock with occasional propulsion to keep up, she was able to pursue but her attacks wound up dodged. Korra was soon thrown back by air blasts and rolled down the mountain for a moment, but again recovered and used her enhanced bending to lift a large boulder at her foe, but he again dodged and came at her again. Descending into a pond, the Avatar used water whips and was able to freeze his ankle, causing Zaheer to descend rapidly. She used the opening to fly at him again, but her state was weakened by the poison and she fell onto the side of a cliff. She tried to recover, but was blasted down the cliff by the airbending criminal."
    },
    {
      "body": "Falling to a stone pillar and left unable to fight, Zaheer surrounded her with air and began attempting to suffocate her by removing her breath and covering her head in a ball of air. At that moment, however, the freed airbenders used a tornado to release Korra and ensnare Zaheer in his attempt to escape. She used her chains to pull him down with her, enabling Lin and Suyin to trap him in an earthen prison. Despite her victory, Korra was left on the verge of death due to the poison within her. She was cradled by Tonraq as, after Jinora recognized the poison to be a metallic solution, Suyin tried to bend it out of her. After she had done so, Korra awoke, realizing her father was alive and was pulled closer to him. The battle, however, had left her confined to a wheelchair and in a physically and emotionally weakened state overall.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Fighting Zaheer"
      ],
      "text": "Falling to a stone pillar and left unable to fight, Zaheer surrounded her with air and began attempting to suffocate her by removing her breath and covering her head in a ball of air. At that moment, however, the freed airbenders used a tornado to release Korra and ensnare Zaheer in his attempt to escape. She used her chains to pull him down with her, enabling Lin and Suyin to trap him in an earthen prison. Despite her victory, Korra was left on the verge of death due to the poison within her. She was cradled by Tonraq as, after Jinora recognized the poison to be a metallic solution, Suyin tried to bend it out of her. After she had done so, Korra awoke, realizing her father was alive and was pulled closer to him. The battle, however, had left her confined to a wheelchair and in a physically and emotionally weakened state overall."
    },
    {
      "body": "Two weeks later on Air Temple Island, Korra was given assistance by Asami in preparing to appear at Jinora's airbending master ceremony. Greatly upset over being in such debilitation, Asami assured her no one expected her to bounce back so soon, telling her to enjoy the day for Jinora and adding that she was there for her. Korra decided to go and was wheeled out to meet with her family and allies. She was hugged by Senna and complimented on her appearance both by Tonraq and Tenzin before Raiko officially welcomed her back, thanking her for defeating the Red Lotus. However, she only responded with a noncommittal dip of her head. She did smile, however, when Ikki and Meelo approached her, the latter jumping on her lap.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Fighting Zaheer"
      ],
      "text": "Two weeks later on Air Temple Island, Korra was given assistance by Asami in preparing to appear at Jinora's airbending master ceremony. Greatly upset over being in such debilitation, Asami assured her no one expected her to bounce back so soon, telling her to enjoy the day for Jinora and adding that she was there for her. Korra decided to go and was wheeled out to meet with her family and allies. She was hugged by Senna and complimented on her appearance both by Tonraq and Tenzin before Raiko officially welcomed her back, thanking her for defeating the Red Lotus. However, she only responded with a noncommittal dip of her head. She did smile, however, when Ikki and Meelo approached her, the latter jumping on her lap."
    },
    {
      "body": "Korra watched as the ceremony took place; she was praised by Tenzin for reviving the Air Nation and her willingness to risk her life for it. She was also vowed to that the Air Nation would follow in her footsteps and help provide balance to the world, slightly bowing her head with a smile upon her airbending master bowing to her. The Avatar's eyes watered as the ceremony reached its conclusion and she shed a single tear.",
      "links": [],
      "section": [
        "History of Korra (late 171 AG)",
        "Fighting Zaheer"
      ],
      "text": "Korra watched as the ceremony took place; she was praised by Tenzin for reviving the Air Nation and her willingness to risk her life for it. She was also vowed to that the Air Nation would follow in her footsteps and help provide balance to the world, slightly bowing her head with a smile upon her airbending master bowing to her. The Avatar's eyes watered as the ceremony reached its conclusion and she shed a single tear."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "See also"
      ],
      "text": "Korra"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Korra (153 AG - 170 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Korra_(153_AG_-_170_AG)",
            "page": "History_of_Korra_(153_AG_-_170_AG)"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "See also"
      ],
      "text": "History of Korra (153 AG - 170 AG)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Korra (171 AG - Harmonic Convergence)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Korra_(171_AG_-_Harmonic_Convergence)",
            "page": "History_of_Korra_(171_AG_-_Harmonic_Convergence)"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "See also"
      ],
      "text": "History of Korra (171 AG - Harmonic Convergence)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Korra (171 - 173 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Korra#171_-_173_AG",
            "page": "Korra"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "See also"
      ],
      "text": "History of Korra (171 - 173 AG)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Korra (174 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Korra_(174_AG)",
            "page": "History_of_Korra_(174_AG)"
          }
        }
      ],
      "section": [
        "History of Korra (late 171 AG)",
        "See also"
      ],
      "text": "History of Korra (174 AG)"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Korra_(late_171_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Korra_(late_171_AG).html",
    "page": "History_of_Korra_(late_171_AG)",
    "title": "History of Korra (late 171 AG)"
  }
}