{
  "categories": [
    {
      "body": "Zuko",
      "target": {
        "href": "Category_Zuko",
        "page": "Category_Zuko"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} was the former ${link_1} of the ${link_2}. When he was young, ${link_3} suddenly disappeared and his ${link_4} ascended to the ${link_5} of the Fire Nation. At thirteen, his father challenged a young Zuko to an ${link_6} for speaking out of turn at a meeting where the young prince would receive a permanent scar on his left eye. For refusing to even fight during the duel, Zuko was exiled by his father. The only way he could return was if he captured the ${link_7}, which became one of his top priorities.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Crown Prince",
          "key": "${link_1}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "his mother",
          "key": "${link_3}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        },
        {
          "body": "father",
          "key": "${link_4}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "throne",
          "key": "${link_5}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_6}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_7}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Zuko was the former Crown Prince of the Fire Nation. When he was young, his mother suddenly disappeared and his father ascended to the throne of the Fire Nation. At thirteen, his father challenged a young Zuko to an Agni Kai for speaking out of turn at a meeting where the young prince would receive a permanent scar on his left eye. For refusing to even fight during the duel, Zuko was exiled by his father. The only way he could return was if he captured the Avatar, which became one of his top priorities."
    },
    {
      "body": "Zuko was born to Ozai and Ursa of the Fire Nation. His father was second in the line of succession to the throne of the Fire Nation, making Zuko a prince as well. From an early age, Zuko was disdained by his father and was also the object of his sister ${link_0}'s manipulation, ridicule, and deception. Zuko's mother, however, loved him and favored him over Azula. When his mother disappeared, Zuko fell even more out of favor.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Zuko was born to Ozai and Ursa of the Fire Nation. His father was second in the line of succession to the throne of the Fire Nation, making Zuko a prince as well. From an early age, Zuko was disdained by his father and was also the object of his sister Azula's manipulation, ridicule, and deception. Zuko's mother, however, loved him and favored him over Azula. When his mother disappeared, Zuko fell even more out of favor."
    },
    {
      "body": "${link_0} pleading for ${link_1}'s forgiveness during their ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "his father",
          "key": "${link_1}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_2}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        }
      ],
      "text": "Zuko pleading for his father's forgiveness during their Agni Kai."
    },
    {
      "body": "When he was thirteen years old, Zuko attended a war meeting, seeing it as the perfect opportunity to gain the knowledge he would need to be Fire Lord and rule over the Fire Nation in the future. After hearing a general's plan to sacrifice a novice division in an attack on the ${link_0}, Zuko became angry and spoke out against the plan. His father became furious with him and ordered that Zuko fight in an Agni Kai as a way to resolve the matter. Zuko expected to fight the general, but realized that because he had protested against the ${link_1} plan in the Fire Lord's war room, he had disrespected the Fire Lord; he would have to face his own father. When Ozai demanded that Zuko fight for his honor, Zuko refused. As punishment for showing weakness and refusing to fight, Ozai scarred and banished him from the Fire Nation, saying he could only return once he captured the Avatar.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "general's",
          "key": "${link_1}",
          "target": {
            "href": "Bujing",
            "page": "Bujing"
          }
        }
      ],
      "text": "When he was thirteen years old, Zuko attended a war meeting, seeing it as the perfect opportunity to gain the knowledge he would need to be Fire Lord and rule over the Fire Nation in the future. After hearing a general's plan to sacrifice a novice division in an attack on the Earth Kingdom, Zuko became angry and spoke out against the plan. His father became furious with him and ordered that Zuko fight in an Agni Kai as a way to resolve the matter. Zuko expected to fight the general, but realized that because he had protested against the general's plan in the Fire Lord's war room, he had disrespected the Fire Lord; he would have to face his own father. When Ozai demanded that Zuko fight for his honor, Zuko refused. As punishment for showing weakness and refusing to fight, Ozai scarred and banished him from the Fire Nation, saying he could only return once he captured the Avatar."
    },
    {
      "body": "${link_0} beginning his search for the ${link_1} at the ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_2}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "text": "Zuko beginning his search for the Avatar at the Western Air Temple."
    },
    {
      "body": "Two and a half years after his banishment, Zuko's travels led him to the ${link_0}. One day, he witnessed a column of bright light from his ${link_1} and eagerly told his skeptical uncle ${link_2} that the light must have signaled the Avatar's presence; he was, in fact, correct, as ${link_3} had just been freed from the iceberg. The banished prince ordered the course be set for the source of the light, determined to capture the Avatar.",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "warship",
          "key": "${link_1}",
          "target": {
            "href": "Zuko%27s_ship",
            "page": "Zuko%27s_ship"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_2}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Two and a half years after his banishment, Zuko's travels led him to the South Pole. One day, he witnessed a column of bright light from his warship and eagerly told his skeptical uncle Iroh that the light must have signaled the Avatar's presence; he was, in fact, correct, as Aang had just been freed from the iceberg. The banished prince ordered the course be set for the source of the light, determined to capture the Avatar."
    },
    {
      "body": "As the evening wore on, Iroh advised Zuko to rest and reminded him that his quest was futile, as the prince's father, ${link_0}, and ${link_1} had all attempted it and failed. Zuko tersely commented that they had not found the Avatar because their honor was not at stake, as opposed to him.",
      "links": [
        {
          "body": "grandfather",
          "key": "${link_0}",
          "target": {
            "href": "Azulon",
            "page": "Azulon"
          }
        },
        {
          "body": "great-grandfather",
          "key": "${link_1}",
          "target": {
            "href": "Sozin",
            "page": "Sozin"
          }
        }
      ],
      "text": "As the evening wore on, Iroh advised Zuko to rest and reminded him that his quest was futile, as the prince's father, grandfather, and great-grandfather had all attempted it and failed. Zuko tersely commented that they had not found the Avatar because their honor was not at stake, as opposed to him."
    },
    {
      "body": "The next day, Iroh taught ${link_0} basics to Zuko, drilling the prince and his infantry sparring partners in a sequence Zuko could not quite complete correctly. After Iroh lectured on the importance of strength as an extension of breath and not brute force for firebending, an impatient Zuko tried to browbeat Iroh into teaching him a more advanced set. Zuko reasoned that it would take more than basics to defeat the Avatar, who had a century to master all the elements. Iroh grudgingly acquiesced, but first took a moment to finish his ${link_1}.",
      "links": [
        {
          "body": "firebending",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "roast duck",
          "key": "${link_1}",
          "target": {
            "href": "Roast_duck",
            "page": "Roast_duck"
          }
        }
      ],
      "text": "The next day, Iroh taught firebending basics to Zuko, drilling the prince and his infantry sparring partners in a sequence Zuko could not quite complete correctly. After Iroh lectured on the importance of strength as an extension of breath and not brute force for firebending, an impatient Zuko tried to browbeat Iroh into teaching him a more advanced set. Zuko reasoned that it would take more than basics to defeat the Avatar, who had a century to master all the elements. Iroh grudgingly acquiesced, but first took a moment to finish his roast duck."
    },
    {
      "body": "Later, Zuko saw a signal flare from an old Fire Nation ${link_0}, accidentally triggered by the Avatar. As ${link_1} and Avatar Aang escaped the shipwreck, Zuko saw them heading toward the village through a ${link_2}. Zuko told his crew to wake his uncle as he had finally found the Avatar and his hiding place.",
      "links": [
        {
          "body": "shipwreck",
          "key": "${link_0}",
          "target": {
            "href": "Shipwreck",
            "page": "Shipwreck"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "telescope",
          "key": "${link_2}",
          "target": {
            "href": "Zuko%27s_ship#Zuko.27s_telescope",
            "page": "Zuko%27s_ship"
          }
        }
      ],
      "text": "Later, Zuko saw a signal flare from an old Fire Nation shipwreck, accidentally triggered by the Avatar. As Katara and Avatar Aang escaped the shipwreck, Zuko saw them heading toward the village through a telescope. Zuko told his crew to wake his uncle as he had finally found the Avatar and his hiding place."
    },
    {
      "body": "${link_0} interrogating the ${link_1} village citizens, looking for the ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Zuko interrogating the Southern Water Tribe village citizens, looking for the Avatar."
    },
    {
      "body": "Zuko's ship quickly arrived at the Water Tribe village. The exiled Prince descended, accompanied by a small number of soldiers. ${link_0} charged at him; however, possessing more fighting experience, Zuko required only his bare hands to counter Sokka's primitive weaponry and was almost dismissive of his presence.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Zuko's ship quickly arrived at the Water Tribe village. The exiled Prince descended, accompanied by a small number of soldiers. Sokka charged at him; however, possessing more fighting experience, Zuko required only his bare hands to counter Sokka's primitive weaponry and was almost dismissive of his presence."
    },
    {
      "body": "Zuko demanded the location of the Avatar, expecting to find an old man somewhere in the village. He grabbed ${link_0} threateningly, and Sokka attacked him again. The two fought briefly, with Zuko once again using only his bare hands to render Sokka's attacks useless. Sokka managed a lucky hit when his boomerang struck the back of Zuko's helmet, angering the prince who threatened to use firebending on the villagers.",
      "links": [
        {
          "body": "Kanna",
          "key": "${link_0}",
          "target": {
            "href": "Kanna",
            "page": "Kanna"
          }
        }
      ],
      "text": "Zuko demanded the location of the Avatar, expecting to find an old man somewhere in the village. He grabbed Kanna threateningly, and Sokka attacked him again. The two fought briefly, with Zuko once again using only his bare hands to render Sokka's attacks useless. Sokka managed a lucky hit when his boomerang struck the back of Zuko's helmet, angering the prince who threatened to use firebending on the villagers."
    },
    {
      "body": "Suddenly, Avatar Aang arrived, ${link_0}, and knocked Zuko off his feet. Zuko was shocked to discover that the Avatar was merely a twelve-year-old boy, rather than the ancient master he was expecting. As he voiced this revelation, the Water Tribe villagers expressed their own surprise. Zuko quickly regained his focus, and wasted no time in launching a series of fire blasts at Aang. Aang was able to defend himself with ${link_1}, but soon decided to stop the battle when he realized that Zuko's attacks would inevitably strike the children he had befriended. Aang surrendered, and Zuko's soldiers took him aboard as a prisoner before setting off for the Fire Nation.",
      "links": [
        {
          "body": "riding on an otter-penguin",
          "key": "${link_0}",
          "target": {
            "href": "Penguin_sledding",
            "page": "Penguin_sledding"
          }
        },
        {
          "body": "airbending",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Suddenly, Avatar Aang arrived, riding on an otter-penguin, and knocked Zuko off his feet. Zuko was shocked to discover that the Avatar was merely a twelve-year-old boy, rather than the ancient master he was expecting. As he voiced this revelation, the Water Tribe villagers expressed their own surprise. Zuko quickly regained his focus, and wasted no time in launching a series of fire blasts at Aang. Aang was able to defend himself with airbending, but soon decided to stop the battle when he realized that Zuko's attacks would inevitably strike the children he had befriended. Aang surrendered, and Zuko's soldiers took him aboard as a prisoner before setting off for the Fire Nation."
    },
    {
      "body": "On Zuko's ship, the guards escorted Aang to the prison hold, while Prince Zuko entrusted his uncle with taking the boy's glider to his personal quarters. Iroh, true to his nature, immediately passed the job on to the nearest guard. While being taken to the prison hold, Aang, with his hands tied, used his airbending to attempt an escape. One of the guards sounded the alarm.",
      "links": [],
      "text": "On Zuko's ship, the guards escorted Aang to the prison hold, while Prince Zuko entrusted his uncle with taking the boy's glider to his personal quarters. Iroh, true to his nature, immediately passed the job on to the nearest guard. While being taken to the prison hold, Aang, with his hands tied, used his airbending to attempt an escape. One of the guards sounded the alarm."
    },
    {
      "body": "${link_0} fighting ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Zuko fighting Aang."
    },
    {
      "body": "Aang ran through the ship's many hallways, looking through several rooms before discovering Zuko's personal quarters. He ran in to claim his staff, just as a waiting Zuko slammed the door shut to prevent his escape. Zuko launched a number of attacks in hopes of incapacitating Aang, but the airbender easily avoided them and launched a short series of powerful gusts that slammed Zuko against the room's walls and ceiling, briefly stunning him.",
      "links": [],
      "text": "Aang ran through the ship's many hallways, looking through several rooms before discovering Zuko's personal quarters. He ran in to claim his staff, just as a waiting Zuko slammed the door shut to prevent his escape. Zuko launched a number of attacks in hopes of incapacitating Aang, but the airbender easily avoided them and launched a short series of powerful gusts that slammed Zuko against the room's walls and ceiling, briefly stunning him."
    },
    {
      "body": "Aang headed outside, and prepared to make his escape on ${link_0}. However, just as he took off, Zuko leapt after him and grabbed his ankle. Not able to compensate for the extra weight or break free of Zuko's grip, Aang was unable to remain aloft, and the two crashed clumsily onto the deck. They prepared to face off a third time, but were distracted by the sudden appearance of ${link_1}, carrying Sokka and Katara to Aang's rescue. Aang was unable to regain his focus as Zuko quickly launched a series of fire blasts that pressed him to the edge of the deck and knocked ${link_2} away. Another two blasts followed, and Aang, while apparently unharmed by the flames, fell overboard into the frigid sea below.",
      "links": [
        {
          "body": "his glider",
          "key": "${link_0}",
          "target": {
            "href": "Airbender_staff",
            "page": "Airbender_staff"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "his staff",
          "key": "${link_2}",
          "target": {
            "href": "Airbender_staff",
            "page": "Airbender_staff"
          }
        }
      ],
      "text": "Aang headed outside, and prepared to make his escape on his glider. However, just as he took off, Zuko leapt after him and grabbed his ankle. Not able to compensate for the extra weight or break free of Zuko's grip, Aang was unable to remain aloft, and the two crashed clumsily onto the deck. They prepared to face off a third time, but were distracted by the sudden appearance of Appa, carrying Sokka and Katara to Aang's rescue. Aang was unable to regain his focus as Zuko quickly launched a series of fire blasts that pressed him to the edge of the deck and knocked his staff away. Another two blasts followed, and Aang, while apparently unharmed by the flames, fell overboard into the frigid sea below."
    },
    {
      "body": "Aang began sinking and he appeared momentarily unconscious. However, his eyes soon opened and he entered the ${link_0}. He began to ${link_1} the sea around him, pushing himself into the air on a whirling column of water. Zuko, Katara, and Sokka were shocked at this immense display of bending power, and Aang deposited himself on the deck of the ship before bending his liquid platform into a spinning wall of water that sent Zuko and all his guards on deck flying, Zuko himself going overboard. Appa landed on the deck, while Aang, apparently dazed after the massive display of power, collapsed. Katara and Sokka rushed to his aid, assuring he was all right before preparing to leave.",
      "links": [
        {
          "body": "Avatar State",
          "key": "${link_0}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "waterbend",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Aang began sinking and he appeared momentarily unconscious. However, his eyes soon opened and he entered the Avatar State. He began to waterbend the sea around him, pushing himself into the air on a whirling column of water. Zuko, Katara, and Sokka were shocked at this immense display of bending power, and Aang deposited himself on the deck of the ship before bending his liquid platform into a spinning wall of water that sent Zuko and all his guards on deck flying, Zuko himself going overboard. Appa landed on the deck, while Aang, apparently dazed after the massive display of power, collapsed. Katara and Sokka rushed to his aid, assuring he was all right before preparing to leave."
    },
    {
      "body": "${link_0} and ${link_1} after ${link_2} got away.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Zuko and Iroh after Aang got away."
    },
    {
      "body": "Sokka went to retrieve Aang's staff, only to find Zuko climbing back onto the deck. At a great advantage due to Zuko's position, Sokka quickly struck the prince in the forehead a number of times, sending him overboard again. Zuko was able to cling to an anchor's chain approximately halfway down the ship's hull. Some of the soldiers recovered and began to approach Katara and the still-exhausted Aang.",
      "links": [],
      "text": "Sokka went to retrieve Aang's staff, only to find Zuko climbing back onto the deck. At a great advantage due to Zuko's position, Sokka quickly struck the prince in the forehead a number of times, sending him overboard again. Zuko was able to cling to an anchor's chain approximately halfway down the ship's hull. Some of the soldiers recovered and began to approach Katara and the still-exhausted Aang."
    },
    {
      "body": "Katara was able to freeze the guards in place to stop their approach. All three took off on Appa just as Iroh arrived on the scene. Iroh helped Zuko on-board again, and the two launched a combined fire blast in an attempt to shoot down the escaping sky bison. Aang recovered from his dazed state just in time to turn this attack against the firebenders, using a blast of wind to redirect the fireball into one of the immense walls of ice on either side of the ship. The resulting avalanche buried the front half of Zuko's ship in ice and snow, stopping it cold. Appa flew into the distance, his passengers laughing happily.",
      "links": [],
      "text": "Katara was able to freeze the guards in place to stop their approach. All three took off on Appa just as Iroh arrived on the scene. Iroh helped Zuko on-board again, and the two launched a combined fire blast in an attempt to shoot down the escaping sky bison. Aang recovered from his dazed state just in time to turn this attack against the firebenders, using a blast of wind to redirect the fireball into one of the immense walls of ice on either side of the ship. The resulting avalanche buried the front half of Zuko's ship in ice and snow, stopping it cold. Appa flew into the distance, his passengers laughing happily."
    },
    {
      "body": "Zuko, furious that the Avatar had escaped his grasp, instructed his crew to dig the ship out and pursue the Avatar and his friends as soon as possible. He vowed never to underestimate Aang again.",
      "links": [],
      "text": "Zuko, furious that the Avatar had escaped his grasp, instructed his crew to dig the ship out and pursue the Avatar and his friends as soon as possible. He vowed never to underestimate Aang again."
    },
    {
      "body": "Soon afterward, Zuko docked at a ${link_0} off the coast of the southwest Earth Kingdom, his ship needing substantial repairs from his encounter with Aang. Zuko wanted the repairs done quickly so they would not lose the Avatar's trail, and warned Iroh not to mention the Avatar during their stay so no other firebenders would start looking for him. ${link_1} walked up to Iroh and Zuko, welcoming them to his harbor, and informing them of his promotion from captain to commander. Seeing how damaged their ship was, Zhao inquired how it happened. Zuko made up a story about crashing into an Earth Kingdom ship. Curious, Zhao invited the pair of them for a drink, of which Zuko attempted to get out, but Iroh spoke for both of them and accepted the invitation, with Zuko being unwilling to join.",
      "links": [
        {
          "body": "Fire Nation controlled harbor",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom_harbor",
            "page": "Earth_Kingdom_harbor"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        }
      ],
      "text": "Soon afterward, Zuko docked at a Fire Nation controlled harbor off the coast of the southwest Earth Kingdom, his ship needing substantial repairs from his encounter with Aang. Zuko wanted the repairs done quickly so they would not lose the Avatar's trail, and warned Iroh not to mention the Avatar during their stay so no other firebenders would start looking for him. Zhao walked up to Iroh and Zuko, welcoming them to his harbor, and informing them of his promotion from captain to commander. Seeing how damaged their ship was, Zhao inquired how it happened. Zuko made up a story about crashing into an Earth Kingdom ship. Curious, Zhao invited the pair of them for a drink, of which Zuko attempted to get out, but Iroh spoke for both of them and accepted the invitation, with Zuko being unwilling to join."
    },
    {
      "body": "${link_0} challenging ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        }
      ],
      "text": "Zuko challenging Zhao."
    },
    {
      "body": "Commander Zhao explained the Fire Nation's planned victory to Zuko and Iroh over tea in his tent, with Zuko voicing his doubts that the plan will work. Zhao inquired about Zuko's search for the Avatar, and Zuko replied he had been unsuccessful, to Zhao commented that he did not expect anything different. The commander then tried to force Zuko to reveal the truth, and Zuko, angered, got up to leave, but Commander Zhao's guards stopped him. One of his soldiers walked in and reported that he interrogated Zuko's crew and found out that Zuko had the Avatar but let him escape. Zuko had no choice but to tell Zhao the truth.",
      "links": [],
      "text": "Commander Zhao explained the Fire Nation's planned victory to Zuko and Iroh over tea in his tent, with Zuko voicing his doubts that the plan will work. Zhao inquired about Zuko's search for the Avatar, and Zuko replied he had been unsuccessful, to Zhao commented that he did not expect anything different. The commander then tried to force Zuko to reveal the truth, and Zuko, angered, got up to leave, but Commander Zhao's guards stopped him. One of his soldiers walked in and reported that he interrogated Zuko's crew and found out that Zuko had the Avatar but let him escape. Zuko had no choice but to tell Zhao the truth."
    },
    {
      "body": "Commander Zhao was appalled that a twelve-year-old boy bested Zuko and his crew. Zuko passionately stated that he was going to continue his hunt and would not underestimate the Avatar again. When Zhao replied that he would be taking over the hunt for the Avatar, Zuko leaped for Zhao in a rage but was held back by the guards. Zhao ordered for Zuko and Iroh to be kept in his tent and left. In anger, Zuko kicked a table, spilling Iroh's tea and causing him to ask for more.",
      "links": [],
      "text": "Commander Zhao was appalled that a twelve-year-old boy bested Zuko and his crew. Zuko passionately stated that he was going to continue his hunt and would not underestimate the Avatar again. When Zhao replied that he would be taking over the hunt for the Avatar, Zuko leaped for Zhao in a rage but was held back by the guards. Zhao ordered for Zuko and Iroh to be kept in his tent and left. In anger, Zuko kicked a table, spilling Iroh's tea and causing him to ask for more."
    },
    {
      "body": "Commander Zhao and his search party were almost ready to set sail on their search for the Avatar, and his would release Zuko and Iroh when his ship was \"out at sea\". Zuko stated forcefully that he was going to capture the Avatar before Zhao, who laughed at the thought of Zuko defeating him, who had \"hundreds of warships under his command\". Zhao then demeaned Zuko by telling him that his father would let him come home without the Avatar if the Fire Lord really loved him. Zhao stated that all Fire Lord Ozai saw in his son was failure. Angered by this statement, Zuko challenged Zhao out of pure rage and disgust to an ${link_0} at sunset. After Zhao left the tent, Iroh reminded Zuko about how his last duel with a firebending master turned out to which Zuko replied that he would never forget.",
      "links": [
        {
          "body": "Agni Kai",
          "key": "${link_0}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        }
      ],
      "text": "Commander Zhao and his search party were almost ready to set sail on their search for the Avatar, and his would release Zuko and Iroh when his ship was \"out at sea\". Zuko stated forcefully that he was going to capture the Avatar before Zhao, who laughed at the thought of Zuko defeating him, who had \"hundreds of warships under his command\". Zhao then demeaned Zuko by telling him that his father would let him come home without the Avatar if the Fire Lord really loved him. Zhao stated that all Fire Lord Ozai saw in his son was failure. Angered by this statement, Zuko challenged Zhao out of pure rage and disgust to an Agni Kai at sunset. After Zhao left the tent, Iroh reminded Zuko about how his last duel with a firebending master turned out to which Zuko replied that he would never forget."
    },
    {
      "body": "At sunset, Commander Zhao and Prince Zuko prepare to duel, the two combatants on either side of the courtyard. Iroh counseled Zuko to remember his basics, as they were his greatest assets, but the prince did not appear to heed his uncle's wisdom, instead simply stating that he would not lose and assumed his stance. Zhao claimed that the duel would end swiftly and also assumed his stance. The two opponents stared deeply and fiercely into each other's eyes, as the gong sounded and the match commenced.",
      "links": [],
      "text": "At sunset, Commander Zhao and Prince Zuko prepare to duel, the two combatants on either side of the courtyard. Iroh counseled Zuko to remember his basics, as they were his greatest assets, but the prince did not appear to heed his uncle's wisdom, instead simply stating that he would not lose and assumed his stance. Zhao claimed that the duel would end swiftly and also assumed his stance. The two opponents stared deeply and fiercely into each other's eyes, as the gong sounded and the match commenced."
    },
    {
      "body": "${link_0}.",
      "links": [
        {
          "body": "Zhao vs. Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Duels_(Spring_270_BG_-_Winter_100_AG)#Agni_Kai_between_Zhao_and_Zuko",
            "page": "Duels_(Spring_270_BG_-_Winter_100_AG)"
          }
        }
      ],
      "text": "Zhao vs. Zuko."
    },
    {
      "body": "Zhao seemed more than a match for Zuko, effortlessly avoiding and nullifying all of Zuko's fire blasts. As Zuko caught his breath, Iroh continued to advise him to remember his basics. Zhao then proceeded to throw his own volley of fire blasts. Zuko was able to block each, but was slowly forced back with every parry. For the final blast, Zhao used both fists, forming a blast that connected and knocked Zuko to the ground. Pressing the attack, Zhao leaped into the air, covering the distance between him and Zuko, and prepared a finishing fire blast aimed directly for Zuko's face.",
      "links": [],
      "text": "Zhao seemed more than a match for Zuko, effortlessly avoiding and nullifying all of Zuko's fire blasts. As Zuko caught his breath, Iroh continued to advise him to remember his basics. Zhao then proceeded to throw his own volley of fire blasts. Zuko was able to block each, but was slowly forced back with every parry. For the final blast, Zhao used both fists, forming a blast that connected and knocked Zuko to the ground. Pressing the attack, Zhao leaped into the air, covering the distance between him and Zuko, and prepared a finishing fire blast aimed directly for Zuko's face."
    },
    {
      "body": "An instant before contact, Zuko rolled out of the way, rose with a kicking flourish, and knocked Zhao out of his stance. With new found vigor, Zuko released a series of low attacks that caused Zhao to retreat, finishing him with a jet of fire from a full body kick. Zhao expected Zuko to strike him once more, to mark his victory, but Zuko released a fire blast past Zhao's face instead, remarking that he \"won't hold back\" the next time Zhao \"came in his way\".",
      "links": [],
      "text": "An instant before contact, Zuko rolled out of the way, rose with a kicking flourish, and knocked Zhao out of his stance. With new found vigor, Zuko released a series of low attacks that caused Zhao to retreat, finishing him with a jet of fire from a full body kick. Zhao expected Zuko to strike him once more, to mark his victory, but Zuko released a fire blast past Zhao's face instead, remarking that he \"won't hold back\" the next time Zhao \"came in his way\"."
    },
    {
      "body": "As Zuko turned to walk away, Zhao, enraged by his defeat, sent a jet of fire at Zuko's back, which Iroh swiftly stopped with his bare hand. After throwing Zhao to the ground, Iroh stopped an outraged Zuko from retaliating against Zhao, then lectured Zhao about how dishonorably he had acted, stating that his nephew was more honorable \"even in exile\", but was still polite enough to thank Zhao for the tea. After leaving the arena, Zuko asked Iroh if he really meant what he said back there, to which Iroh responded, \"Of course. I told you ginseng tea is my favorite.\" As the two walked back toward the ship, the faintest of smiles crossed Prince Zuko's lips.",
      "links": [],
      "text": "As Zuko turned to walk away, Zhao, enraged by his defeat, sent a jet of fire at Zuko's back, which Iroh swiftly stopped with his bare hand. After throwing Zhao to the ground, Iroh stopped an outraged Zuko from retaliating against Zhao, then lectured Zhao about how dishonorably he had acted, stating that his nephew was more honorable \"even in exile\", but was still polite enough to thank Zhao for the tea. After leaving the arena, Zuko asked Iroh if he really meant what he said back there, to which Iroh responded, \"Of course. I told you ginseng tea is my favorite.\" As the two walked back toward the ship, the faintest of smiles crossed Prince Zuko's lips."
    },
    {
      "body": "Zhao became Zuko's bitter rival in his quest to capture Aang until the former's death at the hands of ${link_0}.",
      "links": [
        {
          "body": "La",
          "key": "${link_0}",
          "target": {
            "href": "La",
            "page": "La"
          }
        }
      ],
      "text": "Zhao became Zuko's bitter rival in his quest to capture Aang until the former's death at the hands of La."
    },
    {
      "body": "${link_0} momentarily knocked down, while fighting the ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        }
      ],
      "text": "Zuko momentarily knocked down, while fighting the Kyoshi Warriors."
    },
    {
      "body": "Zuko's ship, now repaired at Zhao's harbor, was adrift at sea. Zuko was meditating when Iroh came in with information regarding the Avatar, and begged his nephew not to become angry, with Zuko replying that he could control his temper. Iroh stated that he did not have any information about the Avatar's current location, which caused Zuko became furious. Iroh then explained that there had been multiple sightings of Aang but that he was impossible to track, showing his nephew detailed map of where he had been located. Zuko quickly took the cartography and declared that \"he [was] a master of evasive maneuvering.\"",
      "links": [],
      "text": "Zuko's ship, now repaired at Zhao's harbor, was adrift at sea. Zuko was meditating when Iroh came in with information regarding the Avatar, and begged his nephew not to become angry, with Zuko replying that he could control his temper. Iroh stated that he did not have any information about the Avatar's current location, which caused Zuko became furious. Iroh then explained that there had been multiple sightings of Aang but that he was impossible to track, showing his nephew detailed map of where he had been located. Zuko quickly took the cartography and declared that \"he [was] a master of evasive maneuvering.\""
    },
    {
      "body": "Meanwhile, Team Avatar arrived on ${link_0}, an isolated community that had escaped the war. News traveled quickly from person to person of the Avatar's arrival, and finally reached Zuko and Iroh. Zuko jumped up in surprise and readied to depart to Kyoshi Island, but not before quickly snatching his lunch away from Iroh, claiming that \"[he] was going to save it for later.\"",
      "links": [
        {
          "body": "Kyoshi Island",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        }
      ],
      "text": "Meanwhile, Team Avatar arrived on Kyoshi Island, an isolated community that had escaped the war. News traveled quickly from person to person of the Avatar's arrival, and finally reached Zuko and Iroh. Zuko jumped up in surprise and readied to depart to Kyoshi Island, but not before quickly snatching his lunch away from Iroh, claiming that \"[he] was going to save it for later.\""
    },
    {
      "body": "${link_0} finding ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Katara's necklace",
          "key": "${link_1}",
          "target": {
            "href": "Katara%27s_necklace",
            "page": "Katara%27s_necklace"
          }
        }
      ],
      "text": "Zuko finding Katara's necklace."
    },
    {
      "body": "As the ship came to land, Zuko led his troops on ${link_0}, and entered the town as they searched for the Avatar. The ${link_1} made a good demonstration of their abilities and skills in battle, taking out many firebenders although outnumbered. However, Zuko managed to best three Kyoshi Warriors at once, including their leader, ${link_2} and once again Sokka, who was recently trained by Suki. After dispatching his opponents, Zuko yelled out for the Avatar.",
      "links": [
        {
          "body": "komodo rhinos",
          "key": "${link_0}",
          "target": {
            "href": "Komodo_rhino",
            "page": "Komodo_rhino"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Suki",
          "key": "${link_2}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        }
      ],
      "text": "As the ship came to land, Zuko led his troops on komodo rhinos, and entered the town as they searched for the Avatar. The Kyoshi Warriors made a good demonstration of their abilities and skills in battle, taking out many firebenders although outnumbered. However, Zuko managed to best three Kyoshi Warriors at once, including their leader, Suki and once again Sokka, who was recently trained by Suki. After dispatching his opponents, Zuko yelled out for the Avatar."
    },
    {
      "body": "After Zuko saw Aang, they engaged in a short battle, in which Aang defeated Zuko by slamming him into a house with an air blast. The Avatar escaped and left on ${link_0}.",
      "links": [
        {
          "body": "his flying bison",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "After Zuko saw Aang, they engaged in a short battle, in which Aang defeated Zuko by slamming him into a house with an air blast. The Avatar escaped and left on his flying bison."
    },
    {
      "body": "As the town was set on fire, Zuko and his men prepared to pursue him again. The Avatar suddenly leaped down from the bison back into Kyoshi's waters. A short time later, the ${link_0}, a giant water spouting eel, burst out of the water with Aang clinging onto its whiskers. With some struggle, he managed to gain footing on the giant eel's head and directed it toward the burning village. The unagi then spewed a blast of water, extinguishing the fires. Aang leaped into the air, was caught up by Appa, and flew away along with Katara and Sokka. The downpour drenched Zuko and left his troops demoralized and humiliated, but Zuko would continue his pursuit.",
      "links": [
        {
          "body": "unagi",
          "key": "${link_0}",
          "target": {
            "href": "Unagi",
            "page": "Unagi"
          }
        }
      ],
      "text": "As the town was set on fire, Zuko and his men prepared to pursue him again. The Avatar suddenly leaped down from the bison back into Kyoshi's waters. A short time later, the unagi, a giant water spouting eel, burst out of the water with Aang clinging onto its whiskers. With some struggle, he managed to gain footing on the giant eel's head and directed it toward the burning village. The unagi then spewed a blast of water, extinguishing the fires. Aang leaped into the air, was caught up by Appa, and flew away along with Katara and Sokka. The downpour drenched Zuko and left his troops demoralized and humiliated, but Zuko would continue his pursuit."
    },
    {
      "body": "Sometime later, Zuko arrived on a ${link_0} in the aftermath of a breakout of its ${link_1} prisoners. He found a ${link_2} among the wreckage and deduced that it belonged to Katara, the Water Tribe companion of the Avatar.",
      "links": [
        {
          "body": "Fire Nation prison rig",
          "key": "${link_0}",
          "target": {
            "href": "Prison_rig",
            "page": "Prison_rig"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Water Tribe necklace",
          "key": "${link_2}",
          "target": {
            "href": "Katara%27s_necklace",
            "page": "Katara%27s_necklace"
          }
        }
      ],
      "text": "Sometime later, Zuko arrived on a Fire Nation prison rig in the aftermath of a breakout of its earthbending prisoners. He found a Water Tribe necklace among the wreckage and deduced that it belonged to Katara, the Water Tribe companion of the Avatar."
    },
    {
      "body": "${link_0} finding ${link_1} relaxing.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Zuko finding Iroh relaxing."
    },
    {
      "body": "Sometime later, when the Avatar was dealing with ${link_0}, a forest spirit tormenting ${link_1}, Iroh was relaxing in a heated pool of water that he turned into his own personal jacuzzi made from firebending. Zuko was becoming very impatient and demanded that his uncle get ready to leave right away. Iroh agreed, but upon seeing he was not wearing anything, Zuko covered his eyes and decided to give his uncle a few more minutes to get ready. He gave a warning that if Iroh was not ready within a half hour, Zuko would leave without him, but Iroh, not heeding his nephew's warning, slumped back into the pool and fell asleep.",
      "links": [
        {
          "body": "Hei Bai",
          "key": "${link_0}",
          "target": {
            "href": "Hei_Bai",
            "page": "Hei_Bai"
          }
        },
        {
          "body": "Senlin Village",
          "key": "${link_1}",
          "target": {
            "href": "Senlin_Village",
            "page": "Senlin_Village"
          }
        }
      ],
      "text": "Sometime later, when the Avatar was dealing with Hei Bai, a forest spirit tormenting Senlin Village, Iroh was relaxing in a heated pool of water that he turned into his own personal jacuzzi made from firebending. Zuko was becoming very impatient and demanded that his uncle get ready to leave right away. Iroh agreed, but upon seeing he was not wearing anything, Zuko covered his eyes and decided to give his uncle a few more minutes to get ready. He gave a warning that if Iroh was not ready within a half hour, Zuko would leave without him, but Iroh, not heeding his nephew's warning, slumped back into the pool and fell asleep."
    },
    {
      "body": "Zuko came later with two soldiers, only to find what one of the soldiers deduced was a landslide. Zuko then noticed that the rocks were moved up-hill, and realized that his uncle was captured by earthbenders. Zuko immediately pursued them riding his komodo rhino.",
      "links": [],
      "text": "Zuko came later with two soldiers, only to find what one of the soldiers deduced was a landslide. Zuko then noticed that the rocks were moved up-hill, and realized that his uncle was captured by earthbenders. Zuko immediately pursued them riding his komodo rhino."
    },
    {
      "body": "The next morning following his search, Zuko found a sandal left by Iroh. He figured out that it was ${link_0} due to its horrible smell. While following the earthbender's trail, Zuko spotted the Avatar's bison. He turned to follow it, but hesitated and was faced with the choice to follow the Avatar or rescue his uncle, and chose the latter.",
      "links": [
        {
          "body": "Iroh's sandal",
          "key": "${link_0}",
          "target": {
            "href": "Iroh%27s_sandal",
            "page": "Iroh%27s_sandal"
          }
        }
      ],
      "text": "The next morning following his search, Zuko found a sandal left by Iroh. He figured out that it was Iroh's sandal due to its horrible smell. While following the earthbender's trail, Zuko spotted the Avatar's bison. He turned to follow it, but hesitated and was faced with the choice to follow the Avatar or rescue his uncle, and chose the latter."
    },
    {
      "body": "${link_0} saving ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Zuko saving Iroh."
    },
    {
      "body": "Later, just as the Earth Kingdom soldiers were about to crush Iroh's hands as punishment for an escape attempt, Zuko appeared and kicked the rock that was about to be dropped on Iroh's hands aside. He then lifted his leg and with one swift movement broke the chains that were binding Iroh in half, to which Iroh complimented him. Zuko smiled and replied that Iroh had \"taught him well\". Despite being outnumbered, they showed their opponents that they were clearly outmatched, and defeated the earthbenders with little difficulty. After the fight, Zuko asked Iroh to \"put on some clothes\".",
      "links": [],
      "text": "Later, just as the Earth Kingdom soldiers were about to crush Iroh's hands as punishment for an escape attempt, Zuko appeared and kicked the rock that was about to be dropped on Iroh's hands aside. He then lifted his leg and with one swift movement broke the chains that were binding Iroh in half, to which Iroh complimented him. Zuko smiled and replied that Iroh had \"taught him well\". Despite being outnumbered, they showed their opponents that they were clearly outmatched, and defeated the earthbenders with little difficulty. After the fight, Zuko asked Iroh to \"put on some clothes\"."
    },
    {
      "body": "${link_0} interrogating the ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Senlin Village leader",
          "key": "${link_1}",
          "target": {
            "href": "Senlin_Village_leader",
            "page": "Senlin_Village_leader"
          }
        }
      ],
      "text": "Zuko interrogating the Senlin Village leader."
    },
    {
      "body": "At Senlin Village, just before daybreak of the ${link_0}, Prince Zuko knocked on a villager's house. When the man came out, Zuko pushed him back and demanded to know where the Avatar went. Zuko found out that after the Avatar convinced Hei Bai to leave the village in peace, he and his friends were on their way to Avatar Roku's temple in the Fire Nation. After daybreak, Zuko began trailing Team Avatar, who was flying on Appa, across the ocean.",
      "links": [
        {
          "body": "winter solstice",
          "key": "${link_0}",
          "target": {
            "href": "Winter_solstice",
            "page": "Winter_solstice"
          }
        }
      ],
      "text": "At Senlin Village, just before daybreak of the winter solstice, Prince Zuko knocked on a villager's house. When the man came out, Zuko pushed him back and demanded to know where the Avatar went. Zuko found out that after the Avatar convinced Hei Bai to leave the village in peace, he and his friends were on their way to Avatar Roku's temple in the Fire Nation. After daybreak, Zuko began trailing Team Avatar, who was flying on Appa, across the ocean."
    },
    {
      "body": "On Zuko's boat, Iroh scolded his nephew, reminding him that he was banished from the Fire Nation, and that if he entered their waters he would be arrested. Zuko replied that since he was chasing the Avatar, his father would understand, to which his uncle stated that Ozai was not an understanding person. When Zuko managed to find Aang and his friends, he began firing his catapult toward Aang. Aang was able to help Appa barely dodge the shot. After missing him, Zuko ordered for the catapult to be reloaded when he saw a ${link_0} in a distance. Iroh told Zuko that since he was still in ${link_1} and that if he turned back now he would not be arrested. However, Zuko refused to turn away and ordered the ship continue forward.",
      "links": [
        {
          "body": "blockade of Fire Nation ships",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Navy_blockade",
            "page": "Fire_Navy_blockade"
          }
        },
        {
          "body": "Earth Kingdom waters",
          "key": "${link_1}",
          "target": {
            "href": "Mo_Ce_Sea",
            "page": "Mo_Ce_Sea"
          }
        }
      ],
      "text": "On Zuko's boat, Iroh scolded his nephew, reminding him that he was banished from the Fire Nation, and that if he entered their waters he would be arrested. Zuko replied that since he was chasing the Avatar, his father would understand, to which his uncle stated that Ozai was not an understanding person. When Zuko managed to find Aang and his friends, he began firing his catapult toward Aang. Aang was able to help Appa barely dodge the shot. After missing him, Zuko ordered for the catapult to be reloaded when he saw a blockade of Fire Nation ships in a distance. Iroh told Zuko that since he was still in Earth Kingdom waters and that if he turned back now he would not be arrested. However, Zuko refused to turn away and ordered the ship continue forward."
    },
    {
      "body": "${link_0} and ${link_1} arguing whether or not to pursue ${link_2} past the ${link_3}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Fire Nation border",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Navy_blockade",
            "page": "Fire_Navy_blockade"
          }
        }
      ],
      "text": "Zuko and Iroh arguing whether or not to pursue Aang past the Fire Nation border."
    },
    {
      "body": "Commander Zhao, the man in control of the blockade, ordered his ships to open fire on the Avatar. One of his men told Zhao that there was a Fire Nation ship out in the water. After Zhao saw it was Zuko's, he claimed it belonged to a traitor and re-ordered the attack on the Avatar, not caring if the shots hit his ship. As a horde of shots from dozens of ships were fired toward Appa, the Avatar managed to dodge most of the first barrage. One of the shots hit Zuko's ship in the back causing the ship to smoke heavily. One of his men explained that the engines were damaged and that they needed to stop for repairs, but Zuko would not hear it and told them to continue.",
      "links": [],
      "text": "Commander Zhao, the man in control of the blockade, ordered his ships to open fire on the Avatar. One of his men told Zhao that there was a Fire Nation ship out in the water. After Zhao saw it was Zuko's, he claimed it belonged to a traitor and re-ordered the attack on the Avatar, not caring if the shots hit his ship. As a horde of shots from dozens of ships were fired toward Appa, the Avatar managed to dodge most of the first barrage. One of the shots hit Zuko's ship in the back causing the ship to smoke heavily. One of his men explained that the engines were damaged and that they needed to stop for repairs, but Zuko would not hear it and told them to continue."
    },
    {
      "body": "When Aang made it through a barrage of attacks from the blockade, a frustrated Zhao knew he had to follow him but he did not know where he was going. He then saw Zuko's ship approaching and instead of arresting him, Zhao allowed him to pass through the blockade untouched so he could follow Zuko to the Avatar.",
      "links": [],
      "text": "When Aang made it through a barrage of attacks from the blockade, a frustrated Zhao knew he had to follow him but he did not know where he was going. He then saw Zuko's ship approaching and instead of arresting him, Zhao allowed him to pass through the blockade untouched so he could follow Zuko to the Avatar."
    },
    {
      "body": "Zuko was confused as to why Zhao let him pass, but Iroh explained that it was most likely because he wanted to use Zuko to find the Avatar. Hearing his uncle's theory Zuko was at a loss for what to do. Zuko came up with an idea; since Zhao was following the smoke from his ship, Zuko could take a smaller vessel and sneak past Zhao under the smoke, while Zhao would continue following his ship.",
      "links": [],
      "text": "Zuko was confused as to why Zhao let him pass, but Iroh explained that it was most likely because he wanted to use Zuko to find the Avatar. Hearing his uncle's theory Zuko was at a loss for what to do. Zuko came up with an idea; since Zhao was following the smoke from his ship, Zuko could take a smaller vessel and sneak past Zhao under the smoke, while Zhao would continue following his ship."
    },
    {
      "body": "${link_0} capturing ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Zuko capturing Aang."
    },
    {
      "body": "Thinking he evaded Zhao, Zuko arrived on ${link_0} and secretly entered the ${link_1}. After tricking the ${link_2} into opening the door with their firebending, each of the four sages were grabbed by ${link_3}, Katara, Sokka, and ${link_4}. Katara yelled to Aang to enter the chamber but there was no answer from him.",
      "links": [
        {
          "body": "Crescent Island",
          "key": "${link_0}",
          "target": {
            "href": "Crescent_Island",
            "page": "Crescent_Island"
          }
        },
        {
          "body": "Fire Temple",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Temple",
            "page": "Fire_Temple"
          }
        },
        {
          "body": "Fire Sages",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Shyu",
          "key": "${link_3}",
          "target": {
            "href": "Shyu",
            "page": "Shyu"
          }
        },
        {
          "body": "Momo",
          "key": "${link_4}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "Thinking he evaded Zhao, Zuko arrived on Crescent Island and secretly entered the Fire Temple. After tricking the Fire Sages into opening the door with their firebending, each of the four sages were grabbed by Shyu, Katara, Sokka, and Momo. Katara yelled to Aang to enter the chamber but there was no answer from him."
    },
    {
      "body": "Zuko then appeared from behind a pillar, with Aang captured by him. Due to their surprise, Team Avatar and Shyu each in turn lost control over the sages and they were now held down by them. Zuko told the sages to close the door immediately and started to force Aang away from it, down the stairs. The Avatar wriggled free from his grasp, however, and kicked him down the stairs, before racing through the door. The sages attempted to stop him but he managed to go inside before the doors closed. A bright light then came from the room and died away.",
      "links": [],
      "text": "Zuko then appeared from behind a pillar, with Aang captured by him. Due to their surprise, Team Avatar and Shyu each in turn lost control over the sages and they were now held down by them. Zuko told the sages to close the door immediately and started to force Aang away from it, down the stairs. The Avatar wriggled free from his grasp, however, and kicked him down the stairs, before racing through the door. The sages attempted to stop him but he managed to go inside before the doors closed. A bright light then came from the room and died away."
    },
    {
      "body": "Outside the doors Zuko inquired Shyu why he helped Aang, to which the Fire Sage answered that it was once the Fire Sages' duty to help the Avatar and that it still was. This moment was interrupted by Zhao and a group of soldiers, with Zhao placing Zuko under arrest and claiming that he would simply wait for the Avatar to come out.",
      "links": [],
      "text": "Outside the doors Zuko inquired Shyu why he helped Aang, to which the Fire Sage answered that it was once the Fire Sages' duty to help the Avatar and that it still was. This moment was interrupted by Zhao and a group of soldiers, with Zhao placing Zuko under arrest and claiming that he would simply wait for the Avatar to come out."
    },
    {
      "body": "${link_0} being captured by ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        }
      ],
      "text": "Zuko being captured by Zhao."
    },
    {
      "body": "As Aang's Avatar Spirit activated, Zhao and his soldiers readied themselves to attack Aang the moment he stepped out of the room. Then, with another flash of light, the door opened and they attacked the figure behind the door. However, they soon noticed that it was not the young Avatar Aang but the previous Avatar, Roku, who stood before them. He sent the fire back with great force and knocked the group back. As the heat of the fire melted the chains that held Katara and the others, Zuko took this opportunity to run back to his boat.",
      "links": [],
      "text": "As Aang's Avatar Spirit activated, Zhao and his soldiers readied themselves to attack Aang the moment he stepped out of the room. Then, with another flash of light, the door opened and they attacked the figure behind the door. However, they soon noticed that it was not the young Avatar Aang but the previous Avatar, Roku, who stood before them. He sent the fire back with great force and knocked the group back. As the heat of the fire melted the chains that held Katara and the others, Zuko took this opportunity to run back to his boat."
    },
    {
      "body": "Zuko managed to escape on his smaller ship, also looking at the Avatar as he flew away.",
      "links": [],
      "text": "Zuko managed to escape on his smaller ship, also looking at the Avatar as he flew away."
    },
    {
      "body": "${link_0} offering ${link_1} her ${link_2} in exchange for ${link_3}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "necklace",
          "key": "${link_2}",
          "target": {
            "href": "Katara%27s_necklace",
            "page": "Katara%27s_necklace"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Zuko offering Katara her necklace in exchange for Aang."
    },
    {
      "body": "Zuko was busy sparring with Lieutenant ${link_0} when Iroh had just diverted the ship to find a port in order to replace a ${link_1} for his ${link_2} game. Unwilling and venting with smoke through his nose, Zuko angrily allowed him. Iroh calmly expressed that \"it was so good to have an understanding nephew\" as the smoke engulfed the bridge.",
      "links": [
        {
          "body": "Jee",
          "key": "${link_0}",
          "target": {
            "href": "Jee",
            "page": "Jee"
          }
        },
        {
          "body": "white lotus tile",
          "key": "${link_1}",
          "target": {
            "href": "Pai_Sho#White_lotus_tile",
            "page": "Pai_Sho"
          }
        },
        {
          "body": "Pai Sho",
          "key": "${link_2}",
          "target": {
            "href": "Pai_Sho",
            "page": "Pai_Sho"
          }
        }
      ],
      "text": "Zuko was busy sparring with Lieutenant Jee when Iroh had just diverted the ship to find a port in order to replace a white lotus tile for his Pai Sho game. Unwilling and venting with smoke through his nose, Zuko angrily allowed him. Iroh calmly expressed that \"it was so good to have an understanding nephew\" as the smoke engulfed the bridge."
    },
    {
      "body": "When Zuko and Iroh arrived at ${link_0}, Iroh could not find a replacement for the white lotus tile from a single merchant in town, but he found numerous trinkets for music night on the ship in which three of their troops were carrying. Zuko was frustrated that the trip was a complete waste of time.",
      "links": [
        {
          "body": "a port",
          "key": "${link_0}",
          "target": {
            "href": "Seedy_merchants_pier",
            "page": "Seedy_merchants_pier"
          }
        }
      ],
      "text": "When Zuko and Iroh arrived at a port, Iroh could not find a replacement for the white lotus tile from a single merchant in town, but he found numerous trinkets for music night on the ship in which three of their troops were carrying. Zuko was frustrated that the trip was a complete waste of time."
    },
    {
      "body": "They then came across some pirates who had a ${link_0} stolen from them by Katara. After discovering that they were pursuing Aang as well, Zuko joined forces with the pirates to hunt down Aang. Zuko surmised that they would be practicing waterbending by the river. They found Katara, alone, late at night practicing the water whip. Zuko captured the waterbender and tied her to a tree, attempting to interrogate her for information on the Avatar. He showed her that he had her mother's lost betrothal necklace in his possession, the last tie that she had to her mother in exchange. However, the pirates demanded the scroll, and Zuko threatened to destroy it if they did not find Aang.",
      "links": [
        {
          "body": "waterbending scroll",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending_scroll",
            "page": "Waterbending_scroll"
          }
        }
      ],
      "text": "They then came across some pirates who had a waterbending scroll stolen from them by Katara. After discovering that they were pursuing Aang as well, Zuko joined forces with the pirates to hunt down Aang. Zuko surmised that they would be practicing waterbending by the river. They found Katara, alone, late at night practicing the water whip. Zuko captured the waterbender and tied her to a tree, attempting to interrogate her for information on the Avatar. He showed her that he had her mother's lost betrothal necklace in his possession, the last tie that she had to her mother in exchange. However, the pirates demanded the scroll, and Zuko threatened to destroy it if they did not find Aang."
    },
    {
      "body": "The next morning, Aang and Sokka were found and captured, and they discovered Katara bound to a tree surrounded by firebenders. As Zuko and the pirates were about to make the trade of Aang exchanged with the scroll, Sokka convinced the pirates to not sell Aang by revealing to them that he was the Avatar, despite Zuko's attempts to keep it a secret from the pirates. The pirates decided that they wanted to sell Aang to the Fire Nation themselves, and the situation quickly escalated into a battle.",
      "links": [],
      "text": "The next morning, Aang and Sokka were found and captured, and they discovered Katara bound to a tree surrounded by firebenders. As Zuko and the pirates were about to make the trade of Aang exchanged with the scroll, Sokka convinced the pirates to not sell Aang by revealing to them that he was the Avatar, despite Zuko's attempts to keep it a secret from the pirates. The pirates decided that they wanted to sell Aang to the Fire Nation themselves, and the situation quickly escalated into a battle."
    },
    {
      "body": "${link_0}.",
      "links": [
        {
          "body": "Zuko vs. the pirate captain",
          "key": "${link_0}",
          "target": {
            "href": "Duels_(Spring_270_BG_-_Winter_100_AG)#Duel_with_the_pirates",
            "page": "Duels_(Spring_270_BG_-_Winter_100_AG)"
          }
        }
      ],
      "text": "Zuko vs. the pirate captain."
    },
    {
      "body": "While Zuko and the pirates fought, Aang, Katara, and Sokka escaped. Katara and Aang used waterbending to get the pirates' boat into water, sail away, and escape. Iroh stopped Zuko and the pirates' captain, showing them that the pirates' boat was being stolen. Zuko laughed at their misfortune, until he saw the pirates who taunted him by mooning him, except for the ${link_0}, stealing his smaller ship and starting to chase the Avatar.",
      "links": [
        {
          "body": "captain",
          "key": "${link_0}",
          "target": {
            "href": "Pirate_captain",
            "page": "Pirate_captain"
          }
        }
      ],
      "text": "While Zuko and the pirates fought, Aang, Katara, and Sokka escaped. Katara and Aang used waterbending to get the pirates' boat into water, sail away, and escape. Iroh stopped Zuko and the pirates' captain, showing them that the pirates' boat was being stolen. Zuko laughed at their misfortune, until he saw the pirates who taunted him by mooning him, except for the captain, stealing his smaller ship and starting to chase the Avatar."
    },
    {
      "body": "Both ships were lost after falling over ${link_0}. Back on shore, Iroh discovered that his lost white lotus tile was stuck in his sleeve the whole time. Frustrated and angry, Zuko grabbed the tile from Iroh's hand and threw it over the waterfall in anger which struck ${link_1} on the head and bounced off.",
      "links": [
        {
          "body": "a waterfall",
          "key": "${link_0}",
          "target": {
            "href": "Waterfall_lagoon",
            "page": "Waterfall_lagoon"
          }
        },
        {
          "body": "one of the pirates",
          "key": "${link_1}",
          "target": {
            "href": "Oh",
            "page": "Oh"
          }
        }
      ],
      "text": "Both ships were lost after falling over a waterfall. Back on shore, Iroh discovered that his lost white lotus tile was stuck in his sleeve the whole time. Frustrated and angry, Zuko grabbed the tile from Iroh's hand and threw it over the waterfall in anger which struck one of the pirates on the head and bounced off."
    },
    {
      "body": "After this, Zuko was piloting his ship through what appeared to be a sunny, calm day, when Iroh stated that he could feel a storm coming. He advised Zuko to sail away from the storm, but Zuko refused, stating wherever the Avatar went, they would follow.",
      "links": [],
      "text": "After this, Zuko was piloting his ship through what appeared to be a sunny, calm day, when Iroh stated that he could feel a storm coming. He advised Zuko to sail away from the storm, but Zuko refused, stating wherever the Avatar went, they would follow."
    },
    {
      "body": "When it became clear they were sailing into a storm, Lieutenant Jee called Zuko out as the latter continued to refuse to turn around. Zuko responded by trying to instigate a duel. Before a fight could begin, however, Iroh separated the two.",
      "links": [],
      "text": "When it became clear they were sailing into a storm, Lieutenant Jee called Zuko out as the latter continued to refuse to turn around. Zuko responded by trying to instigate a duel. Before a fight could begin, however, Iroh separated the two."
    },
    {
      "body": "As Iroh explained Zuko's past to the crew, the storm wreaked havoc on the ship. A lightning bolt almost struck it but Iroh managed to ${link_0}. Zuko then noticed that the helmsman was dangling from the top of the ship. He then climbed up to the top and grabbed the helmsman's hand, successfully rescuing him. Finally, Zuko agreed to get the ship to safety, reaching the eye of the storm. During this time, he saw Aang flying up the eye, but just looked at him and let him pass.",
      "links": [
        {
          "body": "redirect it away",
          "key": "${link_0}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "text": "As Iroh explained Zuko's past to the crew, the storm wreaked havoc on the ship. A lightning bolt almost struck it but Iroh managed to redirect it away. Zuko then noticed that the helmsman was dangling from the top of the ship. He then climbed up to the top and grabbed the helmsman's hand, successfully rescuing him. Finally, Zuko agreed to get the ship to safety, reaching the eye of the storm. During this time, he saw Aang flying up the eye, but just looked at him and let him pass."
    },
    {
      "body": "At ${link_0}, a Fire Nation fortress overlooking the Earth Kingdom's western shore, Commander Zhao requested the use of the ${link_1}, an elite group of Fire Nation soldiers skilled in archery, in his hunt for the Avatar. Colonel ${link_2} strictly denied the request, until word suddenly arrived from Fire Lord Ozai that Zhao had been promoted to the position of admiral. Now the superior officer, Zhao smugly changed his request of the Yuyan Archers' abilities into an order. Meanwhile, a figure watched the proceedings from the roof above and behind Zhao, his face hidden by a blue oni mask.",
      "links": [
        {
          "body": "Pohuai Stronghold",
          "key": "${link_0}",
          "target": {
            "href": "Pohuai_Stronghold",
            "page": "Pohuai_Stronghold"
          }
        },
        {
          "body": "Yuyan Archers",
          "key": "${link_1}",
          "target": {
            "href": "Yuyan_Archers",
            "page": "Yuyan_Archers"
          }
        },
        {
          "body": "Shinu",
          "key": "${link_2}",
          "target": {
            "href": "Shinu",
            "page": "Shinu"
          }
        }
      ],
      "text": "At Pohuai Stronghold, a Fire Nation fortress overlooking the Earth Kingdom's western shore, Commander Zhao requested the use of the Yuyan Archers, an elite group of Fire Nation soldiers skilled in archery, in his hunt for the Avatar. Colonel Shinu strictly denied the request, until word suddenly arrived from Fire Lord Ozai that Zhao had been promoted to the position of admiral. Now the superior officer, Zhao smugly changed his request of the Yuyan Archers' abilities into an order. Meanwhile, a figure watched the proceedings from the roof above and behind Zhao, his face hidden by a blue oni mask."
    },
    {
      "body": "The ${link_0}.",
      "links": [
        {
          "body": "Blue Spirit",
          "key": "${link_0}",
          "target": {
            "href": "Zuko#Other_skills",
            "page": "Zuko"
          }
        }
      ],
      "text": "The Blue Spirit."
    },
    {
      "body": "Meanwhile, on Zuko's ship, the exiled prince was discussing what actions to take in pursuing the Avatar with his crew, having lost Aang's trail due to the recent storm. However, their planning was interrupted when a large Fire Nation ship, one of the many under Zhao's command, pulled alongside. Several Fire Nation soldiers boarded, revealing a wanted poster depicting Aang, and stating that all information regarding the Avatar was to be reported directly to Admiral Zhao. Zuko angrily reported that he had no information to report, and demanded that the soldiers get off his ship and allow them to pass. He became further angered when the soldiers complied with his first demand, but stated that under Zhao's orders no ships were being allowed in or out of the area. Iroh responded to all of this in his typical laid-back fashion, instead focusing on winning a game of Pai Sho with several of the crew members.",
      "links": [],
      "text": "Meanwhile, on Zuko's ship, the exiled prince was discussing what actions to take in pursuing the Avatar with his crew, having lost Aang's trail due to the recent storm. However, their planning was interrupted when a large Fire Nation ship, one of the many under Zhao's command, pulled alongside. Several Fire Nation soldiers boarded, revealing a wanted poster depicting Aang, and stating that all information regarding the Avatar was to be reported directly to Admiral Zhao. Zuko angrily reported that he had no information to report, and demanded that the soldiers get off his ship and allow them to pass. He became further angered when the soldiers complied with his first demand, but stated that under Zhao's orders no ships were being allowed in or out of the area. Iroh responded to all of this in his typical laid-back fashion, instead focusing on winning a game of Pai Sho with several of the crew members."
    },
    {
      "body": "Zuko practiced on the deck of his ship, having not given an order to his men in the hour since it was boarded. Iroh expressed concern over his nephew's behavior, and assured him that it was still possible that he could capture the Avatar before Zhao. Zuko expressed disbelief, as Zhao had far greater resources and power. He stated, despondently, that soon he would lose all that he had been fighting for in the years since his exile.",
      "links": [],
      "text": "Zuko practiced on the deck of his ship, having not given an order to his men in the hour since it was boarded. Iroh expressed concern over his nephew's behavior, and assured him that it was still possible that he could capture the Avatar before Zhao. Zuko expressed disbelief, as Zhao had far greater resources and power. He stated, despondently, that soon he would lose all that he had been fighting for in the years since his exile."
    },
    {
      "body": "His fears were founded when the Avatar was finally captured by the Yuyan Archers, and taken back at Pohuai Stronghold as a prisoner. There he was chained and locked up in a cell, where he was mocked by Admiral Zhao.",
      "links": [],
      "text": "His fears were founded when the Avatar was finally captured by the Yuyan Archers, and taken back at Pohuai Stronghold as a prisoner. There he was chained and locked up in a cell, where he was mocked by Admiral Zhao."
    },
    {
      "body": "The ${link_0} defeating the guards to get into ${link_1}'s cell.",
      "links": [
        {
          "body": "Blue Spirit",
          "key": "${link_0}",
          "target": {
            "href": "Zuko#Other_skills",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "The Blue Spirit defeating the guards to get into Aang's cell."
    },
    {
      "body": "However, the same masked figure from before materialized among the bushes flanking the path into the fortress. The figure, the titular Blue Spirit, sneaked into the fortress by clinging to the underside of a carriage that was brought into the fortress, before moving stealthily through it to Aang's cell.",
      "links": [],
      "text": "However, the same masked figure from before materialized among the bushes flanking the path into the fortress. The figure, the titular Blue Spirit, sneaked into the fortress by clinging to the underside of a carriage that was brought into the fortress, before moving stealthily through it to Aang's cell."
    },
    {
      "body": "Luckily for the Blue Spirit, Zhao was currently addressing all of the Fire Nation members in the fortress, saying that the Avatar had been captured and the Fire Nation would win the war in less than a year. This distraction allowed him to move across the fortress's inner-most wall unnoticed, before descending into a small sewage system and emerging within the fortress's main tower.",
      "links": [],
      "text": "Luckily for the Blue Spirit, Zhao was currently addressing all of the Fire Nation members in the fortress, saying that the Avatar had been captured and the Fire Nation would win the war in less than a year. This distraction allowed him to move across the fortress's inner-most wall unnoticed, before descending into a small sewage system and emerging within the fortress's main tower."
    },
    {
      "body": "The Blue Spirit deftly defeated the guards in his way. As he moved into the cell and unsheathed his swords, Aang became terrified, believing the Blue Spirit meant harm rather than help.",
      "links": [],
      "text": "The Blue Spirit deftly defeated the guards in his way. As he moved into the cell and unsheathed his swords, Aang became terrified, believing the Blue Spirit meant harm rather than help."
    },
    {
      "body": "However, his fears were soon dispersed as the Blue Spirit slashed through his bonds, and began to leave the room. Aang questioned the Blue Spirit's identity and intentions, but he did not answer the Avatar's question, instead silently motioning for Aang to follow him. Aang concluded that this new figure meant to help him escape, and followed him outside.",
      "links": [],
      "text": "However, his fears were soon dispersed as the Blue Spirit slashed through his bonds, and began to leave the room. Aang questioned the Blue Spirit's identity and intentions, but he did not answer the Avatar's question, instead silently motioning for Aang to follow him. Aang concluded that this new figure meant to help him escape, and followed him outside."
    },
    {
      "body": "As Aang and the Blue Spirit exited the tower via the fortress's shallow sewers, Zhao strolled through its corridors while ordering a secretary to send a message to the Fire Lord recording his triumph. However, Zhao noticed the four guards that the Blue Spirit had defeated, and after finding that Aang had escaped, he sounded the alarm.",
      "links": [],
      "text": "As Aang and the Blue Spirit exited the tower via the fortress's shallow sewers, Zhao strolled through its corridors while ordering a secretary to send a message to the Fire Lord recording his triumph. However, Zhao noticed the four guards that the Blue Spirit had defeated, and after finding that Aang had escaped, he sounded the alarm."
    },
    {
      "body": "${link_0} with ${link_1}.",
      "links": [
        {
          "body": "The Blue Spirit",
          "key": "${link_0}",
          "target": {
            "href": "Zuko#Other_skills",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "The Blue Spirit with Aang."
    },
    {
      "body": "Just as the alarm sounded, Aang and the Blue Spirit were making their way up the rope that the latter used to descend the wall. The rope was cut, and the Blue Spirit and Aang were forced fight their way out of the fortress through its three sets of gates. Aang airbent a group of soldiers out of their path and managed to reach the first gate easily, but the Blue Spirit did not possess his supernatural speed, and was soon overtaken by a dozen men wielding spears, whom he began to battle.",
      "links": [],
      "text": "Just as the alarm sounded, Aang and the Blue Spirit were making their way up the rope that the latter used to descend the wall. The rope was cut, and the Blue Spirit and Aang were forced fight their way out of the fortress through its three sets of gates. Aang airbent a group of soldiers out of their path and managed to reach the first gate easily, but the Blue Spirit did not possess his supernatural speed, and was soon overtaken by a dozen men wielding spears, whom he began to battle."
    },
    {
      "body": "Aang, noticing that his unexpected savior was in danger, moved to assist him, though the Blue Spirit appeared capable of easily matching his opponents. In the process, Aang yanked away one of the spears and snapped its blade off, turning it into a staff in place of his glider. Aang was able to use his airbending abilities in conjunction with the staff to move himself and the Blue Spirit to the top of the second wall, but in the process dropped the staff, leaving them with one more wall to overcome. Scores of Fire Nation soldiers ascended the wall with flexible bamboo ladders, but a quick-thinking Aang turned this against their pursuers. He turned the ladders into makeshift stilts, and, with the Blue Spirit hanging on his back, used three of the ladders to get them across to the third wall.",
      "links": [],
      "text": "Aang, noticing that his unexpected savior was in danger, moved to assist him, though the Blue Spirit appeared capable of easily matching his opponents. In the process, Aang yanked away one of the spears and snapped its blade off, turning it into a staff in place of his glider. Aang was able to use his airbending abilities in conjunction with the staff to move himself and the Blue Spirit to the top of the second wall, but in the process dropped the staff, leaving them with one more wall to overcome. Scores of Fire Nation soldiers ascended the wall with flexible bamboo ladders, but a quick-thinking Aang turned this against their pursuers. He turned the ladders into makeshift stilts, and, with the Blue Spirit hanging on his back, used three of the ladders to get them across to the third wall."
    },
    {
      "body": "However, a firebending soldier burned the last ladder beneath their feet before they could reach the final wall, and Aang and the Spirit were forced to jump. Although both managed to get hand-holds on the edge of the wall, neither was able to hang on, and they fell to the ground in front of the final gate. A group of firebenders launched a combined attack on the duo, and Aang used airbending to defend them before Zhao ordered his soldiers to stand down. The admiral continued, stating that the Avatar needed to be captured alive.",
      "links": [],
      "text": "However, a firebending soldier burned the last ladder beneath their feet before they could reach the final wall, and Aang and the Spirit were forced to jump. Although both managed to get hand-holds on the edge of the wall, neither was able to hang on, and they fell to the ground in front of the final gate. A group of firebenders launched a combined attack on the duo, and Aang used airbending to defend them before Zhao ordered his soldiers to stand down. The admiral continued, stating that the Avatar needed to be captured alive."
    },
    {
      "body": "The ${link_0} holding ${link_1} hostage.",
      "links": [
        {
          "body": "Blue Spirit",
          "key": "${link_0}",
          "target": {
            "href": "Zuko#Other_skills",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "The Blue Spirit holding Aang hostage."
    },
    {
      "body": "Hearing this, the Blue Spirit quickly placed his swords at Aang's throat, threatening to kill him. Zhao was frustrated, but decided not to take any risks. He ordered the guards to open the gates, and the Blue Spirit, still holding his blades to Aang's neck, marched the two of them outside, never turning either of their backs to the fortress. Colonel Shinu was bewildered that Zhao was allowing the Avatar to escape, but the admiral remained calm.",
      "links": [],
      "text": "Hearing this, the Blue Spirit quickly placed his swords at Aang's throat, threatening to kill him. Zhao was frustrated, but decided not to take any risks. He ordered the guards to open the gates, and the Blue Spirit, still holding his blades to Aang's neck, marched the two of them outside, never turning either of their backs to the fortress. Colonel Shinu was bewildered that Zhao was allowing the Avatar to escape, but the admiral remained calm."
    },
    {
      "body": "At the top of the outer wall, Zhao ordered a Yuyan Archer to knock out the Blue Spirit, which he did without fail with a single arrow to his forehead. The Blue Spirit fell over instantly unconscious, his life spared due to the protection provided by his mask. Aang immediately airbent up a large dust cloud to conceal himself, while a group of Fire Nation soldiers raced from the fortress to capture them. He took off the Blue Spirit's mask to learn that his rescuer was, to his immense shock, Zuko. He turned to run and left the prince behind, but hesitated. When the dust settled, Aang and Zuko had vanished without a trace. Zhao was immensely angered, and his mood was not helped when suddenly one of Aang's frogs from before appeared alongside him, croaked, and leaped off the wall.",
      "links": [],
      "text": "At the top of the outer wall, Zhao ordered a Yuyan Archer to knock out the Blue Spirit, which he did without fail with a single arrow to his forehead. The Blue Spirit fell over instantly unconscious, his life spared due to the protection provided by his mask. Aang immediately airbent up a large dust cloud to conceal himself, while a group of Fire Nation soldiers raced from the fortress to capture them. He took off the Blue Spirit's mask to learn that his rescuer was, to his immense shock, Zuko. He turned to run and left the prince behind, but hesitated. When the dust settled, Aang and Zuko had vanished without a trace. Zhao was immensely angered, and his mood was not helped when suddenly one of Aang's frogs from before appeared alongside him, croaked, and leaped off the wall."
    },
    {
      "body": "${link_0} rejecting ${link_1}'s offer of friendship.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Zuko rejecting Aang's offer of friendship."
    },
    {
      "body": "Later, Zuko regained consciousness to discover that morning had arrived, and he was with Aang in a wooded area. Aang spoke nostalgically of ${link_0}, a Fire Nation boy he knew as one of his closest friends a century before. He laughed at the thought of how much trouble he got into with his friend. After reflecting, he asked Zuko if under different circumstances they too could have been friends like him and Kuzon. Zuko paused, then responded by launching a fire blast, which Aang easily avoided before leaping through the trees. Zuko's stern expression softened slightly, and he decided not to pursue the Avatar, at least for then.",
      "links": [
        {
          "body": "Kuzon",
          "key": "${link_0}",
          "target": {
            "href": "Kuzon",
            "page": "Kuzon"
          }
        }
      ],
      "text": "Later, Zuko regained consciousness to discover that morning had arrived, and he was with Aang in a wooded area. Aang spoke nostalgically of Kuzon, a Fire Nation boy he knew as one of his closest friends a century before. He laughed at the thought of how much trouble he got into with his friend. After reflecting, he asked Zuko if under different circumstances they too could have been friends like him and Kuzon. Zuko paused, then responded by launching a fire blast, which Aang easily avoided before leaping through the trees. Zuko's stern expression softened slightly, and he decided not to pursue the Avatar, at least for then."
    },
    {
      "body": "Zuko returned to his ship. Iroh greeted him, questioning where he had been all night, but seemed not to be too worried, being more concerned with the events of \"music night\" from the evening before. Zuko ignored these comments, and ordered no disturbances while he tried to catch up on his sleep.",
      "links": [],
      "text": "Zuko returned to his ship. Iroh greeted him, questioning where he had been all night, but seemed not to be too worried, being more concerned with the events of \"music night\" from the evening before. Zuko ignored these comments, and ordered no disturbances while he tried to catch up on his sleep."
    },
    {
      "body": "${link_0}, ${link_1}, ${link_2}, ${link_3}, and ${link_4} while riding ${link_5}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_2}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "June",
          "key": "${link_4}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "Nyla",
          "key": "${link_5}",
          "target": {
            "href": "Nyla",
            "page": "Nyla"
          }
        }
      ],
      "text": "Zuko, Iroh, Sokka, Katara, and June while riding Nyla."
    },
    {
      "body": "Iroh, in his continuing mission to calm Zuko's aggressive nature, was sharing a cup of tea with nephew, claiming it was good for his mental well-being. Just as Zuko was about to try a sip, there was a disturbance on the deck, and Zuko and Iroh went to check it out. There, they encountered the bounty hunter ${link_0} and ${link_1} invading his ship, claiming to be in pursuit of a stowaway. Just as Zuko claimed there were no stowaways on his ship, the ${link_2} ripped open the deck, found the stowaway among the cargo, and paralyzed him with its venomous tongue. Zuko was astounded, and he asked the bounty hunter how she was able to find the man so easily, to which she answered that her shirshu could detect a scent for miles by just smelling an object. She left the damaged ship with her prize, while Zuko and an attracted Iroh looked on.",
      "links": [
        {
          "body": "June",
          "key": "${link_0}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "her shirshu",
          "key": "${link_1}",
          "target": {
            "href": "Nyla",
            "page": "Nyla"
          }
        },
        {
          "body": "shirshu",
          "key": "${link_2}",
          "target": {
            "href": "Shirshu",
            "page": "Shirshu"
          }
        }
      ],
      "text": "Iroh, in his continuing mission to calm Zuko's aggressive nature, was sharing a cup of tea with nephew, claiming it was good for his mental well-being. Just as Zuko was about to try a sip, there was a disturbance on the deck, and Zuko and Iroh went to check it out. There, they encountered the bounty hunter June and her shirshu invading his ship, claiming to be in pursuit of a stowaway. Just as Zuko claimed there were no stowaways on his ship, the shirshu ripped open the deck, found the stowaway among the cargo, and paralyzed him with its venomous tongue. Zuko was astounded, and he asked the bounty hunter how she was able to find the man so easily, to which she answered that her shirshu could detect a scent for miles by just smelling an object. She left the damaged ship with her prize, while Zuko and an attracted Iroh looked on."
    },
    {
      "body": "${link_0}.",
      "links": [
        {
          "body": "Zuko vs. Aang",
          "key": "${link_0}",
          "target": {
            "href": "Duels_(Spring_270_BG_-_Winter_100_AG)#Duel_at_the_abbey",
            "page": "Duels_(Spring_270_BG_-_Winter_100_AG)"
          }
        }
      ],
      "text": "Zuko vs. Aang."
    },
    {
      "body": "Zuko, along with Iroh, spotting an effective new way to find the Avatar, tracked June down to a seedy ${link_0} to enlist her help. He initially demanded she helped him to compensate for the damage to his ship but she only agreed when Iroh offered to pay her in gold. Zuko, ignoring Iroh's flirtations with June and June's cracks about \"his girlfriend\", showed her Katara's necklace to use to follow her scent, tracking Aang by proxy. They followed Katara's scent all the way through the ruins of ${link_1} and ${link_2} until they found Katara and Sokka. After paralyzing them, they realized that Aang was not with them. The shirshu sought out Aang's scent from ${link_3} that he had held, and they tracked him into the ${link_4}.",
      "links": [
        {
          "body": "tavern",
          "key": "${link_0}",
          "target": {
            "href": "Tavern",
            "page": "Tavern"
          }
        },
        {
          "body": "Taku",
          "key": "${link_1}",
          "target": {
            "href": "Taku",
            "page": "Taku"
          }
        },
        {
          "body": "Makapu Village",
          "key": "${link_2}",
          "target": {
            "href": "Makapu_Village",
            "page": "Makapu_Village"
          }
        },
        {
          "body": "a map",
          "key": "${link_3}",
          "target": {
            "href": "Rendezvous_map",
            "page": "Rendezvous_map"
          }
        },
        {
          "body": "abbey",
          "key": "${link_4}",
          "target": {
            "href": "Abbey",
            "page": "Abbey"
          }
        }
      ],
      "text": "Zuko, along with Iroh, spotting an effective new way to find the Avatar, tracked June down to a seedy tavern to enlist her help. He initially demanded she helped him to compensate for the damage to his ship but she only agreed when Iroh offered to pay her in gold. Zuko, ignoring Iroh's flirtations with June and June's cracks about \"his girlfriend\", showed her Katara's necklace to use to follow her scent, tracking Aang by proxy. They followed Katara's scent all the way through the ruins of Taku and Makapu Village until they found Katara and Sokka. After paralyzing them, they realized that Aang was not with them. The shirshu sought out Aang's scent from a map that he had held, and they tracked him into the abbey."
    },
    {
      "body": "Zuko ended up in a one-on-one showdown with Aang, while June and the shirshu fought Appa. Everybody brawled, and Zuko chased Aang across the abbey, ferociously attacking him with firebending while Aang defended himself with airbending. Sokka, coming out of paralysis thanks to the nuns' remedy, devised a plan to blind the shirshu by overpowering its sense of smell with perfume. Katara waterbent the perfume onto the shirshu, and it lost control. Blinded and panicking, it paralyzed both Zuko and June. Iroh pretended to be paralyzed so he could hold June close to him, and shushed Zuko when he pointed this out.",
      "links": [],
      "text": "Zuko ended up in a one-on-one showdown with Aang, while June and the shirshu fought Appa. Everybody brawled, and Zuko chased Aang across the abbey, ferociously attacking him with firebending while Aang defended himself with airbending. Sokka, coming out of paralysis thanks to the nuns' remedy, devised a plan to blind the shirshu by overpowering its sense of smell with perfume. Katara waterbent the perfume onto the shirshu, and it lost control. Blinded and panicking, it paralyzed both Zuko and June. Iroh pretended to be paralyzed so he could hold June close to him, and shushed Zuko when he pointed this out."
    },
    {
      "body": "${link_0} shielding himself from the explosion.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Zuko shielding himself from the explosion."
    },
    {
      "body": "Close to the ${link_0}, Zuko's ship had docked in a Fire Nation bay for the night. During Iroh's music night, Zhao came on board to conscript the crew, for his attack on the Northern Water Tribe. Iroh and Zhao went to Zuko's room, to inform him. When Zuko heard of this, he tried to attack Zhao, but he was restrained by Iroh. Zhao, however was distracted by the ${link_1} on a mantelpiece, which he recognized as the Blue Spirit's, and casually asked Zuko if he had any skill with the swords. Zuko, knowing what Zhao is thinking, replied that the swords were only antiques used for decoration. Zhao did not respond, but lightly asked Iroh if he had heard of the Blue Spirit. When he got a negative response, he left, but not before offering a military advisory position to Iroh.",
      "links": [
        {
          "body": "North Pole",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "broadswords",
          "key": "${link_1}",
          "target": {
            "href": "Dual_broadswords",
            "page": "Dual_broadswords"
          }
        }
      ],
      "text": "Close to the North Pole, Zuko's ship had docked in a Fire Nation bay for the night. During Iroh's music night, Zhao came on board to conscript the crew, for his attack on the Northern Water Tribe. Iroh and Zhao went to Zuko's room, to inform him. When Zuko heard of this, he tried to attack Zhao, but he was restrained by Iroh. Zhao, however was distracted by the broadswords on a mantelpiece, which he recognized as the Blue Spirit's, and casually asked Zuko if he had any skill with the swords. Zuko, knowing what Zhao is thinking, replied that the swords were only antiques used for decoration. Zhao did not respond, but lightly asked Iroh if he had heard of the Blue Spirit. When he got a negative response, he left, but not before offering a military advisory position to Iroh."
    },
    {
      "body": "After the crew left, Zuko was bitter and resentful. He rejected Iroh's offer to go for a walk, and opted to stay in his room and sulk. Meanwhile, the pirates, whom Zuko had met before, were hired by Zhao to assassinate Zuko, and they began to plant explosives on his ship. Zuko heard them, when one of them opened a creaky door. He went to investigate, but found nothing until he saw the ${link_0}'s ${link_1}. The explosives went off, and destroyed Zuko's ship. Moments before the flames hit him, Zuko formed a fire shield around himself, saving his life.",
      "links": [
        {
          "body": "pirate captain",
          "key": "${link_0}",
          "target": {
            "href": "Pirate_captain",
            "page": "Pirate_captain"
          }
        },
        {
          "body": "iguana parrot",
          "key": "${link_1}",
          "target": {
            "href": "Iguana_parrot",
            "page": "Iguana_parrot"
          }
        }
      ],
      "text": "After the crew left, Zuko was bitter and resentful. He rejected Iroh's offer to go for a walk, and opted to stay in his room and sulk. Meanwhile, the pirates, whom Zuko had met before, were hired by Zhao to assassinate Zuko, and they began to plant explosives on his ship. Zuko heard them, when one of them opened a creaky door. He went to investigate, but found nothing until he saw the pirate captain's iguana parrot. The explosives went off, and destroyed Zuko's ship. Moments before the flames hit him, Zuko formed a fire shield around himself, saving his life."
    },
    {
      "body": "When Zuko reunited with Iroh, he stowed away aboard Zhao's ship while his uncle accepted the offer to be the admiral's adviser.",
      "links": [],
      "text": "When Zuko reunited with Iroh, he stowed away aboard Zhao's ship while his uncle accepted the offer to be the admiral's adviser."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Zuko and Aang."
    },
    {
      "body": "Zuko stayed aboard Zhao's ship, disguising as a soldier, well into ${link_0}. After nightfall, he commandeered a boat, and planned to sneak into the city to take Aang. Before he left, Iroh met with him, gave him advice, and told him that he had thought of him as his own son since ${link_1}'s death. Zuko said he knew, and promised that they would meet again, after he had captured the Avatar. Iroh wished him well, and Zuko left.",
      "links": [
        {
          "body": "the siege",
          "key": "${link_0}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        },
        {
          "body": "son",
          "key": "${link_1}",
          "target": {
            "href": "Lu_Ten",
            "page": "Lu_Ten"
          }
        }
      ],
      "text": "Zuko stayed aboard Zhao's ship, disguising as a soldier, well into the siege. After nightfall, he commandeered a boat, and planned to sneak into the city to take Aang. Before he left, Iroh met with him, gave him advice, and told him that he had thought of him as his own son since son's death. Zuko said he knew, and promised that they would meet again, after he had captured the Avatar. Iroh wished him well, and Zuko left."
    },
    {
      "body": "He rowed his way to the shoreline next to the city. He noticed a group of ${link_0} diving into a hole, and realized that they must have a place where they came up for air. He dove in, and eventually came to a place where he was trapped under ice. He used heat, created from firebending, to melt the ice, and came up in the city. He made his way to the ${link_1}, where he found that Aang had crossed into the ${link_2}. He interrupted them, demanding that they give Aang to him. Katara moved to defend him, as Yue ran away, and Zuko took a fighting stance.",
      "links": [
        {
          "body": "turtle seals",
          "key": "${link_0}",
          "target": {
            "href": "Turtle_seal",
            "page": "Turtle_seal"
          }
        },
        {
          "body": "Spirit Oasis",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "He rowed his way to the shoreline next to the city. He noticed a group of turtle seals diving into a hole, and realized that they must have a place where they came up for air. He dove in, and eventually came to a place where he was trapped under ice. He used heat, created from firebending, to melt the ice, and came up in the city. He made his way to the Spirit Oasis, where he found that Aang had crossed into the Spirit World. He interrupted them, demanding that they give Aang to him. Katara moved to defend him, as Yue ran away, and Zuko took a fighting stance."
    },
    {
      "body": "The two began to fight. At first, they were relatively equal; but Katara, empowered by the moon, gained the upper hand and trapped Zuko in a prison of ice. However, when the sun rose, he, being powered by the sun, used a fire blast to knock Katara into a tree, knocking her out. He took Aang and, having nowhere else to go, left the city and went north, into a raging blizzard.",
      "links": [],
      "text": "The two began to fight. At first, they were relatively equal; but Katara, empowered by the moon, gained the upper hand and trapped Zuko in a prison of ice. However, when the sun rose, he, being powered by the sun, used a fire blast to knock Katara into a tree, knocking her out. He took Aang and, having nowhere else to go, left the city and went north, into a raging blizzard."
    },
    {
      "body": "${link_0}.",
      "links": [
        {
          "body": "Zuko defeating Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Duels_(Spring_270_BG_-_Winter_100_AG)#Duel_between_Zhao_and_Zuko",
            "page": "Duels_(Spring_270_BG_-_Winter_100_AG)"
          }
        }
      ],
      "text": "Zuko defeating Zhao."
    },
    {
      "body": "After trudging through the falling snow, Zuko found a cave, and took shelter. Soon after, Aang's spirit returned to his body. After the Avatar woke up, the airbender tried to escape but failed. Zuko restrained him, but Katara, Sokka, and Yue, who had been following them, come down on Appa. Katara defeated Zuko, and they prepared to leave with Aang. The young Avatar saved Zuko's life for a second time, insisting that Zuko must be brought along instead of being left unconscious in the snow where he would surely die. Upon returning to the Northern Water Tribe's city, Zuko escaped while Aang and his allies were distracted by Zhao's attack on the Moon Spirit, ${link_0}.",
      "links": [
        {
          "body": "Tui",
          "key": "${link_0}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        }
      ],
      "text": "After trudging through the falling snow, Zuko found a cave, and took shelter. Soon after, Aang's spirit returned to his body. After the Avatar woke up, the airbender tried to escape but failed. Zuko restrained him, but Katara, Sokka, and Yue, who had been following them, come down on Appa. Katara defeated Zuko, and they prepared to leave with Aang. The young Avatar saved Zuko's life for a second time, insisting that Zuko must be brought along instead of being left unconscious in the snow where he would surely die. Upon returning to the Northern Water Tribe's city, Zuko escaped while Aang and his allies were distracted by Zhao's attack on the Moon Spirit, Tui."
    },
    {
      "body": "Zuko followed an escaping Zhao, and attacked him. The Fire Nation Admiral defended himself, told Zuko that he knew Zuko was the Blue Spirit and called him a traitor. The two began fighting, and even though they were equal for a while, Zuko fared much better than he had in their first fight, and matched every one of Zhao's attacks. Eventually, he gained the upper hand and defeated him. Just as he was defeated by Zuko, the vengeful Ocean Spirit, La, attacked Zhao, attempting to drag him into the water. After a moment of internal struggle, Zuko offered Zhao his hand in aid. A prideful Zhao refused and was drowned by the Ocean Spirit.",
      "links": [],
      "text": "Zuko followed an escaping Zhao, and attacked him. The Fire Nation Admiral defended himself, told Zuko that he knew Zuko was the Blue Spirit and called him a traitor. The two began fighting, and even though they were equal for a while, Zuko fared much better than he had in their first fight, and matched every one of Zhao's attacks. Eventually, he gained the upper hand and defeated him. Just as he was defeated by Zuko, the vengeful Ocean Spirit, La, attacked Zhao, attempting to drag him into the water. After a moment of internal struggle, Zuko offered Zhao his hand in aid. A prideful Zhao refused and was drowned by the Ocean Spirit."
    },
    {
      "body": "Zuko and Iroh escaped the North Pole, and traveled on a driftwood raft for three weeks, until they reached land.",
      "links": [],
      "text": "Zuko and Iroh escaped the North Pole, and traveled on a driftwood raft for three weeks, until they reached land."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Zuko_(83_AG_-_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Zuko_(83_AG_-_100_AG).html",
    "page": "History_of_Zuko_(83_AG_-_100_AG)",
    "title": "History of Zuko (83 AG – 100 AG)"
  }
}