{
  "categories": [
    {
      "body": "Aang",
      "target": {
        "href": "Category_Aang",
        "page": "Category_Aang"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "After defeating ${link_0} ${link_1}'s invasion force and saving the ${link_2}, ${link_3} ${link_4} headed to the ${link_5} with ${link_6} to find an ${link_7} teacher.",
      "links": [
        {
          "body": "Admiral",
          "key": "${link_0}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_4}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_5}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "his friends",
          "key": "${link_6}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_7}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "After defeating Admiral Zhao's invasion force and saving the Northern Water Tribe, Avatar Aang headed to the Earth Kingdom with his friends to find an earthbending teacher."
    },
    {
      "body": "While journeying to the Earth Kingdom via a Water Tribe ship, Aang dreamt that he was in the ${link_0}, but he was outside his body, witnessing his destructive attacks firsthand. Seeing this frightened the young Avatar and he awoke with a start. Aang, ${link_1}, and ${link_2} parted ways with the Water Tribe citizens accompanying them and set off for ${link_3} where Aang would learn earthbending from ${link_4} ${link_5}.",
      "links": [
        {
          "body": "Avatar State",
          "key": "${link_0}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_2}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_3}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "King",
          "key": "${link_4}",
          "target": {
            "href": "King_of_Omashu",
            "page": "King_of_Omashu"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_5}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        }
      ],
      "text": "While journeying to the Earth Kingdom via a Water Tribe ship, Aang dreamt that he was in the Avatar State, but he was outside his body, witnessing his destructive attacks firsthand. Seeing this frightened the young Avatar and he awoke with a start. Aang, Katara, and Sokka parted ways with the Water Tribe citizens accompanying them and set off for Omashu where Aang would learn earthbending from King Bumi."
    },
    {
      "body": "${link_0} witnessed himself in the ${link_1} as a spirit.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_1}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "Aang witnessed himself in the Avatar State as a spirit."
    },
    {
      "body": "Aang and the team traveled to a ${link_0} from where they would be escorted to the metropolis. They met ${link_1}, an Earth Kingdom general who believed Aang was wasting time mastering the ${link_2}. He devised a plan to trigger the Avatar State whose power would enable Aang to defeat the ${link_3}. Feeling guilty because of the casualties of the ${link_4}, Aang agreed. First, they tried using a stimulant ${link_5} which induced a state of hyperactivity in Aang. Next, Sokka attempted to scare him into the Avatar State by making it seem as if ${link_6}'s head had replaced his own. Lastly, they tried by creating a mixture comprising of the four elements which was subsequently thrown onto Aang. However, the mixture ended up simply being mud that merely caused Aang to sneeze on everyone.",
      "links": [
        {
          "body": "military base",
          "key": "${link_0}",
          "target": {
            "href": "General_Fong%27s_fortress",
            "page": "General_Fong%27s_fortress"
          }
        },
        {
          "body": "Fong",
          "key": "${link_1}",
          "target": {
            "href": "Fong",
            "page": "Fong"
          }
        },
        {
          "body": "elements",
          "key": "${link_2}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_4}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "tea",
          "key": "${link_5}",
          "target": {
            "href": "Tea",
            "page": "Tea"
          }
        },
        {
          "body": "Momo",
          "key": "${link_6}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "Aang and the team traveled to a military base from where they would be escorted to the metropolis. They met Fong, an Earth Kingdom general who believed Aang was wasting time mastering the elements. He devised a plan to trigger the Avatar State whose power would enable Aang to defeat the Fire Lord. Feeling guilty because of the casualties of the Hundred Year War, Aang agreed. First, they tried using a stimulant tea which induced a state of hyperactivity in Aang. Next, Sokka attempted to scare him into the Avatar State by making it seem as if Momo's head had replaced his own. Lastly, they tried by creating a mixture comprising of the four elements which was subsequently thrown onto Aang. However, the mixture ended up simply being mud that merely caused Aang to sneeze on everyone."
    },
    {
      "body": "Aang came to realize that he should not try to trigger his Avatar State. Hoping that Fong would understand, Aang confronted him, but Fong foolishly tried to trigger the Avatar State by ordering his troops to attack the Avatar. When that failed, Fong used his earthbending to bury Katara. This enraged Aang, who fell under the Avatar State. Although initially overjoyed at his success, Fong quickly realized the error of his ways; he tried to explain that he had faked Katara's death in order to induce the Avatar State. However, Aang used a powerful wave of earthbending to defeat Fong and his troops. He was subdued only when ${link_0} ${link_1} communicated to him during the battle, briefly taking him into the ${link_2}. Roku explained that the Avatar State empowered the Avatar with the skills and knowledge of all his past lives. While in the Avatar State, Aang was at his most powerful, but also at his most vulnerable. Should an Avatar die while in this state, Roku warned, the ${link_3} would die with it and the Avatar would cease to exist. With the explanation completed, Roku returned Aang to his body.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Roku",
          "key": "${link_1}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Avatar Cycle",
          "key": "${link_3}",
          "target": {
            "href": "Avatar#Avatar_Cycle",
            "page": "Avatar"
          }
        }
      ],
      "text": "Aang came to realize that he should not try to trigger his Avatar State. Hoping that Fong would understand, Aang confronted him, but Fong foolishly tried to trigger the Avatar State by ordering his troops to attack the Avatar. When that failed, Fong used his earthbending to bury Katara. This enraged Aang, who fell under the Avatar State. Although initially overjoyed at his success, Fong quickly realized the error of his ways; he tried to explain that he had faked Katara's death in order to induce the Avatar State. However, Aang used a powerful wave of earthbending to defeat Fong and his troops. He was subdued only when Avatar Roku communicated to him during the battle, briefly taking him into the Spirit World. Roku explained that the Avatar State empowered the Avatar with the skills and knowledge of all his past lives. While in the Avatar State, Aang was at his most powerful, but also at his most vulnerable. Should an Avatar die while in this state, Roku warned, the Avatar Cycle would die with it and the Avatar would cease to exist. With the explanation completed, Roku returned Aang to his body."
    },
    {
      "body": "Having regained his senses, Aang saw the damage that he had caused and felt ashamed. General Fong, on the other hand, was overjoyed that Aang had entered the Avatar State and suggested that they begin finding a way to control the Avatar State. Sokka knocked Fong out before he could proceed with his idea, and the group left for Omashu without an escort.",
      "links": [],
      "text": "Having regained his senses, Aang saw the damage that he had caused and felt ashamed. General Fong, on the other hand, was overjoyed that Aang had entered the Avatar State and suggested that they begin finding a way to control the Avatar State. Sokka knocked Fong out before he could proceed with his idea, and the group left for Omashu without an escort."
    },
    {
      "body": "While the friends were relaxing, a group of Earth Kingdom nomads appeared, displaying the characteristics of carefree, nature-loving people. Upon hearing the team's plans to travel to Omashu, the earth nomads spoke of a shortcut through a tunnel passing under a mountain. Although Sokka did not trust these new characters, the kids later followed the nomads to the ${link_0} after an unsuccessful attempt to fly over the mountains.",
      "links": [
        {
          "body": "tunnels",
          "key": "${link_0}",
          "target": {
            "href": "Cave_of_Two_Lovers",
            "page": "Cave_of_Two_Lovers"
          }
        }
      ],
      "text": "While the friends were relaxing, a group of Earth Kingdom nomads appeared, displaying the characteristics of carefree, nature-loving people. Upon hearing the team's plans to travel to Omashu, the earth nomads spoke of a shortcut through a tunnel passing under a mountain. Although Sokka did not trust these new characters, the kids later followed the nomads to the tunnels after an unsuccessful attempt to fly over the mountains."
    },
    {
      "body": "Just before they entered, the ${link_0} mentioned that the tunnels formed a labyrinth protected by a curse. Only those who put their trust in love could find the way through; those who did not would be forever lost. Sokka created a map while traveling through the labyrinth, but the map proved useless due to the fact that the tunnels were constantly changing around them. When a cave-in suddenly occurred, Aang's quick action saved everyone from being crushed by the falling rocks; however, the resulting catastrophe separated the group. Aang, Katara, and ${link_1} were in one group, while Sokka and Momo, to Sokka's great displeasure, were forced to travel with the musical nomads, who assured him that he should not \"let the falling rocks turn his smile into a frown.\"",
      "links": [
        {
          "body": "leader of the nomads",
          "key": "${link_0}",
          "target": {
            "href": "Chong",
            "page": "Chong"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Just before they entered, the leader of the nomads mentioned that the tunnels formed a labyrinth protected by a curse. Only those who put their trust in love could find the way through; those who did not would be forever lost. Sokka created a map while traveling through the labyrinth, but the map proved useless due to the fact that the tunnels were constantly changing around them. When a cave-in suddenly occurred, Aang's quick action saved everyone from being crushed by the falling rocks; however, the resulting catastrophe separated the group. Aang, Katara, and Appa were in one group, while Sokka and Momo, to Sokka's great displeasure, were forced to travel with the musical nomads, who assured him that he should not \"let the falling rocks turn his smile into a frown.\""
    },
    {
      "body": "${link_0} and ${link_1} considered kissing as a way to navigate the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Cave of Two Lovers",
          "key": "${link_2}",
          "target": {
            "href": "Cave_of_Two_Lovers",
            "page": "Cave_of_Two_Lovers"
          }
        }
      ],
      "text": "Aang and Katara considered kissing as a way to navigate the Cave of Two Lovers."
    },
    {
      "body": "After traveling for an extensive period of time, Aang and Katara encountered a large tomb designed for the two lovers spoken of in lore. By reading script around the walls, they discovered the true story of the two lovers. The final line in the script stated, \"Love is brightest in the dark.\" Inspired by this, Katara suggested a possible way to navigate the labyrinth by following the example of the lovers and kissing. Although Aang, due to his unexpressed but growing affection for Katara, found this idea highly intriguing, he attempted to reassure an embarrassed Katara that he could not imagine kissing her. When she was put out by this response, he assured her that what he meant was, in choosing between certain death and kissing her, he would definitely choose to kiss her, insisting \"it [was] a compliment!\" This cooled the ardor between them for a while, but later, as the torch was burning out, desperation led them to dare the unknown. In the resulting darkness, Aang and Katara found out that glowing crystals embedded in the ceilings of the tunnels led to the exit. The two and Appa succeeded in navigating their way out of the cave. Soon after, the entire team was reunited. Concluding this, Aang, Sokka, and Katara finally arrived at Omashu only to discover, much to their devastation, that it had been ${link_0} by the ${link_1}.",
      "links": [
        {
          "body": "conquered",
          "key": "${link_0}",
          "target": {
            "href": "Surrender_of_Omashu",
            "page": "Surrender_of_Omashu"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "After traveling for an extensive period of time, Aang and Katara encountered a large tomb designed for the two lovers spoken of in lore. By reading script around the walls, they discovered the true story of the two lovers. The final line in the script stated, \"Love is brightest in the dark.\" Inspired by this, Katara suggested a possible way to navigate the labyrinth by following the example of the lovers and kissing. Although Aang, due to his unexpressed but growing affection for Katara, found this idea highly intriguing, he attempted to reassure an embarrassed Katara that he could not imagine kissing her. When she was put out by this response, he assured her that what he meant was, in choosing between certain death and kissing her, he would definitely choose to kiss her, insisting \"it [was] a compliment!\" This cooled the ardor between them for a while, but later, as the torch was burning out, desperation led them to dare the unknown. In the resulting darkness, Aang and Katara found out that glowing crystals embedded in the ceilings of the tunnels led to the exit. The two and Appa succeeded in navigating their way out of the cave. Soon after, the entire team was reunited. Concluding this, Aang, Sokka, and Katara finally arrived at Omashu only to discover, much to their devastation, that it had been conquered by the Fire Nation."
    },
    {
      "body": "Despite the dangers of being caught, Aang decided to enter the city and search for Bumi. Although Katara believed it was time for Aang to find a different earthbending teacher, Aang explained that Bumi was not just an earthbending teacher but a friend. Aang, Sokka, and Katara infiltrated the city via a sewer. Upon emerging, Sokka found several creatures called ${link_0} stuck to his face; they turned out to be harmless, and Aang removed them. Moments later, they encountered three Fire Nation soldiers who questioned why they were out past curfew. Aang quickly covered his arrow tattoo with a piece of cloth and Katara said that they were just on their way home. The soldiers decided to let them go until they noticed the marks on Sokka left by the pentapuses, raising their suspicion. Katara quickly fabricated an explanation, claiming him to have \"${link_1}\", a very contagious disease. The soldiers ran away in fear, thus the team avoided capture.",
      "links": [
        {
          "body": "purple pentapuses",
          "key": "${link_0}",
          "target": {
            "href": "Purple_pentapus",
            "page": "Purple_pentapus"
          }
        },
        {
          "body": "pentapox",
          "key": "${link_1}",
          "target": {
            "href": "Pentapox",
            "page": "Pentapox"
          }
        }
      ],
      "text": "Despite the dangers of being caught, Aang decided to enter the city and search for Bumi. Although Katara believed it was time for Aang to find a different earthbending teacher, Aang explained that Bumi was not just an earthbending teacher but a friend. Aang, Sokka, and Katara infiltrated the city via a sewer. Upon emerging, Sokka found several creatures called purple pentapuses stuck to his face; they turned out to be harmless, and Aang removed them. Moments later, they encountered three Fire Nation soldiers who questioned why they were out past curfew. Aang quickly covered his arrow tattoo with a piece of cloth and Katara said that they were just on their way home. The soldiers decided to let them go until they noticed the marks on Sokka left by the pentapuses, raising their suspicion. Katara quickly fabricated an explanation, claiming him to have \"pentapox\", a very contagious disease. The soldiers ran away in fear, thus the team avoided capture."
    },
    {
      "body": "In Omashu, a ${link_0}, his wife, ${link_1}, and daughter ${link_2} caught sight of Aang and his friends, believing them to be the cause of an attempted attack by the ${link_3}. Mai chased after the trio, firing a barrage of knives their way. The team, however, avoided these attacks after suddenly ending up in an underground base where Omashu's army was present. The trio inquired about the Fire Nation's conquest of the city to which an ${link_4} revealed that King Bumi surrendered to the Fire Nation, much to the dismay of the army. Aang stated that the best course of action was for the citizens of Omashu to depart; he devised a plan to give all the citizens the fake disease, \"pentapox\". This strategy succeeded with the Fire Nation governor ordering all citizens to be evacuated; unbeknownst to the governor, however, his own infant son accidentally left the city alongside the citizens. Aang stayed behind the evacuation, electing to try and find Bumi instead, but his search came up empty.",
      "links": [
        {
          "body": "Fire Nation official",
          "key": "${link_0}",
          "target": {
            "href": "Ukano",
            "page": "Ukano"
          }
        },
        {
          "body": "baby son",
          "key": "${link_1}",
          "target": {
            "href": "Tom-Tom",
            "page": "Tom-Tom"
          }
        },
        {
          "body": "Mai",
          "key": "${link_2}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Omashu Resistance",
          "key": "${link_3}",
          "target": {
            "href": "Omashu_Resistance",
            "page": "Omashu_Resistance"
          }
        },
        {
          "body": "Earth Kingdom captain",
          "key": "${link_4}",
          "target": {
            "href": "Yung_(captain)",
            "page": "Yung_(captain)"
          }
        }
      ],
      "text": "In Omashu, a Fire Nation official, his wife, baby son, and daughter Mai caught sight of Aang and his friends, believing them to be the cause of an attempted attack by the Omashu Resistance. Mai chased after the trio, firing a barrage of knives their way. The team, however, avoided these attacks after suddenly ending up in an underground base where Omashu's army was present. The trio inquired about the Fire Nation's conquest of the city to which an Earth Kingdom captain revealed that King Bumi surrendered to the Fire Nation, much to the dismay of the army. Aang stated that the best course of action was for the citizens of Omashu to depart; he devised a plan to give all the citizens the fake disease, \"pentapox\". This strategy succeeded with the Fire Nation governor ordering all citizens to be evacuated; unbeknownst to the governor, however, his own infant son accidentally left the city alongside the citizens. Aang stayed behind the evacuation, electing to try and find Bumi instead, but his search came up empty."
    },
    {
      "body": "${link_0} informed ${link_1} that he could not be his ${link_2} teacher.",
      "links": [
        {
          "body": "Bumi",
          "key": "${link_0}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Bumi informed Aang that he could not be his earthbending teacher."
    },
    {
      "body": "While stationed securely outside the city walls, the team received a ransom note, proposing an exchange of the governor's son for King Bumi. The exchange was to be done with Mai, but was called off when her friend, ${link_0} ${link_1}, intervened and declared it a bad trade. Aang freed the still-detained Bumi and they managed to flee Azula's pursuit via the ${link_2}. The Avatar questioned his old friend as to why he had surrendered the city. Bumi explained to Aang the value of ${link_3}, or battle strategy, focusing primarily on neutral jing in which one does nothing. He revealed that he deliberately allowed the city to be captured by the principle of neutral jing, where one should remain in place and wait for the opportune moment to strike; this principle is the key to earthbending. Realizing the value of Bumi's judgment, Aang departed the city on Appa while Bumi bent his way up the mail shaft.",
      "links": [
        {
          "body": "Princess",
          "key": "${link_0}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Omashu delivery system",
          "key": "${link_2}",
          "target": {
            "href": "Omashu_delivery_system",
            "page": "Omashu_delivery_system"
          }
        },
        {
          "body": "jing",
          "key": "${link_3}",
          "target": {
            "href": "Jing",
            "page": "Jing"
          }
        }
      ],
      "text": "While stationed securely outside the city walls, the team received a ransom note, proposing an exchange of the governor's son for King Bumi. The exchange was to be done with Mai, but was called off when her friend, Princess Azula, intervened and declared it a bad trade. Aang freed the still-detained Bumi and they managed to flee Azula's pursuit via the Omashu delivery system. The Avatar questioned his old friend as to why he had surrendered the city. Bumi explained to Aang the value of jing, or battle strategy, focusing primarily on neutral jing in which one does nothing. He revealed that he deliberately allowed the city to be captured by the principle of neutral jing, where one should remain in place and wait for the opportune moment to strike; this principle is the key to earthbending. Realizing the value of Bumi's judgment, Aang departed the city on Appa while Bumi bent his way up the mail shaft."
    },
    {
      "body": "The team flew on Appa above a ${link_0}, with Aang staring at it in a sort of hypnotic trance and slowly lowering the bison toward it. When Sokka inquired as to Aang's reasons for doing so, the Avatar came out of his trance and claimed that the swamp was \"calling him\". Sokka tried to convince Aang to simply ignore this intuitive feeling and continue flying past, but Aang was still highly intrigued because of what King Bumi told him about listening to the earth. He resolved to leave after the others stated their suspicions about the swamp. However, a sudden tornado appeared, rampaging toward the team and forcefully causing them to fall down into the swamp.",
      "links": [
        {
          "body": "giant swamp",
          "key": "${link_0}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        }
      ],
      "text": "The team flew on Appa above a giant swamp, with Aang staring at it in a sort of hypnotic trance and slowly lowering the bison toward it. When Sokka inquired as to Aang's reasons for doing so, the Avatar came out of his trance and claimed that the swamp was \"calling him\". Sokka tried to convince Aang to simply ignore this intuitive feeling and continue flying past, but Aang was still highly intrigued because of what King Bumi told him about listening to the earth. He resolved to leave after the others stated their suspicions about the swamp. However, a sudden tornado appeared, rampaging toward the team and forcefully causing them to fall down into the swamp."
    },
    {
      "body": "Aang, Katara, and Sokka were separated from Appa and Momo as a result of the turbulent landing. The trio tried to find their animal companions with Sokka chopping everything in sight with his ${link_0}. Aang warned Sokka against such a detrimental action; Katara agreed with Aang, claiming to feel some supernatural qualities in the swamp. Despite pleas from his friends, Sokka dismissed their concerns and persisted in scything the vines. They set up camp that night, the swamp's ominousness unnerving all three. While asleep, mysterious vines slithered out from deep within the swamp and grabbed a hold of all three team members. Although each managed to escape from the vines using their styles of fighting, they were separated from one another.",
      "links": [
        {
          "body": "machete",
          "key": "${link_0}",
          "target": {
            "href": "Sokka%27s_weapons#Machete",
            "page": "Sokka%27s_weapons"
          }
        }
      ],
      "text": "Aang, Katara, and Sokka were separated from Appa and Momo as a result of the turbulent landing. The trio tried to find their animal companions with Sokka chopping everything in sight with his machete. Aang warned Sokka against such a detrimental action; Katara agreed with Aang, claiming to feel some supernatural qualities in the swamp. Despite pleas from his friends, Sokka dismissed their concerns and persisted in scything the vines. They set up camp that night, the swamp's ominousness unnerving all three. While asleep, mysterious vines slithered out from deep within the swamp and grabbed a hold of all three team members. Although each managed to escape from the vines using their styles of fighting, they were separated from one another."
    },
    {
      "body": "While searching for Katara and Sokka, Aang saw a strange girl with a pet ${link_0} giggling in the distance. He chased after the girl, but she repeatedly disappeared from sight. The vision disappeared altogether when the Avatar and his friends were unexpectedly reunited with one another at the center of the swamp, a giant tree. Aang believed that the swamp had been calling them there. At that moment, a gigantic monster formed from the vines of the swamp burst from the water and a fight ensued.",
      "links": [
        {
          "body": "flying boar",
          "key": "${link_0}",
          "target": {
            "href": "Flying_boar",
            "page": "Flying_boar"
          }
        }
      ],
      "text": "While searching for Katara and Sokka, Aang saw a strange girl with a pet flying boar giggling in the distance. He chased after the girl, but she repeatedly disappeared from sight. The vision disappeared altogether when the Avatar and his friends were unexpectedly reunited with one another at the center of the swamp, a giant tree. Aang believed that the swamp had been calling them there. At that moment, a gigantic monster formed from the vines of the swamp burst from the water and a fight ensued."
    },
    {
      "body": "${link_0} found ${link_1} by locating his ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "chi",
          "key": "${link_2}",
          "target": {
            "href": "Chi",
            "page": "Chi"
          }
        }
      ],
      "text": "Aang found Appa by locating his chi."
    },
    {
      "body": "Aang and Katara finally defeated the swamp monster who was really a ${link_0}, named ${link_1}, bending the water in the vines. Upon learning that Aang was the Avatar, he began to offer his knowledge of the swamp, stating that it was really one big tree, stretching out its roots for miles. He also said that the whole ${link_2} is one organism like the swamp. If one listened carefully, he explained, they could hear everything breathing together because everything is connected. When inquired about the visions they had received, he explained that, in the swamp, people had visions of people they had lost, even though they are not really gone. Aang's vision continued to perplex him because he was certain he had never met the girl; he came to realize, however, that he would meet her in the future. Aang discovered that if he listened to the earth, he could pinpoint the location of Appa and Momo. He channeled his chi, and a glowing line of energy drew him straight to Appa and Momo. Aang and Katara later confronted the natives to free Appa and Momo, and the natives were revealed to be waterbenders as well.",
      "links": [
        {
          "body": "waterbender",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Huu",
          "key": "${link_1}",
          "target": {
            "href": "Huu",
            "page": "Huu"
          }
        },
        {
          "body": "world",
          "key": "${link_2}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "Aang and Katara finally defeated the swamp monster who was really a waterbender, named Huu, bending the water in the vines. Upon learning that Aang was the Avatar, he began to offer his knowledge of the swamp, stating that it was really one big tree, stretching out its roots for miles. He also said that the whole world is one organism like the swamp. If one listened carefully, he explained, they could hear everything breathing together because everything is connected. When inquired about the visions they had received, he explained that, in the swamp, people had visions of people they had lost, even though they are not really gone. Aang's vision continued to perplex him because he was certain he had never met the girl; he came to realize, however, that he would meet her in the future. Aang discovered that if he listened to the earth, he could pinpoint the location of Appa and Momo. He channeled his chi, and a glowing line of energy drew him straight to Appa and Momo. Aang and Katara later confronted the natives to free Appa and Momo, and the natives were revealed to be waterbenders as well."
    },
    {
      "body": "The team ventured to an ${link_0} where they learned of a holiday known as \"${link_1}\". They watched a parade with giant effigies of ${link_2}, Roku, and Aang being brought out on floats. The trio initially believed that the festival was honoring the Avatar, only to witness a man torch the three floats to the loud approval of the village, who chanted, \"Down with the Avatar!\"",
      "links": [
        {
          "body": "Earth Kingdom village",
          "key": "${link_0}",
          "target": {
            "href": "Chin_Village",
            "page": "Chin_Village"
          }
        },
        {
          "body": "Avatar Day",
          "key": "${link_1}",
          "target": {
            "href": "Avatar_Day_festival",
            "page": "Avatar_Day_festival"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_2}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        }
      ],
      "text": "The team ventured to an Earth Kingdom village where they learned of a holiday known as \"Avatar Day\". They watched a parade with giant effigies of Kyoshi, Roku, and Aang being brought out on floats. The trio initially believed that the festival was honoring the Avatar, only to witness a man torch the three floats to the loud approval of the village, who chanted, \"Down with the Avatar!\""
    },
    {
      "body": "Aang revealed himself as the Avatar to defend his status and was consequently arrested. While in his ${link_0} cell, ${link_1} explained to him that \"Avatar Day\" commemorated the day Avatar Kyoshi killed the village's leader, ${link_2} the Great. To prove Aang's innocence, Sokka and Katara searched the village and returned to ${link_3} to find evidence that said otherwise. The evidence they garnered, however, proved useless because during the trial, the opposing sides merely told what they believed had happened. Solely based on those stories, the jury, consisting of the town's mayor, decided who was innocent and who was guilty; for this case, the village mayor served as both prosecution and jury. Under these pretenses, it would prove impossible for Aang to receive a fair trial. Meanwhile, Aang, while incarcerated, befriended the other prisoners. ${link_4} advised him to open up to Katara about his feelings.",
      "links": [
        {
          "body": "jail",
          "key": "${link_0}",
          "target": {
            "href": "Chin_Village_prison",
            "page": "Chin_Village_prison"
          }
        },
        {
          "body": "the village's mayor",
          "key": "${link_1}",
          "target": {
            "href": "Tong",
            "page": "Tong"
          }
        },
        {
          "body": "Chin",
          "key": "${link_2}",
          "target": {
            "href": "Chin",
            "page": "Chin"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_3}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "One of them",
          "key": "${link_4}",
          "target": {
            "href": "Sensitive_ruffian",
            "page": "Sensitive_ruffian"
          }
        }
      ],
      "text": "Aang revealed himself as the Avatar to defend his status and was consequently arrested. While in his jail cell, the village's mayor explained to him that \"Avatar Day\" commemorated the day Avatar Kyoshi killed the village's leader, Chin the Great. To prove Aang's innocence, Sokka and Katara searched the village and returned to Kyoshi Island to find evidence that said otherwise. The evidence they garnered, however, proved useless because during the trial, the opposing sides merely told what they believed had happened. Solely based on those stories, the jury, consisting of the town's mayor, decided who was innocent and who was guilty; for this case, the village mayor served as both prosecution and jury. Under these pretenses, it would prove impossible for Aang to receive a fair trial. Meanwhile, Aang, while incarcerated, befriended the other prisoners. One of them advised him to open up to Katara about his feelings."
    },
    {
      "body": "${link_0} waited for ${link_1} ${link_2} to manifest herself.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_2}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        }
      ],
      "text": "Aang waited for Avatar Kyoshi to manifest herself."
    },
    {
      "body": "During Aang's trial, after hearing the village mayor's story and Aang's vague version, he was found guilty. Refusing to give up, Sokka and Katara had Aang dress up in Kyoshi's old uniform, under the belief that wearing her garments would trigger something.",
      "links": [],
      "text": "During Aang's trial, after hearing the village mayor's story and Aang's vague version, he was found guilty. Refusing to give up, Sokka and Katara had Aang dress up in Kyoshi's old uniform, under the belief that wearing her garments would trigger something."
    },
    {
      "body": "Surprisingly, Kyoshi manifested herself through Aang's body and announced to the village that she did indeed kill Chin the Great, or \"Conqueror\", as she called him. She insisted, however, that it was with the best intentions being that Chin was a cruel dictator and threatened to conquer her homeland. Once Kyoshi's spirit disappeared and Tong recovered from his shock, he condemned Aang for the murder of Chin and ordered the ${link_0} to be brought out in order to determine his sentence. Much to the excitement of the villagers, it halted on \"boiled in oil\". However, before the sentence could be carried out, a Fire Nation cavalry, the ${link_1}, arrived to claim the village in name of the ${link_2}. Fearing for his safety, the mayor quickly changed the punishment to community service and pleaded with Aang to defeat the warriors and save the village. Aang accepted his punishment and, with the help of Katara and Sokka, quickly defeated the warriors in battle and expunged them from the village. To express gratitude toward the Avatar for saving the village, the mayor decided that \"Avatar Day\" would no longer be a day of hatred but a day to commemorate and honor the Avatars for the protection they gave the village in time of need. Since Aang was not boiled in oil on this day, the celebration involved eating effigies of the Avatar made from uncooked dough.",
      "links": [
        {
          "body": "Wheel of Punishment",
          "key": "${link_0}",
          "target": {
            "href": "Wheel_of_Punishment",
            "page": "Wheel_of_Punishment"
          }
        },
        {
          "body": "Rough Rhinos",
          "key": "${link_1}",
          "target": {
            "href": "Rough_Rhinos",
            "page": "Rough_Rhinos"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "text": "Surprisingly, Kyoshi manifested herself through Aang's body and announced to the village that she did indeed kill Chin the Great, or \"Conqueror\", as she called him. She insisted, however, that it was with the best intentions being that Chin was a cruel dictator and threatened to conquer her homeland. Once Kyoshi's spirit disappeared and Tong recovered from his shock, he condemned Aang for the murder of Chin and ordered the Wheel of Punishment to be brought out in order to determine his sentence. Much to the excitement of the villagers, it halted on \"boiled in oil\". However, before the sentence could be carried out, a Fire Nation cavalry, the Rough Rhinos, arrived to claim the village in name of the Fire Lord. Fearing for his safety, the mayor quickly changed the punishment to community service and pleaded with Aang to defeat the warriors and save the village. Aang accepted his punishment and, with the help of Katara and Sokka, quickly defeated the warriors in battle and expunged them from the village. To express gratitude toward the Avatar for saving the village, the mayor decided that \"Avatar Day\" would no longer be a day of hatred but a day to commemorate and honor the Avatars for the protection they gave the village in time of need. Since Aang was not boiled in oil on this day, the celebration involved eating effigies of the Avatar made from uncooked dough."
    },
    {
      "body": "${link_0} joined an ${link_1} ${link_2} in the hopes of finding a teacher from whom he could learn.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "academy",
          "key": "${link_2}",
          "target": {
            "href": "Master_Yu%27s_Earthbending_Academy",
            "page": "Master_Yu%27s_Earthbending_Academy"
          }
        }
      ],
      "text": "Aang joined an earthbending academy in the hopes of finding a teacher from whom he could learn."
    },
    {
      "body": "The trio went to the town of ${link_0} to continue their search for an earthbending instructor. While searching, Aang received a free earthbending lesson from a man named Master ${link_1}, but he found that Yu cared more about having him pay for lessons than he did about teaching. Afterward, they overheard a ${link_2} discussing ${link_3}, a tournament featuring several powerful earthbenders. The boys were not very inclined to inform Aang of the tournament's location, until Katara secretly used her \"feminine charm\", which involved freezing them to the walls, to coerce them to tell.",
      "links": [
        {
          "body": "Gaoling",
          "key": "${link_0}",
          "target": {
            "href": "Gaoling",
            "page": "Gaoling"
          }
        },
        {
          "body": "Yu",
          "key": "${link_1}",
          "target": {
            "href": "Yu",
            "page": "Yu"
          }
        },
        {
          "body": "pair of students",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending_academy_teenagers",
            "page": "Earthbending_academy_teenagers"
          }
        },
        {
          "body": "Earth Rumble VI",
          "key": "${link_3}",
          "target": {
            "href": "Earth_Rumble_VI",
            "page": "Earth_Rumble_VI"
          }
        }
      ],
      "text": "The trio went to the town of Gaoling to continue their search for an earthbending instructor. While searching, Aang received a free earthbending lesson from a man named Master Yu, but he found that Yu cared more about having him pay for lessons than he did about teaching. Afterward, they overheard a pair of students discussing Earth Rumble VI, a tournament featuring several powerful earthbenders. The boys were not very inclined to inform Aang of the tournament's location, until Katara secretly used her \"feminine charm\", which involved freezing them to the walls, to coerce them to tell."
    },
    {
      "body": "At the tournament, they witnessed a powerful earthbender named ${link_0} defeat every challenger he came across. Sokka became completely enthralled in the spectacle, but Aang was not very impressed, saying that The Boulder was \"just listening to his big muscles\" as opposed to listening to the earth. After vanquishing all other contenders, The Boulder confronted the current champion, the Blind Bandit, a blind twelve-year-old girl. Aang noticed the Bandit's techniques, especially how she waited and listened carefully to the movements of her opponent and realized she was the master of neutral jing Bumi had been encouraging him to find. He also realized that she was the girl whom he had envisioned in the swamp.",
      "links": [
        {
          "body": "The Boulder",
          "key": "${link_0}",
          "target": {
            "href": "The_Boulder",
            "page": "The_Boulder"
          }
        }
      ],
      "text": "At the tournament, they witnessed a powerful earthbender named The Boulder defeat every challenger he came across. Sokka became completely enthralled in the spectacle, but Aang was not very impressed, saying that The Boulder was \"just listening to his big muscles\" as opposed to listening to the earth. After vanquishing all other contenders, The Boulder confronted the current champion, the Blind Bandit, a blind twelve-year-old girl. Aang noticed the Bandit's techniques, especially how she waited and listened carefully to the movements of her opponent and realized she was the master of neutral jing Bumi had been encouraging him to find. He also realized that she was the girl whom he had envisioned in the swamp."
    },
    {
      "body": "After the Bandit effortlessly defeated The Boulder, the host of the tournament, ${link_0}, offered a large sum of ${link_1} to whoever could defeat the Blind Bandit in a fight. Seeing an opportunity to talk to the Bandit, Aang challenged her. The Bandit, however, was ready for a fight and refused to engage in conversation, instead launching a boulder at Aang. She was not prepared, however, to face an airbender and was defeated when Aang blew her out of the ring. The Bandit took badly to her loss and stormed off, refusing to listen to Aang when he beckoned to her.",
      "links": [
        {
          "body": "Xin Fu",
          "key": "${link_0}",
          "target": {
            "href": "Xin_Fu",
            "page": "Xin_Fu"
          }
        },
        {
          "body": "gold",
          "key": "${link_1}",
          "target": {
            "href": "Currency",
            "page": "Currency"
          }
        }
      ],
      "text": "After the Bandit effortlessly defeated The Boulder, the host of the tournament, Xin Fu, offered a large sum of gold to whoever could defeat the Blind Bandit in a fight. Seeing an opportunity to talk to the Bandit, Aang challenged her. The Bandit, however, was ready for a fight and refused to engage in conversation, instead launching a boulder at Aang. She was not prepared, however, to face an airbender and was defeated when Aang blew her out of the ring. The Bandit took badly to her loss and stormed off, refusing to listen to Aang when he beckoned to her."
    },
    {
      "body": "Aang and the others returned to Master Yu's school to try to find out where the Blind Bandit lived. They approached the students they had confronted earlier, both of whom were quite intimidated by Katara. They did not obtain much information; however, Aang recalled the flying boar he had seen with the girl in his vision. The boys stated that the flying boar was the symbol of the ${link_0}, the wealthiest family in the town.",
      "links": [
        {
          "body": "Beifong family",
          "key": "${link_0}",
          "target": {
            "href": "Beifong_family",
            "page": "Beifong_family"
          }
        }
      ],
      "text": "Aang and the others returned to Master Yu's school to try to find out where the Blind Bandit lived. They approached the students they had confronted earlier, both of whom were quite intimidated by Katara. They did not obtain much information; however, Aang recalled the flying boar he had seen with the girl in his vision. The boys stated that the flying boar was the symbol of the Beifong family, the wealthiest family in the town."
    },
    {
      "body": "Aang and company traveled to the family's house, where they were accosted by the Bandit, now wearing the same dress Aang had seen her wearing in the swamp. The girl, named ${link_0}, refused to aid Team Avatar and called the house guards to chase them off.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Aang and company traveled to the family's house, where they were accosted by the Bandit, now wearing the same dress Aang had seen her wearing in the swamp. The girl, named Toph, refused to aid Team Avatar and called the house guards to chase them off."
    },
    {
      "body": "${link_0} talked to ${link_1} about how other people perceived her as weak.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Toph talked to Aang about how other people perceived her as weak."
    },
    {
      "body": "That evening, Aang used his status as the Avatar to gain a formal audience with the entire Beifong family. He attempted to gain her father's support regarding Toph aiding him, but Toph used her earthbending to keep him from saying anything revealing. Her parents and teacher were completely unaware of her true skill, and she wanted to keep it that way. After numerous interruptions, Aang retaliated by sneezing, bringing the dinner to both a premature end and into everybody's faces.",
      "links": [],
      "text": "That evening, Aang used his status as the Avatar to gain a formal audience with the entire Beifong family. He attempted to gain her father's support regarding Toph aiding him, but Toph used her earthbending to keep him from saying anything revealing. Her parents and teacher were completely unaware of her true skill, and she wanted to keep it that way. After numerous interruptions, Aang retaliated by sneezing, bringing the dinner to both a premature end and into everybody's faces."
    },
    {
      "body": "After dinner, Toph called a truce with Aang and recounted her history. Her parents perceived her as a weak and fragile child due to her blindness and severely restricted her freedom. From an early age, she began sneaking out of the house and mastering earthbending on her own, secretly competing in tournaments and surpassing her \"teacher\" in skill. The pair was suddenly ambushed and captured by Xin Fu and his stable of earthbenders, who suspected the two of duplicity earlier during the tournament. Toph was later freed and, after defeating Xin Fu's earthbenders, rescued Aang, an event her father witnessed.",
      "links": [],
      "text": "After dinner, Toph called a truce with Aang and recounted her history. Her parents perceived her as a weak and fragile child due to her blindness and severely restricted her freedom. From an early age, she began sneaking out of the house and mastering earthbending on her own, secretly competing in tournaments and surpassing her \"teacher\" in skill. The pair was suddenly ambushed and captured by Xin Fu and his stable of earthbenders, who suspected the two of duplicity earlier during the tournament. Toph was later freed and, after defeating Xin Fu's earthbenders, rescued Aang, an event her father witnessed."
    },
    {
      "body": "Toph later confronted her parents, expressing her desire to accompany Team Avatar on their journeys. Her father denied this request and ordered Aang and the others to leave the estate. As the team prepared to depart, however, Toph ran up to them, saying that her father had ultimately granted her permission to travel with them. Before departing, she launched Aang into a tree via earthbending and, declaring them even, demanded to have her championship belt returned.",
      "links": [],
      "text": "Toph later confronted her parents, expressing her desire to accompany Team Avatar on their journeys. Her father denied this request and ordered Aang and the others to leave the estate. As the team prepared to depart, however, Toph ran up to them, saying that her father had ultimately granted her permission to travel with them. Before departing, she launched Aang into a tree via earthbending and, declaring them even, demanded to have her championship belt returned."
    },
    {
      "body": "In a remote Earth Kingdom forest, Team Avatar was pursued by a ${link_0} operated by ${link_1}, Mai, and ${link_2}. Their machine allowed them to cover great distances at high speeds; additionally, they were able to trace the team's whereabouts by following a trail of shed fur Appa consistently left. Aang and his friends were repeatedly forced to escape, depriving them of much-needed rest and draining the last of their power and patience. To make matters worse, Katara and Toph became tangled in a bitter conflict with Toph eventually leaving the group after a particularly acrimonious fight.",
      "links": [
        {
          "body": "tank train",
          "key": "${link_0}",
          "target": {
            "href": "Tank_train",
            "page": "Tank_train"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_2}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "text": "In a remote Earth Kingdom forest, Team Avatar was pursued by a tank train operated by Azula, Mai, and Ty Lee. Their machine allowed them to cover great distances at high speeds; additionally, they were able to trace the team's whereabouts by following a trail of shed fur Appa consistently left. Aang and his friends were repeatedly forced to escape, depriving them of much-needed rest and draining the last of their power and patience. To make matters worse, Katara and Toph became tangled in a bitter conflict with Toph eventually leaving the group after a particularly acrimonious fight."
    },
    {
      "body": "${link_0}, ${link_1}, and ${link_2} engaged in a three-way battle.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Azula",
          "key": "${link_2}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Aang, Zuko, and Azula engaged in a three-way battle."
    },
    {
      "body": "Aang attempted to deceive Azula by leaving a false trail of Appa's shed fur for her to follow, while Katara and Sokka retreated somewhere safe. Azula, however, unfolded his plan; she sent Mai and Ty Lee in the direction she believed the group to have gone and followed Aang's fabricated trail herself.",
      "links": [],
      "text": "Aang attempted to deceive Azula by leaving a false trail of Appa's shed fur for her to follow, while Katara and Sokka retreated somewhere safe. Azula, however, unfolded his plan; she sent Mai and Ty Lee in the direction she believed the group to have gone and followed Aang's fabricated trail herself."
    },
    {
      "body": "Aang's ultimately wound up in an ${link_0} where he was later found and confronted by Azula. ${link_1} arrived on scene shortly after and all three assumed fighting stances, prepared to duel. Azula fired the first shot, hitting Zuko hard and knocking him back. All three exchanged blows until the duel was joined by Katara, Sokka, ${link_2}, and Toph. Azula was eventually cornered by the other six combatants. She surrendered and Iroh momentarily let his guard down, turning to see his comrades. Azula took advantage of this and launched a fire blast at him, striking him in the chest. Zuko let out a horrified cry, and all four benders unleashed their power against her; Azula, however, was able to escape the scene unharmed. Aang, Katara, Sokka, and Toph gathered around Iroh, but Zuko yelled for them to leave, backing up his words with a sweeping arc of flame. Respecting his need for privacy, Aang and the others fled.",
      "links": [
        {
          "body": "abandoned town",
          "key": "${link_0}",
          "target": {
            "href": "Tu_Zin",
            "page": "Tu_Zin"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_2}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Aang's ultimately wound up in an abandoned town where he was later found and confronted by Azula. Zuko arrived on scene shortly after and all three assumed fighting stances, prepared to duel. Azula fired the first shot, hitting Zuko hard and knocking him back. All three exchanged blows until the duel was joined by Katara, Sokka, Iroh, and Toph. Azula was eventually cornered by the other six combatants. She surrendered and Iroh momentarily let his guard down, turning to see his comrades. Azula took advantage of this and launched a fire blast at him, striking him in the chest. Zuko let out a horrified cry, and all four benders unleashed their power against her; Azula, however, was able to escape the scene unharmed. Aang, Katara, Sokka, and Toph gathered around Iroh, but Zuko yelled for them to leave, backing up his words with a sweeping arc of flame. Respecting his need for privacy, Aang and the others fled."
    },
    {
      "body": "${link_0} initially had difficulty with his ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "earthbending training",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending_training",
            "page": "Earthbending_training"
          }
        }
      ],
      "text": "Aang initially had difficulty with his earthbending training."
    },
    {
      "body": "Aang awoke from his sleep, excited to finally begin his ${link_0} with Toph. Toph commenced her instruction with the simple act of moving a rock. She explained to Aang that earthbending required a firm, steady stance and demonstrated the technique by sending a rock into a wall. Aang tried to emulate her, but ended up hitting the rock with ${link_1} and propelling himself backward.",
      "links": [
        {
          "body": "earthbending training",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending_training",
            "page": "Earthbending_training"
          }
        },
        {
          "body": "airbending",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Aang awoke from his sleep, excited to finally begin his earthbending training with Toph. Toph commenced her instruction with the simple act of moving a rock. She explained to Aang that earthbending required a firm, steady stance and demonstrated the technique by sending a rock into a wall. Aang tried to emulate her, but ended up hitting the rock with airbending and propelling himself backward."
    },
    {
      "body": "Aang questioned his inability to move the rock while in his correct stance. He tried to find an alternate solution, but Toph explained that such creative thinking was the problem, as earthbending required a head-on approach. She proceeded to train Aang through several activities involving the earth with the Avatar gradually improving.",
      "links": [],
      "text": "Aang questioned his inability to move the rock while in his correct stance. He tried to find an alternate solution, but Toph explained that such creative thinking was the problem, as earthbending required a head-on approach. She proceeded to train Aang through several activities involving the earth with the Avatar gradually improving."
    },
    {
      "body": "Toph decided to teach Aang how to stop an oncoming rock. She blindfolded him, thereby urging him to sense the vibrations in the earth as she did, and rolled a boulder down a steep hill toward him. Fearing injury, Aang leapt out of the boulder's path at the last second; this action infuriated Toph, who chastised him for showing cowardice.",
      "links": [],
      "text": "Toph decided to teach Aang how to stop an oncoming rock. She blindfolded him, thereby urging him to sense the vibrations in the earth as she did, and rolled a boulder down a steep hill toward him. Fearing injury, Aang leapt out of the boulder's path at the last second; this action infuriated Toph, who chastised him for showing cowardice."
    },
    {
      "body": "Katara tried to console Aang by offering to practice waterbending with him. The two practiced in a nearby marsh where Katara encouraged Aang to face the issue instead of avoiding it. She explained that Aang was working with his opposite element, earth, and thus difficulty was to be met. She surprised Aang by throwing a reed at him, which Aang was able to slice in half with waterbending. Katara congratulated Aang for having reflexes of a waterbending master, and Aang referred to her as \"sifu\", meaning teacher, Katara.",
      "links": [],
      "text": "Katara tried to console Aang by offering to practice waterbending with him. The two practiced in a nearby marsh where Katara encouraged Aang to face the issue instead of avoiding it. She explained that Aang was working with his opposite element, earth, and thus difficulty was to be met. She surprised Aang by throwing a reed at him, which Aang was able to slice in half with waterbending. Katara congratulated Aang for having reflexes of a waterbending master, and Aang referred to her as \"sifu\", meaning teacher, Katara."
    },
    {
      "body": "Toph taunted Aang about his submissiveness by abusing ${link_0}. Aang expressed a desire to be left alone; when Katara approached him, however, concerned that Sokka had not yet returned to the campsite, the Avatar agreed to help search for him. Aang eventually found Sokka wedged in a hole in which he became stuck while hunting. Sokka asked that Aang utilize earthbending in order to free him to which Aang shamefully admitted his failure to earthbend.",
      "links": [
        {
          "body": "his staff",
          "key": "${link_0}",
          "target": {
            "href": "Airbender_staff",
            "page": "Airbender_staff"
          }
        }
      ],
      "text": "Toph taunted Aang about his submissiveness by abusing his staff. Aang expressed a desire to be left alone; when Katara approached him, however, concerned that Sokka had not yet returned to the campsite, the Avatar agreed to help search for him. Aang eventually found Sokka wedged in a hole in which he became stuck while hunting. Sokka asked that Aang utilize earthbending in order to free him to which Aang shamefully admitted his failure to earthbend."
    },
    {
      "body": "After facing the ${link_0} head-on, ${link_1} successfully managed to ${link_2}.",
      "links": [
        {
          "body": "saber-tooth moose lion",
          "key": "${link_0}",
          "target": {
            "href": "Saber-tooth_moose_lion",
            "page": "Saber-tooth_moose_lion"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "earthbend",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "After facing the saber-tooth moose lion head-on, Aang successfully managed to earthbend."
    },
    {
      "body": "The creature that Sokka had been hunting before becoming trapped returned, and Aang identified it as a ${link_0} cub. The mother of the cub suddenly arrived, furious that they were in possession of her child; she started to attack Aang and Sokka. Aang initially tried to avoid the beast, but he eventually faced the mother head-on and drove her away via airbending. Toph, who had been silently observing the conflict, made her presence be known and congratulated Aang on his show of fortitude. Aang demanded his staff be returned and Toph, determining that he possessed the qualities of an earthbender, ordered him to earthbend. Aang complied and, much to his delight, he was able to successfully earthbend.",
      "links": [
        {
          "body": "saber-tooth moose lion",
          "key": "${link_0}",
          "target": {
            "href": "Saber-tooth_moose_lion",
            "page": "Saber-tooth_moose_lion"
          }
        }
      ],
      "text": "The creature that Sokka had been hunting before becoming trapped returned, and Aang identified it as a saber-tooth moose lion cub. The mother of the cub suddenly arrived, furious that they were in possession of her child; she started to attack Aang and Sokka. Aang initially tried to avoid the beast, but he eventually faced the mother head-on and drove her away via airbending. Toph, who had been silently observing the conflict, made her presence be known and congratulated Aang on his show of fortitude. Aang demanded his staff be returned and Toph, determining that he possessed the qualities of an earthbender, ordered him to earthbend. Aang complied and, much to his delight, he was able to successfully earthbend."
    },
    {
      "body": "Each of the members of Aang's group decided to take a \"mini-vacation\", as a way to unwind after all the work they have done; Sokka, on the other hand, thought the group should be working on getting \"intelligence\" on the Fire Nation, most specifically a map for when Aang must hunt down the Fire Lord. The group met Professor ${link_0}, who told them he was searching for a ${link_1} said to be in the middle the ${link_2}; the library, said to have been created by the ${link_3} and his ${link_4}, has more valuable tomes than any other place in the world. Sokka, believing he may be able to get information on the Fire Nation there, dedicated his \"vacation\" to finding the place.",
      "links": [
        {
          "body": "Zei",
          "key": "${link_0}",
          "target": {
            "href": "Zei",
            "page": "Zei"
          }
        },
        {
          "body": "legendary library",
          "key": "${link_1}",
          "target": {
            "href": "Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_2}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        },
        {
          "body": "spirit of knowledge",
          "key": "${link_3}",
          "target": {
            "href": "Wan_Shi_Tong",
            "page": "Wan_Shi_Tong"
          }
        },
        {
          "body": "fox servants",
          "key": "${link_4}",
          "target": {
            "href": "Knowledge_Seekers",
            "page": "Knowledge_Seekers"
          }
        }
      ],
      "text": "Each of the members of Aang's group decided to take a \"mini-vacation\", as a way to unwind after all the work they have done; Sokka, on the other hand, thought the group should be working on getting \"intelligence\" on the Fire Nation, most specifically a map for when Aang must hunt down the Fire Lord. The group met Professor Zei, who told them he was searching for a legendary library said to be in the middle the Si Wong Desert; the library, said to have been created by the spirit of knowledge and his fox servants, has more valuable tomes than any other place in the world. Sokka, believing he may be able to get information on the Fire Nation there, dedicated his \"vacation\" to finding the place."
    },
    {
      "body": "Flying on Appa, the group soon found the library, which was buried in the sand, except for its single, highest tower. Aang, Katara, Sokka, Momo, and Professor Zei used a window to enter the library; Appa stayed outside, of course, as did Toph, who cannot read since she is blind. Toph also mentioned that, because of the desert sand, she could not feel the vibrations in the ground as well as she normally could and thus her seismic sense was impaired.",
      "links": [],
      "text": "Flying on Appa, the group soon found the library, which was buried in the sand, except for its single, highest tower. Aang, Katara, Sokka, Momo, and Professor Zei used a window to enter the library; Appa stayed outside, of course, as did Toph, who cannot read since she is blind. Toph also mentioned that, because of the desert sand, she could not feel the vibrations in the ground as well as she normally could and thus her seismic sense was impaired."
    },
    {
      "body": "${link_0} descended into ${link_1} to look for information that could help end the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Wan Shi Tong's Library",
          "key": "${link_1}",
          "target": {
            "href": "Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_2}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "Aang descended into Wan Shi Tong's Library to look for information that could help end the Hundred Year War."
    },
    {
      "body": "When the group entered the library, they met the spirit, Wan Shi Tong, who constructed the library. Taking the form of a large owl, the spirit initially did not trust them, disliking the fact that humans use knowledge only to gain an advantage over other humans. He brought up the last human to have discovered his library, who happened to be Admiral Zhao, and believed the group only wanted to get information to help them defeat their enemies. Though there was truth to the spirit's accusation, Aang and his friends were able to convince him otherwise.",
      "links": [],
      "text": "When the group entered the library, they met the spirit, Wan Shi Tong, who constructed the library. Taking the form of a large owl, the spirit initially did not trust them, disliking the fact that humans use knowledge only to gain an advantage over other humans. He brought up the last human to have discovered his library, who happened to be Admiral Zhao, and believed the group only wanted to get information to help them defeat their enemies. Though there was truth to the spirit's accusation, Aang and his friends were able to convince him otherwise."
    },
    {
      "body": "Sokka found a burned paper that mentioned \"the darkest day in Fire Nation history\"; it had a date but no other information. It also turned out that Zhao, before leaving, destroyed every other bit of information about the Fire Nation, probably to prevent exactly what Sokka and the others were trying to do. However, a fox, one of Wan Shi Tong's animal helpers, found the group and led them to a ${link_0}. There, a date could be entered on a stone wheel, which showed the sky on that particular date; when Sokka entered the date of \"the darkest day\", it showed a solar eclipse occurring. The group realized that solar eclipses must weaken or take away firebending, in the same way lunar eclipses affect waterbending; they realized they could use this information to plan ${link_1}.",
      "links": [
        {
          "body": "room dedicated to astronomy",
          "key": "${link_0}",
          "target": {
            "href": "Planetary_calendar_room",
            "page": "Planetary_calendar_room"
          }
        },
        {
          "body": "an attack on the Fire Nation forces",
          "key": "${link_1}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "text": "Sokka found a burned paper that mentioned \"the darkest day in Fire Nation history\"; it had a date but no other information. It also turned out that Zhao, before leaving, destroyed every other bit of information about the Fire Nation, probably to prevent exactly what Sokka and the others were trying to do. However, a fox, one of Wan Shi Tong's animal helpers, found the group and led them to a room dedicated to astronomy. There, a date could be entered on a stone wheel, which showed the sky on that particular date; when Sokka entered the date of \"the darkest day\", it showed a solar eclipse occurring. The group realized that solar eclipses must weaken or take away firebending, in the same way lunar eclipses affect waterbending; they realized they could use this information to plan an attack on the Fire Nation forces."
    },
    {
      "body": "Soon, however, Wan Shi Tong found out their plans and decreed that he will no longer allow humans to misuse his beloved information; he attacked the group, while the library began to sink, that way it will be completely underground forever, taking the knowledge with it. Outside, Toph began to hold up the tower using her earthbending so that the others could escape. However, at the same time, ${link_0} abducted Appa, while Toph found it impossible to hold up the tower and simultaneously fight them. They made off with Appa and escaped.",
      "links": [
        {
          "body": "sandbenders",
          "key": "${link_0}",
          "target": {
            "href": "Sandbender_Tribes",
            "page": "Sandbender_Tribes"
          }
        }
      ],
      "text": "Soon, however, Wan Shi Tong found out their plans and decreed that he will no longer allow humans to misuse his beloved information; he attacked the group, while the library began to sink, that way it will be completely underground forever, taking the knowledge with it. Outside, Toph began to hold up the tower using her earthbending so that the others could escape. However, at the same time, sandbenders abducted Appa, while Toph found it impossible to hold up the tower and simultaneously fight them. They made off with Appa and escaped."
    },
    {
      "body": "${link_0} and ${link_1} discovered an ${link_2} which they used to find the date of the next solar eclipse.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "astronomy room",
          "key": "${link_2}",
          "target": {
            "href": "Planetary_calendar_room",
            "page": "Planetary_calendar_room"
          }
        }
      ],
      "text": "Aang and Sokka discovered an astronomy room which they used to find the date of the next solar eclipse."
    },
    {
      "body": "Inside the library, Aang and Sokka hurriedly tried to use the astronomy room to find the next date of a solar eclipse; it turned out the next one was in a few months. They planned to give this information to the Earth Kingdom armies of Ba Sing Se to help in the War. The group quickly escaped, except for Professor Zei, who said he would rather spend eternity in the library than see it vanish forever. The others had no choice but to leave him. They escaped before the library vanished into the sand. Toph told Aang that Appa had been stolen by sandbenders, and he was completely heartbroken.",
      "links": [],
      "text": "Inside the library, Aang and Sokka hurriedly tried to use the astronomy room to find the next date of a solar eclipse; it turned out the next one was in a few months. They planned to give this information to the Earth Kingdom armies of Ba Sing Se to help in the War. The group quickly escaped, except for Professor Zei, who said he would rather spend eternity in the library than see it vanish forever. The others had no choice but to leave him. They escaped before the library vanished into the sand. Toph told Aang that Appa had been stolen by sandbenders, and he was completely heartbroken."
    },
    {
      "body": "Infuriated, Aang unreasonably blamed Toph for Appa's kidnapping. Seeing how everyone was more focused on making their way through the desert than on his lifelong friend, Aang flew off on his own in search of Appa. Aang's search proved to be fruitless, with him engendering a gigantic mushroom-like cloud in frustration. After returning to the others, the group continued their trek through the endless desert, with Aang acting despondent, if not outright, hostile and bitter over their situation all the way. The group eventually came across an abandoned ${link_0} and compass, which they used to travel to a large rock formation in the desert's center. There, they were attacked by a hive of ${link_1}, one of which Aang viciously struck down after it had attempted to take Momo.",
      "links": [
        {
          "body": "sand-sailer",
          "key": "${link_0}",
          "target": {
            "href": "Sand-sailer",
            "page": "Sand-sailer"
          }
        },
        {
          "body": "buzzard wasps",
          "key": "${link_1}",
          "target": {
            "href": "Buzzard_wasp",
            "page": "Buzzard_wasp"
          }
        }
      ],
      "text": "Infuriated, Aang unreasonably blamed Toph for Appa's kidnapping. Seeing how everyone was more focused on making their way through the desert than on his lifelong friend, Aang flew off on his own in search of Appa. Aang's search proved to be fruitless, with him engendering a gigantic mushroom-like cloud in frustration. After returning to the others, the group continued their trek through the endless desert, with Aang acting despondent, if not outright, hostile and bitter over their situation all the way. The group eventually came across an abandoned sand-sailer and compass, which they used to travel to a large rock formation in the desert's center. There, they were attacked by a hive of buzzard wasps, one of which Aang viciously struck down after it had attempted to take Momo."
    },
    {
      "body": "${link_0} entered the ${link_1} after finding ${link_2}'s kidnapper.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_1}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Appa",
          "key": "${link_2}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Aang entered the Avatar State after finding Appa's kidnapper."
    },
    {
      "body": "The group later encountered the sandbenders themselves, one of whom Toph identified as the person who stole Appa. Aang demanded to know where his bison was, threateningly obliterating their desert sailors one by one before slipping into the Avatar State. The sandbender ${link_0} confessed that he had traded Appa over to some ${link_1} and that he was probably in Ba Sing Se by now where he would be sold. The wind and sands twisted around Aang as he proceeded to fully enter the state. Katara, however, managed to make her way to him and calm him down. Tears rolled down his face as he fell into her arms and out of the Avatar State.",
      "links": [
        {
          "body": "Ghashiun",
          "key": "${link_0}",
          "target": {
            "href": "Ghashiun",
            "page": "Ghashiun"
          }
        },
        {
          "body": "merchants",
          "key": "${link_1}",
          "target": {
            "href": "Beetle-headed_merchants",
            "page": "Beetle-headed_merchants"
          }
        }
      ],
      "text": "The group later encountered the sandbenders themselves, one of whom Toph identified as the person who stole Appa. Aang demanded to know where his bison was, threateningly obliterating their desert sailors one by one before slipping into the Avatar State. The sandbender Ghashiun confessed that he had traded Appa over to some merchants and that he was probably in Ba Sing Se by now where he would be sold. The wind and sands twisted around Aang as he proceeded to fully enter the state. Katara, however, managed to make her way to him and calm him down. Tears rolled down his face as he fell into her arms and out of the Avatar State."
    },
    {
      "body": "After the group got out of the desert, they met a refugee family with a ${link_0} traveling to Ba Sing Se. The group helped the family to an ${link_1} way that led to the city. While there, Sokka and the others were reunited with Kyoshi Warrior, ${link_2}, who was there helping war refugees. Later, the family lost their documents so Aang, Katara, Toph, Sokka, and Suki agreed to help them cross the ${link_3}.",
      "links": [
        {
          "body": "pregnant mother",
          "key": "${link_0}",
          "target": {
            "href": "Ying",
            "page": "Ying"
          }
        },
        {
          "body": "underground ferry",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom_ferry",
            "page": "Earth_Kingdom_ferry"
          }
        },
        {
          "body": "Suki",
          "key": "${link_2}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Serpent's Pass",
          "key": "${link_3}",
          "target": {
            "href": "Serpent%27s_Pass",
            "page": "Serpent%27s_Pass"
          }
        }
      ],
      "text": "After the group got out of the desert, they met a refugee family with a pregnant mother traveling to Ba Sing Se. The group helped the family to an underground ferry way that led to the city. While there, Sokka and the others were reunited with Kyoshi Warrior, Suki, who was there helping war refugees. Later, the family lost their documents so Aang, Katara, Toph, Sokka, and Suki agreed to help them cross the Serpent's Pass."
    },
    {
      "body": "As the group traveled along a sheer cliff side of the pass, Suki pointed out Fire Nation forces patrolling the water, telling them that they were rumored to be working on a secret project. As they continued, ${link_0} fell when the ground underneath him crumbled. Toph saved him, but the falling rocks drew the attention of the patrol ship, which launched a fireball at them. Aang leaped into action, knocking the ball back and striking their engines. The ship returned fire, hitting the rock face above them and sending debris falling toward Suki. Sokka pushed Suki out of the way, and Toph saved him by deflecting the rocks. Sokka was too worried about Suki's safety to be thankful to Toph for saving his life, which greatly annoyed her. The group ran to the shelter of an outcropping rock, leaving the ship behind to tend to its damage.",
      "links": [
        {
          "body": "Than",
          "key": "${link_0}",
          "target": {
            "href": "Than",
            "page": "Than"
          }
        }
      ],
      "text": "As the group traveled along a sheer cliff side of the pass, Suki pointed out Fire Nation forces patrolling the water, telling them that they were rumored to be working on a secret project. As they continued, Than fell when the ground underneath him crumbled. Toph saved him, but the falling rocks drew the attention of the patrol ship, which launched a fireball at them. Aang leaped into action, knocking the ball back and striking their engines. The ship returned fire, hitting the rock face above them and sending debris falling toward Suki. Sokka pushed Suki out of the way, and Toph saved him by deflecting the rocks. Sokka was too worried about Suki's safety to be thankful to Toph for saving his life, which greatly annoyed her. The group ran to the shelter of an outcropping rock, leaving the ship behind to tend to its damage."
    },
    {
      "body": "When the group stopped for the night, Aang was one of the only ones not sleeping. Katara tried telling him that it was okay for him to miss his sky bison and asked why he was acting so distant. Aang reminded her that he was so upset about losing Appa that he could not control himself and that he hated feeling like that. Katara tried reasoning with him and told him that he was not letting himself feel anything now and that sometimes it hurts to care. Katara tried to get Aang to promise that he would not stop caring about Appa and offered him a hug. He declined and walked away, leaving Katara disappointed.",
      "links": [],
      "text": "When the group stopped for the night, Aang was one of the only ones not sleeping. Katara tried telling him that it was okay for him to miss his sky bison and asked why he was acting so distant. Aang reminded her that he was so upset about losing Appa that he could not control himself and that he hated feeling like that. Katara tried reasoning with him and told him that he was not letting himself feel anything now and that sometimes it hurts to care. Katara tried to get Aang to promise that he would not stop caring about Appa and offered him a hug. He declined and walked away, leaving Katara disappointed."
    },
    {
      "body": "${link_0} fought the ${link_1} with ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "serpent",
          "key": "${link_1}",
          "target": {
            "href": "Serpent",
            "page": "Serpent"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Aang fought the serpent with Katara."
    },
    {
      "body": "The next morning, Aang's group came to a large setback: A portion of the pass was currently underwater. Katara stepped forward, parting the waters to allow them to pass. As the path got deeper, Aang helped her, forming a bubble of air for them to walk underwater safely. Momo, seeing a fish swimming by, jumped out into the water to catch it, but quickly jumped back in when something huge swam by. As it turned out, the Serpent's Pass was named and feared not for its shape, but for the ${link_0} that swam in the surrounding waters. The serpent attacked the bubble, forcing Toph to raise the sea floor under their feet to bring them up to the surface. This stranded them in the middle of the water, with the serpent circling around. Aang attacked the serpent, telling Katara to get the others across while he distracted it. Katara created an ice bridge for the others to cross, before leaping to help Aang without a second thought. Together, Aang and Katara managed to drive off the serpent, using currents to slam it into the cliff. When the group finally crossed the Serpent's Pass, Ying went into labor. Katara, who had had experience in birthing children, quickly took charge, despite having Sokka pass out like an old lady in the process.",
      "links": [
        {
          "body": "gigantic sea serpent",
          "key": "${link_0}",
          "target": {
            "href": "Serpent",
            "page": "Serpent"
          }
        }
      ],
      "text": "The next morning, Aang's group came to a large setback: A portion of the pass was currently underwater. Katara stepped forward, parting the waters to allow them to pass. As the path got deeper, Aang helped her, forming a bubble of air for them to walk underwater safely. Momo, seeing a fish swimming by, jumped out into the water to catch it, but quickly jumped back in when something huge swam by. As it turned out, the Serpent's Pass was named and feared not for its shape, but for the gigantic sea serpent that swam in the surrounding waters. The serpent attacked the bubble, forcing Toph to raise the sea floor under their feet to bring them up to the surface. This stranded them in the middle of the water, with the serpent circling around. Aang attacked the serpent, telling Katara to get the others across while he distracted it. Katara created an ice bridge for the others to cross, before leaping to help Aang without a second thought. Together, Aang and Katara managed to drive off the serpent, using currents to slam it into the cliff. When the group finally crossed the Serpent's Pass, Ying went into labor. Katara, who had had experience in birthing children, quickly took charge, despite having Sokka pass out like an old lady in the process."
    },
    {
      "body": "The baby, a girl, was born with no complications, thanks to Katara. Aang, seeing the family coming together, renewed his hope, which was what the family decided to name the ${link_0}. Aang chose to go on ahead of the group to find Appa, but before he went, he told Katara how he felt about her. Katara let a few tears run down her cheeks, and she and Aang embraced in a hug before he and Momo left to look for Appa. Aang and Momo flew over to the wall of Ba Sing Se, where they made a terrible discovery: a ${link_1}, escorted by ${link_2}, was approaching the wall.",
      "links": [
        {
          "body": "baby",
          "key": "${link_0}",
          "target": {
            "href": "Hope",
            "page": "Hope"
          }
        },
        {
          "body": "massive drill",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        },
        {
          "body": "tundra tanks",
          "key": "${link_2}",
          "target": {
            "href": "Tundra_tank",
            "page": "Tundra_tank"
          }
        }
      ],
      "text": "The baby, a girl, was born with no complications, thanks to Katara. Aang, seeing the family coming together, renewed his hope, which was what the family decided to name the baby. Aang chose to go on ahead of the group to find Appa, but before he went, he told Katara how he felt about her. Katara let a few tears run down her cheeks, and she and Aang embraced in a hug before he and Momo left to look for Appa. Aang and Momo flew over to the wall of Ba Sing Se, where they made a terrible discovery: a massive drill, escorted by tundra tanks, was approaching the wall."
    },
    {
      "body": "${link_0} successfully managed to destroy the ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Fire Nation drill",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        }
      ],
      "text": "Aang successfully managed to destroy the Fire Nation drill."
    },
    {
      "body": "After Aang reunited with his friends and they met with General ${link_0}, the group tried to figure out a way to destroy the drill. Sokka eventually got the idea of taking it out by striking it from the inside, on its pressure points. While Toph tried to slow it down from the outside, Aang, Katara and Sokka sneaked inside to sabotage the drill. After ambushing an engineer and finding a set of blueprints, the group figured out that they needed to cut through the braces that hold the machine together with waterbending. After long and exhausting work, Katara and Aang only managed to cut through one brace. Knowing that they will never destroy the drill in time at this rate, Aang remembered what Toph had been teaching him and suggested they only cut partway through the braces beofre delivering a final blow at the top.",
      "links": [
        {
          "body": "Sung",
          "key": "${link_0}",
          "target": {
            "href": "Sung",
            "page": "Sung"
          }
        }
      ],
      "text": "After Aang reunited with his friends and they met with General Sung, the group tried to figure out a way to destroy the drill. Sokka eventually got the idea of taking it out by striking it from the inside, on its pressure points. While Toph tried to slow it down from the outside, Aang, Katara and Sokka sneaked inside to sabotage the drill. After ambushing an engineer and finding a set of blueprints, the group figured out that they needed to cut through the braces that hold the machine together with waterbending. After long and exhausting work, Katara and Aang only managed to cut through one brace. Knowing that they will never destroy the drill in time at this rate, Aang remembered what Toph had been teaching him and suggested they only cut partway through the braces beofre delivering a final blow at the top."
    },
    {
      "body": "Later, just as they decided that they had cut through enough braces to go to the top, the group was attacked by Azula, Mai and Ty Lee. Deciding to split up, Sokka and Katara tried to leave the drill while Aang went to deliver the final blow. When he got to the top, he found the Earth Kingdom soldiers dropping boulders on the drill and him. After cutting a wedge in the metal with waterbending, he shaped one of the boulders into a spike. Just as he was finished carving the wedge, he was attacked by Azula, resulting a furious duel, during which Aang was briefly knocked unconscious and almost fell off the drill. He managed to run part way up the wall and destroyed the war machine, splattering the wall and the spectators atop it, specifically the general, with muddy water.",
      "links": [],
      "text": "Later, just as they decided that they had cut through enough braces to go to the top, the group was attacked by Azula, Mai and Ty Lee. Deciding to split up, Sokka and Katara tried to leave the drill while Aang went to deliver the final blow. When he got to the top, he found the Earth Kingdom soldiers dropping boulders on the drill and him. After cutting a wedge in the metal with waterbending, he shaped one of the boulders into a spike. Just as he was finished carving the wedge, he was attacked by Azula, resulting a furious duel, during which Aang was briefly knocked unconscious and almost fell off the drill. He managed to run part way up the wall and destroyed the war machine, splattering the wall and the spectators atop it, specifically the general, with muddy water."
    },
    {
      "body": "Riding the monorail, the group finally entered Ba Sing Se, the city larger than they had imagined. Soon after they arrived, Aang and his friends met ${link_0}, a cheerful, incessantly smiling woman assigned to guide them around the city. Attempts by Sokka to coax their guide to talk about the war and a possible audience with the ${link_1} were invariably ignored.",
      "links": [
        {
          "body": "Joo Dee",
          "key": "${link_0}",
          "target": {
            "href": "Joo_Dee",
            "page": "Joo_Dee"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_1}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "Riding the monorail, the group finally entered Ba Sing Se, the city larger than they had imagined. Soon after they arrived, Aang and his friends met Joo Dee, a cheerful, incessantly smiling woman assigned to guide them around the city. Attempts by Sokka to coax their guide to talk about the war and a possible audience with the Earth King were invariably ignored."
    },
    {
      "body": "In the ${link_0}, Aang and his group were taken to their new ${link_1}. They soon learned that gaining an audience with the Earth King would be postponed at least a month. It soon became apparent that within the walls of the city, no one was willing to discuss the war raging in the rest of the world. Even Aang's attempts to find Appa did not bear any fruit as nobody seemed willing to divulge any information to them, due to some meaningful glances from Joo Dee. Along the way, they also saw members of the ${link_2} — elite guards who ensured the safety of Ba Sing Se's culture and society.",
      "links": [
        {
          "body": "Upper Ring",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se#Upper_Ring",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "home",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar%27s_Upper_Ring_house",
            "page": "Team_Avatar%27s_Upper_Ring_house"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_2}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "In the Upper Ring, Aang and his group were taken to their new home. They soon learned that gaining an audience with the Earth King would be postponed at least a month. It soon became apparent that within the walls of the city, no one was willing to discuss the war raging in the rest of the world. Even Aang's attempts to find Appa did not bear any fruit as nobody seemed willing to divulge any information to them, due to some meaningful glances from Joo Dee. Along the way, they also saw members of the Dai Li — elite guards who ensured the safety of Ba Sing Se's culture and society."
    },
    {
      "body": "${link_0} and ${link_1} sneaked into the ${link_2}'s party as servants.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_2}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "Aang and Sokka sneaked into the Earth King's party as servants."
    },
    {
      "body": "Upon learning of a party being hosted at the palace, Katara devised a plan to sneak into the event with Toph to receive an audience with the Earth King. After Katara and Toph managed to gain entrance into the party, Aang and Sokka were able to infiltrate the palace themselves, disguised as servants. Aang was soon exposed as the Avatar, but he quickly smoothed things over with a display of his abilities to entertain the audience. When the Earth King arrived, Aang rushed over eagerly to greet him, but was confronted by ${link_0}, who revealed himself to be the Grand Secretariat of the Earth King and head of the Dai Li. Aang was led to a room where the rest of Team Avatar had been brought.",
      "links": [
        {
          "body": "Long Feng",
          "key": "${link_0}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        }
      ],
      "text": "Upon learning of a party being hosted at the palace, Katara devised a plan to sneak into the event with Toph to receive an audience with the Earth King. After Katara and Toph managed to gain entrance into the party, Aang and Sokka were able to infiltrate the palace themselves, disguised as servants. Aang was soon exposed as the Avatar, but he quickly smoothed things over with a display of his abilities to entertain the audience. When the Earth King arrived, Aang rushed over eagerly to greet him, but was confronted by Long Feng, who revealed himself to be the Grand Secretariat of the Earth King and head of the Dai Li. Aang was led to a room where the rest of Team Avatar had been brought."
    },
    {
      "body": "Inside Long Feng's chamber, Sokka tried to discuss the upcoming solar eclipse, but was abruptly cut off by Long Feng. Long Feng explained that in order to preserve the culture and utopian life within the walls of Ba Sing Se, no mention of the war was permitted. It was also revealed that Long Feng was in charge of handling day-to-day affairs in the city, including all military matters; the king himself was no more than a figurehead, a beloved icon. When Aang threatened to tell everyone about the war, Long Feng countered with threats to expel them from the city. He went on to say that if Aang persisted, he may never find his missing bison again. The group was soon escorted out by a woman who called herself Joo Dee, but was not the one whom they initially had met.",
      "links": [],
      "text": "Inside Long Feng's chamber, Sokka tried to discuss the upcoming solar eclipse, but was abruptly cut off by Long Feng. Long Feng explained that in order to preserve the culture and utopian life within the walls of Ba Sing Se, no mention of the war was permitted. It was also revealed that Long Feng was in charge of handling day-to-day affairs in the city, including all military matters; the king himself was no more than a figurehead, a beloved icon. When Aang threatened to tell everyone about the war, Long Feng countered with threats to expel them from the city. He went on to say that if Aang persisted, he may never find his missing bison again. The group was soon escorted out by a woman who called herself Joo Dee, but was not the one whom they initially had met."
    },
    {
      "body": "${link_0} herded the ${link_1} from the ${link_2} into their new enclosure.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "animals",
          "key": "${link_1}",
          "target": {
            "href": "Fauna_in_the_World_of_Avatar",
            "page": "Fauna_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Ba Sing Se Zoo",
          "key": "${link_2}",
          "target": {
            "href": "Ba_Sing_Se_Zoo",
            "page": "Ba_Sing_Se_Zoo"
          }
        }
      ],
      "text": "Aang herded the animals from the Ba Sing Se Zoo into their new enclosure."
    },
    {
      "body": "While residing in the city, Aang flew high over Ba Sing Se one day and landed at a ${link_0} to look for Appa. Glancing around, he saw a wide variety of animals, all of which were miserable in their small cages. Many of them were partially starved and hungry. ${link_1}, the zookeeper, told Aang that the zoo no longer received funding from the Dai Li because it was not popular with the children. However, in a circle of troubles, nobody came to the zoo because it did not receive the funding and was quite filthy; one of the cages showed an animal lying near multiple piles of feces. Kenji expressed his desire to let his animals run freely in open spaces. Aang suggested moving the animals to an open area just outside the city.",
      "links": [
        {
          "body": "small zoo",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se_Zoo",
            "page": "Ba_Sing_Se_Zoo"
          }
        },
        {
          "body": "Kenji",
          "key": "${link_1}",
          "target": {
            "href": "Kenji",
            "page": "Kenji"
          }
        }
      ],
      "text": "While residing in the city, Aang flew high over Ba Sing Se one day and landed at a small zoo to look for Appa. Glancing around, he saw a wide variety of animals, all of which were miserable in their small cages. Many of them were partially starved and hungry. Kenji, the zookeeper, told Aang that the zoo no longer received funding from the Dai Li because it was not popular with the children. However, in a circle of troubles, nobody came to the zoo because it did not receive the funding and was quite filthy; one of the cages showed an animal lying near multiple piles of feces. Kenji expressed his desire to let his animals run freely in open spaces. Aang suggested moving the animals to an open area just outside the city."
    },
    {
      "body": "The animals proved much more difficult to control than Aang had originally thought, and they ended up running wildly around the city, terrorizing the citizenry. ${link_0} destroyed a shop, various animals attacked the citizens, and the ${link_1} had his cabbages eaten by a ${link_2}. In an attempt to restore order, Aang pulled out his ${link_3} and blew a huge burst of air through it using airbending. He hopped on an air scooter as the animals ran after him, drawn by the whistle's call.",
      "links": [
        {
          "body": "Hog monkeys",
          "key": "${link_0}",
          "target": {
            "href": "Hog_monkey",
            "page": "Hog_monkey"
          }
        },
        {
          "body": "cabbage merchant",
          "key": "${link_1}",
          "target": {
            "href": "Cabbage_merchant",
            "page": "Cabbage_merchant"
          }
        },
        {
          "body": "rabaroo",
          "key": "${link_2}",
          "target": {
            "href": "Rabaroo",
            "page": "Rabaroo"
          }
        },
        {
          "body": "bison whistle",
          "key": "${link_3}",
          "target": {
            "href": "Bison_whistle",
            "page": "Bison_whistle"
          }
        }
      ],
      "text": "The animals proved much more difficult to control than Aang had originally thought, and they ended up running wildly around the city, terrorizing the citizenry. Hog monkeys destroyed a shop, various animals attacked the citizens, and the cabbage merchant had his cabbages eaten by a rabaroo. In an attempt to restore order, Aang pulled out his bison whistle and blew a huge burst of air through it using airbending. He hopped on an air scooter as the animals ran after him, drawn by the whistle's call."
    },
    {
      "body": "Meanwhile, Kenji frantically tried to persuade the guards to open the city gates. They refused until they saw the oncoming stampede. Once the gates were open and Aang reached the other side, he used earthbending to create a wall around the animals. He also earthbent paths, secluded areas, and habitat accessories, thus successfully constructing a new facility. Children and their families came flocking to the new zoo, and the zookeeper thanked Aang for his help. Kenji told Aang he should work with animals for a living. However, the zoo animals were not the only creatures that followed the sound of the whistle; many ${link_0}, ${link_1}, and hybrid cat-dogs were also inside the animal pens. Afterward, Kenji decided that Aang should \"stick to saving people\".",
      "links": [
        {
          "body": "cats",
          "key": "${link_0}",
          "target": {
            "href": "Cat",
            "page": "Cat"
          }
        },
        {
          "body": "dogs",
          "key": "${link_1}",
          "target": {
            "href": "Dog",
            "page": "Dog"
          }
        }
      ],
      "text": "Meanwhile, Kenji frantically tried to persuade the guards to open the city gates. They refused until they saw the oncoming stampede. Once the gates were open and Aang reached the other side, he used earthbending to create a wall around the animals. He also earthbent paths, secluded areas, and habitat accessories, thus successfully constructing a new facility. Children and their families came flocking to the new zoo, and the zookeeper thanked Aang for his help. Kenji told Aang he should work with animals for a living. However, the zoo animals were not the only creatures that followed the sound of the whistle; many cats, dogs, and hybrid cat-dogs were also inside the animal pens. Afterward, Kenji decided that Aang should \"stick to saving people\"."
    },
    {
      "body": "${link_0} had flyers made to help them locate the missing ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Aang had flyers made to help them locate the missing Appa."
    },
    {
      "body": "At Team Avatar's temporary home in Ba Sing Se, Sokka was attempting to draw pictures of Appa, but Aang and Katara burst in with a stack of professionally-made posters they had a printer make featuring much better pictures of the lost bison than Sokka's crude drawings. The group planned on spreading the flyers all over the city, hoping someone will have some information. Aang spread these posters by flying on his glider and dropping them throughout the city.",
      "links": [],
      "text": "At Team Avatar's temporary home in Ba Sing Se, Sokka was attempting to draw pictures of Appa, but Aang and Katara burst in with a stack of professionally-made posters they had a printer make featuring much better pictures of the lost bison than Sokka's crude drawings. The group planned on spreading the flyers all over the city, hoping someone will have some information. Aang spread these posters by flying on his glider and dropping them throughout the city."
    },
    {
      "body": "Later, Aang returned home, impatient to see if the flyers had had any success. He sat down on the floor, after Katara mentioned it only being the first day of the flyers being passed out. There was suddenly a knock on the door after the first second that Aang had sat down for. Aang's whole face lit up and he said, \"Wow, patience really does pay off!\" The visitor turned out to be the original Joo Dee, holding one of the posters. When confronted about her absence, she explained that she took a short vacation to ${link_0}. She informed the group that dropping fliers without clearance was against the rules. Aang felt that he had had quite enough of the \"rules\" and told Joo Dee off, saying that he intended to find Appa, and that she should stay out of his way. Sokka replied that may come back to bite them in the blubber. Toph was elated at the opportunity to break the rules and expressed this joy by breaking the side wall of their home with earthbending.",
      "links": [
        {
          "body": "Lake Laogai",
          "key": "${link_0}",
          "target": {
            "href": "Lake_Laogai",
            "page": "Lake_Laogai"
          }
        }
      ],
      "text": "Later, Aang returned home, impatient to see if the flyers had had any success. He sat down on the floor, after Katara mentioned it only being the first day of the flyers being passed out. There was suddenly a knock on the door after the first second that Aang had sat down for. Aang's whole face lit up and he said, \"Wow, patience really does pay off!\" The visitor turned out to be the original Joo Dee, holding one of the posters. When confronted about her absence, she explained that she took a short vacation to Lake Laogai. She informed the group that dropping fliers without clearance was against the rules. Aang felt that he had had quite enough of the \"rules\" and told Joo Dee off, saying that he intended to find Appa, and that she should stay out of his way. Sokka replied that may come back to bite them in the blubber. Toph was elated at the opportunity to break the rules and expressed this joy by breaking the side wall of their home with earthbending."
    },
    {
      "body": "Out in the city, the gang was setting up more posters when Katara ran into ${link_0}. He told her that he wanted to help, but Katara distrusted him and attacked. Jet deflected her attacks and tried to prove his honesty by dropping his hook swords. The others arrived, drawn by the noise, and Jet tried again to explain himself. Jet promptly showed them a flyer. Toph, reading Jet's heartbeat and breathing patterns through the ground, pronounced that he was telling the truth.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        }
      ],
      "text": "Out in the city, the gang was setting up more posters when Katara ran into Jet. He told her that he wanted to help, but Katara distrusted him and attacked. Jet deflected her attacks and tried to prove his honesty by dropping his hook swords. The others arrived, drawn by the noise, and Jet tried again to explain himself. Jet promptly showed them a flyer. Toph, reading Jet's heartbeat and breathing patterns through the ground, pronounced that he was telling the truth."
    },
    {
      "body": "On their way out, the group was sidetracked when ${link_0} and ${link_1}, the other Freedom Fighters, happened to cross their path. Katara once again confronted Jet, as he had claimed to have left the gang behind. Jet insisted that he had been living alone in the city, but Smellerbee claimed that he was dragged away by the Dai Li. Toph realized they were both telling the truth, even though their stories did not match. Sokka quickly figured that Jet had been ${link_2} by the Dai Li.",
      "links": [
        {
          "body": "Smellerbee",
          "key": "${link_0}",
          "target": {
            "href": "Smellerbee",
            "page": "Smellerbee"
          }
        },
        {
          "body": "Longshot",
          "key": "${link_1}",
          "target": {
            "href": "Longshot",
            "page": "Longshot"
          }
        },
        {
          "body": "brainwashed",
          "key": "${link_2}",
          "target": {
            "href": "Brainwashing",
            "page": "Brainwashing"
          }
        }
      ],
      "text": "On their way out, the group was sidetracked when Smellerbee and Longshot, the other Freedom Fighters, happened to cross their path. Katara once again confronted Jet, as he had claimed to have left the gang behind. Jet insisted that he had been living alone in the city, but Smellerbee claimed that he was dragged away by the Dai Li. Toph realized they were both telling the truth, even though their stories did not match. Sokka quickly figured that Jet had been brainwashed by the Dai Li."
    },
    {
      "body": "The group made their way to Lake Laogai the next day, and Toph quickly found and uncovered the underwater entrance. The gang found themselves confronted by Long Feng and several Dai Li agents, and a battle quickly ensued. Toph showed the true mastery of earthbending when she incredibly took down several Dai Li agents. Long Feng managed to escape, with Aang and Jet in hot pursuit. Long Feng tried to make one last bargain with Aang, to leave the city immediately in exchange for their freedom and Appa, but he and Jet refused. Long Feng told Jet the same sentence he told Joo Dee earlier, and, like the hostess, his eyes went blank, and Jet turned on Aang.",
      "links": [],
      "text": "The group made their way to Lake Laogai the next day, and Toph quickly found and uncovered the underwater entrance. The gang found themselves confronted by Long Feng and several Dai Li agents, and a battle quickly ensued. Toph showed the true mastery of earthbending when she incredibly took down several Dai Li agents. Long Feng managed to escape, with Aang and Jet in hot pursuit. Long Feng tried to make one last bargain with Aang, to leave the city immediately in exchange for their freedom and Appa, but he and Jet refused. Long Feng told Jet the same sentence he told Joo Dee earlier, and, like the hostess, his eyes went blank, and Jet turned on Aang."
    },
    {
      "body": "${link_0} evaded a ${link_1} ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "mind-controlled",
          "key": "${link_1}",
          "target": {
            "href": "Brainwashing",
            "page": "Brainwashing"
          }
        },
        {
          "body": "Jet",
          "key": "${link_2}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        }
      ],
      "text": "Aang evaded a mind-controlled Jet."
    },
    {
      "body": "Aang was trying to get Jet to snap out of his trance, while avoiding his attacks. He finally got through to him by reminding him of his past as a Freedom Fighter. The memories of his old comrades awoke Jet, and he hurled one of his hook swords at Long Feng, who dodged and retaliated with earthbending. After dealing a grievous blow to Jet, Long Feng escaped as the others entered the chamber. Katara tried to ${link_0} Jet and realized just how badly he was injured. Longshot, speaking to Team Avatar for the first time, told Aang and his group that they should go and find Appa and leave Jet to Smellerbee and himself. Jet tried to assure Katara that he would be fine, but as they left, Toph sorrowfully claimed that Jet was dying. As the four exited the room, Smellerbee tended to Jet while Longshot pointed his bow at the doorway in case Dai Li agents enter the room.",
      "links": [
        {
          "body": "heal",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "Aang was trying to get Jet to snap out of his trance, while avoiding his attacks. He finally got through to him by reminding him of his past as a Freedom Fighter. The memories of his old comrades awoke Jet, and he hurled one of his hook swords at Long Feng, who dodged and retaliated with earthbending. After dealing a grievous blow to Jet, Long Feng escaped as the others entered the chamber. Katara tried to heal Jet and realized just how badly he was injured. Longshot, speaking to Team Avatar for the first time, told Aang and his group that they should go and find Appa and leave Jet to Smellerbee and himself. Jet tried to assure Katara that he would be fine, but as they left, Toph sorrowfully claimed that Jet was dying. As the four exited the room, Smellerbee tended to Jet while Longshot pointed his bow at the doorway in case Dai Li agents enter the room."
    },
    {
      "body": "Team Avatar finally reached Appa's cell, only to find the chains broken, and Appa gone. Thinking that Long Feng had taken him, they rushed back to the surface, only to find themselves surrounded by the Dai Li. Momo suddenly took off into the sky, only to have Appa come down and break through the Dai Li trap. Long Feng tried to attack Appa, only to have his foot caught in Appa's mouth, with the bison throwing him into the lake. Long Feng's body skipped three times on the water before sinking, followed by Appa spitting out one of his shoes. Aang and the others joyfully reunited with the flying bison. As Team Avatar flew away, Katara looked back at the lake, deeply saddened by Jet. The group subsequently shared a reassuring hug.",
      "links": [],
      "text": "Team Avatar finally reached Appa's cell, only to find the chains broken, and Appa gone. Thinking that Long Feng had taken him, they rushed back to the surface, only to find themselves surrounded by the Dai Li. Momo suddenly took off into the sky, only to have Appa come down and break through the Dai Li trap. Long Feng tried to attack Appa, only to have his foot caught in Appa's mouth, with the bison throwing him into the lake. Long Feng's body skipped three times on the water before sinking, followed by Appa spitting out one of his shoes. Aang and the others joyfully reunited with the flying bison. As Team Avatar flew away, Katara looked back at the lake, deeply saddened by Jet. The group subsequently shared a reassuring hug."
    },
    {
      "body": "${link_0} eventually reunited with ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Aang eventually reunited with Appa."
    },
    {
      "body": "Less than an hour later, Aang and his friends were on a small island recovering and discussing what they should do. Katara and Toph both wanted to leave Ba Sing Se, as they had found Appa and thus had no reason to remain there. On the other hand, Sokka wanted to stay to inform the Earth King of all that was taking place within Ba Sing Se, as well as the approaching solar eclipse, as this was their entire reason for heading toward Ba Sing Se in the first place. Aang agreed with him. Ultimately, the others agreed to do so, and all four rode Appa back to Ba Sing Se's Upper Ring and managed to break into the palace, tearing their way through the Royal Guards despite a strong defense.",
      "links": [],
      "text": "Less than an hour later, Aang and his friends were on a small island recovering and discussing what they should do. Katara and Toph both wanted to leave Ba Sing Se, as they had found Appa and thus had no reason to remain there. On the other hand, Sokka wanted to stay to inform the Earth King of all that was taking place within Ba Sing Se, as well as the approaching solar eclipse, as this was their entire reason for heading toward Ba Sing Se in the first place. Aang agreed with him. Ultimately, the others agreed to do so, and all four rode Appa back to Ba Sing Se's Upper Ring and managed to break into the palace, tearing their way through the Royal Guards despite a strong defense."
    },
    {
      "body": "At the palace, Aang and his friends finally reached the Earth King's throne room, where they were encountered by Long Feng and many Dai Li, who stood before the Earth King as a last defense. They attempted to inform the king about the war, of which he knew nothing, and Long Feng's ${link_0}, but had difficulty due to their position as well as his trust in his advisor. Long Feng attempted to arrest them, until the Earth King realized that Aang was the Avatar; he decided it best to at least hear out Aang and his friends after seeing his pet bear, ${link_1}, acting friendly toward the child.",
      "links": [
        {
          "body": "conspiracy",
          "key": "${link_0}",
          "target": {
            "href": "Conspiracy_of_Ba_Sing_Se",
            "page": "Conspiracy_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Bosco",
          "key": "${link_1}",
          "target": {
            "href": "Bosco",
            "page": "Bosco"
          }
        }
      ],
      "text": "At the palace, Aang and his friends finally reached the Earth King's throne room, where they were encountered by Long Feng and many Dai Li, who stood before the Earth King as a last defense. They attempted to inform the king about the war, of which he knew nothing, and Long Feng's conspiracy, but had difficulty due to their position as well as his trust in his advisor. Long Feng attempted to arrest them, until the Earth King realized that Aang was the Avatar; he decided it best to at least hear out Aang and his friends after seeing his pet bear, Bosco, acting friendly toward the child."
    },
    {
      "body": "Aang went on to explain the various events going on that the Earth King was unaware of: a war outside Ba Sing Se's walls, Long Feng and the Dai Li's conspiracy, the imprisonment of Appa and the brainwashing of Jet and countless other individuals. Long Feng denied all the charges brought against him, even claiming that he had never even encountered a Sky Bison. As the Earth King pondered over the apparently unlikely allegations, Long Feng whispered in his ear that Aang and his friends were part of an \"anarchist cell\" attempting to overthrow him. The Dai Li bound the group with earthbending, and the Earth King ordered the group to be detained, but Sokka had an epiphany, and with Aang's airbending, exposed a bite mark that Long Feng received from Appa in their encounter at Lake Laogai. Long Feng claimed it was a birth mark, but Aang produced Appa to compare the mark to the bison's teeth. The Earth King was unconvinced of the larger accusations of conspiracy in the city, but expressed a willingness to investigate more closely into the matter. Long Feng frowned sourly at all this and shuffled off quietly with his Dai Li.",
      "links": [],
      "text": "Aang went on to explain the various events going on that the Earth King was unaware of: a war outside Ba Sing Se's walls, Long Feng and the Dai Li's conspiracy, the imprisonment of Appa and the brainwashing of Jet and countless other individuals. Long Feng denied all the charges brought against him, even claiming that he had never even encountered a Sky Bison. As the Earth King pondered over the apparently unlikely allegations, Long Feng whispered in his ear that Aang and his friends were part of an \"anarchist cell\" attempting to overthrow him. The Dai Li bound the group with earthbending, and the Earth King ordered the group to be detained, but Sokka had an epiphany, and with Aang's airbending, exposed a bite mark that Long Feng received from Appa in their encounter at Lake Laogai. Long Feng claimed it was a birth mark, but Aang produced Appa to compare the mark to the bison's teeth. The Earth King was unconvinced of the larger accusations of conspiracy in the city, but expressed a willingness to investigate more closely into the matter. Long Feng frowned sourly at all this and shuffled off quietly with his Dai Li."
    },
    {
      "body": "The Earth King arrived at the Outer Wall and was shocked to see the remains of the Fire Nation's drill leading right up to and through Ba Sing Se's Outer Wall. Long Feng made a hurried attempt to pass the drill off as part of a construction project, but the Earth King was clearly unconvinced and ordered the Dai Li to arrest Long Feng. The two Dai Li agents accompanying Long Feng shared a conspiratorial glance and bound Long Feng's arms with metal manacles. When they returned to the palace, he also agreed, after some persuasion to support Sokka's plan to invade the Fire Nation on the day of the solar eclipse, dubbed by Sokka \"The Day of Black Sun\", when the Fire Nation will be helpless.",
      "links": [],
      "text": "The Earth King arrived at the Outer Wall and was shocked to see the remains of the Fire Nation's drill leading right up to and through Ba Sing Se's Outer Wall. Long Feng made a hurried attempt to pass the drill off as part of a construction project, but the Earth King was clearly unconvinced and ordered the Dai Li to arrest Long Feng. The two Dai Li agents accompanying Long Feng shared a conspiratorial glance and bound Long Feng's arms with metal manacles. When they returned to the palace, he also agreed, after some persuasion to support Sokka's plan to invade the Fire Nation on the day of the solar eclipse, dubbed by Sokka \"The Day of Black Sun\", when the Fire Nation will be helpless."
    },
    {
      "body": "The Earth King's top generals, the ${link_0}, raided Long Feng's office and discovered files about every person in Ba Sing Se, including Aang and his friends. Included was the note from Guru Pathik that was attached to Appa's horn prior to his capture, informing Aang that he could teach him how to control the Avatar State; a letter from Toph's mother, saying she was in the city and wanted to meet her daughter; and an intelligence report giving the location of ${link_1} ${link_2} led by ${link_3}, Sokka and Katara's father.",
      "links": [
        {
          "body": "Council of Five",
          "key": "${link_0}",
          "target": {
            "href": "Council_of_Five",
            "page": "Council_of_Five"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "warriors",
          "key": "${link_2}",
          "target": {
            "href": "Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        },
        {
          "body": "Hakoda",
          "key": "${link_3}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        }
      ],
      "text": "The Earth King's top generals, the Council of Five, raided Long Feng's office and discovered files about every person in Ba Sing Se, including Aang and his friends. Included was the note from Guru Pathik that was attached to Appa's horn prior to his capture, informing Aang that he could teach him how to control the Avatar State; a letter from Toph's mother, saying she was in the city and wanted to meet her daughter; and an intelligence report giving the location of Water Tribe warriors led by Hakoda, Sokka and Katara's father."
    },
    {
      "body": "${link_0} fought against the ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Royal Earthbender Guards",
          "key": "${link_1}",
          "target": {
            "href": "Royal_Earthbender_Guards",
            "page": "Royal_Earthbender_Guards"
          }
        }
      ],
      "text": "Aang fought against the Royal Earthbender Guards."
    },
    {
      "body": "Aang and Sokka prepared to leave Ba Sing Se, and before they did, Aang tried to confess to Katara of his love for her, but Sokka unknowingly interrupted him before he could say anything, much to Katara's annoyance. But before Aang hopped onto Appa, he did get a hug and a kiss on his cheek from her. Aang and Sokka made their way over the plains surrounding Ba Sing Se on Appa, convinced that things were finally going positively for them. However, back in the city, the circumstances took a suddenly negative turn. The Kyoshi Warriors arrived before the Earth King, who formally welcomed them. Unknown to the king, however, they were actually Azula, Mai and Ty Lee, disguised in Kyoshi garments and face paint.",
      "links": [],
      "text": "Aang and Sokka prepared to leave Ba Sing Se, and before they did, Aang tried to confess to Katara of his love for her, but Sokka unknowingly interrupted him before he could say anything, much to Katara's annoyance. But before Aang hopped onto Appa, he did get a hug and a kiss on his cheek from her. Aang and Sokka made their way over the plains surrounding Ba Sing Se on Appa, convinced that things were finally going positively for them. However, back in the city, the circumstances took a suddenly negative turn. The Kyoshi Warriors arrived before the Earth King, who formally welcomed them. Unknown to the king, however, they were actually Azula, Mai and Ty Lee, disguised in Kyoshi garments and face paint."
    },
    {
      "body": "Aang and Sokka arrived at ${link_0}, the given location of Sokka's father Hakoda and the other ${link_1} warriors. Aang tried to calm a nervous Sokka with mild success. Sokka questioned Aang on his feelings about meeting Guru ${link_2} to master the Avatar State. Aang smiled and replied that he was not nervous in the least. He took off on Appa, shouting back to Sokka that they would reunite in a week.",
      "links": [
        {
          "body": "Chameleon Bay",
          "key": "${link_0}",
          "target": {
            "href": "Chameleon_Bay",
            "page": "Chameleon_Bay"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Pathik",
          "key": "${link_2}",
          "target": {
            "href": "Pathik",
            "page": "Pathik"
          }
        }
      ],
      "text": "Aang and Sokka arrived at Chameleon Bay, the given location of Sokka's father Hakoda and the other Southern Water Tribe warriors. Aang tried to calm a nervous Sokka with mild success. Sokka questioned Aang on his feelings about meeting Guru Pathik to master the Avatar State. Aang smiled and replied that he was not nervous in the least. He took off on Appa, shouting back to Sokka that they would reunite in a week."
    },
    {
      "body": "${link_0} met Guru ${link_1} at the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Pathik",
          "key": "${link_1}",
          "target": {
            "href": "Pathik",
            "page": "Pathik"
          }
        },
        {
          "body": "Eastern Air Temple",
          "key": "${link_2}",
          "target": {
            "href": "Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        }
      ],
      "text": "Aang met Guru Pathik at the Eastern Air Temple."
    },
    {
      "body": "Aang arrived at the ${link_0} and found Guru Pathik meditating atop the pillar on which the latter had witnessed Appa's departure earlier. Guru Pathik introduced himself as a spiritual brother to the Air Nomads, and a close friend of Monk ${link_1}. Aang asked Pathik how he would teach him to gain control of the Avatar State, to which the guru replied that he must first bring balance to himself before he could bring balance to the world. The guru first offered Aang a liquid, which Aang drank and promptly spit out, as it was a strange combination of ${link_2}.",
      "links": [
        {
          "body": "Eastern Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        },
        {
          "body": "Gyatso",
          "key": "${link_1}",
          "target": {
            "href": "Gyatso",
            "page": "Gyatso"
          }
        },
        {
          "body": "onion and banana juice",
          "key": "${link_2}",
          "target": {
            "href": "Onion-banana_juice",
            "page": "Onion-banana_juice"
          }
        }
      ],
      "text": "Aang arrived at the Eastern Air Temple and found Guru Pathik meditating atop the pillar on which the latter had witnessed Appa's departure earlier. Guru Pathik introduced himself as a spiritual brother to the Air Nomads, and a close friend of Monk Gyatso. Aang asked Pathik how he would teach him to gain control of the Avatar State, to which the guru replied that he must first bring balance to himself before he could bring balance to the world. The guru first offered Aang a liquid, which Aang drank and promptly spit out, as it was a strange combination of onion and banana juice."
    },
    {
      "body": "Pathik proceeded to educate Aang about the ${link_0}, nexuses of metaphysical and/or biophysical energy residing in the human body. Pathik stated that the seven chakras of the body must be opened in order to master the Avatar State. After determining that Aang had no knowledge of the nature of chakras, Pathik provided a visual representation. Using a pond clogged with algae, he successfully explained to Aang the concept of chakras, stating that by removing the clogs between pools, the water was allowed to flow, just as energy would be allowed to flow through the body when the seven chakras were opened. There are seven chakras within the body, each with a purpose and each with a different blockage; an intense sensation results from each of their openings. Pathik warned that the process of opening the chakras must be completed without interruption in order to achieve success. Aang accepted this risk and they began the process.",
      "links": [
        {
          "body": "chakras",
          "key": "${link_0}",
          "target": {
            "href": "Chakras",
            "page": "Chakras"
          }
        }
      ],
      "text": "Pathik proceeded to educate Aang about the chakras, nexuses of metaphysical and/or biophysical energy residing in the human body. Pathik stated that the seven chakras of the body must be opened in order to master the Avatar State. After determining that Aang had no knowledge of the nature of chakras, Pathik provided a visual representation. Using a pond clogged with algae, he successfully explained to Aang the concept of chakras, stating that by removing the clogs between pools, the water was allowed to flow, just as energy would be allowed to flow through the body when the seven chakras were opened. There are seven chakras within the body, each with a purpose and each with a different blockage; an intense sensation results from each of their openings. Pathik warned that the process of opening the chakras must be completed without interruption in order to achieve success. Aang accepted this risk and they began the process."
    },
    {
      "body": "The first chakra, the earth chakra, located at the base of the spine, dealt with survival and was blocked by fear. Aang meditated and envisioned himself surrounded by fire and in the presence of the Fire Lord. Although initially gripped by fear, after receiving reassurance and guidance from Pathik in addressing the emotion, Aang was able to clear his thoughts and unlock the chakra. He exited his meditative trance and Pathik congratulated him before they moved on.",
      "links": [],
      "text": "The first chakra, the earth chakra, located at the base of the spine, dealt with survival and was blocked by fear. Aang meditated and envisioned himself surrounded by fire and in the presence of the Fire Lord. Although initially gripped by fear, after receiving reassurance and guidance from Pathik in addressing the emotion, Aang was able to clear his thoughts and unlock the chakra. He exited his meditative trance and Pathik congratulated him before they moved on."
    },
    {
      "body": "The second chakra, the water chakra, dealt with pleasure and was blocked by guilt. When asked what he blamed himself for, Aang confessed his regret for running away from the ${link_0} to escape the pressure accompanying his position as Avatar. He also regretted harming others while in the Avatar State, namely when at General Fong's base. Pathik replied that Aang must accept what had happened and not allow the events to influence his judgment. In order to benefit the world, Aang must forgive his own actions, which he was able to accomplish.",
      "links": [
        {
          "body": "Southern Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        }
      ],
      "text": "The second chakra, the water chakra, dealt with pleasure and was blocked by guilt. When asked what he blamed himself for, Aang confessed his regret for running away from the Southern Air Temple to escape the pressure accompanying his position as Avatar. He also regretted harming others while in the Avatar State, namely when at General Fong's base. Pathik replied that Aang must accept what had happened and not allow the events to influence his judgment. In order to benefit the world, Aang must forgive his own actions, which he was able to accomplish."
    },
    {
      "body": "${link_0} was taught by Guru ${link_1} how to clear his ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Pathik",
          "key": "${link_1}",
          "target": {
            "href": "Pathik",
            "page": "Pathik"
          }
        },
        {
          "body": "chakras",
          "key": "${link_2}",
          "target": {
            "href": "Chakras",
            "page": "Chakras"
          }
        }
      ],
      "text": "Aang was taught by Guru Pathik how to clear his chakras."
    },
    {
      "body": "Aang and Pathik prepared to open the third chakra, the fire chakra, which was located in the stomach. Aang jokingly remarked that he was hungry, which Pathik treated in good humor before quickly regaining focus. He explained that the fire chakra dealt with willpower and was blocked by shame. Aang recalled his first attempt at firebending, during which he severely burned Katara's hands. He repeated aloud the promise he had made afterward to never firebend again. Pathik dismissed this, saying that in order to obtain balance, Aang must accept all aspects of his life, including his need to master firebending. Aang breathed in and out once, unlocking the chakra.",
      "links": [],
      "text": "Aang and Pathik prepared to open the third chakra, the fire chakra, which was located in the stomach. Aang jokingly remarked that he was hungry, which Pathik treated in good humor before quickly regaining focus. He explained that the fire chakra dealt with willpower and was blocked by shame. Aang recalled his first attempt at firebending, during which he severely burned Katara's hands. He repeated aloud the promise he had made afterward to never firebend again. Pathik dismissed this, saying that in order to obtain balance, Aang must accept all aspects of his life, including his need to master firebending. Aang breathed in and out once, unlocking the chakra."
    },
    {
      "body": "Aang and Pathik moved onto the fourth chakra, the air chakra; located in the heart, this chakra dealt with love and was blocked by grief. Laying his grief before him, Aang meditated and envisioned the Air Nomads, including Gyatso, all of whom had died because he abandoned them. He watched sadly as they slowly faded away into dust. However, Pathik stated that love was a form of energy and flowed around everything; he reassured that the monks' love for Aang was still present and manifested itself in the form of new love: in Aang's case, the love he felt for Katara. Aang released the chakra, teary-eyed, and asked for more juice before they continued.",
      "links": [],
      "text": "Aang and Pathik moved onto the fourth chakra, the air chakra; located in the heart, this chakra dealt with love and was blocked by grief. Laying his grief before him, Aang meditated and envisioned the Air Nomads, including Gyatso, all of whom had died because he abandoned them. He watched sadly as they slowly faded away into dust. However, Pathik stated that love was a form of energy and flowed around everything; he reassured that the monks' love for Aang was still present and manifested itself in the form of new love: in Aang's case, the love he felt for Katara. Aang released the chakra, teary-eyed, and asked for more juice before they continued."
    },
    {
      "body": "The fifth chakra, the sound chakra, was located in the throat; it dealt with truth and was blocked by the lies people told themselves. When Aang admitted to his denial of his status as the Avatar, Pathik said that all must accept who they are and thus Aang must accept his position. Aang quickly and calmly accomplished this, successfully opening the chakra.",
      "links": [],
      "text": "The fifth chakra, the sound chakra, was located in the throat; it dealt with truth and was blocked by the lies people told themselves. When Aang admitted to his denial of his status as the Avatar, Pathik said that all must accept who they are and thus Aang must accept his position. Aang quickly and calmly accomplished this, successfully opening the chakra."
    },
    {
      "body": "Aang and Pathik proceeded to the next chakra, the light chakra. Located in the center of the forehead, the sixth chakra was responsible for insight and blocked by illusions. The greatest illusion, Pathik explained, was that of separation: certain things appeared separate, but were, in truth, one and the same. Aang applied this principle to the four nations, and Pathik agreed, stating that the people of the world were in reality one people, despite their decision to live as separate nations. He explained that even the separation of the four elements was an illusion, particularly mentioning metal, which was simply earth that had been purified and refined. Upon clearing the chakra, Pathik compared its opening to a burping bison as opposed to a flowing creek. In reply, Aang let out a loud burp.",
      "links": [],
      "text": "Aang and Pathik proceeded to the next chakra, the light chakra. Located in the center of the forehead, the sixth chakra was responsible for insight and blocked by illusions. The greatest illusion, Pathik explained, was that of separation: certain things appeared separate, but were, in truth, one and the same. Aang applied this principle to the four nations, and Pathik agreed, stating that the people of the world were in reality one people, despite their decision to live as separate nations. He explained that even the separation of the four elements was an illusion, particularly mentioning metal, which was simply earth that had been purified and refined. Upon clearing the chakra, Pathik compared its opening to a burping bison as opposed to a flowing creek. In reply, Aang let out a loud burp."
    },
    {
      "body": "Aang and Pathik proceeded to the seventh and final chakra. Pathik congratulated Aang and stated that with the final chakra's opening, Aang would be able to willfully enter and exit the Avatar State, as well as control his actions within it. The thought chakra, located at the crown of the head, dealt with cosmic energy and was blocked by earthly attachment. Aang was asked to meditate on what his attachments were, and images of Katara flooded his mind. When Pathik instructed Aang to release these attachments, Aang suddenly became angry, finding the idea of letting go of Katara ludicrous, as he loved her. He questioned why he should not allow himself to feel this love when Pathik stated previously that it was beneficial to him. Pathik stated that if Aang ever wanted the pure cosmic energy to enter him, he must let go of all earthly attachments, including Katara.",
      "links": [],
      "text": "Aang and Pathik proceeded to the seventh and final chakra. Pathik congratulated Aang and stated that with the final chakra's opening, Aang would be able to willfully enter and exit the Avatar State, as well as control his actions within it. The thought chakra, located at the crown of the head, dealt with cosmic energy and was blocked by earthly attachment. Aang was asked to meditate on what his attachments were, and images of Katara flooded his mind. When Pathik instructed Aang to release these attachments, Aang suddenly became angry, finding the idea of letting go of Katara ludicrous, as he loved her. He questioned why he should not allow himself to feel this love when Pathik stated previously that it was beneficial to him. Pathik stated that if Aang ever wanted the pure cosmic energy to enter him, he must let go of all earthly attachments, including Katara."
    },
    {
      "body": "The argument continued, with Pathik telling Aang he must open all the chakras to master the Avatar State. Aang finally resolved to attempt to do so and began to release his attachment. He visualized an image of Katara disappearing into space and himself being taken high above the planet to walk along a purple stream of cosmic energy. The stream was radiating from a gigantic image of himself in the Avatar State, which surrounded him in a sphere of energy radiating from its palms. However, Aang's attention was suddenly drawn to an image of Katara struggling in chains and screaming for help. He abandoned the Avatar State and began running toward the image. The stream of cosmic energy dissipated, and Aang plummeted to the Earth, having clung to his attachment once more. Jolting awake from his meditation, Aang desperately said that Katara was in trouble and that he must return to Ba Sing Se to help her. Pathik warned him that, by choosing attachment, the last chakra had become blocked and if he left now, he would not be able to enter the Avatar State at all. Aang hesitated, but promptly continued on without looking back or responding.",
      "links": [],
      "text": "The argument continued, with Pathik telling Aang he must open all the chakras to master the Avatar State. Aang finally resolved to attempt to do so and began to release his attachment. He visualized an image of Katara disappearing into space and himself being taken high above the planet to walk along a purple stream of cosmic energy. The stream was radiating from a gigantic image of himself in the Avatar State, which surrounded him in a sphere of energy radiating from its palms. However, Aang's attention was suddenly drawn to an image of Katara struggling in chains and screaming for help. He abandoned the Avatar State and began running toward the image. The stream of cosmic energy dissipated, and Aang plummeted to the Earth, having clung to his attachment once more. Jolting awake from his meditation, Aang desperately said that Katara was in trouble and that he must return to Ba Sing Se to help her. Pathik warned him that, by choosing attachment, the last chakra had become blocked and if he left now, he would not be able to enter the Avatar State at all. Aang hesitated, but promptly continued on without looking back or responding."
    },
    {
      "body": "Sokka and Aang hurriedly returned to Ba Sing Se on Appa, meeting Toph along the way. When asked if he had mastered the Avatar State, Aang lied to the others, saying that he had.",
      "links": [],
      "text": "Sokka and Aang hurriedly returned to Ba Sing Se on Appa, meeting Toph along the way. When asked if he had mastered the Avatar State, Aang lied to the others, saying that he had."
    },
    {
      "body": "When they arrived at the palace, the Earth King reassured them that Katara was fine. A search of their house, however, confirmed Aang's suspicions that she was in peril. While there, Toph sensed someone at the door and identified it as Iroh, whom she had befriended earlier. Iroh appealed to the team for aid, stating that Azula had captured Zuko. Although initially wary of the general's intentions, Aang and Sokka agreed to help. After interrogating a captured Dai Li agent, Team Avatar learned of a ${link_0} that was to commence that day, and that Katara was being held captive in a secret underground cave in Old Ba Sing Se.",
      "links": [
        {
          "body": "coup",
          "key": "${link_0}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        }
      ],
      "text": "When they arrived at the palace, the Earth King reassured them that Katara was fine. A search of their house, however, confirmed Aang's suspicions that she was in peril. While there, Toph sensed someone at the door and identified it as Iroh, whom she had befriended earlier. Iroh appealed to the team for aid, stating that Azula had captured Zuko. Although initially wary of the general's intentions, Aang and Sokka agreed to help. After interrogating a captured Dai Li agent, Team Avatar learned of a coup that was to commence that day, and that Katara was being held captive in a secret underground cave in Old Ba Sing Se."
    },
    {
      "body": "${link_0} ${link_1} crystal armor to protect himself from ${link_2}'s attacks.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "earthbent",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Azula",
          "key": "${link_2}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Aang earthbent crystal armor to protect himself from Azula's attacks."
    },
    {
      "body": "Outside the palace, the gang discovered that there was indeed a ${link_0}; it was decided that Toph and Sokka would warn the Earth King of the coup while Iroh and Aang would rescue Katara and Zuko. Traveling through a tunnel to this prison, Aang recounted to Iroh the events of his meeting with Guru Pathik. Hearing the Avatar question his choice and doubt his abilities without the Avatar State, Iroh reassured Aang that he was very wise to choose happiness and love over power and perfection, which he perceived as overrated.",
      "links": [
        {
          "body": "huge underground city",
          "key": "${link_0}",
          "target": {
            "href": "Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        }
      ],
      "text": "Outside the palace, the gang discovered that there was indeed a huge underground city; it was decided that Toph and Sokka would warn the Earth King of the coup while Iroh and Aang would rescue Katara and Zuko. Traveling through a tunnel to this prison, Aang recounted to Iroh the events of his meeting with Guru Pathik. Hearing the Avatar question his choice and doubt his abilities without the Avatar State, Iroh reassured Aang that he was very wise to choose happiness and love over power and perfection, which he perceived as overrated."
    },
    {
      "body": "The two eventually reached the prison, moments before Katara prepared to heal Zuko's scar. Zuko and Aang exchanged glares, the former growing angry that Iroh was with the Avatar. Iroh sent Katara and Aang off to help Sokka and Toph; after the two had departed, Iroh explained to Zuko that he was a changed man, stronger and wiser than ever before. He urged Zuko to choose to aid the Avatar. However, a mass of crystals suddenly entrapped Iroh, and Azula arrived on scene. She said that she expected this sort of treachery from Iroh, but not from her brother. She began to feed him tales of how this was the most glorious day in Fire Nation history, and that if he joined her, Zuko would regain his father's love and honor. Iroh begged Zuko not listen to Azula, telling him that the kind of redemption Azula was offering was not the redemption for him, but Azula continued to plot, telling Zuko how she had planned everything and that they would only win if he joined her. Iroh begged even more for Zuko to look deep inside his heart and see what he truly wanted. Azula sent the Dai Li away and told Zuko that he could choose whatever he wanted, and she walked away; leaving him to ponder the two sides of the coin.",
      "links": [],
      "text": "The two eventually reached the prison, moments before Katara prepared to heal Zuko's scar. Zuko and Aang exchanged glares, the former growing angry that Iroh was with the Avatar. Iroh sent Katara and Aang off to help Sokka and Toph; after the two had departed, Iroh explained to Zuko that he was a changed man, stronger and wiser than ever before. He urged Zuko to choose to aid the Avatar. However, a mass of crystals suddenly entrapped Iroh, and Azula arrived on scene. She said that she expected this sort of treachery from Iroh, but not from her brother. She began to feed him tales of how this was the most glorious day in Fire Nation history, and that if he joined her, Zuko would regain his father's love and honor. Iroh begged Zuko not listen to Azula, telling him that the kind of redemption Azula was offering was not the redemption for him, but Azula continued to plot, telling Zuko how she had planned everything and that they would only win if he joined her. Iroh begged even more for Zuko to look deep inside his heart and see what he truly wanted. Azula sent the Dai Li away and told Zuko that he could choose whatever he wanted, and she walked away; leaving him to ponder the two sides of the coin."
    },
    {
      "body": "Aang and Katara rushed to save Toph and Sokka, only to be halted when Azula sent a blast of fire at them. A battle ensued between Aang, Katara, and Azula; Zuko arrived on scene just as Aang and Katara had her cornered. After a brief moment of dramatic tension, Zuko began fighting on Azula's side, to everyone's astonishment. At one point during the battle, Zuko battled Katara, both using elemental whips on opposite sides of a river. Katara expressed her angry disappointment in Zuko, stating she thought he had changed. He replied inscrutably, \"I have changed.\" Meanwhile, Aang and Azula charged at one another, with Azula suddenly discharging a blast of fire, sending Aang soaring into the air.",
      "links": [],
      "text": "Aang and Katara rushed to save Toph and Sokka, only to be halted when Azula sent a blast of fire at them. A battle ensued between Aang, Katara, and Azula; Zuko arrived on scene just as Aang and Katara had her cornered. After a brief moment of dramatic tension, Zuko began fighting on Azula's side, to everyone's astonishment. At one point during the battle, Zuko battled Katara, both using elemental whips on opposite sides of a river. Katara expressed her angry disappointment in Zuko, stating she thought he had changed. He replied inscrutably, \"I have changed.\" Meanwhile, Aang and Azula charged at one another, with Azula suddenly discharging a blast of fire, sending Aang soaring into the air."
    },
    {
      "body": "${link_0} was shot by ${link_1}'s lightning bolt whilst in the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_Sate",
            "page": "Avatar"
          }
        }
      ],
      "text": "Aang was shot by Azula's lightning bolt whilst in the Avatar State."
    },
    {
      "body": "The fight continued with Katara taking on both Zuko and Azula; Aang soon reentered the battle after having been overcome earlier. He created a tidal wave of earth, barreling toward Azula and Zuko, but was stopped by the Dai Li. Numerous Dai Li agents appeared, and Aang and Katara both assumed fighting stances. However, realizing they were horribly outmatched, Aang resorted to creating a temporary crystal shelter with earthbending, where he meditated and attempted to release his attachment to Katara in order to enter the Avatar State. He rose into the air, having successfully triggered Avatar State; however, Azula shot him down with a lightning bolt to the back. As a result, the Avatar Spirit fell from the plane of existence and Aang began plummeting toward the ground. Katara conjured up a large wave, scattering the Dai Li, Zuko, and Azula and caught him before he hit the ground. Holding him in tears, she was defenseless, but Iroh suddenly appeared. He told Katara to escape, stating that he would hold off Azula and the others as long as he could. Once they escaped, Iroh surrendered himself to the Dai Li and glanced at Zuko in dismay at his decision.",
      "links": [],
      "text": "The fight continued with Katara taking on both Zuko and Azula; Aang soon reentered the battle after having been overcome earlier. He created a tidal wave of earth, barreling toward Azula and Zuko, but was stopped by the Dai Li. Numerous Dai Li agents appeared, and Aang and Katara both assumed fighting stances. However, realizing they were horribly outmatched, Aang resorted to creating a temporary crystal shelter with earthbending, where he meditated and attempted to release his attachment to Katara in order to enter the Avatar State. He rose into the air, having successfully triggered Avatar State; however, Azula shot him down with a lightning bolt to the back. As a result, the Avatar Spirit fell from the plane of existence and Aang began plummeting toward the ground. Katara conjured up a large wave, scattering the Dai Li, Zuko, and Azula and caught him before he hit the ground. Holding him in tears, she was defenseless, but Iroh suddenly appeared. He told Katara to escape, stating that he would hold off Azula and the others as long as he could. Once they escaped, Iroh surrendered himself to the Dai Li and glanced at Zuko in dismay at his decision."
    },
    {
      "body": "${link_0} held ${link_1}'s lifeless body.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Katara held Aang's lifeless body."
    },
    {
      "body": "The entire group escaped Ba Sing Se on Appa, during which Katara used her Spirit Water to heal Aang, who initially appeared dead. At first, nothing occurred, and Katara began to cry, holding Aang close. However, Aang's ${link_0} soon glowed shortly and he awoke, faintly smiling at her. Overwhelmed and relieved that he was all right, Katara embraced him closer.",
      "links": [
        {
          "body": "tattoos",
          "key": "${link_0}",
          "target": {
            "href": "Body_markings_in_the_World_of_Avatar",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "The entire group escaped Ba Sing Se on Appa, during which Katara used her Spirit Water to heal Aang, who initially appeared dead. At first, nothing occurred, and Katara began to cry, holding Aang close. However, Aang's tattoos soon glowed shortly and he awoke, faintly smiling at her. Overwhelmed and relieved that he was all right, Katara embraced him closer."
    },
    {
      "body": "Azula was firmly in control of the city, and as the Earth King, Bosco, and Team Avatar flew atop Appa's back over the Outer Wall and out of the city, the Earth King looked back and sadly proclaimed, \"The Earth Kingdom ... has fallen.\"",
      "links": [],
      "text": "Azula was firmly in control of the city, and as the Earth King, Bosco, and Team Avatar flew atop Appa's back over the Outer Wall and out of the city, the Earth King looked back and sadly proclaimed, \"The Earth Kingdom ... has fallen.\""
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Aang_(Spring_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Aang_(Spring_100_AG).html",
    "page": "History_of_Aang_(Spring_100_AG)",
    "title": "History of Aang (Spring 100 AG)"
  }
}