{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Following the ${link_0}, Korra left to the ${link_1} to recuperate and ${link_2} moved on with their lives. Although Korra managed to heal physically, she is still facing an emotional block caused by residual traces of ${link_3}. However, her help is needed to face the former captain of ${link_4}'s guard, ${link_5}, as she denounced ${link_6} ${link_7}'s authority and appointed herself the ruler of the ${link_8} after spending three years stabilizing the ${link_9}.",
      "links": [
        {
          "body": "insurrection of the Red Lotus",
          "key": "${link_0}",
          "target": {
            "href": "Insurrection_of_the_Red_Lotus",
            "page": "Insurrection_of_the_Red_Lotus"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "mercury",
          "key": "${link_3}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        },
        {
          "body": "Zaofu",
          "key": "${link_4}",
          "target": {
            "href": "Zaofu",
            "page": "Zaofu"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_5}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_6}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Wu",
          "key": "${link_7}",
          "target": {
            "href": "Wu",
            "page": "Wu"
          }
        },
        {
          "body": "Earth Empire",
          "key": "${link_8}",
          "target": {
            "href": "Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_9}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Following the insurrection of the Red Lotus, Korra left to the Southern Water Tribe to recuperate and Team Avatar moved on with their lives. Although Korra managed to heal physically, she is still facing an emotional block caused by residual traces of mercury. However, her help is needed to face the former captain of Zaofu's guard, Kuvira, as she denounced Earth King Wu's authority and appointed herself the ruler of the Earth Empire after spending three years stabilizing the Earth Kingdom."
    },
    {
      "body": "Although facing a female ${link_0}, ${link_1} saw herself in the ${link_2} as her opponent.",
      "links": [
        {
          "body": "earthbender",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "Although facing a female earthbender, Korra saw herself in the Avatar State as her opponent."
    },
    {
      "body": "Six months after having left the ${link_0}, Korra made her way to a small Earth Kingdom town at night, where she was once again haunted by her ${link_1} apparition. When the apparition turned away into an ally, Korra followed her, determined to end the haunting. Chasing the vision, she found herself in a warehouse where ${link_2} cage fights were being held. Seeing the apparition standing in the fighting ring, Korra asked the organizer how to enter the ring and was subsequently permitted to fight. She sparred with a female earthbender, although Korra envisioned the woman as her Avatar self. She was barraged with several rocks and pushed around with an earth pillar. Panting heavily, Korra challenged her apparition, which spurred on her opponent to intensify her attacks. Although Korra tried to retaliate, she was knocked down by a direct hit and collapsed on the ground while staring at herself in the Avatar State. After all the spectators had left, Korra made her way to the stands and unwrapped her wrists and forearms. The organizer of the match walked up to her and threw her a wad of cash, for which she thanked him in an uninterested manner. As she grabbed the money and her bag and stood up to leave, the man stated that she looked like \"that Avatar girl\", though Korra dismissed the recognition as something that she got a lot. When the man asked what had happened to the Avatar, she replied that she did not know and continued walking off.",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Six months after having left the South Pole, Korra made her way to a small Earth Kingdom town at night, where she was once again haunted by her Avatar apparition. When the apparition turned away into an ally, Korra followed her, determined to end the haunting. Chasing the vision, she found herself in a warehouse where earthbending cage fights were being held. Seeing the apparition standing in the fighting ring, Korra asked the organizer how to enter the ring and was subsequently permitted to fight. She sparred with a female earthbender, although Korra envisioned the woman as her Avatar self. She was barraged with several rocks and pushed around with an earth pillar. Panting heavily, Korra challenged her apparition, which spurred on her opponent to intensify her attacks. Although Korra tried to retaliate, she was knocked down by a direct hit and collapsed on the ground while staring at herself in the Avatar State. After all the spectators had left, Korra made her way to the stands and unwrapped her wrists and forearms. The organizer of the match walked up to her and threw her a wad of cash, for which she thanked him in an uninterested manner. As she grabbed the money and her bag and stood up to leave, the man stated that she looked like \"that Avatar girl\", though Korra dismissed the recognition as something that she got a lot. When the man asked what had happened to the Avatar, she replied that she did not know and continued walking off."
    },
    {
      "body": "Still suffering from the mental whiplash of the ${link_0} poisoning, ${link_1} was haunted by visions of her ${link_2} self attacking her.",
      "links": [
        {
          "body": "mercury",
          "key": "${link_0}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Still suffering from the mental whiplash of the mercury poisoning, Korra was haunted by visions of her Avatar self attacking her."
    },
    {
      "body": "Korra made her way to a public restroom to clean herself up. Briefly staring at her reflection in a broken mirror, she used the water from the sink to start ${link_0} her wounds, though was interrupted by a man urgently needing to use the facilities. She left the restroom and started wandering the streets again, lost in thought and her gaze trained on the floor. As such, she was nearly hit by a ${link_1}, managing only to dive out of its way at the last second. Stumbling to a nearby ally where she steadied herself by holding on to the wall, breathing heavily while clutching her head, Korra saw her Avatar self again and called out to the apparition. She was subsequently attacked with the chain attached to the apparition's right arm. Although she retaliated with her ${link_2}, she ended up knocked down with the chain ensnaring her left wrist. As the apparition stalked closer, Korra yelled at her to leave her alone and engulfed the ally in fire. However, as the fire cleared up, it became apparent that she had been alone, prompting bystanders to offer help, though she brushed them off.",
      "links": [
        {
          "body": "healing",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        },
        {
          "body": "car",
          "key": "${link_1}",
          "target": {
            "href": "Satomobile",
            "page": "Satomobile"
          }
        },
        {
          "body": "firebending",
          "key": "${link_2}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Korra made her way to a public restroom to clean herself up. Briefly staring at her reflection in a broken mirror, she used the water from the sink to start healing her wounds, though was interrupted by a man urgently needing to use the facilities. She left the restroom and started wandering the streets again, lost in thought and her gaze trained on the floor. As such, she was nearly hit by a car, managing only to dive out of its way at the last second. Stumbling to a nearby ally where she steadied herself by holding on to the wall, breathing heavily while clutching her head, Korra saw her Avatar self again and called out to the apparition. She was subsequently attacked with the chain attached to the apparition's right arm. Although she retaliated with her firebending, she ended up knocked down with the chain ensnaring her left wrist. As the apparition stalked closer, Korra yelled at her to leave her alone and engulfed the ally in fire. However, as the fire cleared up, it became apparent that she had been alone, prompting bystanders to offer help, though she brushed them off."
    },
    {
      "body": "As it neared twilight, Korra was walking along the streets, where she found a puppy in the middle of the road. She squatted down to pet it and was surprised when the dog started growling and barking at her Avatar apparition, who had appeared in front of her once more. Put at ease by the animal's actions, believing that she was not going crazy now, Korra stood up to face the apparition, though when it disappeared, she turned to the puppy, asking it in disbelief how it had managed to drive off her Avatar self. As the dog ran off, barking at her, Korra decided to follow it.",
      "links": [],
      "text": "As it neared twilight, Korra was walking along the streets, where she found a puppy in the middle of the road. She squatted down to pet it and was surprised when the dog started growling and barking at her Avatar apparition, who had appeared in front of her once more. Put at ease by the animal's actions, believing that she was not going crazy now, Korra stood up to face the apparition, though when it disappeared, she turned to the puppy, asking it in disbelief how it had managed to drive off her Avatar self. As the dog ran off, barking at her, Korra decided to follow it."
    },
    {
      "body": "Hallucinating, ${link_0} found herself trapped in a pool of ${link_1}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "mercury",
          "key": "${link_1}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        }
      ],
      "text": "Hallucinating, Korra found herself trapped in a pool of mercury."
    },
    {
      "body": "Korra was led out of the town and by the time the sun was well into the sky, they arrived at the ${link_0}. There, the puppy transformed into a ${link_1} whom Korra recognized as the ${link_2} that she had met at the ${link_3}. Although she was not pleased by having been deceived, she acknowledged the spirit's reasoning that she would not have followed him otherwise. When Korra asked what she was supposed to find in the swamp, the spirit replied they were there for a \"who\" and not a \"what\". As it flew off into the thicket, Korra gave chase once more, though as she burst out of the vegetation, she found herself falling into a shallow pond where her Avatar specter was awaiting her as opposed to the spirit. She fearfully backed up, telling herself that the apparition was merely a figment of her imagination, though she was subsequently flung against a tree by a powerful firebending attack. Barraged with water, fire, and earth attacks, Korra was forced on the run. Trying to escape up a tree, the apparition hooked its chain around her leg and pulled her down, both disappearing in a hallucinatory pool of mercury.",
      "links": [
        {
          "body": "Foggy Swamp",
          "key": "${link_0}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "light spirit",
          "key": "${link_1}",
          "target": {
            "href": "Light_spirit",
            "page": "Light_spirit"
          }
        },
        {
          "body": "light spirit",
          "key": "${link_2}",
          "target": {
            "href": "Light_spirit",
            "page": "Light_spirit"
          }
        },
        {
          "body": "Tree of Time",
          "key": "${link_3}",
          "target": {
            "href": "Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "text": "Korra was led out of the town and by the time the sun was well into the sky, they arrived at the Foggy Swamp. There, the puppy transformed into a light spirit whom Korra recognized as the light spirit that she had met at the Tree of Time. Although she was not pleased by having been deceived, she acknowledged the spirit's reasoning that she would not have followed him otherwise. When Korra asked what she was supposed to find in the swamp, the spirit replied they were there for a \"who\" and not a \"what\". As it flew off into the thicket, Korra gave chase once more, though as she burst out of the vegetation, she found herself falling into a shallow pond where her Avatar specter was awaiting her as opposed to the spirit. She fearfully backed up, telling herself that the apparition was merely a figment of her imagination, though she was subsequently flung against a tree by a powerful firebending attack. Barraged with water, fire, and earth attacks, Korra was forced on the run. Trying to escape up a tree, the apparition hooked its chain around her leg and pulled her down, both disappearing in a hallucinatory pool of mercury."
    },
    {
      "body": "${link_0} was surprised to awaken in ${link_1}'s home in the middle of the ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Foggy Swamp",
          "key": "${link_2}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        }
      ],
      "text": "Korra was surprised to awaken in Toph's home in the middle of the Foggy Swamp."
    },
    {
      "body": "Korra later awoke in a cave where an old woman was stirring a pot. When Korra inquired what had happened to her, the woman merely deflected the question back to her, stating that she did not know anything beyond the fact that she had found Korra lying unconscious in the mud. Upon being asked why she had ventured into the swamp, Korra told the woman that a spirit had urged her to find someone there and wondered if it might have been the woman. Although unsure about that, the woman urged Korra to listen to her Avatar senses if they had called her there. Surprised to be recognized as the Avatar, Korra inquired how the woman had known, to which she was told she had been good friends with her predecessor. Korra walked over to her and illuminated the cave with her firebending. She was surprised to recognize the woman as ${link_0}, who greeted her in return as \"Twinkle Toes\".",
      "links": [
        {
          "body": "Toph Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Korra later awoke in a cave where an old woman was stirring a pot. When Korra inquired what had happened to her, the woman merely deflected the question back to her, stating that she did not know anything beyond the fact that she had found Korra lying unconscious in the mud. Upon being asked why she had ventured into the swamp, Korra told the woman that a spirit had urged her to find someone there and wondered if it might have been the woman. Although unsure about that, the woman urged Korra to listen to her Avatar senses if they had called her there. Surprised to be recognized as the Avatar, Korra inquired how the woman had known, to which she was told she had been good friends with her predecessor. Korra walked over to her and illuminated the cave with her firebending. She was surprised to recognize the woman as Toph Beifong, who greeted her in return as \"Twinkle Toes\"."
    },
    {
      "body": "The following day, Korra requested Toph to help her get back into her \"Avatar fighting shape\", as she was currently in no condition to help the world, which she believed to need her. However, she was promptly told to get over herself as Toph believed the world did not need her at all. Defending herself, Korra pointed out that she had stopped some major conflicts during her time as the Avatar, though her accomplishments were waved off as insignificant, since Toph believed that crime could not be stopped. Despite this, Korra grew excited when the elderly earthbender agreed to train her. When she surged forward to give the old woman a hug, however, she ran face-first against the earthen slab Toph created and fell down, being told that if she wanted to hug something, she could go find a tree as they were there to work.",
      "links": [],
      "text": "The following day, Korra requested Toph to help her get back into her \"Avatar fighting shape\", as she was currently in no condition to help the world, which she believed to need her. However, she was promptly told to get over herself as Toph believed the world did not need her at all. Defending herself, Korra pointed out that she had stopped some major conflicts during her time as the Avatar, though her accomplishments were waved off as insignificant, since Toph believed that crime could not be stopped. Despite this, Korra grew excited when the elderly earthbender agreed to train her. When she surged forward to give the old woman a hug, however, she ran face-first against the earthen slab Toph created and fell down, being told that if she wanted to hug something, she could go find a tree as they were there to work."
    },
    {
      "body": "${link_0} was easily defeated every time by ${link_1} in their practice duels.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Korra was easily defeated every time by Toph in their practice duels."
    },
    {
      "body": "Korra faced Toph in a sparing match, during which she barraged the elderly woman with three ${link_0} strikes and a water attack, before being knocked down with a mud pillar after Toph easily sidestepped all of her assaults. As Korra was gathering her bearings, shooing off a ${link_1} that had jumped on her shoulder, she was asked to reflect on what she had done wrong and was told to stop thinking during battle. When Toph turned her back on her and ordered to go again, Korra subjected the elderly earthbender to an elemental barrage, though was defeated with one mud pillar once again. As Korra laid in a shallow water pool, she was berated for her \"pathetic\" performance and declared to be by far the worst of the two Avatars Toph had ever worked with. Korra defended herself by pointing out that it merely looked like Toph was enjoying having someone around to beat up, which the elderly woman agreed with. Changing the subject, Korra inquired why Toph had chosen to disconnect herself from the rest of the world, though was promptly corrected by Toph who said that she was more connected to the world than Korra had ever been. As the elderly woman declared she was able to see everything, Korra attempted to test that statement by attacking her from behind, though was knocked down with a mud stream before she could execute her attack and was labeled to be the blind one compared to Toph.",
      "links": [
        {
          "body": "airbending",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "frog squirrel",
          "key": "${link_1}",
          "target": {
            "href": "Frog_squirrel",
            "page": "Frog_squirrel"
          }
        }
      ],
      "text": "Korra faced Toph in a sparing match, during which she barraged the elderly woman with three airbending strikes and a water attack, before being knocked down with a mud pillar after Toph easily sidestepped all of her assaults. As Korra was gathering her bearings, shooing off a frog squirrel that had jumped on her shoulder, she was asked to reflect on what she had done wrong and was told to stop thinking during battle. When Toph turned her back on her and ordered to go again, Korra subjected the elderly earthbender to an elemental barrage, though was defeated with one mud pillar once again. As Korra laid in a shallow water pool, she was berated for her \"pathetic\" performance and declared to be by far the worst of the two Avatars Toph had ever worked with. Korra defended herself by pointing out that it merely looked like Toph was enjoying having someone around to beat up, which the elderly woman agreed with. Changing the subject, Korra inquired why Toph had chosen to disconnect herself from the rest of the world, though was promptly corrected by Toph who said that she was more connected to the world than Korra had ever been. As the elderly woman declared she was able to see everything, Korra attempted to test that statement by attacking her from behind, though was knocked down with a mud stream before she could execute her attack and was labeled to be the blind one compared to Toph."
    },
    {
      "body": "Walking through the swamp, Korra dejectedly noted that her sparring with Toph was \"terrible\" as she had been tossed around like a rag doll the entire time. Frustrated, Korra lamented about her inability to recover her old form, feeling as if she was constantly a step too slow, tentative, and out of sync. She was surprised to learn that there were still traces of mercury in her body, for which Toph berated her once again for \"truly\" being the worst Avatar ever. Although she had been under the impression that Suyin had extracted all the poison, Korra excitedly latched onto Toph, asking if the elder would be able to remove the mercury, though she was pushed away by an irritated Toph, who was peeved about the fact that Korra even needed to ask about her abilities.",
      "links": [],
      "text": "Walking through the swamp, Korra dejectedly noted that her sparring with Toph was \"terrible\" as she had been tossed around like a rag doll the entire time. Frustrated, Korra lamented about her inability to recover her old form, feeling as if she was constantly a step too slow, tentative, and out of sync. She was surprised to learn that there were still traces of mercury in her body, for which Toph berated her once again for \"truly\" being the worst Avatar ever. Although she had been under the impression that Suyin had extracted all the poison, Korra excitedly latched onto Toph, asking if the elder would be able to remove the mercury, though she was pushed away by an irritated Toph, who was peeved about the fact that Korra even needed to ask about her abilities."
    },
    {
      "body": "${link_0} kept subconsciously fighting ${link_1}'s attempts to ${link_2} the residual ${link_3} out of her system.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "bend",
          "key": "${link_2}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "mercury",
          "key": "${link_3}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        }
      ],
      "text": "Korra kept subconsciously fighting Toph's attempts to bend the residual mercury out of her system."
    },
    {
      "body": "Returning to Toph's home, Korra laid down and was ordered to relax in order for Toph to be able to complete a successful extraction of the residual mercury. Although Toph commented that Korra's body was tense like a \"twisted tree trunk\", the Avatar snapped at the elderly woman to commence with the extraction. The moment Toph started, however, Korra shot up and grunted in pain, which prompted Toph to berate her for not being relaxed. Being ordered to stop fighting, Korra hotly denied that she had been fighting Toph. When the elderly earthbender tried again, Korra was plagued by another vision of Zaheer trying to asphyxiate her in the Avatar State. Gasping in pain, Korra curled up, which resulted in Toph stating that Korra would have to bend the metal out herself, since she was adamant about keeping it in her body for the time being. Perplexed, Korra asked why she would want to keep poison in her body and only managed to halfheartedly denounce Toph's theory about her using it as an excuse to forsake her duties as the Avatar out of fear of getting injured again as ridiculous. As Toph walked away, unwilling to deal with the Avatar's issues, Korra asked what she was supposed to do and was promptly deferred to the spirit that brought her to the swamp in the first place. Additionally, she was told that if she wished to find a place where she could disappear, she had come to the right swamp.",
      "links": [],
      "text": "Returning to Toph's home, Korra laid down and was ordered to relax in order for Toph to be able to complete a successful extraction of the residual mercury. Although Toph commented that Korra's body was tense like a \"twisted tree trunk\", the Avatar snapped at the elderly woman to commence with the extraction. The moment Toph started, however, Korra shot up and grunted in pain, which prompted Toph to berate her for not being relaxed. Being ordered to stop fighting, Korra hotly denied that she had been fighting Toph. When the elderly earthbender tried again, Korra was plagued by another vision of Zaheer trying to asphyxiate her in the Avatar State. Gasping in pain, Korra curled up, which resulted in Toph stating that Korra would have to bend the metal out herself, since she was adamant about keeping it in her body for the time being. Perplexed, Korra asked why she would want to keep poison in her body and only managed to halfheartedly denounce Toph's theory about her using it as an excuse to forsake her duties as the Avatar out of fear of getting injured again as ridiculous. As Toph walked away, unwilling to deal with the Avatar's issues, Korra asked what she was supposed to do and was promptly deferred to the spirit that brought her to the swamp in the first place. Additionally, she was told that if she wished to find a place where she could disappear, she had come to the right swamp."
    },
    {
      "body": "After doing nothing for two days, Korra grew restless and asked Toph what the plan was for that day. When the elder hinted that they would not be doing anything that day either, Korra did not care for that plan and asked Toph to relay the tale of how she taught Aang to earthbend. As the earthbender retold the story in three sentences, a surprised Korra noted that she thought there would be more to it. Undeterred, she asked to hear the story of how the old Team Avatar had taken down the Fire Lord, though when Toph once again relayed the story in three sentences, Korra labeled the woman a bad storyteller and merely sighed when Toph defended herself by stating that it was Korra who was bad at listening to them. Bored, the Avatar started tapping her foot on the ground, which resulted in Toph sending her away to collect mushrooms for their dinner.",
      "links": [],
      "text": "After doing nothing for two days, Korra grew restless and asked Toph what the plan was for that day. When the elder hinted that they would not be doing anything that day either, Korra did not care for that plan and asked Toph to relay the tale of how she taught Aang to earthbend. As the earthbender retold the story in three sentences, a surprised Korra noted that she thought there would be more to it. Undeterred, she asked to hear the story of how the old Team Avatar had taken down the Fire Lord, though when Toph once again relayed the story in three sentences, Korra labeled the woman a bad storyteller and merely sighed when Toph defended herself by stating that it was Korra who was bad at listening to them. Bored, the Avatar started tapping her foot on the ground, which resulted in Toph sending her away to collect mushrooms for their dinner."
    },
    {
      "body": "Overcome by her fear of her past enemies, ${link_0} witnessed ${link_1} ${link_2} extract ${link_3} in one of her visions.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Dark Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Dark_Avatar",
            "page": "Dark_Avatar"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_2}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Raava",
          "key": "${link_3}",
          "target": {
            "href": "Raava",
            "page": "Raava"
          }
        }
      ],
      "text": "Overcome by her fear of her past enemies, Korra witnessed Dark Avatar Unalaq extract Raava in one of her visions."
    },
    {
      "body": "As she made her way through the swamp, Korra was haunted by visions of her old enemies once again. While pushing aside some vines, she suddenly found herself in the ${link_0} where ${link_1} took away her bending. Turning around in fear, she gasped in horror upon witnessing ${link_2} ripping ${link_3} out of her. Falling back, she witnessed herself struggle to stay out of the Avatar State while being the prisoner of the ${link_4}. Korra screamed in horror, causing ${link_5} and the ${link_6} to look at her. Moments later, she found herself in the swamp once more, resting on her hands and knees in the middle of a small creek.",
      "links": [
        {
          "body": "Pro-bending Arena",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "Amon",
          "key": "${link_1}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_2}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Raava",
          "key": "${link_3}",
          "target": {
            "href": "Raava",
            "page": "Raava"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_4}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_5}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Red Lotus sentries",
          "key": "${link_6}",
          "target": {
            "href": "Red_Lotus_sentries",
            "page": "Red_Lotus_sentries"
          }
        }
      ],
      "text": "As she made her way through the swamp, Korra was haunted by visions of her old enemies once again. While pushing aside some vines, she suddenly found herself in the Pro-bending Arena where Amon took away her bending. Turning around in fear, she gasped in horror upon witnessing Unalaq ripping Raava out of her. Falling back, she witnessed herself struggle to stay out of the Avatar State while being the prisoner of the Red Lotus. Korra screamed in horror, causing Zaheer and the Red Lotus sentries to look at her. Moments later, she found herself in the swamp once more, resting on her hands and knees in the middle of a small creek."
    },
    {
      "body": "Korra retreated to a tree root, where she was eventually found by Toph. She admitted to have had visions of all the times her past enemies had hurt her. When the elder revealed that she had expected the swamp to play tricks with the Avatar's mind, Korra called Toph a \"twisted old lady\" for willingly subjecting her to those images, though was calmly told that the swamp could sense that she was out of balance and wanted to teach her what she needed to learn if she were willing to listen. Upon being asked why she thought she kept having those visions, Korra mused that it was because Amon, Unalaq, and Zaheer had caused so much suffering for the world and herself. Although Korra believed the swamp might have been affecting Toph's mind as well when the elderly earthbender offered the advice to learn from her past enemies, she listened to Toph walking her through her visions and the ideologies of each former enemy. Korra acknowledged Toph's reasoning that their problem had been that they were out of balance and took their ideologies too far, though still did not understand why she was haunted by their visions. She was told she needed to face her fears and stop fighting her old enemies if she ever wished to be able to deal with future enemies. As Korra revealed that she did not know how to do that, Toph told her to stand up and follow the elderly earthbender to the ${link_0}.",
      "links": [
        {
          "body": "banyan-grove tree",
          "key": "${link_0}",
          "target": {
            "href": "Banyan-grove_tree",
            "page": "Banyan-grove_tree"
          }
        }
      ],
      "text": "Korra retreated to a tree root, where she was eventually found by Toph. She admitted to have had visions of all the times her past enemies had hurt her. When the elder revealed that she had expected the swamp to play tricks with the Avatar's mind, Korra called Toph a \"twisted old lady\" for willingly subjecting her to those images, though was calmly told that the swamp could sense that she was out of balance and wanted to teach her what she needed to learn if she were willing to listen. Upon being asked why she thought she kept having those visions, Korra mused that it was because Amon, Unalaq, and Zaheer had caused so much suffering for the world and herself. Although Korra believed the swamp might have been affecting Toph's mind as well when the elderly earthbender offered the advice to learn from her past enemies, she listened to Toph walking her through her visions and the ideologies of each former enemy. Korra acknowledged Toph's reasoning that their problem had been that they were out of balance and took their ideologies too far, though still did not understand why she was haunted by their visions. She was told she needed to face her fears and stop fighting her old enemies if she ever wished to be able to deal with future enemies. As Korra revealed that she did not know how to do that, Toph told her to stand up and follow the elderly earthbender to the banyan-grove tree."
    },
    {
      "body": "Arriving at the heart of the swamp, Toph explained to Korra that the roots of the banyan-grove tree connected the entire swamp and that her problem was that she had been disconnected for too long from those who loved her and from herself. Placing her hand on a root of the tree, Korra saw a vision of ${link_0}, ${link_1}, and ${link_2} in the swamp, much to her happiness. As the three young airbenders found her at the base of the banyan-grove tree, Korra shed some tears of happiness. Warmly embracing the threesome, Korra admitted to have missed them, before asking how they managed to find her. After hearing it had been a combination of Jinora's spiritual sensing ability and Ikki employing the help of soldiers due to Meelo, Korra introduced them to Toph. Upon being asked to return home to stop Kuvira, Korra was hesitant, as she believed she was not the Avatar that she used to be, especially since she could no longer access the Avatar State. Regardless, she was begged to return, as the three children believed the world needed her.",
      "links": [
        {
          "body": "Jinora",
          "key": "${link_0}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Ikki",
          "key": "${link_1}",
          "target": {
            "href": "Ikki",
            "page": "Ikki"
          }
        },
        {
          "body": "Meelo",
          "key": "${link_2}",
          "target": {
            "href": "Meelo",
            "page": "Meelo"
          }
        }
      ],
      "text": "Arriving at the heart of the swamp, Toph explained to Korra that the roots of the banyan-grove tree connected the entire swamp and that her problem was that she had been disconnected for too long from those who loved her and from herself. Placing her hand on a root of the tree, Korra saw a vision of Jinora, Ikki, and Meelo in the swamp, much to her happiness. As the three young airbenders found her at the base of the banyan-grove tree, Korra shed some tears of happiness. Warmly embracing the threesome, Korra admitted to have missed them, before asking how they managed to find her. After hearing it had been a combination of Jinora's spiritual sensing ability and Ikki employing the help of soldiers due to Meelo, Korra introduced them to Toph. Upon being asked to return home to stop Kuvira, Korra was hesitant, as she believed she was not the Avatar that she used to be, especially since she could no longer access the Avatar State. Regardless, she was begged to return, as the three children believed the world needed her."
    },
    {
      "body": "Letting go of her fears of her past enemies, ${link_0} was able to ${link_1} the ${link_2} out of her body, relieving her mental block.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "bend",
          "key": "${link_1}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "mercury",
          "key": "${link_2}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        }
      ],
      "text": "Letting go of her fears of her past enemies, Korra was able to bend the mercury out of her body, relieving her mental block."
    },
    {
      "body": "The five of them returned to Toph's dwelling in the swamp, where Korra told Toph that she was ready for the mercury to be removed, though was promptly reminded that she had to do so herself. Korra took on a firm stance and was instructed to close her eyes and clear her mind in order to focus her energy and find the metal. Starting the extraction process, she was haunted by the vision of Zaheer trying to asphyxiate her once again and broke her stance while panting in pain. As Toph reassured her that the vision she was seeing was of a fight in the past and that she needed to release the fear connected to it, she focused one more time and managed to bend out some of the mercury. Repeating the process, she succeeded in bending out all of the residual poison out of her system and moved it toward Toph, who enclosed it into a rock. Being complimented on her achievement, Korra briefly entered the Avatar State. Exiting the state, Korra realized how much lighter she felt without the poison weighing her down. Thanking Toph for all her help, she requested permission to hug the older woman, which she was granted, as Toph believed she had now earned that right. Korra mounted ${link_0} along with Jinora, Ikki, and Meelo and after saying their goodbyes to Toph, the foursome left the swamp.",
      "links": [
        {
          "body": "Pepper",
          "key": "${link_0}",
          "target": {
            "href": "Pepper",
            "page": "Pepper"
          }
        }
      ],
      "text": "The five of them returned to Toph's dwelling in the swamp, where Korra told Toph that she was ready for the mercury to be removed, though was promptly reminded that she had to do so herself. Korra took on a firm stance and was instructed to close her eyes and clear her mind in order to focus her energy and find the metal. Starting the extraction process, she was haunted by the vision of Zaheer trying to asphyxiate her once again and broke her stance while panting in pain. As Toph reassured her that the vision she was seeing was of a fight in the past and that she needed to release the fear connected to it, she focused one more time and managed to bend out some of the mercury. Repeating the process, she succeeded in bending out all of the residual poison out of her system and moved it toward Toph, who enclosed it into a rock. Being complimented on her achievement, Korra briefly entered the Avatar State. Exiting the state, Korra realized how much lighter she felt without the poison weighing her down. Thanking Toph for all her help, she requested permission to hug the older woman, which she was granted, as Toph believed she had now earned that right. Korra mounted Pepper along with Jinora, Ikki, and Meelo and after saying their goodbyes to Toph, the foursome left the swamp."
    },
    {
      "body": "Although ${link_0} had desired for her to return to ${link_1}, Korra told Jinora to set course for Zaofu, as she was determined to let Kuvira and the rest of the ${link_2} know that the Avatar was back. When Meelo grew excited over the prospect of Korra battling the metalbender, she quickly corrected him by pointing out that she believed Kuvira could be reasoned with, reminding the group that she had saved ${link_3}. Arriving at the home of the Metal Clan and witnessing the amassed ${link_4} camped before the gates of the city, Korra hoped they were still in time.",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "world",
          "key": "${link_2}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_3}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "forces",
          "key": "${link_4}",
          "target": {
            "href": "Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        }
      ],
      "text": "Although Tenzin had desired for her to return to Republic City, Korra told Jinora to set course for Zaofu, as she was determined to let Kuvira and the rest of the world know that the Avatar was back. When Meelo grew excited over the prospect of Korra battling the metalbender, she quickly corrected him by pointing out that she believed Kuvira could be reasoned with, reminding the group that she had saved Tonraq. Arriving at the home of the Metal Clan and witnessing the amassed forces camped before the gates of the city, Korra hoped they were still in time."
    },
    {
      "body": "Making her way into the city, Korra was warmly embraced and welcomed by ${link_0}. Waving off the matriarch's questions about where she had been for the past years, she asked how she could help. Korra and Suyin took a walk together, during which she asked the older woman how the relationship with Kuvira had grown sour. Korra received a brief history lesson of how Kuvira believed that Zaofu should share its knowledge about modern progress with the rest of the world, which led to her leaving the city and commencing her quest to stabilize the Earth Kingdom using all means necessary. Although Korra expressed her desire to fix the situation, she was averse to the idea of directly fighting the military leader, as she believed that conflict had only made things worse in the past.",
      "links": [
        {
          "body": "Suyin",
          "key": "${link_0}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        }
      ],
      "text": "Making her way into the city, Korra was warmly embraced and welcomed by Suyin. Waving off the matriarch's questions about where she had been for the past years, she asked how she could help. Korra and Suyin took a walk together, during which she asked the older woman how the relationship with Kuvira had grown sour. Korra received a brief history lesson of how Kuvira believed that Zaofu should share its knowledge about modern progress with the rest of the world, which led to her leaving the city and commencing her quest to stabilize the Earth Kingdom using all means necessary. Although Korra expressed her desire to fix the situation, she was averse to the idea of directly fighting the military leader, as she believed that conflict had only made things worse in the past."
    },
    {
      "body": "${link_0} was urged by ${link_1} to convince ${link_2} to give ${link_3} up.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_1}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "Suyin",
          "key": "${link_2}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "Zaofu",
          "key": "${link_3}",
          "target": {
            "href": "Zaofu",
            "page": "Zaofu"
          }
        }
      ],
      "text": "Korra was urged by Kuvira to convince Suyin to give Zaofu up."
    },
    {
      "body": "Korra left the city again in an attempt to reason with Kuvira. ${link_0} guided her to the military leader, who greeted her warmly, stating it was an honor to meet her again. Korra asked Kuvira to retreat with her army, emphasizing that she could not stand by and let her take the city. When Kuvira asked why she should treat Zaofu, the last state standing in the way of a united Earth Empire, differently from any other state, Korra avoided answering the question by posing that what Kuvira was doing was not right. However, she wavered in her resolve to get the army to back down when she realized that Kuvira had made some tough decisions to stop the world from spiraling into chaos while she had been absent to heal. Sympathizing with the reality of having people be angry due to a decision made, Korra was urged to return to Suyin and convince the matriarch to give the city up, with Kuvira promising to not attack until Korra had returned.",
      "links": [
        {
          "body": "Baatar Jr.",
          "key": "${link_0}",
          "target": {
            "href": "Baatar_Jr",
            "page": "Baatar_Jr"
          }
        }
      ],
      "text": "Korra left the city again in an attempt to reason with Kuvira. Baatar Jr. guided her to the military leader, who greeted her warmly, stating it was an honor to meet her again. Korra asked Kuvira to retreat with her army, emphasizing that she could not stand by and let her take the city. When Kuvira asked why she should treat Zaofu, the last state standing in the way of a united Earth Empire, differently from any other state, Korra avoided answering the question by posing that what Kuvira was doing was not right. However, she wavered in her resolve to get the army to back down when she realized that Kuvira had made some tough decisions to stop the world from spiraling into chaos while she had been absent to heal. Sympathizing with the reality of having people be angry due to a decision made, Korra was urged to return to Suyin and convince the matriarch to give the city up, with Kuvira promising to not attack until Korra had returned."
    },
    {
      "body": "${link_0} tried to calm ${link_1} down, who wanted to directly attack ${link_2} to free ${link_3}, ${link_4}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Opal",
          "key": "${link_1}",
          "target": {
            "href": "Opal",
            "page": "Opal"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_2}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "Suyin",
          "key": "${link_3}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "Wei, and Wing",
          "key": "${link_4}",
          "target": {
            "href": "Wei_and_Wing",
            "page": "Wei_and_Wing"
          }
        }
      ],
      "text": "Korra tried to calm Opal down, who wanted to directly attack Kuvira to free Suyin, Wei, and Wing."
    },
    {
      "body": "Returning to Zaofu, Korra learned from ${link_0} that Suyin had left with ${link_1} in order to sneak into Kuvira's camp and deal with the threat themselves. As ${link_2} and Jinora learned of the matriarch's plans as well, Korra was urged by the master airbender to stop Suyin before she did something terrible. When Opal declared that they should be helping Suyin, Korra stated that they were forced to wait since they had no idea what the matriarch's exact location and plan was, pointing out that an intervention on their part could invoke unwanted consequences by exposing the threesome. When Kuvira announced over the city's communication system that Suyin and the twins had been captured, a distraught Opal turned to Korra, pleading with her to undertake action as she could not let the army commander get away with the arrest. Korra tried to reason with her, pointing out that Kuvira had only been defending herself against Suyin's sneak attack. When Baatar asked what their next course of action was, she revealed that she and Jinora would attempt to negotiate with Kuvira at dawn, promising to do everything within her power to keep the peace. Although she allowed Opal to join her, Korra refused to let Ikki and Meelo tag along as well, explaining to the children that she could not risk anyone else being captured. Entrusting them to ${link_3} and Baatar's care, she emphasized that the men needed to make sure that the children would return safely to Tenzin if something went wrong.",
      "links": [
        {
          "body": "Baatar",
          "key": "${link_0}",
          "target": {
            "href": "Baatar",
            "page": "Baatar"
          }
        },
        {
          "body": "Wei and Wing",
          "key": "${link_1}",
          "target": {
            "href": "Wei_and_Wing",
            "page": "Wei_and_Wing"
          }
        },
        {
          "body": "Opal",
          "key": "${link_2}",
          "target": {
            "href": "Opal",
            "page": "Opal"
          }
        },
        {
          "body": "Huan",
          "key": "${link_3}",
          "target": {
            "href": "Huan",
            "page": "Huan"
          }
        }
      ],
      "text": "Returning to Zaofu, Korra learned from Baatar that Suyin had left with Wei and Wing in order to sneak into Kuvira's camp and deal with the threat themselves. As Opal and Jinora learned of the matriarch's plans as well, Korra was urged by the master airbender to stop Suyin before she did something terrible. When Opal declared that they should be helping Suyin, Korra stated that they were forced to wait since they had no idea what the matriarch's exact location and plan was, pointing out that an intervention on their part could invoke unwanted consequences by exposing the threesome. When Kuvira announced over the city's communication system that Suyin and the twins had been captured, a distraught Opal turned to Korra, pleading with her to undertake action as she could not let the army commander get away with the arrest. Korra tried to reason with her, pointing out that Kuvira had only been defending herself against Suyin's sneak attack. When Baatar asked what their next course of action was, she revealed that she and Jinora would attempt to negotiate with Kuvira at dawn, promising to do everything within her power to keep the peace. Although she allowed Opal to join her, Korra refused to let Ikki and Meelo tag along as well, explaining to the children that she could not risk anyone else being captured. Entrusting them to Huan and Baatar's care, she emphasized that the men needed to make sure that the children would return safely to Tenzin if something went wrong."
    },
    {
      "body": "${link_0} represented ${link_1}, along with ${link_2} and ${link_3}, in an attempt to negotiate with ${link_4}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Zaofu",
          "key": "${link_1}",
          "target": {
            "href": "Zaofu",
            "page": "Zaofu"
          }
        },
        {
          "body": "Opal",
          "key": "${link_2}",
          "target": {
            "href": "Opal",
            "page": "Opal"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_3}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_4}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        }
      ],
      "text": "Korra represented Zaofu, along with Opal and Jinora, in an attempt to negotiate with Kuvira."
    },
    {
      "body": "At dawn, the three women walked up to Kuvira and Korra inquired for a way for them to resolve the brewing conflict. When the army commander demanded they turn over Zaofu, Korra declared that she could not just let the city be taken, a comment for which she was chastised for interfering with internal Earth Empire business and letting herself be guided by her personal feelings as opposed to reason. Opal urged her to take Kuvira down as that was the right thing to do and when the army commander made it clear that she would only be stopped if Korra physically opposed her, the Avatar stated that she had no choice. As Kuvira challenged her for a one-on-one duel for the fate of Zaofu, declaring she was no longer relevant to bring balance, Korra accepted the challenge. Upon being asked by Jinora if she was truly ready to fight the army commander, she told the airbenders to stay back and let her handle it, as she had a lot of pent-up rage that she could use in battle. She was warned by Opal to not play around, as the master metalbender was too skilled for that. Advised to finish the battle quickly by utilizing the Avatar State, Korra declared that she would only employ the state as a last resort.",
      "links": [],
      "text": "At dawn, the three women walked up to Kuvira and Korra inquired for a way for them to resolve the brewing conflict. When the army commander demanded they turn over Zaofu, Korra declared that she could not just let the city be taken, a comment for which she was chastised for interfering with internal Earth Empire business and letting herself be guided by her personal feelings as opposed to reason. Opal urged her to take Kuvira down as that was the right thing to do and when the army commander made it clear that she would only be stopped if Korra physically opposed her, the Avatar stated that she had no choice. As Kuvira challenged her for a one-on-one duel for the fate of Zaofu, declaring she was no longer relevant to bring balance, Korra accepted the challenge. Upon being asked by Jinora if she was truly ready to fight the army commander, she told the airbenders to stay back and let her handle it, as she had a lot of pent-up rage that she could use in battle. She was warned by Opal to not play around, as the master metalbender was too skilled for that. Advised to finish the battle quickly by utilizing the Avatar State, Korra declared that she would only employ the state as a last resort."
    },
    {
      "body": "On the verge of ending ${link_0}, ${link_1} was plagued by another hallucination of herself in the ${link_2}.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "On the verge of ending Kuvira, Korra was plagued by another hallucination of herself in the Avatar State."
    },
    {
      "body": "Kuvira allowed Korra to use every element at her disposal as well as the Avatar State, baiting the younger woman by stating that she knew the Avatar was \"a little rusty\". Although Korra fiercely charged Kuvira, barraging her with elemental attacks, she failed to find an answer to the army commander's agility, swift changes between metal and earth attacks, and fast counter strikes. When Opal wanted to intervene after Korra had been knocked around a few times, she ordered the airbender to stay back, stating that she could handle the fight, although it had already taken a heavy toll on her. After she was knocked down again and Suyin urged her to enter the Avatar State, Korra entered the state and managed for the first time to land a blow. Pushing Kuvira back with airbending, she lifted herself up with an airspout while levitating a large boulder. On the verge of crushing Kuvira with it, Korra hesitated, which gave the dazed army commander the time to crawl to her knees and look up at Korra. As she did so, Korra was beset by another sudden hallucination in which Kuvira's face was substituted with her own with the eyes aglow. Shocked, she fell out of the Avatar State and tumbled down, where she needed a moment to gather her bearings. Although she still charged Kuvira, Korra was easily caught by the wrists with two metal strips and suspended in the air. After Kuvira smacked her down to the earth, she was rendered unconscious and easily encased in earth. As Kuvira moved to kill her, she was saved by Jinora and Opal, who held incoming soldiers at bay while Korra regained consciousness and broke out of her earthen prison. When Ikki and Meelo arrived on Pepper, Korra was helped on the bison by Jinora and Opal, where she lay unconscious as they all escaped from Zaofu.",
      "links": [],
      "text": "Kuvira allowed Korra to use every element at her disposal as well as the Avatar State, baiting the younger woman by stating that she knew the Avatar was \"a little rusty\". Although Korra fiercely charged Kuvira, barraging her with elemental attacks, she failed to find an answer to the army commander's agility, swift changes between metal and earth attacks, and fast counter strikes. When Opal wanted to intervene after Korra had been knocked around a few times, she ordered the airbender to stay back, stating that she could handle the fight, although it had already taken a heavy toll on her. After she was knocked down again and Suyin urged her to enter the Avatar State, Korra entered the state and managed for the first time to land a blow. Pushing Kuvira back with airbending, she lifted herself up with an airspout while levitating a large boulder. On the verge of crushing Kuvira with it, Korra hesitated, which gave the dazed army commander the time to crawl to her knees and look up at Korra. As she did so, Korra was beset by another sudden hallucination in which Kuvira's face was substituted with her own with the eyes aglow. Shocked, she fell out of the Avatar State and tumbled down, where she needed a moment to gather her bearings. Although she still charged Kuvira, Korra was easily caught by the wrists with two metal strips and suspended in the air. After Kuvira smacked her down to the earth, she was rendered unconscious and easily encased in earth. As Kuvira moved to kill her, she was saved by Jinora and Opal, who held incoming soldiers at bay while Korra regained consciousness and broke out of her earthen prison. When Ikki and Meelo arrived on Pepper, Korra was helped on the bison by Jinora and Opal, where she lay unconscious as they all escaped from Zaofu."
    },
    {
      "body": "Having recovered on the way back to Republic City, Korra excitedly waved and called to ${link_0} as Pepper approached ${link_1}. When the bison touched down, she jumped off and was momentarily lifted off the ground by her polar bear dog, with whom she happily reunited. Their cuddle session was cut short with the arrival of ${link_2}, who swept her off her feet as well in a tight hug. Returning the greeting, Korra was subsequently welcomed home by Tenzin, whom she stated to have missed during their time apart. When she needed to debrief what happened at Zaofu, Korra dejectedly noted that she had thought she was strong enough to take on Kuvira, though now felt like a failure for being unable to stop her.",
      "links": [
        {
          "body": "Naga",
          "key": "${link_0}",
          "target": {
            "href": "Naga",
            "page": "Naga"
          }
        },
        {
          "body": "Air Temple Island",
          "key": "${link_1}",
          "target": {
            "href": "Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_2}",
          "target": {
            "href": "Bumi",
            "page": "Bumi"
          }
        }
      ],
      "text": "Having recovered on the way back to Republic City, Korra excitedly waved and called to Naga as Pepper approached Air Temple Island. When the bison touched down, she jumped off and was momentarily lifted off the ground by her polar bear dog, with whom she happily reunited. Their cuddle session was cut short with the arrival of Bumi, who swept her off her feet as well in a tight hug. Returning the greeting, Korra was subsequently welcomed home by Tenzin, whom she stated to have missed during their time apart. When she needed to debrief what happened at Zaofu, Korra dejectedly noted that she had thought she was strong enough to take on Kuvira, though now felt like a failure for being unable to stop her."
    },
    {
      "body": "${link_0} snapped at ${link_1} when she thought the ${link_2} was second-guessing her judgment in regards to dealing with ${link_3}.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Hiroshi",
          "key": "${link_3}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        }
      ],
      "text": "Asami snapped at Korra when she thought the Avatar was second-guessing her judgment in regards to dealing with Hiroshi."
    },
    {
      "body": "After changing back into ${link_0}, Korra traveled down to Republic City, where she met up with ${link_1} and ${link_2} at a restaurant. Finding the engineer reading a magazine, Korra approached her and asked if she had been waiting long. When Asami good-heartedly jabbed that she had only been waiting for three years, the two women shared a hug. Expressing their joy over reuniting with her, Korra thanked Asami for complimenting her new, shorter hairdo and returned the favor by pointing out that Asami looked \"snazzy as always\". She was led inside the restaurant to meet up with Mako, who had reserved a table for them. Korra warmly embraced him as well, though their reunion was cut short by Prince Wu. When she revealed to him that Mako had not told her anything about him, the prince placed an arm around her shoulders and escorted her toward their booth, much to her surprise and discomfort. Korra soon grew annoyed with Wu and firmly told him off when he asked her to enter the Avatar State so he could see her eyes glow. When Asami asked if she had regained the ability, adding that she had been worried when Korra had written to her that she could not, Mako felt excluded and asked for an explanation. After exchanging glances with Asami, Korra revealed that she had been in contact with Asami during her recovery at the South Pole and had asked her not to tell him, as she had not known what to say to him. Korra apologized for not staying in touch, though added that she was back and wanted to know everything about their lives. As Asami revealed that she had visited her father for the first time since his imprisonment, Korra asked if she was sure he could be trusted and was not just manipulating Asami again. The question rubbed the industrialist the wrong way, however, and she snapped at Korra that it was not her place to second-guess Asami's actions and decide what was best for her, since she had disappeared for three years. Korra defended herself by pointing out that she had not planned to be gone that long, though had merely never felt ready before to return. Their brewing argument was interrupted when Prince Wu announced he needed to go to the bathroom and snapped his fingers at Mako to spur him to action. As the firebender told the prince to go by himself, Korra asked him if he always accompanied Wu to the bathroom, though halfway through Mako's explanation that he normally just stood guard in his general vicinity, he decided that he did not want to talk about it.",
      "links": [
        {
          "body": "Water Tribe clothing",
          "key": "${link_0}",
          "target": {
            "href": "Fashion_in_the_World_of_Avatar",
            "page": "Fashion_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Mako",
          "key": "${link_2}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "After changing back into Water Tribe clothing, Korra traveled down to Republic City, where she met up with Asami and Mako at a restaurant. Finding the engineer reading a magazine, Korra approached her and asked if she had been waiting long. When Asami good-heartedly jabbed that she had only been waiting for three years, the two women shared a hug. Expressing their joy over reuniting with her, Korra thanked Asami for complimenting her new, shorter hairdo and returned the favor by pointing out that Asami looked \"snazzy as always\". She was led inside the restaurant to meet up with Mako, who had reserved a table for them. Korra warmly embraced him as well, though their reunion was cut short by Prince Wu. When she revealed to him that Mako had not told her anything about him, the prince placed an arm around her shoulders and escorted her toward their booth, much to her surprise and discomfort. Korra soon grew annoyed with Wu and firmly told him off when he asked her to enter the Avatar State so he could see her eyes glow. When Asami asked if she had regained the ability, adding that she had been worried when Korra had written to her that she could not, Mako felt excluded and asked for an explanation. After exchanging glances with Asami, Korra revealed that she had been in contact with Asami during her recovery at the South Pole and had asked her not to tell him, as she had not known what to say to him. Korra apologized for not staying in touch, though added that she was back and wanted to know everything about their lives. As Asami revealed that she had visited her father for the first time since his imprisonment, Korra asked if she was sure he could be trusted and was not just manipulating Asami again. The question rubbed the industrialist the wrong way, however, and she snapped at Korra that it was not her place to second-guess Asami's actions and decide what was best for her, since she had disappeared for three years. Korra defended herself by pointing out that she had not planned to be gone that long, though had merely never felt ready before to return. Their brewing argument was interrupted when Prince Wu announced he needed to go to the bathroom and snapped his fingers at Mako to spur him to action. As the firebender told the prince to go by himself, Korra asked him if he always accompanied Wu to the bathroom, though halfway through Mako's explanation that he normally just stood guard in his general vicinity, he decided that he did not want to talk about it."
    },
    {
      "body": "After stopping Prince ${link_0}'s ${link_1} from escaping, ${link_2} handed him over to ${link_3} for questioning about Wu's whereabouts.",
      "links": [
        {
          "body": "Wu",
          "key": "${link_0}",
          "target": {
            "href": "Wu",
            "page": "Wu"
          }
        },
        {
          "body": "kidnapper",
          "key": "${link_1}",
          "target": {
            "href": "Bathroom_attendant",
            "page": "Bathroom_attendant"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_3}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "After stopping Prince Wu's kidnapper from escaping, Korra handed him over to Mako for questioning about Wu's whereabouts."
    },
    {
      "body": "When Wu stayed absent for a suspicious amount of time, the team made their way toward the bathrooms, where Korra and Asami remained in the hallway while Mako inspected the men's restroom. Via an open door, Korra noticed restaurant personnel loading laundry into a truck. Telling Asami she would be right back, she approached the men and asked if they had seen Prince Wu. When the ${link_0} told her he had not seen the royal, Korra noticed a semi-conscious prince roll out of the laundry. Before she could take action, however, she was catapulted in the air with earthbending. Korra told Asami and Mako, who had come running upon hearing the ruckus, to get the car while she gave chase to the vehicle that contained Wu. She ran on the street and tried to halt the truck with her earthbending, but it managed to evade her attack. When Asami pulled up, Korra jumped into the car and they gave chase. Although the kidnappers momentarily managed to shake them, they found them again and when driving parallel to the truck, albeit a level higher, Korra jumped out of the car and atop the moving vehicle. She pried open the roof with her metalbending, though upon finding the vehicle deserted, save for the driver, she quickly incapacitated him with airbending and brought the truck to a stop. Korra dragged the kidnapper out, where Mako interrogated him about the prince's whereabouts, though without success. Not knowing where to start looking for Wu first, Korra approached a spirit vine and placed her hand on top of it, tracking Wu's energy via the vegetation. Deducing that the kidnappers had moved him to a smaller Satomobile and were taking him to ${link_1}, she spurred her friends to action and they too made their way toward the train station. En route, she explained to Mako and Asami that Toph had taught her how to connect to people's energy via the spirit vines. When asked what the old earthbender was like, she good-heartedly described her as a \"cranky, more miserable version of ${link_2}\".",
      "links": [
        {
          "body": "man",
          "key": "${link_0}",
          "target": {
            "href": "Bathroom_attendant",
            "page": "Bathroom_attendant"
          }
        },
        {
          "body": "Central City Station",
          "key": "${link_1}",
          "target": {
            "href": "Central_City_Station",
            "page": "Central_City_Station"
          }
        },
        {
          "body": "Lin",
          "key": "${link_2}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        }
      ],
      "text": "When Wu stayed absent for a suspicious amount of time, the team made their way toward the bathrooms, where Korra and Asami remained in the hallway while Mako inspected the men's restroom. Via an open door, Korra noticed restaurant personnel loading laundry into a truck. Telling Asami she would be right back, she approached the men and asked if they had seen Prince Wu. When the man told her he had not seen the royal, Korra noticed a semi-conscious prince roll out of the laundry. Before she could take action, however, she was catapulted in the air with earthbending. Korra told Asami and Mako, who had come running upon hearing the ruckus, to get the car while she gave chase to the vehicle that contained Wu. She ran on the street and tried to halt the truck with her earthbending, but it managed to evade her attack. When Asami pulled up, Korra jumped into the car and they gave chase. Although the kidnappers momentarily managed to shake them, they found them again and when driving parallel to the truck, albeit a level higher, Korra jumped out of the car and atop the moving vehicle. She pried open the roof with her metalbending, though upon finding the vehicle deserted, save for the driver, she quickly incapacitated him with airbending and brought the truck to a stop. Korra dragged the kidnapper out, where Mako interrogated him about the prince's whereabouts, though without success. Not knowing where to start looking for Wu first, Korra approached a spirit vine and placed her hand on top of it, tracking Wu's energy via the vegetation. Deducing that the kidnappers had moved him to a smaller Satomobile and were taking him to Central City Station, she spurred her friends to action and they too made their way toward the train station. En route, she explained to Mako and Asami that Toph had taught her how to connect to people's energy via the spirit vines. When asked what the old earthbender was like, she good-heartedly described her as a \"cranky, more miserable version of Lin\"."
    },
    {
      "body": "${link_0} snapped at ${link_1} when he questioned her ${link_2} intuition about Prince ${link_3}'s whereabouts.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Wu",
          "key": "${link_3}",
          "target": {
            "href": "Wu",
            "page": "Wu"
          }
        }
      ],
      "text": "Korra snapped at Mako when he questioned her Avatar intuition about Prince Wu's whereabouts."
    },
    {
      "body": "Arriving at the station, the threesome ran inside, though upon witnessing a multitude of waiting ${link_0} without any clue on which one Wu was taken, they split up. Regrouping after an initial futile search, Korra sensed for Wu's energy once again and urged them all the hop aboard the 4:15 leaving the station for ${link_1}. Searching the wagons, she told an irritated Mako that she was not certain the prince was on that train, but that she had a feeling he was. When he voiced his skepticism over having to trust her \"Avatar feelings\", Korra snapped at him, pointing out that he would not have to trust her if he had guarded the prince as he was directed. Making their way to the luggage cart, Korra stated that it certainly was not her fault Wu had been kidnapped. Asami broke up their bickering by ordering them to silence, which enabled them all to hear a tapping coming from inside a chest, which turned out to be caused by Wu. With the prince released, two of Kuvira's agents attacked them, however, prompting Korra to defend the group by knocking the metal strips fired at them away and incapacitating the aggressors with her airbending. Noticing more agents starting to close in on them, Korra bent open the roof of their cart and ordered everyone out. When Wu refused to go out there, she grew annoyed and unceremoniously airbent him atop the roof of the next wagon, before rising to the top with airbending herself and helping Asami up. Jumping on the next cart, she caught Wu, who was tossed at her by Mako and dragged him along. When one of Kuvira's agents shot a metal cable at the prince, she intercepted the object and twirled it around her own arm, holding the agent in place. She was released when Mako forced the assailant back with his firebending, though they had nowhere to go when the agents started to curl the roof of their cart toward them. Before they were completely cornered, Korra encircled their little party with air, grabbed Asami and Wu, and jumped against Mako to push them all off the moving train and down a bridge, where they all made a safe landing due to the air bubble.",
      "links": [
        {
          "body": "trains",
          "key": "${link_0}",
          "target": {
            "href": "Train",
            "page": "Train"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_1}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        }
      ],
      "text": "Arriving at the station, the threesome ran inside, though upon witnessing a multitude of waiting trains without any clue on which one Wu was taken, they split up. Regrouping after an initial futile search, Korra sensed for Wu's energy once again and urged them all the hop aboard the 4:15 leaving the station for Omashu. Searching the wagons, she told an irritated Mako that she was not certain the prince was on that train, but that she had a feeling he was. When he voiced his skepticism over having to trust her \"Avatar feelings\", Korra snapped at him, pointing out that he would not have to trust her if he had guarded the prince as he was directed. Making their way to the luggage cart, Korra stated that it certainly was not her fault Wu had been kidnapped. Asami broke up their bickering by ordering them to silence, which enabled them all to hear a tapping coming from inside a chest, which turned out to be caused by Wu. With the prince released, two of Kuvira's agents attacked them, however, prompting Korra to defend the group by knocking the metal strips fired at them away and incapacitating the aggressors with her airbending. Noticing more agents starting to close in on them, Korra bent open the roof of their cart and ordered everyone out. When Wu refused to go out there, she grew annoyed and unceremoniously airbent him atop the roof of the next wagon, before rising to the top with airbending herself and helping Asami up. Jumping on the next cart, she caught Wu, who was tossed at her by Mako and dragged him along. When one of Kuvira's agents shot a metal cable at the prince, she intercepted the object and twirled it around her own arm, holding the agent in place. She was released when Mako forced the assailant back with his firebending, though they had nowhere to go when the agents started to curl the roof of their cart toward them. Before they were completely cornered, Korra encircled their little party with air, grabbed Asami and Wu, and jumped against Mako to push them all off the moving train and down a bridge, where they all made a safe landing due to the air bubble."
    },
    {
      "body": "Moving past the tension, ${link_0} shared a warm hug with ${link_1} and ${link_2}, truly reuniting as a ${link_3}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "team",
          "key": "${link_3}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "text": "Moving past the tension, Korra shared a warm hug with Mako and Asami, truly reuniting as a team."
    },
    {
      "body": "Wu bowed to Korra in gratitude for having saved his life and asked her out to repay her. She quickly rejected his offer, however, and made her way to her friends, noting that the rescue mission was not exactly how she had expected their reunion to be. When Asami stated that it reminded her of their old times, minus the \"getting on each other's nerves part\", Korra smugly looked at Mako when he good-heartedly jabbed that annoying and be annoyed by her was normal for him. Korra apologized for the earlier tension, noting that there was no place she would rather be than with them, and the three friends shared a hug. When Wu wanted to join in, Korra kept him at bay with a hand to his face. Breaking the embrace, she asked what they were going to do with Wu, noting that it was too dangerous to bring him back to the ${link_0}, upon which Mako took them all to the ${link_1}, where the prince would stay with Mako's family already residing there.",
      "links": [
        {
          "body": "Republic City Four Elements",
          "key": "${link_0}",
          "target": {
            "href": "Republic_City_Four_Elements",
            "page": "Republic_City_Four_Elements"
          }
        },
        {
          "body": "Sato estate",
          "key": "${link_1}",
          "target": {
            "href": "Sato_estate",
            "page": "Sato_estate"
          }
        }
      ],
      "text": "Wu bowed to Korra in gratitude for having saved his life and asked her out to repay her. She quickly rejected his offer, however, and made her way to her friends, noting that the rescue mission was not exactly how she had expected their reunion to be. When Asami stated that it reminded her of their old times, minus the \"getting on each other's nerves part\", Korra smugly looked at Mako when he good-heartedly jabbed that annoying and be annoyed by her was normal for him. Korra apologized for the earlier tension, noting that there was no place she would rather be than with them, and the three friends shared a hug. When Wu wanted to join in, Korra kept him at bay with a hand to his face. Breaking the embrace, she asked what they were going to do with Wu, noting that it was too dangerous to bring him back to the Republic City Four Elements, upon which Mako took them all to the Sato estate, where the prince would stay with Mako's family already residing there."
    },
    {
      "body": "${link_0} reminisced about her role and purpose as the ${link_1}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Korra reminisced about her role and purpose as the Avatar."
    },
    {
      "body": "Korra traveled back to Air Temple Island with Asami, where she retreated to the meditation pavilion. Lost in thought, she was approached by Asami and offered a cup of tea against the cold. When asked if she was okay, Korra revealed that she had been thinking about Toph's statement of the Avatar being redundant and it being basically pointless to try and stop Kuvira. As Asami firmly told her that was a ridiculous notion, Korra stated that she did not believe it either at first, writing it off as Toph being cranky, though after reflecting on her past, she came to see reason in the statement, as she concluded that the world seemed to always be out of balance, regardless of her actions. To clarify her point, Korra explained that she had grown up anxious to be the Avatar and change things in the world, though meeting Amon had shattered her hopes when he had taken hers and others' bending away. Although Asami countered her self-deprecating thoughts by highlighting all the good things she had accomplished, such as decapitating the ${link_0} movement and allowing for free election to be held in the ${link_1}, which increased the representation of nonbenders, Korra remained distant, as the hope she had given people had not last due to Unalaq's actions. She felt guilty over having betrayed Tenzin due to her uncle and for opening the portals, which threw both the human and ${link_2} into chaos. She blamed herself for the creation of the Dark Avatar and the destruction of Raava. Korra countered Asami's uplifting words of her restoring the Air Nation and causing a positive shift in the world by pointing out that by bringing airbending back, Zaheer had also been given the power and used it to nearly kill her and cause the world to be more out of balance than ever. Exclaiming that nothing had changed, Korra was surprised to find that Tenzin agreed with her. After the airbending master explained that while she would always have new enemies to face, he pointed out that she had learned from her past enemies and bettered herself, maturing from a hot-headed and slightly selfish person to a thoughtful young woman who placed the needs of others before her own and had become an inspiration to the world. Touched, Korra thanked both Asami and Tenzin for placing things in perspective for her, announcing that she would never stop trying to bring balance to the world.",
      "links": [
        {
          "body": "Equalist",
          "key": "${link_0}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "United Republic",
          "key": "${link_1}",
          "target": {
            "href": "United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Korra traveled back to Air Temple Island with Asami, where she retreated to the meditation pavilion. Lost in thought, she was approached by Asami and offered a cup of tea against the cold. When asked if she was okay, Korra revealed that she had been thinking about Toph's statement of the Avatar being redundant and it being basically pointless to try and stop Kuvira. As Asami firmly told her that was a ridiculous notion, Korra stated that she did not believe it either at first, writing it off as Toph being cranky, though after reflecting on her past, she came to see reason in the statement, as she concluded that the world seemed to always be out of balance, regardless of her actions. To clarify her point, Korra explained that she had grown up anxious to be the Avatar and change things in the world, though meeting Amon had shattered her hopes when he had taken hers and others' bending away. Although Asami countered her self-deprecating thoughts by highlighting all the good things she had accomplished, such as decapitating the Equalist movement and allowing for free election to be held in the United Republic, which increased the representation of nonbenders, Korra remained distant, as the hope she had given people had not last due to Unalaq's actions. She felt guilty over having betrayed Tenzin due to her uncle and for opening the portals, which threw both the human and Spirit World into chaos. She blamed herself for the creation of the Dark Avatar and the destruction of Raava. Korra countered Asami's uplifting words of her restoring the Air Nation and causing a positive shift in the world by pointing out that by bringing airbending back, Zaheer had also been given the power and used it to nearly kill her and cause the world to be more out of balance than ever. Exclaiming that nothing had changed, Korra was surprised to find that Tenzin agreed with her. After the airbending master explained that while she would always have new enemies to face, he pointed out that she had learned from her past enemies and bettered herself, maturing from a hot-headed and slightly selfish person to a thoughtful young woman who placed the needs of others before her own and had become an inspiration to the world. Touched, Korra thanked both Asami and Tenzin for placing things in perspective for her, announcing that she would never stop trying to bring balance to the world."
    },
    {
      "body": "${link_0} sensed what ${link_1} and her ${link_2} was doing to the ${link_3}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_1}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "army",
          "key": "${link_2}",
          "target": {
            "href": "Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        },
        {
          "body": "banyan-grove tree",
          "key": "${link_3}",
          "target": {
            "href": "Banyan-grove_tree",
            "page": "Banyan-grove_tree"
          }
        }
      ],
      "text": "Korra sensed what Kuvira and her army was doing to the banyan-grove tree."
    },
    {
      "body": "While having some leisurely playtime with Naga, Korra noticed Opal standing sadly sulking by herself and asked if everything was all right. As the young airbender vented that no one but her seemed to care that Kuvira had her family, Korra reassured her that everything would turn out fine. Their conversation was interrupted by Jinora, however, who alerted them of the strange surge of energy she had felt emanating from the ${link_0}. Convinced something was wrong, the three women set out to investigate. After an initial search resulted in nothing out of the ordinary, Jinora speculated that something might have befallen ${link_1} and his tour group, since they should have encountered them, though Korra interjected that since it was Ryu, the tour group could have left the wilds. Although she could not sense how strange the energy around them was, Korra could get a reading of the plants and saw a vision of Kuvira harvesting roots from the Foggy Swamp, deducing that to be the source of the strange energy surge Jinora sensed. While Jinora continued the search for Ryu and his group, Korra and Opal headed to ${link_2} to alert ${link_3} ${link_4} about their discovery.",
      "links": [
        {
          "body": "Spirit Wilds",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "Ryu",
          "key": "${link_1}",
          "target": {
            "href": "Ryu",
            "page": "Ryu"
          }
        },
        {
          "body": "City Hall",
          "key": "${link_2}",
          "target": {
            "href": "City_Hall",
            "page": "City_Hall"
          }
        },
        {
          "body": "President",
          "key": "${link_3}",
          "target": {
            "href": "President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_4}",
          "target": {
            "href": "Raiko",
            "page": "Raiko"
          }
        }
      ],
      "text": "While having some leisurely playtime with Naga, Korra noticed Opal standing sadly sulking by herself and asked if everything was all right. As the young airbender vented that no one but her seemed to care that Kuvira had her family, Korra reassured her that everything would turn out fine. Their conversation was interrupted by Jinora, however, who alerted them of the strange surge of energy she had felt emanating from the Spirit Wilds. Convinced something was wrong, the three women set out to investigate. After an initial search resulted in nothing out of the ordinary, Jinora speculated that something might have befallen Ryu and his tour group, since they should have encountered them, though Korra interjected that since it was Ryu, the tour group could have left the wilds. Although she could not sense how strange the energy around them was, Korra could get a reading of the plants and saw a vision of Kuvira harvesting roots from the Foggy Swamp, deducing that to be the source of the strange energy surge Jinora sensed. While Jinora continued the search for Ryu and his group, Korra and Opal headed to City Hall to alert President Raiko about their discovery."
    },
    {
      "body": "${link_0} was glad to reunite with ${link_1} and learn that her friends still wanted her around, even after having failed to stop ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_2}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        }
      ],
      "text": "Korra was glad to reunite with Bolin and learn that her friends still wanted her around, even after having failed to stop Kuvira."
    },
    {
      "body": "Korra and Opal barged into the council room, though Korra was surprised to find that they had walked in on a meeting between the world leaders, sans the ${link_0}' representatives, and grew annoyed upon learning that she had purposely not been invited. Raiko angrily chastised her for having barged in, though before the conflict could escalate, ${link_1} and ${link_2} ran into the room as well and alerted everyone present of Kuvira's plans to build a super weapon. Korra completed their story by stating that it had something to do with spirit vines, as her vision had learned her that much. As the meeting was concluded with the United Republic fortifying its borders, Korra and Mako met up with Bolin outside of the building. Approaching him, she confirmed Mako's statement that they were glad he was back as they had been worried about him and embraced him warmly. When Bolin stated that he hoped he could regain Mako's trust after having rejected his advice the last time they met, Korra tried to make him feel better by pointing out that if anyone had lost people's trust, it was her, since she felt like no one wanted her around ever since Kuvira defeated her at Zaofu. Mako cheered her up, however, by stating that if no one else, at least they wanted her around, before they all shared another embrace.",
      "links": [
        {
          "body": "Water Tribes",
          "key": "${link_0}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_2}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "text": "Korra and Opal barged into the council room, though Korra was surprised to find that they had walked in on a meeting between the world leaders, sans the Water Tribes' representatives, and grew annoyed upon learning that she had purposely not been invited. Raiko angrily chastised her for having barged in, though before the conflict could escalate, Bolin and Varrick ran into the room as well and alerted everyone present of Kuvira's plans to build a super weapon. Korra completed their story by stating that it had something to do with spirit vines, as her vision had learned her that much. As the meeting was concluded with the United Republic fortifying its borders, Korra and Mako met up with Bolin outside of the building. Approaching him, she confirmed Mako's statement that they were glad he was back as they had been worried about him and embraced him warmly. When Bolin stated that he hoped he could regain Mako's trust after having rejected his advice the last time they met, Korra tried to make him feel better by pointing out that if anyone had lost people's trust, it was her, since she felt like no one wanted her around ever since Kuvira defeated her at Zaofu. Mako cheered her up, however, by stating that if no one else, at least they wanted her around, before they all shared another embrace."
    },
    {
      "body": "Much to her distress, ${link_0} discovered that ${link_1}'s memory blocked her from meditating into the ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_1}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Much to her distress, Korra discovered that Zaheer's memory blocked her from meditating into the Spirit World."
    },
    {
      "body": "When Bolin left, Korra and Mako continued talking to one another, though their conversation was interrupted by Jinora's spiritual projection, who called for help as the spirit vines were taking her captive. They hurried toward the spirit forest, though found its entrance under police surveillance. Korra asked Lin to be granted access, stating that even though she was not the Avatar she used to be, she was capable of saving Jinora. Although Lin was reluctant at first, she let Korra and Mako in after a spirit vine had shot out of the wilds, emphasizing the dire situation the captured people were in. Searching the vegetation, Korra and Mako were attacked by more vines and after saving Mako from being dragged off by a vine, she led him inside a nearby building, sealing it with her earthbending. There, they found several glowing pods and, upon learning that they contained the bodies of the captured people while trapping their souls in the Spirit World, Korra tried to open them with her ${link_0}. After that failed, she attempted to meditate into the Spirit World. She never made it there, however, as she was transported back to her fight with Zaheer. She was shocked to learn that she once again suffered from the poison, which left her vulnerable to Zaheer's asphyxiation attempt. Gasping for air, she broke out of her meditation and confided in Mako that Zaheer's memory had been bothering her for years, preventing her from attaining any peace and meditating into the Spirit World.",
      "links": [
        {
          "body": "spiritbending",
          "key": "${link_0}",
          "target": {
            "href": "Healing#Spiritbending",
            "page": "Healing"
          }
        }
      ],
      "text": "When Bolin left, Korra and Mako continued talking to one another, though their conversation was interrupted by Jinora's spiritual projection, who called for help as the spirit vines were taking her captive. They hurried toward the spirit forest, though found its entrance under police surveillance. Korra asked Lin to be granted access, stating that even though she was not the Avatar she used to be, she was capable of saving Jinora. Although Lin was reluctant at first, she let Korra and Mako in after a spirit vine had shot out of the wilds, emphasizing the dire situation the captured people were in. Searching the vegetation, Korra and Mako were attacked by more vines and after saving Mako from being dragged off by a vine, she led him inside a nearby building, sealing it with her earthbending. There, they found several glowing pods and, upon learning that they contained the bodies of the captured people while trapping their souls in the Spirit World, Korra tried to open them with her spiritbending. After that failed, she attempted to meditate into the Spirit World. She never made it there, however, as she was transported back to her fight with Zaheer. She was shocked to learn that she once again suffered from the poison, which left her vulnerable to Zaheer's asphyxiation attempt. Gasping for air, she broke out of her meditation and confided in Mako that Zaheer's memory had been bothering her for years, preventing her from attaining any peace and meditating into the Spirit World."
    },
    {
      "body": "Concluding she needed to face Zaheer if she wanted to save Jinora, Korra asked Tenzin to be granted clearance to visit the ${link_0}. When he refused, however, Korra sadly noted that he too had lost faith in her, just like everyone else. As Tenzin clarified that he was merely worried about Jinora and could not bear the thought of something happening to her as well, she emphasized that she would be all right and hugged him when he gave her the permission she needed.",
      "links": [
        {
          "body": "prison",
          "key": "${link_0}",
          "target": {
            "href": "White_Lotus_prisons#Zaheer.27s_prisons",
            "page": "White_Lotus_prisons"
          }
        }
      ],
      "text": "Concluding she needed to face Zaheer if she wanted to save Jinora, Korra asked Tenzin to be granted clearance to visit the prison. When he refused, however, Korra sadly noted that he too had lost faith in her, just like everyone else. As Tenzin clarified that he was merely worried about Jinora and could not bear the thought of something happening to her as well, she emphasized that she would be all right and hugged him when he gave her the permission she needed."
    },
    {
      "body": "${link_0} visited ${link_1} in ${link_2}, hoping that by facing him, she would be able to release her fear of him.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_1}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "his prison",
          "key": "${link_2}",
          "target": {
            "href": "White_Lotus_prisons#Zaheer.27s_prisons",
            "page": "White_Lotus_prisons"
          }
        }
      ],
      "text": "Korra visited Zaheer in his prison, hoping that by facing him, she would be able to release her fear of him."
    },
    {
      "body": "On the verge of entering the prison, Korra confirmed her readiness to face Zaheer to Mako, noting that she hoped she would realize he was no longer a threat to her by seeing him in chains. Entering his cell by herself, she told the airbender that she had come to look him in the eye and tell him that he had no power over her, since she would no longer be afraid of him. Her statement was debunked, however, when she cowered back in fear when Zaheer flew straight toward her, even though he could not reach her due to his chains. Believing her visit to be a mistake, Korra started to leave, though when Zaheer declared he knew why she was there, she angrily snapped at him that he did not know anything about her. She was surprised to learn that he knew she had been unable to meditate into the Spirit World, outing her incredulity over him being able to cross over from his cell, since it was not very spiritually charged. When Zaheer declared that her problem was her inability to tap into the spiritual energy around her, Korra snapped at him that he was her problem, blaming him for having ruined her by poisoning her, since people no longer believed that she was capable of anything. She sadly noted that she had hoped to put an end to her troubles by facing him and added that it was perhaps time she accepted that she would never be the same. Zaheer pointed out, however, that neither of them were the same as before their encounter; he had learned how to fly, though was bound by his chains, and while Korra had all the power in the world and the freedom to use it, she chose to hold herself down. Korra countered that she was not holding herself down, though that her powers merely had limits. She was corrected by Zaheer, who explained he believed her powers to be limitless, since she had been able to fight off the mercury poison that should have killed her.",
      "links": [],
      "text": "On the verge of entering the prison, Korra confirmed her readiness to face Zaheer to Mako, noting that she hoped she would realize he was no longer a threat to her by seeing him in chains. Entering his cell by herself, she told the airbender that she had come to look him in the eye and tell him that he had no power over her, since she would no longer be afraid of him. Her statement was debunked, however, when she cowered back in fear when Zaheer flew straight toward her, even though he could not reach her due to his chains. Believing her visit to be a mistake, Korra started to leave, though when Zaheer declared he knew why she was there, she angrily snapped at him that he did not know anything about her. She was surprised to learn that he knew she had been unable to meditate into the Spirit World, outing her incredulity over him being able to cross over from his cell, since it was not very spiritually charged. When Zaheer declared that her problem was her inability to tap into the spiritual energy around her, Korra snapped at him that he was her problem, blaming him for having ruined her by poisoning her, since people no longer believed that she was capable of anything. She sadly noted that she had hoped to put an end to her troubles by facing him and added that it was perhaps time she accepted that she would never be the same. Zaheer pointed out, however, that neither of them were the same as before their encounter; he had learned how to fly, though was bound by his chains, and while Korra had all the power in the world and the freedom to use it, she chose to hold herself down. Korra countered that she was not holding herself down, though that her powers merely had limits. She was corrected by Zaheer, who explained he believed her powers to be limitless, since she had been able to fight off the mercury poison that should have killed her."
    },
    {
      "body": "With no other options left to her, ${link_0} agreed to let ${link_1} guide her into the ${link_2} and help her to let go of her fear of \"what might have been\".",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_1}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "With no other options left to her, Korra agreed to let Zaheer guide her into the Spirit World and help her to let go of her fear of \"what might have been\"."
    },
    {
      "body": "Korra shrugged off the notion of her block being a conscious choice and sarcastically thanked him for having created the \"worst dictator the Earth Kingdom [had] ever seen\" by killing Hou-Ting. Since she was powerless to stop her due to her mental block, Zaheer offered to guide her into the Spirit World. Although Korra initially refused his help, noting he could not be trusted, she relented after Zaheer pointed out that she had no other options left. As she assumed a lotus position, she was urged to focus on the sound of his voice and clear her mind, though she was soon plagued by the same vision again of Zaheer trying to asphyxiate her. Gasping for air, she was told to let the vision run its course. As she noted with a pained expression that she could not do that, Zaheer calmly told her that she could and that she merely needed to accept what had happened to her, as opposed to holding on to a fear of what might have been. Noting that she had no control, she plummeted down toward the ground in her vision, though was urged by Zaheer to not be afraid and hold on. As her body crashed through the ground, the large chunks of earth morphed into spirits and Korra noted in surprise that she had made it into the Spirit World with Zaheer's guidance. Asking him if he knew where she could find Jinora and the others, he replied that she already knew that, before fading back to the physical world.",
      "links": [],
      "text": "Korra shrugged off the notion of her block being a conscious choice and sarcastically thanked him for having created the \"worst dictator the Earth Kingdom [had] ever seen\" by killing Hou-Ting. Since she was powerless to stop her due to her mental block, Zaheer offered to guide her into the Spirit World. Although Korra initially refused his help, noting he could not be trusted, she relented after Zaheer pointed out that she had no other options left. As she assumed a lotus position, she was urged to focus on the sound of his voice and clear her mind, though she was soon plagued by the same vision again of Zaheer trying to asphyxiate her. Gasping for air, she was told to let the vision run its course. As she noted with a pained expression that she could not do that, Zaheer calmly told her that she could and that she merely needed to accept what had happened to her, as opposed to holding on to a fear of what might have been. Noting that she had no control, she plummeted down toward the ground in her vision, though was urged by Zaheer to not be afraid and hold on. As her body crashed through the ground, the large chunks of earth morphed into spirits and Korra noted in surprise that she had made it into the Spirit World with Zaheer's guidance. Asking him if he knew where she could find Jinora and the others, he replied that she already knew that, before fading back to the physical world."
    },
    {
      "body": "After reestablishing her connection with ${link_0}, the Light Spirit helped ${link_1} to find the trapped souls of ${link_2}, ${link_3}, and the ${link_4} tourists in the ${link_5}.",
      "links": [
        {
          "body": "Raava",
          "key": "${link_0}",
          "target": {
            "href": "Raava",
            "page": "Raava"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_2}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Ryu",
          "key": "${link_3}",
          "target": {
            "href": "Ryu",
            "page": "Ryu"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_4}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_5}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "After reestablishing her connection with Raava, the Light Spirit helped Korra to find the trapped souls of Jinora, Ryu, and the Republic City tourists in the Spirit World."
    },
    {
      "body": "As Zaheer left, Raava's spirit lit up within Korra and she fondly asked where she had been, as she had missed her. After learning that Raava had always been inside of her, she asked the spirit for help with finding Jinora, to which she was taken to another place in the Spirit World, where the souls of the group were trapped in a spherical force field. Asking how she could release them, Raava told Korra that she needed to bend the energy within. When she pointed out that she was powerless in the Spirit World, Raava corrected her, stating that she was at her most powerful there, since she was connected to all the spiritual energy. Following the advice, Korra placed her hand on the sphere and entered the Avatar State, bending the energy within and releasing all the trapped souls.",
      "links": [],
      "text": "As Zaheer left, Raava's spirit lit up within Korra and she fondly asked where she had been, as she had missed her. After learning that Raava had always been inside of her, she asked the spirit for help with finding Jinora, to which she was taken to another place in the Spirit World, where the souls of the group were trapped in a spherical force field. Asking how she could release them, Raava told Korra that she needed to bend the energy within. When she pointed out that she was powerless in the Spirit World, Raava corrected her, stating that she was at her most powerful there, since she was connected to all the spiritual energy. Following the advice, Korra placed her hand on the sphere and entered the Avatar State, bending the energy within and releasing all the trapped souls."
    },
    {
      "body": "Upon returning to the material world and leaving Zaheer's prison, Korra told Mako that she felt whole again, as she was finally able to accept what had happened. Although she would never forget what Zaheer did to her, Korra could move on with her life and believed the experience would make her stronger.",
      "links": [],
      "text": "Upon returning to the material world and leaving Zaheer's prison, Korra told Mako that she felt whole again, as she was finally able to accept what had happened. Although she would never forget what Zaheer did to her, Korra could move on with her life and believed the experience would make her stronger."
    },
    {
      "body": "Korra was later present at a meeting with Raiko, Mako, Wu, Tenzin, Varrick, and Asami, during which the latter two presented their plans to manufacture ${link_0} to protect the city against a possible attack of Kuvira. When Raiko demanded the two inventors to create spirit vine weapons for him, Korra sternly told him off, reasoning that it was Kuvira's harvesting of the plants that made the city's Spirit Wilds turn hostile and abduct people. Although she also refused to harvest the plants herself in her capacity as the bridge between the two worlds, she did offer to talk to the spirits and ask them to help with defending the city, since it had also become their home.",
      "links": [
        {
          "body": "flying mecha suits",
          "key": "${link_0}",
          "target": {
            "href": "Hummingbird_mecha_suit",
            "page": "Hummingbird_mecha_suit"
          }
        }
      ],
      "text": "Korra was later present at a meeting with Raiko, Mako, Wu, Tenzin, Varrick, and Asami, during which the latter two presented their plans to manufacture flying mecha suits to protect the city against a possible attack of Kuvira. When Raiko demanded the two inventors to create spirit vine weapons for him, Korra sternly told him off, reasoning that it was Kuvira's harvesting of the plants that made the city's Spirit Wilds turn hostile and abduct people. Although she also refused to harvest the plants herself in her capacity as the bridge between the two worlds, she did offer to talk to the spirits and ask them to help with defending the city, since it had also become their home."
    },
    {
      "body": "After Raiko accepted her idea and ordered everyone to give him daily updates about their progress, Korra retreated to the Spirit Wilds, where she hoped to track down some of the spirits living there. Finding one, she asked if they could have a word, though before a conversation could unfold, the spirit vanished, much to her dismay. Noticing more spirits doing the same, Korra sadly concluded that they were abandoning the city.",
      "links": [],
      "text": "After Raiko accepted her idea and ordered everyone to give him daily updates about their progress, Korra retreated to the Spirit Wilds, where she hoped to track down some of the spirits living there. Finding one, she asked if they could have a word, though before a conversation could unfold, the spirit vanished, much to her dismay. Noticing more spirits doing the same, Korra sadly concluded that they were abandoning the city."
    },
    {
      "body": "${link_0} pleaded with the spirits to help her defend ${link_1} against ${link_2}, though they refused to participate in human wars and vanished on her.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_2}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        }
      ],
      "text": "Korra pleaded with the spirits to help her defend Republic City against Kuvira, though they refused to participate in human wars and vanished on her."
    },
    {
      "body": "Korra made her way back to the meditation pavilion on Air Temple Island, from where she meditated into the Spirit World. Arriving at the base of the Tree of Time, she noticed several spirits gathered there and addressed them in her official capacity as the Avatar. She reasoned that since spirits and humans had coexisted peacefully in Republic City ever since the spirit portals were left open, they should help defend it as opposed to flee to the Spirit World. When a ${link_0} told her that spirits did not get involved with human wars, Korra noted that they had worked with Unalaq and added that while she did not wish to force the spirits to do anything they did not want to do, she hoped they would want to come to the Avatar's aid to defend the new world they all shared. As the spirit answered her negatively and vanished, she pleaded with the other spirits to listen, emphasizing that it was necessary for spirits and humans to work together if they were to live together. Korra dejectedly accepted defeat, however, as all the spirits vanished on her.",
      "links": [
        {
          "body": "dragon eel spirit",
          "key": "${link_0}",
          "target": {
            "href": "Dragon_eel_spirit",
            "page": "Dragon_eel_spirit"
          }
        }
      ],
      "text": "Korra made her way back to the meditation pavilion on Air Temple Island, from where she meditated into the Spirit World. Arriving at the base of the Tree of Time, she noticed several spirits gathered there and addressed them in her official capacity as the Avatar. She reasoned that since spirits and humans had coexisted peacefully in Republic City ever since the spirit portals were left open, they should help defend it as opposed to flee to the Spirit World. When a dragon eel spirit told her that spirits did not get involved with human wars, Korra noted that they had worked with Unalaq and added that while she did not wish to force the spirits to do anything they did not want to do, she hoped they would want to come to the Avatar's aid to defend the new world they all shared. As the spirit answered her negatively and vanished, she pleaded with the other spirits to listen, emphasizing that it was necessary for spirits and humans to work together if they were to live together. Korra dejectedly accepted defeat, however, as all the spirits vanished on her."
    },
    {
      "body": "Learning that ${link_0} planned to ${link_1} ${link_2}, ${link_3} determinedly assured ${link_4} ${link_5} that she would stop her.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "attack",
          "key": "${link_1}",
          "target": {
            "href": "Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Korra",
          "key": "${link_3}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "President",
          "key": "${link_4}",
          "target": {
            "href": "President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_5}",
          "target": {
            "href": "Raiko",
            "page": "Raiko"
          }
        }
      ],
      "text": "Learning that Kuvira planned to attack Republic City, Korra determinedly assured President Raiko that she would stop her."
    },
    {
      "body": "Some time later, Korra sat in on another meeting with Tenzin, Mako, Wu, and Raiko to discuss the evacuation of the city. She asked Wu about his progress and was shocked to learn that not even eighteen families out of the millions of people residing in Republic City had been evacuated. When their meeting was interrupted by Bolin, Suyin, Lin, and ${link_0}, Korra was pleasantly surprised to see the Zaofu matriarch again and moved in to embrace her while apologizing for her failure at Zaofu. Asking how she had escaped her imprisonment, Bolin told her that he, Lin, and Opal ${link_1} the ${link_2} and Zhu Li added that Kuvira planned to ${link_3} Republic City two weeks later. As Lin noted that Kuvira was likely coming by rail lines, reasoning that was the only way she could transport her ${link_4}, Korra suggested to destroy the tracks, something Raiko immediately agreed with, and she reassured the president that she would not let Kuvira take the city.",
      "links": [
        {
          "body": "Zhu Li",
          "key": "${link_0}",
          "target": {
            "href": "Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        },
        {
          "body": "rescued",
          "key": "${link_1}",
          "target": {
            "href": "Liberation_of_the_Beifong_family",
            "page": "Liberation_of_the_Beifong_family"
          }
        },
        {
          "body": "entire family",
          "key": "${link_2}",
          "target": {
            "href": "Beifong_family",
            "page": "Beifong_family"
          }
        },
        {
          "body": "attack",
          "key": "${link_3}",
          "target": {
            "href": "Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "spirit energy cannon",
          "key": "${link_4}",
          "target": {
            "href": "Spirit_energy_cannon",
            "page": "Spirit_energy_cannon"
          }
        }
      ],
      "text": "Some time later, Korra sat in on another meeting with Tenzin, Mako, Wu, and Raiko to discuss the evacuation of the city. She asked Wu about his progress and was shocked to learn that not even eighteen families out of the millions of people residing in Republic City had been evacuated. When their meeting was interrupted by Bolin, Suyin, Lin, and Zhu Li, Korra was pleasantly surprised to see the Zaofu matriarch again and moved in to embrace her while apologizing for her failure at Zaofu. Asking how she had escaped her imprisonment, Bolin told her that he, Lin, and Opal rescued the entire family and Zhu Li added that Kuvira planned to attack Republic City two weeks later. As Lin noted that Kuvira was likely coming by rail lines, reasoning that was the only way she could transport her spirit energy cannon, Korra suggested to destroy the tracks, something Raiko immediately agreed with, and she reassured the president that she would not let Kuvira take the city."
    },
    {
      "body": "Later, after talking it over with the rest of Team Avatar, Korra announced to Raiko, Tenzin, and Lin that they wanted to travel behind enemy lines to take out the spirit energy cannon before it got too close to the city. Raiko supported their idea and although Tenzin believed it to be too risky, he allowed them to leave on a ${link_0}.",
      "links": [
        {
          "body": "flying bison",
          "key": "${link_0}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        }
      ],
      "text": "Later, after talking it over with the rest of Team Avatar, Korra announced to Raiko, Tenzin, and Lin that they wanted to travel behind enemy lines to take out the spirit energy cannon before it got too close to the city. Raiko supported their idea and although Tenzin believed it to be too risky, he allowed them to leave on a flying bison."
    },
    {
      "body": "${link_0} and ${link_1} ${link_2} grew angry upon hearing ${link_3} demand the surrender of the ${link_4} and the ${link_5}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "General",
          "key": "${link_1}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#General_3",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_2}",
          "target": {
            "href": "Iroh_(United_Forces_general)",
            "page": "Iroh_(United_Forces_general)"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_3}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "United Forces",
          "key": "${link_4}",
          "target": {
            "href": "United_Forces",
            "page": "United_Forces"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_5}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Korra and General Iroh grew angry upon hearing Kuvira demand the surrender of the United Forces and the Avatar."
    },
    {
      "body": "The next day, Korra was surprised to learn that Kuvira had already crossed into United Republic territory, a week before they had been expecting her. Her shock magnified when she laid eyes upon the enormous ${link_0} that was used to transport the spirit energy cannon. Upon Bolin's panicked cries, she steered their bison away from the machine and managed to dodge two energy beams fired at them. They returned to Air Temple Island as soon as possible, where Korra alerted Tenzin and Raiko, along with Pema, Suyin, Wei, and Wing, that Kuvira's army was only hours away from the city and that the spirit energy cannon was being transported via a mecha suit that stood over twenty-five stories tall. While Pema increased the evacuation efforts and Asami, Mako, Bolin, Suyin, Wei, and Wing headed toward Future Industries in order to get at least a few of the hummingbird mecha suits airborne, Korra traveled toward the front line that General Iroh had erected. She was shocked to see Kuvira sink the United Forces' battleships in a matter of seconds and, after Raiko surrendered the city, Korra grew angry upon hearing Kuvira demand that he turned over his troops and the Avatar to her. Telling Iroh that she was not surrendering, he urged her to return to the city before Kuvira saw her and figure out a way to destroy the spirit energy cannon.",
      "links": [
        {
          "body": "mecha suit",
          "key": "${link_0}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        }
      ],
      "text": "The next day, Korra was surprised to learn that Kuvira had already crossed into United Republic territory, a week before they had been expecting her. Her shock magnified when she laid eyes upon the enormous mecha suit that was used to transport the spirit energy cannon. Upon Bolin's panicked cries, she steered their bison away from the machine and managed to dodge two energy beams fired at them. They returned to Air Temple Island as soon as possible, where Korra alerted Tenzin and Raiko, along with Pema, Suyin, Wei, and Wing, that Kuvira's army was only hours away from the city and that the spirit energy cannon was being transported via a mecha suit that stood over twenty-five stories tall. While Pema increased the evacuation efforts and Asami, Mako, Bolin, Suyin, Wei, and Wing headed toward Future Industries in order to get at least a few of the hummingbird mecha suits airborne, Korra traveled toward the front line that General Iroh had erected. She was shocked to see Kuvira sink the United Forces' battleships in a matter of seconds and, after Raiko surrendered the city, Korra grew angry upon hearing Kuvira demand that he turned over his troops and the Avatar to her. Telling Iroh that she was not surrendering, he urged her to return to the city before Kuvira saw her and figure out a way to destroy the spirit energy cannon."
    },
    {
      "body": "${link_0} selected ${link_1}, ${link_2}, ${link_3}, and ${link_4} to be part of her ${link_5} stealth team tasked with kidnapping ${link_6}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "href": "Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_2}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Kai",
          "key": "${link_3}",
          "target": {
            "href": "Kai",
            "page": "Kai"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_4}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "airbender",
          "key": "${link_5}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Baatar Jr.",
          "key": "${link_6}",
          "target": {
            "href": "Baatar_Jr",
            "page": "Baatar_Jr"
          }
        }
      ],
      "text": "Korra selected Bumi, Tenzin, Kai, and Jinora to be part of her airbender stealth team tasked with kidnapping Baatar Jr.."
    },
    {
      "body": "Reuniting with her allies at the Future Industries factory, Korra alerted everyone that Raiko had surrendered and that it was up to them to stop Kuvira from conquering the city. When Varrick stated that Baatar Jr. was a better inventor than he had thought for being able to manufacture such an enormous mecha suit, Korra had the idea to kidnap Baatar Jr. and force him to reveal the weaknesses of the machine to them. To that end, she enlisted Tenzin, Bumi, Kai, and Jinora to be part of her airbender stealth team. As a hurt Meelo asked who he was passed over, she calmly explained to him that they needed to be quiet during their mission and that his farts were just too much of a wild card, something he could agree with. While Jinora and Kai stood guard atop Baatar Jr.'s airship, Korra, Tenzin, and Bumi infiltrated the vessel. Avoiding detection by a guard, she bent open the metal doors to Baatar Jr.'s quarters and while she and Tenzin held the nonbender down, Bumi placed him in a bag, before he and his brother carried him toward the factory.",
      "links": [],
      "text": "Reuniting with her allies at the Future Industries factory, Korra alerted everyone that Raiko had surrendered and that it was up to them to stop Kuvira from conquering the city. When Varrick stated that Baatar Jr. was a better inventor than he had thought for being able to manufacture such an enormous mecha suit, Korra had the idea to kidnap Baatar Jr. and force him to reveal the weaknesses of the machine to them. To that end, she enlisted Tenzin, Bumi, Kai, and Jinora to be part of her airbender stealth team. As a hurt Meelo asked who he was passed over, she calmly explained to him that they needed to be quiet during their mission and that his farts were just too much of a wild card, something he could agree with. While Jinora and Kai stood guard atop Baatar Jr.'s airship, Korra, Tenzin, and Bumi infiltrated the vessel. Avoiding detection by a guard, she bent open the metal doors to Baatar Jr.'s quarters and while she and Tenzin held the nonbender down, Bumi placed him in a bag, before he and his brother carried him toward the factory."
    },
    {
      "body": "${link_0} managed to force ${link_1} to try to talk ${link_2} out of ${link_3} the ${link_4} by threatening to keep them apart forever, which was something he could not live with.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Baatar Jr.",
          "key": "${link_1}",
          "target": {
            "href": "Baatar_Jr",
            "page": "Baatar_Jr"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_2}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "conquering",
          "key": "${link_3}",
          "target": {
            "href": "Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "United Republic of Nations",
          "key": "${link_4}",
          "target": {
            "href": "United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        }
      ],
      "text": "Korra managed to force Baatar Jr. to try to talk Kuvira out of conquering the United Republic of Nations by threatening to keep them apart forever, which was something he could not live with."
    },
    {
      "body": "Korra initially tried to force Baatar Jr. to talk under the threat of hurting him physically while in the Avatar State, though after he called her bluff, she vowed to make it her life's mission to keep him from ever seeing Kuvira again. He relented and Korra helped him to contact Kuvira by holding a portable radio to his head. After Kuvira seemingly agreed that taking Republic City was not worth sacrificing their life together, Korra untied Baatar Jr. and told him that they would release him as soon as they had worked out terms with his fiancée. As Mako alerted them that Kuvira was taking aim at the factory, Korra frantically ordered everyone to evacuate, though they were too late to escape the energy beam.",
      "links": [],
      "text": "Korra initially tried to force Baatar Jr. to talk under the threat of hurting him physically while in the Avatar State, though after he called her bluff, she vowed to make it her life's mission to keep him from ever seeing Kuvira again. He relented and Korra helped him to contact Kuvira by holding a portable radio to his head. After Kuvira seemingly agreed that taking Republic City was not worth sacrificing their life together, Korra untied Baatar Jr. and told him that they would release him as soon as they had worked out terms with his fiancée. As Mako alerted them that Kuvira was taking aim at the factory, Korra frantically ordered everyone to evacuate, though they were too late to escape the energy beam."
    },
    {
      "body": "Korra managed to survive the explosion and emerged from the rubble with everyone else when Bolin lifted a large slab of concrete. Although Tenzin warned them that Kuvira was heading their way with a battalion of mecha suits and Bolin opted to let Kuvira take the city until they could come up with a way to defeat her, Korra refused to give up on Republic City. She reasoned that the world was not safe as long as Kuvira wielded the power of the spirit energy cannon, a statement which Lin Beifong supported. Korra told Suyin to take Baatar Jr. and the other wounded back to Asami's office, where the Sato heiress and Varrick would adjust the prototypes of the hummingbird mecha suits in order to provide air support for the benders, who would try to take down the spirit energy cannon in the meantime.",
      "links": [],
      "text": "Korra managed to survive the explosion and emerged from the rubble with everyone else when Bolin lifted a large slab of concrete. Although Tenzin warned them that Kuvira was heading their way with a battalion of mecha suits and Bolin opted to let Kuvira take the city until they could come up with a way to defeat her, Korra refused to give up on Republic City. She reasoned that the world was not safe as long as Kuvira wielded the power of the spirit energy cannon, a statement which Lin Beifong supported. Korra told Suyin to take Baatar Jr. and the other wounded back to Asami's office, where the Sato heiress and Varrick would adjust the prototypes of the hummingbird mecha suits in order to provide air support for the benders, who would try to take down the spirit energy cannon in the meantime."
    },
    {
      "body": "${link_0} helped a shaken up ${link_1} to her feet and ordered everyone to retreat to ${link_2}'s office to regroup.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "airbender",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "text": "Korra helped a shaken up airbender to her feet and ordered everyone to retreat to Asami's office to regroup."
    },
    {
      "body": "Korra positioned herself atop the roof of a high building, while the airbenders dropped paint balloons on Kuvira's mecha suit's windows, momentarily obscuring her vision and enabling the earthbenders on the ground to tie down the suit's legs. As Bolin gave the signal, Korra entered the Avatar State and started to collect wind currents around her. She hit the machine in the chest with her powerful torrent and was immediately helped in her effort to blow the suit off balance by the other airbenders. Korra was forced to halt her attack and duck underneath an energy beam fired at her by Kuvira, though she made a quick recovery and resumed her assault. Although they managed to push the suit back, it was able to untangle itself from its bonds and took a clear shot at the airbenders. Korra tried to avoid the energy beam by rising up on an air spout, though the power emanating from the beam knocked her down. Using her earthbending to grab a hold of a building, tearing it in the process, she managed to slow down her descent enough to cushion her fall with an air blast to the ground and roll to a stop without sustaining any injuries. She immediately rushed to the aid of a shaken up female airbender and ordered everyone to retreat to Asami's office at Future Industries Tower. Draping the woman over her shoulders, Korra ran off to safety.",
      "links": [],
      "text": "Korra positioned herself atop the roof of a high building, while the airbenders dropped paint balloons on Kuvira's mecha suit's windows, momentarily obscuring her vision and enabling the earthbenders on the ground to tie down the suit's legs. As Bolin gave the signal, Korra entered the Avatar State and started to collect wind currents around her. She hit the machine in the chest with her powerful torrent and was immediately helped in her effort to blow the suit off balance by the other airbenders. Korra was forced to halt her attack and duck underneath an energy beam fired at her by Kuvira, though she made a quick recovery and resumed her assault. Although they managed to push the suit back, it was able to untangle itself from its bonds and took a clear shot at the airbenders. Korra tried to avoid the energy beam by rising up on an air spout, though the power emanating from the beam knocked her down. Using her earthbending to grab a hold of a building, tearing it in the process, she managed to slow down her descent enough to cushion her fall with an air blast to the ground and roll to a stop without sustaining any injuries. She immediately rushed to the aid of a shaken up female airbender and ordered everyone to retreat to Asami's office at Future Industries Tower. Draping the woman over her shoulders, Korra ran off to safety."
    },
    {
      "body": "At Asami's office, Korra was shocked to find Lin joining them with Hiroshi Sato in tow. She skeptically asked if he knew how to defeat the enormous machine, though softened when he offered the good advice to act like an infection and attack from the inside out. While Asami, Hiroshi, Varrick, and Zhu Li worked to add an electrical element to the welding torches on the hummingbird mecha suits to convert them into platinum-cutting plasma saws, Korra and the other benders headed back out to stall Kuvira's progress toward Future Industries Tower. Riding an air spout, Korra faced Kuvira's enormous machine head on. She entered the Avatar State once again and used it to smoothly maneuver out of the trajectory of the energy beam Kuvira fired at her. Raising several large chunks of earth from the street, she propelled herself to the top of a tall building with her firebending and launched her earthen projectiles at the suit, though failed to cause any damage. She nonetheless continued assault with pieces of earth taken from the building's roof. Afterward, she watched how Bolin, Lin, and Suyin toppled the top stories of another building atop Kuvira's advancing machine, though was shocked to see it emerge from the rubble without a scratch.",
      "links": [],
      "text": "At Asami's office, Korra was shocked to find Lin joining them with Hiroshi Sato in tow. She skeptically asked if he knew how to defeat the enormous machine, though softened when he offered the good advice to act like an infection and attack from the inside out. While Asami, Hiroshi, Varrick, and Zhu Li worked to add an electrical element to the welding torches on the hummingbird mecha suits to convert them into platinum-cutting plasma saws, Korra and the other benders headed back out to stall Kuvira's progress toward Future Industries Tower. Riding an air spout, Korra faced Kuvira's enormous machine head on. She entered the Avatar State once again and used it to smoothly maneuver out of the trajectory of the energy beam Kuvira fired at her. Raising several large chunks of earth from the street, she propelled herself to the top of a tall building with her firebending and launched her earthen projectiles at the suit, though failed to cause any damage. She nonetheless continued assault with pieces of earth taken from the building's roof. Afterward, she watched how Bolin, Lin, and Suyin toppled the top stories of another building atop Kuvira's advancing machine, though was shocked to see it emerge from the rubble without a scratch."
    },
    {
      "body": "Due to ${link_0}'s sacrifice, ${link_1} was able to make it inside ${link_2}'s enormous ${link_3} together with ${link_4}, ${link_5}, ${link_6}, and ${link_7}.",
      "links": [
        {
          "body": "Hiroshi",
          "key": "${link_0}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_2}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "mecha suit",
          "key": "${link_3}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_4}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_5}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Lin",
          "key": "${link_6}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Suyin",
          "key": "${link_7}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        }
      ],
      "text": "Due to Hiroshi's sacrifice, Korra was able to make it inside Kuvira's enormous mecha suit together with Bolin, Mako, Lin, and Suyin."
    },
    {
      "body": "When the two hummingbird mecha suits arrived, Korra watched how they tried to land on the suit long enough to cut a hole in its armor, though were forced to abandon their attempt time and again due to Kuvira's counterattacks. In order to stop the suit from moving, she assaulted the machine with water taken from a nearby canal and froze it in place. Although she was too late to prevent Kuvira from shooting down Varrick and Zhu Li's suit, she was able to lock down the machine's weaponized arm with ice, giving Asami and Hiroshi a change to land on the suit's thigh and start welding. Korra watched in sadness as Hiroshi was crushed to death upon finishing his mission of cutting a hole in the suit's armor, though took on a hardened expression as she raised herself atop the machine with her airbending. As she, Lin, Suyin, Mako, and Bolin ran toward the opening, Korra bent the ice around her to thwart the decent of Kuvira's incoming platinum hand, enabling them all to dive inside the suit safely.",
      "links": [],
      "text": "When the two hummingbird mecha suits arrived, Korra watched how they tried to land on the suit long enough to cut a hole in its armor, though were forced to abandon their attempt time and again due to Kuvira's counterattacks. In order to stop the suit from moving, she assaulted the machine with water taken from a nearby canal and froze it in place. Although she was too late to prevent Kuvira from shooting down Varrick and Zhu Li's suit, she was able to lock down the machine's weaponized arm with ice, giving Asami and Hiroshi a change to land on the suit's thigh and start welding. Korra watched in sadness as Hiroshi was crushed to death upon finishing his mission of cutting a hole in the suit's armor, though took on a hardened expression as she raised herself atop the machine with her airbending. As she, Lin, Suyin, Mako, and Bolin ran toward the opening, Korra bent the ice around her to thwart the decent of Kuvira's incoming platinum hand, enabling them all to dive inside the suit safely."
    },
    {
      "body": "${link_0} and ${link_1} fought in the cockpit of the enormous ${link_2} when its power core detonated.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_1}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "mecha suit",
          "key": "${link_2}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        }
      ],
      "text": "Korra and Kuvira fought in the cockpit of the enormous mecha suit when its power core detonated."
    },
    {
      "body": "Inside, Korra ordered Lin and Suyin to disable the spirit energy cannon and Mako and Bolin to cut the power from the engine room, while she would take on Kuvira. When Suyin asked if she was certain she wanted to confront the master metalbender again, referring to what happened at Zaofu, Korra confidently assured her that things would go differently that time. Making her way to the cockpit, she used her bending to force open the hatch and immediately took down the two soldiers Kuvira had up there with her with a powerful gust of air. When Kuvira avoided her fire attack and retaliated with liquid metal, Korra was able to deflect it and sent it back at the metalbender, knocking her down by solidifying the liquid at the last moment. After trading several blows, both women switching between offense and defense, their duel was interrupted when the enormous suit exploded from within, throwing the top half in which they were fighting against a building, where it fell down several stories.",
      "links": [],
      "text": "Inside, Korra ordered Lin and Suyin to disable the spirit energy cannon and Mako and Bolin to cut the power from the engine room, while she would take on Kuvira. When Suyin asked if she was certain she wanted to confront the master metalbender again, referring to what happened at Zaofu, Korra confidently assured her that things would go differently that time. Making her way to the cockpit, she used her bending to force open the hatch and immediately took down the two soldiers Kuvira had up there with her with a powerful gust of air. When Kuvira avoided her fire attack and retaliated with liquid metal, Korra was able to deflect it and sent it back at the metalbender, knocking her down by solidifying the liquid at the last moment. After trading several blows, both women switching between offense and defense, their duel was interrupted when the enormous suit exploded from within, throwing the top half in which they were fighting against a building, where it fell down several stories."
    },
    {
      "body": "Risking her own life, ${link_0} ${link_1} the beam from the ${link_2} to save ${link_3}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "bent",
          "key": "${link_1}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        },
        {
          "body": "spirit energy cannon",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_energy_cannon",
            "page": "Spirit_energy_cannon"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_3}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        }
      ],
      "text": "Risking her own life, Korra bent the beam from the spirit energy cannon to save Kuvira."
    },
    {
      "body": "Recovering from the impact, Korra created a way out with her earthbending and supported Kuvira to exit the suit. Laying the metalbender down, she sternly told her that it was over and that she needed to call off her army and surrender to President Raiko. Before she could continue, however, she was knocked back when Kuvira hit her with a rock. By the time Korra had risen to her feet again, Kuvira had vanished inside the Spirit Wilds. She gave chase and while searching the forest, she called out to the other woman to give up and end the madness. Following Kuvira's voice, Korra walked into a trap, however, finding herself right in front of the spirit energy cannon that had been thrown free of its arm and landed inside the forest as well. She dove out of the way of the beam and when the cannon started to charge itself with the vines of the Spirit Wilds, causing the beam to overload, she implored Kuvira to shut it down. The cannon no longer reacted to manual commands, however, and when the energy beam threatened to kill Kuvira, Korra jumped in front of her. Entering the Avatar State, she held the beam at bay, though the enormous surge of energy expanded around them and exploded.",
      "links": [],
      "text": "Recovering from the impact, Korra created a way out with her earthbending and supported Kuvira to exit the suit. Laying the metalbender down, she sternly told her that it was over and that she needed to call off her army and surrender to President Raiko. Before she could continue, however, she was knocked back when Kuvira hit her with a rock. By the time Korra had risen to her feet again, Kuvira had vanished inside the Spirit Wilds. She gave chase and while searching the forest, she called out to the other woman to give up and end the madness. Following Kuvira's voice, Korra walked into a trap, however, finding herself right in front of the spirit energy cannon that had been thrown free of its arm and landed inside the forest as well. She dove out of the way of the beam and when the cannon started to charge itself with the vines of the Spirit Wilds, causing the beam to overload, she implored Kuvira to shut it down. The cannon no longer reacted to manual commands, however, and when the energy beam threatened to kill Kuvira, Korra jumped in front of her. Entering the Avatar State, she held the beam at bay, though the enormous surge of energy expanded around them and exploded."
    },
    {
      "body": "${link_0} understood and sympathized with ${link_1}'s reasoning for her actions.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_1}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        }
      ],
      "text": "Korra understood and sympathized with Kuvira's reasoning for her actions."
    },
    {
      "body": "When Korra regained consciousness, she found herself staring at a purple reflection of herself, though it soon morphed into the unconscious form of Kuvira. As they lowered to the ground, she caught Kuvira from falling, though as the woman woke up, she pushed Korra down in her haste to get away. Noticing their surroundings, Kuvira asked Korra if they were dead, to which Korra explained that the energy from the spirit energy cannon had torn open a new passage to the Spirit World and had blasted them in there. When Kuvira demanded to know why Korra would risk her life after everything she had put her through, the Avatar explained that she saw a lot of herself in the metalbender, stating that they were both fierce and determined to succeed, sometimes even without thinking things through. As Kuvira mused that nothing went as she had desired, Korra pointed out that she had brought herself down by tampering with the spirit vines and acting like a dictator. When the metalbender snapped that she had been merely trying to help her people in the absence of the Avatar, Korra understood that Kuvira had only been trying to create a place where she and her people would never have to feel vulnerable again and sympathized with the hardships that come from a life as an orphan. She explained that while she still had her parents, she knew how it felt to live in fear, disclosing that she would have done anything to feel in control again after she had been poisoned by Zaheer.",
      "links": [],
      "text": "When Korra regained consciousness, she found herself staring at a purple reflection of herself, though it soon morphed into the unconscious form of Kuvira. As they lowered to the ground, she caught Kuvira from falling, though as the woman woke up, she pushed Korra down in her haste to get away. Noticing their surroundings, Kuvira asked Korra if they were dead, to which Korra explained that the energy from the spirit energy cannon had torn open a new passage to the Spirit World and had blasted them in there. When Kuvira demanded to know why Korra would risk her life after everything she had put her through, the Avatar explained that she saw a lot of herself in the metalbender, stating that they were both fierce and determined to succeed, sometimes even without thinking things through. As Kuvira mused that nothing went as she had desired, Korra pointed out that she had brought herself down by tampering with the spirit vines and acting like a dictator. When the metalbender snapped that she had been merely trying to help her people in the absence of the Avatar, Korra understood that Kuvira had only been trying to create a place where she and her people would never have to feel vulnerable again and sympathized with the hardships that come from a life as an orphan. She explained that while she still had her parents, she knew how it felt to live in fear, disclosing that she would have done anything to feel in control again after she had been poisoned by Zaheer."
    },
    {
      "body": "Korra supported Kuvira out of the Spirit World and met up with her friends, who were overjoyed to see her again. Noticing a platoon of mecha suits surrounding them, she released Kuvira, who promptly ordered her soldiers to stand down and surrendered, acknowledging that the Avatar had saved her life and possessed a power beyond what she could ever hope to achieve. After the metalbender was handcuffed and led away, Korra smiled to Asami, who had placed a hand on her shoulder, before becoming the center of a group hug.",
      "links": [],
      "text": "Korra supported Kuvira out of the Spirit World and met up with her friends, who were overjoyed to see her again. Noticing a platoon of mecha suits surrounding them, she released Kuvira, who promptly ordered her soldiers to stand down and surrendered, acknowledging that the Avatar had saved her life and possessed a power beyond what she could ever hope to achieve. After the metalbender was handcuffed and led away, Korra smiled to Asami, who had placed a hand on her shoulder, before becoming the center of a group hug."
    },
    {
      "body": "${link_0} supported ${link_1} ${link_2}'s plans to abolish the ${link_3} monarchy in favor of independent states with a democratically elected government.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_1}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Wu",
          "key": "${link_2}",
          "target": {
            "href": "Wu",
            "page": "Wu"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_3}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Korra supported Earth King Wu's plans to abolish the Earth Kingdom monarchy in favor of independent states with a democratically elected government."
    },
    {
      "body": "Korra later attended Varrick and Zhu Li's wedding at Air Temple Island, where she sat between Asami and Opal. After the ceremony, she approached Mako and Wu, asking the latter if he was ready to return to Ba Sing Se and ascend the throne. She was shocked to hear him respond that he intended to abolish the monarchy, though when he explained that it was to establish independent states with democratically elected governments akin to the United Republic of Nations, she vowed to do everything in her power to help him evolve the Earth Kingdom. When Wu walked off toward the dance floor, Korra asked Mako how his arm was feeling, as he had injured it while causing the enormous mecha suit to explode. She mused that the words \"thank you\" were not sufficient in the light of his actions, though she did not know what else to say. When Mako readily told her that she did not need to say anything, as he would always be there for her, no matter the situation, she smiled appreciatively at him.",
      "links": [],
      "text": "Korra later attended Varrick and Zhu Li's wedding at Air Temple Island, where she sat between Asami and Opal. After the ceremony, she approached Mako and Wu, asking the latter if he was ready to return to Ba Sing Se and ascend the throne. She was shocked to hear him respond that he intended to abolish the monarchy, though when he explained that it was to establish independent states with democratically elected governments akin to the United Republic of Nations, she vowed to do everything in her power to help him evolve the Earth Kingdom. When Wu walked off toward the dance floor, Korra asked Mako how his arm was feeling, as he had injured it while causing the enormous mecha suit to explode. She mused that the words \"thank you\" were not sufficient in the light of his actions, though she did not know what else to say. When Mako readily told her that she did not need to say anything, as he would always be there for her, no matter the situation, she smiled appreciatively at him."
    },
    {
      "body": "${link_0} was praised by ${link_1} for all that she had already accomplished in her time as the ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_1}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Korra was praised by Tenzin for all that she had already accomplished in her time as the Avatar."
    },
    {
      "body": "Some time later, Korra distanced herself from the party and gazed over the skyline of Republic City. When she was joined by Tenzin, she stated that Aang would likely have never even dreamed of the possibility of there being a spirit portal in the heart of Republic City. The airbending master complimented her on having transformed the world more in the few years she had been an active Avatar than most of her predecessors did in their lifetimes, though all she could think of was how much more that she still wanted to learn and do, having the feeling that she had only just begun her journey. She admitted to Tenzin that she knew she had been in a dark place after being poisoned, though added that she now understood she had to endure those hardships to understand the true meaning of suffering and be able to show compassion to people like Kuvira.",
      "links": [],
      "text": "Some time later, Korra distanced herself from the party and gazed over the skyline of Republic City. When she was joined by Tenzin, she stated that Aang would likely have never even dreamed of the possibility of there being a spirit portal in the heart of Republic City. The airbending master complimented her on having transformed the world more in the few years she had been an active Avatar than most of her predecessors did in their lifetimes, though all she could think of was how much more that she still wanted to learn and do, having the feeling that she had only just begun her journey. She admitted to Tenzin that she knew she had been in a dark place after being poisoned, though added that she now understood she had to endure those hardships to understand the true meaning of suffering and be able to show compassion to people like Kuvira."
    },
    {
      "body": "${link_0} and ${link_1} held hands and gazed at each other lovingly as they entered the ${link_2}, beginning their romantic relationship.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        }
      ],
      "text": "Korra and Asami held hands and gazed at each other lovingly as they entered the spirit portal, beginning their romantic relationship."
    },
    {
      "body": "When Asami approached them and alerted Tenzin that Varrick was looking for him in regards to the possibility of borrowing a wingsuit to jump off the tower, Korra was left alone by the airbending master and she invited the other woman to sit with her, as she did not feel ready to return to the party. Looking back out to the skyline of Republic City, Korra apologized to Asami for having been absent for three years. When Asami quickly noted that there was no need to apologize, emphasizing that she was glad Korra was there now, as she could not have coped with the loss of her father and Korra on the same day, the Avatar felt for her and embraced the other woman. As they broke apart, Korra inquired about their next move, wondering if they should return to the dance floor. When Asami stated that she did not feel like returning to the party and could use a vacation, Korra offered to go with her anywhere she wanted and declared Asami's choice to travel to the Spirit World to be perfect. The two changed back into their casual clothing and, upon approaching the portal, they held hands. Stepping in, they turned to each other and held both hands while gazing lovingly into each other's eyes, starting their romantic relationship together.",
      "links": [],
      "text": "When Asami approached them and alerted Tenzin that Varrick was looking for him in regards to the possibility of borrowing a wingsuit to jump off the tower, Korra was left alone by the airbending master and she invited the other woman to sit with her, as she did not feel ready to return to the party. Looking back out to the skyline of Republic City, Korra apologized to Asami for having been absent for three years. When Asami quickly noted that there was no need to apologize, emphasizing that she was glad Korra was there now, as she could not have coped with the loss of her father and Korra on the same day, the Avatar felt for her and embraced the other woman. As they broke apart, Korra inquired about their next move, wondering if they should return to the dance floor. When Asami stated that she did not feel like returning to the party and could use a vacation, Korra offered to go with her anywhere she wanted and declared Asami's choice to travel to the Spirit World to be perfect. The two changed back into their casual clothing and, upon approaching the portal, they held hands. Stepping in, they turned to each other and held both hands while gazing lovingly into each other's eyes, starting their romantic relationship together."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Korra_(174_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Korra_(174_AG).html",
    "page": "History_of_Korra_(174_AG)",
    "title": "History of Korra (174 AG)"
  }
}