{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Sometime during the six months following the end of the ${link_0}, things were looking up for ${link_1}. He became a policeman and moved into a nice ${link_2}. However, when a new threat loomed at the horizon, he was ready to help his friends.",
      "links": [
        {
          "body": "Anti-bending Revolution",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Anti-bending_Revolution",
            "page": "Anti-bending_Revolution"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "apartment",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Mako_and_Bolin%27s_apartment",
            "page": "Mako_and_Bolin%27s_apartment"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)"
      ],
      "text": "Sometime during the six months following the end of the Anti-bending Revolution, things were looking up for Mako. He became a policeman and moved into a nice apartment. However, when a new threat loomed at the horizon, he was ready to help his friends."
    },
    {
      "body": "Mako left the ${link_0} and became a policeman. Using his and Bolin's earnings, the brothers acquired a decent apartment in Republic City. Riding his motorcycle, he patrolled the streets of ${link_1} in order to apprehend criminals. In one instance, he chased a delivery truck driven by several members of the ${link_2}. After a lengthy chase which included a jump, he utilized a fire blast, which caused the truck to crash and flip over. Mako enjoyed his job of chasing down triad members, and aspired to become a detective for the Republic City Police Department. His romantic relationship with Korra underwent a number of struggles during this time, but the couple was able to settle their differences each time.",
      "links": [
        {
          "body": "Fire Ferrets",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Red Monsoon Triad",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Red_Monsoon_Triad",
            "page": "Red_Monsoon_Triad"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Life after the Anti-bending Revolution"
      ],
      "text": "Mako left the Fire Ferrets and became a policeman. Using his and Bolin's earnings, the brothers acquired a decent apartment in Republic City. Riding his motorcycle, he patrolled the streets of Republic City in order to apprehend criminals. In one instance, he chased a delivery truck driven by several members of the Red Monsoon Triad. After a lengthy chase which included a jump, he utilized a fire blast, which caused the truck to crash and flip over. Mako enjoyed his job of chasing down triad members, and aspired to become a detective for the Republic City Police Department. His romantic relationship with Korra underwent a number of struggles during this time, but the couple was able to settle their differences each time."
    },
    {
      "body": "Mako accompanied Korra, along with Bolin and Tenzin's family, back to the ${link_0} for the ${link_1}. While resting against Naga, Mako bragged about the quips he used during his recent arrests of triad members. Korra expressed envy of him, informing Mako that Tenzin feels that she was growing irresponsible as the Avatar. Mako attempted to reason that Tenzin was only trying to help her, only for Korra to storm off. Frustrated, he asked Naga why it was easier to handle criminals than his girlfriend.",
      "links": [
        {
          "body": "Southern Water Tribe",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Glacier Spirits Festival",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Glacier_Spirits_Festival",
            "page": "Glacier_Spirits_Festival"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Glacier Spirits Festival"
      ],
      "text": "Mako accompanied Korra, along with Bolin and Tenzin's family, back to the Southern Water Tribe for the Glacier Spirits Festival. While resting against Naga, Mako bragged about the quips he used during his recent arrests of triad members. Korra expressed envy of him, informing Mako that Tenzin feels that she was growing irresponsible as the Avatar. Mako attempted to reason that Tenzin was only trying to help her, only for Korra to storm off. Frustrated, he asked Naga why it was easier to handle criminals than his girlfriend."
    },
    {
      "body": "Later, when they arrive at the south, Korra reintroduces Mako to her father, ${link_0}. Tonraq sternly asked a nervous Mako if he was keeping his daughter out of trouble, but changed his mood at Korra's urging. At the same time, ${link_1}, chief of the ${link_2} and Korra's uncle arrived, and Mako and Bolin could not help but notice the tension between the two.",
      "links": [
        {
          "body": "Tonraq",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Glacier Spirits Festival"
      ],
      "text": "Later, when they arrive at the south, Korra reintroduces Mako to her father, Tonraq. Tonraq sternly asked a nervous Mako if he was keeping his daughter out of trouble, but changed his mood at Korra's urging. At the same time, Unalaq, chief of the Northern Water Tribe and Korra's uncle arrived, and Mako and Bolin could not help but notice the tension between the two."
    },
    {
      "body": "Later that night, Mako and Korra began to enjoy the festival together. While Bolin was busy chatting up Korra's cousins, ${link_0}, Korra informed Mako of her uncle's offer to train her about spirits but Tenzin and her father refuse the idea, so she asked Mako for advice. Mako suggested that she do whatever she thought was right, but Korra failed to find it helpful.",
      "links": [
        {
          "body": "Desna and Eska",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Glacier Spirits Festival"
      ],
      "text": "Later that night, Mako and Korra began to enjoy the festival together. While Bolin was busy chatting up Korra's cousins, Desna and Eska, Korra informed Mako of her uncle's offer to train her about spirits but Tenzin and her father refuse the idea, so she asked Mako for advice. Mako suggested that she do whatever she thought was right, but Korra failed to find it helpful."
    },
    {
      "body": "Later, everyone was woken by Naga's howling, as a ${link_0} attacked Korra. Mako, Bolin, Tonraq, and Tenzin attempted to come to her aid, only to be swept aside by the spirit. After the spirit was purified by Unalaq, Korra renounced Tenzin as her mentor and chose to learn from Unalaq instead.",
      "links": [
        {
          "body": "dark spirit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Glacier Spirits Festival"
      ],
      "text": "Later, everyone was woken by Naga's howling, as a dark spirit attacked Korra. Mako, Bolin, Tonraq, and Tenzin attempted to come to her aid, only to be swept aside by the spirit. After the spirit was purified by Unalaq, Korra renounced Tenzin as her mentor and chose to learn from Unalaq instead."
    },
    {
      "body": "The next morning, Korra asked Mako if she made the right decision. He confessed that he did not know, but told her to trust her heart.",
      "links": [],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Glacier Spirits Festival"
      ],
      "text": "The next morning, Korra asked Mako if she made the right decision. He confessed that he did not know, but told her to trust her heart."
    },
    {
      "body": "When it became clear Korra and ${link_0} would travel to the ${link_1}, Mako helped her prepare for the journey. He was originally going to ride with Korra on Naga, though when Bolin appeared on a ${link_2} with a sidecar, Mako took ${link_3}'s ${link_4} instead. The next day, the group continued toward the ${link_5} in the South Pole. As they ventured into the storm, they were attacked by dark spirits. Mako attempted to ward the spirits off, albeit with little success. By the time Unalaq had used his spiritbending to calm the spirits down, Mako noted that their supplies had all been destroyed, causing Tonraq to insist that they all turn back. When Korra told her father to leave instead, Mako assured the man that he would keep an eye on his daughter, much to Tonraq's appreciation though to Korra's irritation. He emphasized to her that he was not siding against her, but merely trying to help out, just like everyone else.",
      "links": [
        {
          "body": "Unalaq",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "South Pole",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "snowmobile",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Snowmobile",
            "page": "Snowmobile"
          }
        },
        {
          "body": "Desna and Eska",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "Arctic camel",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Arctic_camel",
            "page": "Arctic_camel"
          }
        },
        {
          "body": "Everstorm",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Everstorm",
            "page": "Everstorm"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Traveling to the spirit portal"
      ],
      "text": "When it became clear Korra and Unalaq would travel to the South Pole, Mako helped her prepare for the journey. He was originally going to ride with Korra on Naga, though when Bolin appeared on a snowmobile with a sidecar, Mako took Desna and Eska's Arctic camel instead. The next day, the group continued toward the Everstorm in the South Pole. As they ventured into the storm, they were attacked by dark spirits. Mako attempted to ward the spirits off, albeit with little success. By the time Unalaq had used his spiritbending to calm the spirits down, Mako noted that their supplies had all been destroyed, causing Tonraq to insist that they all turn back. When Korra told her father to leave instead, Mako assured the man that he would keep an eye on his daughter, much to Tonraq's appreciation though to Korra's irritation. He emphasized to her that he was not siding against her, but merely trying to help out, just like everyone else."
    },
    {
      "body": "The group arrived at the ${link_0}, and Mako tried to accompany her, but Unalaq insisted she go in alone. He reluctantly remained behind, and watched in awe moments later at the newly returned ${link_1}. When Korra emerged from the frozen forest, Mako hugged her, stating that she never ceased to amaze him. As Korra apologized for her behavior, saying it was hard being the Avatar, Mako teased her in response, joking that it was even harder being the Avatar's boyfriend.",
      "links": [
        {
          "body": "spirit portal",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "southern lights",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_lights#Southern_lights",
            "page": "Spirit_lights"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Traveling to the spirit portal"
      ],
      "text": "The group arrived at the spirit portal, and Mako tried to accompany her, but Unalaq insisted she go in alone. He reluctantly remained behind, and watched in awe moments later at the newly returned southern lights. When Korra emerged from the frozen forest, Mako hugged her, stating that she never ceased to amaze him. As Korra apologized for her behavior, saying it was hard being the Avatar, Mako teased her in response, joking that it was even harder being the Avatar's boyfriend."
    },
    {
      "body": "Shortly after their return to the Southern Water Tribe, tensions began to rise as Unalaq brought in men from the North. Around this time, Bolin approached Mako, seeking advice on how to handle his relationship with Eska. Mako suggested that if Bolin was feeling unhappy, he break up with her, as it was the right thing to do. He likened the break up to ripping off a leech: painful, but one would feel a lot better afterward. Later, Korra approached Mako, venting to him about her struggles in keeping peace between the North and the South. In an attempt to calm his girlfriend down and be there for her, Mako suggested taking a break from it all and enjoy a quiet dinner with him. His plan backfired, however, as their date was crashed by Bolin who had brought the twins with him.",
      "links": [],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Northern and Southern tensions rise"
      ],
      "text": "Shortly after their return to the Southern Water Tribe, tensions began to rise as Unalaq brought in men from the North. Around this time, Bolin approached Mako, seeking advice on how to handle his relationship with Eska. Mako suggested that if Bolin was feeling unhappy, he break up with her, as it was the right thing to do. He likened the break up to ripping off a leech: painful, but one would feel a lot better afterward. Later, Korra approached Mako, venting to him about her struggles in keeping peace between the North and the South. In an attempt to calm his girlfriend down and be there for her, Mako suggested taking a break from it all and enjoy a quiet dinner with him. His plan backfired, however, as their date was crashed by Bolin who had brought the twins with him."
    },
    {
      "body": "Mako later accompanied his brother and Asami as they attempted to meet with ${link_0}. When Desna and Eska entered, looking for Varrick, he learned to his shock that Korra's parents were arrested and to be tried for conspiring to assassinate Unalaq. After the twins left, Mako went to check up on Korra and later attended the trial of her parents, where he was shocked to hear Tonraq and the other ${link_1} be sentenced to death.",
      "links": [
        {
          "body": "Varrick",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "Southern Water Tribe rebels",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_rebels",
            "page": "Southern_Water_Tribe_rebels"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Northern and Southern tensions rise"
      ],
      "text": "Mako later accompanied his brother and Asami as they attempted to meet with Varrick. When Desna and Eska entered, looking for Varrick, he learned to his shock that Korra's parents were arrested and to be tried for conspiring to assassinate Unalaq. After the twins left, Mako went to check up on Korra and later attended the trial of her parents, where he was shocked to hear Tonraq and the other Southern Water Tribe rebels be sentenced to death."
    },
    {
      "body": "Later, Mako and Asami were in Varrick's mansion, when they were approached by Korra. She asked for their help in breaking her father out of prison, as she had learned that the entire trial had been a setup. Although he noted that if there were to go through with the plan, a war would break out with no way back, he did not hesitate to help her.",
      "links": [],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Northern and Southern tensions rise"
      ],
      "text": "Later, Mako and Asami were in Varrick's mansion, when they were approached by Korra. She asked for their help in breaking her father out of prison, as she had learned that the entire trial had been a setup. Although he noted that if there were to go through with the plan, a war would break out with no way back, he did not hesitate to help her."
    },
    {
      "body": "Mako and the rest of ${link_0} went to break Tonraq out of ${link_1}, but they found his cell to be empty and Unalaq there waiting for them. After learning that the Chief had shipped the prisoners off to the North, Korra and Mako got into a brief skirmish with Unalaq, before leaving for ${link_2} in hopes of catching up with the ship. However, shortly after they set sail they ran into a Northern blockade preventing them from leaving the harbor. In order to take Korra close enough to the ${link_3} to clear them out, Mako and Korra used their firebending as boosters to offset the lack of a runway on Varrick's ship, enabling Asami to take flight with Varrick's plane.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "prison",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_prison",
            "page": "Southern_Water_Tribe_prison"
          }
        },
        {
          "body": "Varrick's yacht",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Varrick%27s_yacht",
            "page": "Varrick%27s_yacht"
          }
        },
        {
          "body": "battleships",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Battleship",
            "page": "Battleship"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Northern and Southern tensions rise"
      ],
      "text": "Mako and the rest of Team Avatar went to break Tonraq out of prison, but they found his cell to be empty and Unalaq there waiting for them. After learning that the Chief had shipped the prisoners off to the North, Korra and Mako got into a brief skirmish with Unalaq, before leaving for Varrick's yacht in hopes of catching up with the ship. However, shortly after they set sail they ran into a Northern blockade preventing them from leaving the harbor. In order to take Korra close enough to the battleships to clear them out, Mako and Korra used their firebending as boosters to offset the lack of a runway on Varrick's ship, enabling Asami to take flight with Varrick's plane."
    },
    {
      "body": "After Korra successfully cleared the blockade, the three scoured the surface from their elevated position for the ship carrying Tonraq and the others. As they spotted it, they jumped out of the plane and let it crash next to the northern ship to create a diversion. They boarded the ship and quickly freed the prisoners. Mako and his friends subsequently left for Republic City again in hopes of convincing ${link_0} ${link_1} to deploy the United Forces to help the South in the ${link_2} against the North.",
      "links": [
        {
          "body": "President",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "Water Tribe Civil War",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Water_Tribe_Civil_War",
            "page": "Water_Tribe_Civil_War"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Northern and Southern tensions rise"
      ],
      "text": "After Korra successfully cleared the blockade, the three scoured the surface from their elevated position for the ship carrying Tonraq and the others. As they spotted it, they jumped out of the plane and let it crash next to the northern ship to create a diversion. They boarded the ship and quickly freed the prisoners. Mako and his friends subsequently left for Republic City again in hopes of convincing President Raiko to deploy the United Forces to help the South in the Water Tribe Civil War against the North."
    },
    {
      "body": "Upon returning to Republic City, Lin Beifong called him back to the force, telling him she needed him to help maintain the order during a peace march held by the Southerners against the northern occupation of their tribe. When Korra expressed her desire to attend the march, Mako opposed to idea, believing that she, as the Avatar, should at least attempt to seem neutral. Realizing she would not follow his advice, he left the group, preparing to go back to work.",
      "links": [],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Troubles with Korra"
      ],
      "text": "Upon returning to Republic City, Lin Beifong called him back to the force, telling him she needed him to help maintain the order during a peace march held by the Southerners against the northern occupation of their tribe. When Korra expressed her desire to attend the march, Mako opposed to idea, believing that she, as the Avatar, should at least attempt to seem neutral. Realizing she would not follow his advice, he left the group, preparing to go back to work."
    },
    {
      "body": "When Mako was watching over the protest, he discovered two suspicious people leave the ${link_0}. He attempted to stop them, but as he came close, they used a remote control to set off bombs in the building. Mako pursued them, intending on apprehending the culprits, but after a brief fire battle, he only managed to procure their control, and the people got away. He met up with Korra who was busy extinguishing the fire, and retold his run-in with the firebenders, telling her that the Northern Water Tribe might not be the culprit as she believed. However, his suspicion was promptly dismissed, both by Korra and ${link_1}, the detectives in charge of the ${link_2} case and whom he had given the recovered remote control. Believing in the North's innocence, Mako started an investigation of his own.",
      "links": [
        {
          "body": "Southern Water Tribe Cultural Center",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_Cultural_Center",
            "page": "Southern_Water_Tribe_Cultural_Center"
          }
        },
        {
          "body": "Lu and Gang",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lu_and_Gang",
            "page": "Lu_and_Gang"
          }
        },
        {
          "body": "bombing",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Bombing_of_the_Southern_Water_Tribe_Cultural_Center",
            "page": "Bombing_of_the_Southern_Water_Tribe_Cultural_Center"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Troubles with Korra"
      ],
      "text": "When Mako was watching over the protest, he discovered two suspicious people leave the Southern Water Tribe Cultural Center. He attempted to stop them, but as he came close, they used a remote control to set off bombs in the building. Mako pursued them, intending on apprehending the culprits, but after a brief fire battle, he only managed to procure their control, and the people got away. He met up with Korra who was busy extinguishing the fire, and retold his run-in with the firebenders, telling her that the Northern Water Tribe might not be the culprit as she believed. However, his suspicion was promptly dismissed, both by Korra and Lu and Gang, the detectives in charge of the bombing case and whom he had given the recovered remote control. Believing in the North's innocence, Mako started an investigation of his own."
    },
    {
      "body": "The next day, Korra came by his apartment, venting her frustrations about President Raiko's refusal to send the United Forces to assist the south. Mako said that he understood why Raiko was not taking action, as the conflict did not concern the ${link_0}. Their argument escalated quickly, either one believing their respective job to be more important and pressing than the other's. After Mako blamed Korra for messing things up all the time, she stormed out.",
      "links": [
        {
          "body": "United Republic",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Troubles with Korra"
      ],
      "text": "The next day, Korra came by his apartment, venting her frustrations about President Raiko's refusal to send the United Forces to assist the south. Mako said that he understood why Raiko was not taking action, as the conflict did not concern the United Republic. Their argument escalated quickly, either one believing their respective job to be more important and pressing than the other's. After Mako blamed Korra for messing things up all the time, she stormed out."
    },
    {
      "body": "Mako resumed his investigation, flipping through police photo books in hopes of identifying the firebender he had seen fleeing the scene of the bombing. When Bolin later came by, informing Mako of their friends' plans to assist the south, as well as his intention to star in Varrick's propaganda film, Mako mostly ignored him, up until his brother mentioned that Korra intended to go directly to General Iroh for military aid, which Mako dismissed as a terrible idea. However, as Bolin took the photo book and turned a page, Mako's attention was drawn to one of the men he saw there, identifying the person as one of the bombers. Excited about the breakthrough, he quickly headed to the ${link_0} to inform Chief Beifong.",
      "links": [
        {
          "body": "police headquarters",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Police_headquarters",
            "page": "Police_headquarters"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Troubles with Korra"
      ],
      "text": "Mako resumed his investigation, flipping through police photo books in hopes of identifying the firebender he had seen fleeing the scene of the bombing. When Bolin later came by, informing Mako of their friends' plans to assist the south, as well as his intention to star in Varrick's propaganda film, Mako mostly ignored him, up until his brother mentioned that Korra intended to go directly to General Iroh for military aid, which Mako dismissed as a terrible idea. However, as Bolin took the photo book and turned a page, Mako's attention was drawn to one of the men he saw there, identifying the person as one of the bombers. Excited about the breakthrough, he quickly headed to the police headquarters to inform Chief Beifong."
    },
    {
      "body": "As he informed Lu and Gang about his discovery, the two detectives pranked him by sending him into Lin's office, well aware that she was having a meeting with the President and did not want to be disturbed. Angered, he disclosed his findings, namely that the ${link_0} was hired to bomb the center and blame it on the North, to the two cops, though was promptly dismissed, as they did not investigate things further, believing the North was behind it. Mako returned to his own desk, though was approached by President Raiko. Mako was commended for his good work as a police officer, and asked if he, as the Avatar's boyfriend, knew if she was up to something. Reminded that he swore an oath to always uphold the law, Mako told the President about Korra's intention of going directly to the United Forces.",
      "links": [
        {
          "body": "Agni Kai Triad",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Agni_Kai_Triad",
            "page": "Agni_Kai_Triad"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Troubles with Korra"
      ],
      "text": "As he informed Lu and Gang about his discovery, the two detectives pranked him by sending him into Lin's office, well aware that she was having a meeting with the President and did not want to be disturbed. Angered, he disclosed his findings, namely that the Agni Kai Triad was hired to bomb the center and blame it on the North, to the two cops, though was promptly dismissed, as they did not investigate things further, believing the North was behind it. Mako returned to his own desk, though was approached by President Raiko. Mako was commended for his good work as a police officer, and asked if he, as the Avatar's boyfriend, knew if she was up to something. Reminded that he swore an oath to always uphold the law, Mako told the President about Korra's intention of going directly to the United Forces."
    },
    {
      "body": "When Korra barged into the police headquarters some time later, the two got into another heated argument, as Korra felt betrayed by Mako's actions, whereas he perceived it as doing his job. Mako attempted to explain to his furious girlfriend that he could not ignore a direct question of the President. As the argument intensified, Mako angrily concluded that since they were both putting their jobs before their relationship, there was simply no room for a relationship anymore, and he broke up with Korra.",
      "links": [],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Troubles with Korra"
      ],
      "text": "When Korra barged into the police headquarters some time later, the two got into another heated argument, as Korra felt betrayed by Mako's actions, whereas he perceived it as doing his job. Mako attempted to explain to his furious girlfriend that he could not ignore a direct question of the President. As the argument intensified, Mako angrily concluded that since they were both putting their jobs before their relationship, there was simply no room for a relationship anymore, and he broke up with Korra."
    },
    {
      "body": "Later, Mako reminisced over his time with Korra by looking at a picture of him and her. His musings were interrupted by a panicking Asami, who just had been informed of the theft of her shipment to the South. In an attempt to calm her down, he assured her that he would find the culprits, and let her listen in on Lin's questioning of the ship's captain. When he heard the man speak of how the bombs used to attack his vessel seemed to have been detonated remotely, Mako suspected there to be a link between the robbery and the bombing of the Southern Water Tribe Cultural Center. He interrupted Lin's questioning to ask the captain if he recognized the detonator he had found at the bombing scene. However, Mako's ideas fell in deaf ears as an annoyed Lin promptly told to stop his investigation and do his job as a beat cop instead.",
      "links": [],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Helping Asami"
      ],
      "text": "Later, Mako reminisced over his time with Korra by looking at a picture of him and her. His musings were interrupted by a panicking Asami, who just had been informed of the theft of her shipment to the South. In an attempt to calm her down, he assured her that he would find the culprits, and let her listen in on Lin's questioning of the ship's captain. When he heard the man speak of how the bombs used to attack his vessel seemed to have been detonated remotely, Mako suspected there to be a link between the robbery and the bombing of the Southern Water Tribe Cultural Center. He interrupted Lin's questioning to ask the captain if he recognized the detonator he had found at the bombing scene. However, Mako's ideas fell in deaf ears as an annoyed Lin promptly told to stop his investigation and do his job as a beat cop instead."
    },
    {
      "body": "Outside the police headquarters, Mako told her his plan of setting up a sting operation, but became hesitant to go through with it, as it would mean going behind Lin's back, and as such, he would risk his position as a police officer. However, when Asami pleaded with him to help her, as capturing the people responsible was the only way to save Future Industries, the last remnant of ${link_0}, he caves and agreed to set up the operation nonetheless. With the help of Varrick who offered a ship, he and Asami stated to load the vessel with empty crates, while stocking the true cargo in one of Future Industries warehouses. In need of extra manpower to capture the thieves, he avoided Asami's question of asking Korra for her, telling her he would ask Bolin. However, the earthbender saw his chance to get back at Mako for leaving him hanging after they all returned to the city, forcing Mako and Asami to turn to the Triple Threat Triad instead. In exchange for their help with the sting operation, he offered them to talk to Korra on Shady Shin's behalf to get his bending restored, and after Asami threw in some newly manufactured ${link_1}, the two teenagers struck a deal with the mobsters.",
      "links": [
        {
          "body": "her family",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sato_family",
            "page": "Sato_family"
          }
        },
        {
          "body": "motor vehicles",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Motor_vehicle",
            "page": "Motor_vehicle"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Helping Asami"
      ],
      "text": "Outside the police headquarters, Mako told her his plan of setting up a sting operation, but became hesitant to go through with it, as it would mean going behind Lin's back, and as such, he would risk his position as a police officer. However, when Asami pleaded with him to help her, as capturing the people responsible was the only way to save Future Industries, the last remnant of her family, he caves and agreed to set up the operation nonetheless. With the help of Varrick who offered a ship, he and Asami stated to load the vessel with empty crates, while stocking the true cargo in one of Future Industries warehouses. In need of extra manpower to capture the thieves, he avoided Asami's question of asking Korra for her, telling her he would ask Bolin. However, the earthbender saw his chance to get back at Mako for leaving him hanging after they all returned to the city, forcing Mako and Asami to turn to the Triple Threat Triad instead. In exchange for their help with the sting operation, he offered them to talk to Korra on Shady Shin's behalf to get his bending restored, and after Asami threw in some newly manufactured motor vehicles, the two teenagers struck a deal with the mobsters."
    },
    {
      "body": "While waiting for the ship to get ambushed, Mako and Asami were joined by ${link_0}, who, much to Mako's annoyance, kept talking non-stop. Due to Ping's relentless questions about his relationship with Korra, Mako told him and Asami that he had broken up with the Avatar, though he refused to talk much about it. As time passed by, the two teenagers listened to Ping telling them how he got his nickname. However, Mako got distracted when he thought he heard something. Unable to confirm it with his companions, he went to check it out, and overhead Shady Shin and ${link_1} talking about how the Triple Threats were paid to keep him and Asami busy. Realizing they were being double-crossed, Mako ushered Asami to leave the ship, and together they made their escape in one of the ${link_2}. However, the gangsters gave chase, which eventually led to a one-on-one battle between Mako and Viper. Although Mako was initially defeated, he was saved by Asami's steering skills, which threw the triad's leader off their boat.",
      "links": [
        {
          "body": "Two Toed Ping",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Two_Toed_Ping",
            "page": "Two_Toed_Ping"
          }
        },
        {
          "body": "Viper",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Viper",
            "page": "Viper"
          }
        },
        {
          "body": "speedboats",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Speedboat",
            "page": "Speedboat"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Helping Asami"
      ],
      "text": "While waiting for the ship to get ambushed, Mako and Asami were joined by Two Toed Ping, who, much to Mako's annoyance, kept talking non-stop. Due to Ping's relentless questions about his relationship with Korra, Mako told him and Asami that he had broken up with the Avatar, though he refused to talk much about it. As time passed by, the two teenagers listened to Ping telling them how he got his nickname. However, Mako got distracted when he thought he heard something. Unable to confirm it with his companions, he went to check it out, and overhead Shady Shin and Viper talking about how the Triple Threats were paid to keep him and Asami busy. Realizing they were being double-crossed, Mako ushered Asami to leave the ship, and together they made their escape in one of the speedboats. However, the gangsters gave chase, which eventually led to a one-on-one battle between Mako and Viper. Although Mako was initially defeated, he was saved by Asami's steering skills, which threw the triad's leader off their boat."
    },
    {
      "body": "When Mako told Asami why they needed to leave the ship, the two made their way to the warehouse where Asami had stocked the true shipment, only to find it completely robbed empty. Although Asami lost all hope, Mako ensured her that he still believed in her, which resulted in her kissing him. He swiftly accepted her apology in an attempt to defuse the building awkwardness between them. He left her standing at the warehouse with a promise that he would find the persons responsible.",
      "links": [],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Helping Asami"
      ],
      "text": "When Mako told Asami why they needed to leave the ship, the two made their way to the warehouse where Asami had stocked the true shipment, only to find it completely robbed empty. Although Asami lost all hope, Mako ensured her that he still believed in her, which resulted in her kissing him. He swiftly accepted her apology in an attempt to defuse the building awkwardness between them. He left her standing at the warehouse with a promise that he would find the persons responsible."
    },
    {
      "body": "In an attempt to find the thieves, Mako tracked down Two Toed Ping to get him to talk. However, the gangster could not tell him much more besides the fact that they had been hired by someone else to stall him and Asami. Subsequently searching for Varrick to ask the businessman some question, Mako went to see Bolin. As he watched Bolin do his scene, he asked one of the technicians how they managed to make the explosions go off and learned that ${link_0} had developed the exclusive technology of a remote detonator. Realizing Varrick was behind all the attacks, Mako rushed to Asami to tell her the news, only to arrive just after she signed controlling power of her company over to Varrick. As Mako and Varrick knowingly stared each other down, Mako decided not to say anything in front of Varrick.",
      "links": [
        {
          "body": "Varrick Global Industries",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Varrick_Global_Industries",
            "page": "Varrick_Global_Industries"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Helping Asami"
      ],
      "text": "In an attempt to find the thieves, Mako tracked down Two Toed Ping to get him to talk. However, the gangster could not tell him much more besides the fact that they had been hired by someone else to stall him and Asami. Subsequently searching for Varrick to ask the businessman some question, Mako went to see Bolin. As he watched Bolin do his scene, he asked one of the technicians how they managed to make the explosions go off and learned that Varrick Global Industries had developed the exclusive technology of a remote detonator. Realizing Varrick was behind all the attacks, Mako rushed to Asami to tell her the news, only to arrive just after she signed controlling power of her company over to Varrick. As Mako and Varrick knowingly stared each other down, Mako decided not to say anything in front of Varrick."
    },
    {
      "body": "Later, Mako traveled to the set of ${link_0}, where he found Asami and Bolin and told them that it was Varrick who masterminded the thefts of Future Industries' property. His allegations were met with disbelief, causing him to snap at Asami. When the Sato heiress gently touched Mako's chest, stating that he needed to relax, Bolin interrupted the intimate moment by exclaiming in shock that they were dating again, a conclusion both Mako and Asami were quick to deny. The firebender quickly steered the conversation back to his incriminations of Varrick, elaborating his reasons for why he came to his conclusion. After he once again received no support for his theory and was even told by Bolin to let it go, he snapped at them in annoyance and left. However, before he could make his way out of the studio, he was halted by two broad men and taken to see Varrick.",
      "links": [
        {
          "body": "The Adventures of Nuktuk: Hero of the South",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/The_Adventures_of_Nuktuk__Hero_of_the_South",
            "page": "The_Adventures_of_Nuktuk__Hero_of_the_South"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Helping Asami"
      ],
      "text": "Later, Mako traveled to the set of The Adventures of Nuktuk: Hero of the South, where he found Asami and Bolin and told them that it was Varrick who masterminded the thefts of Future Industries' property. His allegations were met with disbelief, causing him to snap at Asami. When the Sato heiress gently touched Mako's chest, stating that he needed to relax, Bolin interrupted the intimate moment by exclaiming in shock that they were dating again, a conclusion both Mako and Asami were quick to deny. The firebender quickly steered the conversation back to his incriminations of Varrick, elaborating his reasons for why he came to his conclusion. After he once again received no support for his theory and was even told by Bolin to let it go, he snapped at them in annoyance and left. However, before he could make his way out of the studio, he was halted by two broad men and taken to see Varrick."
    },
    {
      "body": "Mako was pushed into a room where Varrick was sitting on a chair before a pit with burning coals, which he assumed were to torture him to make him talk. However, Varrick casually brushed aside that assumption, and proceeded with offering Mako a job on his security force, though the firebender declined, stating he already had a job. Even when Varrick implied that something might befall Asami or Bolin if he did not accept, Mako refused and promptly left the room.",
      "links": [],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Helping Asami"
      ],
      "text": "Mako was pushed into a room where Varrick was sitting on a chair before a pit with burning coals, which he assumed were to torture him to make him talk. However, Varrick casually brushed aside that assumption, and proceeded with offering Mako a job on his security force, though the firebender declined, stating he already had a job. Even when Varrick implied that something might befall Asami or Bolin if he did not accept, Mako refused and promptly left the room."
    },
    {
      "body": "Mako returned home, where he resumed his investigation, but was interrupted by Asami knocking on the door, who came by to help him relax by inviting him to dinner at ${link_0}. Reminiscing about their first date, the two shared a kiss, though their intimate moment was cut short by another knock on the door. As he answered it, Lin Beifong and Lu and Gang entered his apartment. When Mako inquired what they were doing there, he was informed that arrested Triple Threat Triad members had told Lin that he had hired the gangsters for a sting operation, as well as aiding them to rob Future Industries' warehouses. Although Mako refuted the allegations, Lu and Gang searched his apartment and stumbled upon a bag full of money and explosives. Consequently, Mako was arrested, causing Asami to doubt her trust in him. As he was led away, Mako tried to reassure her of his innocence, putting the blame on Varrick for framing him.",
      "links": [
        {
          "body": "Kwong's Cuisine",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kwong%27s_Cuisine",
            "page": "Kwong%27s_Cuisine"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Helping Asami"
      ],
      "text": "Mako returned home, where he resumed his investigation, but was interrupted by Asami knocking on the door, who came by to help him relax by inviting him to dinner at Kwong's Cuisine. Reminiscing about their first date, the two shared a kiss, though their intimate moment was cut short by another knock on the door. As he answered it, Lin Beifong and Lu and Gang entered his apartment. When Mako inquired what they were doing there, he was informed that arrested Triple Threat Triad members had told Lin that he had hired the gangsters for a sting operation, as well as aiding them to rob Future Industries' warehouses. Although Mako refuted the allegations, Lu and Gang searched his apartment and stumbled upon a bag full of money and explosives. Consequently, Mako was arrested, causing Asami to doubt her trust in him. As he was led away, Mako tried to reassure her of his innocence, putting the blame on Varrick for framing him."
    },
    {
      "body": "Bolin subsequently visited Mako in prison, where Mako tried again to convince him of Varrick's duplicity, though Bolin remained unconvinced. After hearing about the premiere of the Adventures of Nuktuk finale, Mako warned Bolin that something might take place at the event. His suspicions proved correct, as several of Varrick's hired thugs impersonated Northern Tribe soldiers and attempted to kidnap president Raiko. After the attack was thwarted, Mako was vindicated and released, and informed that he would be promoted to detective. However, other issues quickly arose: Korra had returned with news of the dire threat posed by Unalaq's alliance with the dark spirit ${link_0}. To Mako's surprise, Korra also remembered nothing of their breakup due to a brief bout of amnesia, and Mako chose not to remind her of the events. The reassembled Team Avatar departed for the South Pole aboard a ${link_1} provided by the imprisoned Varrick.",
      "links": [
        {
          "body": "Vaatu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "battleship",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Battleship",
            "page": "Battleship"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Battle to save the world"
      ],
      "text": "Bolin subsequently visited Mako in prison, where Mako tried again to convince him of Varrick's duplicity, though Bolin remained unconvinced. After hearing about the premiere of the Adventures of Nuktuk finale, Mako warned Bolin that something might take place at the event. His suspicions proved correct, as several of Varrick's hired thugs impersonated Northern Tribe soldiers and attempted to kidnap president Raiko. After the attack was thwarted, Mako was vindicated and released, and informed that he would be promoted to detective. However, other issues quickly arose: Korra had returned with news of the dire threat posed by Unalaq's alliance with the dark spirit Vaatu. To Mako's surprise, Korra also remembered nothing of their breakup due to a brief bout of amnesia, and Mako chose not to remind her of the events. The reassembled Team Avatar departed for the South Pole aboard a battleship provided by the imprisoned Varrick."
    },
    {
      "body": "Mako recognized the need to reveal what had happened as a result of their previous fight, but was hesitant about doing so in the tension of the crisis they faced. After learning of Tonraq's imprisonment, the group coordinated an assault on the Northern camp at the Southern portal. Mako, Bolin, and Asami attacked the camp from a plane, attempting to provide a distraction so that Aang's children and Korra could enter the portal. Just as they neared the portal, they were shot down by Desna and Eska, while Korra's party, with the exception of ${link_0}, was also captured. Unalaq revealed to his captives his intent to fuse together with Vaatu upon the spirit's release, the two of them becoming a ${link_1}. Unalaq left them in the charge of Desna and Eska, only for Bumi to rescue them with assistance from Naga and Pabu. Entering the Spirit World through the portal, Mako and Bolin engaged Unalaq while Tenzin and his siblings left in search of ${link_2} and Korra attempted to seal the portals before ${link_3}. Unalaq proved too great a challenge for the bending brothers, and Korra's efforts came too late as Vaatu was freed.",
      "links": [
        {
          "body": "Bumi",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Dark Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_Avatar",
            "page": "Dark_Avatar"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Battle to save the world"
      ],
      "text": "Mako recognized the need to reveal what had happened as a result of their previous fight, but was hesitant about doing so in the tension of the crisis they faced. After learning of Tonraq's imprisonment, the group coordinated an assault on the Northern camp at the Southern portal. Mako, Bolin, and Asami attacked the camp from a plane, attempting to provide a distraction so that Aang's children and Korra could enter the portal. Just as they neared the portal, they were shot down by Desna and Eska, while Korra's party, with the exception of Bumi, was also captured. Unalaq revealed to his captives his intent to fuse together with Vaatu upon the spirit's release, the two of them becoming a Dark Avatar. Unalaq left them in the charge of Desna and Eska, only for Bumi to rescue them with assistance from Naga and Pabu. Entering the Spirit World through the portal, Mako and Bolin engaged Unalaq while Tenzin and his siblings left in search of Jinora and Korra attempted to seal the portals before Harmonic Convergence. Unalaq proved too great a challenge for the bending brothers, and Korra's efforts came too late as Vaatu was freed."
    },
    {
      "body": "After Korra blasted Unalaq back through the portal, Mako and Bolin followed to prevent him from reentering the Spirit World. Desna and Eska, however, joined their father, briefly disabling Mako and Bolin. The two escaped and passed through the portal, only to be frozen in ice by the waterbending twins. As such, they were unable to assist Korra, who was forced to battle Unalaq and Vaatu after the two successfully merged. Mako tried to reason with the twins, insisting that their father was trying to bring about ten thousand years of darkness and questioned why they would protect someone who felt no affection for them. Desna was willing to hear him out but Eska ordered him to ignore Mako. Eska subsequently freed the two after Bolin expressed that he still had feelings for her, which Mako believed he was falsifying. The two followed the battling Avatars back into the material world, only to witness Korra's defeat and separation from ${link_0}, the light spirit and Vaatu's opposite. The brothers attempted to attack the Dark Avatar, but were swiftly defeated by the chief, leaving them unconscious. As they picked up Korra after regaining consciousness, Unalaq transformed into a massive dark spirit and disappeared as he reached toward the spirit lights, causing a shockwave that rendered the trio unconscious.",
      "links": [
        {
          "body": "Raava",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Raava",
            "page": "Raava"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Battle to save the world"
      ],
      "text": "After Korra blasted Unalaq back through the portal, Mako and Bolin followed to prevent him from reentering the Spirit World. Desna and Eska, however, joined their father, briefly disabling Mako and Bolin. The two escaped and passed through the portal, only to be frozen in ice by the waterbending twins. As such, they were unable to assist Korra, who was forced to battle Unalaq and Vaatu after the two successfully merged. Mako tried to reason with the twins, insisting that their father was trying to bring about ten thousand years of darkness and questioned why they would protect someone who felt no affection for them. Desna was willing to hear him out but Eska ordered him to ignore Mako. Eska subsequently freed the two after Bolin expressed that he still had feelings for her, which Mako believed he was falsifying. The two followed the battling Avatars back into the material world, only to witness Korra's defeat and separation from Raava, the light spirit and Vaatu's opposite. The brothers attempted to attack the Dark Avatar, but were swiftly defeated by the chief, leaving them unconscious. As they picked up Korra after regaining consciousness, Unalaq transformed into a massive dark spirit and disappeared as he reached toward the spirit lights, causing a shockwave that rendered the trio unconscious."
    },
    {
      "body": "Found by Tenzin and his siblings following their rescue of Jinora, the former Fire Ferrets were revived by ${link_0} back in the Spirit World. Korra, having lost her connection to Raava and the previous Avatars, expressed a sense of defeat, but was encouraged by Tenzin. Mako watched as Korra entered the ${link_1}, her spirit emerging and growing to the size of Unalaq's new form. As the two titans battled in the mortal world, a force of dark spirits converged on the tree, forcing Mako and his allies to fight them off. Eska and Desna also joined the battle, and Korra returned after defeating the combined Unalaq and Vaatu. Rejoining Raava, Korra decided to leave the spirit portals open an allow humans and spirits to interact without restriction. At this point, Mako finally admitted their breakup to her, and she revealed that her memory of the fight had been regained in the Tree of Time. Agreeing that they would always love each other, the pair nevertheless admitted that a romantic relationship between them could not work. They subsequently shared a final kiss, ending their relationship on a positive note.",
      "links": [
        {
          "body": "Kya",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kya",
            "page": "Kya"
          }
        },
        {
          "body": "Tree of Time",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "Battle to save the world"
      ],
      "text": "Found by Tenzin and his siblings following their rescue of Jinora, the former Fire Ferrets were revived by Kya back in the Spirit World. Korra, having lost her connection to Raava and the previous Avatars, expressed a sense of defeat, but was encouraged by Tenzin. Mako watched as Korra entered the Tree of Time, her spirit emerging and growing to the size of Unalaq's new form. As the two titans battled in the mortal world, a force of dark spirits converged on the tree, forcing Mako and his allies to fight them off. Eska and Desna also joined the battle, and Korra returned after defeating the combined Unalaq and Vaatu. Rejoining Raava, Korra decided to leave the spirit portals open an allow humans and spirits to interact without restriction. At this point, Mako finally admitted their breakup to her, and she revealed that her memory of the fight had been regained in the Tree of Time. Agreeing that they would always love each other, the pair nevertheless admitted that a romantic relationship between them could not work. They subsequently shared a final kiss, ending their relationship on a positive note."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "See also"
      ],
      "text": "Mako"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Mako (152 AG - 170 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Mako_(152_AG_-_170_AG)",
            "page": "History_of_Mako_(152_AG_-_170_AG)"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "See also"
      ],
      "text": "History of Mako (152 AG - 170 AG)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Mako (late 171 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Mako_(late_171_AG)",
            "page": "History_of_Mako_(late_171_AG)"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "See also"
      ],
      "text": "History of Mako (late 171 AG)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Mako (174 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Mako_(174_AG)",
            "page": "History_of_Mako_(174_AG)"
          }
        }
      ],
      "section": [
        "History of Mako (171 AG - Harmonic Convergence)",
        "See also"
      ],
      "text": "History of Mako (174 AG)"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Mako_(171_AG_-_Harmonic_Convergence)",
    "file": "avatar.wikia.com/wiki/History_of_Mako_(171_AG_-_Harmonic_Convergence).html",
    "page": "History_of_Mako_(171_AG_-_Harmonic_Convergence)",
    "title": "History of Mako (171 AG - Harmonic Convergence)"
  }
}