{
  "categories": [
    {
      "body": "Sokka",
      "target": {
        "href": "Category_Sokka",
        "page": "Category_Sokka"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "After the ${link_0} of the ${link_1}, ${link_2}, his now-master ${link_3} sister ${link_4}, and ${link_5} ${link_6} journeyed to the ${link_7} in search for an ${link_8} master to teach Aang.",
      "links": [
        {
          "body": "siege",
          "key": "${link_0}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_2}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_3}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Katara",
          "key": "${link_4}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_5}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_6}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_7}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_8}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "After the siege of the Northern Water Tribe, Sokka, his now-master waterbending sister Katara, and Avatar Aang journeyed to the Earth Kingdom in search for an earthbending master to teach Aang."
    },
    {
      "body": "${link_0} tried to scare ${link_1} into the ${link_2} by making it seem that his head is that of ${link_3}'s.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Momo",
          "key": "${link_3}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "Sokka tried to scare Aang into the Avatar State by making it seem that his head is that of Momo's."
    },
    {
      "body": "After leaving the Northern Water Tribe on Master ${link_0}'s boat, Sokka and the others arrived at ${link_1}. General ${link_2} claimed that victory in the ${link_3} depended solely upon Aang mastering the ${link_4}. Sokka participated in the attempts to trigger the state through an unsuccessful attempt to scare Aang. When Fong attacked Aang in hopes of inducing the Avatar State, Sokka mounted an ${link_5}, wishing to defend him. At the conclusion of the fight, he knocked out the general, asking, \"Anyone got a problem with that?\" to which the soldiers quickly shook their heads. When asked if they still needed an escort to ${link_6}, he and the others turned down the offer.",
      "links": [
        {
          "body": "Pakku",
          "key": "${link_0}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "General Fong's Earth Kingdom base",
          "key": "${link_1}",
          "target": {
            "href": "General_Fong%27s_fortress",
            "page": "General_Fong%27s_fortress"
          }
        },
        {
          "body": "Fong",
          "key": "${link_2}",
          "target": {
            "href": "Fong",
            "page": "Fong"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_3}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_4}",
          "target": {
            "href": "Avatar#The_Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "ostrich horse",
          "key": "${link_5}",
          "target": {
            "href": "Ostrich_horse",
            "page": "Ostrich_horse"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_6}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        }
      ],
      "text": "After leaving the Northern Water Tribe on Master Pakku's boat, Sokka and the others arrived at General Fong's Earth Kingdom base. General Fong claimed that victory in the Hundred Year War depended solely upon Aang mastering the Avatar State. Sokka participated in the attempts to trigger the state through an unsuccessful attempt to scare Aang. When Fong attacked Aang in hopes of inducing the Avatar State, Sokka mounted an ostrich horse, wishing to defend him. At the conclusion of the fight, he knocked out the general, asking, \"Anyone got a problem with that?\" to which the soldiers quickly shook their heads. When asked if they still needed an escort to Omashu, he and the others turned down the offer."
    },
    {
      "body": "The team later encountered a group of laid back, easygoing nomads whom Sokka found unbearable with their consistent song playing. With the nomads' aid, the team was led through an underground passage known as the ${link_0}. Upon arrival at Omashu, the group discovered it had been captured by the ${link_1}. Sokka assisted in the freeing of the citizens of Omashu by inventing a disease called \"${link_2}\". The group was forced to leave Omashu after ${link_3} told Aang he would need to find a new earthbending teacher.",
      "links": [
        {
          "body": "Cave of Two Lovers",
          "key": "${link_0}",
          "target": {
            "href": "Cave_of_Two_Lovers",
            "page": "Cave_of_Two_Lovers"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "pentapox",
          "key": "${link_2}",
          "target": {
            "href": "Pentapox",
            "page": "Pentapox"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_3}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        }
      ],
      "text": "The team later encountered a group of laid back, easygoing nomads whom Sokka found unbearable with their consistent song playing. With the nomads' aid, the team was led through an underground passage known as the Cave of Two Lovers. Upon arrival at Omashu, the group discovered it had been captured by the Fire Nation. Sokka assisted in the freeing of the citizens of Omashu by inventing a disease called \"pentapox\". The group was forced to leave Omashu after Bumi told Aang he would need to find a new earthbending teacher."
    },
    {
      "body": "Sokka, Katara, and Aang flew on ${link_0} above a ${link_1}. Aang stared at the swamp in a sort of hypnotic trance, and started lowering the group into the swamp. When Sokka inquired about Aang's actions, he came out of his trance and claimed that the swamp was \"calling to him\". Sokka tried to convince Aang to ignore this preternatural call, but Aang was still interested because of what King Bumi told him about listening to the earth. Sokka, who was being his usual stubborn self, said to ignore it. Aang started to leave once Katara, Appa and ${link_2} started to complain about the swamp. An oddly located tornado came right toward the gang and they fell down with much force.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "giant swamp",
          "key": "${link_1}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "Momo",
          "key": "${link_2}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "Sokka, Katara, and Aang flew on Appa above a giant swamp. Aang stared at the swamp in a sort of hypnotic trance, and started lowering the group into the swamp. When Sokka inquired about Aang's actions, he came out of his trance and claimed that the swamp was \"calling to him\". Sokka tried to convince Aang to ignore this preternatural call, but Aang was still interested because of what King Bumi told him about listening to the earth. Sokka, who was being his usual stubborn self, said to ignore it. Aang started to leave once Katara, Appa and Momo started to complain about the swamp. An oddly located tornado came right toward the gang and they fell down with much force."
    },
    {
      "body": "${link_0} hallucinated ${link_1} while lost in the ${link_2}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Yue",
          "key": "${link_1}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Foggy Swamp",
          "key": "${link_2}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        }
      ],
      "text": "Sokka hallucinated Yue while lost in the Foggy Swamp."
    },
    {
      "body": "Aang, Katara and Sokka were separated from Appa and Momo due to landing in different places. The trio, led by Sokka, tried to find their animal friends with Sokka chopping everything in sight with his ${link_0}. Aang told Sokka that they should be \"a little nicer to the swamp\". Katara agreed with Aang, as she felt some supernatural qualities in the swamp. She claimed that it feels \"alive\". Sokka kept chopping around anyway, but Aang said that the longer they stay there, the more he thought he should not do that. Though Katara and Aang still believed something supernatural was going on in the swamp, Sokka dismissed their concerns. They later saw strange glowing eyes and got a little scared. The strange thing that was looking at Aang was shown again, still unseen. This time, it grabbed each of them in their sleep with its vines. They awoke and each managed to escape from the vines using their styles of fighting. The trio ended up in separate places.",
      "links": [
        {
          "body": "machete",
          "key": "${link_0}",
          "target": {
            "href": "Sokka%27s_weapons#Machete",
            "page": "Sokka%27s_weapons"
          }
        }
      ],
      "text": "Aang, Katara and Sokka were separated from Appa and Momo due to landing in different places. The trio, led by Sokka, tried to find their animal friends with Sokka chopping everything in sight with his machete. Aang told Sokka that they should be \"a little nicer to the swamp\". Katara agreed with Aang, as she felt some supernatural qualities in the swamp. She claimed that it feels \"alive\". Sokka kept chopping around anyway, but Aang said that the longer they stay there, the more he thought he should not do that. Though Katara and Aang still believed something supernatural was going on in the swamp, Sokka dismissed their concerns. They later saw strange glowing eyes and got a little scared. The strange thing that was looking at Aang was shown again, still unseen. This time, it grabbed each of them in their sleep with its vines. They awoke and each managed to escape from the vines using their styles of fighting. The trio ended up in separate places."
    },
    {
      "body": "While wandering the swamp by himself, Sokka thought he saw ${link_0} ${link_1}. The illusion spoke to him in Yue's voice and said, \"You didn't protect me.\" She left, and Sokka stood there, stunned. The trio was reunited in the center of the swamp, which was a giant tree. Aang believed that the swamp was calling them there. All of a sudden, the giant monster who earlier had grabbed them appeared. Aang and Katara finally defeated the swamp monster, who was really a waterbender bending the water in the vines that encased him to make the monster. He said the swamp was just ${link_2}, stretching out its roots for miles. He also said that the whole world was one organism like the swamp. If one listened carefully, he explained, they can hear everything breathing together because everything is connected. He went on to explain each person's visions. In the swamp, people had visions of \"people we've lost, people we've loved\", though they were not really gone because everyone is connected. After the group found Momo and Appa, they left the swamp.",
      "links": [
        {
          "body": "Princess",
          "key": "${link_0}",
          "target": {
            "href": "Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_1}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "one big tree",
          "key": "${link_2}",
          "target": {
            "href": "Banyan-grove_tree",
            "page": "Banyan-grove_tree"
          }
        }
      ],
      "text": "While wandering the swamp by himself, Sokka thought he saw Princess Yue. The illusion spoke to him in Yue's voice and said, \"You didn't protect me.\" She left, and Sokka stood there, stunned. The trio was reunited in the center of the swamp, which was a giant tree. Aang believed that the swamp was calling them there. All of a sudden, the giant monster who earlier had grabbed them appeared. Aang and Katara finally defeated the swamp monster, who was really a waterbender bending the water in the vines that encased him to make the monster. He said the swamp was just one big tree, stretching out its roots for miles. He also said that the whole world was one organism like the swamp. If one listened carefully, he explained, they can hear everything breathing together because everything is connected. He went on to explain each person's visions. In the swamp, people had visions of \"people we've lost, people we've loved\", though they were not really gone because everyone is connected. After the group found Momo and Appa, they left the swamp."
    },
    {
      "body": "${link_0} acted as a detective to clear ${link_1}'s name.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Sokka acted as a detective to clear Aang's name."
    },
    {
      "body": "While in the Earth Kingdom village of ${link_0}, the three kids learned of an annual holiday called \"${link_1}\". They watched a parade with giant floats that were made to look like ${link_2}, ${link_3} and Aang. The trio at first believed that the festival was honoring the ${link_4}, but a man torched the three floats to the loud approval of the village, who chanted, \"Down with the Avatar! Down with the Avatar!\" Aang revealed himself as the Avatar, only to be arrested. While in his ${link_5}, the village's mayor explained to him that \"Avatar Day\" was formed after Avatar Kyoshi killed the village's leader, ${link_6} the Great. Sokka took up the job as Aang's detective. To prove Aang's (or rather, Kyoshi's) innocence, Sokka and Katara searched the village and returned to ${link_7} to find evidence that said otherwise. The evidence was useless because in these trials, the opposing sides only told what they believe happened. Using only the two stories, the jury decided who was innocent and who was guilty; for this case, the ${link_8} served as both prosecution and jury.",
      "links": [
        {
          "body": "Chin Village",
          "key": "${link_0}",
          "target": {
            "href": "Chin_Village",
            "page": "Chin_Village"
          }
        },
        {
          "body": "Avatar Day",
          "key": "${link_1}",
          "target": {
            "href": "Avatar_Day_festival",
            "page": "Avatar_Day_festival"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_2}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        },
        {
          "body": "Roku",
          "key": "${link_3}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_4}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "jail cell",
          "key": "${link_5}",
          "target": {
            "href": "Chin_Village_prison",
            "page": "Chin_Village_prison"
          }
        },
        {
          "body": "Chin",
          "key": "${link_6}",
          "target": {
            "href": "Chin",
            "page": "Chin"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_7}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "village mayor",
          "key": "${link_8}",
          "target": {
            "href": "Tong",
            "page": "Tong"
          }
        }
      ],
      "text": "While in the Earth Kingdom village of Chin Village, the three kids learned of an annual holiday called \"Avatar Day\". They watched a parade with giant floats that were made to look like Kyoshi, Roku and Aang. The trio at first believed that the festival was honoring the Avatar, but a man torched the three floats to the loud approval of the village, who chanted, \"Down with the Avatar! Down with the Avatar!\" Aang revealed himself as the Avatar, only to be arrested. While in his jail cell, the village's mayor explained to him that \"Avatar Day\" was formed after Avatar Kyoshi killed the village's leader, Chin the Great. Sokka took up the job as Aang's detective. To prove Aang's (or rather, Kyoshi's) innocence, Sokka and Katara searched the village and returned to Kyoshi Island to find evidence that said otherwise. The evidence was useless because in these trials, the opposing sides only told what they believe happened. Using only the two stories, the jury decided who was innocent and who was guilty; for this case, the village mayor served as both prosecution and jury."
    },
    {
      "body": "During Aang's trial, after hearing the village mayor's story and Aang's vague version, he was found guilty. Refusing to give up, Sokka and Katara had Aang dress up in Kyoshi's old uniform. Kyoshi manifested herself through Aang and told the true story. Immediately afterward, the town was attacked by the ${link_0}. The trio engaged the warriors in battle and was successful in driving them away, and Sokka regaining his ${link_1} during the battle. In an act of thanks, the mayor decided that in the future, Avatars will be honored on \"Avatar Day\". Before they left, Sokka expressed his feelings that this was by far the worst town they had ever visited.",
      "links": [
        {
          "body": "Rough Rhinos",
          "key": "${link_0}",
          "target": {
            "href": "Rough_Rhinos",
            "page": "Rough_Rhinos"
          }
        },
        {
          "body": "boomerang",
          "key": "${link_1}",
          "target": {
            "href": "Sokka%27s_weapons#Boomerang",
            "page": "Sokka%27s_weapons"
          }
        }
      ],
      "text": "During Aang's trial, after hearing the village mayor's story and Aang's vague version, he was found guilty. Refusing to give up, Sokka and Katara had Aang dress up in Kyoshi's old uniform. Kyoshi manifested herself through Aang and told the true story. Immediately afterward, the town was attacked by the Rough Rhinos. The trio engaged the warriors in battle and was successful in driving them away, and Sokka regaining his boomerang during the battle. In an act of thanks, the mayor decided that in the future, Avatars will be honored on \"Avatar Day\". Before they left, Sokka expressed his feelings that this was by far the worst town they had ever visited."
    },
    {
      "body": "${link_0} admired the ${link_1} championship belt, noting that it went well with his newly acquired bag.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Earth Rumble VI",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Rumble_VI",
            "page": "Earth_Rumble_VI"
          }
        }
      ],
      "text": "Sokka admired the Earth Rumble VI championship belt, noting that it went well with his newly acquired bag."
    },
    {
      "body": "The trio went to the town of ${link_0} to continue the search for someone to teach Aang earthbending. While searching, they heard from a ${link_1} about ${link_2}, a tournament featuring several powerful ${link_3}. The boys were not very inclined to help Aang with the location until Katara used her \"feminine charm\", which involved freezing them to the walls, to convince them to tell.",
      "links": [
        {
          "body": "Gaoling",
          "key": "${link_0}",
          "target": {
            "href": "Gaoling",
            "page": "Gaoling"
          }
        },
        {
          "body": "pair of students",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending_academy_teenagers",
            "page": "Earthbending_academy_teenagers"
          }
        },
        {
          "body": "Earth Rumble VI",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Rumble_VI",
            "page": "Earth_Rumble_VI"
          }
        },
        {
          "body": "earthbenders",
          "key": "${link_3}",
          "target": {
            "href": "Earthbending#Notable_earthbenders",
            "page": "Earthbending"
          }
        }
      ],
      "text": "The trio went to the town of Gaoling to continue the search for someone to teach Aang earthbending. While searching, they heard from a pair of students about Earth Rumble VI, a tournament featuring several powerful earthbenders. The boys were not very inclined to help Aang with the location until Katara used her \"feminine charm\", which involved freezing them to the walls, to convince them to tell."
    },
    {
      "body": "At the tournament, they saw a powerful earthbender named ${link_0}, who defeated every challenger he came across. Sokka completely got into it, but Aang was not very impressed, saying that the Boulder was \"just listening to his muscles\". The Boulder defeated several other contenders, working his way up to the current champion, The Blind Bandit. The Blind Bandit was a blind earthbender who happened to be ${link_1}, a twelve-year-old girl. Aang noticed the Bandit's techniques, especially how she waited and listened carefully to the movements of her opponent, and realized that she was the type of person that Bumi said would make a good earthbending teacher. After Toph helped Aang get away from kidnappers, she decided to come with them, but ${link_2} disapproved.",
      "links": [
        {
          "body": "The Boulder",
          "key": "${link_0}",
          "target": {
            "href": "The_Boulder",
            "page": "The_Boulder"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "her father",
          "key": "${link_2}",
          "target": {
            "href": "Lao_Beifong",
            "page": "Lao_Beifong"
          }
        }
      ],
      "text": "At the tournament, they saw a powerful earthbender named The Boulder, who defeated every challenger he came across. Sokka completely got into it, but Aang was not very impressed, saying that the Boulder was \"just listening to his muscles\". The Boulder defeated several other contenders, working his way up to the current champion, The Blind Bandit. The Blind Bandit was a blind earthbender who happened to be Toph, a twelve-year-old girl. Aang noticed the Bandit's techniques, especially how she waited and listened carefully to the movements of her opponent, and realized that she was the type of person that Bumi said would make a good earthbending teacher. After Toph helped Aang get away from kidnappers, she decided to come with them, but her father disapproved."
    },
    {
      "body": "As Aang and the others got ready to leave, Toph ran up to them, saying that her father changed his mind, letting her travel with them. Sokka wisely offered to leave quickly before her father \"changes his mind again\". Toph was ready to go, but she wanted to show Aang one thing first. Aang hopped down, and she promptly launched him into a tree. Toph, declaring them even, demanded to have her championship belt returned. Sokka dropped the belt on her head expecting her to catch it, \"forgetting\" she was blind.",
      "links": [],
      "text": "As Aang and the others got ready to leave, Toph ran up to them, saying that her father changed his mind, letting her travel with them. Sokka wisely offered to leave quickly before her father \"changes his mind again\". Toph was ready to go, but she wanted to show Aang one thing first. Aang hopped down, and she promptly launched him into a tree. Toph, declaring them even, demanded to have her championship belt returned. Sokka dropped the belt on her head expecting her to catch it, \"forgetting\" she was blind."
    },
    {
      "body": "Toph got along well with Sokka and Aang, but her initial belief in thinking that her friends wanted to help her because she was blind caused a feud between Toph and Katara. The argument only got worse as they were chased around by a mysterious vehicle throughout the night, steadily depriving the group of sleep. The group made an initial stand against ${link_0}, ${link_1} and ${link_2}, where Sokka got insulted by Toph's logic of bending combat before escaping.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Mai",
          "key": "${link_1}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_2}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "text": "Toph got along well with Sokka and Aang, but her initial belief in thinking that her friends wanted to help her because she was blind caused a feud between Toph and Katara. The argument only got worse as they were chased around by a mysterious vehicle throughout the night, steadily depriving the group of sleep. The group made an initial stand against Azula, Mai and Ty Lee, where Sokka got insulted by Toph's logic of bending combat before escaping."
    },
    {
      "body": "Although tired, ${link_0} and ${link_1} ${link_2} ${link_3} and ${link_4} by the ${link_5}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "battled",
          "key": "${link_2}",
          "target": {
            "href": "Duels_(Spring_100_AG)",
            "page": "Duels_(Spring_100_AG)"
          }
        },
        {
          "body": "Mai",
          "key": "${link_3}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_4}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Nan Shan River",
          "key": "${link_5}",
          "target": {
            "href": "Nan_Shan_River",
            "page": "Nan_Shan_River"
          }
        }
      ],
      "text": "Although tired, Sokka and Katara battled Mai and Ty Lee by the Nan Shan River."
    },
    {
      "body": "Even though Sokka was usually the person who complained the most, especially without sleep, it was Katara and Toph who were complaining about each other the most. When it was discovered that Appa's shed fur made a trail for the vehicle to follow, Sokka and Katara headed off with Appa and Momo in one direction while Aang and Toph went separate ways. Sokka soon spotted Mai and Ty Lee tracking them below, but a tired Appa crash-landed to sleep forcing the Water Tribe siblings to make their stand. Sokka's limbs were incapacitated by Ty Lee's ${link_0}-style (though Sokka got the last laugh as he headbutted Ty Lee's hands) while Katara became pinned down by Mai's shurikins. The siblings were saved by Appa, who covered Sokka in saliva.",
      "links": [
        {
          "body": "chi blocking",
          "key": "${link_0}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        }
      ],
      "text": "Even though Sokka was usually the person who complained the most, especially without sleep, it was Katara and Toph who were complaining about each other the most. When it was discovered that Appa's shed fur made a trail for the vehicle to follow, Sokka and Katara headed off with Appa and Momo in one direction while Aang and Toph went separate ways. Sokka soon spotted Mai and Ty Lee tracking them below, but a tired Appa crash-landed to sleep forcing the Water Tribe siblings to make their stand. Sokka's limbs were incapacitated by Ty Lee's chi blocking-style (though Sokka got the last laugh as he headbutted Ty Lee's hands) while Katara became pinned down by Mai's shurikins. The siblings were saved by Appa, who covered Sokka in saliva."
    },
    {
      "body": "Sokka, Katara and Toph came to Aang's rescue and, along with ${link_0} and ${link_1}, cornered Azula. But Iroh's momentary distraction at Toph gave Azula the opportunity to escape by wounding Iroh, forcing the rest to retaliate. After Zuko forces the group to leave him and the wounded Iroh, they found a safe place to sleep.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Sokka, Katara and Toph came to Aang's rescue and, along with Zuko and Iroh, cornered Azula. But Iroh's momentary distraction at Toph gave Azula the opportunity to escape by wounding Iroh, forcing the rest to retaliate. After Zuko forces the group to leave him and the wounded Iroh, they found a safe place to sleep."
    },
    {
      "body": "Each of the members of Aang's group decided to take a \"mini-vacation\" as a way to unwind after all the work they had done; Sokka, on the other hand, thought the group should be working on getting intelligence on the Fire Nation, most specifically a map for when Aang must hunt down the ${link_0}. The group met Professor ${link_1}, a professor at ${link_2}, who told them he was searching for a ${link_3} said to be in the middle the ${link_4}. The library, said to have been created by ${link_5} and his ${link_6}, had more valuable tomes than any other place in the world. Sokka, believing he may be able to get information on the Fire Nation there, dedicated his \"vacation\" to finding the place.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Zei",
          "key": "${link_1}",
          "target": {
            "href": "Zei",
            "page": "Zei"
          }
        },
        {
          "body": "Ba Sing Se University",
          "key": "${link_2}",
          "target": {
            "href": "Ba_Sing_Se_University",
            "page": "Ba_Sing_Se_University"
          }
        },
        {
          "body": "legendary library",
          "key": "${link_3}",
          "target": {
            "href": "Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_4}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        },
        {
          "body": "the spirit of knowledge",
          "key": "${link_5}",
          "target": {
            "href": "Wan_Shi_Tong",
            "page": "Wan_Shi_Tong"
          }
        },
        {
          "body": "fox servants",
          "key": "${link_6}",
          "target": {
            "href": "Knowledge_Seekers",
            "page": "Knowledge_Seekers"
          }
        }
      ],
      "text": "Each of the members of Aang's group decided to take a \"mini-vacation\" as a way to unwind after all the work they had done; Sokka, on the other hand, thought the group should be working on getting intelligence on the Fire Nation, most specifically a map for when Aang must hunt down the Fire Lord. The group met Professor Zei, a professor at Ba Sing Se University, who told them he was searching for a legendary library said to be in the middle the Si Wong Desert. The library, said to have been created by the spirit of knowledge and his fox servants, had more valuable tomes than any other place in the world. Sokka, believing he may be able to get information on the Fire Nation there, dedicated his \"vacation\" to finding the place."
    },
    {
      "body": "Using Appa to fly, the group soon found the library. They found it completely buried in the sand except for its single, highest tower. Aang, Katara, Sokka, Momo and Professor Zei used a window to enter the library; Appa stayed outside, of course, as did Toph, who cannot read since she is blind. Toph also mentioned that, because of the desert sand, she could not feel the vibrations in the ground as well as she normally can, making her lose her usual advantage.",
      "links": [],
      "text": "Using Appa to fly, the group soon found the library. They found it completely buried in the sand except for its single, highest tower. Aang, Katara, Sokka, Momo and Professor Zei used a window to enter the library; Appa stayed outside, of course, as did Toph, who cannot read since she is blind. Toph also mentioned that, because of the desert sand, she could not feel the vibrations in the ground as well as she normally can, making her lose her usual advantage."
    },
    {
      "body": "${link_0} and ${link_1} used the ${link_2} to learn about the ${link_3}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "astronomy room",
          "key": "${link_2}",
          "target": {
            "href": "Planetary_calendar_room",
            "page": "Planetary_calendar_room"
          }
        },
        {
          "body": "Day of Black Sun",
          "key": "${link_3}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        }
      ],
      "text": "Sokka and Aang used the astronomy room to learn about the Day of Black Sun."
    },
    {
      "body": "When the group entered the library, they met the spirit, Wan Shi Tong, who constructed the library; taking the form of a large owl, the spirit initially did not trust them. The spirit, apparently, disliked the fact that humans only use knowledge to get an advantage over other humans; he brought up the last human to have discovered his library, who happened to be Admiral ${link_0} (Zhao mentions a library during the ${link_1}), and believed the group only wanted to get information to help them defeat their enemies (which is, actually, true). But, they convinced him otherwise.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Siege of the North",
          "key": "${link_1}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        }
      ],
      "text": "When the group entered the library, they met the spirit, Wan Shi Tong, who constructed the library; taking the form of a large owl, the spirit initially did not trust them. The spirit, apparently, disliked the fact that humans only use knowledge to get an advantage over other humans; he brought up the last human to have discovered his library, who happened to be Admiral Zhao (Zhao mentions a library during the Siege of the North), and believed the group only wanted to get information to help them defeat their enemies (which is, actually, true). But, they convinced him otherwise."
    },
    {
      "body": "Sokka found a burned paper that mentioned \"the Fire Nation's darkest day\"; it had a date but no other information. It also turned out that Zhao, before leaving, destroyed every other bit of information on the Fire Nation. However, a fox (one of Wan Shi Tong's animal helpers), found the group and leaded them to ${link_0}. There, a date could be entered on a stone wheel, which subsequently showed the heavens on that particular date; when Sokka entered the date of \"the darkest day\", it showed a solar eclipse occurring. The group realized that solar eclipses must weaken or take away the ability to ${link_1} in the same way lunar eclipses affect waterbending; they realized they could use this information to plan an attack on the Fire Nation forces.",
      "links": [
        {
          "body": "a room dedicated to astronomy",
          "key": "${link_0}",
          "target": {
            "href": "Planetary_calendar_room",
            "page": "Planetary_calendar_room"
          }
        },
        {
          "body": "firebend",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Sokka found a burned paper that mentioned \"the Fire Nation's darkest day\"; it had a date but no other information. It also turned out that Zhao, before leaving, destroyed every other bit of information on the Fire Nation. However, a fox (one of Wan Shi Tong's animal helpers), found the group and leaded them to a room dedicated to astronomy. There, a date could be entered on a stone wheel, which subsequently showed the heavens on that particular date; when Sokka entered the date of \"the darkest day\", it showed a solar eclipse occurring. The group realized that solar eclipses must weaken or take away the ability to firebend in the same way lunar eclipses affect waterbending; they realized they could use this information to plan an attack on the Fire Nation forces."
    },
    {
      "body": "Soon, however, Wan Shi Tong found out their plans and decreeded that he will no longer allow humans to misuse his beloved information. He attacked the group and caused the library to begin to sink; that way, it will be completely underground forever. Aang and Sokka hurriedly tried to use the astronomy room to find the next date of a solar eclipse; it turned out the next one was in a few months. They planned to give this information to the Earth Kingdom armies of ${link_0} to help in the war. The group quickly escaped, except for Professor Zei, who said he would rather spend eternity in the library than see it vanish forever; the others had no choice but to leave him. They escaped before the library vanished into the sand. Outside, Toph told Aang that Appa had been stolen by ${link_1}.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "sandbenders",
          "key": "${link_1}",
          "target": {
            "href": "Sandbender_Tribes",
            "page": "Sandbender_Tribes"
          }
        }
      ],
      "text": "Soon, however, Wan Shi Tong found out their plans and decreeded that he will no longer allow humans to misuse his beloved information. He attacked the group and caused the library to begin to sink; that way, it will be completely underground forever. Aang and Sokka hurriedly tried to use the astronomy room to find the next date of a solar eclipse; it turned out the next one was in a few months. They planned to give this information to the Earth Kingdom armies of Ba Sing Se to help in the war. The group quickly escaped, except for Professor Zei, who said he would rather spend eternity in the library than see it vanish forever; the others had no choice but to leave him. They escaped before the library vanished into the sand. Outside, Toph told Aang that Appa had been stolen by sandbenders."
    },
    {
      "body": "${link_0} began to hallucinate after drinking ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "cactus juice",
          "key": "${link_1}",
          "target": {
            "href": "Cactus_juice",
            "page": "Cactus_juice"
          }
        }
      ],
      "text": "Sokka began to hallucinate after drinking cactus juice."
    },
    {
      "body": "While traveling though the desert, the group ran low on water. Sokka found a cactus plant with a liquid trapped inside. He and Momo, desperate for any thirst quencher, quickly drank the \"${link_0}\". Immediately, Sokka started hallucinating, saying things like, \"Who lit Toph on fire?\" and \"How did we get out here in the middle of the ocean?\" Aang created a giant mushroom cloud out of frustration from not finding Appa. Katara and Sokka saw the giant mushroom cloud from a few miles away and Sokka said, \"It's a giant mushroom ... Maybe it's friendly!\" followed by waving his arms back and forth and saying, \"Friendly Mushroom. Mushy giant friend!\" At night, Toph accidentally discovered a sandbender's ${link_1}, and they used its compass to sail to a giant rock which happened to be the magnetic center of the desert. On the rock, they found strange tunnels that were actually ${link_2} hives. In the hives, Sokka claimed that his head has cleared out the cactus juice, only to eat some of the \"honey\" he found on the wall of the hive. They fought the buzzard wasps until the arrival of a ${link_3}. Toph recognized one of them as ${link_4}, and said he was going to muzzle him, prompting Aang to go into the Avatar State out of rage and grief and destroy all but one of the sailers.",
      "links": [
        {
          "body": "cactus juice",
          "key": "${link_0}",
          "target": {
            "href": "Cactus_juice",
            "page": "Cactus_juice"
          }
        },
        {
          "body": "sand-sailer",
          "key": "${link_1}",
          "target": {
            "href": "Sand-sailer",
            "page": "Sand-sailer"
          }
        },
        {
          "body": "buzzard wasps",
          "key": "${link_2}",
          "target": {
            "href": "Buzzard_wasp",
            "page": "Buzzard_wasp"
          }
        },
        {
          "body": "Sandbender Tribe",
          "key": "${link_3}",
          "target": {
            "href": "Sandbender_Tribes",
            "page": "Sandbender_Tribes"
          }
        },
        {
          "body": "the one who stole Appa",
          "key": "${link_4}",
          "target": {
            "href": "Ghashiun",
            "page": "Ghashiun"
          }
        }
      ],
      "text": "While traveling though the desert, the group ran low on water. Sokka found a cactus plant with a liquid trapped inside. He and Momo, desperate for any thirst quencher, quickly drank the \"cactus juice\". Immediately, Sokka started hallucinating, saying things like, \"Who lit Toph on fire?\" and \"How did we get out here in the middle of the ocean?\" Aang created a giant mushroom cloud out of frustration from not finding Appa. Katara and Sokka saw the giant mushroom cloud from a few miles away and Sokka said, \"It's a giant mushroom ... Maybe it's friendly!\" followed by waving his arms back and forth and saying, \"Friendly Mushroom. Mushy giant friend!\" At night, Toph accidentally discovered a sandbender's sand-sailer, and they used its compass to sail to a giant rock which happened to be the magnetic center of the desert. On the rock, they found strange tunnels that were actually buzzard wasps hives. In the hives, Sokka claimed that his head has cleared out the cactus juice, only to eat some of the \"honey\" he found on the wall of the hive. They fought the buzzard wasps until the arrival of a Sandbender Tribe. Toph recognized one of them as the one who stole Appa, and said he was going to muzzle him, prompting Aang to go into the Avatar State out of rage and grief and destroy all but one of the sailers."
    },
    {
      "body": "After the group escaped the desert, they met a refugee family traveling to Ba Sing Se. The group helped the family to an ${link_0} way that led to the city. While ${link_1}, Sokka was soon confronted by a security guard who seemed to know him frighteningly well. Sokka asked if they had met, and the guard replied by giving him a kiss on the cheek. Sokka quickly became excited and recognized the guard as the ${link_2}, ${link_3}, who was there helping war refugees. Later, the refugee family's documents were stolen, so Aang, Katara, Toph, Sokka and Suki agreed to help them cross the ${link_4}.",
      "links": [
        {
          "body": "underground ferry",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom_ferry",
            "page": "Earth_Kingdom_ferry"
          }
        },
        {
          "body": "there",
          "key": "${link_1}",
          "target": {
            "href": "Full_Moon_Bay",
            "page": "Full_Moon_Bay"
          }
        },
        {
          "body": "Kyoshi Warrior",
          "key": "${link_2}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Suki",
          "key": "${link_3}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Serpent's Pass",
          "key": "${link_4}",
          "target": {
            "href": "Serpent%27s_Pass",
            "page": "Serpent%27s_Pass"
          }
        }
      ],
      "text": "After the group escaped the desert, they met a refugee family traveling to Ba Sing Se. The group helped the family to an underground ferry way that led to the city. While there, Sokka was soon confronted by a security guard who seemed to know him frighteningly well. Sokka asked if they had met, and the guard replied by giving him a kiss on the cheek. Sokka quickly became excited and recognized the guard as the Kyoshi Warrior, Suki, who was there helping war refugees. Later, the refugee family's documents were stolen, so Aang, Katara, Toph, Sokka and Suki agreed to help them cross the Serpent's Pass."
    },
    {
      "body": "${link_0} reunited with ${link_1} at ${link_2}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Suki",
          "key": "${link_1}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Full Moon Bay",
          "key": "${link_2}",
          "target": {
            "href": "Full_Moon_Bay",
            "page": "Full_Moon_Bay"
          }
        }
      ],
      "text": "Sokka reunited with Suki at Full Moon Bay."
    },
    {
      "body": "As the group traveled along a sheer cliff side of the pass, Suki pointed out Fire Nation forces patrolling the water, telling them that they were rumored to be working on a secret project. As they continued, ${link_0} fell when the ground under him crumbled. Even though Toph saved him the falling rocks drew the attention of the patrol ship, which launched a fire ball at them. Aang leaped into action, knocking the ball back and striking their engines. The ship returned fire, hitting the rockface above them, and sending debris falling toward Suki. Sokka pushed Suki out of the way, and Toph saved him by deflecting the rocks. Sokka was too worried about Suki's safety to be thankful to Toph for saving his life, which annoyed Toph. The group ran to the shelter of an outcropping wall of rock, leaving the ship behind to tend to its damage.",
      "links": [
        {
          "body": "Than",
          "key": "${link_0}",
          "target": {
            "href": "Than",
            "page": "Than"
          }
        }
      ],
      "text": "As the group traveled along a sheer cliff side of the pass, Suki pointed out Fire Nation forces patrolling the water, telling them that they were rumored to be working on a secret project. As they continued, Than fell when the ground under him crumbled. Even though Toph saved him the falling rocks drew the attention of the patrol ship, which launched a fire ball at them. Aang leaped into action, knocking the ball back and striking their engines. The ship returned fire, hitting the rockface above them, and sending debris falling toward Suki. Sokka pushed Suki out of the way, and Toph saved him by deflecting the rocks. Sokka was too worried about Suki's safety to be thankful to Toph for saving his life, which annoyed Toph. The group ran to the shelter of an outcropping wall of rock, leaving the ship behind to tend to its damage."
    },
    {
      "body": "That night, Sokka was becoming overprotective of Suki, insisting that she should not sleep so close to the edge of the cliff in case it collapses into the water below. After he moved her sleeping mat, he screamed and pushed her away from her mat. She inquired what was wrong; Sokka was calm and told her that he thought he saw a spider. Suki found Sokka staring at the moon. He explained that he was being so overprotective because it was hard to lose someone you care about. Then Sokka told her that he learned this at the North Pole when he lost someone he was supposed to protect, referring to Yue his first love interest and therefore he did not want that to happen again. Suki told Sokka about someone she cared for and lost as well, although he only went away. Sokka started to get jealous, not realizing that she was talking about him. Suki moved in to kiss him, but Sokka, feeling guilty to kiss her in front of the moon implying Yue's presence, turned away. After they had managed to cross the Serpent's Pass, the woman from the family which they were travelling with gave birth to a girl who was named ${link_0}. The group later prepared to move on to Ba Sing Se, and in the meantime Suki got ready to return to her comrades, telling Sokka that she went with him to make sure that he got through safely. She tried to apologize to Sokka for coming on to him the night before, but he silenced her with a kiss.",
      "links": [
        {
          "body": "Hope",
          "key": "${link_0}",
          "target": {
            "href": "Hope",
            "page": "Hope"
          }
        }
      ],
      "text": "That night, Sokka was becoming overprotective of Suki, insisting that she should not sleep so close to the edge of the cliff in case it collapses into the water below. After he moved her sleeping mat, he screamed and pushed her away from her mat. She inquired what was wrong; Sokka was calm and told her that he thought he saw a spider. Suki found Sokka staring at the moon. He explained that he was being so overprotective because it was hard to lose someone you care about. Then Sokka told her that he learned this at the North Pole when he lost someone he was supposed to protect, referring to Yue his first love interest and therefore he did not want that to happen again. Suki told Sokka about someone she cared for and lost as well, although he only went away. Sokka started to get jealous, not realizing that she was talking about him. Suki moved in to kiss him, but Sokka, feeling guilty to kiss her in front of the moon implying Yue's presence, turned away. After they had managed to cross the Serpent's Pass, the woman from the family which they were travelling with gave birth to a girl who was named Hope. The group later prepared to move on to Ba Sing Se, and in the meantime Suki got ready to return to her comrades, telling Sokka that she went with him to make sure that he got through safely. She tried to apologize to Sokka for coming on to him the night before, but he silenced her with a kiss."
    },
    {
      "body": "When the group came to Ba Sing Se and saw the giant ${link_0} trying to break through the wall of the city, they turned to Sokka for ideas, but at the time he had none. However Katara, after several earthbenders lost a fight to Ty Lee, discovered it was her who defeated them, and claimed it was like she \"took you down from the inside,\" which now gave Sokka an idea to infiltrate the machine and destroy it from the inside, by hitting its pressure points. With Katara and Toph plugging up the slurry, and Aang giving the final blow, the drill was destroyed.",
      "links": [
        {
          "body": "drill",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        }
      ],
      "text": "When the group came to Ba Sing Se and saw the giant drill trying to break through the wall of the city, they turned to Sokka for ideas, but at the time he had none. However Katara, after several earthbenders lost a fight to Ty Lee, discovered it was her who defeated them, and claimed it was like she \"took you down from the inside,\" which now gave Sokka an idea to infiltrate the machine and destroy it from the inside, by hitting its pressure points. With Katara and Toph plugging up the slurry, and Aang giving the final blow, the drill was destroyed."
    },
    {
      "body": "Riding the Ba Sing Se ${link_0}, the group finally entered Ba Sing Se. Sokka was confident that they would easily find Appa, but the city was much bigger than they had imagined. Soon after they arrived, Aang and his friends were met by ${link_1}; a cheerful, incessantly smiling woman assigned to guide them around the city. Attempts by Sokka to try and get their guide to talk about the war and a possible audience with the ${link_2} were invariably ignored.",
      "links": [
        {
          "body": "Monorail",
          "key": "${link_0}",
          "target": {
            "href": "Monorail",
            "page": "Monorail"
          }
        },
        {
          "body": "Joo Dee",
          "key": "${link_1}",
          "target": {
            "href": "Joo_Dee",
            "page": "Joo_Dee"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_2}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "Riding the Ba Sing Se Monorail, the group finally entered Ba Sing Se. Sokka was confident that they would easily find Appa, but the city was much bigger than they had imagined. Soon after they arrived, Aang and his friends were met by Joo Dee; a cheerful, incessantly smiling woman assigned to guide them around the city. Attempts by Sokka to try and get their guide to talk about the war and a possible audience with the Earth King were invariably ignored."
    },
    {
      "body": "${link_0} and ${link_1} posed as servants to infiltrate the party.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Sokka and Aang posed as servants to infiltrate the party."
    },
    {
      "body": "Katara made a plan to sneak with Toph into a party to meet the Earth King. Aang and Sokka eventually arrived (after Katara and Toph) at the palace and managed to get in through the side entrance disguised as servants. Aang was soon exposed as the Avatar, but he quickly smoothed things over with a display of his abilities to entertain the audience, until the Earth King himself arrived. Sokka was captured and dragged away by ${link_0} guards as the Dai Li bound and gagged Katara and Toph with earthbending. Inside ${link_1}'s chamber, Sokka tried to talk about the coming solar eclipse, but was abruptly cut off by Feng. To preserve the culture and utopian life within the walls of Ba Sing Se, Feng explained, no mention of the war was permitted. It was also revealed that Feng was in charge of handling day-to-day affairs in the city, including all military matters.",
      "links": [
        {
          "body": "Dai Li",
          "key": "${link_0}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_1}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        }
      ],
      "text": "Katara made a plan to sneak with Toph into a party to meet the Earth King. Aang and Sokka eventually arrived (after Katara and Toph) at the palace and managed to get in through the side entrance disguised as servants. Aang was soon exposed as the Avatar, but he quickly smoothed things over with a display of his abilities to entertain the audience, until the Earth King himself arrived. Sokka was captured and dragged away by Dai Li guards as the Dai Li bound and gagged Katara and Toph with earthbending. Inside Long Feng's chamber, Sokka tried to talk about the coming solar eclipse, but was abruptly cut off by Feng. To preserve the culture and utopian life within the walls of Ba Sing Se, Feng explained, no mention of the war was permitted. It was also revealed that Feng was in charge of handling day-to-day affairs in the city, including all military matters."
    },
    {
      "body": "In the peaceful city, Sokka was outside his element of war and battle. His boomerang had become a toy as he walked through the city. Sokka found a ${link_0} full of pretty girls. While peeking through the window, enjoying the 'show', he was shoved from behind by an ostrich horse and winds up inside. While explaining the accident to the girls, he accidentally rhymed in haiku. The ${link_1} became upset with the intrusion and disruption of the class. She was also severely annoyed by the unsophisticated meaning his haiku messages entailed and thus educated Sokka in the art of poetry by addressing him with a formal haiku. Sokka soon got into a contest with the teacher, (which seemed to parody a rap battle) both of whom spoke only in haiku.",
      "links": [
        {
          "body": "haiku class",
          "key": "${link_0}",
          "target": {
            "href": "Five-Seven-Five_Society",
            "page": "Five-Seven-Five_Society"
          }
        },
        {
          "body": "instructor",
          "key": "${link_1}",
          "target": {
            "href": "Macmu-Ling",
            "page": "Macmu-Ling"
          }
        }
      ],
      "text": "In the peaceful city, Sokka was outside his element of war and battle. His boomerang had become a toy as he walked through the city. Sokka found a haiku class full of pretty girls. While peeking through the window, enjoying the 'show', he was shoved from behind by an ostrich horse and winds up inside. While explaining the accident to the girls, he accidentally rhymed in haiku. The instructor became upset with the intrusion and disruption of the class. She was also severely annoyed by the unsophisticated meaning his haiku messages entailed and thus educated Sokka in the art of poetry by addressing him with a formal haiku. Sokka soon got into a contest with the teacher, (which seemed to parody a rap battle) both of whom spoke only in haiku."
    },
    {
      "body": "After each of Sokka's, the girls in the class broke into giggling. After several bouts, with Sokka comically winning each one, he eventually messed up and added an extra syllable to the final line, causing the class to become silent and hard faced. After counting the syllables and realizing his grave error, Sokka was ejected from the room by a very large guard into the street. Sokka changed his mind about liking poetry in the end.",
      "links": [],
      "text": "After each of Sokka's, the girls in the class broke into giggling. After several bouts, with Sokka comically winning each one, he eventually messed up and added an extra syllable to the final line, causing the class to become silent and hard faced. After counting the syllables and realizing his grave error, Sokka was ejected from the room by a very large guard into the street. Sokka changed his mind about liking poetry in the end."
    },
    {
      "body": "At Team Avatar's house, Sokka was attempting to draw pictures of Appa, but Aang and Katara bursted in with a stack of professionally-made posters they had a printer make featuring much better pictures of the lost bison than Sokka's crude drawings. The group planned on spreading the fliers all over the city, hoping someone will have some information.",
      "links": [],
      "text": "At Team Avatar's house, Sokka was attempting to draw pictures of Appa, but Aang and Katara bursted in with a stack of professionally-made posters they had a printer make featuring much better pictures of the lost bison than Sokka's crude drawings. The group planned on spreading the fliers all over the city, hoping someone will have some information."
    },
    {
      "body": "Out in the city, the gang was setting up more posters when Katara ran into ${link_0}. He told her that he wanted to help, but Katara distrusted him and attacked. Jet deflected her attacks and tried to prove his honesty by dropping his ${link_1}. The others arrived, drawn by the noise, and Jet tried again to explain himself, showing them a flier. Toph, reading Jet's heartbeat and breathing patterns, pronounced that he was telling the truth.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        },
        {
          "body": "hook swords",
          "key": "${link_1}",
          "target": {
            "href": "Hook_swords",
            "page": "Hook_swords"
          }
        }
      ],
      "text": "Out in the city, the gang was setting up more posters when Katara ran into Jet. He told her that he wanted to help, but Katara distrusted him and attacked. Jet deflected her attacks and tried to prove his honesty by dropping his hook swords. The others arrived, drawn by the noise, and Jet tried again to explain himself, showing them a flier. Toph, reading Jet's heartbeat and breathing patterns, pronounced that he was telling the truth."
    },
    {
      "body": "On their way out, the group was sidetracked when ${link_0} and ${link_1} happened to come across them. Katara once again turned on Jet, as he had claimed to have left his ${link_2} behind. Jet insisted that he had been living alone in the city, but Smellerbee claimed that he was dragged away by the Dai Li. Toph realized they were both telling the truth, even though their stories did not match. Sokka quickly figured that Jet had been ${link_3} by the Dai Li.",
      "links": [
        {
          "body": "Smellerbee",
          "key": "${link_0}",
          "target": {
            "href": "Smellerbee",
            "page": "Smellerbee"
          }
        },
        {
          "body": "Longshot",
          "key": "${link_1}",
          "target": {
            "href": "Longshot",
            "page": "Longshot"
          }
        },
        {
          "body": "gang",
          "key": "${link_2}",
          "target": {
            "href": "Freedom_Fighters",
            "page": "Freedom_Fighters"
          }
        },
        {
          "body": "brainwashed",
          "key": "${link_3}",
          "target": {
            "href": "Brainwashing",
            "page": "Brainwashing"
          }
        }
      ],
      "text": "On their way out, the group was sidetracked when Smellerbee and Longshot happened to come across them. Katara once again turned on Jet, as he had claimed to have left his gang behind. Jet insisted that he had been living alone in the city, but Smellerbee claimed that he was dragged away by the Dai Li. Toph realized they were both telling the truth, even though their stories did not match. Sokka quickly figured that Jet had been brainwashed by the Dai Li."
    },
    {
      "body": "${link_0} fought against the ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_1}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "Sokka fought against the Dai Li."
    },
    {
      "body": "The group made their way to ${link_0} the next day, and Toph quickly found and uncovered the underwater entrance. The gang found themselves confronted by Long Feng and several Dai Li agents. A battle quickly broke out. Jet hurled one of his hook swords at Long Feng, who dodged and retaliates with earthbending. After dealing a grievous blow to Jet, Long Feng escaped as the others entered the chamber. Katara tried to heal Jet, and realized just how badly he was injured. Longshot, speaking for the first time in the series, told Aang and his group that they should go and find Appa and leave Jet to Smellerbee and himself. Jet tried to assure Katara that he would be fine, but as they left, Toph sorrowfully said that Jet was lying.",
      "links": [
        {
          "body": "Lake Laogai",
          "key": "${link_0}",
          "target": {
            "href": "Lake_Laogai",
            "page": "Lake_Laogai"
          }
        }
      ],
      "text": "The group made their way to Lake Laogai the next day, and Toph quickly found and uncovered the underwater entrance. The gang found themselves confronted by Long Feng and several Dai Li agents. A battle quickly broke out. Jet hurled one of his hook swords at Long Feng, who dodged and retaliates with earthbending. After dealing a grievous blow to Jet, Long Feng escaped as the others entered the chamber. Katara tried to heal Jet, and realized just how badly he was injured. Longshot, speaking for the first time in the series, told Aang and his group that they should go and find Appa and leave Jet to Smellerbee and himself. Jet tried to assure Katara that he would be fine, but as they left, Toph sorrowfully said that Jet was lying."
    },
    {
      "body": "The group rushed back to the surface and was reunited with Appa. Less than an hour after the reunion with Appa, Sokka and his friends were on a small island recovering and discussing what they should do. Katara and Toph both wanted to leave Ba Sing Se, as they had found Appa and thus had no reason to remain there. On the other hand, Sokka wanted to stay to inform the Earth King of all that was taking place within Ba Sing Se, as well as the approaching solar eclipse, as this was their entire reason for heading to Ba Sing Se in the first place, and Aang agreed with him. Ultimately, the others agreed to do so, and all four rode Appa back to Ba Sing Se's ${link_0}, and managed to break into the ${link_1}, tearing their way through the ${link_2} despite their strong defenses.",
      "links": [
        {
          "body": "Upper Ring",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se#Upper_Ring",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "palace",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        },
        {
          "body": "Royal Guards",
          "key": "${link_2}",
          "target": {
            "href": "Royal_Earthbender_Guards",
            "page": "Royal_Earthbender_Guards"
          }
        }
      ],
      "text": "The group rushed back to the surface and was reunited with Appa. Less than an hour after the reunion with Appa, Sokka and his friends were on a small island recovering and discussing what they should do. Katara and Toph both wanted to leave Ba Sing Se, as they had found Appa and thus had no reason to remain there. On the other hand, Sokka wanted to stay to inform the Earth King of all that was taking place within Ba Sing Se, as well as the approaching solar eclipse, as this was their entire reason for heading to Ba Sing Se in the first place, and Aang agreed with him. Ultimately, the others agreed to do so, and all four rode Appa back to Ba Sing Se's Upper Ring, and managed to break into the palace, tearing their way through the Royal Guards despite their strong defenses."
    },
    {
      "body": "In the palace, Aang and his friends finally reached the Earth King's throne room. Aang went on to explain the various events going on that the Earth King was unaware of: a war outside Ba Sing Se's walls, Long Feng and the Dai Li's ${link_0}, the imprisonment of Appa, and the brainwashing of Jet and countless other individuals. The Earth King arrived at the Outer Wall and was shocked to see the remains of the ${link_1} leading right up to and through Ba Sing Se's Outer Wall. The Earth King ordered the Dai Li to arrest Long Feng. The two Dai Li agents accompanying Long Feng shared a conspiratorial glance and binded Long Feng's arms with metal manacles. When they returned to the palace, the king also agreed, after some persuasion, to support Sokka's plan to invade the Fire Nation on the day of the solar eclipse (dubbed by Sokka \"The Day of Black Sun\"), when the Fire Nation would be helpless.",
      "links": [
        {
          "body": "conspiracy",
          "key": "${link_0}",
          "target": {
            "href": "Conspiracy_of_Ba_Sing_Se",
            "page": "Conspiracy_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Fire Nation's drill",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        }
      ],
      "text": "In the palace, Aang and his friends finally reached the Earth King's throne room. Aang went on to explain the various events going on that the Earth King was unaware of: a war outside Ba Sing Se's walls, Long Feng and the Dai Li's conspiracy, the imprisonment of Appa, and the brainwashing of Jet and countless other individuals. The Earth King arrived at the Outer Wall and was shocked to see the remains of the Fire Nation's drill leading right up to and through Ba Sing Se's Outer Wall. The Earth King ordered the Dai Li to arrest Long Feng. The two Dai Li agents accompanying Long Feng shared a conspiratorial glance and binded Long Feng's arms with metal manacles. When they returned to the palace, the king also agreed, after some persuasion, to support Sokka's plan to invade the Fire Nation on the day of the solar eclipse (dubbed by Sokka \"The Day of Black Sun\"), when the Fire Nation would be helpless."
    },
    {
      "body": "${link_0} reunited with ${link_1} at ${link_2}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "his father",
          "key": "${link_1}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Chameleon Bay",
          "key": "${link_2}",
          "target": {
            "href": "Chameleon_Bay",
            "page": "Chameleon_Bay"
          }
        }
      ],
      "text": "Sokka reunited with his father at Chameleon Bay."
    },
    {
      "body": "The Earth King's top generals, the ${link_0}, raided Long Feng's office and discovered files about every person in Ba Sing Se. They found an intelligence report giving the location of Water Tribe warriors led by Hakoda, Sokka and Katara's father.",
      "links": [
        {
          "body": "Council of Five",
          "key": "${link_0}",
          "target": {
            "href": "Council_of_Five",
            "page": "Council_of_Five"
          }
        }
      ],
      "text": "The Earth King's top generals, the Council of Five, raided Long Feng's office and discovered files about every person in Ba Sing Se. They found an intelligence report giving the location of Water Tribe warriors led by Hakoda, Sokka and Katara's father."
    },
    {
      "body": "When Aang was trying to confess his feelings to Katara, Sokka interrupted, asking Aang if he was ready for their \"men only man-trip\". Aang and Sokka their made their way over the plains surrounding Ba Sing Se on Appa, convinced that things were finally going positively for them. Aang and Sokka landed at the mouth of ${link_0}, where they were told that Sokka's father Hakoda and the rest of the ${link_1} warriors were. Sokka was very nervous, but Aang tried to calm him down, and succeeded somewhat. Sokka questioned Aang on his feelings toward him meeting Guru Pathik to master the Avatar State. Aang smiled, and replied that he, unlike Sokka, was not nervous in the least. He took off on Appa, shouting back to Sokka that they will reunite in a week.",
      "links": [
        {
          "body": "Chameleon Bay",
          "key": "${link_0}",
          "target": {
            "href": "Chameleon_Bay",
            "page": "Chameleon_Bay"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "When Aang was trying to confess his feelings to Katara, Sokka interrupted, asking Aang if he was ready for their \"men only man-trip\". Aang and Sokka their made their way over the plains surrounding Ba Sing Se on Appa, convinced that things were finally going positively for them. Aang and Sokka landed at the mouth of Chameleon Bay, where they were told that Sokka's father Hakoda and the rest of the Southern Water Tribe warriors were. Sokka was very nervous, but Aang tried to calm him down, and succeeded somewhat. Sokka questioned Aang on his feelings toward him meeting Guru Pathik to master the Avatar State. Aang smiled, and replied that he, unlike Sokka, was not nervous in the least. He took off on Appa, shouting back to Sokka that they will reunite in a week."
    },
    {
      "body": "Sokka walked into the base and was greeted with a warm welcome and open arms by the warriors of the Southern Water Tribe. After a very brief exchange of greetings, the warriors pointed him to a large tent on one end of the camp. Sokka entered the tent, where several more warriors, including Bato and his father, Hakoda, were studying a map. Bato looked up and nudged Hakoda. Hakoda looked up from the map and he and Sokka embraced happily.",
      "links": [],
      "text": "Sokka walked into the base and was greeted with a warm welcome and open arms by the warriors of the Southern Water Tribe. After a very brief exchange of greetings, the warriors pointed him to a large tent on one end of the camp. Sokka entered the tent, where several more warriors, including Bato and his father, Hakoda, were studying a map. Bato looked up and nudged Hakoda. Hakoda looked up from the map and he and Sokka embraced happily."
    },
    {
      "body": "Sokka, Hakoda, and the rest of the warriors were preparing what Hakoda called ${link_0}. Comprised of a buoyant casing around an explosive mine, they were filled with skunk fish and seaweed. Upon detonation, the seaweed entangled itself in propellers of Fire Nation ships, immobilizing them. Afterward, the stench of the skunk fish forced the soldiers on board to abandon ship. Hakoda joked that he had dubbed the plan, \"The Stink and Sink\", which made Sokka explode with laughter. Bato remarked dryly on how similar the father and son were.",
      "links": [
        {
          "body": "tangle mines",
          "key": "${link_0}",
          "target": {
            "href": "Tangle_mine",
            "page": "Tangle_mine"
          }
        }
      ],
      "text": "Sokka, Hakoda, and the rest of the warriors were preparing what Hakoda called tangle mines. Comprised of a buoyant casing around an explosive mine, they were filled with skunk fish and seaweed. Upon detonation, the seaweed entangled itself in propellers of Fire Nation ships, immobilizing them. Afterward, the stench of the skunk fish forced the soldiers on board to abandon ship. Hakoda joked that he had dubbed the plan, \"The Stink and Sink\", which made Sokka explode with laughter. Bato remarked dryly on how similar the father and son were."
    },
    {
      "body": "A scouting party returned, informing the warriors of the presence of four Fire Nation ships. Hakoda quickly acted, telling Bato to finish preparing the mines and the rest of the warriors to prepare for battle. Sokka hesitated as the other warriors prepared for battle, and asked Hakoda what he should do. In a slightly irritated, yet joking tone, Hakoda repeated pointedly that he wanted the rest of the men to get ready for battle. Sokka smiled at his father's confirmation of his coming-of-age and quickly prepared himself for the encounter ahead.",
      "links": [],
      "text": "A scouting party returned, informing the warriors of the presence of four Fire Nation ships. Hakoda quickly acted, telling Bato to finish preparing the mines and the rest of the warriors to prepare for battle. Sokka hesitated as the other warriors prepared for battle, and asked Hakoda what he should do. In a slightly irritated, yet joking tone, Hakoda repeated pointedly that he wanted the rest of the men to get ready for battle. Sokka smiled at his father's confirmation of his coming-of-age and quickly prepared himself for the encounter ahead."
    },
    {
      "body": "Sokka and the rest of Hakoda's warriors were finishing preparing their ships to move on. Sokka told his father that he was going to make him proud and prove what a great warrior he was. Hakoda smiled and replied that Sokka did not have to prove himself - he had always known Sokka had been a great warrior. This heartfelt moment was cut short by the sudden appearance of Aang and Appa. Sokka only had to look at Aang for him to realize that the situation was urgent and bade farewell to his father.",
      "links": [],
      "text": "Sokka and the rest of Hakoda's warriors were finishing preparing their ships to move on. Sokka told his father that he was going to make him proud and prove what a great warrior he was. Hakoda smiled and replied that Sokka did not have to prove himself - he had always known Sokka had been a great warrior. This heartfelt moment was cut short by the sudden appearance of Aang and Appa. Sokka only had to look at Aang for him to realize that the situation was urgent and bade farewell to his father."
    },
    {
      "body": "${link_0} was confronted by ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_1}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "text": "Sokka was confronted by Ty Lee."
    },
    {
      "body": "Sokka and Aang hurried back to Ba Sing Se on Appa; as they flew along, they spotted Toph who was trying to get back to the palace as quickly as she could. They picked her up and flew to Ba Sing Se, trying to get there quickly to see if Katara was all right. When asked if he had mastered the Avatar State, Aang lied to the others, saying that he had.",
      "links": [],
      "text": "Sokka and Aang hurried back to Ba Sing Se on Appa; as they flew along, they spotted Toph who was trying to get back to the palace as quickly as she could. They picked her up and flew to Ba Sing Se, trying to get there quickly to see if Katara was all right. When asked if he had mastered the Avatar State, Aang lied to the others, saying that he had."
    },
    {
      "body": "Outside the palace, the gang discovered that there was indeed a huge underground city and decided that Toph and Sokka should go to warn the Earth King about the coup they had just found out about, while Iroh and Aang rescue Katara and Zuko. Sokka and Toph soon saw General ${link_0}, but before they could say anything, the Dai Li placed him under house arrest. At that very moment, every general was arrested. The two made it into the throne room and they revealed to the Earth King that the girls were not Kyoshi Warriors. Upon seeking Sokka, Ty Lee started to flirt with him, but he said that he was involved with Suki. Ty Lee did not know who Suki was, which exposed them, and Toph threw her to the side with earthbending. Mai, realizing that their identities were exposed, threw a hail of ornate shurikens at Toph, who blocked them with a wall of earth. Ty Lee began to \"fight\" Sokka. However, the fighting was in vain, as Azula soon had the king at flamepoint. Sokka and Toph gave up immediately and were soon disabled by Ty Lee. They were imprisoned by Dai Li agents, but were later able to escape with Toph using her metalbending skills to free them from their prison cell.",
      "links": [
        {
          "body": "How",
          "key": "${link_0}",
          "target": {
            "href": "How",
            "page": "How"
          }
        }
      ],
      "text": "Outside the palace, the gang discovered that there was indeed a huge underground city and decided that Toph and Sokka should go to warn the Earth King about the coup they had just found out about, while Iroh and Aang rescue Katara and Zuko. Sokka and Toph soon saw General How, but before they could say anything, the Dai Li placed him under house arrest. At that very moment, every general was arrested. The two made it into the throne room and they revealed to the Earth King that the girls were not Kyoshi Warriors. Upon seeking Sokka, Ty Lee started to flirt with him, but he said that he was involved with Suki. Ty Lee did not know who Suki was, which exposed them, and Toph threw her to the side with earthbending. Mai, realizing that their identities were exposed, threw a hail of ornate shurikens at Toph, who blocked them with a wall of earth. Ty Lee began to \"fight\" Sokka. However, the fighting was in vain, as Azula soon had the king at flamepoint. Sokka and Toph gave up immediately and were soon disabled by Ty Lee. They were imprisoned by Dai Li agents, but were later able to escape with Toph using her metalbending skills to free them from their prison cell."
    },
    {
      "body": "Back in the palace, Ty Lee was trying to teach ${link_0} the bear how to walk on his front legs, but she was trapped by Toph. Toph and Sokka took a fighting stance against Mai, who in her nonchalance said to take the bear, and the king reunited happily with his pet. The three later reunited with Katara and Aang, after Aang was struck with lightning by Azula during a battle in the ${link_1} of Old Ba Sing Se. As the Earth King, Bosco, Momo, Toph, Sokka, Katara, and Aang flew atop Appa's back over the Outer Wall and out of the city, the Earth King looked back and sadly proclaimed, \"The Earth Kingdom ... has fallen.\"",
      "links": [
        {
          "body": "Bosco",
          "key": "${link_0}",
          "target": {
            "href": "Bosco",
            "page": "Bosco"
          }
        },
        {
          "body": "Crystal Catacombs",
          "key": "${link_1}",
          "target": {
            "href": "Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        }
      ],
      "text": "Back in the palace, Ty Lee was trying to teach Bosco the bear how to walk on his front legs, but she was trapped by Toph. Toph and Sokka took a fighting stance against Mai, who in her nonchalance said to take the bear, and the king reunited happily with his pet. The three later reunited with Katara and Aang, after Aang was struck with lightning by Azula during a battle in the Crystal Catacombs of Old Ba Sing Se. As the Earth King, Bosco, Momo, Toph, Sokka, Katara, and Aang flew atop Appa's back over the Outer Wall and out of the city, the Earth King looked back and sadly proclaimed, \"The Earth Kingdom ... has fallen.\""
    },
    {
      "body": "Shortly after the ${link_0} of ${link_1}, ${link_2} was situated at the ${link_3} ${link_4}' camp at ${link_5}. ${link_6} was chatting with ${link_7} when he decided to head off to sleep. There, he discovered ${link_8} in his tent, to his dismay. The exiled ${link_9} ${link_10}, when demanded an explanation, said that the bear was not used to sleeping without a roof over his head. As a result, to Sokka's ire, he had to share the tent with Bosco.",
      "links": [
        {
          "body": "fall",
          "key": "${link_0}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_3}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "warriors",
          "key": "${link_4}",
          "target": {
            "href": "Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        },
        {
          "body": "Chameleon Bay",
          "key": "${link_5}",
          "target": {
            "href": "Chameleon_Bay",
            "page": "Chameleon_Bay"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_6}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Toph",
          "key": "${link_7}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Bosco",
          "key": "${link_8}",
          "target": {
            "href": "Bosco",
            "page": "Bosco"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_9}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Kuei",
          "key": "${link_10}",
          "target": {
            "href": "Kuei",
            "page": "Kuei"
          }
        }
      ],
      "text": "Shortly after the fall of Ba Sing Se, Team Avatar was situated at the Southern Water Tribe warriors' camp at Chameleon Bay. Sokka was chatting with Toph when he decided to head off to sleep. There, he discovered Bosco in his tent, to his dismay. The exiled Earth King Kuei, when demanded an explanation, said that the bear was not used to sleeping without a roof over his head. As a result, to Sokka's ire, he had to share the tent with Bosco."
    },
    {
      "body": "After a day of unsuccessful training, Sokka proclaimed that Bosco would never learn how to live in the wild. Kuei said that he realized that there was a lot in the world he and Bosco did not know about the real world. Kuei decided he would experience the world as a humble man, as he and Bosco tear off their royal clothing, Kuei revealing causal clothes underneath, and the two ride away. Sokka watched the two escape with a look of shock. He proceeded to put on Kuei's crown and asked Toph if \"King Sokka\" sounded good, to which Toph replied that she was not calling him that.",
      "links": [],
      "text": "After a day of unsuccessful training, Sokka proclaimed that Bosco would never learn how to live in the wild. Kuei said that he realized that there was a lot in the world he and Bosco did not know about the real world. Kuei decided he would experience the world as a humble man, as he and Bosco tear off their royal clothing, Kuei revealing causal clothes underneath, and the two ride away. Sokka watched the two escape with a look of shock. He proceeded to put on Kuei's crown and asked Toph if \"King Sokka\" sounded good, to which Toph replied that she was not calling him that."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Sokka_(Spring_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Sokka_(Spring_100_AG).html",
    "page": "History_of_Sokka_(Spring_100_AG)",
    "title": "History of Sokka (Spring 100 AG)"
  }
}