{
  "categories": [
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "With a shift in the world's energy due to ${link_0}, ${link_1} and ${link_2} set out to scour the ${link_3} in search for the new ${link_4} to offer training and guidance. However, while the ${link_5} is slowly being rebuilt, Bolin meets his paternal family for the first time and is faced with a new danger when ${link_6} and his fellow ${link_7} accomplices escape their respective prisons and set out to bring ${link_8} down and succumb the ${link_9} into anarchy. Since they pose a lethal threat to Korra, Bolin sets out to assist Korra in the fight to save not only the balance of the nations in the world, but also herself and the ${link_10} Cycle.",
      "links": [
        {
          "body": "Harmonic Convergence",
          "key": "${link_0}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "his friends",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_3}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_4}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Air Nation",
          "key": "${link_5}",
          "target": {
            "href": "Air_Nomads#Rebirth_of_a_nation",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_6}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_7}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "all the nations",
          "key": "${link_8}",
          "target": {
            "href": "Four_nations",
            "page": "Four_nations"
          }
        },
        {
          "body": "world",
          "key": "${link_9}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_10}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "With a shift in the world's energy due to Harmonic Convergence, Bolin and his friends set out to scour the Earth Kingdom in search for the new airbenders to offer training and guidance. However, while the Air Nation is slowly being rebuilt, Bolin meets his paternal family for the first time and is faced with a new danger when Zaheer and his fellow Red Lotus accomplices escape their respective prisons and set out to bring all the nations down and succumb the world into anarchy. Since they pose a lethal threat to Korra, Bolin sets out to assist Korra in the fight to save not only the balance of the nations in the world, but also herself and the Avatar Cycle."
    },
    {
      "body": "Shortly after Harmonic Convergence, Bolin rejoined the ${link_0} and took part in a charity championship organized to help rebuild ${link_1} following the damages caused by the ${link_2}. At the start of one match, Bolin insinuated that ${link_3} had been out of practice, to which Mako stated that he had been out fighting crime as a cop, while Bolin was \"fake-waterbending\" as Nuktuk. As the brothers were busy teasing each other, they were quickly knocked out of the ring once the match had officially begun, leaving ${link_4} to win the match by herself.",
      "links": [
        {
          "body": "Fire Ferrets",
          "key": "${link_0}",
          "target": {
            "href": "Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Unalaq Crisis",
          "key": "${link_2}",
          "target": {
            "href": "Unalaq_Crisis",
            "page": "Unalaq_Crisis"
          }
        },
        {
          "body": "Mako",
          "key": "${link_3}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Korra",
          "key": "${link_4}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Shortly after Harmonic Convergence, Bolin rejoined the Fire Ferrets and took part in a charity championship organized to help rebuild Republic City following the damages caused by the Unalaq Crisis. At the start of one match, Bolin insinuated that Mako had been out of practice, to which Mako stated that he had been out fighting crime as a cop, while Bolin was \"fake-waterbending\" as Nuktuk. As the brothers were busy teasing each other, they were quickly knocked out of the ring once the match had officially begun, leaving Korra to win the match by herself."
    },
    {
      "body": "One week later, the Ferrets were up against the ${link_0} in the final match of the championship. During the match, Bolin and Mako cheerfully greeted Korra, as they had not seen her since the end of the last match. They continued to tell Korra what she had missed while she was away, though the Avatar was more concerned with preventing the brothers from being knocked out again. Bolin jokingly asked if the reason Korra broke up with Mako was due to him being the weakest member of the team, inadvertently making his brother feel uncomfortable. Shortly thereafter, they were able to beat the Wolfbats and win the charity championship.",
      "links": [
        {
          "body": "White Falls Wolfbats",
          "key": "${link_0}",
          "target": {
            "href": "White_Falls_Wolfbats",
            "page": "White_Falls_Wolfbats"
          }
        }
      ],
      "text": "One week later, the Ferrets were up against the White Falls Wolfbats in the final match of the championship. During the match, Bolin and Mako cheerfully greeted Korra, as they had not seen her since the end of the last match. They continued to tell Korra what she had missed while she was away, though the Avatar was more concerned with preventing the brothers from being knocked out again. Bolin jokingly asked if the reason Korra broke up with Mako was due to him being the weakest member of the team, inadvertently making his brother feel uncomfortable. Shortly thereafter, they were able to beat the Wolfbats and win the charity championship."
    },
    {
      "body": "The ${link_0}'s rampage on Republic City left ${link_1} covered in ${link_2}. As a result, ${link_3} invited the brothers to live on ${link_4}, but only the ${link_5} accepted, as Mako chose to stay at the ${link_6}.",
      "links": [
        {
          "body": "Dark Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Dark_Avatar",
            "page": "Dark_Avatar"
          }
        },
        {
          "body": "Mako and Bolin's apartment",
          "key": "${link_1}",
          "target": {
            "href": "Mako_and_Bolin%27s_apartment",
            "page": "Mako_and_Bolin%27s_apartment"
          }
        },
        {
          "body": "vines",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_3}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Air Temple Island",
          "key": "${link_4}",
          "target": {
            "href": "Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "earthbender",
          "key": "${link_5}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "police station",
          "key": "${link_6}",
          "target": {
            "href": "Police_headquarters",
            "page": "Police_headquarters"
          }
        }
      ],
      "text": "The Dark Avatar's rampage on Republic City left Mako and Bolin's apartment covered in vines. As a result, Tenzin invited the brothers to live on Air Temple Island, but only the earthbender accepted, as Mako chose to stay at the police station."
    },
    {
      "body": "${link_0} impersonated ${link_1} and explained to ${link_2} his decision to live in the ${link_3} in order to \"focus on [his] work\".",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "police headquarters",
          "key": "${link_3}",
          "target": {
            "href": "Police_headquarters",
            "page": "Police_headquarters"
          }
        }
      ],
      "text": "Bolin impersonated Mako and explained to Korra his decision to live in the police headquarters in order to \"focus on [his] work\"."
    },
    {
      "body": "One night, at dinner with Korra and Tenzin's family, Bolin informed Korra and ${link_0} of Mako's decision and ${link_1}'s claims of being able to ${link_2}. As Bumi had only airbent previously when he was in danger, he requested that Bolin bend a boulder at him, but he thought this to not be a good idea. When the retired commander did airbend, Bolin, like everyone else, was left in shock. The next day, he watched as Bumi again tried to airbend, but to no avail.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "href": "Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "airbend",
          "key": "${link_2}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "One night, at dinner with Korra and Tenzin's family, Bolin informed Korra and Asami of Mako's decision and Bumi's claims of being able to airbend. As Bumi had only airbent previously when he was in danger, he requested that Bolin bend a boulder at him, but he thought this to not be a good idea. When the retired commander did airbend, Bolin, like everyone else, was left in shock. The next day, he watched as Bumi again tried to airbend, but to no avail."
    },
    {
      "body": "Bolin and ${link_0} later watched as Korra attempted to clear away the vines with ${link_1}. When the vines regenerated, the two earthbenders raised a large slab of rock to keep a building from collapsing. After Korra eased the situation, Bolin remarked that it could have gone better. That evening, he interrupted Tenzin and Korra's talk about her decision to leave the ${link_2} open to alert the two that Mako called, saying a newly-found airbender had run to the top of ${link_3} and would not come down. He also apologized for interrupting the \"${link_4} wisdom\" session, though Korra called it a thing of the past, and the three ventured to the bridge on ${link_5}. Bolin witnessed the Avatar calm ${link_6} down and save him after he slipped.",
      "links": [
        {
          "body": "Lin Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "spiritbending",
          "key": "${link_1}",
          "target": {
            "href": "Healing#Spiritbending",
            "page": "Healing"
          }
        },
        {
          "body": "spirit portals",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Kyoshi Bridge",
          "key": "${link_3}",
          "target": {
            "href": "Kyoshi_Bridge",
            "page": "Kyoshi_Bridge"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_4}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Oogi",
          "key": "${link_5}",
          "target": {
            "href": "Oogi",
            "page": "Oogi"
          }
        },
        {
          "body": "Daw",
          "key": "${link_6}",
          "target": {
            "href": "Daw",
            "page": "Daw"
          }
        }
      ],
      "text": "Bolin and Lin Beifong later watched as Korra attempted to clear away the vines with spiritbending. When the vines regenerated, the two earthbenders raised a large slab of rock to keep a building from collapsing. After Korra eased the situation, Bolin remarked that it could have gone better. That evening, he interrupted Tenzin and Korra's talk about her decision to leave the spirit portals open to alert the two that Mako called, saying a newly-found airbender had run to the top of Kyoshi Bridge and would not come down. He also apologized for interrupting the \"Avatar wisdom\" session, though Korra called it a thing of the past, and the three ventured to the bridge on Oogi. Bolin witnessed the Avatar calm Daw down and save him after he slipped."
    },
    {
      "body": "${link_0} convinced ${link_1} to join ${link_2} on their search to find new ${link_3}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_3}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Bolin convinced Mako to join Team Avatar on their search to find new airbenders."
    },
    {
      "body": "A day later, Bolin and the rest of Team Avatar was prepared to leave for ${link_0} on a ${link_1} given to them by Asami. Before they left, Mako arrived with a map which marked the sightings of airbenders in the Earth Kingdom before setting off to return to the police station. Bolin, however, wanted his brother to come along to help the Avatar restore balance and also return to the place where their father grew up and the home of their grandmother. Mako gave in and joined the team on the journey.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Future Industries airship",
          "key": "${link_1}",
          "target": {
            "href": "Future_Industries_airship",
            "page": "Future_Industries_airship"
          }
        }
      ],
      "text": "A day later, Bolin and the rest of Team Avatar was prepared to leave for Ba Sing Se on a Future Industries airship given to them by Asami. Before they left, Mako arrived with a map which marked the sightings of airbenders in the Earth Kingdom before setting off to return to the police station. Bolin, however, wanted his brother to come along to help the Avatar restore balance and also return to the place where their father grew up and the home of their grandmother. Mako gave in and joined the team on the journey."
    },
    {
      "body": "Their first visit led them to a small village, where the group dined with the new airbender, ${link_0}, and his family. Kuon accidentally airbent a pie in Bolin's face, but he did not mind as both he and Pabu enjoyed it. However, after Tenzin overpressured the new bender to help rebuild the nation, the group left the village. Aboard the shop, Bolin joked that they could have tried to stuff him into a potato sack.",
      "links": [
        {
          "body": "Kuon",
          "key": "${link_0}",
          "target": {
            "href": "Kuon",
            "page": "Kuon"
          }
        }
      ],
      "text": "Their first visit led them to a small village, where the group dined with the new airbender, Kuon, and his family. Kuon accidentally airbent a pie in Bolin's face, but he did not mind as both he and Pabu enjoyed it. However, after Tenzin overpressured the new bender to help rebuild the nation, the group left the village. Aboard the shop, Bolin joked that they could have tried to stuff him into a potato sack."
    },
    {
      "body": "After several failed attempts by Tenzin to recruit the new airbenders, Bolin, Korra, and Mako decided to visit the next airbender's home. They visited the home of ${link_0} and his parents; his mother was anxious to get him out of the house. The threesome's initial excitement faded though after Ryu showed a non-committal attitude toward his bending and the Air Nomad culture. Korra tried to get him to forcefully join, but after the airbender blasted himself away, Bolin and Mako restrained Korra from any further attempts.",
      "links": [
        {
          "body": "Ryu",
          "key": "${link_0}",
          "target": {
            "href": "Ryu",
            "page": "Ryu"
          }
        }
      ],
      "text": "After several failed attempts by Tenzin to recruit the new airbenders, Bolin, Korra, and Mako decided to visit the next airbender's home. They visited the home of Ryu and his parents; his mother was anxious to get him out of the house. The threesome's initial excitement faded though after Ryu showed a non-committal attitude toward his bending and the Air Nomad culture. Korra tried to get him to forcefully join, but after the airbender blasted himself away, Bolin and Mako restrained Korra from any further attempts."
    },
    {
      "body": "${link_0} hosted an ${link_1} show featuring the members of ${link_2} in an attempt to recruit ${link_3}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "airbending",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_3}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Bolin hosted an airbending show featuring the members of Team Avatar in an attempt to recruit airbenders."
    },
    {
      "body": "Aboard the ship, the group lamented over their lack of success. Bumi suggested some \"razzle-dazzle\" to excite the new airbenders, which prompted Bolin to suggest an \"air show\". The next day, Bolin hosted the show, introducing Tenzin, Korra, Bumi, and Jinora as the airbenders and Mako as a firebending convict, whom Korra airbent with a tornado to show the power of the art. Bolin advertised the gliding of Jinora and Bumi's air blasts as what one could accomplish in just a few weeks of training. His pitch ultimately attracted one young airbender, ${link_0}. Bolin became quickly sympathetic toward him upon learning that he was an orphan and believed his story that his parents were killed by outlaws. The earthbender was eager to accept him as a little brother. Just before they were about to leave, the men Kai claimed to be as outlaws showed up on motorcycles. After Korra defeated them, however, the men revealed themselves as the town's police force, and that Kai was a lifelong orphan who had stolen his foster family's life savings, which Mako recovered upon apprehending him. Kai tried to convince the group that his thieving side was the old him, and his airbending represented a change for him. When Korra accepted him, Bolin was again excited to welcome him to the family and initiate a group hug.",
      "links": [
        {
          "body": "Kai",
          "key": "${link_0}",
          "target": {
            "href": "Kai",
            "page": "Kai"
          }
        }
      ],
      "text": "Aboard the ship, the group lamented over their lack of success. Bumi suggested some \"razzle-dazzle\" to excite the new airbenders, which prompted Bolin to suggest an \"air show\". The next day, Bolin hosted the show, introducing Tenzin, Korra, Bumi, and Jinora as the airbenders and Mako as a firebending convict, whom Korra airbent with a tornado to show the power of the art. Bolin advertised the gliding of Jinora and Bumi's air blasts as what one could accomplish in just a few weeks of training. His pitch ultimately attracted one young airbender, Kai. Bolin became quickly sympathetic toward him upon learning that he was an orphan and believed his story that his parents were killed by outlaws. The earthbender was eager to accept him as a little brother. Just before they were about to leave, the men Kai claimed to be as outlaws showed up on motorcycles. After Korra defeated them, however, the men revealed themselves as the town's police force, and that Kai was a lifelong orphan who had stolen his foster family's life savings, which Mako recovered upon apprehending him. Kai tried to convince the group that his thieving side was the old him, and his airbending represented a change for him. When Korra accepted him, Bolin was again excited to welcome him to the family and initiate a group hug."
    },
    {
      "body": "Upon arriving in ${link_0}, ${link_1} was informed by ${link_2} to keep ${link_3} and ${link_4} out of the ${link_5}'s presence.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Gun",
          "key": "${link_2}",
          "target": {
            "href": "Gun",
            "page": "Gun"
          }
        },
        {
          "body": "Naga",
          "key": "${link_3}",
          "target": {
            "href": "Naga",
            "page": "Naga"
          }
        },
        {
          "body": "Pabu",
          "key": "${link_4}",
          "target": {
            "href": "Pabu",
            "page": "Pabu"
          }
        },
        {
          "body": "Earth Queen",
          "key": "${link_5}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "Upon arriving in Ba Sing Se, Bolin was informed by Gun to keep Naga and Pabu out of the Earth Queen's presence."
    },
    {
      "body": "As the team entered Ba Sing Se, Bolin maintained his excitement to pass over the wall and into the capital. He was disgusted with the smell of the ${link_0}, understanding why his father left the city in the first place. He became excited again upon getting to the ${link_1} and ${link_2} Rings of the city. Upon arriving at the ${link_3}, the group was greeted by ${link_4} ${link_5}, who informed Bolin that the ${link_6} did not care for pets and gave the group a long list of rules for interacting with her as he led them to their quarters. The earthbender was impressed with the accommodations, though frustrated with the no-pets rule.",
      "links": [
        {
          "body": "Lower Ring",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se#Lower_Ring",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Middle",
          "key": "${link_1}",
          "target": {
            "href": "Ba_Sing_Se#Middle_Ring",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Upper",
          "key": "${link_2}",
          "target": {
            "href": "Ba_Sing_Se#Upper_Ring",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Earth Kingdom Royal Palace",
          "key": "${link_3}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        },
        {
          "body": "Grand Secretariat",
          "key": "${link_4}",
          "target": {
            "href": "Grand_Secretariat_of_Ba_Sing_Se",
            "page": "Grand_Secretariat_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Gun",
          "key": "${link_5}",
          "target": {
            "href": "Gun",
            "page": "Gun"
          }
        },
        {
          "body": "Earth Queen",
          "key": "${link_6}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "As the team entered Ba Sing Se, Bolin maintained his excitement to pass over the wall and into the capital. He was disgusted with the smell of the Lower Ring, understanding why his father left the city in the first place. He became excited again upon getting to the Middle and Upper Rings of the city. Upon arriving at the Earth Kingdom Royal Palace, the group was greeted by Grand Secretariat Gun, who informed Bolin that the Earth Queen did not care for pets and gave the group a long list of rules for interacting with her as he led them to their quarters. The earthbender was impressed with the accommodations, though frustrated with the no-pets rule."
    },
    {
      "body": "While Korra met with Earth Queen ${link_0}, Asami noticed that Kai had gone missing. Realizing the young boy was their responsibility, Mako decided that he and Bolin would try to find him. While searching, Mako caught Kai scamming a citizen by blowing his clothes up and stealing the money that fell, prompting the brothers to chase him. The chase made its way to a train station, where Kai trapped the two on a train en route to the Lower Ring. Bolin nervously referred to Kai as a \"lovable little scamp\", which reminded Mako of Bolin himself. Upon arrival, the brothers tried to buy tickets for a train back to the Upper Ring, but noticed that Kai had stolen their money. The conductor also threatened them with ${link_1} intervention, causing the two to leave the station. Bolin made an attempt to find a brighter side, saying they could use the bathroom where ever they wanted.",
      "links": [
        {
          "body": "Hou-Ting",
          "key": "${link_0}",
          "target": {
            "href": "Hou-Ting",
            "page": "Hou-Ting"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_1}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "While Korra met with Earth Queen Hou-Ting, Asami noticed that Kai had gone missing. Realizing the young boy was their responsibility, Mako decided that he and Bolin would try to find him. While searching, Mako caught Kai scamming a citizen by blowing his clothes up and stealing the money that fell, prompting the brothers to chase him. The chase made its way to a train station, where Kai trapped the two on a train en route to the Lower Ring. Bolin nervously referred to Kai as a \"lovable little scamp\", which reminded Mako of Bolin himself. Upon arrival, the brothers tried to buy tickets for a train back to the Upper Ring, but noticed that Kai had stolen their money. The conductor also threatened them with Dai Li intervention, causing the two to leave the station. Bolin made an attempt to find a brighter side, saying they could use the bathroom where ever they wanted."
    },
    {
      "body": "${link_0} urged ${link_1} to pull off an old hustling trick from when they lived in the streets in order to steal some fruit.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "Bolin urged Mako to pull off an old hustling trick from when they lived in the streets in order to steal some fruit."
    },
    {
      "body": "The next morning, Bolin and Mako awoke from sleeping on a pile of trash. The earthbender expressed his concern for Kai, believing he may be scared and lonely. Feeling hungry and venturing upon a fruit stand, Bolin suggested they pull off an old hustling trick: Bolin would push Mako into the stand and faint upon his older brother screaming. Mako did not want to take part, however, especially as the fruit was disgusting. ${link_0}, the proprietor of the stand, overheard them and at first wondered why they were attempting theft, only to be offended by the firebender's disparaging remarks about the fruit. After Tu showed off his muscles and tried to antagonize them into theft, Bolin wondered if they were pulling off the robbery, which prompted Tu to tackle them. At that moment, Tu's father, ${link_1} appeared and wondered what was going on. He soon recognized Mako and Bolin as his brother, San's kids, and thus Tu's cousins.",
      "links": [
        {
          "body": "Tu",
          "key": "${link_0}",
          "target": {
            "href": "Tu",
            "page": "Tu"
          }
        },
        {
          "body": "Chow",
          "key": "${link_1}",
          "target": {
            "href": "Chow",
            "page": "Chow"
          }
        }
      ],
      "text": "The next morning, Bolin and Mako awoke from sleeping on a pile of trash. The earthbender expressed his concern for Kai, believing he may be scared and lonely. Feeling hungry and venturing upon a fruit stand, Bolin suggested they pull off an old hustling trick: Bolin would push Mako into the stand and faint upon his older brother screaming. Mako did not want to take part, however, especially as the fruit was disgusting. Tu, the proprietor of the stand, overheard them and at first wondered why they were attempting theft, only to be offended by the firebender's disparaging remarks about the fruit. After Tu showed off his muscles and tried to antagonize them into theft, Bolin wondered if they were pulling off the robbery, which prompted Tu to tackle them. At that moment, Tu's father, Chow appeared and wondered what was going on. He soon recognized Mako and Bolin as his brother, San's kids, and thus Tu's cousins."
    },
    {
      "body": "Chow brought Bolin and Mako, along with Tu, to his home, explaining that San had sent a letter with their names, but did not hear about them until learning of their pro-bending successes. Chow and his family also enjoyed the Nuktuk movies, though much to Bolin's disappointment, they took the films as humorous. Tu thought the brothers were well-off as sports stars living in a mansion, only for Bolin to reveal that they too had a life on the streets. Chow quickly pulled them into the home, where they were greeted by their large family, particularly their grandmother, ${link_0}, who was thrilled to meet them. She wondered where their parents were, leaving for the brothers to explain that they lost their parents when they were young.",
      "links": [
        {
          "body": "Yin",
          "key": "${link_0}",
          "target": {
            "href": "Yin",
            "page": "Yin"
          }
        }
      ],
      "text": "Chow brought Bolin and Mako, along with Tu, to his home, explaining that San had sent a letter with their names, but did not hear about them until learning of their pro-bending successes. Chow and his family also enjoyed the Nuktuk movies, though much to Bolin's disappointment, they took the films as humorous. Tu thought the brothers were well-off as sports stars living in a mansion, only for Bolin to reveal that they too had a life on the streets. Chow quickly pulled them into the home, where they were greeted by their large family, particularly their grandmother, Yin, who was thrilled to meet them. She wondered where their parents were, leaving for the brothers to explain that they lost their parents when they were young."
    },
    {
      "body": "${link_0} and ${link_1} hugged ${link_2}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "their grandmother",
          "key": "${link_2}",
          "target": {
            "href": "Yin",
            "page": "Yin"
          }
        }
      ],
      "text": "Bolin and Mako hugged their grandmother."
    },
    {
      "body": "The siblings enjoyed a feast; Bolin was excited to have such a large family to go along with it. Chow explained to the two that San left Ba Sing Se in order to pursue larger dreams and see the ${link_0}, which was much to the frustration of their grandfather. Yin invited the brothers upstairs to show them a letter from San talking about his marriage and two sons, along with a photo of the family which showed San wearing Mako's trademark scarf. Yin believed their mother to be a \"wonderful bride\", and the three embraced after Mako gave their grandmother the scarf.",
      "links": [
        {
          "body": "world",
          "key": "${link_0}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "The siblings enjoyed a feast; Bolin was excited to have such a large family to go along with it. Chow explained to the two that San left Ba Sing Se in order to pursue larger dreams and see the world, which was much to the frustration of their grandfather. Yin invited the brothers upstairs to show them a letter from San talking about his marriage and two sons, along with a photo of the family which showed San wearing Mako's trademark scarf. Yin believed their mother to be a \"wonderful bride\", and the three embraced after Mako gave their grandmother the scarf."
    },
    {
      "body": "Upon returning to the feast, Chow told Bolin and Mako that San would be proud of them for journeying and working with the Avatar to help keep the world at peace. After Mako revealed that they were looking for airbenders in the city, Chow informed them that their neighbor began airbending a week earlier, and the Dai Li took him within a couple of days. Tu also informed them of a rumor that the Earth Queen was retaining them for experimental purposes. Bolin agreed with Mako to go back to the Upper Ring and inform Korra, with the earthbender continuing to hope that Kai was okay.",
      "links": [],
      "text": "Upon returning to the feast, Chow told Bolin and Mako that San would be proud of them for journeying and working with the Avatar to help keep the world at peace. After Mako revealed that they were looking for airbenders in the city, Chow informed them that their neighbor began airbending a week earlier, and the Dai Li took him within a couple of days. Tu also informed them of a rumor that the Earth Queen was retaining them for experimental purposes. Bolin agreed with Mako to go back to the Upper Ring and inform Korra, with the earthbender continuing to hope that Kai was okay."
    },
    {
      "body": "The next day, Tu had managed to procure two passports which allowed Mako and Bolin to return to the ${link_0} As they shared a goodbye hug with their extended family, Bolin tried to acknowledge each relative by name, but soon lost track.",
      "links": [
        {
          "body": "Upper Ring",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se#Upper_Ring",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "The next day, Tu had managed to procure two passports which allowed Mako and Bolin to return to the Upper Ring As they shared a goodbye hug with their extended family, Bolin tried to acknowledge each relative by name, but soon lost track."
    },
    {
      "body": "${link_0} revealed to ${link_1} and ${link_2} that ${link_3} had been imprisoning the ${link_4} in ${link_5}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_3}",
          "target": {
            "href": "Hou-Ting",
            "page": "Hou-Ting"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_4}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_5}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "Bolin revealed to Korra and Asami that Hou-Ting had been imprisoning the airbenders in Ba Sing Se."
    },
    {
      "body": "Returning to the palace, an exhausted Bolin quickly explained to Korra and Asami in a quick summary made of broken sentences of what happened to them before slumping to the ground in exhaustion. After Mako explained that the Earth Queen was harboring airbenders for her army, they were approached by her and Gun, forcing Bolin to hide Pabu in his shirt. However, as his torso was sweaty, his pet started fidgeting around, briefly exposing his tail, but the earthbender was able to get Pabu out of sight. Gun told the team of a report of airbenders in the Yung province and Hou-Ting informed the group they could leave by evening. As she was explaining this, though, she began sneezing. Aware that the queen was allergic to animals and seeing Pabu's tail sneak out again, Bolin quickly slipped away from the scene.",
      "links": [],
      "text": "Returning to the palace, an exhausted Bolin quickly explained to Korra and Asami in a quick summary made of broken sentences of what happened to them before slumping to the ground in exhaustion. After Mako explained that the Earth Queen was harboring airbenders for her army, they were approached by her and Gun, forcing Bolin to hide Pabu in his shirt. However, as his torso was sweaty, his pet started fidgeting around, briefly exposing his tail, but the earthbender was able to get Pabu out of sight. Gun told the team of a report of airbenders in the Yung province and Hou-Ting informed the group they could leave by evening. As she was explaining this, though, she began sneezing. Aware that the queen was allergic to animals and seeing Pabu's tail sneak out again, Bolin quickly slipped away from the scene."
    },
    {
      "body": "After the entire team reconvened at their home, they began discussing where the airbenders could have been taken. When Jinora feared for Kai's safety, Bolin replied by saying that he was hard to catch, like a \"little greased ${link_0}\". Ultimately, the group was able to discern that the airbenders were being held beneath the ${link_1}. While discussing plans on how to bail them out, they heard a knock at the door and believed it was again Hou-Ting, prompting Bolin to encourage Pabu to hide in his shirt again. However, their guest as actually Lin, who came to warn Korra about four dangerous criminals who were after her, but instead joined their rescue mission after Korra refused to leave Ba Sing Se.",
      "links": [
        {
          "body": "hog monkey",
          "key": "${link_0}",
          "target": {
            "href": "Hog_monkey",
            "page": "Hog_monkey"
          }
        },
        {
          "body": "Earth Queen's Temple",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Queen%27s_Temple",
            "page": "Earth_Queen%27s_Temple"
          }
        }
      ],
      "text": "After the entire team reconvened at their home, they began discussing where the airbenders could have been taken. When Jinora feared for Kai's safety, Bolin replied by saying that he was hard to catch, like a \"little greased hog monkey\". Ultimately, the group was able to discern that the airbenders were being held beneath the Earth Queen's Temple. While discussing plans on how to bail them out, they heard a knock at the door and believed it was again Hou-Ting, prompting Bolin to encourage Pabu to hide in his shirt again. However, their guest as actually Lin, who came to warn Korra about four dangerous criminals who were after her, but instead joined their rescue mission after Korra refused to leave Ba Sing Se."
    },
    {
      "body": "${link_0} and the other members of ${link_1} ambushed two ${link_2} to infiltrate the ${link_3}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Royal Earthbender Guards",
          "key": "${link_2}",
          "target": {
            "href": "Royal_Earthbender_Guards",
            "page": "Royal_Earthbender_Guards"
          }
        },
        {
          "body": "Earth Queen's Temple",
          "key": "${link_3}",
          "target": {
            "href": "Earth_Queen%27s_Temple",
            "page": "Earth_Queen%27s_Temple"
          }
        }
      ],
      "text": "Bolin and the other members of Team Avatar ambushed two Royal Earthbender Guards to infiltrate the Earth Queen's Temple."
    },
    {
      "body": "Later that night, the party infiltrated the temple, first easily overwhelming two ${link_0}. After reaching the airbenders' hold, Bolin, Mako, and Jinora split off to find Kai while the others freed the other airbenders. When they found him, Jinora gave Kai a kiss on the cheek, amusing Bolin, who had a feeling that Tenzin would not be happy. After the young airbender apologized to the brothers, Bolin forgave and hugged him before they began to make their way out. The four, however, quickly found themselves confronted by three Dai Li agents, including the ${link_1}. The brothers dodged initial attacks of ${link_2} and fought them. Bolin was able to defeat two of them by slamming them into walls with rocks, but the sergeant was able to briefly capture Jinora, though Kai quickly freed her. The four ran out of the hold, Bolin calling for help as Dai Li agents continued to try and attack them. Spotting Korra and Tenzin coming to them on Oogi, Bolin earthbent them onto the ${link_3} and they flee the city.",
      "links": [
        {
          "body": "Royal Earthbender Guards",
          "key": "${link_0}",
          "target": {
            "href": "Royal_Earthbender_Guards",
            "page": "Royal_Earthbender_Guards"
          }
        },
        {
          "body": "sergeant",
          "key": "${link_1}",
          "target": {
            "href": "Dai_Li_sergeant",
            "page": "Dai_Li_sergeant"
          }
        },
        {
          "body": "rock gloves",
          "key": "${link_2}",
          "target": {
            "href": "Rock_gloves",
            "page": "Rock_gloves"
          }
        },
        {
          "body": "flying bison",
          "key": "${link_3}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        }
      ],
      "text": "Later that night, the party infiltrated the temple, first easily overwhelming two Royal Earthbender Guards. After reaching the airbenders' hold, Bolin, Mako, and Jinora split off to find Kai while the others freed the other airbenders. When they found him, Jinora gave Kai a kiss on the cheek, amusing Bolin, who had a feeling that Tenzin would not be happy. After the young airbender apologized to the brothers, Bolin forgave and hugged him before they began to make their way out. The four, however, quickly found themselves confronted by three Dai Li agents, including the sergeant. The brothers dodged initial attacks of rock gloves and fought them. Bolin was able to defeat two of them by slamming them into walls with rocks, but the sergeant was able to briefly capture Jinora, though Kai quickly freed her. The four ran out of the hold, Bolin calling for help as Dai Li agents continued to try and attack them. Spotting Korra and Tenzin coming to them on Oogi, Bolin earthbent them onto the flying bison and they flee the city."
    },
    {
      "body": "The next morning, outside the city, the team broke apart, with Bolin joining his friends and Lin to continue the search for airbenders in Lin's airship while Tenzin and Jinora ventured to the ${link_0} to help train the ones the team freed.",
      "links": [
        {
          "body": "Northern Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        }
      ],
      "text": "The next morning, outside the city, the team broke apart, with Bolin joining his friends and Lin to continue the search for airbenders in Lin's airship while Tenzin and Jinora ventured to the Northern Air Temple to help train the ones the team freed."
    },
    {
      "body": "${link_0} and ${link_1} were greeted by ${link_2} upon their arrival in ${link_3}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Aiwei",
          "key": "${link_2}",
          "target": {
            "href": "Aiwei",
            "page": "Aiwei"
          }
        },
        {
          "body": "Zaofu",
          "key": "${link_3}",
          "target": {
            "href": "Zaofu",
            "page": "Zaofu"
          }
        }
      ],
      "text": "Bolin and Team Avatar were greeted by Aiwei upon their arrival in Zaofu."
    },
    {
      "body": "During a pit stop, Bolin watched as Korra and Naga played a game of fetch before Mako and Asami emerged from the police airship, reporting that they had heard on the radio about an airbender being found in the city of Zaofu, home to the ${link_0}. As they neared the city, Bolin was excited to see that it was made entirely of metal and told Lin she should feel right at home, but only received a non-committal mumble from the police chief. The team made their way off the airship without Lin, who warned them to tell no one she was there. Once disembarked, the group was greeted by ${link_1}, the city's emissary, and led on a train through the city. Bolin beamed at the city's sights as they passed by and became shocked at the statue of Toph Beifong. The earthbender asked Aiwei if Toph lived in the city and if they had a chance to meet her, but was left disappointed upon being told that she had left in search of enlightenment and had not been heard from since.",
      "links": [
        {
          "body": "Metal Clan",
          "key": "${link_0}",
          "target": {
            "href": "Metal_Clan",
            "page": "Metal_Clan"
          }
        },
        {
          "body": "Aiwei",
          "key": "${link_1}",
          "target": {
            "href": "Aiwei",
            "page": "Aiwei"
          }
        }
      ],
      "text": "During a pit stop, Bolin watched as Korra and Naga played a game of fetch before Mako and Asami emerged from the police airship, reporting that they had heard on the radio about an airbender being found in the city of Zaofu, home to the Metal Clan. As they neared the city, Bolin was excited to see that it was made entirely of metal and told Lin she should feel right at home, but only received a non-committal mumble from the police chief. The team made their way off the airship without Lin, who warned them to tell no one she was there. Once disembarked, the group was greeted by Aiwei, the city's emissary, and led on a train through the city. Bolin beamed at the city's sights as they passed by and became shocked at the statue of Toph Beifong. The earthbender asked Aiwei if Toph lived in the city and if they had a chance to meet her, but was left disappointed upon being told that she had left in search of enlightenment and had not been heard from since."
    },
    {
      "body": "They eventually made their way to a building where a group of metalbenders was preparing for a dance recital. There, they were greeted by Zaofu's matriarch, ${link_0}. However, Suyin was informed by Aiwei that Korra lied about how many people were in their group. After the Avatar confessed that Lin was with them, Bolin and the others were shocked upon Suyin informing them that she and Lin were related. They made their way back to the airship so Suyin could reunite with Lin. Bolin watched as the half-siblings argued briefly over their past, but the group was soon invited by Suyin to her estate in order to meet her children, including the airbender.",
      "links": [
        {
          "body": "Suyin Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        }
      ],
      "text": "They eventually made their way to a building where a group of metalbenders was preparing for a dance recital. There, they were greeted by Zaofu's matriarch, Suyin Beifong. However, Suyin was informed by Aiwei that Korra lied about how many people were in their group. After the Avatar confessed that Lin was with them, Bolin and the others were shocked upon Suyin informing them that she and Lin were related. They made their way back to the airship so Suyin could reunite with Lin. Bolin watched as the half-siblings argued briefly over their past, but the group was soon invited by Suyin to her estate in order to meet her children, including the airbender."
    },
    {
      "body": "${link_0} was immediately enamored upon meeting ${link_1}, declaring the young ${link_2}'s name to be \"beautiful\".",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Opal",
          "key": "${link_1}",
          "target": {
            "href": "Opal",
            "page": "Opal"
          }
        },
        {
          "body": "airbender",
          "key": "${link_2}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Bolin was immediately enamored upon meeting Opal, declaring the young airbender's name to be \"beautiful\"."
    },
    {
      "body": "The group first met the twins ${link_0} while they were playing their own game called ${link_1}. They proceeded on to ${link_2}, who was using his metalbending to create art inspired by Harmonic Convergence. Bolin eyed Huan's work curiously, believing his most recent piece looked like a banana and calling it lifelike. After Huan told Bolin it was to represent a new age, the earthbender awkwardly answered he could see that, though quietly told Mako he still believed it to be a banana. Upon meeting the airbender, Opal, Bolin said her name was beautiful and introduced himself to her. Suyin soon told the group that their accommodations were ready and to prepare for an appetizing meal.",
      "links": [
        {
          "body": "Wei and Wing",
          "key": "${link_0}",
          "target": {
            "href": "Wei_and_Wing",
            "page": "Wei_and_Wing"
          }
        },
        {
          "body": "power disc",
          "key": "${link_1}",
          "target": {
            "href": "Power_disc",
            "page": "Power_disc"
          }
        },
        {
          "body": "Huan",
          "key": "${link_2}",
          "target": {
            "href": "Huan",
            "page": "Huan"
          }
        }
      ],
      "text": "The group first met the twins Wei and Wing while they were playing their own game called power disc. They proceeded on to Huan, who was using his metalbending to create art inspired by Harmonic Convergence. Bolin eyed Huan's work curiously, believing his most recent piece looked like a banana and calling it lifelike. After Huan told Bolin it was to represent a new age, the earthbender awkwardly answered he could see that, though quietly told Mako he still believed it to be a banana. Upon meeting the airbender, Opal, Bolin said her name was beautiful and introduced himself to her. Suyin soon told the group that their accommodations were ready and to prepare for an appetizing meal."
    },
    {
      "body": "At dinner, Bolin remarked that, despite his initial skepticism, the food was delicious. When Opal told him she never had a bad meal, he replied by telling her jokingly about what he and Mako did to get food while living on the streets, calling \"dumpster food\" disgusting. After Opal apologized, Bolin assured her it was all in the past and told her about his journeys since, such as pro-bending, his mover career, and helping Korra rebuild the Air Nation. Afterward, Varrick entered the dining hall, pleasantly surprising the earthbender.",
      "links": [],
      "text": "At dinner, Bolin remarked that, despite his initial skepticism, the food was delicious. When Opal told him she never had a bad meal, he replied by telling her jokingly about what he and Mako did to get food while living on the streets, calling \"dumpster food\" disgusting. After Opal apologized, Bolin assured her it was all in the past and told her about his journeys since, such as pro-bending, his mover career, and helping Korra rebuild the Air Nation. Afterward, Varrick entered the dining hall, pleasantly surprising the earthbender."
    },
    {
      "body": "Following dinner, the brothers cleaned up in a bathroom. After Mako told Bolin how he noticed him hitting it off with Opal, the younger brother suggested that she was not his type. However, after being hurt by Mako's joke about that being \"dumb mover stars\" and \"psycho ice princesses\", he took a second to think over it, and soon believed that maybe Opal was his type. He thanked Mako for helping him realize it before heading out to visit the young airbender.",
      "links": [],
      "text": "Following dinner, the brothers cleaned up in a bathroom. After Mako told Bolin how he noticed him hitting it off with Opal, the younger brother suggested that she was not his type. However, after being hurt by Mako's joke about that being \"dumb mover stars\" and \"psycho ice princesses\", he took a second to think over it, and soon believed that maybe Opal was his type. He thanked Mako for helping him realize it before heading out to visit the young airbender."
    },
    {
      "body": "${link_0} and ${link_1} developed strong feelings for one another.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Opal",
          "key": "${link_1}",
          "target": {
            "href": "Opal",
            "page": "Opal"
          }
        }
      ],
      "text": "Bolin and Opal developed strong feelings for one another."
    },
    {
      "body": "Bolin approached Opal in a flirtatious tone while making airbending noises in reference to her training shots. Opal was confused and asked him why he was acting weird, but Bolin asked the same thing back, prompting her to walk away. Bolin quickly got into her path, apologizing and saying that he got self-conscious and acted stupid whenever he knew a girl liked him. Opal wondered where he got the thought that she liked him, upsetting him, before he was told that she was just joking around, though he was advised to just be himself. Bolin agreed to try it and the two gazed into each other's eyes, but their moment was interrupted by Korra, who needed Opal's help with another matter.",
      "links": [],
      "text": "Bolin approached Opal in a flirtatious tone while making airbending noises in reference to her training shots. Opal was confused and asked him why he was acting weird, but Bolin asked the same thing back, prompting her to walk away. Bolin quickly got into her path, apologizing and saying that he got self-conscious and acted stupid whenever he knew a girl liked him. Opal wondered where he got the thought that she liked him, upsetting him, before he was told that she was just joking around, though he was advised to just be himself. Bolin agreed to try it and the two gazed into each other's eyes, but their moment was interrupted by Korra, who needed Opal's help with another matter."
    },
    {
      "body": "The next morning, as the team gathered for breakfast without Lin, Bolin questioned as to if anyone had seen her. While Suyin was discussing with Korra about learning metalbending, Bolin was suggested by Opal to try as well. Bolin declined, saying he was more of an earth guy, though Suyin kept an offer open for him to learn as well. The group soon had to duck as their dishes were pulled away from them by Varrick's magnetic suit.",
      "links": [],
      "text": "The next morning, as the team gathered for breakfast without Lin, Bolin questioned as to if anyone had seen her. While Suyin was discussing with Korra about learning metalbending, Bolin was suggested by Opal to try as well. Bolin declined, saying he was more of an earth guy, though Suyin kept an offer open for him to learn as well. The group soon had to duck as their dishes were pulled away from them by Varrick's magnetic suit."
    },
    {
      "body": "Bolin later tried to secretly watch as Suyin taught Korra, but was spotted by the Avatar. He tried to explain by saying he was looking for Pabu, whom Korra pointed out was on his shoulder, to which he lied by saying that he felt the ferret biting him and would need a shot. He was asked again by Suyin if he wanted to try metalbending, but again declined, believing only one out of a hundred earthbenders could perform the act. Suyin suggested only his attitude could limit him, but Bolin just decided to sit and watch. When Korra did metalbend, Bolin was dejected, believing she was that one in a hundred.",
      "links": [],
      "text": "Bolin later tried to secretly watch as Suyin taught Korra, but was spotted by the Avatar. He tried to explain by saying he was looking for Pabu, whom Korra pointed out was on his shoulder, to which he lied by saying that he felt the ferret biting him and would need a shot. He was asked again by Suyin if he wanted to try metalbending, but again declined, believing only one out of a hundred earthbenders could perform the act. Suyin suggested only his attitude could limit him, but Bolin just decided to sit and watch. When Korra did metalbend, Bolin was dejected, believing she was that one in a hundred."
    },
    {
      "body": "${link_0} attempted to ${link_1} a ${link_2}, but to no avail.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "metalbend",
          "key": "${link_1}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "meteorite",
          "key": "${link_2}",
          "target": {
            "href": "Meteor",
            "page": "Meteor"
          }
        }
      ],
      "text": "Bolin attempted to metalbend a meteorite, but to no avail."
    },
    {
      "body": "Later that day, Bolin made his way out to the courtyard and picked up a chunk of meteorite, trying in vain to metalbend it. To his shock, Opal joined him, prompting him to hide the space rock behind his back and attempt to replace it on its pedestal while trying weakly to distract a questioning Opal. He soon admitted his frustration about his lack of ability to metalbend and told Opal not to tell anyone. When asked why, he believed it was embarrassing and it was not the first time he attempted the act, having wanted to since he heard about Toph, his biggest hero. Opal advised him just to stop being scared and train with Suyin, but the earthbender countered by suggesting she too was afraid to leave home despite her desire to learn airbending from Tenzin. Opal realized he was right, and Bolin took notice of the fact that they were discussing their feelings and supporting each other before they embraced.",
      "links": [],
      "text": "Later that day, Bolin made his way out to the courtyard and picked up a chunk of meteorite, trying in vain to metalbend it. To his shock, Opal joined him, prompting him to hide the space rock behind his back and attempt to replace it on its pedestal while trying weakly to distract a questioning Opal. He soon admitted his frustration about his lack of ability to metalbend and told Opal not to tell anyone. When asked why, he believed it was embarrassing and it was not the first time he attempted the act, having wanted to since he heard about Toph, his biggest hero. Opal advised him just to stop being scared and train with Suyin, but the earthbender countered by suggesting she too was afraid to leave home despite her desire to learn airbending from Tenzin. Opal realized he was right, and Bolin took notice of the fact that they were discussing their feelings and supporting each other before they embraced."
    },
    {
      "body": "Having overcome his fear, Bolin joined Korra and Suyin, deciding he indeed wanted to learn the art. He was still nervous about a \"waiting list\", but Suyin decided they could start right away. Before they could, however, Suyin was confronted by Lin with a wave of rocks, prompting Bolin to tell Korra that she was mad about something. The two watched as the half-siblings fought verbally and physically. When Korra wondered if she could do something to stop the fight, Bolin told her to wait it out, telling her the fighting was just how siblings relieved tensions.",
      "links": [],
      "text": "Having overcome his fear, Bolin joined Korra and Suyin, deciding he indeed wanted to learn the art. He was still nervous about a \"waiting list\", but Suyin decided they could start right away. Before they could, however, Suyin was confronted by Lin with a wave of rocks, prompting Bolin to tell Korra that she was mad about something. The two watched as the half-siblings fought verbally and physically. When Korra wondered if she could do something to stop the fight, Bolin told her to wait it out, telling her the fighting was just how siblings relieved tensions."
    },
    {
      "body": "${link_0} interrupted a conversation between ${link_1} and ${link_2} to fawn over ${link_3}, much to their dismay.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_2}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Opal",
          "key": "${link_3}",
          "target": {
            "href": "Opal",
            "page": "Opal"
          }
        }
      ],
      "text": "Bolin interrupted a conversation between Korra and Tenzin to fawn over Opal, much to their dismay."
    },
    {
      "body": "Sixteen hours after Lin passed out as a result of exhaustion from the duel, Bolin went with Korra and Mako to her room, but neither he nor the Avatar wanted to risk disturbing her sleep. After Mako entered, Lin emerged, greeting the three in a pleasant tone, much to their collective shock. Later, while Korra was speaking with Tenzin over the radio, Bolin briefly interrupted to fawn over Opal. Upon seeing Korra's annoyed look, he apologized and slipped away from the microphone.",
      "links": [],
      "text": "Sixteen hours after Lin passed out as a result of exhaustion from the duel, Bolin went with Korra and Mako to her room, but neither he nor the Avatar wanted to risk disturbing her sleep. After Mako entered, Lin emerged, greeting the three in a pleasant tone, much to their collective shock. Later, while Korra was speaking with Tenzin over the radio, Bolin briefly interrupted to fawn over Opal. Upon seeing Korra's annoyed look, he apologized and slipped away from the microphone."
    },
    {
      "body": "Sometime later, Bolin was set up with Wei for a practice spar, but again could not metalbend. His meteorite was knocked out his hands by his opponent, who told him a \"trial by fire\" was the best way to learn. He dodged an attack and resorted to using a pebble to strike Wei, prompting Mako to complement him but also question if he was supposed to be using metal instead of earth. Bolin responded by saying metalbending was hard to get right away, if one could do so at all because the art was not normal. Upon seeing Korra defeat Wing with the art, he remarked she was not normal because she was the Avatar. Asami soon advised them to clean up for Opal's farewell dinner, saddening Bolin as he knew it was goodbye. At dinner, he told Opal he would always think of her whenever he ate kale, noting his upset over her leaving as they were getting to know each other. Though they would be able to visit the Northern Air Temple eventually, he knew it was still in the future. After taking a bite of kale from Opal, he declined relationship advice from Varrick. At Suyin's call, the earthbender raised his glass in a toast to the airbender, and later waved a sad goodbye as she departed. Bolin was comforted by Korra as he walked away.",
      "links": [],
      "text": "Sometime later, Bolin was set up with Wei for a practice spar, but again could not metalbend. His meteorite was knocked out his hands by his opponent, who told him a \"trial by fire\" was the best way to learn. He dodged an attack and resorted to using a pebble to strike Wei, prompting Mako to complement him but also question if he was supposed to be using metal instead of earth. Bolin responded by saying metalbending was hard to get right away, if one could do so at all because the art was not normal. Upon seeing Korra defeat Wing with the art, he remarked she was not normal because she was the Avatar. Asami soon advised them to clean up for Opal's farewell dinner, saddening Bolin as he knew it was goodbye. At dinner, he told Opal he would always think of her whenever he ate kale, noting his upset over her leaving as they were getting to know each other. Though they would be able to visit the Northern Air Temple eventually, he knew it was still in the future. After taking a bite of kale from Opal, he declined relationship advice from Varrick. At Suyin's call, the earthbender raised his glass in a toast to the airbender, and later waved a sad goodbye as she departed. Bolin was comforted by Korra as he walked away."
    },
    {
      "body": "${link_0} launched a pebble at ${link_1} to temporarily stun her bending long enough for ${link_2} and ${link_3} to rescue ${link_4}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_1}",
          "target": {
            "href": "P%27Li",
            "page": "P%27Li"
          }
        },
        {
          "body": "Lin",
          "key": "${link_2}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Suyin",
          "key": "${link_3}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "Korra",
          "key": "${link_4}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Bolin launched a pebble at P'Li to temporarily stun her bending long enough for Lin and Suyin to rescue Korra."
    },
    {
      "body": "That night, Bolin was stirred from his sleep when Pabu began squealing and looking out the bedroom window at something. Seeing nothing, he told his pet to go back to sleep and laid back down. Moments later, he was jumped on by the fire ferret and watched him go to the window. At first, the earthbender told him it was not playtime, but he soon saw the Red Lotus taking Korra. His shouts awoke Mako and the brothers went outside to free her. His attack was broken by ${link_0} and he shielded himself and Mako from their counterattacks. They hid behind a pillar while the guards spotlighted their enemies. They were hit by an angled combustion shot by ${link_1}, landing them in front of Asami, who had just emerged from her room. They watched as the guards, Lin, Suyin, Wing, and Wei attacked the criminals and surrounded them, only for ${link_2} to separate the groups with a pool of lava. Bolin was dazzled but also realized the threat they faced, remarking the ${link_3} to be \"awesome...-ly not good for [them].\" He, Mako, Lin, and Asami hid behind a piece of the metal ground decor, occasionally emerging to attack the foursome but to no avail. They were nearly hit again by combustion, but Suyin and her twin sons stopped the attack by bending another piece of metal to them for shielding. The half-siblings came up with a rescue plan by dropping in from the dome on cables. Needing someone to stop P'Li's attacks, Bolin, much to his dismay, was picked to be the attacker. Once the Beifongs and the twins were in position, the earthbender tried to strike, but could not find a clean shot. As the Beifongs descended from the dome despite Mako warning they were not ready, Bolin had to take his shot. He fired a pebble which directly struck P'Li's third eye, disabling her combustion ability, much to his happiness. The group ducked as Zaheer and his associates fled under a cloud of dust. After Korra was rescued, Bolin and the team returned to Suyin's office as Korra was treated for paralysis caused by ${link_4}.",
      "links": [
        {
          "body": "Ming-Hua",
          "key": "${link_0}",
          "target": {
            "href": "Ming-Hua",
            "page": "Ming-Hua"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_1}",
          "target": {
            "href": "P%27Li",
            "page": "P%27Li"
          }
        },
        {
          "body": "Ghazan",
          "key": "${link_2}",
          "target": {
            "href": "Ghazan",
            "page": "Ghazan"
          }
        },
        {
          "body": "lavabending",
          "key": "${link_3}",
          "target": {
            "href": "Lavabending",
            "page": "Lavabending"
          }
        },
        {
          "body": "shirshu-spit darts",
          "key": "${link_4}",
          "target": {
            "href": "Shirshu-spit_darts",
            "page": "Shirshu-spit_darts"
          }
        }
      ],
      "text": "That night, Bolin was stirred from his sleep when Pabu began squealing and looking out the bedroom window at something. Seeing nothing, he told his pet to go back to sleep and laid back down. Moments later, he was jumped on by the fire ferret and watched him go to the window. At first, the earthbender told him it was not playtime, but he soon saw the Red Lotus taking Korra. His shouts awoke Mako and the brothers went outside to free her. His attack was broken by Ming-Hua and he shielded himself and Mako from their counterattacks. They hid behind a pillar while the guards spotlighted their enemies. They were hit by an angled combustion shot by P'Li, landing them in front of Asami, who had just emerged from her room. They watched as the guards, Lin, Suyin, Wing, and Wei attacked the criminals and surrounded them, only for Ghazan to separate the groups with a pool of lava. Bolin was dazzled but also realized the threat they faced, remarking the lavabending to be \"awesome...-ly not good for [them].\" He, Mako, Lin, and Asami hid behind a piece of the metal ground decor, occasionally emerging to attack the foursome but to no avail. They were nearly hit again by combustion, but Suyin and her twin sons stopped the attack by bending another piece of metal to them for shielding. The half-siblings came up with a rescue plan by dropping in from the dome on cables. Needing someone to stop P'Li's attacks, Bolin, much to his dismay, was picked to be the attacker. Once the Beifongs and the twins were in position, the earthbender tried to strike, but could not find a clean shot. As the Beifongs descended from the dome despite Mako warning they were not ready, Bolin had to take his shot. He fired a pebble which directly struck P'Li's third eye, disabling her combustion ability, much to his happiness. The group ducked as Zaheer and his associates fled under a cloud of dust. After Korra was rescued, Bolin and the team returned to Suyin's office as Korra was treated for paralysis caused by shirshu-spit darts."
    },
    {
      "body": "Having realized a guard was likely responsible for the gang's penetration, namely ${link_0}, Bolin joined the team and Aiwei on a search of the guard's house, looking in his oven and cabinets and taking two cookies. When evidence was discovered, Bolin joined the rest of the group as they discussed their plan of action, ultimately deciding to wait to question at Aiwei's suggestion that he would break eventually. At the scene of the attack, the members of the team wondered about the evidence, Mako unsure of Hong Li's guilt, when they were surprised by Varrick. He watched in disgust with the rest of the team as Zhu Li rubbed pumice stones on his feet. Afterward, the industrialist explained what one planning a conspiracy would do: tell everyone a person was guilty and plant evidence on them. Bolin wondered who could be framing the guard, to which his brother realized it was the only one who could keep a secret: Aiwei.",
      "links": [
        {
          "body": "Hong Li",
          "key": "${link_0}",
          "target": {
            "href": "Hong_Li",
            "page": "Hong_Li"
          }
        }
      ],
      "text": "Having realized a guard was likely responsible for the gang's penetration, namely Hong Li, Bolin joined the team and Aiwei on a search of the guard's house, looking in his oven and cabinets and taking two cookies. When evidence was discovered, Bolin joined the rest of the group as they discussed their plan of action, ultimately deciding to wait to question at Aiwei's suggestion that he would break eventually. At the scene of the attack, the members of the team wondered about the evidence, Mako unsure of Hong Li's guilt, when they were surprised by Varrick. He watched in disgust with the rest of the team as Zhu Li rubbed pumice stones on his feet. Afterward, the industrialist explained what one planning a conspiracy would do: tell everyone a person was guilty and plant evidence on them. Bolin wondered who could be framing the guard, to which his brother realized it was the only one who could keep a secret: Aiwei."
    },
    {
      "body": "${link_0} and ${link_1} discovered a hidden room behind a bookshelf in ${link_2}'s house.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Aiwei",
          "key": "${link_2}",
          "target": {
            "href": "Aiwei",
            "page": "Aiwei"
          }
        }
      ],
      "text": "Bolin and Team Avatar discovered a hidden room behind a bookshelf in Aiwei's house."
    },
    {
      "body": "Outside Aiwei's home, Bolin peeked through the windows to see no one home. He suggested Aiwei was likely out or could have even been invisible, though when Mako expressed annoyance, he went back to \"just not home\". They entered the house in search of evidence. Bolin picked a stylized jar off a bookshelf, to which Mako told him not to move anything, lest they get discovered. Mako had to replace it for the earthbender as he did not remember where it went. This, however, led to the discovery of scuff marks in the floor. They soon realized the bookshelf slid open to reveal a secret passageway. Bolin believed it could be a storage cellar, but Mako countered it was the entryway for the Red Lotus. Asami promptly warned the group of Aiwei's return, but they were caught before they could leave. Bolin gave a weak explanation, saying they knocked and heard him say \"Come in! I'm in the bathroom!\" in a high-pitched voice, but stopped because he knew Aiwei realized he was lying and that he did not sound like that. After Korra gave the correct explanation, Aiwei sat them down for a tea and talk. As the emissary realized he was being suspected, he began his escape by raising a metal wall. Korra bent a hole in it and led them through to the passageway, only for them to find a bomb, which promptly detonated. Bolin, Asami, and Mako were kept unharmed as Korra raised an air sphere around them for shielding. He and the Avatar used their earthbending to clear the rubble around Aiwei's escape tunnel before Lin and Suyin came down to find out what happened.",
      "links": [],
      "text": "Outside Aiwei's home, Bolin peeked through the windows to see no one home. He suggested Aiwei was likely out or could have even been invisible, though when Mako expressed annoyance, he went back to \"just not home\". They entered the house in search of evidence. Bolin picked a stylized jar off a bookshelf, to which Mako told him not to move anything, lest they get discovered. Mako had to replace it for the earthbender as he did not remember where it went. This, however, led to the discovery of scuff marks in the floor. They soon realized the bookshelf slid open to reveal a secret passageway. Bolin believed it could be a storage cellar, but Mako countered it was the entryway for the Red Lotus. Asami promptly warned the group of Aiwei's return, but they were caught before they could leave. Bolin gave a weak explanation, saying they knocked and heard him say \"Come in! I'm in the bathroom!\" in a high-pitched voice, but stopped because he knew Aiwei realized he was lying and that he did not sound like that. After Korra gave the correct explanation, Aiwei sat them down for a tea and talk. As the emissary realized he was being suspected, he began his escape by raising a metal wall. Korra bent a hole in it and led them through to the passageway, only for them to find a bomb, which promptly detonated. Bolin, Asami, and Mako were kept unharmed as Korra raised an air sphere around them for shielding. He and the Avatar used their earthbending to clear the rubble around Aiwei's escape tunnel before Lin and Suyin came down to find out what happened."
    },
    {
      "body": "Regathering in Suyin's office, Bolin stood by as Korra and Lin argued over the potential search for the group, and was led to believe they would be leaving Zaofu when Suyin agreed with her half-sibling about ensuring Korra's safety. Later, however, they were again approached by the matriarch, who informed the team she had a fully-loaded jeep for them to use in a search for Aiwei. As a confused Bolin tried to speak up, Suyin explained that her agreement was merely to let Lin hear what she wanted and to buy them time to leave. Bolin joined Mako and Asami in the vehicle while Korra rode on Naga, beginning their search.",
      "links": [],
      "text": "Regathering in Suyin's office, Bolin stood by as Korra and Lin argued over the potential search for the group, and was led to believe they would be leaving Zaofu when Suyin agreed with her half-sibling about ensuring Korra's safety. Later, however, they were again approached by the matriarch, who informed the team she had a fully-loaded jeep for them to use in a search for Aiwei. As a confused Bolin tried to speak up, Suyin explained that her agreement was merely to let Lin hear what she wanted and to buy them time to leave. Bolin joined Mako and Asami in the vehicle while Korra rode on Naga, beginning their search."
    },
    {
      "body": "With Naga's tracking abilities, the team followed Aiwei's trail to just outside the ${link_0} and made their way to a tavern, hoping to find information on his whereabouts. There, Bolin saw a poster of himself, believing it to be a promotional one for his mover, but Mako corrected him; they were actually wanted posters issued by the Earth Queen because they had freed her airbenders. They soon noticed the patrons threatening them, prompting the team to leave.",
      "links": [
        {
          "body": "Misty Palms Oasis",
          "key": "${link_0}",
          "target": {
            "href": "Misty_Palms_Oasis",
            "page": "Misty_Palms_Oasis"
          }
        }
      ],
      "text": "With Naga's tracking abilities, the team followed Aiwei's trail to just outside the Misty Palms Oasis and made their way to a tavern, hoping to find information on his whereabouts. There, Bolin saw a poster of himself, believing it to be a promotional one for his mover, but Mako corrected him; they were actually wanted posters issued by the Earth Queen because they had freed her airbenders. They soon noticed the patrons threatening them, prompting the team to leave."
    },
    {
      "body": "${link_0} and ${link_1} donned yellow ponchos in order to enter the ${link_2} undercover.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Misty Palms Oasis",
          "key": "${link_2}",
          "target": {
            "href": "Misty_Palms_Oasis",
            "page": "Misty_Palms_Oasis"
          }
        }
      ],
      "text": "Bolin and Mako donned yellow ponchos in order to enter the Misty Palms Oasis undercover."
    },
    {
      "body": "On the oasis' outskirts, Team Avatar found Aiwei's jeep. Mako decided he and Bolin would investigate the oasis; the earthbender was excited by his brother's police talk. He also suggested they disguise themselves, which they did with a pair of yellow ponchos and glasses. Bolin made a fake backstory from himself as ex-United Forces operative Ting-Ting who had found love in a woman named Ivy, but lost her to his archenemy, Dr. Razor. Mako cut him off and had them proceed. Bolin tried to give Mako a backstory, but was rebuffed. In the village, they first spoke with a tavern owner, providing him a physical description of Aiwei. After being told their description matched Aiwei's and that someone had visited the tavern last night, dismissing his claim of having the best drinks as a lie, the brothers realized Aiwei had been through there, but the owner told them that he did not know where he was but sadly admitted Aiwei was right about his drinks being terrible. Outside another tavern, Bolin tried to bond with a spirit, but was bit by it. He soon saw ${link_0} eyeing him, prompting the earthbender to believe they were bounty hunters who had recognized him. After telling Mako his suspicions, the brothers ran, ducking into an alley behind a couple of crates. Just as Mako suggested they head back, Bolin spotted Aiwei and pulled his sibling back into hiding, pointing out the emissary and suggesting they follow him. They quietly tracked him to room 102 of the ${link_1}. At Mako's suggestion, the earthbender kept an eye out while the former told Korra and Asami of their findings.",
      "links": [
        {
          "body": "two individuals",
          "key": "${link_0}",
          "target": {
            "href": "Macao_and_Lily",
            "page": "Macao_and_Lily"
          }
        },
        {
          "body": "Misty Palms Inn",
          "key": "${link_1}",
          "target": {
            "href": "Misty_Palms_Inn",
            "page": "Misty_Palms_Inn"
          }
        }
      ],
      "text": "On the oasis' outskirts, Team Avatar found Aiwei's jeep. Mako decided he and Bolin would investigate the oasis; the earthbender was excited by his brother's police talk. He also suggested they disguise themselves, which they did with a pair of yellow ponchos and glasses. Bolin made a fake backstory from himself as ex-United Forces operative Ting-Ting who had found love in a woman named Ivy, but lost her to his archenemy, Dr. Razor. Mako cut him off and had them proceed. Bolin tried to give Mako a backstory, but was rebuffed. In the village, they first spoke with a tavern owner, providing him a physical description of Aiwei. After being told their description matched Aiwei's and that someone had visited the tavern last night, dismissing his claim of having the best drinks as a lie, the brothers realized Aiwei had been through there, but the owner told them that he did not know where he was but sadly admitted Aiwei was right about his drinks being terrible. Outside another tavern, Bolin tried to bond with a spirit, but was bit by it. He soon saw two individuals eyeing him, prompting the earthbender to believe they were bounty hunters who had recognized him. After telling Mako his suspicions, the brothers ran, ducking into an alley behind a couple of crates. Just as Mako suggested they head back, Bolin spotted Aiwei and pulled his sibling back into hiding, pointing out the emissary and suggesting they follow him. They quietly tracked him to room 102 of the Misty Palms Inn. At Mako's suggestion, the earthbender kept an eye out while the former told Korra and Asami of their findings."
    },
    {
      "body": "Just as ${link_0} was about to beat ${link_1}, ${link_2} ruined the game.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Pabu",
          "key": "${link_2}",
          "target": {
            "href": "Pabu",
            "page": "Pabu"
          }
        }
      ],
      "text": "Just as Bolin was about to beat Asami, Pabu ruined the game."
    },
    {
      "body": "The four tried to request the room across from Aiwei's at the inn, but the ${link_0} initially denied them service because teenagers had previously trashed another room. They were soon spotted by the two figures from earlier and all took an attacking stance, but the people turned out to actually be fans of Bolin's movers and asked him for his autograph. Somewhat unnerved, Bolin consented and signed a poster from the Nuktuk chronicles while also being presented with a squeaky Nuktuk doll. His status prompted the innkeeper to grant them a room after all. Much to Bolin's dismay, the room across from Aiwei's was small, leaving the four, Naga, and Pabu cramped. He remarked the room was not perfect and was also smacked by Naga's tail. Bored by the stakeout process, he looked through the small chest of drawers, found a ${link_1} board, and asked Mako if he wanted to play, but was turned down. Asami, however, accepted the offer, but Bolin bragged about his learning of the street variation with Shady Shin, believing the game would not be fair. Asami, however, remained insistent on playing as she had learned from her dad, and the two were locked in a \"Pai Sho-down\". Mid-game, Bolin wondered why the game was progressing slowly, believing Pai Sho to be a fast-paced game of chance. He pulled out a rulebook, reading off the game's origins of both strategy and chance, confusing him. When they learned the game had countless variations, Bolin suggested Korra establish official rules, though was given a sarcastic response, which he still remarked as \"cool\". As his brother and the Avatar suggested they find out who Zaheer was and what he wanted by spying, the earthbender remarked it was like Pai Sho, as he read in the rulebook one needed to know their opponent to win. At that moment though, Asami made the winning move against him. Over the next few hours, Bolin was repeatedly beaten and tried to add more games, going as far as best seventeen out of thirty-three. Just as he believed he finally had a chance to win, however, Pabu jumped on the board and sent the game pieces flying, distressing Bolin.",
      "links": [
        {
          "body": "innkeeper",
          "key": "${link_0}",
          "target": {
            "href": "Innkeeper",
            "page": "Innkeeper"
          }
        },
        {
          "body": "Pai Sho",
          "key": "${link_1}",
          "target": {
            "href": "Pai_Sho",
            "page": "Pai_Sho"
          }
        }
      ],
      "text": "The four tried to request the room across from Aiwei's at the inn, but the innkeeper initially denied them service because teenagers had previously trashed another room. They were soon spotted by the two figures from earlier and all took an attacking stance, but the people turned out to actually be fans of Bolin's movers and asked him for his autograph. Somewhat unnerved, Bolin consented and signed a poster from the Nuktuk chronicles while also being presented with a squeaky Nuktuk doll. His status prompted the innkeeper to grant them a room after all. Much to Bolin's dismay, the room across from Aiwei's was small, leaving the four, Naga, and Pabu cramped. He remarked the room was not perfect and was also smacked by Naga's tail. Bored by the stakeout process, he looked through the small chest of drawers, found a Pai Sho board, and asked Mako if he wanted to play, but was turned down. Asami, however, accepted the offer, but Bolin bragged about his learning of the street variation with Shady Shin, believing the game would not be fair. Asami, however, remained insistent on playing as she had learned from her dad, and the two were locked in a \"Pai Sho-down\". Mid-game, Bolin wondered why the game was progressing slowly, believing Pai Sho to be a fast-paced game of chance. He pulled out a rulebook, reading off the game's origins of both strategy and chance, confusing him. When they learned the game had countless variations, Bolin suggested Korra establish official rules, though was given a sarcastic response, which he still remarked as \"cool\". As his brother and the Avatar suggested they find out who Zaheer was and what he wanted by spying, the earthbender remarked it was like Pai Sho, as he read in the rulebook one needed to know their opponent to win. At that moment though, Asami made the winning move against him. Over the next few hours, Bolin was repeatedly beaten and tried to add more games, going as far as best seventeen out of thirty-three. Just as he believed he finally had a chance to win, however, Pabu jumped on the board and sent the game pieces flying, distressing Bolin."
    },
    {
      "body": "${link_0} and ${link_1} were subdued by ${link_2}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Ming-Hua",
          "key": "${link_2}",
          "target": {
            "href": "Ming-Hua",
            "page": "Ming-Hua"
          }
        }
      ],
      "text": "Bolin and Mako were subdued by Ming-Hua."
    },
    {
      "body": "Near sundown, after no break in the stakeout, Korra decided to confront Aiwei directly, the others trying to stop her. They instead found Aiwei meditating, which Bolin thought was just \"a weird way to nap\" before being corrected by Korra. After she realized he was in the Spirit World and meditated in herself, the three kept watch over her physical form. After nightfall, they saw Ming-Hua and Ghazan approaching. Bolin tried to get Korra up, but to no avail. Asami rushed the Avatar to safety while the brothers tried to hold the criminals off. The earthbender took on Ghazan, driving him back initially with a slab of rock, only to have it blasted back at him in the form of lava. In trying to combat the lavabender with blasts and defenses of earth, Bolin realized it was an impossible fight because he was simply giving Ghazan ammo for the lava attacks. He tried a small mountain of earth as an attack, but Ghazan merely turned that into lava and countered with three balls of the molten rock, prompting the younger sibling to jump into the pool while dodging the blasts. However, he was soon trapped by in a sphere of water by Ming-Hua. He and Mako were taken to the Red Lotus' camp, where Zaheer ordered them to be loaded onto a truck and taken with them to Ba Sing Se.",
      "links": [],
      "text": "Near sundown, after no break in the stakeout, Korra decided to confront Aiwei directly, the others trying to stop her. They instead found Aiwei meditating, which Bolin thought was just \"a weird way to nap\" before being corrected by Korra. After she realized he was in the Spirit World and meditated in herself, the three kept watch over her physical form. After nightfall, they saw Ming-Hua and Ghazan approaching. Bolin tried to get Korra up, but to no avail. Asami rushed the Avatar to safety while the brothers tried to hold the criminals off. The earthbender took on Ghazan, driving him back initially with a slab of rock, only to have it blasted back at him in the form of lava. In trying to combat the lavabender with blasts and defenses of earth, Bolin realized it was an impossible fight because he was simply giving Ghazan ammo for the lava attacks. He tried a small mountain of earth as an attack, but Ghazan merely turned that into lava and countered with three balls of the molten rock, prompting the younger sibling to jump into the pool while dodging the blasts. However, he was soon trapped by in a sphere of water by Ming-Hua. He and Mako were taken to the Red Lotus' camp, where Zaheer ordered them to be loaded onto a truck and taken with them to Ba Sing Se."
    },
    {
      "body": "${link_0} was told by ${link_1} not to befriend the ${link_2}, as the ${link_3} was amusing himself by making up background stories regarding ${link_4}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_2}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "earthbender",
          "key": "${link_3}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Ghazan",
          "key": "${link_4}",
          "target": {
            "href": "Ghazan",
            "page": "Ghazan"
          }
        }
      ],
      "text": "Bolin was told by Mako not to befriend the Red Lotus, as the earthbender was amusing himself by making up background stories regarding Ghazan."
    },
    {
      "body": "Aboard the truck with the Red Lotus members, Bolin and Mako were tied together in the back under supervision of Ghazan and Ming-Hua. He asked them how they dealt with being imprisoned for so long, as he imagined it to have been boring. Hearing about how Ming-Hua killed her time by making up background stories about her guards, Bolin gave it a shot himself and suggested that Ghazan had been raised by an older sister, had his mustache growing in when he was ten, and that there was an \"unspoken attraction\" between the lavabender and the waterbender, to which an amused Ghazan admitted that he got two out of three right. At that moment, Mako told Bolin to stop trying to make friends with them. Upon the Red Lotus' arrival at Ba Sing Se, the brothers were gagged and subsequently presented before the Earth Queen, who ordered the Dai Li to send them to the palace dungeon.",
      "links": [],
      "text": "Aboard the truck with the Red Lotus members, Bolin and Mako were tied together in the back under supervision of Ghazan and Ming-Hua. He asked them how they dealt with being imprisoned for so long, as he imagined it to have been boring. Hearing about how Ming-Hua killed her time by making up background stories about her guards, Bolin gave it a shot himself and suggested that Ghazan had been raised by an older sister, had his mustache growing in when he was ten, and that there was an \"unspoken attraction\" between the lavabender and the waterbender, to which an amused Ghazan admitted that he got two out of three right. At that moment, Mako told Bolin to stop trying to make friends with them. Upon the Red Lotus' arrival at Ba Sing Se, the brothers were gagged and subsequently presented before the Earth Queen, who ordered the Dai Li to send them to the palace dungeon."
    },
    {
      "body": "Sitting dejectedly in his cell, Bolin was convinced by Mako to try metalbending them out of there by saying the need to free Korra was the motivation Bolin had lacked before to unlock his inherent ability to perform the art. Encouraged by Mako and a supporting chant from their fellow prisoners, Bolin tried to bend the cell door open, but to no avail, leaving him to sag to the floor in sadness.",
      "links": [],
      "text": "Sitting dejectedly in his cell, Bolin was convinced by Mako to try metalbending them out of there by saying the need to free Korra was the motivation Bolin had lacked before to unlock his inherent ability to perform the art. Encouraged by Mako and a supporting chant from their fellow prisoners, Bolin tried to bend the cell door open, but to no avail, leaving him to sag to the floor in sadness."
    },
    {
      "body": "${link_0} was encouraged by ${link_1} to try ${link_2} them out of prison one more time.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "metalbending",
          "key": "${link_2}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        }
      ],
      "text": "Bolin was encouraged by Mako to try metalbending them out of prison one more time."
    },
    {
      "body": "While still in their cell, the brothers heard Zaheer announce over the communications system that he and his associates had taken out the Earth Queen. With Korra being Zaheer's next target, Bolin was urged to try metalbending again, assured by Mako it was \"really\" his time. As he shot his fist forward, all the cell doors opened except for theirs, making the earthbender believe he had metalbent, only to be told by Mako that he had not been responsible for freeing everyone. The brothers were subsequently approached by Zaheer, who threw them to the back of their cell with an air blast, before informing them that they would be released in order to be able to give a message to Korra.",
      "links": [],
      "text": "While still in their cell, the brothers heard Zaheer announce over the communications system that he and his associates had taken out the Earth Queen. With Korra being Zaheer's next target, Bolin was urged to try metalbending again, assured by Mako it was \"really\" his time. As he shot his fist forward, all the cell doors opened except for theirs, making the earthbender believe he had metalbent, only to be told by Mako that he had not been responsible for freeing everyone. The brothers were subsequently approached by Zaheer, who threw them to the back of their cell with an air blast, before informing them that they would be released in order to be able to give a message to Korra."
    },
    {
      "body": "Afterward, Bolin and Mako left the prison to find the city in chaos and looting rampant. Bolin asked if they should do something, but was told by Mako it was not their battle; they instead needed to deliver Zaheer's message to Korra. He expressed his doubt about their journey to get out of Ba Sing Se and scour the desert. After Mako suggested finding an ${link_0}, they made their way to one docked outside the palace, only to find looters scouring it for parts. Bolin was able to lure them out by saying the queen's gold was on the third floor of the palace and subsequently took the controls of the vehicle, despite some key parts having been stolen and his unfamiliarity with how to fly it. After initially struggling to get the ship airborne, he found the proper controls and the two took off.",
      "links": [
        {
          "body": "airship",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se_airship",
            "page": "Ba_Sing_Se_airship"
          }
        }
      ],
      "text": "Afterward, Bolin and Mako left the prison to find the city in chaos and looting rampant. Bolin asked if they should do something, but was told by Mako it was not their battle; they instead needed to deliver Zaheer's message to Korra. He expressed his doubt about their journey to get out of Ba Sing Se and scour the desert. After Mako suggested finding an airship, they made their way to one docked outside the palace, only to find looters scouring it for parts. Bolin was able to lure them out by saying the queen's gold was on the third floor of the palace and subsequently took the controls of the vehicle, despite some key parts having been stolen and his unfamiliarity with how to fly it. After initially struggling to get the ship airborne, he found the proper controls and the two took off."
    },
    {
      "body": "Unable to convince ${link_0} to evacuate her home, ${link_1} swung her over his shoulders to save her from the fire.",
      "links": [
        {
          "body": "his grandmother",
          "key": "${link_0}",
          "target": {
            "href": "Yin",
            "page": "Yin"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        }
      ],
      "text": "Unable to convince his grandmother to evacuate her home, Bolin swung her over his shoulders to save her from the fire."
    },
    {
      "body": "As the two saw the entire city burning, Bolin realized their family was in danger. He was shoved away from the controls by Mako and asked if his brother knew the controls better \"because [he] dated Asami\". After Mako lowered the airship to their family's roof, Bolin went in to rescue them. However, he initially could not get them out as Yin declared she would not leave her home, the place where she raised her family, instead offering Bolin ${link_0}. Knowing they had no time, Bolin told his grandmother one thing he and Mako learned on the streets; if one was around their family, they would always be at home. After this failed to convince Yin, he decided to lift her up on his shoulders and tell the family to move out, which finally prompted his grandmother to concede and leave with him. Once they were all on the airship, Bolin took the controls and guided them out of Ba Sing Se.",
      "links": [
        {
          "body": "tea",
          "key": "${link_0}",
          "target": {
            "href": "Tea",
            "page": "Tea"
          }
        }
      ],
      "text": "As the two saw the entire city burning, Bolin realized their family was in danger. He was shoved away from the controls by Mako and asked if his brother knew the controls better \"because [he] dated Asami\". After Mako lowered the airship to their family's roof, Bolin went in to rescue them. However, he initially could not get them out as Yin declared she would not leave her home, the place where she raised her family, instead offering Bolin tea. Knowing they had no time, Bolin told his grandmother one thing he and Mako learned on the streets; if one was around their family, they would always be at home. After this failed to convince Yin, he decided to lift her up on his shoulders and tell the family to move out, which finally prompted his grandmother to concede and leave with him. Once they were all on the airship, Bolin took the controls and guided them out of Ba Sing Se."
    },
    {
      "body": "After several hours of searching for Korra, Tu found pieces of her wrecked airship and a trail which led them to the Misty Palms Oasis. After a rough landing, Bolin remarked the procedure was hard. Once in the oasis, Bolin suggested the group split up into teams and scour the town. When he realized Pabu had climbed onto his shoulders and after simply saying they would need his help, he stopped and excitedly greeted the ferret, hugging and kissing him. After seeing Naga arrive to the scene, Bolin caught sight of Asami and Korra; the earthbender tightly hugged the former, slightly lifting her into the air. Upon seeing Lord ${link_0}, Bolin was starstruck, but soon bowed respectfully as Mako declared their honor to meet him. Afterward, he helped explain to Korra and Asami their capture and the dire terms surrounding their release: to deliver a message that Zaheer was threatening the airbenders at the Northern Air Temple unless she turned herself over. With no suitable radio nearby, the group returned to Zaofu to seek solid communication.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "After several hours of searching for Korra, Tu found pieces of her wrecked airship and a trail which led them to the Misty Palms Oasis. After a rough landing, Bolin remarked the procedure was hard. Once in the oasis, Bolin suggested the group split up into teams and scour the town. When he realized Pabu had climbed onto his shoulders and after simply saying they would need his help, he stopped and excitedly greeted the ferret, hugging and kissing him. After seeing Naga arrive to the scene, Bolin caught sight of Asami and Korra; the earthbender tightly hugged the former, slightly lifting her into the air. Upon seeing Lord Zuko, Bolin was starstruck, but soon bowed respectfully as Mako declared their honor to meet him. Afterward, he helped explain to Korra and Asami their capture and the dire terms surrounding their release: to deliver a message that Zaheer was threatening the airbenders at the Northern Air Temple unless she turned herself over. With no suitable radio nearby, the group returned to Zaofu to seek solid communication."
    },
    {
      "body": "${link_0} grew frustrated with ${link_1} as he was unable to get through to the young ${link_2}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Meelo",
          "key": "${link_1}",
          "target": {
            "href": "Meelo",
            "page": "Meelo"
          }
        },
        {
          "body": "airbender",
          "key": "${link_2}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Bolin grew frustrated with Meelo as he was unable to get through to the young airbender."
    },
    {
      "body": "At Zaofu, the group learned Suyin and her guards had found a signal at the Northern Air Temple, but were not getting any answers. When Korra went to meditate and attempt to find Zaheer in the Spirit World, Bolin said he and Mako would stay behind to assist with communication. They ultimately got through, but Bolin was frustrated in speaking to Meelo as the child remarked Bolin was not there. He instead told the young airbender to get Tenzin, but was soon sidetracked when told about the family finding a herd of baby bison. Korra subsequently shoved the earthbender out of the way and took over the conversation.",
      "links": [],
      "text": "At Zaofu, the group learned Suyin and her guards had found a signal at the Northern Air Temple, but were not getting any answers. When Korra went to meditate and attempt to find Zaheer in the Spirit World, Bolin said he and Mako would stay behind to assist with communication. They ultimately got through, but Bolin was frustrated in speaking to Meelo as the child remarked Bolin was not there. He instead told the young airbender to get Tenzin, but was soon sidetracked when told about the family finding a herd of baby bison. Korra subsequently shoved the earthbender out of the way and took over the conversation."
    },
    {
      "body": "A whimpering ${link_0} hugged ${link_1} before she split from ${link_2} to surrender herself to the ${link_3}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_3}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        }
      ],
      "text": "A whimpering Bolin hugged Korra before she split from Team Avatar to surrender herself to the Red Lotus."
    },
    {
      "body": "On board a Zaofu airship, Bolin stood with his friends and allies as they discussed a plan to ambush the Red Lotus. He suggested disguising himself as a hiker and distracting the Red Lotus with bird calls which he demonstrated, earning weird looks from his allies and a dismissal from Mako, which the earthbender rebutted by saying he had not heard any good plan from him. He was left shocked when Korra suggested surrendering herself. While Korra was radioing Zaheer, Bolin was pacing around the airship, fearful for Opal and upset he did not have Pabu to comfort him; he added his hope that the ferret and Naga were all right in Zaofu. After Korra's discussion with Zaheer was complete, Bolin and the others were informed of his new terms: she would go to ${link_0}'s Peak at noon on her own and the airbenders would be released upon her surrender. Suyin decided to set up a plan of attack with their numbers advantage, telling Bolin to go with Mako and Asami on the airship to the temple to retrieve the airbenders while the others would position themselves below the peak. Before separating, a saddened Bolin embraced Korra around her shoulders, resting his head on one of them. As the three approached the air temple, the earthbender was left in awe upon looking at the damage it had sustained.",
      "links": [
        {
          "body": "Laghima",
          "key": "${link_0}",
          "target": {
            "href": "Laghima",
            "page": "Laghima"
          }
        }
      ],
      "text": "On board a Zaofu airship, Bolin stood with his friends and allies as they discussed a plan to ambush the Red Lotus. He suggested disguising himself as a hiker and distracting the Red Lotus with bird calls which he demonstrated, earning weird looks from his allies and a dismissal from Mako, which the earthbender rebutted by saying he had not heard any good plan from him. He was left shocked when Korra suggested surrendering herself. While Korra was radioing Zaheer, Bolin was pacing around the airship, fearful for Opal and upset he did not have Pabu to comfort him; he added his hope that the ferret and Naga were all right in Zaofu. After Korra's discussion with Zaheer was complete, Bolin and the others were informed of his new terms: she would go to Laghima's Peak at noon on her own and the airbenders would be released upon her surrender. Suyin decided to set up a plan of attack with their numbers advantage, telling Bolin to go with Mako and Asami on the airship to the temple to retrieve the airbenders while the others would position themselves below the peak. Before separating, a saddened Bolin embraced Korra around her shoulders, resting his head on one of them. As the three approached the air temple, the earthbender was left in awe upon looking at the damage it had sustained."
    },
    {
      "body": "Upon arrival in a courtyard, Bolin tied the airship down with rope. Ghazan approached them, prompting Bolin and Asami to look at each other with confused looks and eye their foe suspiciously. Nonetheless, they followed Ghazan into the hold where Tenzin and the other airbenders appeared to be kept. They got the go-ahead to retrieve the airbenders once the Avatar had surrendered. Bolin and Asami worked to release Tenzin from his chains. They soon realized, however, that they had been double-crossed; what they believed to be the airbenders were just sacks full of water maintained by Ming-Hua. Mako and Bolin tried to duel the criminals, but the fight was short-lived as Ghazan converted the floor between the duos to lava, trapping the brothers, Asami, and Tenzin. Bolin raised a small wall of earth to try and stop the spreading lava. The airbending master pointed them to another way out, telling the earthbender to open a secret passageway.",
      "links": [],
      "text": "Upon arrival in a courtyard, Bolin tied the airship down with rope. Ghazan approached them, prompting Bolin and Asami to look at each other with confused looks and eye their foe suspiciously. Nonetheless, they followed Ghazan into the hold where Tenzin and the other airbenders appeared to be kept. They got the go-ahead to retrieve the airbenders once the Avatar had surrendered. Bolin and Asami worked to release Tenzin from his chains. They soon realized, however, that they had been double-crossed; what they believed to be the airbenders were just sacks full of water maintained by Ming-Hua. Mako and Bolin tried to duel the criminals, but the fight was short-lived as Ghazan converted the floor between the duos to lava, trapping the brothers, Asami, and Tenzin. Bolin raised a small wall of earth to try and stop the spreading lava. The airbending master pointed them to another way out, telling the earthbender to open a secret passageway."
    },
    {
      "body": "Trapped and desperate, ${link_0} discovered his ability to ${link_1} and stopped the incoming lava.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "lavabend",
          "key": "${link_1}",
          "target": {
            "href": "Lavabending",
            "page": "Lavabending"
          }
        }
      ],
      "text": "Trapped and desperate, Bolin discovered his ability to lavabend and stopped the incoming lava."
    },
    {
      "body": "The four made their way up to a meditation room which contained a door to a spiraling staircase out of the temple. Bolin continued to use his bending throughout to block the rapidly expanding lava while trying to move everyone along quickly. He tried to guide them through a shortcut, but this only led them to the edge of the cliff and left them cornered as the lava continued to close in on them. Bolin charged at the lava and was able to bend it back and stop its expansion, shocked to learn he could lavabend. They were soon retrieved by Kai and hopped on his baby bison, ${link_0}.",
      "links": [
        {
          "body": "Lefty",
          "key": "${link_0}",
          "target": {
            "href": "Lefty",
            "page": "Lefty"
          }
        }
      ],
      "text": "The four made their way up to a meditation room which contained a door to a spiraling staircase out of the temple. Bolin continued to use his bending throughout to block the rapidly expanding lava while trying to move everyone along quickly. He tried to guide them through a shortcut, but this only led them to the edge of the cliff and left them cornered as the lava continued to close in on them. Bolin charged at the lava and was able to bend it back and stop its expansion, shocked to learn he could lavabend. They were soon retrieved by Kai and hopped on his baby bison, Lefty."
    },
    {
      "body": "From there, they were taken to a forest away from the collapsing temple, where they regrouped with their allies. He announced their arrival with a bird call, though fell off Lefty on the landing. When Mako told them about Bolin's lavabending, Suyin complimented the earthbender, telling him he just needed to believe in himself. He remarked being moments from death helped to motivate him, but also praised Kai for getting them to safety. He was disappointed to learn Korra had been taken, however, and shocked that Zaheer had gained the ability of flight, asking Lin if she was sure about what she had seen. Kai told them he had seen the airbenders be taken to a ${link_0} where Red Lotus guards had taken them into. With Oogi having arrived, the group flew over to the cave in question to retrieve the airbenders and Korra.",
      "links": [
        {
          "body": "cave",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomad_caves",
            "page": "Air_Nomad_caves"
          }
        }
      ],
      "text": "From there, they were taken to a forest away from the collapsing temple, where they regrouped with their allies. He announced their arrival with a bird call, though fell off Lefty on the landing. When Mako told them about Bolin's lavabending, Suyin complimented the earthbender, telling him he just needed to believe in himself. He remarked being moments from death helped to motivate him, but also praised Kai for getting them to safety. He was disappointed to learn Korra had been taken, however, and shocked that Zaheer had gained the ability of flight, asking Lin if she was sure about what she had seen. Kai told them he had seen the airbenders be taken to a cave where Red Lotus guards had taken them into. With Oogi having arrived, the group flew over to the cave in question to retrieve the airbenders and Korra."
    },
    {
      "body": "Excited upon seeing ${link_0} again, ${link_1} roughly interrupted ${link_2} and Opal's hug in order to embrace her himself much to Suyin's dismay.",
      "links": [
        {
          "body": "Opal",
          "key": "${link_0}",
          "target": {
            "href": "Opal",
            "page": "Opal"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Suyin",
          "key": "${link_2}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        }
      ],
      "text": "Excited upon seeing Opal again, Bolin roughly interrupted Suyin and Opal's hug in order to embrace her himself much to Suyin's dismay."
    },
    {
      "body": "Kai led them to the cave where he saw the airbenders go. The group, save for Tenzin, entered and quickly ambushed the ${link_0} before releasing the airbenders from the chains in which they were held. Excited to reunite with Opal, Bolin shoved Suyin out of the way and embraced her. The earthbender and Mako promptly joined Tonraq to find Korra, being tipped off to her exact location by Jinora. After the Avatar, who was in the Avatar State due to the effects of a metallic ${link_1}, took off in pursuit of Zaheer, Bolin and Mako dealt with Ghazan and Ming-Hua, respectively.",
      "links": [
        {
          "body": "Red Lotus sentries",
          "key": "${link_0}",
          "target": {
            "href": "Red_Lotus_sentries",
            "page": "Red_Lotus_sentries"
          }
        },
        {
          "body": "poison",
          "key": "${link_1}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        }
      ],
      "text": "Kai led them to the cave where he saw the airbenders go. The group, save for Tenzin, entered and quickly ambushed the Red Lotus sentries before releasing the airbenders from the chains in which they were held. Excited to reunite with Opal, Bolin shoved Suyin out of the way and embraced her. The earthbender and Mako promptly joined Tonraq to find Korra, being tipped off to her exact location by Jinora. After the Avatar, who was in the Avatar State due to the effects of a metallic poison, took off in pursuit of Zaheer, Bolin and Mako dealt with Ghazan and Ming-Hua, respectively."
    },
    {
      "body": "The earthbenders traded shots back and forth before Ghazan hid behind a boulder and charged to throw Bolin to the ground, but he was able to throw Ghazan away and break up two more attacks. Seeing Ghazan smile, Bolin wondered why he was doing so. Being told it was because of the last time they fought and attacked with a surge of lava, the young bender dissipated part of the blow, remarking a lot had changed since, and counterattacked with lava whips, smirking and winking. He was challenged by Ghazan to show what he had before being attacked again.",
      "links": [],
      "text": "The earthbenders traded shots back and forth before Ghazan hid behind a boulder and charged to throw Bolin to the ground, but he was able to throw Ghazan away and break up two more attacks. Seeing Ghazan smile, Bolin wondered why he was doing so. Being told it was because of the last time they fought and attacked with a surge of lava, the young bender dissipated part of the blow, remarking a lot had changed since, and counterattacked with lava whips, smirking and winking. He was challenged by Ghazan to show what he had before being attacked again."
    },
    {
      "body": "Tired of ${link_0}'s ranting, ${link_1} silenced the anarchist with his sock.",
      "links": [
        {
          "body": "Zaheer",
          "key": "${link_0}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        }
      ],
      "text": "Tired of Zaheer's ranting, Bolin silenced the anarchist with his sock."
    },
    {
      "body": "Despite having gained somewhat equal footing with his newfound ability, Bolin was still largely on the defensive, having to run from Ghazan's offensive. After stopping a pool of lava, however, Bolin was joined by Mako, who had just dispatched Ming-Hua, much to his glee. The brothers overwhelmed and cornered their foe. Ghazan, declaring he would not return to prison, decided to try and take them down with him, collapsing the entire cave in with lava and earthbending. Bolin quickly made an earth ramp to get the siblings out. They emerged from the cave just as the airbenders were working to get Korra out of Zaheer's grip, able to save her and throw the criminal airbender to the ground. He, along with Mako, Asami, and Tonraq, ran over to the poisoned Avatar, watching with worry as Suyin attempted to bend the metallic substance out of her. After Korra had been saved, Zaheer began shouting about the revolution and the natural order of chaos, but Bolin took off his sock and stuck it in Zaheer's mouth, remarking he had literally \"put a sock in it\".",
      "links": [],
      "text": "Despite having gained somewhat equal footing with his newfound ability, Bolin was still largely on the defensive, having to run from Ghazan's offensive. After stopping a pool of lava, however, Bolin was joined by Mako, who had just dispatched Ming-Hua, much to his glee. The brothers overwhelmed and cornered their foe. Ghazan, declaring he would not return to prison, decided to try and take them down with him, collapsing the entire cave in with lava and earthbending. Bolin quickly made an earth ramp to get the siblings out. They emerged from the cave just as the airbenders were working to get Korra out of Zaheer's grip, able to save her and throw the criminal airbender to the ground. He, along with Mako, Asami, and Tonraq, ran over to the poisoned Avatar, watching with worry as Suyin attempted to bend the metallic substance out of her. After Korra had been saved, Zaheer began shouting about the revolution and the natural order of chaos, but Bolin took off his sock and stuck it in Zaheer's mouth, remarking he had literally \"put a sock in it\"."
    },
    {
      "body": "Two weeks later, Bolin joined his friends and allies at Jinora's airbending master ceremony, smiling as Tenzin praised Korra for her efforts in restoring and saving the Air Nation and Jinora's for saving the Avatar and the nation as well. He stood and watched as the ceremony was completed with the revealing of Jinora's master ${link_0}.",
      "links": [
        {
          "body": "tattoos",
          "key": "${link_0}",
          "target": {
            "href": "Body_markings_in_the_World_of_Avatar#Airbending_master_tattoos",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Two weeks later, Bolin joined his friends and allies at Jinora's airbending master ceremony, smiling as Tenzin praised Korra for her efforts in restoring and saving the Air Nation and Jinora's for saving the Avatar and the nation as well. He stood and watched as the ceremony was completed with the revealing of Jinora's master tattoos."
    },
    {
      "body": "As ${link_0} said goodbye to ${link_1}, he gave her the first of many letters he intended to write to her.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "As Bolin said goodbye to Korra, he gave her the first of many letters he intended to write to her."
    },
    {
      "body": "After the ceremony, Bolin joined Asami, Mako, Tenzin, and Jinora on the ferry dock to say goodbye to Korra, who was set to board a ship heading toward the Southern Water Tribe. He happily exclaimed that he could not wait for Korra to leave, as he was excited to have her as a pen pal. He proceeded to hand her a first letter and immediately disclosed that it told about how he and Pabu already missed her. As the ship departed, he waved her off, yelling that she should not forget to write. In the following months, he wrote letters to her, reporting on his life. In one of those letters that he wrote while using formal language, he reported that he had found employment with Varrick and Kuvira and had left Republic City to bring balance to the Earth Kingdom. He did not receive a reply, however.",
      "links": [],
      "text": "After the ceremony, Bolin joined Asami, Mako, Tenzin, and Jinora on the ferry dock to say goodbye to Korra, who was set to board a ship heading toward the Southern Water Tribe. He happily exclaimed that he could not wait for Korra to leave, as he was excited to have her as a pen pal. He proceeded to hand her a first letter and immediately disclosed that it told about how he and Pabu already missed her. As the ship departed, he waved her off, yelling that she should not forget to write. In the following months, he wrote letters to her, reporting on his life. In one of those letters that he wrote while using formal language, he reported that he had found employment with Varrick and Kuvira and had left Republic City to bring balance to the Earth Kingdom. He did not receive a reply, however."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Bolin_(late_171_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Bolin_(late_171_AG).html",
    "page": "History_of_Bolin_(late_171_AG)",
    "title": "History of Bolin (late 171 AG)"
  }
}