{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Following the ${link_0}, ${link_1} joined ${link_2}'s ${link_3}, desiring to do his part to stabilize the chaotic ${link_4}. However, when Kuvira denounced ${link_5} ${link_6}'s authority and appointed herself the ruler of the Earth Empire, his loyalty to her is tested by his friends, and he eventually needs to decide if he will fight with her for a united Earth Empire or fight against her with ${link_7} to preserve the balance in the ${link_8}.",
      "links": [
        {
          "body": "insurrection of the Red Lotus",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Insurrection_of_the_Red_Lotus",
            "page": "Insurrection_of_the_Red_Lotus"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "army",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Wu",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Wu",
            "page": "Wu"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "world",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)"
      ],
      "text": "Following the insurrection of the Red Lotus, Bolin joined Kuvira's army, desiring to do his part to stabilize the chaotic Earth Kingdom. However, when Kuvira denounced Earth King Wu's authority and appointed herself the ruler of the Earth Empire, his loyalty to her is tested by his friends, and he eventually needs to decide if he will fight with her for a united Earth Empire or fight against her with Team Avatar to preserve the balance in the world."
    },
    {
      "body": "In the three years following the ${link_0}, Bolin joined up with Kuvira and her army to help reunite the ${link_1} under her control. He also became romantically involved with ${link_2}, though the long distance between them and his support of Kuvira put a strain on their relationship. In 174 ${link_3}, while on a ${link_4} to the state of ${link_5}, he informed ${link_6} that two more states had agreed to join her, bringing them to ninety percent of their goal. He took some celebratory ${link_7} from ${link_8}, though digressed from drinking it with everyone else when Kuvira said she would not celebrate until the mission was complete, causing the beverage to spill on his clothing when the train came to a sudden stop due to bandits having erected a barricade on the tracks.",
      "links": [
        {
          "body": "insurrection of the Red Lotus",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Insurrection_of_the_Red_Lotus",
            "page": "Insurrection_of_the_Red_Lotus"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Opal",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Opal",
            "page": "Opal"
          }
        },
        {
          "body": "AG",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "train",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Train",
            "page": "Train"
          }
        },
        {
          "body": "Yi",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Yi",
            "page": "Yi"
          }
        },
        {
          "body": "Baatar Jr.",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Baatar_Jr",
            "page": "Baatar_Jr"
          }
        },
        {
          "body": "tea",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Tea",
            "page": "Tea"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Annexation of Yi"
      ],
      "text": "In the three years following the insurrection of the Red Lotus, Bolin joined up with Kuvira and her army to help reunite the Earth Kingdom under her control. He also became romantically involved with Opal, though the long distance between them and his support of Kuvira put a strain on their relationship. In 174 AG, while on a train to the state of Yi, he informed Baatar Jr. that two more states had agreed to join her, bringing them to ninety percent of their goal. He took some celebratory tea from Varrick, though digressed from drinking it with everyone else when Kuvira said she would not celebrate until the mission was complete, causing the beverage to spill on his clothing when the train came to a sudden stop due to bandits having erected a barricade on the tracks."
    },
    {
      "body": "After Kuvira handled the bandits, the group arrived at the capital of Yi where Bolin was called out to by ${link_0}, prompting him to dash over and hug him warmly, remarking he had grown up and gotten much heavier since he last saw him. In turn, Kai remarked that his hair made him look like a stiff, a fashion choice the ${link_1} defended by stating that Kuvira had told him it made him look intelligent and professional. When Opal ruffled his hair and told him to not believe everything Kuvira said, Bolin turned and warmly hugged her, expressing his happiness to see her again. However, when Kuvira and Baatar Jr. arrived, Bolin quickly straightened his hair back out and watched nervously as Opal bickered with her brother and Kuvira over the former's betrayal and the latter's taking over of the kingdom. Bolin nervously asked his girlfriend if it was great that her brother and the ${link_2} were getting married, before eyeing the state's ${link_3} in surprise upon noticing the politician's angered look.",
      "links": [
        {
          "body": "Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kai",
            "page": "Kai"
          }
        },
        {
          "body": "earthbender",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "metalbender",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "governor",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Governor_of_Yi",
            "page": "Governor_of_Yi"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Annexation of Yi"
      ],
      "text": "After Kuvira handled the bandits, the group arrived at the capital of Yi where Bolin was called out to by Kai, prompting him to dash over and hug him warmly, remarking he had grown up and gotten much heavier since he last saw him. In turn, Kai remarked that his hair made him look like a stiff, a fashion choice the earthbender defended by stating that Kuvira had told him it made him look intelligent and professional. When Opal ruffled his hair and told him to not believe everything Kuvira said, Bolin turned and warmly hugged her, expressing his happiness to see her again. However, when Kuvira and Baatar Jr. arrived, Bolin quickly straightened his hair back out and watched nervously as Opal bickered with her brother and Kuvira over the former's betrayal and the latter's taking over of the kingdom. Bolin nervously asked his girlfriend if it was great that her brother and the metalbender were getting married, before eyeing the state's governor in surprise upon noticing the politician's angered look."
    },
    {
      "body": "After the governor angrily left the train in which he had a private audience with Kuvira, Bolin received the order to leave Yi, though asked his commander what had happened. Upon receiving the explanation that they were unable to strike a deal with the governor, Bolin started saying his goodbyes to Opal. When she begged him to not turn his back on the people of Yi, he explained that while he wanted to help, he could not stay since the governor wanted them gone. He apologized and tried to hug her, though was pushed away and told to leave. Saddened, Bolin entered the train and left for the state border. When the governor was left with no choice but to submit to Kuvira's role, Bolin and the rest of the army returned by dusk and he happily helped to hand out food to the hungry people of Yi. As he spotted Opal in the crowd, he smiled brightly at her, a blush coloring his cheeks, though he was left saddened when she averted his gaze and retreated, before dejectedly resuming his duties.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Annexation of Yi"
      ],
      "text": "After the governor angrily left the train in which he had a private audience with Kuvira, Bolin received the order to leave Yi, though asked his commander what had happened. Upon receiving the explanation that they were unable to strike a deal with the governor, Bolin started saying his goodbyes to Opal. When she begged him to not turn his back on the people of Yi, he explained that while he wanted to help, he could not stay since the governor wanted them gone. He apologized and tried to hug her, though was pushed away and told to leave. Saddened, Bolin entered the train and left for the state border. When the governor was left with no choice but to submit to Kuvira's role, Bolin and the rest of the army returned by dusk and he happily helped to hand out food to the hungry people of Yi. As he spotted Opal in the crowd, he smiled brightly at her, a blush coloring his cheeks, though he was left saddened when she averted his gaze and retreated, before dejectedly resuming his duties."
    },
    {
      "body": "Bolin and the rest of Kuvira's army arrived at ${link_0} a day before Prince Wu's coronation as the fifty-fourth earth monarch. Entering the ${link_1} with the rest of the officers, Bolin expressed his joy over being back in the city, though his expression promptly fell when he noticed ${link_2} was also staying at the hotel. When the waterbender congratulated him on having replaced her with a threatening-looking girlfriend, referring to Kuvira, Bolin corrected her, telling her she was his boss. Upon seeing ${link_3}, the two brothers traded a mock punch before sharing a hug. As Mako complimented him about having become \"all important\", Bolin admitted that he was not used to seeing himself in that way. Upon being asked what it was like to work for Kuvira, Bolin revealed that it was great, as they were helping people all across the Earth Kingdom. He was surprised to learn that his brother had spent his time working for Wu as opposed to fighting crime in the city. He quickly changed the subject, asking if he had seen ${link_4} yet, though was left worried upon learning she had been missing for months.",
      "links": [
        {
          "body": "Republic City",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Republic City Four Elements",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_Four_Elements",
            "page": "Republic_City_Four_Elements"
          }
        },
        {
          "body": "Eska",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "Mako",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Korra",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Reaffirming his loyalty"
      ],
      "text": "Bolin and the rest of Kuvira's army arrived at Republic City a day before Prince Wu's coronation as the fifty-fourth earth monarch. Entering the Republic City Four Elements with the rest of the officers, Bolin expressed his joy over being back in the city, though his expression promptly fell when he noticed Eska was also staying at the hotel. When the waterbender congratulated him on having replaced her with a threatening-looking girlfriend, referring to Kuvira, Bolin corrected her, telling her she was his boss. Upon seeing Mako, the two brothers traded a mock punch before sharing a hug. As Mako complimented him about having become \"all important\", Bolin admitted that he was not used to seeing himself in that way. Upon being asked what it was like to work for Kuvira, Bolin revealed that it was great, as they were helping people all across the Earth Kingdom. He was surprised to learn that his brother had spent his time working for Wu as opposed to fighting crime in the city. He quickly changed the subject, asking if he had seen Korra yet, though was left worried upon learning she had been missing for months."
    },
    {
      "body": "The following day, Bolin attended Wu's coronation, sitting on the bleachers with Varrick, Baatar Jr., and ${link_0}. When Kuvira denounced Wu's authority and dissolved the Earth Kingdom in favor of the Earth Empire with her as its leader, symbolically crushing the ${link_1} she had been given, Bolin was reluctant to follow his fellow officers in the standing ovation for their leader.",
      "links": [
        {
          "body": "Zhu Li",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        },
        {
          "body": "Kyoshi Medal of Freedom",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Medal_of_Freedom",
            "page": "Kyoshi_Medal_of_Freedom"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Reaffirming his loyalty"
      ],
      "text": "The following day, Bolin attended Wu's coronation, sitting on the bleachers with Varrick, Baatar Jr., and Zhu Li. When Kuvira denounced Wu's authority and dissolved the Earth Kingdom in favor of the Earth Empire with her as its leader, symbolically crushing the Kyoshi Medal of Freedom she had been given, Bolin was reluctant to follow his fellow officers in the standing ovation for their leader."
    },
    {
      "body": "After the ceremony, Bolin retreated with the other officers to the Presidential Suite. Sitting in the living area with Varrick, the earthbender expressed his surprise about Kuriva's declaration, fearing it would turn all the world leaders against them. As Varrick left to conduct experiments on a ${link_0}, Bolin was approached by Kuvira, who had noticed his worried expression. He admitted that he had some misgivings about her ambush of the world leaders. Although he believed in the work they had done thus for, he had his doubts about the \"empire\" and Kuvira's pledge to crush every person who dared to stand in their way. His misgivings were eased by his leader, who told him her choice of words were merely tough rhetoric to show people they were serious about their cause and implored the earthbender to stand by her, as she would need his help more than ever because the other leaders would force them to accept Wu. After a moment's pause, he reaffirmed his loyalty to her cause and left the room on Kuvira's request when Suyin entered.",
      "links": [
        {
          "body": "spirit vine",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Reaffirming his loyalty"
      ],
      "text": "After the ceremony, Bolin retreated with the other officers to the Presidential Suite. Sitting in the living area with Varrick, the earthbender expressed his surprise about Kuriva's declaration, fearing it would turn all the world leaders against them. As Varrick left to conduct experiments on a spirit vine, Bolin was approached by Kuvira, who had noticed his worried expression. He admitted that he had some misgivings about her ambush of the world leaders. Although he believed in the work they had done thus for, he had his doubts about the \"empire\" and Kuvira's pledge to crush every person who dared to stand in their way. His misgivings were eased by his leader, who told him her choice of words were merely tough rhetoric to show people they were serious about their cause and implored the earthbender to stand by her, as she would need his help more than ever because the other leaders would force them to accept Wu. After a moment's pause, he reaffirmed his loyalty to her cause and left the room on Kuvira's request when Suyin entered."
    },
    {
      "body": "Bolin made his way to Wu and Mako's suite on the seventh floor. When Mako stated that he could not keep working for Kuvira now that she was going against the wishes of the entire world, Bolin tried to explain to his brother that he had a wrong view of Kuvira, stating that the metalbender was truly helping all the poor people of the empire, which was for the best. Since Mako continued to be skeptical, Bolin invited him to join their cause, so he could see first-hand all the good they did and how they were making history. As his brother mused that they were doing that by crushing everyone in their way, Bolin waved the choice of words off, relaying Kuvira's explanation that it was merely tough rhetoric. He defended Kuvira by drawing a parallel between the metalbender and Korra, as they were both hard to deal with though passionate about their beliefs. When Mako continued to voice his skepticism, labeling Kuvira to be a dictator taking over the Earth Kingdom by force, Bolin retaliated by asking if Mako thought Wu would be a better leader than Kuvira, forcing his brother admit that he did not think so. Bolin grew angry when his brother still refused to see things his way, blaming him for wasting his time as Wu's glorified butler while he was making history. As Mako called Kuvira a \"glorious emperor\" with a \"military dictatorship\", Bolin stormed off, stating he would return to the army train with which they brought freedom wherever they went, while Mako would be left to \"lick the king's boots\".",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Reaffirming his loyalty"
      ],
      "text": "Bolin made his way to Wu and Mako's suite on the seventh floor. When Mako stated that he could not keep working for Kuvira now that she was going against the wishes of the entire world, Bolin tried to explain to his brother that he had a wrong view of Kuvira, stating that the metalbender was truly helping all the poor people of the empire, which was for the best. Since Mako continued to be skeptical, Bolin invited him to join their cause, so he could see first-hand all the good they did and how they were making history. As his brother mused that they were doing that by crushing everyone in their way, Bolin waved the choice of words off, relaying Kuvira's explanation that it was merely tough rhetoric. He defended Kuvira by drawing a parallel between the metalbender and Korra, as they were both hard to deal with though passionate about their beliefs. When Mako continued to voice his skepticism, labeling Kuvira to be a dictator taking over the Earth Kingdom by force, Bolin retaliated by asking if Mako thought Wu would be a better leader than Kuvira, forcing his brother admit that he did not think so. Bolin grew angry when his brother still refused to see things his way, blaming him for wasting his time as Wu's glorified butler while he was making history. As Mako called Kuvira a \"glorious emperor\" with a \"military dictatorship\", Bolin stormed off, stating he would return to the army train with which they brought freedom wherever they went, while Mako would be left to \"lick the king's boots\"."
    },
    {
      "body": "En route to Zaofu, Bolin was summoned to Kuvira's cart, where he nervously inquired if he had done something wrong that warranted the audience. Kuvira reassured him that the meeting had the opposite goal, as she invited Bolin to become part of her inner circle, much to his pleasure. He caught himself and toned down his enthusiastic outburst, politely thanking Kuvira for that \"great honor\". Upon asked what being a part of the inner circle meant exactly, he learned that he had proven his worth. Being told that Suyin's resentment toward Kuvira and Baatar Jr. would prevent the matriarch from joining their cause and truly reunite the Earth Empire, Bolin readily agreed that he could talk to Suyin to change her mind, confidently stating that she would be begging to join their cause after he was done relaying all the great things they had done. When Kuvira subsequently revealed that they had arrived at Zaofu along with the rest of the army, Bolin wondered if the presence of the troops would not send the wrong message. His worries were dismissed by his commander, who stated the army to be merely a projection of strength, whereas Bolin was there to present peace.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Wavering loyalty"
      ],
      "text": "En route to Zaofu, Bolin was summoned to Kuvira's cart, where he nervously inquired if he had done something wrong that warranted the audience. Kuvira reassured him that the meeting had the opposite goal, as she invited Bolin to become part of her inner circle, much to his pleasure. He caught himself and toned down his enthusiastic outburst, politely thanking Kuvira for that \"great honor\". Upon asked what being a part of the inner circle meant exactly, he learned that he had proven his worth. Being told that Suyin's resentment toward Kuvira and Baatar Jr. would prevent the matriarch from joining their cause and truly reunite the Earth Empire, Bolin readily agreed that he could talk to Suyin to change her mind, confidently stating that she would be begging to join their cause after he was done relaying all the great things they had done. When Kuvira subsequently revealed that they had arrived at Zaofu along with the rest of the army, Bolin wondered if the presence of the troops would not send the wrong message. His worries were dismissed by his commander, who stated the army to be merely a projection of strength, whereas Bolin was there to present peace."
    },
    {
      "body": "Arriving in the city, Bolin and Kuvira were led by Baatar Jr. to the room where the rest of the ${link_0} was awaiting them. Upon noticing Opal, he enthusiastically greeted her and moved to embrace her, though was angrily told off, as he had \"chosen [his] side\". Surprised about the outburst, he told everyone that there should not be sides and tried to make both parties form a circle, to no avail. Bolin tried to defuse the building tension by proposing to forget about all the painful, personal history that there was between them. He tried to connect with Wing and Wei for support, though was met with a cold shoulder. Unfazed by the unenthused response, he urged everyone to focus on the future, which was very bright according to him. To emphasize his point, he gave the example of a town he and the army had visited a month prior; it had nothing, though when they left, everyone had two Satomobiles, running water, and a maglev train running trough their tow. When Opal added that after the army left, the citizens were forced into slave labor and dissenters were sent away, Bolin refused to believe her and snapped at her that he was one hundred percent certain that they were making the Earth Empire a better place to live. The tension between the couple was defused, however, when Bolin grew shocked upon hearing Kuvira issue a twenty-four hour ultimatum to surrender Zaofu, lest she would take it by force.",
      "links": [
        {
          "body": "Beifong family",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Beifong_family",
            "page": "Beifong_family"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Wavering loyalty"
      ],
      "text": "Arriving in the city, Bolin and Kuvira were led by Baatar Jr. to the room where the rest of the Beifong family was awaiting them. Upon noticing Opal, he enthusiastically greeted her and moved to embrace her, though was angrily told off, as he had \"chosen [his] side\". Surprised about the outburst, he told everyone that there should not be sides and tried to make both parties form a circle, to no avail. Bolin tried to defuse the building tension by proposing to forget about all the painful, personal history that there was between them. He tried to connect with Wing and Wei for support, though was met with a cold shoulder. Unfazed by the unenthused response, he urged everyone to focus on the future, which was very bright according to him. To emphasize his point, he gave the example of a town he and the army had visited a month prior; it had nothing, though when they left, everyone had two Satomobiles, running water, and a maglev train running trough their tow. When Opal added that after the army left, the citizens were forced into slave labor and dissenters were sent away, Bolin refused to believe her and snapped at her that he was one hundred percent certain that they were making the Earth Empire a better place to live. The tension between the couple was defused, however, when Bolin grew shocked upon hearing Kuvira issue a twenty-four hour ultimatum to surrender Zaofu, lest she would take it by force."
    },
    {
      "body": "Back in the army camp, Bolin asked Kuvira if she truly intended to invade Zaofu and grew wary about her using \"other ways\" to convince people to join if they refused to cooperate. Inquiring about how many times they had already resorted to those \"other ways\", his question was dismissed as to be not of importance to him and he was told that the citizens of the annexed states were Kuvira's loyal subjects, whom she could order around as she saw fit. As part of their inner circle, she made it clear that there were some hard truths that he just needed to accept without questions. Voicing his doubt about being inner circle material, Bolin suggested to just leave Zaofu, as that would mean that the Earth Empire would already be united. His proposal did not sit well with Kuvira, who blamed him to love Opal more than he was loyal to her. Threatened to be shipped off to a reeducation camp, Bolin stated that he thought it was a camp to teach people new trade skills. When Kuvira noted that his loyalty seemed to be wavering, he quickly reaffirmed his belief in her.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Wavering loyalty"
      ],
      "text": "Back in the army camp, Bolin asked Kuvira if she truly intended to invade Zaofu and grew wary about her using \"other ways\" to convince people to join if they refused to cooperate. Inquiring about how many times they had already resorted to those \"other ways\", his question was dismissed as to be not of importance to him and he was told that the citizens of the annexed states were Kuvira's loyal subjects, whom she could order around as she saw fit. As part of their inner circle, she made it clear that there were some hard truths that he just needed to accept without questions. Voicing his doubt about being inner circle material, Bolin suggested to just leave Zaofu, as that would mean that the Earth Empire would already be united. His proposal did not sit well with Kuvira, who blamed him to love Opal more than he was loyal to her. Threatened to be shipped off to a reeducation camp, Bolin stated that he thought it was a camp to teach people new trade skills. When Kuvira noted that his loyalty seemed to be wavering, he quickly reaffirmed his belief in her."
    },
    {
      "body": "Leaving Kuvira's tent, Bolin tried to visit Varrick in his wagon, though was turned away by the guards at the door. Undeterred, he climbed atop the train and entered via a ceiling hatch. When the two men stood face to face, they grabbed each other by the collar and declared simultaneously that \"Kuvira [was] crazy\", revealing to one another that they had been threatened by her. Agreeing that they needed to get away from there, Varrick and Zhu Li escaped via the hatch with Bolin close behind.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Deserting Kuvira's army"
      ],
      "text": "Leaving Kuvira's tent, Bolin tried to visit Varrick in his wagon, though was turned away by the guards at the door. Undeterred, he climbed atop the train and entered via a ceiling hatch. When the two men stood face to face, they grabbed each other by the collar and declared simultaneously that \"Kuvira [was] crazy\", revealing to one another that they had been threatened by her. Agreeing that they needed to get away from there, Varrick and Zhu Li escaped via the hatch with Bolin close behind."
    },
    {
      "body": "The three each secured a ${link_0} and made their escape to the nearby forest, where Bolin stopped and proposed to sneak into Zaofu from the rear. Varrick dismissed his idea, however, as he wanted to go to Republic City and warn the world about Kuvira's potential super weapon. Acknowledging that Varrick's plan was also a form of helping, albeit different from his direct aid by staying in Zaofu, Bolin took the time to ponder the options. However, this enabled Baatar Jr. and two sergeants of the army, each piloting a mecha suit as well, to catch up with them and Bolin was promptly shot down by an electrical charge aimed at him by Baatar Jr.. Recovering, he tackled his commander to the ground. In the ensuing struggle, Baatar Jr. managed to get the upper hand and delivered a strong blow to the center of Bolin's suit, knocking it on its back. As Baatar Jr. charged him with another electricity bolt at the ready, Bolin quickly evacuated his suit and left it to be completely destroyed by his commander. He was forced to continue to battle on foot, defending himself against Baatar Jr.'s flamethrower by erecting an earth shield. Bolin managed to break Baatar Jr.'s attack by launching the shield at him and toppling a nearby tree in his direction. Free to take in his surroundings, he noticed that Zhu Li was in trouble and leaped to her rescue, ${link_1} toward the two sergeants, effectively melting their suits and enabling himself to capture them by encasing them in an earth shell. The victory was short-lived, however, as Bolin was forced to surrender when Baatar Jr. reappeared atop a cliff, threatening to kill Varrick if they would not comply to his wishes. Escorted back to camp, Bolin and the others were presented to Kuvira, who ordered them to be sent away on the next train, with specific orders for Bolin to be sent to the reeducation camp for their most severe dissenters.",
      "links": [
        {
          "body": "mecha suit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_suit",
            "page": "Mecha_suit"
          }
        },
        {
          "body": "sending a stream of lava",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lavabending",
            "page": "Lavabending"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Deserting Kuvira's army"
      ],
      "text": "The three each secured a mecha suit and made their escape to the nearby forest, where Bolin stopped and proposed to sneak into Zaofu from the rear. Varrick dismissed his idea, however, as he wanted to go to Republic City and warn the world about Kuvira's potential super weapon. Acknowledging that Varrick's plan was also a form of helping, albeit different from his direct aid by staying in Zaofu, Bolin took the time to ponder the options. However, this enabled Baatar Jr. and two sergeants of the army, each piloting a mecha suit as well, to catch up with them and Bolin was promptly shot down by an electrical charge aimed at him by Baatar Jr.. Recovering, he tackled his commander to the ground. In the ensuing struggle, Baatar Jr. managed to get the upper hand and delivered a strong blow to the center of Bolin's suit, knocking it on its back. As Baatar Jr. charged him with another electricity bolt at the ready, Bolin quickly evacuated his suit and left it to be completely destroyed by his commander. He was forced to continue to battle on foot, defending himself against Baatar Jr.'s flamethrower by erecting an earth shield. Bolin managed to break Baatar Jr.'s attack by launching the shield at him and toppling a nearby tree in his direction. Free to take in his surroundings, he noticed that Zhu Li was in trouble and leaped to her rescue, sending a stream of lava toward the two sergeants, effectively melting their suits and enabling himself to capture them by encasing them in an earth shell. The victory was short-lived, however, as Bolin was forced to surrender when Baatar Jr. reappeared atop a cliff, threatening to kill Varrick if they would not comply to his wishes. Escorted back to camp, Bolin and the others were presented to Kuvira, who ordered them to be sent away on the next train, with specific orders for Bolin to be sent to the reeducation camp for their most severe dissenters."
    },
    {
      "body": "Bolin and Varrick were placed on a train that took them away from Zaofu. Spending the night on the floor of his prison cell, Bolin woke up due to the commotion caused by Baatar Jr. and his two metalbending soldiers, who were roughly forcing Varrick to continue on weaponizing the spirit vine technology. Asking what was going on, he was told to resume sleeping, as he would need his energy for his time in the reeducation camp. After Varrick spooked the guard that was assigned to be his assistant by retelling how the experiment created an uncontrollable blast of energy last time they tried it, pointing out that the man might lose his hands, Bolin was assigned to help Varrick instead, much to his displeasure. When the guard came to pull him up, Bolin tucked his hands safely away underneath his arms, trying to stall by inquiring if they could at least have breakfast first while he still had his hands. His request was ignored, however, and he was dragged off toward the cart housing Varrick's new laboratory.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Deserting Kuvira's army"
      ],
      "text": "Bolin and Varrick were placed on a train that took them away from Zaofu. Spending the night on the floor of his prison cell, Bolin woke up due to the commotion caused by Baatar Jr. and his two metalbending soldiers, who were roughly forcing Varrick to continue on weaponizing the spirit vine technology. Asking what was going on, he was told to resume sleeping, as he would need his energy for his time in the reeducation camp. After Varrick spooked the guard that was assigned to be his assistant by retelling how the experiment created an uncontrollable blast of energy last time they tried it, pointing out that the man might lose his hands, Bolin was assigned to help Varrick instead, much to his displeasure. When the guard came to pull him up, Bolin tucked his hands safely away underneath his arms, trying to stall by inquiring if they could at least have breakfast first while he still had his hands. His request was ignored, however, and he was dragged off toward the cart housing Varrick's new laboratory."
    },
    {
      "body": "As Varrick started tinkering at the machine containing the stasis capsule with a spirit vine sample in it, Bolin was told to \"do the thing\". When he was confused as to what he should be doing and Varrick irritatingly stated that he never needed to elaborate on his requests with Zhu Li, an annoyed Bolin defended himself by saying that he was not Zhu Li and that Varrick needed to pretend that he did not know anything about what was going on, that he did not want to contribute to the creation of a \"super weapon\", and that he did not wish to have his hands blown off. When Varrick told Baatar Jr. that he had envisioned to use the spirit vine energy as a source of clean, unlimited energy, Bolin jumped on that plan and inquired why they were not doing that instead. His intervention was not appreciated, however, and he was told to keep quiet by the second-in-command, as he was only there to assist Varrick, not to voice his opinions. When Baatar Jr. threatened to order the guards to roughly force Varrick to continue his work, the inventor returned to his station, though as he passed Bolin, he revealed that they had failed to control the power last time when they ran the current through the vine and that he was trying something new this time in an attempt to direct it; the earthbender did not understand what the inventor meant by that, however, and confusedly looked around.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Deserting Kuvira's army"
      ],
      "text": "As Varrick started tinkering at the machine containing the stasis capsule with a spirit vine sample in it, Bolin was told to \"do the thing\". When he was confused as to what he should be doing and Varrick irritatingly stated that he never needed to elaborate on his requests with Zhu Li, an annoyed Bolin defended himself by saying that he was not Zhu Li and that Varrick needed to pretend that he did not know anything about what was going on, that he did not want to contribute to the creation of a \"super weapon\", and that he did not wish to have his hands blown off. When Varrick told Baatar Jr. that he had envisioned to use the spirit vine energy as a source of clean, unlimited energy, Bolin jumped on that plan and inquired why they were not doing that instead. His intervention was not appreciated, however, and he was told to keep quiet by the second-in-command, as he was only there to assist Varrick, not to voice his opinions. When Baatar Jr. threatened to order the guards to roughly force Varrick to continue his work, the inventor returned to his station, though as he passed Bolin, he revealed that they had failed to control the power last time when they ran the current through the vine and that he was trying something new this time in an attempt to direct it; the earthbender did not understand what the inventor meant by that, however, and confusedly looked around."
    },
    {
      "body": "As Varrick continued adjusting the power source on his invention under Baatar Jr. supervision, a bored Bolin occupied himself with cleaning the dirt from underneath his fingernails with a screwdriver. Upon being asked to hand the object to Varrick, Bolin outed his disbelief over Varrick actually helping Kuvira's war efforts by building the machine, noting it was not right. Varrick reassured him that he knew what he was doing, though Bolin failed to grasp what exactly the inventor meant by that. He grew alarmed when Varrick powered up his machine and revealed that it had been converted into a bomb that was set to detonate five minutes later. Although Bolin stated that he was not ready to die yet, his pleas were ignored.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Deserting Kuvira's army"
      ],
      "text": "As Varrick continued adjusting the power source on his invention under Baatar Jr. supervision, a bored Bolin occupied himself with cleaning the dirt from underneath his fingernails with a screwdriver. Upon being asked to hand the object to Varrick, Bolin outed his disbelief over Varrick actually helping Kuvira's war efforts by building the machine, noting it was not right. Varrick reassured him that he knew what he was doing, though Bolin failed to grasp what exactly the inventor meant by that. He grew alarmed when Varrick powered up his machine and revealed that it had been converted into a bomb that was set to detonate five minutes later. Although Bolin stated that he was not ready to die yet, his pleas were ignored."
    },
    {
      "body": "When the last guard and mechanic passed Bolin and Varrick to enter the next wagon, Bolin confirmed their half of the train to be deserted. He was ordered again to \"do the thing\" by Varrick, who irritatingly elaborated that he was referring to unhooking the carts when Bolin did not move. As they watched the train depart with all of Kuvira's guards, Bolin complimented Varrick's plan and revealed that he too had been convinced that the inventor intended to blow them up. Asking how they could shut the bomb down, he was shocked to learn that Varrick had not been bluffing about his intentions. Distressed, he started running through the cart, looking for a way out. Spotting a hatch leading toward the tracks, he slapped Varrick in the face and told him he hated him, before grabbing the inventor by the shoulders and exiting the train moments before the explosion. Being underground safeguarded them from the blast and, using his earthbending, Bolin tunneled a way for them through the earth and exited at the bottom of the crater. When Varrick started laughing and complimented him on having done \"the thing\", bestowing him with a kiss on his forehead, Bolin glared at the inventor and told him that he could not believe Zhu Li had worked for him as long as she had.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Deserting Kuvira's army"
      ],
      "text": "When the last guard and mechanic passed Bolin and Varrick to enter the next wagon, Bolin confirmed their half of the train to be deserted. He was ordered again to \"do the thing\" by Varrick, who irritatingly elaborated that he was referring to unhooking the carts when Bolin did not move. As they watched the train depart with all of Kuvira's guards, Bolin complimented Varrick's plan and revealed that he too had been convinced that the inventor intended to blow them up. Asking how they could shut the bomb down, he was shocked to learn that Varrick had not been bluffing about his intentions. Distressed, he started running through the cart, looking for a way out. Spotting a hatch leading toward the tracks, he slapped Varrick in the face and told him he hated him, before grabbing the inventor by the shoulders and exiting the train moments before the explosion. Being underground safeguarded them from the blast and, using his earthbending, Bolin tunneled a way for them through the earth and exited at the bottom of the crater. When Varrick started laughing and complimented him on having done \"the thing\", bestowing him with a kiss on his forehead, Bolin glared at the inventor and told him that he could not believe Zhu Li had worked for him as long as she had."
    },
    {
      "body": "Bolin and Varrick started their journey toward Republic City on foot, though he was soon reduced to Varrick's mount. While staggering through a forest with Varrick on his back, a tired Bolin proposed that the inventor would walk on his own for a while. When Varrick compared him to Zhu Li, bragging that the latter could carry him for twenty miles a day with a sprained ankle, Bolin unceremoniously dropped Varrick on the ground, irritatingly stating that Zhu Li was not there. As the inventor lamented that he deserved to be left behind for all he had done, Bolin snapped at him, pointing out that he was not getting off that easily since he was responsible for the super weapon Kuvira was trying to make. He softened his tone, however, when Varrick wailed to be a horrible person, and noted that Kuvira had fooled them both into doing her dirty work. He declared that they would atone for their actions by making it back to Republic City and warn the world about Kuvira's plans. Bolin managed to motivate Varrick to go on and the inventor even proposed to carry Bolin on his back for a while, an offer he gladly accepted. They did not get very far, however, as Varrick immediately stepped into a trap, which suspended them in a net high above the ground, much to Bolin's displeasure.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Escaping the Earth Empire"
      ],
      "text": "Bolin and Varrick started their journey toward Republic City on foot, though he was soon reduced to Varrick's mount. While staggering through a forest with Varrick on his back, a tired Bolin proposed that the inventor would walk on his own for a while. When Varrick compared him to Zhu Li, bragging that the latter could carry him for twenty miles a day with a sprained ankle, Bolin unceremoniously dropped Varrick on the ground, irritatingly stating that Zhu Li was not there. As the inventor lamented that he deserved to be left behind for all he had done, Bolin snapped at him, pointing out that he was not getting off that easily since he was responsible for the super weapon Kuvira was trying to make. He softened his tone, however, when Varrick wailed to be a horrible person, and noted that Kuvira had fooled them both into doing her dirty work. He declared that they would atone for their actions by making it back to Republic City and warn the world about Kuvira's plans. Bolin managed to motivate Varrick to go on and the inventor even proposed to carry Bolin on his back for a while, an offer he gladly accepted. They did not get very far, however, as Varrick immediately stepped into a trap, which suspended them in a net high above the ground, much to Bolin's displeasure."
    },
    {
      "body": "Unable to break the ropes, Bolin expressed his wish to have Pabu there with them, as the fire ferret could have just gnawed them out of their predicament. When they were approached by a group of people, Bolin excitedly called out to their \"fellow travelers\", asking if they would free them. It became apparent that the group was not supportive of Kuvira's actions and her soldiers and, when Varrick revealed that they had been part of Kuvira's inner circle, Bolin quickly placed emphasis on the fact that they were no longer with the master metalbender.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Escaping the Earth Empire"
      ],
      "text": "Unable to break the ropes, Bolin expressed his wish to have Pabu there with them, as the fire ferret could have just gnawed them out of their predicament. When they were approached by a group of people, Bolin excitedly called out to their \"fellow travelers\", asking if they would free them. It became apparent that the group was not supportive of Kuvira's actions and her soldiers and, when Varrick revealed that they had been part of Kuvira's inner circle, Bolin quickly placed emphasis on the fact that they were no longer with the master metalbender."
    },
    {
      "body": "After they were cut down and tied up, Bolin inquired how a group of fire- and waterbenders ended up in one of Kuvira's reeducation camps, upon which he learned that she had been purging the Earth Empire of everyone not of Earth Kingdom origin. Being told that the escapees planned to use them to talk their way past a border checkpoint, Bolin used his earthbending to push them all back, before creating a moat of lava to cut through his ropes and keep the fugitives at a distance. He apologized for the fate that had befallen them, though he emphasized once more that they no longer worked for Kuvira. Bolin cooled his lava when it became apparent that the only way either party was getting out of the Earth Empire was by trusting each other and working together.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Escaping the Earth Empire"
      ],
      "text": "After they were cut down and tied up, Bolin inquired how a group of fire- and waterbenders ended up in one of Kuvira's reeducation camps, upon which he learned that she had been purging the Earth Empire of everyone not of Earth Kingdom origin. Being told that the escapees planned to use them to talk their way past a border checkpoint, Bolin used his earthbending to push them all back, before creating a moat of lava to cut through his ropes and keep the fugitives at a distance. He apologized for the fate that had befallen them, though he emphasized once more that they no longer worked for Kuvira. Bolin cooled his lava when it became apparent that the only way either party was getting out of the Earth Empire was by trusting each other and working together."
    },
    {
      "body": "Bolin and Varrick walked in front of the now tied up fugitives and, upon reaching the checkpoint, he whispered to Varrick to follow his lead. Saluting the ${link_0}, he stated that they had captured escaped prisoners and needed to transport them to a secure facility. He told the man that they had come from Camp 14, though upon learning that the camp was back the way they had come from, he snapped authoritatively at the officer that Kuvira wanted the prisoners transferred. Bolin was at a loss for what to do when the guard demanded to see a transfer order, though watched in surprise when Varrick want on a rant about the hardships he had allegedly suffered through to get there, which ended up convincing the officer to grant them passage. Although they managed to pass through the wall of the checkpoint, they were recognized by another ${link_1} as traitors to the empire and were prevented from making a clean escape. In the ensuing battle, Bolin defended himself with earth and lava against three mecha suits, though despite his relentless attacks, he failed to permanently take down the suits and ended up being cornered by them, trapped behind his earth shield by their flamethrowers. As one of the mecha suits was on the verge of taking him out, Bolin was saved by Varrick, who had created an electromagnetic pulse device which shut down all the machines. Although the inventor urged him to leave with him, Bolin noticed that the fugitives were being pressed back by the remaining guards. Calling out to Varrick to wait, as they could not leave the group, he surged forward and created a large stream of lava with which he forced the soldiers to retreat and prevent them from following afterward. When he was thanked by ${link_2}, who noted that he had not needed to come back, Bolin stated that he had needed to come back, before urging he group to move away from the checkpoint.",
      "links": [
        {
          "body": "guard post officer",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Guard_post_officer",
            "page": "Guard_post_officer"
          }
        },
        {
          "body": "guard post soldier",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Guard_post_soldier",
            "page": "Guard_post_soldier"
          }
        },
        {
          "body": "Baraz",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Baraz_and_Ahnah",
            "page": "Baraz_and_Ahnah"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Escaping the Earth Empire"
      ],
      "text": "Bolin and Varrick walked in front of the now tied up fugitives and, upon reaching the checkpoint, he whispered to Varrick to follow his lead. Saluting the guard post officer, he stated that they had captured escaped prisoners and needed to transport them to a secure facility. He told the man that they had come from Camp 14, though upon learning that the camp was back the way they had come from, he snapped authoritatively at the officer that Kuvira wanted the prisoners transferred. Bolin was at a loss for what to do when the guard demanded to see a transfer order, though watched in surprise when Varrick want on a rant about the hardships he had allegedly suffered through to get there, which ended up convincing the officer to grant them passage. Although they managed to pass through the wall of the checkpoint, they were recognized by another guard post soldier as traitors to the empire and were prevented from making a clean escape. In the ensuing battle, Bolin defended himself with earth and lava against three mecha suits, though despite his relentless attacks, he failed to permanently take down the suits and ended up being cornered by them, trapped behind his earth shield by their flamethrowers. As one of the mecha suits was on the verge of taking him out, Bolin was saved by Varrick, who had created an electromagnetic pulse device which shut down all the machines. Although the inventor urged him to leave with him, Bolin noticed that the fugitives were being pressed back by the remaining guards. Calling out to Varrick to wait, as they could not leave the group, he surged forward and created a large stream of lava with which he forced the soldiers to retreat and prevent them from following afterward. When he was thanked by Baraz, who noted that he had not needed to come back, Bolin stated that he had needed to come back, before urging he group to move away from the checkpoint."
    },
    {
      "body": "As they reached the shore where the escapees boarded a small boat, Bolin apologized to Baraz and Ahnah for all Kuvira had put them through. Being conscious about the fact that his apology might not mean much considering the uniform he wore, he was glad to find Baraz readily accepting it. When Ahnah offered to give them a lift on their boat, as they were heading north as well, Bolin elbowed Varrick, who was in the process of declining the offer, and the two friends boarded the small vessel.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Escaping the Earth Empire"
      ],
      "text": "As they reached the shore where the escapees boarded a small boat, Bolin apologized to Baraz and Ahnah for all Kuvira had put them through. Being conscious about the fact that his apology might not mean much considering the uniform he wore, he was glad to find Baraz readily accepting it. When Ahnah offered to give them a lift on their boat, as they were heading north as well, Bolin elbowed Varrick, who was in the process of declining the offer, and the two friends boarded the small vessel."
    },
    {
      "body": "In order to pass time and entertain each other on the long seaward journey, the fugitives told stories, though after Baraz recalled the origin of his dislike of onion-bark soup, Bolin was bored to the point that he asked everyone if there was someone else who wanted to throw themselves overboard as well. Varrick brightened the atmosphere by starting to tell the story of Bolin, as Nuktuk, in Bolin, Hero of the World, which confused Bolin, as he did not know whether he was playing Nuktuk or if Nuktuk was playing him. He also did not agree with his attributed title of \"hero of the world\", guiltily explaining that he had left this friends and family to join a \"psychotic dictator\" who had imprisoned him and was now running back to them in shame. Varrick waved off his complaints and started to tell his modified version of Bolin's story, beginning from their meeting at the Southern Water Tribe, though when the Varrick made him sing in the story, Bolin corrected the inventor, stating adamantly that he was not singing, Varrick was not levitating, and ${link_0} was just a friend, not his girlfriend. Wanting to relay the truth, Bolin wistfully started his own story from the night he met Korra at the Pro-bending Arena, though was interrupted by Baraz, who deemed his tale to be boring and wanted to know when he would start to sing. When Bolin emphasized that there was not going to be any singing, he was shocked to be booed out by the fugitives and Varrick dismissed him as being \"on-screen talent\" who should leave the storytelling to the masters.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "A tiresome journey"
      ],
      "text": "In order to pass time and entertain each other on the long seaward journey, the fugitives told stories, though after Baraz recalled the origin of his dislike of onion-bark soup, Bolin was bored to the point that he asked everyone if there was someone else who wanted to throw themselves overboard as well. Varrick brightened the atmosphere by starting to tell the story of Bolin, as Nuktuk, in Bolin, Hero of the World, which confused Bolin, as he did not know whether he was playing Nuktuk or if Nuktuk was playing him. He also did not agree with his attributed title of \"hero of the world\", guiltily explaining that he had left this friends and family to join a \"psychotic dictator\" who had imprisoned him and was now running back to them in shame. Varrick waved off his complaints and started to tell his modified version of Bolin's story, beginning from their meeting at the Southern Water Tribe, though when the Varrick made him sing in the story, Bolin corrected the inventor, stating adamantly that he was not singing, Varrick was not levitating, and Asami was just a friend, not his girlfriend. Wanting to relay the truth, Bolin wistfully started his own story from the night he met Korra at the Pro-bending Arena, though was interrupted by Baraz, who deemed his tale to be boring and wanted to know when he would start to sing. When Bolin emphasized that there was not going to be any singing, he was shocked to be booed out by the fugitives and Varrick dismissed him as being \"on-screen talent\" who should leave the storytelling to the masters."
    },
    {
      "body": "Bolin let Varrick continue his story, though when the inventor made Zaheer and Vaatu team up to take him down, he incredulously pointed out that was far from the truth and inquired how that would have even occurred, to which Varrick answered that the villains had held a conference call. Although he did not agree with the airbending master and the Spirit of Chaos teaming up with Amon and Unalaq, Bolin agreed with Varrick portraying him as a ladies' man. As Opal was mentioned, he lovingly reminisced about his girlfriend, calling her smart, caring, and pretty to smell. He soon burst out in tears, however, lamenting over his mistake of choosing Kuvira over siding with Opal and was promptly told by Varrick to pull it together. Bolin grew hopeful again when Varrick mentioned that, in the mover, Opal forgave him for everything he had done out of love, though when he added that Opal's kiss granted Bolin the ability to fly, the real Bolin interjected that the idea seemed too unbelievable. As Varrick ended his story, Bolin was shocked to see him receive a standing ovation from the fugitives. He verified in disbelief whether they really liked the story, as it did not make any sense to him due to the plot holes such as \"zombie Amon\" and \"stars made out of magic fairy dust\". Distressed, he grabbed Baraz by the collar and asked him up close if he was crazy, repeating the question to Ahnah, who was standing beside the firebender. Being told by Baraz not to overthink it as it was just a mover, Bolin grew even more annoyed when Varrick draped his arm around him and told him to never let the truth get in the way of a good story.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "A tiresome journey"
      ],
      "text": "Bolin let Varrick continue his story, though when the inventor made Zaheer and Vaatu team up to take him down, he incredulously pointed out that was far from the truth and inquired how that would have even occurred, to which Varrick answered that the villains had held a conference call. Although he did not agree with the airbending master and the Spirit of Chaos teaming up with Amon and Unalaq, Bolin agreed with Varrick portraying him as a ladies' man. As Opal was mentioned, he lovingly reminisced about his girlfriend, calling her smart, caring, and pretty to smell. He soon burst out in tears, however, lamenting over his mistake of choosing Kuvira over siding with Opal and was promptly told by Varrick to pull it together. Bolin grew hopeful again when Varrick mentioned that, in the mover, Opal forgave him for everything he had done out of love, though when he added that Opal's kiss granted Bolin the ability to fly, the real Bolin interjected that the idea seemed too unbelievable. As Varrick ended his story, Bolin was shocked to see him receive a standing ovation from the fugitives. He verified in disbelief whether they really liked the story, as it did not make any sense to him due to the plot holes such as \"zombie Amon\" and \"stars made out of magic fairy dust\". Distressed, he grabbed Baraz by the collar and asked him up close if he was crazy, repeating the question to Ahnah, who was standing beside the firebender. Being told by Baraz not to overthink it as it was just a mover, Bolin grew even more annoyed when Varrick draped his arm around him and told him to never let the truth get in the way of a good story."
    },
    {
      "body": "When Bolin and Varrick made it back to Republic City, they immediately headed for ${link_0}, where they interrupted a meeting of the world leaders. Before they could say anything, however, Raiko had them arrested for treason, though as Bolin was being dragged away, he yelled that they had vital information for the leaders, which prompted Raiko to rescind his order. Bolin attempted to explain the details of Kuvira's plan with sound effects, though Varrick quickly took over and plainly stated she was building a super weapon.",
      "links": [
        {
          "body": "City Hall",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/City_Hall",
            "page": "City_Hall"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Making amends"
      ],
      "text": "When Bolin and Varrick made it back to Republic City, they immediately headed for City Hall, where they interrupted a meeting of the world leaders. Before they could say anything, however, Raiko had them arrested for treason, though as Bolin was being dragged away, he yelled that they had vital information for the leaders, which prompted Raiko to rescind his order. Bolin attempted to explain the details of Kuvira's plan with sound effects, though Varrick quickly took over and plainly stated she was building a super weapon."
    },
    {
      "body": "After the meeting was concluded with the United Republic fortifying its borders, Bolin ran after Opal and caught up with her just outside the building. He apologized for everything he had done, ranging from not listening to her to having her home toppled and family captured. Self-conscious of how bad it sounded, he promised he would make it up to her. However, Opal left him standing without another word when Lin desired to talk to her in private. As he stood dejectedly against one of the building's pillars, he was approached by Mako and Korra, who welcomed him back with an embrace. Bolin apologized to Mako for not listening to his warnings, declaring himself to be an idiot. When Mako brushed his worries aside, noting that he had merely been doing what he though was right, Bolin expressed his love for them and embraced them once more.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Making amends"
      ],
      "text": "After the meeting was concluded with the United Republic fortifying its borders, Bolin ran after Opal and caught up with her just outside the building. He apologized for everything he had done, ranging from not listening to her to having her home toppled and family captured. Self-conscious of how bad it sounded, he promised he would make it up to her. However, Opal left him standing without another word when Lin desired to talk to her in private. As he stood dejectedly against one of the building's pillars, he was approached by Mako and Korra, who welcomed him back with an embrace. Bolin apologized to Mako for not listening to his warnings, declaring himself to be an idiot. When Mako brushed his worries aside, noting that he had merely been doing what he though was right, Bolin expressed his love for them and embraced them once more."
    },
    {
      "body": "Having changed out of his military outfit, Bolin started to scour Air Temple Island for Pabu. After a fond reunion, he asked his ferret for help with winning Opal back. He wrote a note, saying he had broken both of his legs, and tied it around Pabu's neck, who would deliver it to Opal while he set up a romantic picnic. As she arrived, Bolin tried to entice her to stay with home-made steam buns and entertainment provided by Pabu, though she rejected him, reiterating his involvement with Kuvira, and left him sad and alone.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Making amends"
      ],
      "text": "Having changed out of his military outfit, Bolin started to scour Air Temple Island for Pabu. After a fond reunion, he asked his ferret for help with winning Opal back. He wrote a note, saying he had broken both of his legs, and tied it around Pabu's neck, who would deliver it to Opal while he set up a romantic picnic. As she arrived, Bolin tried to entice her to stay with home-made steam buns and entertainment provided by Pabu, though she rejected him, reiterating his involvement with Kuvira, and left him sad and alone."
    },
    {
      "body": "Bolin later found Opal preparing ${link_0} together with Lin. Asking where she was going, he was brushed off with a vague answer that they had family business to take care off. Mildly fazed by the evasive response, Bolin declared that, while he understood her anger toward him and knew there was no big gesture he could do to make up for all his mistakes, he would never stop trying, because he loved her. Thanking him for his apology, she gave him the chance to win her back by accompanying them on a secret mission to free her family, an opportunity he readily accepted.",
      "links": [
        {
          "body": "Juicy",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Juicy",
            "page": "Juicy"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Making amends"
      ],
      "text": "Bolin later found Opal preparing Juicy together with Lin. Asking where she was going, he was brushed off with a vague answer that they had family business to take care off. Mildly fazed by the evasive response, Bolin declared that, while he understood her anger toward him and knew there was no big gesture he could do to make up for all his mistakes, he would never stop trying, because he loved her. Thanking him for his apology, she gave him the chance to win her back by accompanying them on a secret mission to free her family, an opportunity he readily accepted."
    },
    {
      "body": "After arriving on the outskirts of Zaofu, Bolin declared his readiness to save the Beifongs and his relationship with Opal. However, as he started on another dramatic exposition, Lin ordered him to be silent, as she had heard enough of it on the way there. When Toph made her presence known, Bolin excitedly started hopping up and down, being overwhelmed about being in the presence of his hero. However, he toned his antics down a little after Toph rejected them as him needing to use the bathroom and introduced himself to her, revealing that she was his biggest hero and that he was sort of dating her granddaughter. Much to his displeasure, however, he found his request for a hug ignored. When Toph noted that Suyin and the others had been moved to a nearby prison camp, Opal coldly asked him where it was located, leaving him to admit in shame that there was a ${link_0} not far from Zaofu. As Toph denounced him as a \"dipstick\" for having worked for Kuvira, Bolin emphasized that his affiliation was a thing of the past, though found his word ignored once again.",
      "links": [
        {
          "body": "factory and reeducation facility",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Empire_factory",
            "page": "Earth_Empire_factory"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Making amends"
      ],
      "text": "After arriving on the outskirts of Zaofu, Bolin declared his readiness to save the Beifongs and his relationship with Opal. However, as he started on another dramatic exposition, Lin ordered him to be silent, as she had heard enough of it on the way there. When Toph made her presence known, Bolin excitedly started hopping up and down, being overwhelmed about being in the presence of his hero. However, he toned his antics down a little after Toph rejected them as him needing to use the bathroom and introduced himself to her, revealing that she was his biggest hero and that he was sort of dating her granddaughter. Much to his displeasure, however, he found his request for a hug ignored. When Toph noted that Suyin and the others had been moved to a nearby prison camp, Opal coldly asked him where it was located, leaving him to admit in shame that there was a factory and reeducation facility not far from Zaofu. As Toph denounced him as a \"dipstick\" for having worked for Kuvira, Bolin emphasized that his affiliation was a thing of the past, though found his word ignored once again."
    },
    {
      "body": "Arriving at the factory, they all sneaked in, allowing Toph and Lin to deduce with their ${link_0} that the Beifong family was being detained in an underground cavern. As Kuvira entered the hangar, Bolin urged everyone to hide and they overheard a conversation between her, Baatar Jr., and Zhu Li. Much to Bolin's delight, Toph noted that Zhu Li was lying when she said that she was doing everything she could to help fix the ${link_1}. Retreating back to the hills surrounding the facility, Bolin agreed with Opal that they should also try to take Kuvira down now that they had the chance, or at least attempt to destroy the cannon. He reasoned that their best moment to attack was during the demonstration of the weapon the next day, since Kuvira wanted all the factory's soldiers and workers present, which would leave the factory largely deserted, a suggestion that earned him a compliment from Opal.",
      "links": [
        {
          "body": "seismic sense",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Seismic_sense",
            "page": "Seismic_sense"
          }
        },
        {
          "body": "spirit energy cannon",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_energy_cannon",
            "page": "Spirit_energy_cannon"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Making amends"
      ],
      "text": "Arriving at the factory, they all sneaked in, allowing Toph and Lin to deduce with their seismic sense that the Beifong family was being detained in an underground cavern. As Kuvira entered the hangar, Bolin urged everyone to hide and they overheard a conversation between her, Baatar Jr., and Zhu Li. Much to Bolin's delight, Toph noted that Zhu Li was lying when she said that she was doing everything she could to help fix the spirit energy cannon. Retreating back to the hills surrounding the facility, Bolin agreed with Opal that they should also try to take Kuvira down now that they had the chance, or at least attempt to destroy the cannon. He reasoned that their best moment to attack was during the demonstration of the weapon the next day, since Kuvira wanted all the factory's soldiers and workers present, which would leave the factory largely deserted, a suggestion that earned him a compliment from Opal."
    },
    {
      "body": "During dinner that night, Bolin tried to have a conversation with Toph once more and revealed his failure to learn metalbending. As she denounced him to be a \"blockhead\" for not figuring out the specifics of the art, he noted that he could lavabend. When Toph amusedly noted that there was a possibility that he did have some talent, Bolin grew excited all over again. When he asked about the identity of Lin's father, he inadvertently sparked an argument between mother and daughter, since that was a conversational topic Toph would never breach with Lin, much to the latter's disappointment, though casually answered for Bolin.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Making amends"
      ],
      "text": "During dinner that night, Bolin tried to have a conversation with Toph once more and revealed his failure to learn metalbending. As she denounced him to be a \"blockhead\" for not figuring out the specifics of the art, he noted that he could lavabend. When Toph amusedly noted that there was a possibility that he did have some talent, Bolin grew excited all over again. When he asked about the identity of Lin's father, he inadvertently sparked an argument between mother and daughter, since that was a conversational topic Toph would never breach with Lin, much to the latter's disappointment, though casually answered for Bolin."
    },
    {
      "body": "The following day, after Opal alerted them that the demonstration was about to start, Bolin, Toph, and Lin burrowed themselves a tunnel toward the underground cavern where the Beifong family was being held captive. With Toph's help, Bolin catapulted Lin atop the wooden cell, so she could swing back all the prisoners on her cable and he could catch them. Everything went well, until the acrophobic Baatar inadvertently alerted the guards to their presence. Despite this setback, Bolin radioed to Opal that their mission had been a success and that they were resurfacing. Reuniting with Opal, Bolin learned that Zhu Li had been captured and sentenced to die in the abandoned town that was to be blown up by the cannon and he promptly noted that he had to save her. He reasoned that since Zhu Li had been lying about trying to fix the cannon, she must have been attempting to stop it. When Toph hypothesized that Zhu Li was merely covering up a mistake she had made, Bolin decidedly noted that the woman did not make mistakes. He told the Beifong family to leave without him, though as he made his way over to the abandoned town, he was joined on his quest by Opal, who took them there on Juicy. Before they could free Zhu Li, however, the cannon fired a beam at them, though due to the intervention of Opal's family, it missed them and blew a hole in the hill overlooking the town. Not wasting any more time, Bolin and Opal freed Zhu Li and returned to the factory to pick up the others, before flying off to safety.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Making amends"
      ],
      "text": "The following day, after Opal alerted them that the demonstration was about to start, Bolin, Toph, and Lin burrowed themselves a tunnel toward the underground cavern where the Beifong family was being held captive. With Toph's help, Bolin catapulted Lin atop the wooden cell, so she could swing back all the prisoners on her cable and he could catch them. Everything went well, until the acrophobic Baatar inadvertently alerted the guards to their presence. Despite this setback, Bolin radioed to Opal that their mission had been a success and that they were resurfacing. Reuniting with Opal, Bolin learned that Zhu Li had been captured and sentenced to die in the abandoned town that was to be blown up by the cannon and he promptly noted that he had to save her. He reasoned that since Zhu Li had been lying about trying to fix the cannon, she must have been attempting to stop it. When Toph hypothesized that Zhu Li was merely covering up a mistake she had made, Bolin decidedly noted that the woman did not make mistakes. He told the Beifong family to leave without him, though as he made his way over to the abandoned town, he was joined on his quest by Opal, who took them there on Juicy. Before they could free Zhu Li, however, the cannon fired a beam at them, though due to the intervention of Opal's family, it missed them and blew a hole in the hill overlooking the town. Not wasting any more time, Bolin and Opal freed Zhu Li and returned to the factory to pick up the others, before flying off to safety."
    },
    {
      "body": "Landing in a bamboo forest, Bolin hugged Lin and Toph after the two reconciled their differences, noting that having a family was special. His intervention was not appreciated by the two Beifongs, however, and he was shoved back by Lin after Toph had freed herself from his embrace. When Zhu Li thanked everyone for saving her, she urged them not to be too hard on Bolin for having worked for Kuvira, emphasizing that his heart had been in the right place. Much to his surprise and delight, Opal noted that he had worked his way out of the \"polar bear dog house\" and kissed him on the cheek. His euphoric mood was broken, however, when Zhu Li revealed that they needed to return to Republic City as soon as possible and alert everyone that Kuvira planned to attack it two weeks later.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Making amends"
      ],
      "text": "Landing in a bamboo forest, Bolin hugged Lin and Toph after the two reconciled their differences, noting that having a family was special. His intervention was not appreciated by the two Beifongs, however, and he was shoved back by Lin after Toph had freed herself from his embrace. When Zhu Li thanked everyone for saving her, she urged them not to be too hard on Bolin for having worked for Kuvira, emphasizing that his heart had been in the right place. Much to his surprise and delight, Opal noted that he had worked his way out of the \"polar bear dog house\" and kissed him on the cheek. His euphoric mood was broken, however, when Zhu Li revealed that they needed to return to Republic City as soon as possible and alert everyone that Kuvira planned to attack it two weeks later."
    },
    {
      "body": "Having returned to Republic City, Bolin, Lin, Suyin, and Zhu Li immediately set course for City Hall, where they interrupted a meeting between President Raiko, Avatar Korra, Prince Wu, Mako, and Tenzin. As he entered, President Raiko immediately snapped at him, asking why he always interrupted important presidential meetings. Bolin did not answer the question, though instead answered Korra's, who had asked how Suyin had escaped her imprisonment. He noted that he, Opal, and Lin had rescued the Beifong family, had encountered Kuvira and her spirit energy cannon, and that they had brought back Zhu Li, who had been on their side all along and informed everyone that Kuvira planned to ${link_0} two weeks later.",
      "links": [
        {
          "body": "attack",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Defending Republic City"
      ],
      "text": "Having returned to Republic City, Bolin, Lin, Suyin, and Zhu Li immediately set course for City Hall, where they interrupted a meeting between President Raiko, Avatar Korra, Prince Wu, Mako, and Tenzin. As he entered, President Raiko immediately snapped at him, asking why he always interrupted important presidential meetings. Bolin did not answer the question, though instead answered Korra's, who had asked how Suyin had escaped her imprisonment. He noted that he, Opal, and Lin had rescued the Beifong family, had encountered Kuvira and her spirit energy cannon, and that they had brought back Zhu Li, who had been on their side all along and informed everyone that Kuvira planned to attack two weeks later."
    },
    {
      "body": "After the meeting, Bolin gave Zhu Li the chance to change her clothes before he led her toward the Future Industries factory where Varrick was overseeing the manufacturing of the ${link_0}. He told the inventor that he had gone to Zaofu to save Suyin and her family and upon noting that they had also found someone else, he presented Zhu Li, urging Varrick to open up to his former assistant, before stepping back to let them talk. He slapped himself against the forehead, however, after Zhu Li ran out on Varrick when the eccentric businessman failed to treat her as an equal.",
      "links": [
        {
          "body": "hummingbird mecha suits",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hummingbird_mecha_suit",
            "page": "Hummingbird_mecha_suit"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Defending Republic City"
      ],
      "text": "After the meeting, Bolin gave Zhu Li the chance to change her clothes before he led her toward the Future Industries factory where Varrick was overseeing the manufacturing of the hummingbird mecha suits. He told the inventor that he had gone to Zaofu to save Suyin and her family and upon noting that they had also found someone else, he presented Zhu Li, urging Varrick to open up to his former assistant, before stepping back to let them talk. He slapped himself against the forehead, however, after Zhu Li ran out on Varrick when the eccentric businessman failed to treat her as an equal."
    },
    {
      "body": "Bolin later talked to Korra, Mako, and Asami and decided that they would try to take out the spirit energy cannon in order to increase the United Forces' chances of winning against Kuvira. Discovering the army the next day to only being hours away from the city, a week before they had been expecting them, Bolin was shocked to see the enormous mecha suit that was transporting the cannon. When Kuvira took aim at them, Bolin urged Korra to steer their bison out of there and they only narrowly avoided being shot out of the sky twice. Team Avatar returned to Air Temple Island, where they reported on Kuvira's progress. With her attack imminent, Bolin, Mako, Asami, Suyin, Wei, and Wing headed toward the Future Industries factory in an attempt to finish construction on a few hummingbird mecha suits. From there, he witnessed in shock how Kuvira destroyed the United Forces ${link_0} in a matter of seconds.",
      "links": [
        {
          "body": "battleships",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Battleship",
            "page": "Battleship"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Defending Republic City"
      ],
      "text": "Bolin later talked to Korra, Mako, and Asami and decided that they would try to take out the spirit energy cannon in order to increase the United Forces' chances of winning against Kuvira. Discovering the army the next day to only being hours away from the city, a week before they had been expecting them, Bolin was shocked to see the enormous mecha suit that was transporting the cannon. When Kuvira took aim at them, Bolin urged Korra to steer their bison out of there and they only narrowly avoided being shot out of the sky twice. Team Avatar returned to Air Temple Island, where they reported on Kuvira's progress. With her attack imminent, Bolin, Mako, Asami, Suyin, Wei, and Wing headed toward the Future Industries factory in an attempt to finish construction on a few hummingbird mecha suits. From there, he witnessed in shock how Kuvira destroyed the United Forces battleships in a matter of seconds."
    },
    {
      "body": "After Korra joined them and revealed that Raiko had surrendered, leaving the fate of the city in their hands, Bolin wondered how they were supposed to counter an entire army, a \"mecha giant\", and the spirit energy cannon. After Korra and a stealth team of airbenders kidnapped Baatar Jr. and brought him to the factory as well, Bolin stood by while she and Suyin tried to convince him to reveal how they could defeat the enormous mecha suit carrying the spirit energy weapon. After Baatar Jr. contacted Kuvira and seemingly succeeded to convince her to cease her conquest of the United Republic, Bolin was forced to run for his life, when Kuvira traced Baatar Jr.'s radio call toward the factory and blew it up with her spirit energy cannon. He managed to survive the explosion and lifted an enormous piece of concrete by himself, allowing everyone to emerge from the rubble as well. When Tenzin warned them that Kuvira was heading their way with a battalion of mecha suits, Bolin sadly noted that it might be best to let Kuvira take the city for the time being until they could figure out a way to beat her. Since Korra refused to let the city fall, however, he joined her and the other ${link_0} on their quest to take down the spirit energy cannon, while Varrick and Asami worked on adjusting the prototypes of the hummingbird mecha suits in order to provide them with air support.",
      "links": [
        {
          "body": "benders",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Defending Republic City"
      ],
      "text": "After Korra joined them and revealed that Raiko had surrendered, leaving the fate of the city in their hands, Bolin wondered how they were supposed to counter an entire army, a \"mecha giant\", and the spirit energy cannon. After Korra and a stealth team of airbenders kidnapped Baatar Jr. and brought him to the factory as well, Bolin stood by while she and Suyin tried to convince him to reveal how they could defeat the enormous mecha suit carrying the spirit energy weapon. After Baatar Jr. contacted Kuvira and seemingly succeeded to convince her to cease her conquest of the United Republic, Bolin was forced to run for his life, when Kuvira traced Baatar Jr.'s radio call toward the factory and blew it up with her spirit energy cannon. He managed to survive the explosion and lifted an enormous piece of concrete by himself, allowing everyone to emerge from the rubble as well. When Tenzin warned them that Kuvira was heading their way with a battalion of mecha suits, Bolin sadly noted that it might be best to let Kuvira take the city for the time being until they could figure out a way to beat her. Since Korra refused to let the city fall, however, he joined her and the other benders on their quest to take down the spirit energy cannon, while Varrick and Asami worked on adjusting the prototypes of the hummingbird mecha suits in order to provide them with air support."
    },
    {
      "body": "Bolin, Wei, Wing, Lin, and Mako watched in worry from the cover of an alley how the airbenders assaulted Kuvira's machine with paint balloons, covering its windows and obscuring the vision of the pilots. After Lin, Wei, and Wing failed to metalbend the joints of the enormous mecha suit due to it being manufactured from platinum, Bolin created a large pool of lava underneath the machine's left foot, causing it to sink slightly. When the twins were done wrapping the mecha suit's legs with cables, he signaled the airbenders to attack the suit and blow it off balance. Their attack failed, however, and when Kuvira shot the spirit energy cannon at the airbenders, Bolin rushed to Opal's side, who had been rendered unconscious due to being knocked down by the energy emanating from the beam that nearly hit her. Carrying her in his arms, Bolin retreated with everyone else to Asami's office at Future Industries Tower.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Defending Republic City"
      ],
      "text": "Bolin, Wei, Wing, Lin, and Mako watched in worry from the cover of an alley how the airbenders assaulted Kuvira's machine with paint balloons, covering its windows and obscuring the vision of the pilots. After Lin, Wei, and Wing failed to metalbend the joints of the enormous mecha suit due to it being manufactured from platinum, Bolin created a large pool of lava underneath the machine's left foot, causing it to sink slightly. When the twins were done wrapping the mecha suit's legs with cables, he signaled the airbenders to attack the suit and blow it off balance. Their attack failed, however, and when Kuvira shot the spirit energy cannon at the airbenders, Bolin rushed to Opal's side, who had been rendered unconscious due to being knocked down by the energy emanating from the beam that nearly hit her. Carrying her in his arms, Bolin retreated with everyone else to Asami's office at Future Industries Tower."
    },
    {
      "body": "Safely inside, Bolin noticed that Varrick had created an electromagnetic pulse that had shut down the incoming mecha suit platoons, though had left Kuvira's enormous mecha suit unaffected. When he asked the inventor for an explanation, Baatar Jr. revealed that the machine had its own spirit vine-charged power core. After Lin brought Hiroshi Sato to the tower as well to help their efforts to stop Kuvira's mecha suit, Bolin took part in the new plan that was formed: the benders would once again try to stall Kuvira's advance, while Asami, Hiroshi, Varrick, and Zhu Li equipped the hummingbird mecha suits with plasma saws and, as soon as the suits were operational, the benders would relentlessly attack the mecha suit to distract Kuvira and enable the two hummingbird mecha suits to land on the enormous machine and cut a hole in it without being crushed.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Defending Republic City"
      ],
      "text": "Safely inside, Bolin noticed that Varrick had created an electromagnetic pulse that had shut down the incoming mecha suit platoons, though had left Kuvira's enormous mecha suit unaffected. When he asked the inventor for an explanation, Baatar Jr. revealed that the machine had its own spirit vine-charged power core. After Lin brought Hiroshi Sato to the tower as well to help their efforts to stop Kuvira's mecha suit, Bolin took part in the new plan that was formed: the benders would once again try to stall Kuvira's advance, while Asami, Hiroshi, Varrick, and Zhu Li equipped the hummingbird mecha suits with plasma saws and, as soon as the suits were operational, the benders would relentlessly attack the mecha suit to distract Kuvira and enable the two hummingbird mecha suits to land on the enormous machine and cut a hole in it without being crushed."
    },
    {
      "body": "As such, while standing atop a building and working together with Suyin and Lin, Bolin severed the top stories of a large building and toppled it on Kuvira's mecha suit. While the machine was buried under the rubble, he was lowered back to the street by Suyin, where Korra, Wei, and Wing where awaiting them; they were all shocked, however, to discover that the mecha suit uncovered itself without so much as a scratch. As Kuvira resumed her rampage, Bolin was baffled to see her crush Hiroshi to death in his hummingbird suit just as he completed his mission of cutting a hole in the suit's armor. Realizing they now had an opening, Bolin was grabbed by Lin and they both rappelled atop the machine with her metal cables. As Korra used her waterbending to prevent the mecha suit from crushing them as well, Bolin managed to dive inside the hole together with Suyin, Lin, Mako, and Korra.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Defending Republic City"
      ],
      "text": "As such, while standing atop a building and working together with Suyin and Lin, Bolin severed the top stories of a large building and toppled it on Kuvira's mecha suit. While the machine was buried under the rubble, he was lowered back to the street by Suyin, where Korra, Wei, and Wing where awaiting them; they were all shocked, however, to discover that the mecha suit uncovered itself without so much as a scratch. As Kuvira resumed her rampage, Bolin was baffled to see her crush Hiroshi to death in his hummingbird suit just as he completed his mission of cutting a hole in the suit's armor. Realizing they now had an opening, Bolin was grabbed by Lin and they both rappelled atop the machine with her metal cables. As Korra used her waterbending to prevent the mecha suit from crushing them as well, Bolin managed to dive inside the hole together with Suyin, Lin, Mako, and Korra."
    },
    {
      "body": "Inside, Bolin was ordered by Korra to climb up to the engine room with Mako and try to power the machine down. Using a lava disc, he cut through the locks on the hatch to grand himself and Mako access to the room. While Mako went after one guard to secure the lever there, Bolin focused on the other and assaulted him with his disc. After trading several blows, he managed to cut the steam pipe next to the metalbender, forcing the guard to leave his cover. Roughly body-checking him, knocking him unconscious against that same steam pipe, he called to Mako that he had also managed to secure his lever. Baatar Jr.'s instructions in mind to simultaneously pull the levers to power down the suit, the two brothers counted to coordinate their actions, though after nothing happened, Bolin deduced that Kuvira must have installed an override in the system.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Defending Republic City"
      ],
      "text": "Inside, Bolin was ordered by Korra to climb up to the engine room with Mako and try to power the machine down. Using a lava disc, he cut through the locks on the hatch to grand himself and Mako access to the room. While Mako went after one guard to secure the lever there, Bolin focused on the other and assaulted him with his disc. After trading several blows, he managed to cut the steam pipe next to the metalbender, forcing the guard to leave his cover. Roughly body-checking him, knocking him unconscious against that same steam pipe, he called to Mako that he had also managed to secure his lever. Baatar Jr.'s instructions in mind to simultaneously pull the levers to power down the suit, the two brothers counted to coordinate their actions, though after nothing happened, Bolin deduced that Kuvira must have installed an override in the system."
    },
    {
      "body": "When Mako mused that there had to be another way to cut the power, Bolin looked over the control panel, though refrained from touching any buttons. He told his brother that all he knew about the vines was that if they were disturbed, they would explode, inadvertently giving him the idea to zap the vines with ${link_0}. When Mako ordered him to take all the engineers to safety and explained his plan to him, he tried to dissuade Mako from going through with it, emphasizing the dangers. As his brother remained adamant, Bolin relented, though made him promise to get out as soon as he could. After telling his brother he loved him, he left with the two engineers and Mako fired his lightning at the vines. However, when the power core started to explode and Mako was rendered unconscious, half-draped over the hatch, Bolin came back for him and carried him off to safety. Despite making it in time to the lower parts of the suit to be protected from the devastating blast, the brothers were rendered unconscious as they were shaken around inside the suit.",
      "links": [
        {
          "body": "lightning",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lightning_generation",
            "page": "Lightning_generation"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Defending Republic City"
      ],
      "text": "When Mako mused that there had to be another way to cut the power, Bolin looked over the control panel, though refrained from touching any buttons. He told his brother that all he knew about the vines was that if they were disturbed, they would explode, inadvertently giving him the idea to zap the vines with lightning. When Mako ordered him to take all the engineers to safety and explained his plan to him, he tried to dissuade Mako from going through with it, emphasizing the dangers. As his brother remained adamant, Bolin relented, though made him promise to get out as soon as he could. After telling his brother he loved him, he left with the two engineers and Mako fired his lightning at the vines. However, when the power core started to explode and Mako was rendered unconscious, half-draped over the hatch, Bolin came back for him and carried him off to safety. Despite making it in time to the lower parts of the suit to be protected from the devastating blast, the brothers were rendered unconscious as they were shaken around inside the suit."
    },
    {
      "body": "After they regained consciousness, Bolin helped Mako to exit the suit. As he pushed open hatch, he was shocked to find that the ${link_0} had been blasted open, which happened when Kuvira had fired the spirit energy cannon from within the vegetation, and housed a new ${link_1} in its center. Realizing Korra and Kuvira were nowhere to be found, Bolin and the rest of Team Avatar set out to search the area for the Avatar. He watched in surprise when the spirits emerged a few moments later from the new portal, followed by Korra and Kuvira. After Kuvira was handcuffed and escorted away, Bolin hugged Korra, with the rest of Team Avatar soon joining in.",
      "links": [
        {
          "body": "Spirit Wilds",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_portal",
            "page": "Spirit_portal"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "Defending Republic City"
      ],
      "text": "After they regained consciousness, Bolin helped Mako to exit the suit. As he pushed open hatch, he was shocked to find that the Spirit Wilds had been blasted open, which happened when Kuvira had fired the spirit energy cannon from within the vegetation, and housed a new spirit portal in its center. Realizing Korra and Kuvira were nowhere to be found, Bolin and the rest of Team Avatar set out to search the area for the Avatar. He watched in surprise when the spirits emerged a few moments later from the new portal, followed by Korra and Kuvira. After Kuvira was handcuffed and escorted away, Bolin hugged Korra, with the rest of Team Avatar soon joining in."
    },
    {
      "body": "Later, Bolin acted as the official during Varrick and Zhu Li's wedding. When Pabu gave him the couple's vows, he read them out loud, though when he came to Varrick's, noticing that he had requested for Zhu Li to scrub his calluses on a bi-weekly basis, Bolin promptly stated that he was not reading all of that. As Zhu Li accepted the vows nonetheless, he announced that they could \"do the thing\" and stepped back to allow the couple to kiss. Afterward, during the dinner party, Bolin was dragged on the dancing floor by Opal.",
      "links": [],
      "section": [
        "History of Bolin (174 AG)",
        "Defending Republic City"
      ],
      "text": "Later, Bolin acted as the official during Varrick and Zhu Li's wedding. When Pabu gave him the couple's vows, he read them out loud, though when he came to Varrick's, noticing that he had requested for Zhu Li to scrub his calluses on a bi-weekly basis, Bolin promptly stated that he was not reading all of that. As Zhu Li accepted the vows nonetheless, he announced that they could \"do the thing\" and stepped back to allow the couple to kiss. Afterward, during the dinner party, Bolin was dragged on the dancing floor by Opal."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "See also"
      ],
      "text": "Bolin"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Bolin (154 AG - 170 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Bolin_(154_AG_-_170_AG)",
            "page": "History_of_Bolin_(154_AG_-_170_AG)"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "See also"
      ],
      "text": "History of Bolin (154 AG - 170 AG)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Bolin (late 171 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Bolin_(late_171_AG)",
            "page": "History_of_Bolin_(late_171_AG)"
          }
        }
      ],
      "section": [
        "History of Bolin (174 AG)",
        "See also"
      ],
      "text": "History of Bolin (late 171 AG)"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Bolin_(174_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Bolin_(174_AG).html",
    "page": "History_of_Bolin_(174_AG)",
    "title": "History of Bolin (174 AG)"
  }
}