{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Six months after the ${link_0}, ${link_1} had a falling out with ${link_2} over the past decision of keeping her secluded at the ${link_3}. She chose ${link_4} as her new spiritual mentor, while he left with his family and siblings to visit all the ${link_5}.",
      "links": [
        {
          "body": "Anti-bending Revolution",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Anti-bending_Revolution",
            "page": "Anti-bending_Revolution"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Southern Water Tribe compound",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_compound",
            "page": "Southern_Water_Tribe_compound"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "air temples",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Air_temple",
            "page": "Air_temple"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)"
      ],
      "text": "Six months after the Anti-bending Revolution, Tenzin had a falling out with Korra over the past decision of keeping her secluded at the Southern Water Tribe compound. She chose Unalaq as her new spiritual mentor, while he left with his family and siblings to visit all the air temples."
    },
    {
      "body": "Six months after the revolution, Tenzin overheard Ikki telling Korra that using the ${link_0} to win a race was unfair. Tenzin was alarmed by what he heard and walked over and chastised Korra for using the Avatar State \"as a booster rocket\", saying she was using it irresponsibly. He also said that she clearly needed more training to \"grasp the depths of [her] spiritual connections\" as the Avatar, and that she was far from fully mastering airbending, the latter of which Korra rejected and unsuccessfully tried to prove her mastery of the art. Tenzin shared his plan to take Korra and his family on a vacation to the ${link_1} in order to give the Avatar \"inspiration\" to improve her airbending abilities and gain a deeper spiritual connection with her past lives. Korra did not exhibit enthusiasm after hearing this plan, and she suggested that they go to her tribe's upcoming spirit festival before going to the temples, gaining the children's support and leaving Tenzin little choice but to honor his commitment to not only teaching Korra, but also spending more time with his family, traveling to the Southern Water Tribe for the ${link_2}.",
      "links": [
        {
          "body": "Avatar State",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "air temples",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Air_temple",
            "page": "Air_temple"
          }
        },
        {
          "body": "Glacier Spirits Festival",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Glacier_Spirits_Festival",
            "page": "Glacier_Spirits_Festival"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Separation from the Avatar"
      ],
      "text": "Six months after the revolution, Tenzin overheard Ikki telling Korra that using the Avatar State to win a race was unfair. Tenzin was alarmed by what he heard and walked over and chastised Korra for using the Avatar State \"as a booster rocket\", saying she was using it irresponsibly. He also said that she clearly needed more training to \"grasp the depths of [her] spiritual connections\" as the Avatar, and that she was far from fully mastering airbending, the latter of which Korra rejected and unsuccessfully tried to prove her mastery of the art. Tenzin shared his plan to take Korra and his family on a vacation to the air temples in order to give the Avatar \"inspiration\" to improve her airbending abilities and gain a deeper spiritual connection with her past lives. Korra did not exhibit enthusiasm after hearing this plan, and she suggested that they go to her tribe's upcoming spirit festival before going to the temples, gaining the children's support and leaving Tenzin little choice but to honor his commitment to not only teaching Korra, but also spending more time with his family, traveling to the Southern Water Tribe for the Glacier Spirits Festival."
    },
    {
      "body": "While at the festival, Tenzin's position as Korra's airbending and spiritual instructor was contested by the Avatar's uncle, ${link_0} ${link_1} of the Northern Water Tribe, which led to teasing from his siblings. Korra's annoyance toward Tenzin, already prominent due to her daily training, reached its peak after she discovered that he and her father, instead of Aang, were the ones who had planned to keep her locked up in the Southern Water Tribe compound while she mastered ${link_2}, ${link_3}, and ${link_4}.",
      "links": [
        {
          "body": "Chief",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "firebending",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Separation from the Avatar"
      ],
      "text": "While at the festival, Tenzin's position as Korra's airbending and spiritual instructor was contested by the Avatar's uncle, Chief Unalaq of the Northern Water Tribe, which led to teasing from his siblings. Korra's annoyance toward Tenzin, already prominent due to her daily training, reached its peak after she discovered that he and her father, instead of Aang, were the ones who had planned to keep her locked up in the Southern Water Tribe compound while she mastered waterbending, earthbending, and firebending."
    },
    {
      "body": "Later that night, Korra was attacked by a dark spirit. Tenzin, ${link_0}, Mako, and Bolin rushed to help her, but were all powerless against its attacks. Suddenly, Unalaq appeared and calmed the spirit with a unique waterbending technique. The tribal chief's display of his knowledge in dealing with spirits, combined with Korra's growing frustration toward Tenzin, caused the Avatar to cut ties with her airbending teacher and seek Unalaq's tutelage in order to deal with the spirits and restore the Southern Water Tribe's decaying spirituality. Feeling upset and hurt, but unable to convince Korra to change her mind, Tenzin nonetheless respectfully bade the young Avatar farewell.",
      "links": [
        {
          "body": "Tonraq",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tonraq",
            "page": "Tonraq"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Separation from the Avatar"
      ],
      "text": "Later that night, Korra was attacked by a dark spirit. Tenzin, Tonraq, Mako, and Bolin rushed to help her, but were all powerless against its attacks. Suddenly, Unalaq appeared and calmed the spirit with a unique waterbending technique. The tribal chief's display of his knowledge in dealing with spirits, combined with Korra's growing frustration toward Tenzin, caused the Avatar to cut ties with her airbending teacher and seek Unalaq's tutelage in order to deal with the spirits and restore the Southern Water Tribe's decaying spirituality. Feeling upset and hurt, but unable to convince Korra to change her mind, Tenzin nonetheless respectfully bade the young Avatar farewell."
    },
    {
      "body": "The next morning, as Tenzin prepared to leave, he was approached by his mother and siblings. Katara persuaded Tenzin to take ${link_0} and ${link_1} along, reasoning that he should cherish the time he has with his entire family and that they should all visit Aang's birthplace together. Tenzin gave his mother a farewell hug and promised to see her again soon and departed with his family.",
      "links": [
        {
          "body": "Kya",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kya",
            "page": "Kya"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi",
            "page": "Bumi"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Family vacation"
      ],
      "text": "The next morning, as Tenzin prepared to leave, he was approached by his mother and siblings. Katara persuaded Tenzin to take Kya and Bumi along, reasoning that he should cherish the time he has with his entire family and that they should all visit Aang's birthplace together. Tenzin gave his mother a farewell hug and promised to see her again soon and departed with his family."
    },
    {
      "body": "By next day, Tenzin and his family arrive at the ${link_0}, where they are greeted by Abbott Shung, who presents Tenzin and Pema respectively with an airbender head shaver and a large bouquet of flowers. Nearby, Jinora and Ikki began arguing over a book, and Meelo popped up on Shung's head with a ${link_1} in his hands, whom he named ${link_2}, and chased after him when the lemur got loose.",
      "links": [
        {
          "body": "Southern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        },
        {
          "body": "ring-tailed winged lemur",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ring-tailed_winged_lemur",
            "page": "Ring-tailed_winged_lemur"
          }
        },
        {
          "body": "Poki",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Poki",
            "page": "Poki"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Family vacation"
      ],
      "text": "By next day, Tenzin and his family arrive at the Southern Air Temple, where they are greeted by Abbott Shung, who presents Tenzin and Pema respectively with an airbender head shaver and a large bouquet of flowers. Nearby, Jinora and Ikki began arguing over a book, and Meelo popped up on Shung's head with a ring-tailed winged lemur in his hands, whom he named Poki, and chased after him when the lemur got loose."
    },
    {
      "body": "Tenzin and Jinora later visited the hall of Avatar statues, before noticing that Ikki and Meelo were absent. Next thing he knew, the two came whizzing by on air scooters, in which Meelo crashed into and accidentally broke a statue, forcing Tenzin to attend to him.",
      "links": [],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Family vacation"
      ],
      "text": "Tenzin and Jinora later visited the hall of Avatar statues, before noticing that Ikki and Meelo were absent. Next thing he knew, the two came whizzing by on air scooters, in which Meelo crashed into and accidentally broke a statue, forcing Tenzin to attend to him."
    },
    {
      "body": "One morning, Tenzin was sitting comfortably with his wife and sister when Bumi interrupted their tranquility. Bumi remarked how glad he was to see \"Vacation Tenzin\" and Tenzin agreed, saying he was happy to spend time with his family as he took Rohan from Pema and playfully asked the baby if he thought the same. Tenzin commented that it was just like the vacations he and his siblings took as children with their father. Kya cut him off, saying his memory was fuzzy, as she and Bumi had never gone on any of those vacations. Perplexed, Tenzin recalled riding the ${link_0} on Kyoshi Island and building sand castles on the Ember Island beach. Kya and Bumi corrected him both times, saying they were not there. Before Tenzin could respond, Jinora and Meelo came in on air scooters. Tenzin laughed when Meelo noticed his uncle's belly and asked if he had a baby in it. After Pema scolded the children for teasing Ikki and making her run away, Tenzin calmed his wife down by reassuring her that Ikki could not have gotten far and that he would go look for her. Bumi and Kya offered to help and Tenzin graciously accepted.",
      "links": [
        {
          "body": "elephant koi",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Elephant_koi",
            "page": "Elephant_koi"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Family vacation"
      ],
      "text": "One morning, Tenzin was sitting comfortably with his wife and sister when Bumi interrupted their tranquility. Bumi remarked how glad he was to see \"Vacation Tenzin\" and Tenzin agreed, saying he was happy to spend time with his family as he took Rohan from Pema and playfully asked the baby if he thought the same. Tenzin commented that it was just like the vacations he and his siblings took as children with their father. Kya cut him off, saying his memory was fuzzy, as she and Bumi had never gone on any of those vacations. Perplexed, Tenzin recalled riding the elephant koi on Kyoshi Island and building sand castles on the Ember Island beach. Kya and Bumi corrected him both times, saying they were not there. Before Tenzin could respond, Jinora and Meelo came in on air scooters. Tenzin laughed when Meelo noticed his uncle's belly and asked if he had a baby in it. After Pema scolded the children for teasing Ikki and making her run away, Tenzin calmed his wife down by reassuring her that Ikki could not have gotten far and that he would go look for her. Bumi and Kya offered to help and Tenzin graciously accepted."
    },
    {
      "body": "Tenzin, Kya, and Bumi searched the mountains for Ikki, calling out to her as the sun was setting. When Kya said she could not find Ikki anywhere, Tenzin blamed himself for her running away and Kya agreed with him. When Tenzin questioned her about it, she told him that he was probably too focused on his job in Republic City and Tenzin agreed with her, saying he only wanted to be like their father. Kya interjected and told him he was exactly like their father, who did not have any time for any of them, to which Bumi added that Aang always made time for \"his little airbender\". When Tenzin asked his siblings why they were bringing up the past like this, Kya told him that he was under some kind of illusion that their family life growing up was perfect when it was not. Tenzin changed the subject, saying they had to find Ikki before dark. When Kya tried to tease him for cutting and running, Tenzin simply gestured for his siblings to follow him without looking back.",
      "links": [],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Family vacation"
      ],
      "text": "Tenzin, Kya, and Bumi searched the mountains for Ikki, calling out to her as the sun was setting. When Kya said she could not find Ikki anywhere, Tenzin blamed himself for her running away and Kya agreed with him. When Tenzin questioned her about it, she told him that he was probably too focused on his job in Republic City and Tenzin agreed with her, saying he only wanted to be like their father. Kya interjected and told him he was exactly like their father, who did not have any time for any of them, to which Bumi added that Aang always made time for \"his little airbender\". When Tenzin asked his siblings why they were bringing up the past like this, Kya told him that he was under some kind of illusion that their family life growing up was perfect when it was not. Tenzin changed the subject, saying they had to find Ikki before dark. When Kya tried to tease him for cutting and running, Tenzin simply gestured for his siblings to follow him without looking back."
    },
    {
      "body": "When Bumi started telling them a story about a rescue mission, Tenzin sighed at hearing the story again. The longer the story went on, the more irritated Tenzin became until he snapped at his brother, asking how the story would help them find Ikki. When Bumi told him he was only trying to lighten the mood, Tenzin began pointing out all of the incongruities in Bumi's story, such as there being three typhoons. Kya interrupted, telling Tenzin to bring his lantern to her as she found footprints. Later, Tenzin easily descended a waterfall with Kya as Bumi used some rocks to jump down, though slipped and plunged into the water below. When Kya was healing Bumi after he hurt himself, Tenzin and Kya's scolding turned into an argument between all three siblings. After the argument, Tenzin told his siblings to go back to the temple to see if Ikki had come back while he would continue looking for her alone.",
      "links": [],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Family vacation"
      ],
      "text": "When Bumi started telling them a story about a rescue mission, Tenzin sighed at hearing the story again. The longer the story went on, the more irritated Tenzin became until he snapped at his brother, asking how the story would help them find Ikki. When Bumi told him he was only trying to lighten the mood, Tenzin began pointing out all of the incongruities in Bumi's story, such as there being three typhoons. Kya interrupted, telling Tenzin to bring his lantern to her as she found footprints. Later, Tenzin easily descended a waterfall with Kya as Bumi used some rocks to jump down, though slipped and plunged into the water below. When Kya was healing Bumi after he hurt himself, Tenzin and Kya's scolding turned into an argument between all three siblings. After the argument, Tenzin told his siblings to go back to the temple to see if Ikki had come back while he would continue looking for her alone."
    },
    {
      "body": "By morning, Tenzin found Ikki hiding away in a cave with four ${link_0} calves, where she was having breakfast. He walked in on her as she was saying a blessing, which ended in her dissing her siblings. He joined her and was introduced to the bison calves, which Ikki saw as her new brothers and sisters. Upon hearing this, Tenzin asked his daughter if the calves could be his new siblings as well. As time passed, he bonded with the calf that Ikki had named Blueberry Spicehead, enjoying himself by petting the animal. When Ikki proposed to invite Bumi and Kya, Tenzin opposed to idea, stating that they would only spoil their good mood. Surprised by her father's comment, the young airbender proceeded by listing all the good qualities of Kya and Bumi. Tenzin countered by doing the same for Meelo and Jinora, causing them both to come to the conclusion that being part of a family is not always easy, though it does mean that there will always be someone there for when needed.",
      "links": [
        {
          "body": "flying bison",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Flying_bison",
            "page": "Flying_bison"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Family vacation"
      ],
      "text": "By morning, Tenzin found Ikki hiding away in a cave with four flying bison calves, where she was having breakfast. He walked in on her as she was saying a blessing, which ended in her dissing her siblings. He joined her and was introduced to the bison calves, which Ikki saw as her new brothers and sisters. Upon hearing this, Tenzin asked his daughter if the calves could be his new siblings as well. As time passed, he bonded with the calf that Ikki had named Blueberry Spicehead, enjoying himself by petting the animal. When Ikki proposed to invite Bumi and Kya, Tenzin opposed to idea, stating that they would only spoil their good mood. Surprised by her father's comment, the young airbender proceeded by listing all the good qualities of Kya and Bumi. Tenzin countered by doing the same for Meelo and Jinora, causing them both to come to the conclusion that being part of a family is not always easy, though it does mean that there will always be someone there for when needed."
    },
    {
      "body": "When Tenzin and Ikki returned to the temple, they were happily greeted by their family. After watching Jinora and Meelo make up with Ikki and run off to play together, Tenzin approached his own siblings and apologized to them. He acknowledged that he had been too busy celebrating Aang's legacy, causing him to overlook parts of him that were not ideal. He received an apology from Kya and Bumi in return, and the siblings made up by reminiscing over an old family photo.",
      "links": [],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Family vacation"
      ],
      "text": "When Tenzin and Ikki returned to the temple, they were happily greeted by their family. After watching Jinora and Meelo make up with Ikki and run off to play together, Tenzin approached his own siblings and apologized to them. He acknowledged that he had been too busy celebrating Aang's legacy, causing him to overlook parts of him that were not ideal. He received an apology from Kya and Bumi in return, and the siblings made up by reminiscing over an old family photo."
    },
    {
      "body": "As things calmed down, Tenzin enjoyed relaxing at the temple. He watched from a distance how his eldest son attempted to train his ring-tailed winged lemur, Poki, muttering to himself how Meelo was going about it all wrong, making classic mistakes such as over-rewarding the animal for and failing to establish a bond of dominance. When the creature flew away, Tenzin approached his son and offered him to teach him how to become a master trainer, something the young airbender gladly accepted. Tenzin's teachings proved to be effective as Meelo managed to train his lemur, as well as all the other lemurs at the temple. Realizing he went too far with the training discipline, Tenzin suggested that his son would replace training with having some fun, a suggestion Meelo liked very much.",
      "links": [],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Family vacation"
      ],
      "text": "As things calmed down, Tenzin enjoyed relaxing at the temple. He watched from a distance how his eldest son attempted to train his ring-tailed winged lemur, Poki, muttering to himself how Meelo was going about it all wrong, making classic mistakes such as over-rewarding the animal for and failing to establish a bond of dominance. When the creature flew away, Tenzin approached his son and offered him to teach him how to become a master trainer, something the young airbender gladly accepted. Tenzin's teachings proved to be effective as Meelo managed to train his lemur, as well as all the other lemurs at the temple. Realizing he went too far with the training discipline, Tenzin suggested that his son would replace training with having some fun, a suggestion Meelo liked very much."
    },
    {
      "body": "Tenzin's vacation took him to visit the ${link_0}. There, he grew excited over the prospect of taking his family for a tour of the temple to show them all the ancient sites. However, before they could embark on the trip, Korra arrived, pleasantly surprising everyone. Even though they had parted on shaky grounds, Tenzin was glad to see the young Avatar again, but wondered what she was doing there as opposed to training at the ${link_1}. Unaware of the events occurring elsewhere due to his decision to stay out of touch with the outside world during the family's retreat, he implored Korra to bring them up to speed with everything. After Korra shared the outlines of the situation with everyone, Tenzin and the Avatar retreated to one of the temple's gardens to discuss it more in depth. Although he was shocked about the lengths Unalaq was willing to go for power, Tenzin remained focused at the task at hand, namely aiding Korra cross over to the ${link_2} in order to close the Southern ${link_3}.",
      "links": [
        {
          "body": "Eastern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        },
        {
          "body": "South Pole",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_portal",
            "page": "Spirit_portal"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Reconciling with the Avatar"
      ],
      "text": "Tenzin's vacation took him to visit the Eastern Air Temple. There, he grew excited over the prospect of taking his family for a tour of the temple to show them all the ancient sites. However, before they could embark on the trip, Korra arrived, pleasantly surprising everyone. Even though they had parted on shaky grounds, Tenzin was glad to see the young Avatar again, but wondered what she was doing there as opposed to training at the South Pole. Unaware of the events occurring elsewhere due to his decision to stay out of touch with the outside world during the family's retreat, he implored Korra to bring them up to speed with everything. After Korra shared the outlines of the situation with everyone, Tenzin and the Avatar retreated to one of the temple's gardens to discuss it more in depth. Although he was shocked about the lengths Unalaq was willing to go for power, Tenzin remained focused at the task at hand, namely aiding Korra cross over to the Spirit World in order to close the Southern spirit portal."
    },
    {
      "body": "Together, Tenzin and Korra visited the stone garden where Aang and Guru ${link_0} went on a spiritual journey seventy one years prior, inspiring the young Avatar with confidence that she could enter the Spirit World. Although Tenzin's family helped to set the mood for meditation, neither Tenzin nor Korra could successfully meditate into the Spirit World, severely annoying the master airbender. After three failed attempts at three different locations, Tenzin confessed to Korra that he had never entered the Spirit World before, deeming it to be his greatest shortcoming as an airbender, spiritual leader, and son of Aang. Despite that, he remained adamant that it was his destiny to guide the Avatar to the Spirit World, having spent years studying spiritual matters. When Kya suggested Jinora might be able to help, Tenzin brushed aside the notion, believing her to be too young and untrained to be knowledgeable over spiritual affairs. However, he was shocked to be proven wrong when his daughter called upon her ${link_1} to reveal themselves. Baffled, Tenzin asked how long she had been able to do that, and grew jealous upon learning that she had always had a natural connection with spirits, while he had none.",
      "links": [
        {
          "body": "Pathik",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pathik",
            "page": "Pathik"
          }
        },
        {
          "body": "dragonfly bunny spirits",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Dragonfly_bunny_spirit",
            "page": "Dragonfly_bunny_spirit"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Reconciling with the Avatar"
      ],
      "text": "Together, Tenzin and Korra visited the stone garden where Aang and Guru Pathik went on a spiritual journey seventy one years prior, inspiring the young Avatar with confidence that she could enter the Spirit World. Although Tenzin's family helped to set the mood for meditation, neither Tenzin nor Korra could successfully meditate into the Spirit World, severely annoying the master airbender. After three failed attempts at three different locations, Tenzin confessed to Korra that he had never entered the Spirit World before, deeming it to be his greatest shortcoming as an airbender, spiritual leader, and son of Aang. Despite that, he remained adamant that it was his destiny to guide the Avatar to the Spirit World, having spent years studying spiritual matters. When Kya suggested Jinora might be able to help, Tenzin brushed aside the notion, believing her to be too young and untrained to be knowledgeable over spiritual affairs. However, he was shocked to be proven wrong when his daughter called upon her dragonfly bunny spirits to reveal themselves. Baffled, Tenzin asked how long she had been able to do that, and grew jealous upon learning that she had always had a natural connection with spirits, while he had none."
    },
    {
      "body": "Although Tenzin strongly believed in his training and the historic manuscripts that stated the spiritual energy to be strongest at the temple, he reluctantly followed suit nonetheless when Korra, Kya, Bumi, and Jinora decided to follow the spirits. He was amazed when they arrived to an ancient airbender meditation circle. Noticing how it had been neglected for years, distorting its energy and connection to the Spirit World, he performed a spiritual cleansing ceremony. Burning incense, he used his bending to rhythmically distribute the smoke around the site, which scared away the dragonfly bunny spirits and eventually drew out a swarm of bat-like dark spirits that immediately attacked the group. Tenzin tried to blow them away, though his bending had no effect on the entities. At a loss about what to do, he watched in awe how Korra stepped forward and used Unalaq's spiritbending technique to pacify and disperse the dark entities, cleansing their hold on the site in the process. Walking up to her, Tenzin bitterly noted how much more effective Unalaq's teachings had been for her spiritual training, though he was immediately put at ease by Korra who emphasized that he had at least helped her for her, not for personal gain. She proceeded to apologize for how she had treated him, expressing her regret over turning her back on him. When Korra stated that she needed him more than ever, Tenzin promptly stated that he would not let her down, before sharing a hug with the young Avatar.",
      "links": [],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Reconciling with the Avatar"
      ],
      "text": "Although Tenzin strongly believed in his training and the historic manuscripts that stated the spiritual energy to be strongest at the temple, he reluctantly followed suit nonetheless when Korra, Kya, Bumi, and Jinora decided to follow the spirits. He was amazed when they arrived to an ancient airbender meditation circle. Noticing how it had been neglected for years, distorting its energy and connection to the Spirit World, he performed a spiritual cleansing ceremony. Burning incense, he used his bending to rhythmically distribute the smoke around the site, which scared away the dragonfly bunny spirits and eventually drew out a swarm of bat-like dark spirits that immediately attacked the group. Tenzin tried to blow them away, though his bending had no effect on the entities. At a loss about what to do, he watched in awe how Korra stepped forward and used Unalaq's spiritbending technique to pacify and disperse the dark entities, cleansing their hold on the site in the process. Walking up to her, Tenzin bitterly noted how much more effective Unalaq's teachings had been for her spiritual training, though he was immediately put at ease by Korra who emphasized that he had at least helped her for her, not for personal gain. She proceeded to apologize for how she had treated him, expressing her regret over turning her back on him. When Korra stated that she needed him more than ever, Tenzin promptly stated that he would not let her down, before sharing a hug with the young Avatar."
    },
    {
      "body": "Believing in the site's spiritual connection, Tenzin confidently stated that if they were to meditate there, they would succeed to cross over, growing excited once again over the prospect of finally being able to fulfill the dream his father had for him. However, even though he meditated for the remainder of the day, Tenzin did not manage to connect, much to his frustration. He stubbornly held on to his belief that if he was just given the time, he would be able to guide Korra, renouncing the option to allow Jinora to do it, asserting that she was not ready for the dangers of the Spirit World like he was. However, when Jinora reassured him that she could do it while remaining out of harm, Tenzin conceded, and accepted that he might never have the connection to spirits like he always wanted. He hugged his daughter, telling her how proud he was of her, and stepped aside to make way for Jinora as Korra's guide to the Spirit World, stating that he would watch over their bodies alongside Bumi and Kya until they returned.",
      "links": [],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Reconciling with the Avatar"
      ],
      "text": "Believing in the site's spiritual connection, Tenzin confidently stated that if they were to meditate there, they would succeed to cross over, growing excited once again over the prospect of finally being able to fulfill the dream his father had for him. However, even though he meditated for the remainder of the day, Tenzin did not manage to connect, much to his frustration. He stubbornly held on to his belief that if he was just given the time, he would be able to guide Korra, renouncing the option to allow Jinora to do it, asserting that she was not ready for the dangers of the Spirit World like he was. However, when Jinora reassured him that she could do it while remaining out of harm, Tenzin conceded, and accepted that he might never have the connection to spirits like he always wanted. He hugged his daughter, telling her how proud he was of her, and stepped aside to make way for Jinora as Korra's guide to the Spirit World, stating that he would watch over their bodies alongside Bumi and Kya until they returned."
    },
    {
      "body": "As Tenzin and his siblings sat around a campfire, close to the girls' bodies, he confessed to his feelings of helplessness and worry about their safety in the Spirit World. To put him at ease, Kya assured him that his daughter was smart and had a strong connection to the spirits, while Bumi noted that their father traveled to the Spirit World all the time. Not convinced, Tenzin stated that they would be defenseless without their bending, a statement to which Bumi took offense. The airbending master attempted to explain why Bumi's situation was different, but was unable to come up with a reason, looking to his sister for assistance. He subsequently informed his siblings that he would take the first watch, telling them to get some rest, and in turn, they assured him that they were there for him if he needed them. Tenzin thanked them, and walked over to Jinora's silent form, squatting beside her and lovingly rub her head, urging his eldest child to return soon.",
      "links": [],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Reconciling with the Avatar"
      ],
      "text": "As Tenzin and his siblings sat around a campfire, close to the girls' bodies, he confessed to his feelings of helplessness and worry about their safety in the Spirit World. To put him at ease, Kya assured him that his daughter was smart and had a strong connection to the spirits, while Bumi noted that their father traveled to the Spirit World all the time. Not convinced, Tenzin stated that they would be defenseless without their bending, a statement to which Bumi took offense. The airbending master attempted to explain why Bumi's situation was different, but was unable to come up with a reason, looking to his sister for assistance. He subsequently informed his siblings that he would take the first watch, telling them to get some rest, and in turn, they assured him that they were there for him if he needed them. Tenzin thanked them, and walked over to Jinora's silent form, squatting beside her and lovingly rub her head, urging his eldest child to return soon."
    },
    {
      "body": "The next morning, Tenzin and his siblings were startled by Korra's sudden return to the physical world. The airbender rushed to her side and asked her if she was able to close the portal and if Jinora was able to help. However, when Korra, looking upset, apologized, Tenzin grew alarmed as he looked toward Jinora, who was still silent and motionless. He rushed over his daughter, wondering why she would not wake up, and turned to Korra, asking her what had happened.",
      "links": [],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Reconciling with the Avatar"
      ],
      "text": "The next morning, Tenzin and his siblings were startled by Korra's sudden return to the physical world. The airbender rushed to her side and asked her if she was able to close the portal and if Jinora was able to help. However, when Korra, looking upset, apologized, Tenzin grew alarmed as he looked toward Jinora, who was still silent and motionless. He rushed over his daughter, wondering why she would not wake up, and turned to Korra, asking her what had happened."
    },
    {
      "body": "Horrified to learn that Jinora's soul was trapped in the Spirit World by Unalaq, Tenzin cursed himself for letting Jinora ever go alone. The group quickly went to Republic City, where they explained to President Raiko the true danger of Unalaq's intentions. While believing them, Raiko refused to spare any assistance, instead focusing all man-power on protecting the city should it be attacked. With Raiko being no help, the group instead gained assistance from Varrick despite being imprisoned for recent crimes. He allowed Korra and the others to take his personal battleship and all its resources.",
      "links": [],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Reconciling with the Avatar"
      ],
      "text": "Horrified to learn that Jinora's soul was trapped in the Spirit World by Unalaq, Tenzin cursed himself for letting Jinora ever go alone. The group quickly went to Republic City, where they explained to President Raiko the true danger of Unalaq's intentions. While believing them, Raiko refused to spare any assistance, instead focusing all man-power on protecting the city should it be attacked. With Raiko being no help, the group instead gained assistance from Varrick despite being imprisoned for recent crimes. He allowed Korra and the others to take his personal battleship and all its resources."
    },
    {
      "body": "During the week spent traveling to the Southern Water Tribe, Tenzin began drilling Korra on her airbending. Upon arriving, they immediately went to Katara in hopes that her healing skills could help sustain Jinora's life force without her soul after so long. It was learned that the entire Southern rebellion was defeated by Unalaq and his army of dark spirits. Realizing that the Southern portal would be heavily guarded, the team took Varrick's biplane and Oogi for an aerial assault. Ultimately, Unalaq was prepared for this and quickly had his forces subdue Tenzin and the others, minus Bumi who fell off Oogi. Unalaq presented himself to his captured foes and revealed his intentions; to fuse with Vaatu to become a Dark Avatar and usher in a new world order connects the material and Spirit World. After Unalaq left to await Harmonic Convergence in the Spirit World, Tenzin and the others were saved by Bumi and Naga. The group proceeded to enter the Spirit World.",
      "links": [],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "During the week spent traveling to the Southern Water Tribe, Tenzin began drilling Korra on her airbending. Upon arriving, they immediately went to Katara in hopes that her healing skills could help sustain Jinora's life force without her soul after so long. It was learned that the entire Southern rebellion was defeated by Unalaq and his army of dark spirits. Realizing that the Southern portal would be heavily guarded, the team took Varrick's biplane and Oogi for an aerial assault. Ultimately, Unalaq was prepared for this and quickly had his forces subdue Tenzin and the others, minus Bumi who fell off Oogi. Unalaq presented himself to his captured foes and revealed his intentions; to fuse with Vaatu to become a Dark Avatar and usher in a new world order connects the material and Spirit World. After Unalaq left to await Harmonic Convergence in the Spirit World, Tenzin and the others were saved by Bumi and Naga. The group proceeded to enter the Spirit World."
    },
    {
      "body": "While Korra, Mako, and Bolin went to deal with Unalaq, Tenzin, and his siblings went to find Jinora's soul. Quickly lost and confused by the Spirit World, they were soon found by ${link_0}. While happy to see his old friend after forty years, Tenzin declined the wise firebender's offer to be brought home as they still needed to find Jinora. Iroh accepted their choice and warned them of the impending danger, to which Tenzin realized where Jinora was. He quickly provoked the giant ${link_1} from earlier, intentionally getting captured and was brought to the ${link_2}. Knowing well about its dangerous nature of driving lost souls insane, Tenzin tried to keep his siblings focused. Ultimately, Bumi and Kya fell victim to the fog's effect, running away in fear. As Tenzin began to desperately cling to his views on who he was, he was met by a manifestation of Aang himself. Tenzin profusely apologized to his father for not being more like him. Aang agreed with Tenzin, much to the younger airbender's shock, and continued by saying he should never have tried to mimic him in the first place, and that he put up a false perception of himself. Aang finished by saying that Tenzin was not him, and that he should not be him, but be himself instead. Understanding what Aang meant, Tenzin finally stepped out from his father's shadow and embraced his spiritual side. With his new clarity, the fog let up, allowing Tenzin to collect his siblings and daughter's soul. As Tenzin's siblings regained their sanity and Jinora her consciousness, they embraced one another. As they prepared to leave, Tenzin's daughter sensed that something was wrong with Korra and disappeared to help her.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "dark spider spirit",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_spider_spirit",
            "page": "Dark_spider_spirit"
          }
        },
        {
          "body": "Fog of Lost Souls",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fog_of_Lost_Souls",
            "page": "Fog_of_Lost_Souls"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "While Korra, Mako, and Bolin went to deal with Unalaq, Tenzin, and his siblings went to find Jinora's soul. Quickly lost and confused by the Spirit World, they were soon found by Iroh. While happy to see his old friend after forty years, Tenzin declined the wise firebender's offer to be brought home as they still needed to find Jinora. Iroh accepted their choice and warned them of the impending danger, to which Tenzin realized where Jinora was. He quickly provoked the giant dark spider spirit from earlier, intentionally getting captured and was brought to the Fog of Lost Souls. Knowing well about its dangerous nature of driving lost souls insane, Tenzin tried to keep his siblings focused. Ultimately, Bumi and Kya fell victim to the fog's effect, running away in fear. As Tenzin began to desperately cling to his views on who he was, he was met by a manifestation of Aang himself. Tenzin profusely apologized to his father for not being more like him. Aang agreed with Tenzin, much to the younger airbender's shock, and continued by saying he should never have tried to mimic him in the first place, and that he put up a false perception of himself. Aang finished by saying that Tenzin was not him, and that he should not be him, but be himself instead. Understanding what Aang meant, Tenzin finally stepped out from his father's shadow and embraced his spiritual side. With his new clarity, the fog let up, allowing Tenzin to collect his siblings and daughter's soul. As Tenzin's siblings regained their sanity and Jinora her consciousness, they embraced one another. As they prepared to leave, Tenzin's daughter sensed that something was wrong with Korra and disappeared to help her."
    },
    {
      "body": "Tenzin and his siblings were guided by a light butterfly spirit and returned to the spirit portals, where they found Korra and the others defeated. After Kya healed them and Korra explained that Unalaq, merged with Vaatu, had managed to extract and destroy Raava, Tenzin was urged by Kya to console the young Avatar. He reminded her that being the Avatar did not make her great, but rather the other way around. He brought her to the ${link_0}, where inside its hollow, it projected many of Korra's memories. Tenzin reminded her that it was not Raava that defined her but her own accomplishments which mirrored those of Wan's. Upon seeing an image of Unalaq laying waste to Republic City, Korra followed Tenzin's advice to meditate on the cosmic energy of the universe. In doing so, she manifested her own spirit, which went to confront Unalaq. After Korra departed, countless dark spirits attacked the Tree of Time, in an attempt to stop Korra from threatening Unavaatu, forcing Tenzin and the other benders to attempt to protect Korra's vacant body. With Harmonic Convergence nearing its end, Korra, Jinora, and the revived Raava returned to the Spirit World after destroying the Dark Avatar, saving Tenzin and the others as they continued to defend Korra's body.",
      "links": [
        {
          "body": "Tree of Time",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "Tenzin and his siblings were guided by a light butterfly spirit and returned to the spirit portals, where they found Korra and the others defeated. After Kya healed them and Korra explained that Unalaq, merged with Vaatu, had managed to extract and destroy Raava, Tenzin was urged by Kya to console the young Avatar. He reminded her that being the Avatar did not make her great, but rather the other way around. He brought her to the Tree of Time, where inside its hollow, it projected many of Korra's memories. Tenzin reminded her that it was not Raava that defined her but her own accomplishments which mirrored those of Wan's. Upon seeing an image of Unalaq laying waste to Republic City, Korra followed Tenzin's advice to meditate on the cosmic energy of the universe. In doing so, she manifested her own spirit, which went to confront Unalaq. After Korra departed, countless dark spirits attacked the Tree of Time, in an attempt to stop Korra from threatening Unavaatu, forcing Tenzin and the other benders to attempt to protect Korra's vacant body. With Harmonic Convergence nearing its end, Korra, Jinora, and the revived Raava returned to the Spirit World after destroying the Dark Avatar, saving Tenzin and the others as they continued to defend Korra's body."
    },
    {
      "body": "Following Korra's restoration of the Avatar Cycle, Tenzin asked if she could still connect to her past lives. Korra replied sadly that she could not and possibly never would again. After Korra hesitated on her decision to close the portals, Tenzin encouraged the young Avatar to do what she felt was right, whereupon Korra decided against closing the portals.",
      "links": [],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "Following Korra's restoration of the Avatar Cycle, Tenzin asked if she could still connect to her past lives. Korra replied sadly that she could not and possibly never would again. After Korra hesitated on her decision to close the portals, Tenzin encouraged the young Avatar to do what she felt was right, whereupon Korra decided against closing the portals."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "See also"
      ],
      "text": "Tenzin"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Tenzin (119 AG - 170 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Tenzin_(119_AG_-_170_AG)",
            "page": "History_of_Tenzin_(119_AG_-_170_AG)"
          }
        }
      ],
      "section": [
        "History of Tenzin (171 AG - Harmonic Convergence)",
        "See also"
      ],
      "text": "History of Tenzin (119 AG - 170 AG)"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Tenzin_(171_AG_-_Harmonic_Convergence)",
    "file": "avatar.wikia.com/wiki/History_of_Tenzin_(171_AG_-_Harmonic_Convergence).html",
    "page": "History_of_Tenzin_(171_AG_-_Harmonic_Convergence)",
    "title": "History of Tenzin (171 AG - Harmonic Convergence)"
  }
}