{
  "categories": [
    {
      "body": "Aang",
      "target": {
        "href": "Category_Aang",
        "page": "Category_Aang"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "After being struck by ${link_0}'s ${link_1}, ${link_2} was in a coma for weeks. Once he awoke, he and the rest of ${link_3} disguised themselves as ${link_4} of the ${link_5} and planned for the ${link_6}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "lightning",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "citizens",
          "key": "${link_4}",
          "target": {
            "href": "Society_in_the_World_of_Avatar",
            "page": "Society_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_5}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "invasion",
          "key": "${link_6}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "text": "After being struck by Azula's lightning, Aang was in a coma for weeks. Once he awoke, he and the rest of Team Avatar disguised themselves as citizens of the Fire Nation and planned for the invasion."
    },
    {
      "body": "${link_0} ${link_1} helped ${link_2} escape from the ${link_3}.",
      "links": [
        {
          "body": "Princess",
          "key": "${link_0}",
          "target": {
            "href": "Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_1}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Princess Yue helped Aang escape from the Spirit World."
    },
    {
      "body": "After being shot by Azula's lethal lightning attack, Aang fell into a deep slumber. Although Aang's mind and body were immobile, his soul was trapped in the ${link_0}. He encountered ${link_1} ${link_2}, the Moon Spirit, who informed him that if he did not reconnect with his past four lives, the ${link_3} would end.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Princess",
          "key": "${link_1}",
          "target": {
            "href": "Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_2}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Avatar Cycle",
          "key": "${link_3}",
          "target": {
            "href": "Avatar#Avatar_Cycle",
            "page": "Avatar"
          }
        }
      ],
      "text": "After being shot by Azula's lethal lightning attack, Aang fell into a deep slumber. Although Aang's mind and body were immobile, his soul was trapped in the Spirit World. He encountered Princess Yue, the Moon Spirit, who informed him that if he did not reconnect with his past four lives, the Avatar Cycle would end."
    },
    {
      "body": "Aang found Avatar ${link_0} amid the fire geysers and told him about his extreme shame at failing to master the ${link_1}. However, Avatar Roku consoled him, explaining that he, too, had problems with mastering it. He confessed his first two unsuccessful attempts to master the state, and explained to Aang that it was a very difficult skill to acquire and that he should not feel ashamed. He subsequently told Aang he had to meet Avatar ${link_2} next.",
      "links": [
        {
          "body": "Roku",
          "key": "${link_0}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_1}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_2}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        }
      ],
      "text": "Aang found Avatar Roku amid the fire geysers and told him about his extreme shame at failing to master the Avatar State. However, Avatar Roku consoled him, explaining that he, too, had problems with mastering it. He confessed his first two unsuccessful attempts to master the state, and explained to Aang that it was a very difficult skill to acquire and that he should not feel ashamed. He subsequently told Aang he had to meet Avatar Kyoshi next."
    },
    {
      "body": "Aang found ${link_0}, the spirit of Senlin Forest, who took Aang to Avatar Kyoshi. She apologized for the events at ${link_1} and explained how after she defeated ${link_2} the Conqueror, balance was restored. However, she stated that she later had an error of judgment and told Aang how she assembled a group to uphold and protect the cultural heritage of ${link_3}. She trained a group of elite ${link_4}, who later became known as the ${link_5}. Aang was shocked by the revelation that an Avatar trained the Dai Li, stating that they were \"the worst, most corrupt earthbenders in the world\". Avatar Kyoshi explained that she thought it was a wise decision at the time and stated that all actions have an effect, whether positive or negative, for many lifetimes. She subsequently instructed Aang to find the ${link_6} Avatar who came before her, Avatar ${link_7}.",
      "links": [
        {
          "body": "Hei Bai",
          "key": "${link_0}",
          "target": {
            "href": "Hei_Bai",
            "page": "Hei_Bai"
          }
        },
        {
          "body": "Chin Village",
          "key": "${link_1}",
          "target": {
            "href": "Chin_Village",
            "page": "Chin_Village"
          }
        },
        {
          "body": "Chin",
          "key": "${link_2}",
          "target": {
            "href": "Chin",
            "page": "Chin"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "earthbenders",
          "key": "${link_4}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_5}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_6}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Kuruk",
          "key": "${link_7}",
          "target": {
            "href": "Kuruk",
            "page": "Kuruk"
          }
        }
      ],
      "text": "Aang found Hei Bai, the spirit of Senlin Forest, who took Aang to Avatar Kyoshi. She apologized for the events at Chin Village and explained how after she defeated Chin the Conqueror, balance was restored. However, she stated that she later had an error of judgment and told Aang how she assembled a group to uphold and protect the cultural heritage of Ba Sing Se. She trained a group of elite earthbenders, who later became known as the Dai Li. Aang was shocked by the revelation that an Avatar trained the Dai Li, stating that they were \"the worst, most corrupt earthbenders in the world\". Avatar Kyoshi explained that she thought it was a wise decision at the time and stated that all actions have an effect, whether positive or negative, for many lifetimes. She subsequently instructed Aang to find the Water Tribe Avatar who came before her, Avatar Kuruk."
    },
    {
      "body": "Aang and Hei Bai traversed a murky swamp in the ${link_0}, when they bumped into a mysterious man, who introduced himself as Avatar Kuruk. He asked Aang if he had seen a beautiful woman with long, brown hair. Aang responded by inquiring about Kuruk's dilemma to which Kuruk proceeded to tell him his history as the Avatar. Suddenly, Aang recalled his encounter with ${link_1} while in the Northern Water Tribe. He realized that one of Koh's faces was that of the woman Kuruk had described and shared this revelation. Heartened by the knowledge of where his wife was, Kuruk set off to track down Koh once again and told Aang to look for the nomadic Avatar who preceded him, Avatar ${link_2}.",
      "links": [
        {
          "body": "Realm of Koh",
          "key": "${link_0}",
          "target": {
            "href": "Realm_of_Koh",
            "page": "Realm_of_Koh"
          }
        },
        {
          "body": "Koh",
          "key": "${link_1}",
          "target": {
            "href": "Koh",
            "page": "Koh"
          }
        },
        {
          "body": "Yangchen",
          "key": "${link_2}",
          "target": {
            "href": "Yangchen",
            "page": "Yangchen"
          }
        }
      ],
      "text": "Aang and Hei Bai traversed a murky swamp in the Realm of Koh, when they bumped into a mysterious man, who introduced himself as Avatar Kuruk. He asked Aang if he had seen a beautiful woman with long, brown hair. Aang responded by inquiring about Kuruk's dilemma to which Kuruk proceeded to tell him his history as the Avatar. Suddenly, Aang recalled his encounter with Koh while in the Northern Water Tribe. He realized that one of Koh's faces was that of the woman Kuruk had described and shared this revelation. Heartened by the knowledge of where his wife was, Kuruk set off to track down Koh once again and told Aang to look for the nomadic Avatar who preceded him, Avatar Yangchen."
    },
    {
      "body": "Avatar Yangchen appeared atop the mountain in the clouds. She asked Aang what he learned from meeting his past lives. Aang realized that the past Avatars struggled and made mistakes, like he did. Aware of this, he pondered why the Avatar is born human and thus, is allowed to make mistakes, rather than being an all-knowing immortal spirit. Avatar Yangchen explained that the Avatar must experience human emotions to understand how precious human life is. She also explained that Aang's ability to enter the Avatar State had been disrupted, so he would now have to rely on ${link_0} rather than his past lives, though he would still be able to contact them. She bade him farewell and informed Aang that when he awakened, his trip to the Spirit World would be like a forgotten dream.",
      "links": [
        {
          "body": "his friends",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Avatar Yangchen appeared atop the mountain in the clouds. She asked Aang what he learned from meeting his past lives. Aang realized that the past Avatars struggled and made mistakes, like he did. Aware of this, he pondered why the Avatar is born human and thus, is allowed to make mistakes, rather than being an all-knowing immortal spirit. Avatar Yangchen explained that the Avatar must experience human emotions to understand how precious human life is. She also explained that Aang's ability to enter the Avatar State had been disrupted, so he would now have to rely on his friends rather than his past lives, though he would still be able to contact them. She bade him farewell and informed Aang that when he awakened, his trip to the Spirit World would be like a forgotten dream."
    },
    {
      "body": "${link_0} awakened weeks after the ${link_1} of ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "fall",
          "key": "${link_1}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_2}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "Aang awakened weeks after the fall of Ba Sing Se."
    },
    {
      "body": "After spending several weeks unconscious, Aang finally awoke from his coma aboard a captured ${link_0}. He found himself sporting a full head of hair, a mass of bandages, and a vicious scar on his back. ${link_1} worked on ${link_2} his body in that area and, during the session, Aang had a painful flashback to the time he had fallen. He realized that he was not just injured, but that his spirit had separated from his body and that, if it were not for Katara, he might not have returned. Though Katara insisted that it was the spirit water that saved him, Aang told her that it was not the water; it was her.",
      "links": [
        {
          "body": "Fire Nation ship",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_cruiser",
            "page": "Fire_Nation_cruiser"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "healing",
          "key": "${link_2}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "After spending several weeks unconscious, Aang finally awoke from his coma aboard a captured Fire Nation ship. He found himself sporting a full head of hair, a mass of bandages, and a vicious scar on his back. Katara worked on healing his body in that area and, during the session, Aang had a painful flashback to the time he had fallen. He realized that he was not just injured, but that his spirit had separated from his body and that, if it were not for Katara, he might not have returned. Though Katara insisted that it was the spirit water that saved him, Aang told her that it was not the water; it was her."
    },
    {
      "body": "The next day, Aang learned a horrible fact: the entire ${link_0} believed he was dead. While ${link_1} was delighted by that idea, saying that it would give the group an advantage, Aang was flung into a state of frustration and dismay. He blamed himself for the defeat at ${link_2}, saying that he had been there and been unable to stop it, and lamented that there was no hope now that the world thought he was dead.",
      "links": [
        {
          "body": "world",
          "key": "${link_0}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_2}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "The next day, Aang learned a horrible fact: the entire world believed he was dead. While Sokka was delighted by that idea, saying that it would give the group an advantage, Aang was flung into a state of frustration and dismay. He blamed himself for the defeat at Ba Sing Se, saying that he had been there and been unable to stop it, and lamented that there was no hope now that the world thought he was dead."
    },
    {
      "body": "Not listening to reason, ${link_0} charged toward the ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "Not listening to reason, Aang charged toward the Fire Nation."
    },
    {
      "body": "After having a scuffle with a Fire Nation vessel that discovered them, a battle in which he was forced to remain hidden, Aang slipped away in the night on ${link_0}, determined to face his destiny alone and intent on preventing anyone else from paying for his mistakes. He made it past a ${link_1}, but was soon caught in a nasty squall and cast into the stormy seas. Believing he had failed again and would now die because of his foolishness, Aang found himself unable to work up the will to continue. At that time, however, Avatar Roku appeared and told Aang not to blame himself. Roku claimed fault for the war's devastation and implored Aang to redeem his mistakes. The spirit of Yue then appeared and removed the last of Aang's doubt, encouraging him to save the world as he had before. She helped Aang to safety, creating a wave that carried Aang to ${link_2}, where Roku's ${link_3} once stood.",
      "links": [
        {
          "body": "his glider",
          "key": "${link_0}",
          "target": {
            "href": "Airbender_staff",
            "page": "Airbender_staff"
          }
        },
        {
          "body": "naval blockade",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Navy_blockade",
            "page": "Fire_Navy_blockade"
          }
        },
        {
          "body": "Crescent Island",
          "key": "${link_2}",
          "target": {
            "href": "Crescent_Island",
            "page": "Crescent_Island"
          }
        },
        {
          "body": "temple",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Temple",
            "page": "Fire_Temple"
          }
        }
      ],
      "text": "After having a scuffle with a Fire Nation vessel that discovered them, a battle in which he was forced to remain hidden, Aang slipped away in the night on his glider, determined to face his destiny alone and intent on preventing anyone else from paying for his mistakes. He made it past a naval blockade, but was soon caught in a nasty squall and cast into the stormy seas. Believing he had failed again and would now die because of his foolishness, Aang found himself unable to work up the will to continue. At that time, however, Avatar Roku appeared and told Aang not to blame himself. Roku claimed fault for the war's devastation and implored Aang to redeem his mistakes. The spirit of Yue then appeared and removed the last of Aang's doubt, encouraging him to save the world as he had before. She helped Aang to safety, creating a wave that carried Aang to Crescent Island, where Roku's temple once stood."
    },
    {
      "body": "His friends found him lying on the island's shore in the morning. Aang apologized for his rash actions and accepted the fact that he would need their help. When his glider washed ashore, tattered and broken beyond repair, he planted it firmly in the volcanic rock for cremation, burning away evidence of his existence and symbolically letting go of his past.",
      "links": [],
      "text": "His friends found him lying on the island's shore in the morning. Aang apologized for his rash actions and accepted the fact that he would need their help. When his glider washed ashore, tattered and broken beyond repair, he planted it firmly in the volcanic rock for cremation, burning away evidence of his existence and symbolically letting go of his past."
    },
    {
      "body": "Upon entering Fire Nation territory, Team Avatar found an isolated cave in which they could take refuge and stole some clothes from a household whereupon they disguised themselves as ordinary citizens. Aang's outfit, of which he used the sash as a headband to hide his arrow, turned out to be a school uniform, and he was apprehended by truancy officers who took him to a ${link_0}. There, he assumed the alias of Kuzon, inspired by his ${link_1}, and explained wearing his sash as a headband to hide an \"embarrassing scar\". Despite the risky situation, Aang enjoyed being a student and decided to remain enlisted so that he and the others could learn more about the local customs from the history teacher, Ms. ${link_2}. He learned that the Fire Nation curriculum warped history to portray the Fire Nation's actions more positively; for example, it was taught that Sozin ${link_3} the \"Air Nation army\", even though Aang knew there was no such ${link_4} army due to the monks' pacifism. Charming the students with his relatively eccentric ways, he became popular, especially with a girl named ${link_5}. After getting in trouble in several classes and getting into a \"fight\" with On Ji's overprotective boyfriend ${link_6} (although Aang never physically fought), the ${link_7} arranged a meeting with his \"parents\"; this was attended by Sokka and Katara, who posed themselves as Wang and Sapphire Fire.",
      "links": [
        {
          "body": "Fire Nation school",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_school",
            "page": "Fire_Nation_school"
          }
        },
        {
          "body": "old friend",
          "key": "${link_1}",
          "target": {
            "href": "Kuzon",
            "page": "Kuzon"
          }
        },
        {
          "body": "Kwan",
          "key": "${link_2}",
          "target": {
            "href": "Kwan",
            "page": "Kwan"
          }
        },
        {
          "body": "\"attacked\"",
          "key": "${link_3}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "Air Nomad",
          "key": "${link_4}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "On Ji",
          "key": "${link_5}",
          "target": {
            "href": "On_Ji",
            "page": "On_Ji"
          }
        },
        {
          "body": "Hide",
          "key": "${link_6}",
          "target": {
            "href": "Hide",
            "page": "Hide"
          }
        },
        {
          "body": "Headmaster",
          "key": "${link_7}",
          "target": {
            "href": "Headmaster",
            "page": "Headmaster"
          }
        }
      ],
      "text": "Upon entering Fire Nation territory, Team Avatar found an isolated cave in which they could take refuge and stole some clothes from a household whereupon they disguised themselves as ordinary citizens. Aang's outfit, of which he used the sash as a headband to hide his arrow, turned out to be a school uniform, and he was apprehended by truancy officers who took him to a Fire Nation school. There, he assumed the alias of Kuzon, inspired by his old friend, and explained wearing his sash as a headband to hide an \"embarrassing scar\". Despite the risky situation, Aang enjoyed being a student and decided to remain enlisted so that he and the others could learn more about the local customs from the history teacher, Ms. Kwan. He learned that the Fire Nation curriculum warped history to portray the Fire Nation's actions more positively; for example, it was taught that Sozin \"attacked\" the \"Air Nation army\", even though Aang knew there was no such Air Nomad army due to the monks' pacifism. Charming the students with his relatively eccentric ways, he became popular, especially with a girl named On Ji. After getting in trouble in several classes and getting into a \"fight\" with On Ji's overprotective boyfriend Hide (although Aang never physically fought), the Headmaster arranged a meeting with his \"parents\"; this was attended by Sokka and Katara, who posed themselves as Wang and Sapphire Fire."
    },
    {
      "body": "${link_0} and ${link_1} danced in front of the ${link_2} students.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "Aang and Katara danced in front of the Fire Nation students."
    },
    {
      "body": "Following this incident, Sokka vehemently protested Aang's further enrollment in the school. Aang, however, insisted on one last attempt to give the students a stronger taste of freedom by holding a dance party. During the party, he helped the students overcome their fear of self-expression and reluctance to be spontaneous by showing them some ancient dance movements, winning their admiration and loyalty. He also managed to gain the admiration of Katara, who shyly accepted an offer to dance with him; the two amazed the crowd with a flawless series of moves and further inspired the students to join the festivities. The event came to an end when the headmaster and several truancy officers arrived, informed of its whereabouts by Hide. The entire student body ingeniously helped Aang to escape the scene by covering their foreheads with their belts, as Aang had done to hide his arrow tattoo, and thereby confusing the officers as to whom they were seeking in the crowd. As Aang escaped with his friends, he bowed to his new friend ${link_0} and promptly ${link_1} the exit closed, shocking Shoji.",
      "links": [
        {
          "body": "Shoji",
          "key": "${link_0}",
          "target": {
            "href": "Shoji",
            "page": "Shoji"
          }
        },
        {
          "body": "earthbent",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Following this incident, Sokka vehemently protested Aang's further enrollment in the school. Aang, however, insisted on one last attempt to give the students a stronger taste of freedom by holding a dance party. During the party, he helped the students overcome their fear of self-expression and reluctance to be spontaneous by showing them some ancient dance movements, winning their admiration and loyalty. He also managed to gain the admiration of Katara, who shyly accepted an offer to dance with him; the two amazed the crowd with a flawless series of moves and further inspired the students to join the festivities. The event came to an end when the headmaster and several truancy officers arrived, informed of its whereabouts by Hide. The entire student body ingeniously helped Aang to escape the scene by covering their foreheads with their belts, as Aang had done to hide his arrow tattoo, and thereby confusing the officers as to whom they were seeking in the crowd. As Aang escaped with his friends, he bowed to his new friend Shoji and promptly earthbent the exit closed, shocking Shoji."
    },
    {
      "body": "The group floated downstream, in the middle of a river that seemed to be almost entirely brown sludge. They decided to stop in the village of ${link_0}, a fishing village in the middle of a ${link_1}. Many villagers were sick, and the polluted water had caused a food shortage. Katara wished to help these people, but Sokka said their overall mission was too important to stop and help everybody they come across. In the morning, ${link_2} was found lying on his side, and his tongue was purple. Katara suggested that the village might have some herbs that could heal him. When they got to the village, they were shocked to find the entire village in much better spirits. According to ${link_3}, a legendary local river spirit known as the ${link_4} came and gave them food. There was no medicine in the village, as the factory workers took it all for themselves. Katara suggested the group let Appa rest for another day.",
      "links": [
        {
          "body": "Jang Hui",
          "key": "${link_0}",
          "target": {
            "href": "Jang_Hui",
            "page": "Jang_Hui"
          }
        },
        {
          "body": "river",
          "key": "${link_1}",
          "target": {
            "href": "Jang_Hui_River",
            "page": "Jang_Hui_River"
          }
        },
        {
          "body": "Appa",
          "key": "${link_2}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Xu",
          "key": "${link_3}",
          "target": {
            "href": "Dock/Xu/Bushi",
            "page": "Dock/Xu/Bushi"
          }
        },
        {
          "body": "Painted Lady",
          "key": "${link_4}",
          "target": {
            "href": "Painted_Lady",
            "page": "Painted_Lady"
          }
        }
      ],
      "text": "The group floated downstream, in the middle of a river that seemed to be almost entirely brown sludge. They decided to stop in the village of Jang Hui, a fishing village in the middle of a river. Many villagers were sick, and the polluted water had caused a food shortage. Katara wished to help these people, but Sokka said their overall mission was too important to stop and help everybody they come across. In the morning, Appa was found lying on his side, and his tongue was purple. Katara suggested that the village might have some herbs that could heal him. When they got to the village, they were shocked to find the entire village in much better spirits. According to Xu, a legendary local river spirit known as the Painted Lady came and gave them food. There was no medicine in the village, as the factory workers took it all for themselves. Katara suggested the group let Appa rest for another day."
    },
    {
      "body": "${link_0} assisted a disguised ${link_1} in driving away ${link_2} ${link_3}'s troops.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "General",
          "key": "${link_2}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#General_2",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Mung",
          "key": "${link_3}",
          "target": {
            "href": "Mung",
            "page": "Mung"
          }
        }
      ],
      "text": "Aang assisted a disguised Katara in driving away General Mung's troops."
    },
    {
      "body": "The next day, Appa was still sick, so they returned to the village. The inhabitants were in even higher spirits and had erected a large statue of the Painted Lady in thanks for healing their sick. Dock/Xu/Bushi suggested that maybe the Painted Lady could help Appa out. The next night, ${link_0} woke up, rousing Aang in turn. Seeing the Painted Lady, Aang tried to ask for her help, but she ran away. Aang chased her all the way to the village, where he finally found out that Katara had been acting as the Painted Lady. Katara sadly confessed and apologized for holding them there to help the village, but Aang naturally liked the idea. Together, the two infiltrated the factory and wrecked it, stopping the flow of pollution. As they prepared to leave, they saw a squad of Fire Nation troops heading toward the town on speeders and realized that they must believe the villagers had sabotaged the factory. Katara was determined to stop them from harming innocent villagers for her actions. The soldiers started attacking the village, but a gust of wind blew their flames out when they started destroying everything. With help from Appa, ${link_1} and Sokka providing spooky sound effects, Aang and Katara staged an encounter with the Painted Lady to defeat the troops and drive them away. They stayed an extra week to help the village clean the river and rebuild a way of life for the villagers.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "The next day, Appa was still sick, so they returned to the village. The inhabitants were in even higher spirits and had erected a large statue of the Painted Lady in thanks for healing their sick. Dock/Xu/Bushi suggested that maybe the Painted Lady could help Appa out. The next night, Momo woke up, rousing Aang in turn. Seeing the Painted Lady, Aang tried to ask for her help, but she ran away. Aang chased her all the way to the village, where he finally found out that Katara had been acting as the Painted Lady. Katara sadly confessed and apologized for holding them there to help the village, but Aang naturally liked the idea. Together, the two infiltrated the factory and wrecked it, stopping the flow of pollution. As they prepared to leave, they saw a squad of Fire Nation troops heading toward the town on speeders and realized that they must believe the villagers had sabotaged the factory. Katara was determined to stop them from harming innocent villagers for her actions. The soldiers started attacking the village, but a gust of wind blew their flames out when they started destroying everything. With help from Appa, Toph and Sokka providing spooky sound effects, Aang and Katara staged an encounter with the Painted Lady to defeat the troops and drive them away. They stayed an extra week to help the village clean the river and rebuild a way of life for the villagers."
    },
    {
      "body": "When the group retired for a few days at the location of a secluded hot spring, Aang unknowingly revealed his identity as the Avatar to a couple of bored Fire Nation soldiers patrolling nearby. Shocked to discover the Avatar was secretly alive, they sent a message to the Fire Lord with a ${link_0}. However, a ${link_1} intercepted the hawk's journey, stealing the message, and brought it to Combustion Man, the hired assassin. While Team Avatar slept at the springs, Combustion Man attacked them. They fought briefly, and Aang narrowly escaped the scene on Appa.",
      "links": [
        {
          "body": "messenger hawk",
          "key": "${link_0}",
          "target": {
            "href": "Messenger_hawk",
            "page": "Messenger_hawk"
          }
        },
        {
          "body": "raven eagle",
          "key": "${link_1}",
          "target": {
            "href": "Raven_eagle",
            "page": "Raven_eagle"
          }
        }
      ],
      "text": "When the group retired for a few days at the location of a secluded hot spring, Aang unknowingly revealed his identity as the Avatar to a couple of bored Fire Nation soldiers patrolling nearby. Shocked to discover the Avatar was secretly alive, they sent a message to the Fire Lord with a messenger hawk. However, a raven eagle intercepted the hawk's journey, stealing the message, and brought it to Combustion Man, the hired assassin. While Team Avatar slept at the springs, Combustion Man attacked them. They fought briefly, and Aang narrowly escaped the scene on Appa."
    },
    {
      "body": "While Aang was sleeping, Roku told him to visit his home island so that he could learn how the war started. After traveling to the island aboard Appa, he sat on a ledge overlooking the ocean and meditated. After having entered the Spirit World, Roku and ${link_0} took Aang on a trip through Roku's past, where he learned that Roku and ${link_1} ${link_2} were best friends. Aang was also surprised and delighted to find out that one of Roku's friends was none other than Monk ${link_3}. Roku commented that Aang's relationship with Gyatso years later proves that some friendships are able to transcend lifetimes. After awakening from his vision with Roku, Aang told his friends Roku's story and that since Roku and Sozin were both Fire Nation natives, it proved any person is capable of great good or evil. The group takes comfort in Roku's words that friendships can transcend lifetimes.",
      "links": [
        {
          "body": "Fang",
          "key": "${link_0}",
          "target": {
            "href": "Fang",
            "page": "Fang"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_2}",
          "target": {
            "href": "Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "Gyatso",
          "key": "${link_3}",
          "target": {
            "href": "Gyatso",
            "page": "Gyatso"
          }
        }
      ],
      "text": "While Aang was sleeping, Roku told him to visit his home island so that he could learn how the war started. After traveling to the island aboard Appa, he sat on a ledge overlooking the ocean and meditated. After having entered the Spirit World, Roku and Fang took Aang on a trip through Roku's past, where he learned that Roku and Fire Lord Sozin were best friends. Aang was also surprised and delighted to find out that one of Roku's friends was none other than Monk Gyatso. Roku commented that Aang's relationship with Gyatso years later proves that some friendships are able to transcend lifetimes. After awakening from his vision with Roku, Aang told his friends Roku's story and that since Roku and Sozin were both Fire Nation natives, it proved any person is capable of great good or evil. The group takes comfort in Roku's words that friendships can transcend lifetimes."
    },
    {
      "body": "When the gang resided just outside a small city known as ${link_0}, Toph began using her earthbending skills to scam local con artists for money. Katara became upset by this; to ease her worries, Aang made an Avatar promise that they would not let scamming become a habit. He did not adhere to his own promise and continued accompanying Toph in her scams. The gang soon left the town when Combustion Man tracked them down and attacked them.",
      "links": [
        {
          "body": "Fire Fountain City",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Fountain_City",
            "page": "Fire_Fountain_City"
          }
        }
      ],
      "text": "When the gang resided just outside a small city known as Fire Fountain City, Toph began using her earthbending skills to scam local con artists for money. Katara became upset by this; to ease her worries, Aang made an Avatar promise that they would not let scamming become a habit. He did not adhere to his own promise and continued accompanying Toph in her scams. The gang soon left the town when Combustion Man tracked them down and attacked them."
    },
    {
      "body": "The team later traveled to the mountains just outside ${link_0}, where they were discovered by an elderly woman named ${link_1}, who told them they should not be staying in the forest at night. She invited them all to stay at ${link_2}, where they discovered she was also a ${link_3} ${link_4}. As Katara was left excited to train with Hama, the rest of the team began investigating about villagers disappearing in the night.",
      "links": [
        {
          "body": "a small village",
          "key": "${link_0}",
          "target": {
            "href": "Hama%27s_village",
            "page": "Hama%27s_village"
          }
        },
        {
          "body": "Hama",
          "key": "${link_1}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "her inn",
          "key": "${link_2}",
          "target": {
            "href": "Hama%27s_inn",
            "page": "Hama%27s_inn"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_3}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "waterbender",
          "key": "${link_4}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "The team later traveled to the mountains just outside a small village, where they were discovered by an elderly woman named Hama, who told them they should not be staying in the forest at night. She invited them all to stay at her inn, where they discovered she was also a Southern Water Tribe waterbender. As Katara was left excited to train with Hama, the rest of the team began investigating about villagers disappearing in the night."
    },
    {
      "body": "${link_0} and ${link_1} came to ${link_2}'s aid and prepared to face ${link_3}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Hama",
          "key": "${link_3}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        }
      ],
      "text": "Aang and Sokka came to Katara's aid and prepared to face Hama."
    },
    {
      "body": "While Katara was being taught about a ${link_0} under the full moon, Aang and the rest of the group met with Old Man ${link_1}, who told him about a mysterious \"Moon Monster\" that was dragging away villagers during the full moon, he being one of them. Ding explained that he had nearly been dragged to a ${link_2}, but it stopped upon sunrise. The team made it to the prison and freed its captives. The prisoners explained it to be a \"dark puppetmaster\", whom they quickly concluded was Hama. As Toph freed them, Aang and Sokka quickly ran to see Katara locked in a duel with the elderly waterbender. Hama began to bloodbend them, sending them on a collision course with ${link_3} drawn out. Katara was forced to bloodbend Hama, leaving her distressed, and both Aang and Sokka trying to comfort her as she cried.",
      "links": [
        {
          "body": "vicious art",
          "key": "${link_0}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "Ding",
          "key": "${link_1}",
          "target": {
            "href": "Ding",
            "page": "Ding"
          }
        },
        {
          "body": "mountain prison",
          "key": "${link_2}",
          "target": {
            "href": "Mountain_prison",
            "page": "Mountain_prison"
          }
        },
        {
          "body": "Sokka's sword",
          "key": "${link_3}",
          "target": {
            "href": "Sokka%27s_sword",
            "page": "Sokka%27s_sword"
          }
        }
      ],
      "text": "While Katara was being taught about a vicious art under the full moon, Aang and the rest of the group met with Old Man Ding, who told him about a mysterious \"Moon Monster\" that was dragging away villagers during the full moon, he being one of them. Ding explained that he had nearly been dragged to a mountain prison, but it stopped upon sunrise. The team made it to the prison and freed its captives. The prisoners explained it to be a \"dark puppetmaster\", whom they quickly concluded was Hama. As Toph freed them, Aang and Sokka quickly ran to see Katara locked in a duel with the elderly waterbender. Hama began to bloodbend them, sending them on a collision course with Sokka's sword drawn out. Katara was forced to bloodbend Hama, leaving her distressed, and both Aang and Sokka trying to comfort her as she cried."
    },
    {
      "body": "Later, Aang worried about the invasion, which he realized was only four days away. He began having nightmares about facing the Fire Lord, like having lost his pants and forgotten to study for a math test. In an effort to stop this, he decided to stay awake until the invasion. This backfired when he started having daydreams and hallucinations; in one such daydream, he hears Momo and Appa speak like humans and, after a dispute, have a samurai battle between them with rocks and sheep dancing around Aang. In one he kissed Katara and in another, Fire Lord Ozai told him he missed the invasion. His friends tried to relieve his stress though yoga at a volcanic core with Katara; therapy with Sokka and his beard; and heavy massage therapy from Toph, who later suggested acupuncture. After his friends made a comfortable bed out of fleece, he finally fell asleep the night before the invasion.",
      "links": [],
      "text": "Later, Aang worried about the invasion, which he realized was only four days away. He began having nightmares about facing the Fire Lord, like having lost his pants and forgotten to study for a math test. In an effort to stop this, he decided to stay awake until the invasion. This backfired when he started having daydreams and hallucinations; in one such daydream, he hears Momo and Appa speak like humans and, after a dispute, have a samurai battle between them with rocks and sheep dancing around Aang. In one he kissed Katara and in another, Fire Lord Ozai told him he missed the invasion. His friends tried to relieve his stress though yoga at a volcanic core with Katara; therapy with Sokka and his beard; and heavy massage therapy from Toph, who later suggested acupuncture. After his friends made a comfortable bed out of fleece, he finally fell asleep the night before the invasion."
    },
    {
      "body": "${link_0} kissed ${link_1} before departing for the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "Aang kissed Katara before departing for the Fire Nation."
    },
    {
      "body": "Aang woke up on the morning of the invasion happy and rested. When the invasion boats started to arrive, Aang and Toph prepared by making docks for them to stop by. Aang introduced his friends as each one came off the boat. When the ${link_0} and ${link_1} came off, they had a surprise for Aang, a new glider. This new glider was reptilian in the look of the \"wings\". As Aang prepared to leave, he gathered scraps and made a new outfit that expressed his Air Nomad culture. Along with a new outfit, Aang shaved off his hair, finally showing off his arrow once more. When Sokka proceeded to ask Aang how the Avatar knew they were going to win, Aang simply explained, \"... because I already failed the world once in Ba Sing Se. I won't let myself fail again.\"",
      "links": [
        {
          "body": "mechanist",
          "key": "${link_0}",
          "target": {
            "href": "Mechanist",
            "page": "Mechanist"
          }
        },
        {
          "body": "Teo",
          "key": "${link_1}",
          "target": {
            "href": "Teo",
            "page": "Teo"
          }
        }
      ],
      "text": "Aang woke up on the morning of the invasion happy and rested. When the invasion boats started to arrive, Aang and Toph prepared by making docks for them to stop by. Aang introduced his friends as each one came off the boat. When the mechanist and Teo came off, they had a surprise for Aang, a new glider. This new glider was reptilian in the look of the \"wings\". As Aang prepared to leave, he gathered scraps and made a new outfit that expressed his Air Nomad culture. Along with a new outfit, Aang shaved off his hair, finally showing off his arrow once more. When Sokka proceeded to ask Aang how the Avatar knew they were going to win, Aang simply explained, \"... because I already failed the world once in Ba Sing Se. I won't let myself fail again.\""
    },
    {
      "body": "The invasion force, ready to go, boarded the boats. At the ${link_0}, the boats released submarines containing the warriors. When it came time to resurface for air, the group gathered on top. They bid their good-lucks and engaged in a group hug. As Aang got ready to fly to the ${link_1}, he confronted Katara. Katara told him how proud she was and that he was not that same \"goofy kid\" she found in the iceberg anymore. Aang stated that everything would be different after that day, but also got worried about what would happen if he did not come back. Katara told him not to think like that, but before she could finish, Aang moved in and kissed her. Katara blushed but did not resist. With a new courage, Aang departed.",
      "links": [
        {
          "body": "Great Gates of Azulon",
          "key": "${link_0}",
          "target": {
            "href": "Great_Gates_of_Azulon",
            "page": "Great_Gates_of_Azulon"
          }
        },
        {
          "body": "Fire Nation Capital",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        }
      ],
      "text": "The invasion force, ready to go, boarded the boats. At the Great Gates of Azulon, the boats released submarines containing the warriors. When it came time to resurface for air, the group gathered on top. They bid their good-lucks and engaged in a group hug. As Aang got ready to fly to the Fire Nation Capital, he confronted Katara. Katara told him how proud she was and that he was not that same \"goofy kid\" she found in the iceberg anymore. Aang stated that everything would be different after that day, but also got worried about what would happen if he did not come back. Katara told him not to think like that, but before she could finish, Aang moved in and kissed her. Katara blushed but did not resist. With a new courage, Aang departed."
    },
    {
      "body": "As Aang entered the city, he could not help but notice that no one was around. When he barged into the palace, no one was present. He immediately went to the throne room to find it deserted. Aang fell to his knees and yelled, \"Fire Lord Ozai, where are you?\"",
      "links": [],
      "text": "As Aang entered the city, he could not help but notice that no one was around. When he barged into the palace, no one was present. He immediately went to the throne room to find it deserted. Aang fell to his knees and yelled, \"Fire Lord Ozai, where are you?\""
    },
    {
      "body": "${link_0} was determined to defeat the ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "text": "Aang was determined to defeat the Fire Lord."
    },
    {
      "body": "Aang returned to the battle and told Sokka, Katara, and Toph what had happened. Sokka thought that Ozai would not want to leave his city, but still stay close enough to be safe. Sokka suspected an underground bunker. Toph agreed to help them find it. They found it with ease and entered it using earthbending. After bumping into ${link_0} ${link_1}, they are pointed into the wrong direction. The three entered a room where they found Princess ${link_2} sitting on a throne. Azula was powerless due to the eclipse. She went ahead and said she knew about the invasion for quite some time. Aang and the others demanded to know where ${link_3} ${link_4} was by reminding her that she could not firebend. Azula decided to tell them about her \"souvenirs\" from Ba Sing Se, two ${link_5} agents. A battle soon took place with Aang trying to get to Azula while being interrupted by Dai Li. Eventually, the Dai Li were defeated and Azula was being chased. Sokka soon realized that this was a trap. Azula was not trying to defeat the ${link_6}, just distract him and take up his time. The plan worked, Aang did not even see the Fire Lord by the time the eclipse was up.",
      "links": [
        {
          "body": "War Minister",
          "key": "${link_0}",
          "target": {
            "href": "War_Minister",
            "page": "War_Minister"
          }
        },
        {
          "body": "Qin",
          "key": "${link_1}",
          "target": {
            "href": "Qin",
            "page": "Qin"
          }
        },
        {
          "body": "Azula",
          "key": "${link_2}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_4}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_5}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_6}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Aang returned to the battle and told Sokka, Katara, and Toph what had happened. Sokka thought that Ozai would not want to leave his city, but still stay close enough to be safe. Sokka suspected an underground bunker. Toph agreed to help them find it. They found it with ease and entered it using earthbending. After bumping into War Minister Qin, they are pointed into the wrong direction. The three entered a room where they found Princess Azula sitting on a throne. Azula was powerless due to the eclipse. She went ahead and said she knew about the invasion for quite some time. Aang and the others demanded to know where Fire Lord Ozai was by reminding her that she could not firebend. Azula decided to tell them about her \"souvenirs\" from Ba Sing Se, two Dai Li agents. A battle soon took place with Aang trying to get to Azula while being interrupted by Dai Li. Eventually, the Dai Li were defeated and Azula was being chased. Sokka soon realized that this was a trap. Azula was not trying to defeat the Avatar, just distract him and take up his time. The plan worked, Aang did not even see the Fire Lord by the time the eclipse was up."
    },
    {
      "body": "The three returned to Katara and the others just in time to see approaching ${link_0}. Aang and Katara went into the sky, via glider and Appa respectively and destroyed a few of the balloons. The only problem was the airships; they proceeded down to the beach where they bombed all the submarines, leaving the invasion force stranded. Hakoda decided that the older warriors should surrender while the younger ones escape on Appa. Aang looked away, crying, but Katara knelt close to him and smiled proudly at her friend. Turning to the invasion force, Aang apologized to the invasion force, promising to make it up to them. Aang, Katara, Sokka, Toph, ${link_1}, Teo, and ${link_2} boarded Appa and headed to the ${link_3} for refuge.",
      "links": [
        {
          "body": "hot air balloons",
          "key": "${link_0}",
          "target": {
            "href": "Hot_air_balloon",
            "page": "Hot_air_balloon"
          }
        },
        {
          "body": "The Duke",
          "key": "${link_1}",
          "target": {
            "href": "The_Duke",
            "page": "The_Duke"
          }
        },
        {
          "body": "Haru",
          "key": "${link_2}",
          "target": {
            "href": "Haru",
            "page": "Haru"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_3}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "text": "The three returned to Katara and the others just in time to see approaching hot air balloons. Aang and Katara went into the sky, via glider and Appa respectively and destroyed a few of the balloons. The only problem was the airships; they proceeded down to the beach where they bombed all the submarines, leaving the invasion force stranded. Hakoda decided that the older warriors should surrender while the younger ones escape on Appa. Aang looked away, crying, but Katara knelt close to him and smiled proudly at her friend. Turning to the invasion force, Aang apologized to the invasion force, promising to make it up to them. Aang, Katara, Sokka, Toph, The Duke, Teo, and Haru boarded Appa and headed to the Western Air Temple for refuge."
    },
    {
      "body": "After the failed invasion on the ${link_0}, Aang and the group headed to the ${link_1}. However, because of the heavy load with the addition of Haru, Teo, and the Duke to the group, Appa could not fly the whole way and the gang had to walk the rest of the way there. As they felt embarrassed for having lost and walking the rest of the way, Toph sensed the Western Air Temple. Everyone else could not see it, but Aang reassured them that it was the right spot. The temple was actually on the cliff side below them, unique compared to the other air temples. ${link_2} descended from a rope onto one of the buildings of the temple, remembering when he was first there with his uncle, ${link_3}. He heard Appa approach and fled.",
      "links": [
        {
          "body": "Day of Black Sun",
          "key": "${link_0}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_1}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_2}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_3}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "After the failed invasion on the Day of Black Sun, Aang and the group headed to the Western Air Temple. However, because of the heavy load with the addition of Haru, Teo, and the Duke to the group, Appa could not fly the whole way and the gang had to walk the rest of the way there. As they felt embarrassed for having lost and walking the rest of the way, Toph sensed the Western Air Temple. Everyone else could not see it, but Aang reassured them that it was the right spot. The temple was actually on the cliff side below them, unique compared to the other air temples. Zuko descended from a rope onto one of the buildings of the temple, remembering when he was first there with his uncle, Iroh. He heard Appa approach and fled."
    },
    {
      "body": "When the gang landed on one of the buildings, Haru, Teo, and The Duke explored while Aang, Katara, Toph, and Sokka made plans. Sokka suggested that they should go back to the \"old plan\", which was that Aang had to master all four elements and confront Fire Lord Ozai. Aang stated that there was a problem in that, and it was unlikely for them to find a ${link_0} teacher for him. Katara suggested looking for ${link_1}, but Aang also was not sure about that. Not wanting to discuss their current predicament, Aang flew around the temple on his glider.",
      "links": [
        {
          "body": "firebending",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Jeong Jeong",
          "key": "${link_1}",
          "target": {
            "href": "Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        }
      ],
      "text": "When the gang landed on one of the buildings, Haru, Teo, and The Duke explored while Aang, Katara, Toph, and Sokka made plans. Sokka suggested that they should go back to the \"old plan\", which was that Aang had to master all four elements and confront Fire Lord Ozai. Aang stated that there was a problem in that, and it was unlikely for them to find a firebending teacher for him. Katara suggested looking for Jeong Jeong, but Aang also was not sure about that. Not wanting to discuss their current predicament, Aang flew around the temple on his glider."
    },
    {
      "body": "${link_0} accepted ${link_1} as his ${link_2} teacher.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebending",
          "key": "${link_2}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Aang accepted Zuko as his firebending teacher."
    },
    {
      "body": "Eventually, Sokka, Katara, and Toph caught up with Aang on ${link_0} and landed on another building of the temple. As Aang suggested showing them another part of the temple, Toph states that \"it'll have to wait\" after sensing Zuko across from them. Zuko humbly explained that he has changed and wanted to teach Aang firebending. The group mistrusted him because of their past history with the former Crown Prince and became angry when Zuko clumsily admitted sending ${link_1} after them. Zuko told Aang that \"you thought we could have been friends\" echoing his words earlier in the series, but Aang eventually rejected him. Despite Zuko's offering himself as a prisoner, Katara and Sokka insisted that he should immediately leave.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Combustion Man",
          "key": "${link_1}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        }
      ],
      "text": "Eventually, Sokka, Katara, and Toph caught up with Aang on Appa and landed on another building of the temple. As Aang suggested showing them another part of the temple, Toph states that \"it'll have to wait\" after sensing Zuko across from them. Zuko humbly explained that he has changed and wanted to teach Aang firebending. The group mistrusted him because of their past history with the former Crown Prince and became angry when Zuko clumsily admitted sending Combustion Man after them. Zuko told Aang that \"you thought we could have been friends\" echoing his words earlier in the series, but Aang eventually rejected him. Despite Zuko's offering himself as a prisoner, Katara and Sokka insisted that he should immediately leave."
    },
    {
      "body": "Toph got upset later on that the others were letting their feelings block their proper judgment. She stated that Zuko was sincere when he had spoken, and that he was probably the only firebender willing to teach Aang firebending. She seemed to have disappeared until the next morning when she popped out of a hole in the wall with her feet burnt. She told the group that she tried to visit Zuko, but he accidentally burned her. Sokka subsequently made up a plan to make Zuko their prisoner. As the group laid Toph's feet in a pool of water, Combustion Man could be seen from a high angle ready to strike. When he breathed in, ready to strike, Aang sensed him just as a pillar on the temple is fired on. Aang whipped up a tornado at Combustion Man, but he dodged it and fired again. As the gang took cover, Zuko came telling him to stop. Aang and the rest noticed this and were surprised. Combustion Man fired at Zuko, but he was able to grab onto a vine that hung down from the ledge. Eventually Combustion Man blew himself up after being hit on the head with Sokka's boomerang. After the group retaliated, Aang thanked Zuko for what he had done. Zuko restated what he said the day before and also apologized to Toph about burning her feet, stating that fire is uncontrollable at times, and that he needed to be more careful. After remembering what he had done to Katara, Aang believed that Zuko was meant to be his teacher.",
      "links": [],
      "text": "Toph got upset later on that the others were letting their feelings block their proper judgment. She stated that Zuko was sincere when he had spoken, and that he was probably the only firebender willing to teach Aang firebending. She seemed to have disappeared until the next morning when she popped out of a hole in the wall with her feet burnt. She told the group that she tried to visit Zuko, but he accidentally burned her. Sokka subsequently made up a plan to make Zuko their prisoner. As the group laid Toph's feet in a pool of water, Combustion Man could be seen from a high angle ready to strike. When he breathed in, ready to strike, Aang sensed him just as a pillar on the temple is fired on. Aang whipped up a tornado at Combustion Man, but he dodged it and fired again. As the gang took cover, Zuko came telling him to stop. Aang and the rest noticed this and were surprised. Combustion Man fired at Zuko, but he was able to grab onto a vine that hung down from the ledge. Eventually Combustion Man blew himself up after being hit on the head with Sokka's boomerang. After the group retaliated, Aang thanked Zuko for what he had done. Zuko restated what he said the day before and also apologized to Toph about burning her feet, stating that fire is uncontrollable at times, and that he needed to be more careful. After remembering what he had done to Katara, Aang believed that Zuko was meant to be his teacher."
    },
    {
      "body": "${link_0} and ${link_1} met the last ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "dragons",
          "key": "${link_2}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        }
      ],
      "text": "Aang and Zuko met the last dragons."
    },
    {
      "body": "As Aang and Zuko began their firebending training, Zuko realized that he could not make strong fire blasts anymore; Aang was also still afraid to firebend because of what he did to Katara. Aang thought the reason was that in the past, Zuko was driven by anger, and now that he was not, he could not firebend nearly as well. After a suggestion by Toph to go to the original source of firebending, Zuko stated that the original firebenders, the ${link_0}, were extinct. However, there were ruins of an ancient civilization, the ${link_1}, who first learned from the dragons. He believed that they could find something there.",
      "links": [
        {
          "body": "dragons",
          "key": "${link_0}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        },
        {
          "body": "Sun Warriors",
          "key": "${link_1}",
          "target": {
            "href": "Sun_Warriors",
            "page": "Sun_Warriors"
          }
        }
      ],
      "text": "As Aang and Zuko began their firebending training, Zuko realized that he could not make strong fire blasts anymore; Aang was also still afraid to firebend because of what he did to Katara. Aang thought the reason was that in the past, Zuko was driven by anger, and now that he was not, he could not firebend nearly as well. After a suggestion by Toph to go to the original source of firebending, Zuko stated that the original firebenders, the dragons, were extinct. However, there were ruins of an ancient civilization, the Sun Warriors, who first learned from the dragons. He believed that they could find something there."
    },
    {
      "body": "Aang and Zuko headed to the ruins the next day. Once there, they came across a ${link_0}, but after passing it, headed toward a tall pyramid. Along the way, Zuko told Aang that the dragons were extinct because his great-grandfather, Fire Lord Sozin, started the tradition of hunting dragons for glory. Because dragons were considered the ultimate firebenders, and if someone was able to conquer one, their firebending skills would become legendary and they would earn the honorary title of \"Dragon\". He also said that his uncle was the person who slew the last dragon.",
      "links": [
        {
          "body": "booby trap",
          "key": "${link_0}",
          "target": {
            "href": "Booby_trap",
            "page": "Booby_trap"
          }
        }
      ],
      "text": "Aang and Zuko headed to the ruins the next day. Once there, they came across a booby trap, but after passing it, headed toward a tall pyramid. Along the way, Zuko told Aang that the dragons were extinct because his great-grandfather, Fire Lord Sozin, started the tradition of hunting dragons for glory. Because dragons were considered the ultimate firebenders, and if someone was able to conquer one, their firebending skills would become legendary and they would earn the honorary title of \"Dragon\". He also said that his uncle was the person who slew the last dragon."
    },
    {
      "body": "When they reached the top of the pyramid, they found a door that was only opened on the solstice, like the ones in the Fire Sages' temples. Zuko tried to deceive the door by reflecting the sunlight into the gem placed on top of the door, and this caused it to open. Aang complimented him for that. Inside, Zuko snooped around while Aang gazed at the statues depicting a move known as the \"${link_0}\". When he imitated the first move, he triggered something. He asked Zuko to perform the technique with him. When they completed the move, a relic raised up from the ground. Zuko picked it up, despite Aang's warnings. A glue-like substance promptly shot up from the pedestal the relic was on, shooting Zuko up to bars at an opening in the ceiling. Aang also got stuck up there as the substance filled the room. They stayed there until night when a ${link_1} of some sort appeared. When the two were back on the floor and having the substance removed, it appeared that the Sun Warrior civilization was still alive. Aang and Zuko stated they wanted to learn the true meaning of firebending, and the chief said that they must learn from the masters.",
      "links": [
        {
          "body": "Dancing Dragon",
          "key": "${link_0}",
          "target": {
            "href": "Dancing_Dragon",
            "page": "Dancing_Dragon"
          }
        },
        {
          "body": "chief",
          "key": "${link_1}",
          "target": {
            "href": "Sun_Warrior_chief",
            "page": "Sun_Warrior_chief"
          }
        }
      ],
      "text": "When they reached the top of the pyramid, they found a door that was only opened on the solstice, like the ones in the Fire Sages' temples. Zuko tried to deceive the door by reflecting the sunlight into the gem placed on top of the door, and this caused it to open. Aang complimented him for that. Inside, Zuko snooped around while Aang gazed at the statues depicting a move known as the \"Dancing Dragon\". When he imitated the first move, he triggered something. He asked Zuko to perform the technique with him. When they completed the move, a relic raised up from the ground. Zuko picked it up, despite Aang's warnings. A glue-like substance promptly shot up from the pedestal the relic was on, shooting Zuko up to bars at an opening in the ceiling. Aang also got stuck up there as the substance filled the room. They stayed there until night when a chief of some sort appeared. When the two were back on the floor and having the substance removed, it appeared that the Sun Warrior civilization was still alive. Aang and Zuko stated they wanted to learn the true meaning of firebending, and the chief said that they must learn from the masters."
    },
    {
      "body": "The next day, the chief gave them a piece of the ${link_0}, the first flame given to man by the dragons. At first, Aang was reluctant to take the fire, but the chief said that fire is not only destruction, but life. The two were told to travel up a mountain to meet the masters where they will present their flames as signs of worthiness and be judged. If they were deemed worthy, they will be taught; if not, they will be destroyed on the spot. As the two journeyed up the mountain, Aang felt reluctant about going through with this, but Zuko reassured him.",
      "links": [
        {
          "body": "Eternal Flame",
          "key": "${link_0}",
          "target": {
            "href": "Eternal_Flame",
            "page": "Eternal_Flame"
          }
        }
      ],
      "text": "The next day, the chief gave them a piece of the Eternal Flame, the first flame given to man by the dragons. At first, Aang was reluctant to take the fire, but the chief said that fire is not only destruction, but life. The two were told to travel up a mountain to meet the masters where they will present their flames as signs of worthiness and be judged. If they were deemed worthy, they will be taught; if not, they will be destroyed on the spot. As the two journeyed up the mountain, Aang felt reluctant about going through with this, but Zuko reassured him."
    },
    {
      "body": "${link_0} performed the steps of the ${link_1} in sync with one of the ${link_2} remaining ${link_3}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Dancing Dragon",
          "key": "${link_1}",
          "target": {
            "href": "Dancing_Dragon",
            "page": "Dancing_Dragon"
          }
        },
        {
          "body": "two",
          "key": "${link_2}",
          "target": {
            "href": "Ran_and_Shaw",
            "page": "Ran_and_Shaw"
          }
        },
        {
          "body": "dragons",
          "key": "${link_3}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        }
      ],
      "text": "Aang performed the steps of the Dancing Dragon in sync with one of the two remaining dragons."
    },
    {
      "body": "When they reached the top, the chief and other Sun Warriors were already there. The chief took pieces of Aang and Zuko's flames and distributed it to warriors. They began a ceremony as Aang and Zuko headed up some stairs to meet the masters, who were in caves. They presented their flames, but Aang's went out. The Sun Warriors began calling the masters. When Aang tried to get some of Zuko's flame, ${link_0}, a red one and a blue one, came out of the caves and flew in circles around the two. Aang thought that they should perform the Dancing Dragon with the dragons. They performed in-sync and when Aang and Zuko finished, the dragons began judging them. The dragons subsequently shot fire at the two, which encircled them in many different colors, before returning to their caves. When they reached the bottom, Zuko realized that he lost power because his main drive in the past was to capture Aang, but now he realized that he must now help the Avatar defeat his father, Fire Lord Ozai; Aang also realized that firebending is a beautiful art and that fire is really life and energy. Zuko threw two powerful fire blasts into the air as Aang threw his first fire blast into the air. The chief stated that Iroh also learned the true meaning of firebending. He also told them not to tell anyone about them or the dragons.",
      "links": [
        {
          "body": "two dragons",
          "key": "${link_0}",
          "target": {
            "href": "Ran_and_Shaw",
            "page": "Ran_and_Shaw"
          }
        }
      ],
      "text": "When they reached the top, the chief and other Sun Warriors were already there. The chief took pieces of Aang and Zuko's flames and distributed it to warriors. They began a ceremony as Aang and Zuko headed up some stairs to meet the masters, who were in caves. They presented their flames, but Aang's went out. The Sun Warriors began calling the masters. When Aang tried to get some of Zuko's flame, two dragons, a red one and a blue one, came out of the caves and flew in circles around the two. Aang thought that they should perform the Dancing Dragon with the dragons. They performed in-sync and when Aang and Zuko finished, the dragons began judging them. The dragons subsequently shot fire at the two, which encircled them in many different colors, before returning to their caves. When they reached the bottom, Zuko realized that he lost power because his main drive in the past was to capture Aang, but now he realized that he must now help the Avatar defeat his father, Fire Lord Ozai; Aang also realized that firebending is a beautiful art and that fire is really life and energy. Zuko threw two powerful fire blasts into the air as Aang threw his first fire blast into the air. The chief stated that Iroh also learned the true meaning of firebending. He also told them not to tell anyone about them or the dragons."
    },
    {
      "body": "When Aang and Zuko returned to the Western Air Temple, they performed the Dancing Dragon to the group, who made fun of the technique. Zuko told them it was a sacred firebending form that happened to be thousands of years old. Katara asked for the form's name and upon hearing it, the group laughed even more.",
      "links": [],
      "text": "When Aang and Zuko returned to the Western Air Temple, they performed the Dancing Dragon to the group, who made fun of the technique. Zuko told them it was a sacred firebending form that happened to be thousands of years old. Katara asked for the form's name and upon hearing it, the group laughed even more."
    },
    {
      "body": "When Azula attacked the Western Air Temple, the group was forced to split. While Zuko held off the airships and Azula, Aang and the others flew on Appa, proceeding to catch Zuko when he and his sister fell from the airship after their attacks clashed. When Katara announced that she was going to find the man who killed her mother, along with Zuko, Aang questioned her motives, even saying she sounded like ${link_0}, and saying that he understood what she was feeling, mentioning Appa's theft by the ${link_1} and his discovery of what happened to his people. When she decided to go anyway, he supported her, but asked her not to resort to violence and to let go of her anger. When Zuko and Katara came back, he said he was proud of her and told Zuko that violence is never the answer. He was subsequently asked by Zuko what he will do when he faces Ozai.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        },
        {
          "body": "sandbenders",
          "key": "${link_1}",
          "target": {
            "href": "Sandbender_Tribes",
            "page": "Sandbender_Tribes"
          }
        }
      ],
      "text": "When Azula attacked the Western Air Temple, the group was forced to split. While Zuko held off the airships and Azula, Aang and the others flew on Appa, proceeding to catch Zuko when he and his sister fell from the airship after their attacks clashed. When Katara announced that she was going to find the man who killed her mother, along with Zuko, Aang questioned her motives, even saying she sounded like Jet, and saying that he understood what she was feeling, mentioning Appa's theft by the sandbenders and his discovery of what happened to his people. When she decided to go anyway, he supported her, but asked her not to resort to violence and to let go of her anger. When Zuko and Katara came back, he said he was proud of her and told Zuko that violence is never the answer. He was subsequently asked by Zuko what he will do when he faces Ozai."
    },
    {
      "body": "${link_0} practiced ${link_1} with ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_2}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Aang practiced firebending with Zuko."
    },
    {
      "body": "Aang and Zuko were training while Katara and Toph watched. Katara asked if it was safe for them to be hiding in ${link_0} on ${link_1}, but Zuko told her it was the last place he would look. Sokka and ${link_2}, now in Fire Nation disguise, came back from town with a flier about a play about Team Avatar put on by the ${link_3}.",
      "links": [
        {
          "body": "Ozai's beach house",
          "key": "${link_0}",
          "target": {
            "href": "Ozai%27s_beach_house",
            "page": "Ozai%27s_beach_house"
          }
        },
        {
          "body": "Ember Island",
          "key": "${link_1}",
          "target": {
            "href": "Ember_Island",
            "page": "Ember_Island"
          }
        },
        {
          "body": "Suki",
          "key": "${link_2}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Ember Island Players",
          "key": "${link_3}",
          "target": {
            "href": "Ember_Island_Players",
            "page": "Ember_Island_Players"
          }
        }
      ],
      "text": "Aang and Zuko were training while Katara and Toph watched. Katara asked if it was safe for them to be hiding in Ozai's beach house on Ember Island, but Zuko told her it was the last place he would look. Sokka and Suki, now in Fire Nation disguise, came back from town with a flier about a play about Team Avatar put on by the Ember Island Players."
    },
    {
      "body": "When they got to the ${link_0}, Aang tried to sit next to Katara but Zuko sat down next to her first, forcing him to sit next to his former enemy. The play started with Sokka and Katara in a canoe. Katara's actress gave a long speech about hope while Sokka's cracks jokes about how hungry he was, much to the disgust of the real Sokka and Katara. They came across an iceberg with an Aang puppet inside, and Katara used her waterbending to release him. Once the actual actor surfaced, Aang reeled back in shock upon seeing that a woman was playing him, much to Toph's amusement.",
      "links": [
        {
          "body": "theater",
          "key": "${link_0}",
          "target": {
            "href": "Ember_Island_Theater",
            "page": "Ember_Island_Theater"
          }
        }
      ],
      "text": "When they got to the theater, Aang tried to sit next to Katara but Zuko sat down next to her first, forcing him to sit next to his former enemy. The play started with Sokka and Katara in a canoe. Katara's actress gave a long speech about hope while Sokka's cracks jokes about how hungry he was, much to the disgust of the real Sokka and Katara. They came across an iceberg with an Aang puppet inside, and Katara used her waterbending to release him. Once the actual actor surfaced, Aang reeled back in shock upon seeing that a woman was playing him, much to Toph's amusement."
    },
    {
      "body": "The next scene of the play showed Zuko and Iroh's actors. Iroh's actor was very short and fat while Zuko's actor had a mask on with his scar, but on the wrong eye. Iroh told Zuko to have some cake, but the Zuko actor said he did not have time because he must regain his honor. Zuko thought they made his character stiff and humorless, which Katara thought was a perfect rendition. The play moved on through Team Avatar's winter months, with Aang finding Momo, Sokka dressed as a ${link_0} with the Suki actress, ${link_1} ${link_2}'s challenge for Aang to save Katara and Sokka, the pirates attacking the gang to get back their scroll, the Blue Spirit inaccurately saving Aang from Zuko, Jet destroying a town by summoning water, Yue becoming the Moon Spirit and Aang saving the Water Tribe from Zhao.",
      "links": [
        {
          "body": "Kyoshi Warrior",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "King",
          "key": "${link_1}",
          "target": {
            "href": "King_of_Omashu",
            "page": "King_of_Omashu"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_2}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        }
      ],
      "text": "The next scene of the play showed Zuko and Iroh's actors. Iroh's actor was very short and fat while Zuko's actor had a mask on with his scar, but on the wrong eye. Iroh told Zuko to have some cake, but the Zuko actor said he did not have time because he must regain his honor. Zuko thought they made his character stiff and humorless, which Katara thought was a perfect rendition. The play moved on through Team Avatar's winter months, with Aang finding Momo, Sokka dressed as a Kyoshi Warrior with the Suki actress, King Bumi's challenge for Aang to save Katara and Sokka, the pirates attacking the gang to get back their scroll, the Blue Spirit inaccurately saving Aang from Zuko, Jet destroying a town by summoning water, Yue becoming the Moon Spirit and Aang saving the Water Tribe from Zhao."
    },
    {
      "body": "The gang went outside for the intermission, and they were all disgusted at the way they had been portrayed. Toph told them what they were seeing on the stage was the truth. They went back in for act two, and it started with them trying to find Aang an earthbending master. The Toph actor appeared, and he was a muscular guy who instead of using his feet to see, released a sonic wave by screaming. Toph was very satisfied by the way she was portrayed. The play went on to show Zuko and Iroh going their separate ways because Iroh thought Zuko's hair had gotten too long. Later, they showed the scene from the chase where they cornered Azula who narrowly escaped by fooling Zuko into turning around to look for his honor. It later showed a scene of the attack of the drill in Ba Sing Se, followed by a scene of Jet, apparently hypnotized by the ${link_0}, getting crushed by a rock. Zuko was slightly shocked by this and asked Sokka if Jet died, in which Sokka replied \"it was very unclear.\"",
      "links": [
        {
          "body": "Earth King",
          "key": "${link_0}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "The gang went outside for the intermission, and they were all disgusted at the way they had been portrayed. Toph told them what they were seeing on the stage was the truth. They went back in for act two, and it started with them trying to find Aang an earthbending master. The Toph actor appeared, and he was a muscular guy who instead of using his feet to see, released a sonic wave by screaming. Toph was very satisfied by the way she was portrayed. The play went on to show Zuko and Iroh going their separate ways because Iroh thought Zuko's hair had gotten too long. Later, they showed the scene from the chase where they cornered Azula who narrowly escaped by fooling Zuko into turning around to look for his honor. It later showed a scene of the attack of the drill in Ba Sing Se, followed by a scene of Jet, apparently hypnotized by the Earth King, getting crushed by a rock. Zuko was slightly shocked by this and asked Sokka if Jet died, in which Sokka replied \"it was very unclear.\""
    },
    {
      "body": "The next scene showed Zuko and Katara in a cave, with the Katara actress hitting on the Zuko actor, which made their real life counterparts slightly uncomfortable. The Katara actress told him the Avatar was like a little brother to her, and that she did not think of him romantically and they both hugged. Aang got annoyed and stormed off. The next scene in the play, Zuko sided with Azula and pushed Iroh over, which deeply offended the real Zuko followed by Azula taking Aang down with lightning and claiming \"The Avatar is no more!\" and posing with the Mai and Ty Lee actresses. The crowd cheered and the gang looked on in disbelief.",
      "links": [],
      "text": "The next scene showed Zuko and Katara in a cave, with the Katara actress hitting on the Zuko actor, which made their real life counterparts slightly uncomfortable. The Katara actress told him the Avatar was like a little brother to her, and that she did not think of him romantically and they both hugged. Aang got annoyed and stormed off. The next scene in the play, Zuko sided with Azula and pushed Iroh over, which deeply offended the real Zuko followed by Azula taking Aang down with lightning and claiming \"The Avatar is no more!\" and posing with the Mai and Ty Lee actresses. The crowd cheered and the gang looked on in disbelief."
    },
    {
      "body": "During the next intermission, Katara met up with Aang outside who was upset about the play and how he could be in the Avatar State if Azula had not blocked his last chakra.",
      "links": [],
      "text": "During the next intermission, Katara met up with Aang outside who was upset about the play and how he could be in the Avatar State if Azula had not blocked his last chakra."
    },
    {
      "body": "${link_0} and ${link_1} discussed the state of their relationship during the intermission.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Aang and Katara discussed the state of their relationship during the intermission."
    },
    {
      "body": "Aang asked Katara if she had feelings for him and how he thought they would be together after the invasion. Katara told him that she was confused, and that now was not the right time. Aang kissed her again and she got angry and ran back inside.",
      "links": [],
      "text": "Aang asked Katara if she had feelings for him and how he thought they would be together after the invasion. Katara told him that she was confused, and that now was not the right time. Aang kissed her again and she got angry and ran back inside."
    },
    {
      "body": "Aang came back and Sokka summarized what Aang missed. The invasion started with Katara telling Aang she loved him like a brother and they shook hands. Sokka's actor asked Toph if Aang and her have a \"rocky relationship\", and Sokka squealed with joy at the fact that he used his line. Zuko joined the group during the invasion because Ozai was not there. Sokka got up to leave thinking the play was over because it had caught up to the present, but Suki told him the play's not over yet.",
      "links": [],
      "text": "Aang came back and Sokka summarized what Aang missed. The invasion started with Katara telling Aang she loved him like a brother and they shook hands. Sokka's actor asked Toph if Aang and her have a \"rocky relationship\", and Sokka squealed with joy at the fact that he used his line. Zuko joined the group during the invasion because Ozai was not there. Sokka got up to leave thinking the play was over because it had caught up to the present, but Suki told him the play's not over yet."
    },
    {
      "body": "Fire Lord Ozai appeared on stage, summoning power from the comet. Azula came in and told him that Zuko and Aang were at the palace trying to stop him. Zuko fought Azula and was killed, his last words were \"HONOR!\", and the crowd cheered as Zuko watched in horror; the group staring at him in disbelief. Aang made his way to the Fire Lord, but the comet had come already and he was unstoppable. Ozai fired a giant fireball at Aang, killing him. Azula came back in and Ozai gave a speech about how the world was now his as the crowd gave him a standing ovation.",
      "links": [],
      "text": "Fire Lord Ozai appeared on stage, summoning power from the comet. Azula came in and told him that Zuko and Aang were at the palace trying to stop him. Zuko fought Azula and was killed, his last words were \"HONOR!\", and the crowd cheered as Zuko watched in horror; the group staring at him in disbelief. Aang made his way to the Fire Lord, but the comet had come already and he was unstoppable. Ozai fired a giant fireball at Aang, killing him. Azula came back in and Ozai gave a speech about how the world was now his as the crowd gave him a standing ovation."
    },
    {
      "body": "The group walked back to Ozai's beach house talking about how the play was terrible, but Sokka thought the effects were decent.‎",
      "links": [],
      "text": "The group walked back to Ozai's beach house talking about how the play was terrible, but Sokka thought the effects were decent.‎"
    },
    {
      "body": "${link_0} continued his ${link_1} during his stay on ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "firebending training",
          "key": "${link_1}",
          "target": {
            "href": "Firebending_training",
            "page": "Firebending_training"
          }
        },
        {
          "body": "Ember Island",
          "key": "${link_2}",
          "target": {
            "href": "Ember_Island",
            "page": "Ember_Island"
          }
        }
      ],
      "text": "Aang continued his firebending training during his stay on Ember Island."
    },
    {
      "body": "Three days before the arrival of ${link_0}, Aang was ${link_1}. Zuko pushed him to be more aggressive and ferocious, but became frustrated with Aang when he became unfocused. Aang joined Sokka and the others in holding a beach party, playing around in the water and making a sand sculpture of Appa and laughed hysterically at Sokka's crude Suki sand sculpture. However, Zuko attacked him in the middle of the party and chased him off the beach, onto the house roof, and into the house, shooting fire blasts at him the entire time. Finally, Aang blasted Zuko out of the house using ${link_2}. He and the others gathered around Zuko, demanding to know what was wrong with him, but Zuko asked them how they could be having beach parties when Sozin's Comet was only three days away. Aang revealed that he planned to defeat the Fire Lord after the comet arrives. The others explained to an incredulous Zuko that the point of fighting the Fire Lord before the comet was to win the war, but the Fire Nation won the War when they captured Ba Sing Se. However, Zuko revealed that Ozai planned to use the power of the comet to destroy the ${link_3} and build a new world from the ashes. The rest of the group was horrified by this plan, and Zuko urged Aang to defeat the Fire Lord to save the world.",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "practicing firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending_training",
            "page": "Firebending_training"
          }
        },
        {
          "body": "airbending",
          "key": "${link_2}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_3}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Three days before the arrival of Sozin's Comet, Aang was practicing firebending. Zuko pushed him to be more aggressive and ferocious, but became frustrated with Aang when he became unfocused. Aang joined Sokka and the others in holding a beach party, playing around in the water and making a sand sculpture of Appa and laughed hysterically at Sokka's crude Suki sand sculpture. However, Zuko attacked him in the middle of the party and chased him off the beach, onto the house roof, and into the house, shooting fire blasts at him the entire time. Finally, Aang blasted Zuko out of the house using airbending. He and the others gathered around Zuko, demanding to know what was wrong with him, but Zuko asked them how they could be having beach parties when Sozin's Comet was only three days away. Aang revealed that he planned to defeat the Fire Lord after the comet arrives. The others explained to an incredulous Zuko that the point of fighting the Fire Lord before the comet was to win the war, but the Fire Nation won the War when they captured Ba Sing Se. However, Zuko revealed that Ozai planned to use the power of the comet to destroy the Earth Kingdom and build a new world from the ashes. The rest of the group was horrified by this plan, and Zuko urged Aang to defeat the Fire Lord to save the world."
    },
    {
      "body": "Later on, Zuko taught Aang one final firebending technique: ${link_0}. Zuko warned Aang to be careful with the technique and not make a wrong move, or else he can be killed. He also told Aang he must strike Ozai first, or else he will be defeated instead. Later, Sokka planned a training session using a model for the Fire Lord with a melon for a head, called the \"Melon Lord\". He had Toph play the Melon Lord's forces, while the others attacked it, with Aang supposed to deliver the final blow. However, when the simulated fight actually took place, Aang was unable to kill the fake Fire Lord. Instead, Sokka cut the melon in half while Aang winced.",
      "links": [
        {
          "body": "lightning redirection",
          "key": "${link_0}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "text": "Later on, Zuko taught Aang one final firebending technique: lightning redirection. Zuko warned Aang to be careful with the technique and not make a wrong move, or else he can be killed. He also told Aang he must strike Ozai first, or else he will be defeated instead. Later, Sokka planned a training session using a model for the Fire Lord with a melon for a head, called the \"Melon Lord\". He had Toph play the Melon Lord's forces, while the others attacked it, with Aang supposed to deliver the final blow. However, when the simulated fight actually took place, Aang was unable to kill the fake Fire Lord. Instead, Sokka cut the melon in half while Aang winced."
    },
    {
      "body": "During dinner, Katara found a painting of what she at first believed to be a painting of Zuko as a baby, until Zuko told them that it was actually a picture of his father. When Zuko said that the sweet and innocent baby Ozai grew up to be a monster, Aang pointed out to everyone that he was still a human being. When Zuko berated him, Aang began arguing with the group, telling them that he could not kill Ozai, as it went against everything the monks taught him. The others, especially Zuko, told him that he needed to kill Ozai for the good of the world. Aang stormed off to the other side of the house and meditated in the balcony.",
      "links": [],
      "text": "During dinner, Katara found a painting of what she at first believed to be a painting of Zuko as a baby, until Zuko told them that it was actually a picture of his father. When Zuko said that the sweet and innocent baby Ozai grew up to be a monster, Aang pointed out to everyone that he was still a human being. When Zuko berated him, Aang began arguing with the group, telling them that he could not kill Ozai, as it went against everything the monks taught him. The others, especially Zuko, told him that he needed to kill Ozai for the good of the world. Aang stormed off to the other side of the house and meditated in the balcony."
    },
    {
      "body": "That night, Aang awoke in a trance and walked down to the beach, into the water and swam to a mysterious island that had appeared only that night, with Momo flying along behind him. When he woke up the next morning, he discovered he had left the Fire Nation and was on a strange island in the middle of the sea with Momo. He briefly wondered if he was in the Spirit World, but dismissed that possibility as Momo could see him, and he was still able to bend. He searched the island and found a strange hexagonal formation in the center which he was unable to bend, meaning it was not earth. He decided to meditate and seek the wisdom of his past lives. The first past life he contacted was Roku, who told him he did not know where he was, but he could offer advice on Aang's other problems.",
      "links": [],
      "text": "That night, Aang awoke in a trance and walked down to the beach, into the water and swam to a mysterious island that had appeared only that night, with Momo flying along behind him. When he woke up the next morning, he discovered he had left the Fire Nation and was on a strange island in the middle of the sea with Momo. He briefly wondered if he was in the Spirit World, but dismissed that possibility as Momo could see him, and he was still able to bend. He searched the island and found a strange hexagonal formation in the center which he was unable to bend, meaning it was not earth. He decided to meditate and seek the wisdom of his past lives. The first past life he contacted was Roku, who told him he did not know where he was, but he could offer advice on Aang's other problems."
    },
    {
      "body": "${link_0} discussed his indecision with the ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "lion turtle",
          "key": "${link_1}",
          "target": {
            "href": "Lion_turtle#Era_of_the_Avatar",
            "page": "Lion_turtle"
          }
        }
      ],
      "text": "Aang discussed his indecision with the lion turtle."
    },
    {
      "body": "When Aang told him about how conflicted he was in taking Ozai's life, Roku told him of when he was the Avatar. He tried to show restraint in his time, but Fire Lord Sozin took advantage of him. Roku said that if he had been more decisive, he could have stopped the war before it started, and he told Aang to be decisive. Next, Aang contacted Avatar Kyoshi, who told him of when she fought Chin the Conqueror, and how she would have done whatever it took to uphold justice. She advised Aang to let justice guide his way. Aang looked deeper inside himself and contacted Avatar Kuruk. Kuruk told him that when he was young, he generally played no part in shaping the world, since he lived during a time of great peace and people generally worked out their own problems. However, Koh the Face Stealer took Kuruk's wife away from him. Kuruk blamed himself for not being attentive enough and advised Aang to actively shape his destiny. Finally, seeking an Avatar who would be more sympathetic toward him, Aang contacted the Air Nomad Avatar, Yangchen. Aang told her how he was taught to respect all life and remove himself from the world to attain spiritual peace. Yangchen sympathized with him, but told him that the Avatar must sacrifice his spiritual well-being for the good of the world. Aang concluded that he had no choice but to kill the Fire Lord.",
      "links": [],
      "text": "When Aang told him about how conflicted he was in taking Ozai's life, Roku told him of when he was the Avatar. He tried to show restraint in his time, but Fire Lord Sozin took advantage of him. Roku said that if he had been more decisive, he could have stopped the war before it started, and he told Aang to be decisive. Next, Aang contacted Avatar Kyoshi, who told him of when she fought Chin the Conqueror, and how she would have done whatever it took to uphold justice. She advised Aang to let justice guide his way. Aang looked deeper inside himself and contacted Avatar Kuruk. Kuruk told him that when he was young, he generally played no part in shaping the world, since he lived during a time of great peace and people generally worked out their own problems. However, Koh the Face Stealer took Kuruk's wife away from him. Kuruk blamed himself for not being attentive enough and advised Aang to actively shape his destiny. Finally, seeking an Avatar who would be more sympathetic toward him, Aang contacted the Air Nomad Avatar, Yangchen. Aang told her how he was taught to respect all life and remove himself from the world to attain spiritual peace. Yangchen sympathized with him, but told him that the Avatar must sacrifice his spiritual well-being for the good of the world. Aang concluded that he had no choice but to kill the Fire Lord."
    },
    {
      "body": "When he woke up the following morning, he saw the Earth Kingdom shore getting closer and realized the island was moving. He dove into the water and discovered the island was actually a creature, which revealed itself to be a ${link_0}. He asked the lion turtle for advice, seeking a way to defeat the Fire Lord without killing him. The lion turtle gave him spiritual advice and told him of the time before the Avatar and the four nations. A little while later, the lion turtle left Aang at the shore and told him to wait for Ozai.",
      "links": [
        {
          "body": "lion turtle",
          "key": "${link_0}",
          "target": {
            "href": "Lion_turtle#Era_of_the_Avatar",
            "page": "Lion_turtle"
          }
        }
      ],
      "text": "When he woke up the following morning, he saw the Earth Kingdom shore getting closer and realized the island was moving. He dove into the water and discovered the island was actually a creature, which revealed itself to be a lion turtle. He asked the lion turtle for advice, seeking a way to defeat the Fire Lord without killing him. The lion turtle gave him spiritual advice and told him of the time before the Avatar and the four nations. A little while later, the lion turtle left Aang at the shore and told him to wait for Ozai."
    },
    {
      "body": "${link_0} bent all ${link_1} in the ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "four elements",
          "key": "${link_1}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "Aang bent all four elements in the Avatar State."
    },
    {
      "body": "Soon after, Sozin's comet arrived and hit the atmosphere, turning the sky red. Ozai's ${link_0} arrived at the Earth Kingdom shore, with ${link_1} in the lead. Ozai used his comet-enhanced firebending to begin burning the Earth Kingdom. Aang used earth and firebending to disable Ozai's ship. Initially shocked to find the Avatar there, Ozai flew over to Aang using fire rockets emerging from his feet. Aang asked Ozai not to go on with his plan, saying he had the power to stop it. Ozai merely sneered at this proposal and attacked Aang.",
      "links": [
        {
          "body": "fleet of airships",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        },
        {
          "body": "Ozai's ship",
          "key": "${link_1}",
          "target": {
            "href": "Ozai%27s_personal_airship",
            "page": "Ozai%27s_personal_airship"
          }
        }
      ],
      "text": "Soon after, Sozin's comet arrived and hit the atmosphere, turning the sky red. Ozai's fleet of airships arrived at the Earth Kingdom shore, with Ozai's ship in the lead. Ozai used his comet-enhanced firebending to begin burning the Earth Kingdom. Aang used earth and firebending to disable Ozai's ship. Initially shocked to find the Avatar there, Ozai flew over to Aang using fire rockets emerging from his feet. Aang asked Ozai not to go on with his plan, saying he had the power to stop it. Ozai merely sneered at this proposal and attacked Aang."
    },
    {
      "body": "Aang and Ozai began to battle. Aang skillfully used all four elements against Ozai's comet-enhanced firebending, but he still remained on the defensive, allowing Ozai to chase him all around the rock spires. Ozai then began to use lightning attacks that got closer and closer to Aang. Finally, Aang absorbed one of the blasts, but due to his belief that all life, no matter the crimes, is sacred, he was unable to shoot it back at Ozai and instead redirected it into the sky away from Ozai. Incensed, Ozai attacked Aang even more fiercely and finally got the upper hand over him. Aang took refuge by forming a rock sphere around himself. Ozai repeatedly struck, all the while calling him and the Air Nomads weak. With a powerful fire blast, Ozai broke Aang's earthen sphere, and Aang was pushed into a wall. The stone pressed his scar and the seventh chakra unlocks, allowing him access to the Avatar State. Aang then activated the Avatar State, reaching a level he had never before used or needed, and in an impressive simultaneous movement, bent all four elements to counter Ozai, gaining the upper hand. When he was about to give the final blow, he left the Avatar State, saying that he did not want to end it like this. When Ozai tried to take advantage of this moment, Aang pinned him down with earthbending and used ${link_0} he had learned from the lion turtle to strip Ozai of his firebending. He then used the Avatar State to extinguish the fire caused by the airships.",
      "links": [
        {
          "body": "energybending",
          "key": "${link_0}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        }
      ],
      "text": "Aang and Ozai began to battle. Aang skillfully used all four elements against Ozai's comet-enhanced firebending, but he still remained on the defensive, allowing Ozai to chase him all around the rock spires. Ozai then began to use lightning attacks that got closer and closer to Aang. Finally, Aang absorbed one of the blasts, but due to his belief that all life, no matter the crimes, is sacred, he was unable to shoot it back at Ozai and instead redirected it into the sky away from Ozai. Incensed, Ozai attacked Aang even more fiercely and finally got the upper hand over him. Aang took refuge by forming a rock sphere around himself. Ozai repeatedly struck, all the while calling him and the Air Nomads weak. With a powerful fire blast, Ozai broke Aang's earthen sphere, and Aang was pushed into a wall. The stone pressed his scar and the seventh chakra unlocks, allowing him access to the Avatar State. Aang then activated the Avatar State, reaching a level he had never before used or needed, and in an impressive simultaneous movement, bent all four elements to counter Ozai, gaining the upper hand. When he was about to give the final blow, he left the Avatar State, saying that he did not want to end it like this. When Ozai tried to take advantage of this moment, Aang pinned him down with earthbending and used energybending he had learned from the lion turtle to strip Ozai of his firebending. He then used the Avatar State to extinguish the fire caused by the airships."
    },
    {
      "body": "${link_0} donned new monk's robes after the end of the ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_1}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "Aang donned new monk's robes after the end of the Hundred Year War."
    },
    {
      "body": "The next day, Aang attended Zuko's coronation, dressed in new attire quite similar to Monk Gyatso's. He spoke briefly with the soon-to-be Fire Lord, and both of them marveled at how much things have changed throughout the course of their journey. They embraced one another and promised to remain friends and rebuild the world together. When Zuko was crowned, he promised to redeem the honor of the Fire Nation and work with the Avatar to restore the balance of the world.",
      "links": [],
      "text": "The next day, Aang attended Zuko's coronation, dressed in new attire quite similar to Monk Gyatso's. He spoke briefly with the soon-to-be Fire Lord, and both of them marveled at how much things have changed throughout the course of their journey. They embraced one another and promised to remain friends and rebuild the world together. When Zuko was crowned, he promised to redeem the honor of the Fire Nation and work with the Avatar to restore the balance of the world."
    },
    {
      "body": "Sometime after, Team Avatar went to the Earth King's palace and met with ${link_0}. The group decided on the formation of the ${link_1}, named by Sokka, to remove the Fire Nation colonies from the Earth Kingdom.",
      "links": [
        {
          "body": "Kuei",
          "key": "${link_0}",
          "target": {
            "href": "Kuei",
            "page": "Kuei"
          }
        },
        {
          "body": "Harmony Restoration Movement",
          "key": "${link_1}",
          "target": {
            "href": "Harmony_Restoration_Movement",
            "page": "Harmony_Restoration_Movement"
          }
        }
      ],
      "text": "Sometime after, Team Avatar went to the Earth King's palace and met with Kuei. The group decided on the formation of the Harmony Restoration Movement, named by Sokka, to remove the Fire Nation colonies from the Earth Kingdom."
    },
    {
      "body": "${link_0} and ${link_1} began their relationship.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Aang and Katara began their relationship."
    },
    {
      "body": "That evening, the group was shown at the ${link_0}, where they were relaxing. Sokka was painting a picture to remember the good times they had together, but it was criticized by everyone. In his picture, Suki was firebending, Iroh was very round and Zuko complained that his hair was not that spiky, and Toph said that everyone looked perfect to her, which caused the group to laugh. Aang smiled before going outside, soon followed by Katara. The two smiled at each other, leaned into each other, embracing one another in a hug. Katara soon instigated a passionate kiss, starting what fulfilled Aunt ${link_1}'s prediction almost a year prior.",
      "links": [
        {
          "body": "Jasmine Dragon",
          "key": "${link_0}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        },
        {
          "body": "Wu",
          "key": "${link_1}",
          "target": {
            "href": "Wu_(fortuneteller)",
            "page": "Wu_(fortuneteller)"
          }
        }
      ],
      "text": "That evening, the group was shown at the Jasmine Dragon, where they were relaxing. Sokka was painting a picture to remember the good times they had together, but it was criticized by everyone. In his picture, Suki was firebending, Iroh was very round and Zuko complained that his hair was not that spiky, and Toph said that everyone looked perfect to her, which caused the group to laugh. Aang smiled before going outside, soon followed by Katara. The two smiled at each other, leaned into each other, embracing one another in a hug. Katara soon instigated a passionate kiss, starting what fulfilled Aunt Wu's prediction almost a year prior."
    },
    {
      "body": "After kissing Katara and affirming their relationship, Sokka arrived to take Appa for a ride. Aang took Team Avatar for a fast ride through the Ba Sing Se skyline, thrilling everyone aboard except Zuko. Trying to cheer him up, Aang smiled and made a funny face. Zuko responded by making Aang promise that if Zuko ever turned from the idea of balance, Aang must end him.",
      "links": [],
      "text": "After kissing Katara and affirming their relationship, Sokka arrived to take Appa for a ride. Aang took Team Avatar for a fast ride through the Ba Sing Se skyline, thrilling everyone aboard except Zuko. Trying to cheer him up, Aang smiled and made a funny face. Zuko responded by making Aang promise that if Zuko ever turned from the idea of balance, Aang must end him."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Aang_(Summer_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Aang_(Summer_100_AG).html",
    "page": "History_of_Aang_(Summer_100_AG)",
    "title": "History of Aang (Summer 100 AG)"
  }
}