{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "With a shift in the world's energy due to ${link_0}, ${link_1} and ${link_2} set out to scour the ${link_3} in search for the new ${link_4} to offer training and guidance. However, while the ${link_5} is slowly being rebuilt, Mako meets his paternal family for the first time and is faced with a new danger when ${link_6} and his fellow ${link_7} accomplices escape their respective prisons and set out to bring ${link_8} down and succumb the ${link_9} into anarchy. Since they pose a lethal threat to Korra, Mako sets out to assist Korra in the fight to save not only the balance of the nations in the world, but also herself and the ${link_10} Cycle.",
      "links": [
        {
          "body": "Harmonic Convergence",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "his friends",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Air Nation",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomads#Rebirth_of_a_nation",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "all the nations",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Four_nations",
            "page": "Four_nations"
          }
        },
        {
          "body": "world",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)"
      ],
      "text": "With a shift in the world's energy due to Harmonic Convergence, Mako and his friends set out to scour the Earth Kingdom in search for the new airbenders to offer training and guidance. However, while the Air Nation is slowly being rebuilt, Mako meets his paternal family for the first time and is faced with a new danger when Zaheer and his fellow Red Lotus accomplices escape their respective prisons and set out to bring all the nations down and succumb the world into anarchy. Since they pose a lethal threat to Korra, Mako sets out to assist Korra in the fight to save not only the balance of the nations in the world, but also herself and the Avatar Cycle."
    },
    {
      "body": "During the two weeks following Harmonic Convergence, ${link_0} had been overrun with ${link_1} from the ${link_2}. Although ${link_3} invited the brothers to stay at ${link_4}, Mako declined the offer and lived at the ${link_5}, the main reason being that he did not feel comfortable around ${link_6} and ${link_7} despite their being on friendly terms.",
      "links": [
        {
          "body": "Mako and Bolin's apartment",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mako_and_Bolin%27s_apartment",
            "page": "Mako_and_Bolin%27s_apartment"
          }
        },
        {
          "body": "vines",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Air Temple Island",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "police station",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Police_headquarters",
            "page": "Police_headquarters"
          }
        },
        {
          "body": "Korra",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Asami",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Post-Harmonic Convergence"
      ],
      "text": "During the two weeks following Harmonic Convergence, Mako and Bolin's apartment had been overrun with vines from the Spirit World. Although Tenzin invited the brothers to stay at Air Temple Island, Mako declined the offer and lived at the police station, the main reason being that he did not feel comfortable around Korra and Asami despite their being on friendly terms."
    },
    {
      "body": "During this time, Mako rejoined the ${link_0} and took part in a charity championship organized to help rebuild ${link_1} following the damages caused by the ${link_2}. At the start of one match, Bolin insinuated that Mako had been out of practice, to which Mako stated that he had been out fighting crime as a cop, while Bolin was \"fake-${link_3}\" as ${link_4}. As the brothers were busy teasing each other, they were quickly knocked out of the ring once the match had officially begun, leaving Korra to win the match by herself.",
      "links": [
        {
          "body": "Fire Ferrets",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Unalaq Crisis",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq_Crisis",
            "page": "Unalaq_Crisis"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Nuktuk",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/The_Adventures_of_Nuktuk__Hero_of_the_South",
            "page": "The_Adventures_of_Nuktuk__Hero_of_the_South"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Post-Harmonic Convergence"
      ],
      "text": "During this time, Mako rejoined the Fire Ferrets and took part in a charity championship organized to help rebuild Republic City following the damages caused by the Unalaq Crisis. At the start of one match, Bolin insinuated that Mako had been out of practice, to which Mako stated that he had been out fighting crime as a cop, while Bolin was \"fake-waterbending\" as Nuktuk. As the brothers were busy teasing each other, they were quickly knocked out of the ring once the match had officially begun, leaving Korra to win the match by herself."
    },
    {
      "body": "One week later, the Ferrets were up against the ${link_0} in the final match of the championship. During the match, Mako and Bolin cheerfully greeted Korra, as they had not seen her since the end of the last match. They continued to tell Korra what she had missed while she was away, though the Avatar was more concerned in preventing the brothers from being knocked out again. Bolin jokingly asked if the reason Korra broke up with Mako was due to him being the weakest member of the team, inadvertently making Mako feel uncomfortable. Shortly after, they were able to beat the Wolfbats and win the charity championship.",
      "links": [
        {
          "body": "White Falls Wolfbats",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/White_Falls_Wolfbats",
            "page": "White_Falls_Wolfbats"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Post-Harmonic Convergence"
      ],
      "text": "One week later, the Ferrets were up against the White Falls Wolfbats in the final match of the championship. During the match, Mako and Bolin cheerfully greeted Korra, as they had not seen her since the end of the last match. They continued to tell Korra what she had missed while she was away, though the Avatar was more concerned in preventing the brothers from being knocked out again. Bolin jokingly asked if the reason Korra broke up with Mako was due to him being the weakest member of the team, inadvertently making Mako feel uncomfortable. Shortly after, they were able to beat the Wolfbats and win the charity championship."
    },
    {
      "body": "Sometime later, Mako was awoken at night by the phone ringing and investigated a strange claim at a citizen's home. When the man told Mako his brother somehow ${link_0} the room around him, Mako was skeptical since the ${link_1} and Tenzin's family were the ${link_2}'s only airbenders. Checking up on the brother held up inside a room, Mako demanded that he come out, only to be knocked aside by a blast of air. The man apologized before running away.",
      "links": [
        {
          "body": "airbent",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "world",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Post-Harmonic Convergence"
      ],
      "text": "Sometime later, Mako was awoken at night by the phone ringing and investigated a strange claim at a citizen's home. When the man told Mako his brother somehow airbent the room around him, Mako was skeptical since the Avatar and Tenzin's family were the world's only airbenders. Checking up on the brother held up inside a room, Mako demanded that he come out, only to be knocked aside by a blast of air. The man apologized before running away."
    },
    {
      "body": "The next day, Mako and ${link_0} ${link_1} traveled to Air Temple Island to discuss the case with Tenzin. When Tenzin told Beifong that Bumi somehow became an airbender, it only confirmed their suspicions that airbenders were popping up around the world. They left to find the airbender but not before Korra attempted to engage Mako in conversation which went awkwardly, much to Korra and Asami's amusement. The police later found the airbender atop ${link_2}, with Mako being present at the scene.",
      "links": [
        {
          "body": "Chief",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Chief_of_Police",
            "page": "Chief_of_Police"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Kyoshi Bridge",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Bridge",
            "page": "Kyoshi_Bridge"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Post-Harmonic Convergence"
      ],
      "text": "The next day, Mako and Chief Lin Beifong traveled to Air Temple Island to discuss the case with Tenzin. When Tenzin told Beifong that Bumi somehow became an airbender, it only confirmed their suspicions that airbenders were popping up around the world. They left to find the airbender but not before Korra attempted to engage Mako in conversation which went awkwardly, much to Korra and Asami's amusement. The police later found the airbender atop Kyoshi Bridge, with Mako being present at the scene."
    },
    {
      "body": "When Korra and Tenzin decided to find the airbenders around the Earth Kingdom to recreate the ${link_0}, Mako handed Korra a map detailing all the reported sightings of airbenders. Mako initially declined to come along, stating that he needed to focus on his police duties, though Bolin managed to persuade him otherwise, pointing out that they would be headed to their father's birthplace in ${link_1} and he would not want to disappoint his paternal grandmother if they run into their extended family. Aboard Asami's Future Industries airship, Mako and the group traveled to all the villages reported to have airbenders. However, their efforts to recruit them were fruitless. In one case, Mako and Bolin went with Korra to recruit ${link_2}, a lazy and careless airbender. His indifferent attitude infuriated Korra to the point where she almost forcibly manhandled him, leading the brothers to drag her away before causing any more mayhem.",
      "links": [
        {
          "body": "Air Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomads#Rebirth_of_a_nation",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Ryu",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ryu",
            "page": "Ryu"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Post-Harmonic Convergence"
      ],
      "text": "When Korra and Tenzin decided to find the airbenders around the Earth Kingdom to recreate the Air Nation, Mako handed Korra a map detailing all the reported sightings of airbenders. Mako initially declined to come along, stating that he needed to focus on his police duties, though Bolin managed to persuade him otherwise, pointing out that they would be headed to their father's birthplace in Ba Sing Se and he would not want to disappoint his paternal grandmother if they run into their extended family. Aboard Asami's Future Industries airship, Mako and the group traveled to all the villages reported to have airbenders. However, their efforts to recruit them were fruitless. In one case, Mako and Bolin went with Korra to recruit Ryu, a lazy and careless airbender. His indifferent attitude infuriated Korra to the point where she almost forcibly manhandled him, leading the brothers to drag her away before causing any more mayhem."
    },
    {
      "body": "Now desperate, the group decided to perform an \"air show\" displaying the talents of airbending at the last town. Mako got reluctantly roped to be the bad guy and, as part of the rehearsal, would be incapacitated by Korra's air vortex, though Korra and Asami had some fun in making him even more uncomfortable by slightly going off script. Eventually, a street orphan named ${link_0} came up to the group, wishing to join them, stating that his parents were killed by outlaws. Just as they were about to leave, Mako noticed some suspicious men chasing them and Kai pleaded to run away. Korra easily defeated them but the leader, revealed to be the town's sheriff, told her the boy was a thief. Mako caught Kai and revealed that his bag contained a large sum of money stolen from his adopted family. Despite the crime, Korra and Tenzin allowed Kai to come along and have the money returned, though Mako told Kai he would be watching him, knowing from his experiences as a former hustler.",
      "links": [
        {
          "body": "Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kai",
            "page": "Kai"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Post-Harmonic Convergence"
      ],
      "text": "Now desperate, the group decided to perform an \"air show\" displaying the talents of airbending at the last town. Mako got reluctantly roped to be the bad guy and, as part of the rehearsal, would be incapacitated by Korra's air vortex, though Korra and Asami had some fun in making him even more uncomfortable by slightly going off script. Eventually, a street orphan named Kai came up to the group, wishing to join them, stating that his parents were killed by outlaws. Just as they were about to leave, Mako noticed some suspicious men chasing them and Kai pleaded to run away. Korra easily defeated them but the leader, revealed to be the town's sheriff, told her the boy was a thief. Mako caught Kai and revealed that his bag contained a large sum of money stolen from his adopted family. Despite the crime, Korra and Tenzin allowed Kai to come along and have the money returned, though Mako told Kai he would be watching him, knowing from his experiences as a former hustler."
    },
    {
      "body": "Upon arriving at ${link_0}, the party was greeted by ${link_1} ${link_2}. While Korra was having her audience with Earth Queen ${link_3}, everyone noticed that Kai had slipped away. Mako realized he had returned to his thieving ways, though he and Bolin agreed to search for him at Tenzin's request. They later spotted Kai using his airbending to con unsuspecting residents. They chased after him but the young airbender gave them the slip on a monorail cart, sending them to the Lower Ring of the city. The brothers later discovered their wallets had been stolen and could not pay for the fare back, forcing them to spend the night on the streets.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Grand Secretariat",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Grand_Secretariat_of_Ba_Sing_Se",
            "page": "Grand_Secretariat_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Gun",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Gun",
            "page": "Gun"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Hou-Ting",
            "page": "Hou-Ting"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "In Ba Sing Se"
      ],
      "text": "Upon arriving at Ba Sing Se, the party was greeted by Grand Secretariat Gun. While Korra was having her audience with Earth Queen Hou-Ting, everyone noticed that Kai had slipped away. Mako realized he had returned to his thieving ways, though he and Bolin agreed to search for him at Tenzin's request. They later spotted Kai using his airbending to con unsuspecting residents. They chased after him but the young airbender gave them the slip on a monorail cart, sending them to the Lower Ring of the city. The brothers later discovered their wallets had been stolen and could not pay for the fare back, forcing them to spend the night on the streets."
    },
    {
      "body": "The next morning, Bolin attempted to convince Mako to help him steal from a fruit stand. Mako refused, criticizing the rotting state of the fruit, which angered the stand's owner, ${link_0}. He interrogated the brothers and attempted to intimidate them, eventually tackling the two to the ground after concluding that they were planning to steal fruit. Tu's father, ${link_1} appeared shortly after and recognized Mako and Bolin as his brother's children, much to their surprise. The brothers were brought to meet their extended family, but sadly informed them of their parents' passing. After learning their father's reasons for leaving Ba Sing Se, their grandmother ${link_2} showed them the only letter their father sent to them, which included a photo of them as children along with their mother and father. Mako decided to give his scarf to his grandmother, believing that his parents would have wanted her to have it.",
      "links": [
        {
          "body": "Tu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tu",
            "page": "Tu"
          }
        },
        {
          "body": "Chow",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Chow",
            "page": "Chow"
          }
        },
        {
          "body": "Yin",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Yin",
            "page": "Yin"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "In Ba Sing Se"
      ],
      "text": "The next morning, Bolin attempted to convince Mako to help him steal from a fruit stand. Mako refused, criticizing the rotting state of the fruit, which angered the stand's owner, Tu. He interrogated the brothers and attempted to intimidate them, eventually tackling the two to the ground after concluding that they were planning to steal fruit. Tu's father, Chow appeared shortly after and recognized Mako and Bolin as his brother's children, much to their surprise. The brothers were brought to meet their extended family, but sadly informed them of their parents' passing. After learning their father's reasons for leaving Ba Sing Se, their grandmother Yin showed them the only letter their father sent to them, which included a photo of them as children along with their mother and father. Mako decided to give his scarf to his grandmother, believing that his parents would have wanted her to have it."
    },
    {
      "body": "When they revealed their mission to find airbenders, Chow revealed that the ${link_0} were capturing airbenders in the city and locking them away. Thus, Mako and Bolin decided to go and warn Korra.",
      "links": [
        {
          "body": "Dai Li",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "In Ba Sing Se"
      ],
      "text": "When they revealed their mission to find airbenders, Chow revealed that the Dai Li were capturing airbenders in the city and locking them away. Thus, Mako and Bolin decided to go and warn Korra."
    },
    {
      "body": "The next day, Tu got the brothers passports which allow them to return to the ${link_0}. Mako told Yin he wished they could stay, but they had to alert Korra of the news. Before leaving, he assured her that they would visit again someday before embracing her.",
      "links": [
        {
          "body": "Upper Ring",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se#Upper_Ring",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "In Ba Sing Se"
      ],
      "text": "The next day, Tu got the brothers passports which allow them to return to the Upper Ring. Mako told Yin he wished they could stay, but they had to alert Korra of the news. Before leaving, he assured her that they would visit again someday before embracing her."
    },
    {
      "body": "The brothers made their way back to Korra and Asami, where Mako clarified Bolin's breathless explanation of the past couple of days, specifically that they heard of how the Earth Queen was conscripting airbenders. At that moment, the monarch arrived, having Gun tell them about reports of airbenders in the Yung province. Hou-Ting insisted they could leave that evening, but Asami bought the team time by telling her that they had to repair their airship and thus needed to stay another night.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "In Ba Sing Se"
      ],
      "text": "The brothers made their way back to Korra and Asami, where Mako clarified Bolin's breathless explanation of the past couple of days, specifically that they heard of how the Earth Queen was conscripting airbenders. At that moment, the monarch arrived, having Gun tell them about reports of airbenders in the Yung province. Hou-Ting insisted they could leave that evening, but Asami bought the team time by telling her that they had to repair their airship and thus needed to stay another night."
    },
    {
      "body": "Back at the team's house, they discussed the possibilities as to where airbenders were being held. Mako, who had been reading Jinora's books, suggested ${link_0} because the Dai Li previously had an underground base there. Ultimately, however, they found out that the hold was underneath the ${link_1}, and discussed a plan to free them. In the process, Lin suddenly arrived, informing the group that Korra was in danger due to the escape of four dangerous criminals who had tried to kidnap her previously. Mako asked why these criminals were after her, but Lin told him that despite thirteen years of interrogation, they never revealed their motive. Ultimately, Lin joined their mission to free the airbenders as Korra refused to budge from it.",
      "links": [
        {
          "body": "Lake Laogai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lake_Laogai",
            "page": "Lake_Laogai"
          }
        },
        {
          "body": "Earth Queen's Temple",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Queen%27s_Temple",
            "page": "Earth_Queen%27s_Temple"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "In Ba Sing Se"
      ],
      "text": "Back at the team's house, they discussed the possibilities as to where airbenders were being held. Mako, who had been reading Jinora's books, suggested Lake Laogai because the Dai Li previously had an underground base there. Ultimately, however, they found out that the hold was underneath the Earth Queen's Temple, and discussed a plan to free them. In the process, Lin suddenly arrived, informing the group that Korra was in danger due to the escape of four dangerous criminals who had tried to kidnap her previously. Mako asked why these criminals were after her, but Lin told him that despite thirteen years of interrogation, they never revealed their motive. Ultimately, Lin joined their mission to free the airbenders as Korra refused to budge from it."
    },
    {
      "body": "That night, the group sneaked around the queen's temple, easily overwhelming two ${link_0} on duty. Upon reaching the base, they split up, with Mako, Bolin, and Jinora searching for Kai. Jinora led the brothers to his cell and kissed Kai on the cheek, which caused Bolin to say that Tenzin would not be happy about it; Mako insisted he not tell. Kai apologized to the two for stealing their wallets, running away, and getting them stuck on the train, though the firebender was still irked because he had a lot of money in his. In the middle of their escape, they were confronted by three Dai Li agents, including the ${link_1}. A battle ensued; the brothers were able to dodge the initial wave of ${link_2} and Mako used arcs of fire to try and beat them back. One of shots was blocked by the sergeant, who was briefly able to seize Jinora before he was promptly defeated by Kai. The four ran out of the hold while attempting to dodge further attacks. Korra directed Oogi toward them, and Bolin launched the group up on to the bison's saddle.",
      "links": [
        {
          "body": "Royal Earthbender Guards",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Royal_Earthbender_Guards",
            "page": "Royal_Earthbender_Guards"
          }
        },
        {
          "body": "sergeant",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Dai_Li_sergeant",
            "page": "Dai_Li_sergeant"
          }
        },
        {
          "body": "rock gloves",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Rock_gloves",
            "page": "Rock_gloves"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "In Ba Sing Se"
      ],
      "text": "That night, the group sneaked around the queen's temple, easily overwhelming two Royal Earthbender Guards on duty. Upon reaching the base, they split up, with Mako, Bolin, and Jinora searching for Kai. Jinora led the brothers to his cell and kissed Kai on the cheek, which caused Bolin to say that Tenzin would not be happy about it; Mako insisted he not tell. Kai apologized to the two for stealing their wallets, running away, and getting them stuck on the train, though the firebender was still irked because he had a lot of money in his. In the middle of their escape, they were confronted by three Dai Li agents, including the sergeant. A battle ensued; the brothers were able to dodge the initial wave of rock gloves and Mako used arcs of fire to try and beat them back. One of shots was blocked by the sergeant, who was briefly able to seize Jinora before he was promptly defeated by Kai. The four ran out of the hold while attempting to dodge further attacks. Korra directed Oogi toward them, and Bolin launched the group up on to the bison's saddle."
    },
    {
      "body": "With the entire group and the airbenders in tow, they settled the next morning in the city's outskirts. Tenzin and Jinora took the airbenders to the ${link_0} while Mako joined the rest of the team, including Lin, on her airship to continue their search for more airbenders.",
      "links": [
        {
          "body": "Northern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "In Ba Sing Se"
      ],
      "text": "With the entire group and the airbenders in tow, they settled the next morning in the city's outskirts. Tenzin and Jinora took the airbenders to the Northern Air Temple while Mako joined the rest of the team, including Lin, on her airship to continue their search for more airbenders."
    },
    {
      "body": "While they were on a pit stop, Mako and Asami got word over the radio that a new airbender had been found in the all-metal city of ${link_0}. They ventured into the city sans Lin, being greeted by its emissary, ${link_1}. While venturing through Zaofu by train, Mako casually watched its sights pass by, though grew more in awe at the statue honoring ${link_2}, and listened as Aiwei told them what happened to her. The team was soon introduced to the city's matriarch, ${link_3}, who knew who everyone was, prompting Mako to remark that she had \"done her research\". At that point, Aiwei informed Suyin that there was one other person who had come with the team, having detected Korra's lie with his ${link_4}. Korra acknowledged that Lin was with them, and they were all shocked to learn that Suyin and Lin were related. They ventured back to the airship where Mako watched as their troublesome relationship was explained.",
      "links": [
        {
          "body": "Zaofu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zaofu",
            "page": "Zaofu"
          }
        },
        {
          "body": "Aiwei",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Aiwei",
            "page": "Aiwei"
          }
        },
        {
          "body": "Toph Beifong",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Suyin Beifong",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "seismic sense",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Seismic_sense",
            "page": "Seismic_sense"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "In Zaofu"
      ],
      "text": "While they were on a pit stop, Mako and Asami got word over the radio that a new airbender had been found in the all-metal city of Zaofu. They ventured into the city sans Lin, being greeted by its emissary, Aiwei. While venturing through Zaofu by train, Mako casually watched its sights pass by, though grew more in awe at the statue honoring Toph Beifong, and listened as Aiwei told them what happened to her. The team was soon introduced to the city's matriarch, Suyin Beifong, who knew who everyone was, prompting Mako to remark that she had \"done her research\". At that point, Aiwei informed Suyin that there was one other person who had come with the team, having detected Korra's lie with his seismic sense. Korra acknowledged that Lin was with them, and they were all shocked to learn that Suyin and Lin were related. They ventured back to the airship where Mako watched as their troublesome relationship was explained."
    },
    {
      "body": "Mako ventured with the group to Suyin's home, where she introduced them to her children. Upon meeting ${link_0}, the firebender gazed curiously at his artwork and smirked at his explanations as to what it symbolized. After meeting the airbender, ${link_1}, Suyin informed them that their accommodations were ready and an appetizing dinner would be awaiting them. The dinner was relatively peaceful until Lin and Suyin began bickering. Varrick soon entered the dining hall, slightly irking Mako. When the industrialist pointed out that he was not convicted of plotting to kidnap the president, Mako reminded him it was because he escaped prison.",
      "links": [
        {
          "body": "Huan",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Huan",
            "page": "Huan"
          }
        },
        {
          "body": "Opal",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Opal",
            "page": "Opal"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "In Zaofu"
      ],
      "text": "Mako ventured with the group to Suyin's home, where she introduced them to her children. Upon meeting Huan, the firebender gazed curiously at his artwork and smirked at his explanations as to what it symbolized. After meeting the airbender, Opal, Suyin informed them that their accommodations were ready and an appetizing dinner would be awaiting them. The dinner was relatively peaceful until Lin and Suyin began bickering. Varrick soon entered the dining hall, slightly irking Mako. When the industrialist pointed out that he was not convicted of plotting to kidnap the president, Mako reminded him it was because he escaped prison."
    },
    {
      "body": "After dinner, Mako and Bolin made their way to a bathroom, where the former told his younger sibling that he had noticed him and Opal hitting it off at dinner, believing she was in to Bolin. In response to Bolin saying that she was not his type, Mako joked that his brother's type was \"dumb mover star\" or \"psycho ice princess\". Bolin soon realized that Opal may be his type after all, and thanked Mako for helping him realize it.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "In Zaofu"
      ],
      "text": "After dinner, Mako and Bolin made their way to a bathroom, where the former told his younger sibling that he had noticed him and Opal hitting it off at dinner, believing she was in to Bolin. In response to Bolin saying that she was not his type, Mako joked that his brother's type was \"dumb mover star\" or \"psycho ice princess\". Bolin soon realized that Opal may be his type after all, and thanked Mako for helping him realize it."
    },
    {
      "body": "Mako ate breakfast alongside Korra, Bolin, and Asami. Following Lin's confrontation with Suyin, he volunteered to check on Lin after she slept for sixteen hours. Mako accompanied Korra to contact Tenzin at the Northern Air Temple, but did not speak to the airbending master.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "In Zaofu"
      ],
      "text": "Mako ate breakfast alongside Korra, Bolin, and Asami. Following Lin's confrontation with Suyin, he volunteered to check on Lin after she slept for sixteen hours. Mako accompanied Korra to contact Tenzin at the Northern Air Temple, but did not speak to the airbending master."
    },
    {
      "body": "Sometime later, Mako and Asami came out just as Bolin struck ${link_0} in eye with a pebble, prompting Mako to complement him but also ask if he was supposed to be metalbending. He also watched Korra defeat Wing in a spar. That evening, at Opal's farewell dinner, Mako was annoyed about sitting on the opposite end of the table, unable to hear what Varrick was saying to Korra and Asami. Seeing Aiwei next to him, Mako tried to say it was not because of the emissary, but was caught in a lie. He soon raised his glass in a toast to Opal and watched as she left Zaofu for the Northern Air Temple.",
      "links": [
        {
          "body": "Wei",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wei_and_Wing",
            "page": "Wei_and_Wing"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Korra's attempted kidnapping and investigation"
      ],
      "text": "Sometime later, Mako and Asami came out just as Bolin struck Wei in eye with a pebble, prompting Mako to complement him but also ask if he was supposed to be metalbending. He also watched Korra defeat Wing in a spar. That evening, at Opal's farewell dinner, Mako was annoyed about sitting on the opposite end of the table, unable to hear what Varrick was saying to Korra and Asami. Seeing Aiwei next to him, Mako tried to say it was not because of the emissary, but was caught in a lie. He soon raised his glass in a toast to Opal and watched as she left Zaofu for the Northern Air Temple."
    },
    {
      "body": "That night, Mako was awoken when Bolin saw the Red Lotus ${link_0}. The brothers rushed out of their room. Mako's attack was stopped by ${link_1}, but he was able to block a shot of water from ${link_2}. The duo was forced to hide behind a pillar due to the strength of their opponents' attacks, and he warned the guards that Korra had been taken. They were both thrown back by an angled combustion blast from P'Li and attended to by an emerging Asami, who assured them they would not get far because of the guards, the Beifong siblings, Wing, and Wei. They watched as ${link_3} lavabent the ground, leaving a moat of the hot liquid between the groups. Mako, Bolin, Asami, and Lin hid behind a small metal barricade, occasionally emerging for quick attacks. P'Li almost hit them with another angled combustion shot, but they were saved by Suyin, Wing, and Wei. In order to rescue Korra, the half-sisters decided to go on top of the dome, but needed someone to disable P'Li's third eye, to which Mako suggested Bolin could. He stayed on the radio with Wing and, upon finding out they were in position, he told Bolin to strike. The two tried to attack, the firebender urging his brother to get a shot. Wing asked if they could go; Mako tried to tell him no, but was misunderstood as giving clearance despite his plea. Seeing the Beifongs make their move, he quickly urged Bolin to make a shot as he firebent at P'Li. Upon Bolin's success, Mako exulted and complemented him on a nice job. The four crouched as Zaheer airbent a cloud of dust. When they emerged, they saw their foes had fled.",
      "links": [
        {
          "body": "attempt to kidnap Korra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Attempted_kidnapping_of_Avatar_Korra",
            "page": "Attempted_kidnapping_of_Avatar_Korra"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/P%27Li",
            "page": "P%27Li"
          }
        },
        {
          "body": "Ming-Hua",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ming-Hua",
            "page": "Ming-Hua"
          }
        },
        {
          "body": "Ghazan",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ghazan",
            "page": "Ghazan"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Korra's attempted kidnapping and investigation"
      ],
      "text": "That night, Mako was awoken when Bolin saw the Red Lotus attempt to kidnap Korra. The brothers rushed out of their room. Mako's attack was stopped by P'Li, but he was able to block a shot of water from Ming-Hua. The duo was forced to hide behind a pillar due to the strength of their opponents' attacks, and he warned the guards that Korra had been taken. They were both thrown back by an angled combustion blast from P'Li and attended to by an emerging Asami, who assured them they would not get far because of the guards, the Beifong siblings, Wing, and Wei. They watched as Ghazan lavabent the ground, leaving a moat of the hot liquid between the groups. Mako, Bolin, Asami, and Lin hid behind a small metal barricade, occasionally emerging for quick attacks. P'Li almost hit them with another angled combustion shot, but they were saved by Suyin, Wing, and Wei. In order to rescue Korra, the half-sisters decided to go on top of the dome, but needed someone to disable P'Li's third eye, to which Mako suggested Bolin could. He stayed on the radio with Wing and, upon finding out they were in position, he told Bolin to strike. The two tried to attack, the firebender urging his brother to get a shot. Wing asked if they could go; Mako tried to tell him no, but was misunderstood as giving clearance despite his plea. Seeing the Beifongs make their move, he quickly urged Bolin to make a shot as he firebent at P'Li. Upon Bolin's success, Mako exulted and complemented him on a nice job. The four crouched as Zaheer airbent a cloud of dust. When they emerged, they saw their foes had fled."
    },
    {
      "body": "The group regathered at Suyin's office, where Korra was treated for her paralysis from ${link_0}. The next day, upon Korra's belief that one of the guards had to have played a role, Mako watched as they were all questioned by Aiwei. He also watched awkwardly as Varrick described what he was doing when questioned. When a guard, ${link_1}, was discovered to be lying about his innocence, Mako glared at him and went with his friends and Aiwei to the guard's house. There, he found a small note from Zaheer to Hong Li, noting they were ready to rendezvous. With that and a book filled with guard schedules and movements, Mako wanted to confront him at that point, but when Aiwei suggested they wait things out, he looked suspiciously at the emissary.",
      "links": [
        {
          "body": "shirshu-spit darts",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Shirshu-spit_darts",
            "page": "Shirshu-spit_darts"
          }
        },
        {
          "body": "Hong Li",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hong_Li",
            "page": "Hong_Li"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Korra's attempted kidnapping and investigation"
      ],
      "text": "The group regathered at Suyin's office, where Korra was treated for her paralysis from shirshu-spit darts. The next day, upon Korra's belief that one of the guards had to have played a role, Mako watched as they were all questioned by Aiwei. He also watched awkwardly as Varrick described what he was doing when questioned. When a guard, Hong Li, was discovered to be lying about his innocence, Mako glared at him and went with his friends and Aiwei to the guard's house. There, he found a small note from Zaheer to Hong Li, noting they were ready to rendezvous. With that and a book filled with guard schedules and movements, Mako wanted to confront him at that point, but when Aiwei suggested they wait things out, he looked suspiciously at the emissary."
    },
    {
      "body": "Back at the battle site, Mako wondered why they were not talking to Hong Li, knowing their enemies were getting further away. He was doubtful about the guard's guilt because he was eighteen, lived in Zaofu his whole life, and the Red Lotus was in prison for over thirteen years. At that point, the team was suddenly encountered by Varrick, who suggested the evidence was \"too overwhelming\". Mako and the others looked with disgust as Zhu Li rubbed his feet with pumice stones. The firebender went on to ask what the industrialist meant with his remark. After being answered that one trying to construct a conspiracy would frame someone and plant the evidence on them, Mako remembered it was the same thing done to him by Varrick. Though annoyed, he knew Varrick was right, suggesting Hong Li was the fall guy for the only one capable of keeping a secret - Aiwei.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "Realizing the truth"
      ],
      "text": "Back at the battle site, Mako wondered why they were not talking to Hong Li, knowing their enemies were getting further away. He was doubtful about the guard's guilt because he was eighteen, lived in Zaofu his whole life, and the Red Lotus was in prison for over thirteen years. At that point, the team was suddenly encountered by Varrick, who suggested the evidence was \"too overwhelming\". Mako and the others looked with disgust as Zhu Li rubbed his feet with pumice stones. The firebender went on to ask what the industrialist meant with his remark. After being answered that one trying to construct a conspiracy would frame someone and plant the evidence on them, Mako remembered it was the same thing done to him by Varrick. Though annoyed, he knew Varrick was right, suggesting Hong Li was the fall guy for the only one capable of keeping a secret - Aiwei."
    },
    {
      "body": "The group ventured to Aiwei's home, where Mako curiously eyed Bolin after he suggested Aiwei was invisible. He knew they needed to find evidence of a link between the emissary and Zaheer or Suyin would not believe them. Inside, when he caught Bolin pulling a jar off a bookshelf, he warned his brother they needed to make it look like they were not there, and placed it back when Bolin could not remember where it was. Next to the bookshelf, Mako found some scuff marks, indicating it slid open. He opened it to reveal a secret passage, which he suspected as the way Zaheer got in to the estate. Asami alerted them that Aiwei was coming back, but the team was unable to leave before they were caught. He told them to sit and talk over tea. As Aiwei asserted Hong Li's guilt, Mako wondered how, at his age, he could have gotten mixed up with Zaheer's group. Once Aiwei realized the group was suspecting him and found they had discovered the passage, Mako tried to attack him before he could escape, but he was able to get behind a metal wall. Mako urged Korra to bend it quickly, but was told to back off. Once she bent a hole in it, the group made their way down the passage, but only found a bomb which promptly detonated. The firebender shielded Asami as Korra protected them all with an air sphere. He soon realized Aiwei had fled. After Lin and Suyin found them, he explained that Aiwei rigged the explosion to eliminate any evidence of his presence.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "Realizing the truth"
      ],
      "text": "The group ventured to Aiwei's home, where Mako curiously eyed Bolin after he suggested Aiwei was invisible. He knew they needed to find evidence of a link between the emissary and Zaheer or Suyin would not believe them. Inside, when he caught Bolin pulling a jar off a bookshelf, he warned his brother they needed to make it look like they were not there, and placed it back when Bolin could not remember where it was. Next to the bookshelf, Mako found some scuff marks, indicating it slid open. He opened it to reveal a secret passage, which he suspected as the way Zaheer got in to the estate. Asami alerted them that Aiwei was coming back, but the team was unable to leave before they were caught. He told them to sit and talk over tea. As Aiwei asserted Hong Li's guilt, Mako wondered how, at his age, he could have gotten mixed up with Zaheer's group. Once Aiwei realized the group was suspecting him and found they had discovered the passage, Mako tried to attack him before he could escape, but he was able to get behind a metal wall. Mako urged Korra to bend it quickly, but was told to back off. Once she bent a hole in it, the group made their way down the passage, but only found a bomb which promptly detonated. The firebender shielded Asami as Korra protected them all with an air sphere. He soon realized Aiwei had fled. After Lin and Suyin found them, he explained that Aiwei rigged the explosion to eliminate any evidence of his presence."
    },
    {
      "body": "Regathering in Suyin's office, Mako concluded that, when ${link_0} told them Aiwei had escaped, the emissary had such a plan all along. He also realized the group was more powerful and dangerous than they believed. He stood by as Korra and Lin argued over the potential search for the group, and was led to believe they would be leaving Zaofu when Suyin agreed with her half-sibling about Korra's safety. Later, however, they were again approached by her, who informed the team she had a fully-loaded jeep for them to use in a search for Aiwei. She explained that her agreement was merely to let Lin hear what she wanted and to buy them time to leave. Mako joined Bolin and Asami in the vehicle while Korra rode on Naga, beginning their search.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Realizing the truth"
      ],
      "text": "Regathering in Suyin's office, Mako concluded that, when Kuvira told them Aiwei had escaped, the emissary had such a plan all along. He also realized the group was more powerful and dangerous than they believed. He stood by as Korra and Lin argued over the potential search for the group, and was led to believe they would be leaving Zaofu when Suyin agreed with her half-sibling about Korra's safety. Later, however, they were again approached by her, who informed the team she had a fully-loaded jeep for them to use in a search for Aiwei. She explained that her agreement was merely to let Lin hear what she wanted and to buy them time to leave. Mako joined Bolin and Asami in the vehicle while Korra rode on Naga, beginning their search."
    },
    {
      "body": "With Naga's tracking abilities, the team followed Aiwei's trail to just outside the ${link_0}. Mako suggested they ask around to see if anyone had seen him. When they entered a tavern, upon Bolin seeing a poster of him that he thought to be one promoting his mover role, Mako realized it and other images of them were actually wanted posters issued by the Earth Queen because of their freeing of her airbenders. After seeing the patrons threaten them, the group left the tavern.",
      "links": [
        {
          "body": "Misty Palms Oasis",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Misty_Palms_Oasis",
            "page": "Misty_Palms_Oasis"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "In the Misty Palms Oasis"
      ],
      "text": "With Naga's tracking abilities, the team followed Aiwei's trail to just outside the Misty Palms Oasis. Mako suggested they ask around to see if anyone had seen him. When they entered a tavern, upon Bolin seeing a poster of him that he thought to be one promoting his mover role, Mako realized it and other images of them were actually wanted posters issued by the Earth Queen because of their freeing of her airbenders. After seeing the patrons threaten them, the group left the tavern."
    },
    {
      "body": "When they discovered Aiwei's jeep on the outskirts of the oasis, Mako decided he and Bolin would investigate the oasis for his presence, while telling Korra and Asami to wait in case Aiwei came back and also to protect their cover. At Bolin's suggestion, the brothers covered their upper bodies with yellow ponchos and donned glasses. The firebender stopped his brother as he was making up a fake backstory while refusing one himself because he was a cop and thus did not have one. In the oasis, the brothers first talked to a tavern owner, telling him of Aiwei's physical details. They were told of a customer who looked like him and dismissed his claims of having the best drink as a lie, to which Mako realized it was indeed Aiwei, but learned the owner had no idea where he went. After looking in another tavern, Mako learned from Bolin that ${link_0} were staring them down, potentially bounty hunters. Mako believed they were found out and the brothers ran, ducking into an alley and hiding behind a couple of crates; the firebender decided they should go back before they were recognized. At that moment, Bolin pulled him down into hiding again as he had spotted Aiwei. Instructing his younger sibling they play it cool, they followed him to room 102 of the ${link_1}. Mako returned to Korra and Asami to pass the finding along and suggested to the former that they stake out his room instead of risking blowing their cover with a direct confrontation.",
      "links": [
        {
          "body": "two figures",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Macao_and_Lily",
            "page": "Macao_and_Lily"
          }
        },
        {
          "body": "Misty Palms Inn",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Misty_Palms_Inn",
            "page": "Misty_Palms_Inn"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "In the Misty Palms Oasis"
      ],
      "text": "When they discovered Aiwei's jeep on the outskirts of the oasis, Mako decided he and Bolin would investigate the oasis for his presence, while telling Korra and Asami to wait in case Aiwei came back and also to protect their cover. At Bolin's suggestion, the brothers covered their upper bodies with yellow ponchos and donned glasses. The firebender stopped his brother as he was making up a fake backstory while refusing one himself because he was a cop and thus did not have one. In the oasis, the brothers first talked to a tavern owner, telling him of Aiwei's physical details. They were told of a customer who looked like him and dismissed his claims of having the best drink as a lie, to which Mako realized it was indeed Aiwei, but learned the owner had no idea where he went. After looking in another tavern, Mako learned from Bolin that two figures were staring them down, potentially bounty hunters. Mako believed they were found out and the brothers ran, ducking into an alley and hiding behind a couple of crates; the firebender decided they should go back before they were recognized. At that moment, Bolin pulled him down into hiding again as he had spotted Aiwei. Instructing his younger sibling they play it cool, they followed him to room 102 of the Misty Palms Inn. Mako returned to Korra and Asami to pass the finding along and suggested to the former that they stake out his room instead of risking blowing their cover with a direct confrontation."
    },
    {
      "body": "Mako requested a room for the team across from Aiwei's, but the ${link_0} denied them because teenagers were responsible for the destruction of another room the last time she had given them a place to stay. They were soon found by the two individuals who had chased the brothers earlier and took an attacking stance, but it turned out they were actually fans of Bolin's mover and sought his autograph. The innkeeper, learning about this fact, told the group they could have any room they wanted, but Mako remained insistent on the one across from Aiwei, despite warnings it was small for their entire party.",
      "links": [
        {
          "body": "innkeeper",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Innkeeper",
            "page": "Innkeeper"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "In the Misty Palms Oasis"
      ],
      "text": "Mako requested a room for the team across from Aiwei's, but the innkeeper denied them because teenagers were responsible for the destruction of another room the last time she had given them a place to stay. They were soon found by the two individuals who had chased the brothers earlier and took an attacking stance, but it turned out they were actually fans of Bolin's mover and sought his autograph. The innkeeper, learning about this fact, told the group they could have any room they wanted, but Mako remained insistent on the one across from Aiwei, despite warnings it was small for their entire party."
    },
    {
      "body": "The four, along with Naga and Pabu, wound up cramped together in the small accommodation. Mako and Korra looked out the window, keeping their eye out for any potential movements from Aiwei. He turned down Bolin's request for a ${link_0} game in order to keep watching. Mako asked what they would do upon finding Zaheer, warning Korra that trying to get them to talk would likely not work out even with threats because they had not talked for thirteen years. He instead suggested spying because if the two believed they were speaking freely, they would say what the team wanted to hear. For hours, he watched Aiwei's room with Korra for movements, taking down any such action in his log book. Having not seen any movements, Asami suggested Aiwei slipped away, but Mako rebutted her, indicating he had seen him move fifteen minutes prior. Korra decided to go over to the room, Mako fruitlessly warning her that their element of surprise would be blown. They found the emissary meditating, prompting Korra to realize he was in the Spirit World. Mako told her they would keep an eye on them in case Aiwei woke.",
      "links": [
        {
          "body": "Pai Sho",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pai_Sho",
            "page": "Pai_Sho"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "In the Misty Palms Oasis"
      ],
      "text": "The four, along with Naga and Pabu, wound up cramped together in the small accommodation. Mako and Korra looked out the window, keeping their eye out for any potential movements from Aiwei. He turned down Bolin's request for a Pai Sho game in order to keep watching. Mako asked what they would do upon finding Zaheer, warning Korra that trying to get them to talk would likely not work out even with threats because they had not talked for thirteen years. He instead suggested spying because if the two believed they were speaking freely, they would say what the team wanted to hear. For hours, he watched Aiwei's room with Korra for movements, taking down any such action in his log book. Having not seen any movements, Asami suggested Aiwei slipped away, but Mako rebutted her, indicating he had seen him move fifteen minutes prior. Korra decided to go over to the room, Mako fruitlessly warning her that their element of surprise would be blown. They found the emissary meditating, prompting Korra to realize he was in the Spirit World. Mako told her they would keep an eye on them in case Aiwei woke."
    },
    {
      "body": "After nightfall, Mako spotted Ming-Hua and Ghazan approaching the inn. He told Asami to get Korra to safety while he and Bolin held the criminals off. He blocked Ming-Hua's attempt to reach the Avatar with a fire blast and took her on directly. The firebender struggled to get an offensive, mostly having to dodge Ming-Hua's attacks and running from her. He was briefly able to slice one of her water tendrils but had his left arm frozen in place by the other and was promptly thrown into a door, leaving him unable to continue fighting. The brothers were captured and taken back to the Red Lotus' camp, where they were to be loaded onto their truck and taken with them to Ba Sing Se.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "In the Misty Palms Oasis"
      ],
      "text": "After nightfall, Mako spotted Ming-Hua and Ghazan approaching the inn. He told Asami to get Korra to safety while he and Bolin held the criminals off. He blocked Ming-Hua's attempt to reach the Avatar with a fire blast and took her on directly. The firebender struggled to get an offensive, mostly having to dodge Ming-Hua's attacks and running from her. He was briefly able to slice one of her water tendrils but had his left arm frozen in place by the other and was promptly thrown into a door, leaving him unable to continue fighting. The brothers were captured and taken back to the Red Lotus' camp, where they were to be loaded onto their truck and taken with them to Ba Sing Se."
    },
    {
      "body": "Aboard the truck with the Red Lotus members, Mako told Ghazan and Ming-Hua they would not be able to use them for leverage against Korra and asked why they did not kill her, only to be told the world would soon change for the better. Hearing his brother have a casual conversation with their captors, Mako told him to stop making friends with them. As they entered Ba Sing Se, the brothers were gagged by the criminals before they were delivered to the queen and sent to the palace dungeon by the Dai Li.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "Imprisonment"
      ],
      "text": "Aboard the truck with the Red Lotus members, Mako told Ghazan and Ming-Hua they would not be able to use them for leverage against Korra and asked why they did not kill her, only to be told the world would soon change for the better. Hearing his brother have a casual conversation with their captors, Mako told him to stop making friends with them. As they entered Ba Sing Se, the brothers were gagged by the criminals before they were delivered to the queen and sent to the palace dungeon by the Dai Li."
    },
    {
      "body": "In their prison cell, Mako warned Bolin they needed to get out as soon as possible, attracting a prisoner's attention, who asked the brothers to take him with them. Mako believed his brother could metalbend, saying deep-down, he always had the ability to do so, simply needing the right motivation and that was the time. The firebender led the prisoners in an encouraging chant, but was left to watch as Bolin could not perform the feat.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "Imprisonment"
      ],
      "text": "In their prison cell, Mako warned Bolin they needed to get out as soon as possible, attracting a prisoner's attention, who asked the brothers to take him with them. Mako believed his brother could metalbend, saying deep-down, he always had the ability to do so, simply needing the right motivation and that was the time. The firebender led the prisoners in an encouraging chant, but was left to watch as Bolin could not perform the feat."
    },
    {
      "body": "The brothers listened as Zaheer announced over the communications system that he and his associates had taken out the Earth Queen. With the prisoners riled up, Mako used a small stream of fire to try to blowtorch the cell, but with little success. Knowing Korra was Zaheer's next target, he urged Bolin to try metalbending again, as it was \"really\" his time. When all the cell doors opened except for theirs, Mako told his excited brother that what happened was not metalbending. Zaheer approached them, promoting the firebender to attack, but they were thrown back by an air blast. Zaheer informed them they would be freed, but only after giving them a message for Korra.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "Imprisonment"
      ],
      "text": "The brothers listened as Zaheer announced over the communications system that he and his associates had taken out the Earth Queen. With the prisoners riled up, Mako used a small stream of fire to try to blowtorch the cell, but with little success. Knowing Korra was Zaheer's next target, he urged Bolin to try metalbending again, as it was \"really\" his time. When all the cell doors opened except for theirs, Mako told his excited brother that what happened was not metalbending. Zaheer approached them, promoting the firebender to attack, but they were thrown back by an air blast. Zaheer informed them they would be freed, but only after giving them a message for Korra."
    },
    {
      "body": "Afterward, Mako and Bolin left the prison to find the city in chaos and looting rampant. He told Bolin the unrest was not their battle; they needed to get Zaheer's message to Korra. Knowing the difficult journey ahead, Mako suggested they find an ${link_0}. The brothers made their way to a ship still docked outside the palace, only to find looters scouring it for parts. He tried to tell them he was with the Republic City police and needed to find the Avatar, but the looters ignored him. After Bolin got the criminals out by giving them a location for the queen's gold, Mako discovered vital parts had already been taken, such as the ship's radio. When Bolin took the controls, Mako asked if he knew how to fly it. After initial difficulty, the two were able to take flight.",
      "links": [
        {
          "body": "airship",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se_airship",
            "page": "Ba_Sing_Se_airship"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Escaping Ba Sing Se and attempt to warn Tenzin"
      ],
      "text": "Afterward, Mako and Bolin left the prison to find the city in chaos and looting rampant. He told Bolin the unrest was not their battle; they needed to get Zaheer's message to Korra. Knowing the difficult journey ahead, Mako suggested they find an airship. The brothers made their way to a ship still docked outside the palace, only to find looters scouring it for parts. He tried to tell them he was with the Republic City police and needed to find the Avatar, but the looters ignored him. After Bolin got the criminals out by giving them a location for the queen's gold, Mako discovered vital parts had already been taken, such as the ship's radio. When Bolin took the controls, Mako asked if he knew how to fly it. After initial difficulty, the two were able to take flight."
    },
    {
      "body": "Knowing their family was in danger as the city burned, Mako took over the controls and lowered the airship down to the roof of their home and waited while Bolin got their relatives out. He watched as they made their way on board and as Bolin piloted the ship out of Ba Sing Se. Questioned by Yin if their airship would be their new home, Mako told her they did not know where they would go, but they needed to find Korra first. He was subsequently asked by Chow if something happened to Korra, to which the firebender told his cousin about her airship crash.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "Escaping Ba Sing Se and attempt to warn Tenzin"
      ],
      "text": "Knowing their family was in danger as the city burned, Mako took over the controls and lowered the airship down to the roof of their home and waited while Bolin got their relatives out. He watched as they made their way on board and as Bolin piloted the ship out of Ba Sing Se. Questioned by Yin if their airship would be their new home, Mako told her they did not know where they would go, but they needed to find Korra first. He was subsequently asked by Chow if something happened to Korra, to which the firebender told his cousin about her airship crash."
    },
    {
      "body": "After several hours, Mako was alerted by Tu that he had found pieces of Korra's airship. Mako recognized the fragments as a Ba Sing Se airship, though wondered where the rest of it was. Tu pointed them to a trail, which they tracked to the Misty Palms Oasis. Once there, Mako was found, tackled, and licked by Naga, much to his annoyance. At that moment, Bolin spotted Korra and Asami; Mako tightly embraced the former. He nervously apologized for the excitement, saying he was just happy to see her. Mako joked to a relived Lin to not get too mushy with her and greeted Tonraq with a bow. Upon seeing Lord ${link_0}, he bowed to him as well, honored to meet the former ${link_1}. He subsequently saw Yin mistake Asami for the Avatar and properly introduced her to Korra. He was asked by his grandmother why he was not dating someone lovely like them, causing him to feel awkward. At Asami's query, Mako explained his and Bolin's capture and presence for the Earth Queen's removal from power. After telling Asami what had happened to them and Bolin explained the terms surrounding their release, Mako told Korra that Zaheer was on his way to the Northern Air Temple to take out the Air Nation unless she turned herself over. He rebuffed Tonraq's suggestion that Zaheer might be bluffing as he had already taken out the Earth Queen. He knew they would have to radio Tenzin, but noted the airship had no working radio. Without any suitable communication nearby, the group returned to Zaofu to reach a suitable signal.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Escaping Ba Sing Se and attempt to warn Tenzin"
      ],
      "text": "After several hours, Mako was alerted by Tu that he had found pieces of Korra's airship. Mako recognized the fragments as a Ba Sing Se airship, though wondered where the rest of it was. Tu pointed them to a trail, which they tracked to the Misty Palms Oasis. Once there, Mako was found, tackled, and licked by Naga, much to his annoyance. At that moment, Bolin spotted Korra and Asami; Mako tightly embraced the former. He nervously apologized for the excitement, saying he was just happy to see her. Mako joked to a relived Lin to not get too mushy with her and greeted Tonraq with a bow. Upon seeing Lord Zuko, he bowed to him as well, honored to meet the former Fire Lord. He subsequently saw Yin mistake Asami for the Avatar and properly introduced her to Korra. He was asked by his grandmother why he was not dating someone lovely like them, causing him to feel awkward. At Asami's query, Mako explained his and Bolin's capture and presence for the Earth Queen's removal from power. After telling Asami what had happened to them and Bolin explained the terms surrounding their release, Mako told Korra that Zaheer was on his way to the Northern Air Temple to take out the Air Nation unless she turned herself over. He rebuffed Tonraq's suggestion that Zaheer might be bluffing as he had already taken out the Earth Queen. He knew they would have to radio Tenzin, but noted the airship had no working radio. Without any suitable communication nearby, the group returned to Zaofu to reach a suitable signal."
    },
    {
      "body": "At Zaofu, the group learned Suyin and her guards had found a signal at the Northern Air Temple, but were not getting any answers. Though Suyin could ready airships for a journey to the temple, Mako realized they could not get up there before Zaheer. When Korra went to meditate and attempt to find Zaheer in the Spirit World, Mako and Bolin stayed behind to assist communication efforts. After getting through, Mako rushed to tell Korra and Zuko before returning with them to the radio room.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "Escaping Ba Sing Se and attempt to warn Tenzin"
      ],
      "text": "At Zaofu, the group learned Suyin and her guards had found a signal at the Northern Air Temple, but were not getting any answers. Though Suyin could ready airships for a journey to the temple, Mako realized they could not get up there before Zaheer. When Korra went to meditate and attempt to find Zaheer in the Spirit World, Mako and Bolin stayed behind to assist communication efforts. After getting through, Mako rushed to tell Korra and Zuko before returning with them to the radio room."
    },
    {
      "body": "On board a Zaofu airship, Mako stood with his friends and allies as they discussed a plan to ambush to ambush the Red Lotus. He angrily dismissed Bolin's plan to use bird calls, but was left shocked when Korra suggested surrendering herself. While Korra was radioing Zaheer, Mako told his brother to stop pacing as he was already tense. After her discussion with Zaheer was complete, Mako and the others were informed by Korra of his new terms: she would go to ${link_0}'s Peak at noon on her own and the airbenders would be released upon her surrender. Suyin decided to set up a plan of attack with their numbers advantage, telling Mako to go with Bolin and Asami on the airship to the temple to retrieve the airbenders while the others would position themselves below the peak. Before separating, Mako was given a radio by Lin and told to message her upon seeing the airbenders; he also embraced Korra. As he, Bolin, and Asami approached the temple, he took note of the damage, remarking there must have been a significant battle.",
      "links": [
        {
          "body": "Laghima",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Laghima",
            "page": "Laghima"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Double-crossed and escape"
      ],
      "text": "On board a Zaofu airship, Mako stood with his friends and allies as they discussed a plan to ambush to ambush the Red Lotus. He angrily dismissed Bolin's plan to use bird calls, but was left shocked when Korra suggested surrendering herself. While Korra was radioing Zaheer, Mako told his brother to stop pacing as he was already tense. After her discussion with Zaheer was complete, Mako and the others were informed by Korra of his new terms: she would go to Laghima's Peak at noon on her own and the airbenders would be released upon her surrender. Suyin decided to set up a plan of attack with their numbers advantage, telling Mako to go with Bolin and Asami on the airship to the temple to retrieve the airbenders while the others would position themselves below the peak. Before separating, Mako was given a radio by Lin and told to message her upon seeing the airbenders; he also embraced Korra. As he, Bolin, and Asami approached the temple, he took note of the damage, remarking there must have been a significant battle."
    },
    {
      "body": "Upon arriving in a courtyard, Ghazan approached them, making Mako suspicious. Nonetheless, they followed Ghazan into the hold where Tenzin and the other airbenders appeared to be kept. Mako alerted Korra to their and the lavabender's presence before getting the go-ahead to retrieve the airbenders once the Avatar had surrendered. However, they soon realized that they had been double-crossed; what they believed to be the airbenders were just sacks full of water maintained by Ming-Hua. Mako blocked a prompt attack from her and radioed Korra about the trick, telling her not to turn herself over, while also telling Lin to get Korra out. He and Bolin tried to duel the criminals, but the fight was short-lived as Ghazan converted the floor between the duos to lava, trapping the brothers, Asami, and Tenzin. The airbending master pointed them to another way out, which they followed through Bolin's earthbending.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "Double-crossed and escape"
      ],
      "text": "Upon arriving in a courtyard, Ghazan approached them, making Mako suspicious. Nonetheless, they followed Ghazan into the hold where Tenzin and the other airbenders appeared to be kept. Mako alerted Korra to their and the lavabender's presence before getting the go-ahead to retrieve the airbenders once the Avatar had surrendered. However, they soon realized that they had been double-crossed; what they believed to be the airbenders were just sacks full of water maintained by Ming-Hua. Mako blocked a prompt attack from her and radioed Korra about the trick, telling her not to turn herself over, while also telling Lin to get Korra out. He and Bolin tried to duel the criminals, but the fight was short-lived as Ghazan converted the floor between the duos to lava, trapping the brothers, Asami, and Tenzin. The airbending master pointed them to another way out, which they followed through Bolin's earthbending."
    },
    {
      "body": "They made their way up to the meditation room and into a secret corridor with Mako lighting the way with a small ball of fire. The group attempted to outrun the lava pool Ghazan had made, but soon found themselves at the edge of the mountain with nowhere to go. Mako yelled for Bolin as he charged at the lava, but was left in surprise as his brother performed lavabending, stopping the flow of the dangerous liquid. Kai promptly approached them on his baby bison, ${link_0}, and guided them away from the crumbling temple.",
      "links": [
        {
          "body": "Lefty",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lefty",
            "page": "Lefty"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Double-crossed and escape"
      ],
      "text": "They made their way up to the meditation room and into a secret corridor with Mako lighting the way with a small ball of fire. The group attempted to outrun the lava pool Ghazan had made, but soon found themselves at the edge of the mountain with nowhere to go. Mako yelled for Bolin as he charged at the lava, but was left in surprise as his brother performed lavabending, stopping the flow of the dangerous liquid. Kai promptly approached them on his baby bison, Lefty, and guided them away from the crumbling temple."
    },
    {
      "body": "The group landed in a forest with the remainder of their allies. Mako told Lin about Bolin's lavabending, only to be surprised to learn Zaheer had gotten away with Korra and was capable of flight. When Kai suggested he knew where the airbenders and Korra were, Mako asked why he did not say anything. He also realized there were more Red Lotus members when Kai reported seeing several more guards escorting the airbenders into a system of ${link_0}. Oogi soon arrived to help provide them transportation to the location in question. Before the group embarked on their mission to save Korra, the firebender expressed his appreciation to Kai for saving them and apologized for giving him a hard time, though jokingly remarking he kind of deserved it when the airbender suggested he did. He boarded Oogi with the rest of the group and made their way toward the caves.",
      "links": [
        {
          "body": "caves",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomad_caves",
            "page": "Air_Nomad_caves"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Double-crossed and escape"
      ],
      "text": "The group landed in a forest with the remainder of their allies. Mako told Lin about Bolin's lavabending, only to be surprised to learn Zaheer had gotten away with Korra and was capable of flight. When Kai suggested he knew where the airbenders and Korra were, Mako asked why he did not say anything. He also realized there were more Red Lotus members when Kai reported seeing several more guards escorting the airbenders into a system of caves. Oogi soon arrived to help provide them transportation to the location in question. Before the group embarked on their mission to save Korra, the firebender expressed his appreciation to Kai for saving them and apologized for giving him a hard time, though jokingly remarking he kind of deserved it when the airbender suggested he did. He boarded Oogi with the rest of the group and made their way toward the caves."
    },
    {
      "body": "Kai led them to where he saw the airbenders go, Mako realizing Korra was likely there as well. The group, save for Tenzin, entered and quickly ambushed the ${link_0} before releasing the airbenders from the chains in which they were held. Mako and Bolin joined Tonraq to find Korra, being tipped off to her exact location by Jinora. After the Avatar, who was in the Avatar State due to the effects of a metallic ${link_1}, took off in pursuit of Zaheer, Mako told Tonraq to help her while he and Bolin dealt with Ming-Hua and Ghazan, respectively.",
      "links": [
        {
          "body": "Red Lotus sentries",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Red_Lotus_sentries",
            "page": "Red_Lotus_sentries"
          }
        },
        {
          "body": "poison",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mercury",
            "page": "Mercury"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Rescuing the airbenders"
      ],
      "text": "Kai led them to where he saw the airbenders go, Mako realizing Korra was likely there as well. The group, save for Tenzin, entered and quickly ambushed the Red Lotus sentries before releasing the airbenders from the chains in which they were held. Mako and Bolin joined Tonraq to find Korra, being tipped off to her exact location by Jinora. After the Avatar, who was in the Avatar State due to the effects of a metallic poison, took off in pursuit of Zaheer, Mako told Tonraq to help her while he and Bolin dealt with Ming-Hua and Ghazan, respectively."
    },
    {
      "body": "Mako got the waterbender on the run with fire blasts. The two made their way to a corner of the cave; the firebender believed he had the upper hand as he saw no sources of water nearby and his foe now lacked the element after her arms evaporated from Mako's attacks. However, she managed to jump into a fissure in the ground, forcing Mako to pursue her. As the firebender landed in a large underground lake, he generated some fire in order to spot his opponent. However, as he turned around, he discovered the waterbender posed to attack with eight water tendrils attached to herself. Mako had no choice but to flee as Ming-Hua pursued him, trying to stab him with her whips. Desperately, he squeezed himself between two stone pillars, away from direct contact with the water, and used lightning generation to electrify the lake, zapping Ming-Hua and ending the battle, much to his surprise.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "Rescuing the airbenders"
      ],
      "text": "Mako got the waterbender on the run with fire blasts. The two made their way to a corner of the cave; the firebender believed he had the upper hand as he saw no sources of water nearby and his foe now lacked the element after her arms evaporated from Mako's attacks. However, she managed to jump into a fissure in the ground, forcing Mako to pursue her. As the firebender landed in a large underground lake, he generated some fire in order to spot his opponent. However, as he turned around, he discovered the waterbender posed to attack with eight water tendrils attached to herself. Mako had no choice but to flee as Ming-Hua pursued him, trying to stab him with her whips. Desperately, he squeezed himself between two stone pillars, away from direct contact with the water, and used lightning generation to electrify the lake, zapping Ming-Hua and ending the battle, much to his surprise."
    },
    {
      "body": "Mako quickly made his way back up and assisted Bolin in his fight with Ghazan, throwing the criminal down with two blasts of fire as he tried to defend himself. The brothers cornered their foe, Mako demanding he give up. Ghazan, declaring he would not return to prison, decided to try and take them down with him, collapsing the entire cave in with lava and earthbending. Bolin quickly made an earth ramp to get the siblings out. They emerged from the cave just as the airbenders were working to get Korra out of Zaheer's grip, able to save her and throw the criminal airbender to the ground. He, along with Bolin, Asami, and Tonraq, ran over to the poisoned Avatar, watching with worry as Suyin attempted to bend the metallic substance out of her. He stood by as Korra was saved, looking down on her and Tonraq.",
      "links": [],
      "section": [
        "History of Mako (late 171 AG)",
        "Rescuing the airbenders"
      ],
      "text": "Mako quickly made his way back up and assisted Bolin in his fight with Ghazan, throwing the criminal down with two blasts of fire as he tried to defend himself. The brothers cornered their foe, Mako demanding he give up. Ghazan, declaring he would not return to prison, decided to try and take them down with him, collapsing the entire cave in with lava and earthbending. Bolin quickly made an earth ramp to get the siblings out. They emerged from the cave just as the airbenders were working to get Korra out of Zaheer's grip, able to save her and throw the criminal airbender to the ground. He, along with Bolin, Asami, and Tonraq, ran over to the poisoned Avatar, watching with worry as Suyin attempted to bend the metallic substance out of her. He stood by as Korra was saved, looking down on her and Tonraq."
    },
    {
      "body": "Two weeks later, Mako joined his friends and allies at Jinora's airbending master ceremony, smiling as Tenzin praised Korra for her efforts in restoring and saving the Air Nation and Jinora's for saving the Avatar. He stood and watched as the ceremony was completed with the revealing of Jinora's master ${link_0}.",
      "links": [
        {
          "body": "tattoos",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Body_markings_in_the_World_of_Avatar#Airbending_master_tattoos",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Rescuing the airbenders"
      ],
      "text": "Two weeks later, Mako joined his friends and allies at Jinora's airbending master ceremony, smiling as Tenzin praised Korra for her efforts in restoring and saving the Air Nation and Jinora's for saving the Avatar. He stood and watched as the ceremony was completed with the revealing of Jinora's master tattoos."
    },
    {
      "body": "After the ceremony, Mako joined Asami, Bolin, Tenzin, and Jinora on the ferry dock to say goodbye to Korra, who was set to board a ship heading toward the Southern Water Tribe. When Bolin said that he could not wait for Korra to leave, Mako snapped at his brother, asking how else the Avatar was supposed to take his comment if not personal. As the ship departed, he waved her off, wishing her a speedy recovery. In the following months, he wrote letters to her, reporting on his life in the city. In one of those letters, he reported that he was staking out the ${link_0}' hideout, though he never received a reply from Korra.",
      "links": [
        {
          "body": "Red Monsoons",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Red_Monsoon_Triad",
            "page": "Red_Monsoon_Triad"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "Rescuing the airbenders"
      ],
      "text": "After the ceremony, Mako joined Asami, Bolin, Tenzin, and Jinora on the ferry dock to say goodbye to Korra, who was set to board a ship heading toward the Southern Water Tribe. When Bolin said that he could not wait for Korra to leave, Mako snapped at his brother, asking how else the Avatar was supposed to take his comment if not personal. As the ship departed, he waved her off, wishing her a speedy recovery. In the following months, he wrote letters to her, reporting on his life in the city. In one of those letters, he reported that he was staking out the Red Monsoons' hideout, though he never received a reply from Korra."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "See also"
      ],
      "text": "Mako"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Mako (152 AG - 170 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Mako_(152_AG_-_170_AG)",
            "page": "History_of_Mako_(152_AG_-_170_AG)"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "See also"
      ],
      "text": "History of Mako (152 AG - 170 AG)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Mako (171 AG - Harmonic Convergence)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Mako_(171_AG_-_Harmonic_Convergence)",
            "page": "History_of_Mako_(171_AG_-_Harmonic_Convergence)"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "See also"
      ],
      "text": "History of Mako (171 AG - Harmonic Convergence)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Mako (174 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Mako_(174_AG)",
            "page": "History_of_Mako_(174_AG)"
          }
        }
      ],
      "section": [
        "History of Mako (late 171 AG)",
        "See also"
      ],
      "text": "History of Mako (174 AG)"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Mako_(late_171_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Mako_(late_171_AG).html",
    "page": "History_of_Mako_(late_171_AG)",
    "title": "History of Mako (late 171 AG)"
  }
}