{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "After the ${link_0}, ${link_1} extensively used ${link_2} to restore the ${link_3} of the innocent benders ${link_4} victimized. Now having learned to bend all four elements and achieved status as a Fully Realized ${link_5}, she must once again become the student when she delves into the realm of spirits under her paternal uncle's teachings and tutelage.",
      "links": [
        {
          "body": "Anti-bending Revolution",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Anti-bending_Revolution",
            "page": "Anti-bending_Revolution"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "energybending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Energybending",
            "page": "Energybending"
          }
        },
        {
          "body": "bending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Amon",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)"
      ],
      "text": "After the Anti-bending Revolution, Korra extensively used energybending to restore the bending of the innocent benders Amon victimized. Now having learned to bend all four elements and achieved status as a Fully Realized Avatar, she must once again become the student when she delves into the realm of spirits under her paternal uncle's teachings and tutelage."
    },
    {
      "body": "Six months after defeating Amon and gaining access to the Avatar State, Korra participated in an air scooter race on ${link_0} with ${link_1}, ${link_2}, and ${link_3}. As the close race was nearing its conclusion, Korra used the Avatar State as a boost to win, but was quickly castigated by ${link_4} when he found out what she had done, deeming her actions to be irresponsible. Confident in her airbending abilities and uninterested in more training, the Avatar dismissed her tutor's claims that she needed to hone her skills in a more dignified and advanced manner.",
      "links": [
        {
          "body": "Air Temple Island",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Ikki",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ikki",
            "page": "Ikki"
          }
        },
        {
          "body": "Meelo",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Meelo",
            "page": "Meelo"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Coming home"
      ],
      "text": "Six months after defeating Amon and gaining access to the Avatar State, Korra participated in an air scooter race on Air Temple Island with Jinora, Ikki, and Meelo. As the close race was nearing its conclusion, Korra used the Avatar State as a boost to win, but was quickly castigated by Tenzin when he found out what she had done, deeming her actions to be irresponsible. Confident in her airbending abilities and uninterested in more training, the Avatar dismissed her tutor's claims that she needed to hone her skills in a more dignified and advanced manner."
    },
    {
      "body": "Korra postponed Tenzin's travel plans to visit all the ${link_0}, a journey he hoped would bring her more spiritual enlightenment, in favor of a trip to the ${link_1} to attend the ${link_2}. Meeting up with her uncle, ${link_3}, she found out that angry spirits had been attacking fishing boats in the Southern waters. Her interest in fighting spirits piqued, Korra became even less motivated to learn more advanced airbending, especially after she found out that it had been Tenzin and ${link_4}'s decision to seclude her away in the isolated ${link_5} rather than ${link_6}'s.",
      "links": [
        {
          "body": "air temples",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_temple",
            "page": "Air_temple"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Glacier Spirits Festival",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Glacier_Spirits_Festival",
            "page": "Glacier_Spirits_Festival"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "compound",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_compound",
            "page": "Southern_Water_Tribe_compound"
          }
        },
        {
          "body": "Aang",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Coming home"
      ],
      "text": "Korra postponed Tenzin's travel plans to visit all the air temples, a journey he hoped would bring her more spiritual enlightenment, in favor of a trip to the Southern Water Tribe to attend the Glacier Spirits Festival. Meeting up with her uncle, Unalaq, she found out that angry spirits had been attacking fishing boats in the Southern waters. Her interest in fighting spirits piqued, Korra became even less motivated to learn more advanced airbending, especially after she found out that it had been Tenzin and Tonraq's decision to seclude her away in the isolated compound rather than Aang's."
    },
    {
      "body": "When the village she resided in came under attack by a ${link_0} later that night, Korra attempted in vain to fight the entity off, but even the Avatar State proved to be insufficient in comparison to the malevolent spirit's prowess. Only Unalaq managed to overpower the spirit, by using a special waterbending technique that calmed the entity down and make it disappear completely. Impressed, and aware of her own shortcomings when it came to battling the spirit, Korra took her uncle up on his offer to become her new spiritual guide, breaking with Tenzin as her mentor.",
      "links": [
        {
          "body": "dark spirit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Coming home"
      ],
      "text": "When the village she resided in came under attack by a dark spirit later that night, Korra attempted in vain to fight the entity off, but even the Avatar State proved to be insufficient in comparison to the malevolent spirit's prowess. Only Unalaq managed to overpower the spirit, by using a special waterbending technique that calmed the entity down and make it disappear completely. Impressed, and aware of her own shortcomings when it came to battling the spirit, Korra took her uncle up on his offer to become her new spiritual guide, breaking with Tenzin as her mentor."
    },
    {
      "body": "Later, as Unalaq began to explain the nature of his training for Korra, he explained that they must first travel to the ${link_0} and open the ${link_1}, stating that despite its danger, it was necessary to begin the South Pole's spiritual restoration. They were joined by ${link_2}, ${link_3}, as well as ${link_4}. At the last minute, Tonraq insisted on coming along to keep Korra safe from the ${link_5} that was brewing down there: a blizzard that had been going on for decades. Along the way, Unalaq expressed his belief that Tonraq was the reason for the spirits' attacking. It was also revealed that back in his youth, Tonraq was banished from the Northern Water Tribe because of his reckless actions that destroyed the sacred spiritual forest and angered its inhabiting spirits.",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Mako",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Desna and Eska",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "Everstorm",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Everstorm",
            "page": "Everstorm"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Opening the spirit portal"
      ],
      "text": "Later, as Unalaq began to explain the nature of his training for Korra, he explained that they must first travel to the South Pole and open the spirit portal, stating that despite its danger, it was necessary to begin the South Pole's spiritual restoration. They were joined by Mako, Bolin, as well as Desna and Eska. At the last minute, Tonraq insisted on coming along to keep Korra safe from the Everstorm that was brewing down there: a blizzard that had been going on for decades. Along the way, Unalaq expressed his belief that Tonraq was the reason for the spirits' attacking. It was also revealed that back in his youth, Tonraq was banished from the Northern Water Tribe because of his reckless actions that destroyed the sacred spiritual forest and angered its inhabiting spirits."
    },
    {
      "body": "Furious about her father's continued secrets and dictation of her life, Korra began distancing herself from him. While admitting to his faults, Tonraq still insisted that the physical and ${link_0} should remain separate, only for Korra to remind him that the Avatar is the bridge between both worlds and has this chance to live up to her potential. While Tonraq disagreed with his brother, Unalaq pointed out that that the Northern Water Tribe has helped the South rebuild physically but it lacks spirituality, hence the spirits' rampage. Suddenly, the party was ambushed by dark spirits. During the fighting, Korra attempted to replicate Unalaq's spiritbending to purify an attacking spirit, but it failed to work, causing her uncle to intervene and save her again. Since their supplies were stolen during the attack, Tonraq insisted they turn back. Ultimately, Korra told her father to return home.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Opening the spirit portal"
      ],
      "text": "Furious about her father's continued secrets and dictation of her life, Korra began distancing herself from him. While admitting to his faults, Tonraq still insisted that the physical and Spirit World should remain separate, only for Korra to remind him that the Avatar is the bridge between both worlds and has this chance to live up to her potential. While Tonraq disagreed with his brother, Unalaq pointed out that that the Northern Water Tribe has helped the South rebuild physically but it lacks spirituality, hence the spirits' rampage. Suddenly, the party was ambushed by dark spirits. During the fighting, Korra attempted to replicate Unalaq's spiritbending to purify an attacking spirit, but it failed to work, causing her uncle to intervene and save her again. Since their supplies were stolen during the attack, Tonraq insisted they turn back. Ultimately, Korra told her father to return home."
    },
    {
      "body": "Upon reaching the Everstorm, Unalaq told Korra that inside the frozen spirit forest is the spirit portal and that she must open it again so that the South will become spiritually balanced once again, but she must open it alone. Korra entered and was attacked by dark spirits. She struggled to fight them off but managed to tap the portal in the Avatar State and open it, causing the sky to light up. Upon returning to the group, Korra's uncle commended her for her actions, stating that what she had done would help restore spiritual balance to the south and maybe the whole world. Upon returning to the Southern Water Tribe's shores, the group found a Northern Water Tribe fleet arriving. Unalaq told her that the South's spiritual decay cannot be cured simply by opening the source, which left Korra worried.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Opening the spirit portal"
      ],
      "text": "Upon reaching the Everstorm, Unalaq told Korra that inside the frozen spirit forest is the spirit portal and that she must open it again so that the South will become spiritually balanced once again, but she must open it alone. Korra entered and was attacked by dark spirits. She struggled to fight them off but managed to tap the portal in the Avatar State and open it, causing the sky to light up. Upon returning to the group, Korra's uncle commended her for her actions, stating that what she had done would help restore spiritual balance to the south and maybe the whole world. Upon returning to the Southern Water Tribe's shores, the group found a Northern Water Tribe fleet arriving. Unalaq told her that the South's spiritual decay cannot be cured simply by opening the source, which left Korra worried."
    },
    {
      "body": "Confused as to why Unalaq had brought his troops down from the north, Korra demanded to know more. When her uncle stated that it was to protect the spirit portal, Korra got defensive, deeming herself more than capable of protecting it on her own. Unalaq calmed her down by stating that there was another portal in the north, which, if opened, would allow the tribesmen to travel between either tribe in a manner of seconds, which led Korra to dream of a truly unified Water Tribe. However, most Southerners did not see it that way and felt frustrated and suppressed by the Northern presence in their tribe. As such, Korra attended a meeting at her parents' house to discuss their current situations. Tensions ran high and Korra was appalled by ${link_0}'s insistence on ${link_1} with the North. Tonraq implored her to talk to Unalaq about the situation again for him, and Korra agreed, though she emphasized that she did it for the tribe and not for him as she was still angry with Tonraq.",
      "links": [
        {
          "body": "Varrick",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "a civil war",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Water_Tribe_Civil_War",
            "page": "Water_Tribe_Civil_War"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "A brewing civil war"
      ],
      "text": "Confused as to why Unalaq had brought his troops down from the north, Korra demanded to know more. When her uncle stated that it was to protect the spirit portal, Korra got defensive, deeming herself more than capable of protecting it on her own. Unalaq calmed her down by stating that there was another portal in the north, which, if opened, would allow the tribesmen to travel between either tribe in a manner of seconds, which led Korra to dream of a truly unified Water Tribe. However, most Southerners did not see it that way and felt frustrated and suppressed by the Northern presence in their tribe. As such, Korra attended a meeting at her parents' house to discuss their current situations. Tensions ran high and Korra was appalled by Varrick's insistence on a civil war with the North. Tonraq implored her to talk to Unalaq about the situation again for him, and Korra agreed, though she emphasized that she did it for the tribe and not for him as she was still angry with Tonraq."
    },
    {
      "body": "When Korra told Unalaq how the Southerners were taking his presence there, the chief ensured her that he was merely trying to help and emphasized that even though it would be natural for her to side with the Southerners, she, as the Avatar, needed to remain neutral. As she voiced her doubts on being ready to take on the full extent of the Avatar responsibility, Unalaq reassured her that he had full faith in her abilities.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "A brewing civil war"
      ],
      "text": "When Korra told Unalaq how the Southerners were taking his presence there, the chief ensured her that he was merely trying to help and emphasized that even though it would be natural for her to side with the Southerners, she, as the Avatar, needed to remain neutral. As she voiced her doubts on being ready to take on the full extent of the Avatar responsibility, Unalaq reassured her that he had full faith in her abilities."
    },
    {
      "body": "With her uncle's words in mind, Korra attempted to remain neutral, defusing arising conflicts without choosing a side. However, this backfired, leading the frustrated Southerners to turn on her, as they viewed her as a traitor. Frustrated about the situation, she confided in Mako, who attempted to cheer her up by inviting her on a date. However, what was supposed to be calming, private date, turned into a double date when Bolin brought Desna and Eska along.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "A brewing civil war"
      ],
      "text": "With her uncle's words in mind, Korra attempted to remain neutral, defusing arising conflicts without choosing a side. However, this backfired, leading the frustrated Southerners to turn on her, as they viewed her as a traitor. Frustrated about the situation, she confided in Mako, who attempted to cheer her up by inviting her on a date. However, what was supposed to be calming, private date, turned into a double date when Bolin brought Desna and Eska along."
    },
    {
      "body": "That night, Korra returned home to find her mother waiting for her. Believing her father send her, Korra was curt to her, though when her mother kept pushing her to talk, she spilled her frustration about Tonraq's secrecy over his past. Her frustration only grew upon learning that Tonraq's past was no secret to Senna. She dismissed her mother's desire for giving her a normal childhood, stating that she had always wanted to be the Avatar, though found that everyone was holding her back. As her mother tried to make her understand that the conflict between the Water Tribes was not something recent, Korra learned that her father had been approached by rebels who were plotting against Unalaq. Fearing Tonraq went through with it, Korra promptly left her mother and rushed over to the ${link_0}.",
      "links": [
        {
          "body": "royal palace",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_Royal_Palace",
            "page": "Southern_Water_Tribe_Royal_Palace"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "A brewing civil war"
      ],
      "text": "That night, Korra returned home to find her mother waiting for her. Believing her father send her, Korra was curt to her, though when her mother kept pushing her to talk, she spilled her frustration about Tonraq's secrecy over his past. Her frustration only grew upon learning that Tonraq's past was no secret to Senna. She dismissed her mother's desire for giving her a normal childhood, stating that she had always wanted to be the Avatar, though found that everyone was holding her back. As her mother tried to make her understand that the conflict between the Water Tribes was not something recent, Korra learned that her father had been approached by rebels who were plotting against Unalaq. Fearing Tonraq went through with it, Korra promptly left her mother and rushed over to the royal palace."
    },
    {
      "body": "Arriving at the palace, hoping to warn her uncle, she found several guards knocked out and restrained. She found four masked rebels, one of which carrying an unconscious Unalaq. Under the impression that her father was among them, Korra pleaded with them to forsake their rebellion and leave, even going as far as offering them the chance to escape without consequence. However, they refused and a battle broke out, in which Korra swiftly overpowered the rebels. Korra thwarted the man she believed to be her father from making his escape on a ${link_0} with Unalaq. However, as she unmasked him, demanding to know why he kidnapped Unalaq, she learned that her father had nothing to do with the ambush. As Unalaq awoke and sentences the rebels to freeze in prison, Korra convinced him to at least give them a fair trial, believing it to be an inherent right for every Water Tribe citizen.",
      "links": [
        {
          "body": "snowmobile",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Snowmobile",
            "page": "Snowmobile"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "A brewing civil war"
      ],
      "text": "Arriving at the palace, hoping to warn her uncle, she found several guards knocked out and restrained. She found four masked rebels, one of which carrying an unconscious Unalaq. Under the impression that her father was among them, Korra pleaded with them to forsake their rebellion and leave, even going as far as offering them the chance to escape without consequence. However, they refused and a battle broke out, in which Korra swiftly overpowered the rebels. Korra thwarted the man she believed to be her father from making his escape on a snowmobile with Unalaq. However, as she unmasked him, demanding to know why he kidnapped Unalaq, she learned that her father had nothing to do with the ambush. As Unalaq awoke and sentences the rebels to freeze in prison, Korra convinced him to at least give them a fair trial, believing it to be an inherent right for every Water Tribe citizen."
    },
    {
      "body": "Going back home to her parents, Korra broke down and hugged her father, relieved that he had nothing to do with the rebellion. However, the family's reconciliation was cut short when Unalaq appeared with guards to arrest Senna and Tonraq for the charges of conspiring to assassinate him.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "A brewing civil war"
      ],
      "text": "Going back home to her parents, Korra broke down and hugged her father, relieved that he had nothing to do with the rebellion. However, the family's reconciliation was cut short when Unalaq appeared with guards to arrest Senna and Tonraq for the charges of conspiring to assassinate him."
    },
    {
      "body": "Convinced of her parents' innocence, Korra told Unalaq that he was making a mistake. As she expressed her inability to believe that he would do that to his own family, Unalaq promised her that her parents would receive a fair trial with the most honorable judge of the Water Tribes, ${link_0}.",
      "links": [
        {
          "body": "Hotah",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hotah",
            "page": "Hotah"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Learning the truth"
      ],
      "text": "Convinced of her parents' innocence, Korra told Unalaq that he was making a mistake. As she expressed her inability to believe that he would do that to his own family, Unalaq promised her that her parents would receive a fair trial with the most honorable judge of the Water Tribes, Hotah."
    },
    {
      "body": "Korra was called upon to witness at the trial, though the specific questions Hotah asked her left her no room to elaborate on the events, causing her to make a tainted statement. Korra was relieved upon seeing her mother acquitted of all charges, but was shocked to find her father and the other rebels sentenced to death. Angered, she threatened to kill the judge if he would not reconsider, and after Unalaq interfered, the death sentence was changed to life imprisonment. After Tonraq was led away, Korra and Senna visited him in ${link_0}, and she immediately suggested to break him out of there, though reconsidered upon her father's wish.",
      "links": [
        {
          "body": "prison",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_prison",
            "page": "Southern_Water_Tribe_prison"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Learning the truth"
      ],
      "text": "Korra was called upon to witness at the trial, though the specific questions Hotah asked her left her no room to elaborate on the events, causing her to make a tainted statement. Korra was relieved upon seeing her mother acquitted of all charges, but was shocked to find her father and the other rebels sentenced to death. Angered, she threatened to kill the judge if he would not reconsider, and after Unalaq interfered, the death sentence was changed to life imprisonment. After Tonraq was led away, Korra and Senna visited him in prison, and she immediately suggested to break him out of there, though reconsidered upon her father's wish."
    },
    {
      "body": "Upon witnessing her mother cry over Tonraq's fate back at their home, she decided to convince Judge Hotah to change his sentence and acquit her father of the charges as well. However, as she confronted the man, she found that he had merely been following Unalaq's orders and she learned her uncle had also been responsible for her father's banishment. Angered, she decided to break her father out of prison, calling on Mako and ${link_0} to help her. After a brief skirmish with Unalaq in the prison, the threesome left for ${link_1}, where the businessman and Bolin were waiting for them, in order to give chase to the ship heading for the Northern Water Tribe that carried Tonraq and the other prisoners.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Varrick's yacht",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Varrick%27s_yacht",
            "page": "Varrick%27s_yacht"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Learning the truth"
      ],
      "text": "Upon witnessing her mother cry over Tonraq's fate back at their home, she decided to convince Judge Hotah to change his sentence and acquit her father of the charges as well. However, as she confronted the man, she found that he had merely been following Unalaq's orders and she learned her uncle had also been responsible for her father's banishment. Angered, she decided to break her father out of prison, calling on Mako and Asami to help her. After a brief skirmish with Unalaq in the prison, the threesome left for Varrick's yacht, where the businessman and Bolin were waiting for them, in order to give chase to the ship heading for the Northern Water Tribe that carried Tonraq and the other prisoners."
    },
    {
      "body": "After they freed the prisoners, Korra told her father the entire truth, causing him to officially rebel against his brother. Proud of her father, Korra wanted to fight alongside him against Unalaq, though she was sent to Republic City by Tonraq in order to ask ${link_0} ${link_1} to deploy the United Forces to help the South.",
      "links": [
        {
          "body": "President",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Raiko",
            "page": "Raiko"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Learning the truth"
      ],
      "text": "After they freed the prisoners, Korra told her father the entire truth, causing him to officially rebel against his brother. Proud of her father, Korra wanted to fight alongside him against Unalaq, though she was sent to Republic City by Tonraq in order to ask President Raiko to deploy the United Forces to help the South."
    },
    {
      "body": "Upon arriving back in Republic City, the civil war's effects were already beginning to take place, and Lin Beifong informed Korra and her friends of a peace march the Southerners were organizing that evening. Korra expressed her desire to attend, to show her fellow tribesmen that they had the support of the Avatar, though Mako attempted to dissuade her, stating that she should at least try to maintain a sense of neutrality. Emphasizing that she was not neutral, she ignored his suggestion and attended anyway. However, during the protest, the ${link_0} was ${link_1}, leaving Korra furious as she was convinced the North was behind it, even though Mako believed otherwise.",
      "links": [
        {
          "body": "Southern Water Tribe Cultural Center",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_Cultural_Center",
            "page": "Southern_Water_Tribe_Cultural_Center"
          }
        },
        {
          "body": "bombed",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bombing_of_the_Southern_Water_Tribe_Cultural_Center",
            "page": "Bombing_of_the_Southern_Water_Tribe_Cultural_Center"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Troubles in the city"
      ],
      "text": "Upon arriving back in Republic City, the civil war's effects were already beginning to take place, and Lin Beifong informed Korra and her friends of a peace march the Southerners were organizing that evening. Korra expressed her desire to attend, to show her fellow tribesmen that they had the support of the Avatar, though Mako attempted to dissuade her, stating that she should at least try to maintain a sense of neutrality. Emphasizing that she was not neutral, she ignored his suggestion and attended anyway. However, during the protest, the Southern Water Tribe Cultural Center was bombed, leaving Korra furious as she was convinced the North was behind it, even though Mako believed otherwise."
    },
    {
      "body": "The next day, Korra met with President Raiko in order to persuade him to support the South by sending the United Forces down to help them. Much to her dismay, however, the President refused, convinced that it was not the Republic's place to interfere with internal Water Tribe affairs and that the situation called for a diplomatic solution. Angered, Korra stated that his passivity would bring forth the destruction of the South, and that every casualty would thus be on his hands.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Troubles in the city"
      ],
      "text": "The next day, Korra met with President Raiko in order to persuade him to support the South by sending the United Forces down to help them. Much to her dismay, however, the President refused, convinced that it was not the Republic's place to interfere with internal Water Tribe affairs and that the situation called for a diplomatic solution. Angered, Korra stated that his passivity would bring forth the destruction of the South, and that every casualty would thus be on his hands."
    },
    {
      "body": "Frustrated, Korra went to Mako's apartment and vented about the situation to the officer. However, as a policeman, he tried to maintain a more neutral point of view, telling her that she could not expect the President to send troops to fight a war that is not theirs. Korra took this the wrong way, believing Mako to side against her, and the two got into an argument, which ended with Korra storming out on the firebender.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Troubles in the city"
      ],
      "text": "Frustrated, Korra went to Mako's apartment and vented about the situation to the officer. However, as a policeman, he tried to maintain a more neutral point of view, telling her that she could not expect the President to send troops to fight a war that is not theirs. Korra took this the wrong way, believing Mako to side against her, and the two got into an argument, which ended with Korra storming out on the firebender."
    },
    {
      "body": "Korra headed to the harbor where Varrick's yacht was docked, hoping that the businessman would know what to do next. Upon his suggestion, the Avatar took her issue directly to General Iroh, who planned to bring his forces to the South for make-belief training exercises as a cover up for them to engage hostile Northern forces. However, the President interrupted their conversation, officially disabling Iroh from helping Korra. Korra received a warning from Raiko to not undermine his authority, which fueled her dislike of him even more. Iroh suggested that she head to the ${link_0} and talk to the ${link_1} for support.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Troubles in the city"
      ],
      "text": "Korra headed to the harbor where Varrick's yacht was docked, hoping that the businessman would know what to do next. Upon his suggestion, the Avatar took her issue directly to General Iroh, who planned to bring his forces to the South for make-belief training exercises as a cover up for them to engage hostile Northern forces. However, the President interrupted their conversation, officially disabling Iroh from helping Korra. Korra received a warning from Raiko to not undermine his authority, which fueled her dislike of him even more. Iroh suggested that she head to the Fire Nation and talk to the Fire Lord for support."
    },
    {
      "body": "When Korra met up with Bolin, asking him to watch Naga for her as she traveled to the Fire Nation, she learned from the earthbender that Mako had ratted her plans out to the President. Feeling betrayed, she stormed into the police station and confronted him. Their discussion became heated very quickly and escalated to the point where Mako broke up with Korra, causing her to run off.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Troubles in the city"
      ],
      "text": "When Korra met up with Bolin, asking him to watch Naga for her as she traveled to the Fire Nation, she learned from the earthbender that Mako had ratted her plans out to the President. Feeling betrayed, she stormed into the police station and confronted him. Their discussion became heated very quickly and escalated to the point where Mako broke up with Korra, causing her to run off."
    },
    {
      "body": "As Korra left Republic City to gain the aid of the Fire Nation, she was attacked by her two cousins, intent on capturing her and bringing her to Unalaq. During the battle, an enormous dark spirit appeared out of the water. Korra attempted to subdue the entity with spiritbending. While initially working, the spirit broke free. Korra attempted to blast it with her firebending, though it had no effect and the spirit consumed her, dragging her below the surface.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Troubles in the city"
      ],
      "text": "As Korra left Republic City to gain the aid of the Fire Nation, she was attacked by her two cousins, intent on capturing her and bringing her to Unalaq. During the battle, an enormous dark spirit appeared out of the water. Korra attempted to subdue the entity with spiritbending. While initially working, the spirit broke free. Korra attempted to blast it with her firebending, though it had no effect and the spirit consumed her, dragging her below the surface."
    },
    {
      "body": "Following the attack, Korra washed up on a ${link_0} island. She awoke to see three members of the ${link_1} standing over her, and, reacting instinctively, used airbending to push them away. However, the action took its toll on her and she collapsed to her knees in exhaustion. One of the tribesmen attempted to comfort her, stating that they were there to help her, but Korra became confused at the mention of her name, asking who that was. Alarmed, the sage asked her how she came to be on their island, but Korra responded that she could not remember how she got there or what had happened, before slipping into unconsciousness once more.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Bhanti Tribe",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bhanti_Tribe",
            "page": "Bhanti_Tribe"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Finding herself"
      ],
      "text": "Following the attack, Korra washed up on a Fire Nation island. She awoke to see three members of the Bhanti Tribe standing over her, and, reacting instinctively, used airbending to push them away. However, the action took its toll on her and she collapsed to her knees in exhaustion. One of the tribesmen attempted to comfort her, stating that they were there to help her, but Korra became confused at the mention of her name, asking who that was. Alarmed, the sage asked her how she came to be on their island, but Korra responded that she could not remember how she got there or what had happened, before slipping into unconsciousness once more."
    },
    {
      "body": "Korra was brought to the ${link_0}, and muttered \"${link_1}\" several times while the tribe's ${link_2} examined her. She was diagnosed as having been infected by a dark spirit, which threatened to kill the Avatar Spirit within her if left untreated. In order to save the spirit, Korra was lowered into a healing cell, and she began to converse with visions of herself and her most recent past lives, Aang, ${link_3}, ${link_4}, and ${link_5}. After the vision of Avatar Kuruk informed her that, to reconnect with her Avatar Spirit, she would need to return to the beginning, Korra found herself face to face with a young man. She asked him if he was Raava, to which the young man replied that he was not, but that he could help Korra find her. He informed the young Avatar that his name was ${link_6}, and that he would show her how he became the first Avatar.",
      "links": [
        {
          "body": "Bhanti Village Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bhanti_Tribe#Bhanti_Village_Temple",
            "page": "Bhanti_Tribe"
          }
        },
        {
          "body": "Raava",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Raava",
            "page": "Raava"
          }
        },
        {
          "body": "shaman",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Shaman",
            "page": "Shaman"
          }
        },
        {
          "body": "Roku",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi",
            "page": "Kyoshi"
          }
        },
        {
          "body": "Kuruk",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Kuruk",
            "page": "Kuruk"
          }
        },
        {
          "body": "Wan",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Wan",
            "page": "Wan"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Finding herself"
      ],
      "text": "Korra was brought to the Bhanti Village Temple, and muttered \"Raava\" several times while the tribe's shaman examined her. She was diagnosed as having been infected by a dark spirit, which threatened to kill the Avatar Spirit within her if left untreated. In order to save the spirit, Korra was lowered into a healing cell, and she began to converse with visions of herself and her most recent past lives, Aang, Roku, Kyoshi, and Kuruk. After the vision of Avatar Kuruk informed her that, to reconnect with her Avatar Spirit, she would need to return to the beginning, Korra found herself face to face with a young man. She asked him if he was Raava, to which the young man replied that he was not, but that he could help Korra find her. He informed the young Avatar that his name was Wan, and that he would show her how he became the first Avatar."
    },
    {
      "body": "After witnessing Wan's life and consequently reconnecting with her deepest Avatar memories, Korra awoke with her memories regained. The elderly sage led her to a large field, where a herd of ${link_0} were grazing and offered the Avatar one. Korra thanked the woman for her kindness, and wondered aloud how long she had been gone, to which she receiving an inconclusive answer. However, with the ${link_1} only a few weeks away, Korra stated that she intended to close the Southern spirit portal, and promptly left the island on a flying bison.",
      "links": [
        {
          "body": "flying bison",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Finding herself"
      ],
      "text": "After witnessing Wan's life and consequently reconnecting with her deepest Avatar memories, Korra awoke with her memories regained. The elderly sage led her to a large field, where a herd of flying bison were grazing and offered the Avatar one. Korra thanked the woman for her kindness, and wondered aloud how long she had been gone, to which she receiving an inconclusive answer. However, with the Harmonic Convergence only a few weeks away, Korra stated that she intended to close the Southern spirit portal, and promptly left the island on a flying bison."
    },
    {
      "body": "Remembering Tenzin's vacation itinerary, she tracked down the family at the ${link_0}, where she was greeted by a shocked Tenzin and his family, pleasantly surprising them all. The airbender children excitedly ran up to her and hugged her. Even though she had parted on shaky grounds with Tenzin, Korra expressed how glad she was to see everyone, but she was surprised to learn that they were unaware of the events occurring elsewhere. Being implored to bring them up to speed with everything, Korra quickly shared the outlines of the situation with everyone, before retreating with Tenzin to one of the temple's gardens to discuss it more in depth. Korra blamed herself for the entire situation, but was corrected by Tenzin who pinned it all on Unalaq's hunger for power. In order to rectify her mistake of opening the Southern spirit portal, she needed to enter the Spirit World.",
      "links": [
        {
          "body": "Eastern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Entering the Spirit World"
      ],
      "text": "Remembering Tenzin's vacation itinerary, she tracked down the family at the Eastern Air Temple, where she was greeted by a shocked Tenzin and his family, pleasantly surprising them all. The airbender children excitedly ran up to her and hugged her. Even though she had parted on shaky grounds with Tenzin, Korra expressed how glad she was to see everyone, but she was surprised to learn that they were unaware of the events occurring elsewhere. Being implored to bring them up to speed with everything, Korra quickly shared the outlines of the situation with everyone, before retreating with Tenzin to one of the temple's gardens to discuss it more in depth. Korra blamed herself for the entire situation, but was corrected by Tenzin who pinned it all on Unalaq's hunger for power. In order to rectify her mistake of opening the Southern spirit portal, she needed to enter the Spirit World."
    },
    {
      "body": "Together, Tenzin and Korra visited the stone garden where Aang and Guru ${link_0} had gone on a spiritual journey seventy one years prior, inspiring the young Avatar with confidence that she could enter the Spirit World. Although Tenzin's family helped to set the mood for meditation, neither Korra nor Tenzin could successfully meditate into the Spirit World, severely annoying the master airbender. After three failed attempts at three different locations, Korra inquired what was disturbing Tenzin, as he had snapped at Meelo, ${link_1}, and her respectively each time their meditation failed. When he stated that nothing felt right to him, she opted to try whatever it was that he had done when he first crossed to the Spirit World. Much to her surprise, however, an ashamed Tenzin admitted that he had never done so, though he remained adamant that it was his destiny to guide the Avatar to the Spirit World and implored her to trust him. When Jinora offered an alternative by calling upon her ${link_2} to reveal themselves, Korra inquired if the entities wanted to help them. Although Tenzin was reluctant to follow the spirits, she playfully brushed him off by stating that since the spirits had actually been to the Spirit World before, she was going to follow them.",
      "links": [
        {
          "body": "Pathik",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pathik",
            "page": "Pathik"
          }
        },
        {
          "body": "Kya",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kya",
            "page": "Kya"
          }
        },
        {
          "body": "dragonfly bunny spirits",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Dragonfly_bunny_spirit",
            "page": "Dragonfly_bunny_spirit"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Entering the Spirit World"
      ],
      "text": "Together, Tenzin and Korra visited the stone garden where Aang and Guru Pathik had gone on a spiritual journey seventy one years prior, inspiring the young Avatar with confidence that she could enter the Spirit World. Although Tenzin's family helped to set the mood for meditation, neither Korra nor Tenzin could successfully meditate into the Spirit World, severely annoying the master airbender. After three failed attempts at three different locations, Korra inquired what was disturbing Tenzin, as he had snapped at Meelo, Kya, and her respectively each time their meditation failed. When he stated that nothing felt right to him, she opted to try whatever it was that he had done when he first crossed to the Spirit World. Much to her surprise, however, an ashamed Tenzin admitted that he had never done so, though he remained adamant that it was his destiny to guide the Avatar to the Spirit World and implored her to trust him. When Jinora offered an alternative by calling upon her dragonfly bunny spirits to reveal themselves, Korra inquired if the entities wanted to help them. Although Tenzin was reluctant to follow the spirits, she playfully brushed him off by stating that since the spirits had actually been to the Spirit World before, she was going to follow them."
    },
    {
      "body": "As they followed the spirits down to the lower areas of the temple, Korra complimented Jinora's ability with spirits, deeming her to be lucky to have such a natural gift. When Jinora replied it was nothing compared to having met the first Avatar, Korra told her about her meeting with Wan. The subsequent realization that Jinora had been drawn to Wan's statue at the ${link_0} at exactly the same moment Korra had opened the Southern spirit portal awed both girls.",
      "links": [
        {
          "body": "Southern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Entering the Spirit World"
      ],
      "text": "As they followed the spirits down to the lower areas of the temple, Korra complimented Jinora's ability with spirits, deeming her to be lucky to have such a natural gift. When Jinora replied it was nothing compared to having met the first Avatar, Korra told her about her meeting with Wan. The subsequent realization that Jinora had been drawn to Wan's statue at the Southern Air Temple at exactly the same moment Korra had opened the Southern spirit portal awed both girls."
    },
    {
      "body": "Arriving at a dilapidated ancient airbender meditation circle, Korra watched as Tenzin performed a cleansing ceremony to strengthen its connection to the Spirit World. However, the ritual drew out a swarm of bat-like dark spirits that immediately attacked the group. Korra tried to swat the entities away with her waterbending, though it had no effect on them. Switching tactics, she surrounded the spirits with water streams in an attempt to purify them with spiritbending and, for the first time, she managed to successfully turn the spirits back into light. As she dispersed the dark entities, she consequently cleaned their hold on the ancient site in the process, restoring it to its former glory. When Tenzin walked up to her and bitterly noted how much more effective Unalaq's teachings had been for her spiritual training than his own, Korra immediately put him at ease by emphasizing that he had trained her in order to help her, as opposed to doing it for personal gain. She proceeded to apologize for how she had treated him, expressing her regret over turning her back on him. When she stated that she needed him more than ever, Tenzin promptly stated that he would not let her down, and the two shared a hug.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Entering the Spirit World"
      ],
      "text": "Arriving at a dilapidated ancient airbender meditation circle, Korra watched as Tenzin performed a cleansing ceremony to strengthen its connection to the Spirit World. However, the ritual drew out a swarm of bat-like dark spirits that immediately attacked the group. Korra tried to swat the entities away with her waterbending, though it had no effect on them. Switching tactics, she surrounded the spirits with water streams in an attempt to purify them with spiritbending and, for the first time, she managed to successfully turn the spirits back into light. As she dispersed the dark entities, she consequently cleaned their hold on the ancient site in the process, restoring it to its former glory. When Tenzin walked up to her and bitterly noted how much more effective Unalaq's teachings had been for her spiritual training than his own, Korra immediately put him at ease by emphasizing that he had trained her in order to help her, as opposed to doing it for personal gain. She proceeded to apologize for how she had treated him, expressing her regret over turning her back on him. When she stated that she needed him more than ever, Tenzin promptly stated that he would not let her down, and the two shared a hug."
    },
    {
      "body": "Believing in the site's spiritual connection, Tenzin confidently stated that if they were to meditate there, they would succeed to cross over, and Korra, knowing that it was the airbender's dream to succeed, offered him to go first, spending the remainder of the day waiting with the others. When it became apparent that it was not going to work, Korra emphasized that they were running out of time, urging her mentor to follow up on Kya's statement that it was Jinora's destiny to guide her into the Spirit World. Although Tenzin initially deemed it too dangerous for his daughter, he relented, and Korra was told to go on and close the portal, receiving the reassurance that her body would be kept safe until her return. The two girls sat down in lotus position opposite from one another and meditated. When Korra's eyes started to glow, they both crossed over to the Spirit World.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Entering the Spirit World"
      ],
      "text": "Believing in the site's spiritual connection, Tenzin confidently stated that if they were to meditate there, they would succeed to cross over, and Korra, knowing that it was the airbender's dream to succeed, offered him to go first, spending the remainder of the day waiting with the others. When it became apparent that it was not going to work, Korra emphasized that they were running out of time, urging her mentor to follow up on Kya's statement that it was Jinora's destiny to guide her into the Spirit World. Although Tenzin initially deemed it too dangerous for his daughter, he relented, and Korra was told to go on and close the portal, receiving the reassurance that her body would be kept safe until her return. The two girls sat down in lotus position opposite from one another and meditated. When Korra's eyes started to glow, they both crossed over to the Spirit World."
    },
    {
      "body": "Although Jinora was awestruck by the appearance of the Spirit World, Korra was more hesitant, alert for the presence of dark spirits. She startled upon touching a flower that morphed into a butterfly spirit, causing Jinora to chase it. Worried about the young girl's safety, Korra ran after her, though accidentally stepped into the hole of a meerkat spirit, angering the entity. Upon asked who she was, she pridefully announced that she was the Avatar, though it did not impress the multitude of meerkat spirits that were popping up from under the ground. The entities fired a multitude of questions at her; surrounded and agitated, Korra attempted to bend at the spirits, though was unable to since she had not entered the Spirit World through a portal. Although her attack was unsuccessful, the spirits were angered by the attempt and promptly attacked Korra; as they touched her, they morphed into a blue, dense substance, weighing her down. Korra called out to Jinora for help and was advised to calm down, as it was her own energy that was upsetting the spirits. However, even the young airbender was unable to free her from the spirits' attack, and when the meerkats all began running in a circle around them, Korra and Jinora found themselves sucked through the earth. They were dropped into a large body of water on another location, where they were instantly swallowed by another spirit, only to resurface again in a rapidly moving stream. As they approached a fork in the water, Korra was pushed in another direction as Jinora and ended up in a dark forest.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Entering the Spirit World"
      ],
      "text": "Although Jinora was awestruck by the appearance of the Spirit World, Korra was more hesitant, alert for the presence of dark spirits. She startled upon touching a flower that morphed into a butterfly spirit, causing Jinora to chase it. Worried about the young girl's safety, Korra ran after her, though accidentally stepped into the hole of a meerkat spirit, angering the entity. Upon asked who she was, she pridefully announced that she was the Avatar, though it did not impress the multitude of meerkat spirits that were popping up from under the ground. The entities fired a multitude of questions at her; surrounded and agitated, Korra attempted to bend at the spirits, though was unable to since she had not entered the Spirit World through a portal. Although her attack was unsuccessful, the spirits were angered by the attempt and promptly attacked Korra; as they touched her, they morphed into a blue, dense substance, weighing her down. Korra called out to Jinora for help and was advised to calm down, as it was her own energy that was upsetting the spirits. However, even the young airbender was unable to free her from the spirits' attack, and when the meerkats all began running in a circle around them, Korra and Jinora found themselves sucked through the earth. They were dropped into a large body of water on another location, where they were instantly swallowed by another spirit, only to resurface again in a rapidly moving stream. As they approached a fork in the water, Korra was pushed in another direction as Jinora and ended up in a dark forest."
    },
    {
      "body": "Surrounded by dark spirits, Korra ran deeper into the forest, calling for Jinora. As she grew more desperate, she physically and emotionally changed to her four-year-old self, crying for the young airbender. She was startled when a young ${link_0} flew toward her, swatting at the entity out of reflex, causing the spirit to injure its wing. Noticing what she had done, she picked up the spirit and apologized, as she had not meant to hurt it. At that moment, she was approached by Iroh, whom she instantly recognized due to his close friendship with her predecessor, Aang. She was subsequently led out of the forest and invited to join the tea party in celebration of ${link_1}'s wedding. Iroh poured her a cup of tea, brewed in ${link_2}, which Korra instantly recognized as her own. However, when Iroh later explained how he had made a new friend in the Spirit World, Korra grew sad over her separation from Jinora. The distraught Korra threw a tantrum; the negativity she displayed caused the skies to darken and the spirits to grow restless. After Iroh explained the impact of her emotions on her surroundings to her, Korra apologized and grew surprised over the fact that her positive attitude could literally bring out the sun. The elderly man added that if she sought the light, she would find it, but looking for the dark would mean that it is all she would ever see. Korra tried to apply what she had just learned to find Jinora, but Iroh stated that finding the young airbender would not be that easy. When Korra asked for advice, he imparted the wisdom that sometimes the best way to help oneself is to help others, recommending she took the dragon bird spirit home, pointed Korra toward its home atop ${link_3}.",
      "links": [
        {
          "body": "dragon bird spirit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon_bird_spirit",
            "page": "Dragon_bird_spirit"
          }
        },
        {
          "body": "May-Jim",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/May-Jim",
            "page": "May-Jim"
          }
        },
        {
          "body": "Wan's teapot",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Wan%27s_teapot",
            "page": "Wan%27s_teapot"
          }
        },
        {
          "body": "Hai-Riyo Peak",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Hai-Riyo_Peak",
            "page": "Hai-Riyo_Peak"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Entering the Spirit World"
      ],
      "text": "Surrounded by dark spirits, Korra ran deeper into the forest, calling for Jinora. As she grew more desperate, she physically and emotionally changed to her four-year-old self, crying for the young airbender. She was startled when a young dragon bird spirit flew toward her, swatting at the entity out of reflex, causing the spirit to injure its wing. Noticing what she had done, she picked up the spirit and apologized, as she had not meant to hurt it. At that moment, she was approached by Iroh, whom she instantly recognized due to his close friendship with her predecessor, Aang. She was subsequently led out of the forest and invited to join the tea party in celebration of May-Jim's wedding. Iroh poured her a cup of tea, brewed in Wan's teapot, which Korra instantly recognized as her own. However, when Iroh later explained how he had made a new friend in the Spirit World, Korra grew sad over her separation from Jinora. The distraught Korra threw a tantrum; the negativity she displayed caused the skies to darken and the spirits to grow restless. After Iroh explained the impact of her emotions on her surroundings to her, Korra apologized and grew surprised over the fact that her positive attitude could literally bring out the sun. The elderly man added that if she sought the light, she would find it, but looking for the dark would mean that it is all she would ever see. Korra tried to apply what she had just learned to find Jinora, but Iroh stated that finding the young airbender would not be that easy. When Korra asked for advice, he imparted the wisdom that sometimes the best way to help oneself is to help others, recommending she took the dragon bird spirit home, pointed Korra toward its home atop Hai-Riyo Peak."
    },
    {
      "body": "Korra was accompanied by Iroh for a while, but when the scared girl asked him if he would accompany her, he squatted down and gently told her that she needed to make the trip on her own. He explained to her that the darkness she saw surrounding Hai-Riyo Peak was caused by the darkness and anger brought by the people who had been frequenting the Spirit World lately, but since Korra had light and peace within her, he pointed out that she could change the world around her. To prove his point, Korra was asked if she still thought the dragon bird was scary like she had upon their first encounter, and after she replied that it was not, Iroh noted that many things that seemed threatening in the dark would prove to be welcoming by shedding light on it. After embracing the old man, Korra received an invitation to visit him again, whether it was in her present life or her next incarnation.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Entering the Spirit World"
      ],
      "text": "Korra was accompanied by Iroh for a while, but when the scared girl asked him if he would accompany her, he squatted down and gently told her that she needed to make the trip on her own. He explained to her that the darkness she saw surrounding Hai-Riyo Peak was caused by the darkness and anger brought by the people who had been frequenting the Spirit World lately, but since Korra had light and peace within her, he pointed out that she could change the world around her. To prove his point, Korra was asked if she still thought the dragon bird was scary like she had upon their first encounter, and after she replied that it was not, Iroh noted that many things that seemed threatening in the dark would prove to be welcoming by shedding light on it. After embracing the old man, Korra received an invitation to visit him again, whether it was in her present life or her next incarnation."
    },
    {
      "body": "Korra ventured up the mountain by herself, chanting \"light and peace\" as a mantra to keep herself calm. When she encountered three dark ${link_0}, she implemented Iroh's wisdom, forsaking her fear for the spirits' frightful appearance in favor of a positive attitude toward them. Korra introduced herself, her cheerful demeanor changing the spirits and her surroundings back to normal. She hitched a ride to the top of Hai-Riyo Peak on the back of one of the guardian spirits, where she found the nest of the dragon bird spirit with three other young spirits. As she returned the wounded young to its nest, Korra watched in awe how the four entities emerged into one, large dragon bird spirit. When the spirit's transformation was completed, so was her own, as she had returned to her normal physical and emotional state. She mounted the flying spirit, who took her to the spirit portals.",
      "links": [
        {
          "body": "guardian spirits",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Guardian_spirit",
            "page": "Guardian_spirit"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Entering the Spirit World"
      ],
      "text": "Korra ventured up the mountain by herself, chanting \"light and peace\" as a mantra to keep herself calm. When she encountered three dark guardian spirits, she implemented Iroh's wisdom, forsaking her fear for the spirits' frightful appearance in favor of a positive attitude toward them. Korra introduced herself, her cheerful demeanor changing the spirits and her surroundings back to normal. She hitched a ride to the top of Hai-Riyo Peak on the back of one of the guardian spirits, where she found the nest of the dragon bird spirit with three other young spirits. As she returned the wounded young to its nest, Korra watched in awe how the four entities emerged into one, large dragon bird spirit. When the spirit's transformation was completed, so was her own, as she had returned to her normal physical and emotional state. She mounted the flying spirit, who took her to the spirit portals."
    },
    {
      "body": "As Korra was about to close the Southern portal, ${link_0} called out to her, addressing her as Raava. Facing the spirit of darkness and chaos, she was undeterred when he informed her that he would destroy her during the upcoming Harmonic Convergence, reiterating her goal to close the Southern portal. However, her confidence faltered when Unalaq revealed himself and Jinora as his prisoner. In order to save Jinora's soul, Korra relented and opened the ${link_1} portal. When she demanded the young airbender's release in return, she was promptly attacked by Unalaq, who had retained his bending by entering physically through the Southern portal as opposed to spiritually though meditation. Unable to fight back, Korra tried her best to avoid his water blasts, though was powerless to stop Furry-Foot from taking off with Jinora. As she gave chase, she was snatched up and gnawed at by one of the guardian spirits, who had turned dark again. Incapacitated, she was surrounded by water streams as Unalaq prepared to destroy her soul with his unique waterbending technique. However, before he could fully execute his attack, Korra was saved and carried away to safety by the dragon bird spirit.",
      "links": [
        {
          "body": "Vaatu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Northern",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/North_Pole",
            "page": "North_Pole"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Entering the Spirit World"
      ],
      "text": "As Korra was about to close the Southern portal, Vaatu called out to her, addressing her as Raava. Facing the spirit of darkness and chaos, she was undeterred when he informed her that he would destroy her during the upcoming Harmonic Convergence, reiterating her goal to close the Southern portal. However, her confidence faltered when Unalaq revealed himself and Jinora as his prisoner. In order to save Jinora's soul, Korra relented and opened the Northern portal. When she demanded the young airbender's release in return, she was promptly attacked by Unalaq, who had retained his bending by entering physically through the Southern portal as opposed to spiritually though meditation. Unable to fight back, Korra tried her best to avoid his water blasts, though was powerless to stop Furry-Foot from taking off with Jinora. As she gave chase, she was snatched up and gnawed at by one of the guardian spirits, who had turned dark again. Incapacitated, she was surrounded by water streams as Unalaq prepared to destroy her soul with his unique waterbending technique. However, before he could fully execute his attack, Korra was saved and carried away to safety by the dragon bird spirit."
    },
    {
      "body": "When she returned to her body in the mortal world, Korra panted in exhaustion, drawing the attention of a worried Tenzin. When he asked her several questions, she could only manage to utter an apology and look at Jinora's still body, whose soul was still trapped in the Spirit World.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Entering the Spirit World"
      ],
      "text": "When she returned to her body in the mortal world, Korra panted in exhaustion, drawing the attention of a worried Tenzin. When he asked her several questions, she could only manage to utter an apology and look at Jinora's still body, whose soul was still trapped in the Spirit World."
    },
    {
      "body": "After relaying the bad news to Pema and her children, Korra, Tenzin, Kya, and Bumi returned to Republic City, where they explained Unalaq's true intentions to Raiko. Despite knowing that the end of the world was due, Raiko decided to hold back the United Forces for fear of an attack on the city.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Return to Republic City"
      ],
      "text": "After relaying the bad news to Pema and her children, Korra, Tenzin, Kya, and Bumi returned to Republic City, where they explained Unalaq's true intentions to Raiko. Despite knowing that the end of the world was due, Raiko decided to hold back the United Forces for fear of an attack on the city."
    },
    {
      "body": "Korra and her friends went to police headquarters, where Mako was being released after being framed by Varrick. Korra ran up and kissed Mako, the dark spirit attack having wiped the memory of their break-up. When Tenzin reminded that they need transportation to the South Pole, Bolin brought them before Varrick, who was being held in a luxurious VIP jail cell. While Korra was initially hostile toward him, she did acknowledge Varrick's defense that despite his questionable actions, he also did some good things, such as warning her about Unalaq's threat. When Varrick offered the team the use of his battleship, the Zhu Li, they accepted and headed toward the South Pole.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Return to Republic City"
      ],
      "text": "Korra and her friends went to police headquarters, where Mako was being released after being framed by Varrick. Korra ran up and kissed Mako, the dark spirit attack having wiped the memory of their break-up. When Tenzin reminded that they need transportation to the South Pole, Bolin brought them before Varrick, who was being held in a luxurious VIP jail cell. While Korra was initially hostile toward him, she did acknowledge Varrick's defense that despite his questionable actions, he also did some good things, such as warning her about Unalaq's threat. When Varrick offered the team the use of his battleship, the Zhu Li, they accepted and headed toward the South Pole."
    },
    {
      "body": "En route back to the South, Korra practiced airbending against a practice dummy. As Tenzin pushed her hard, she vowed to close both portals, keep Vaatu locked away for another ten millennia and \"make Unalaq wish he [had] never been born\". She firebent the dummy's head off and it landed at Mako's feet. After Mako passed the head back to her, he tried to tell her something but was too nervous to say it.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "En route back to the South, Korra practiced airbending against a practice dummy. As Tenzin pushed her hard, she vowed to close both portals, keep Vaatu locked away for another ten millennia and \"make Unalaq wish he [had] never been born\". She firebent the dummy's head off and it landed at Mako's feet. After Mako passed the head back to her, he tried to tell her something but was too nervous to say it."
    },
    {
      "body": "Asami informed everyone that the Southern rebels had been defeated. They traveled to the White Lotus compound, to which the severely-injured rebels had retreated, and where Korra was reunited with her mother, who informed her that her father had been taken prisoner.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "Asami informed everyone that the Southern rebels had been defeated. They traveled to the White Lotus compound, to which the severely-injured rebels had retreated, and where Korra was reunited with her mother, who informed her that her father had been taken prisoner."
    },
    {
      "body": "With the knowledge that the spirit portal was too heavily guarded, Korra and her friends discussed how to break through. Asami came up with a plan for herself, Mako, and Bolin to cause a distraction on a biplane while the others got to the portal on Oogi. As they began their assault, they were met with heavy resistance, not only by Northern soldiers, but dark spirits as well, the latter attaching themselves to Oogi and dragging him down.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "With the knowledge that the spirit portal was too heavily guarded, Korra and her friends discussed how to break through. Asami came up with a plan for herself, Mako, and Bolin to cause a distraction on a biplane while the others got to the portal on Oogi. As they began their assault, they were met with heavy resistance, not only by Northern soldiers, but dark spirits as well, the latter attaching themselves to Oogi and dragging him down."
    },
    {
      "body": "Korra, Kya, and Bumi attempted to fight off the spirits to no avail and they crashed and were soon captured. She was brought to the tent where Tonraq was being held, along with everyone else excluding Bumi. They were visited by Unalaq, who mockingly congratulated them by saying they had gotten \"front row seats to the beginning of the new world order\". Korra pleaded with him to reason, but Unalaq ignored her pleas. He asked if she thought what Wan did was good in banishing the spirits from the world and said that brought nothing but chaos. Unalaq mocked her by saying that there did not need to be a bridge between both worlds and they should all live as one. Korra promised that she would put Vaatu back in his prison if he was released and Unalaq revealed his ultimate goal: When Wan fused with Raava, the balance was unfairly tipped in her favor. Unalaq planned to rectify this and fuse with Vaatu during Harmonic Convergence and become a ${link_0}.",
      "links": [
        {
          "body": "Dark Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_Avatar",
            "page": "Dark_Avatar"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "Korra, Kya, and Bumi attempted to fight off the spirits to no avail and they crashed and were soon captured. She was brought to the tent where Tonraq was being held, along with everyone else excluding Bumi. They were visited by Unalaq, who mockingly congratulated them by saying they had gotten \"front row seats to the beginning of the new world order\". Korra pleaded with him to reason, but Unalaq ignored her pleas. He asked if she thought what Wan did was good in banishing the spirits from the world and said that brought nothing but chaos. Unalaq mocked her by saying that there did not need to be a bridge between both worlds and they should all live as one. Korra promised that she would put Vaatu back in his prison if he was released and Unalaq revealed his ultimate goal: When Wan fused with Raava, the balance was unfairly tipped in her favor. Unalaq planned to rectify this and fuse with Vaatu during Harmonic Convergence and become a Dark Avatar."
    },
    {
      "body": "He left for the spirit portal. Korra tried to reason with her cousins, but they refused to help. She reminded them that Unalaq would not be their father anymore and that they would not be safe from his wrath. Desna firmly denied this and stood behind his father's beliefs that this was right. Suddenly Bumi flew through the tent, proclaiming that help had arrived. The twins approached him but Naga knocked them out and Bumi freed them.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "He left for the spirit portal. Korra tried to reason with her cousins, but they refused to help. She reminded them that Unalaq would not be their father anymore and that they would not be safe from his wrath. Desna firmly denied this and stood behind his father's beliefs that this was right. Suddenly Bumi flew through the tent, proclaiming that help had arrived. The twins approached him but Naga knocked them out and Bumi freed them."
    },
    {
      "body": "Upon reaching the portal, Korra had Asami take Tonraq back to Katara. She split up those remaining into separate groups: Tenzin, Bumi, and Kya went to find Jinora while Bolin and Mako would engage Unalaq and Korra would go to close the portals. When asked if they might become trapped inside the portal if Korra failed, she hesitated to answer and told them to move.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "Upon reaching the portal, Korra had Asami take Tonraq back to Katara. She split up those remaining into separate groups: Tenzin, Bumi, and Kya went to find Jinora while Bolin and Mako would engage Unalaq and Korra would go to close the portals. When asked if they might become trapped inside the portal if Korra failed, she hesitated to answer and told them to move."
    },
    {
      "body": "They made it inside and Unalaq directed dark spirits toward them. Korra sent Tenzin and his siblings off to find Jinora and entered the non-continuous Avatar State and blew them away with airbending. Mako and Bolin held back Unalaq while Korra reached the Southern portal. She tried to close it but was blown backward by a pulse of energy as Harmonic Convergence began, the amplified spirit energies enabling Vaatu to escape from his prison in the Tree of Time.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "They made it inside and Unalaq directed dark spirits toward them. Korra sent Tenzin and his siblings off to find Jinora and entered the non-continuous Avatar State and blew them away with airbending. Mako and Bolin held back Unalaq while Korra reached the Southern portal. She tried to close it but was blown backward by a pulse of energy as Harmonic Convergence began, the amplified spirit energies enabling Vaatu to escape from his prison in the Tree of Time."
    },
    {
      "body": "Korra prevented Vaatu from fusing with Unalaq to create a Dark Avatar, fending the dark spirit off with firebending before using airbending to send Unalaq through the Southern spirit portal to the South Pole. She told Bolin and Mako to keep Unalaq out of the Spirit World, before promptly attacking Vaatu once more. By the Tree of Time, Korra continued to assault Vaatu with bending, but was quickly subdued as Vaatu projected an energy beam and ensnared her with vines.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "Korra prevented Vaatu from fusing with Unalaq to create a Dark Avatar, fending the dark spirit off with firebending before using airbending to send Unalaq through the Southern spirit portal to the South Pole. She told Bolin and Mako to keep Unalaq out of the Spirit World, before promptly attacking Vaatu once more. By the Tree of Time, Korra continued to assault Vaatu with bending, but was quickly subdued as Vaatu projected an energy beam and ensnared her with vines."
    },
    {
      "body": "Using the breath of fire while in the Avatar State, Korra managed to break free from Vaatu's trap, and proceeded to trap him in an elemental sphere. Before she could lock Vaatu back inside the Tree of Time, Korra was attacked by Unalaq, causing the elemental sphere to break and freeing Vaatu once more. Unable to gather enough strength, Korra watched helplessly as Unalaq fused with Vaatu permanently, using the energy from the spirit portals to cement the bond. Unalaq, now a Dark Avatar, declared a new era for spirits and humans, led by himself as the new Avatar. Korra protested, and declared that her era was not over yet, before attacking Unalaq. The two Avatars eventually made their way out of the portal to the South Pole, where they began to battle for the fate of the world. Unalaq managed to knock Korra off her air spout, and trapped her in a fissure on the ground, before crushing the Avatar and declaring her era to be over.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "Using the breath of fire while in the Avatar State, Korra managed to break free from Vaatu's trap, and proceeded to trap him in an elemental sphere. Before she could lock Vaatu back inside the Tree of Time, Korra was attacked by Unalaq, causing the elemental sphere to break and freeing Vaatu once more. Unable to gather enough strength, Korra watched helplessly as Unalaq fused with Vaatu permanently, using the energy from the spirit portals to cement the bond. Unalaq, now a Dark Avatar, declared a new era for spirits and humans, led by himself as the new Avatar. Korra protested, and declared that her era was not over yet, before attacking Unalaq. The two Avatars eventually made their way out of the portal to the South Pole, where they began to battle for the fate of the world. Unalaq managed to knock Korra off her air spout, and trapped her in a fissure on the ground, before crushing the Avatar and declaring her era to be over."
    },
    {
      "body": "Before passing out, Raava told Korra not to give in, and she was able to make her way out of the fissure by entering the Avatar State. The two resumed their battle, with Korra telling Unalaq that he could not win. Korra was able to bring Unalaq down, but before she could subdue him, Vaatu briefly left Unalaq's body and removed Raava from Korra, causing her to fall to the ground. Unalaq trapped Raava in a globule of water, and after Vaatu reentered his body, he grinned in victory.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "Before passing out, Raava told Korra not to give in, and she was able to make her way out of the fissure by entering the Avatar State. The two resumed their battle, with Korra telling Unalaq that he could not win. Korra was able to bring Unalaq down, but before she could subdue him, Vaatu briefly left Unalaq's body and removed Raava from Korra, causing her to fall to the ground. Unalaq trapped Raava in a globule of water, and after Vaatu reentered his body, he grinned in victory."
    },
    {
      "body": "Despite their efforts to save Raava, Bolin and Mako were overwhelmed by Unalaq's bending, and were unconscious while Korra watched helplessly as Unalaq began to destroy the Light Spirit, severing Korra's connection to her past lives in the process. With a final blow, Unalaq destroyed Raava. Unalaq transformed into a massive dark spirit and used the spirit lights to travel to Republic City. Korra and her friends were brought back to the Spirit World by Tenzin and his siblings, where Kya used spirit water to heal them.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "Despite their efforts to save Raava, Bolin and Mako were overwhelmed by Unalaq's bending, and were unconscious while Korra watched helplessly as Unalaq began to destroy the Light Spirit, severing Korra's connection to her past lives in the process. With a final blow, Unalaq destroyed Raava. Unalaq transformed into a massive dark spirit and used the spirit lights to travel to Republic City. Korra and her friends were brought back to the Spirit World by Tenzin and his siblings, where Kya used spirit water to heal them."
    },
    {
      "body": "Once recovered, Korra lamented her failure, as Raava's destruction had left her as the last Avatar and broke into tears. At Kya's urging, Tenzin brought her to the ${link_0}, where many of Korra's memories were projected inside its hollow. As an image of Wan was projected, Korra was reminded by Tenzin that it was not Raava that defined her, but her own spirit, saying that she had always been strong and fearless. Upon seeing an image of Unalaq laying waste to Republic City, Korra followed Tenzin's advice to meditate on the cosmic energy of the universe, and recalled what Raava told Wan about how light cannot exist without darkness. In doing so, her spirit manifested outside her body, and traveled to confront Unalaq. In their battle, she attempted to find Raava within Vaatu, but the Dark Avatar claimed that she was destroyed.",
      "links": [
        {
          "body": "Tree of Time",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "Once recovered, Korra lamented her failure, as Raava's destruction had left her as the last Avatar and broke into tears. At Kya's urging, Tenzin brought her to the Tree of Time, where many of Korra's memories were projected inside its hollow. As an image of Wan was projected, Korra was reminded by Tenzin that it was not Raava that defined her, but her own spirit, saying that she had always been strong and fearless. Upon seeing an image of Unalaq laying waste to Republic City, Korra followed Tenzin's advice to meditate on the cosmic energy of the universe, and recalled what Raava told Wan about how light cannot exist without darkness. In doing so, her spirit manifested outside her body, and traveled to confront Unalaq. In their battle, she attempted to find Raava within Vaatu, but the Dark Avatar claimed that she was destroyed."
    },
    {
      "body": "He came close to corrupting Korra's spirit once, only for a ${link_0} of Jinora to appear and interrupt the process, revealing the new Raava within Unalaq. Korra pulled the Light Spirit out, before employing the pacification technique to purify Unalaq, thereby destroying him. With Harmonic Convergence nearing its end, Korra, Raava, and Jinora returned to the Spirit World, saving their friends defending Korra's body from dark spirits. She and Raava fused back together as the convergence ended.",
      "links": [
        {
          "body": "spiritual projection",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spiritual_projection",
            "page": "Spiritual_projection"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "He came close to corrupting Korra's spirit once, only for a spiritual projection of Jinora to appear and interrupt the process, revealing the new Raava within Unalaq. Korra pulled the Light Spirit out, before employing the pacification technique to purify Unalaq, thereby destroying him. With Harmonic Convergence nearing its end, Korra, Raava, and Jinora returned to the Spirit World, saving their friends defending Korra's body from dark spirits. She and Raava fused back together as the convergence ended."
    },
    {
      "body": "As everyone congratulated Korra, she addressed her cousins and gave her sympathy about their father, to which they responded that they would not miss their father due to his misdeeds and because he never truly cared for them.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "Harmonic Convergence"
      ],
      "text": "As everyone congratulated Korra, she addressed her cousins and gave her sympathy about their father, to which they responded that they would not miss their father due to his misdeeds and because he never truly cared for them."
    },
    {
      "body": "As she and Tenzin head to the Northern portal, she lamented that despite being connected to Raava, she still had lost her connection to her past lives. She moved to close the portal, only to hesitate, considering that Unalaq may have been right about Wan keeping both worlds apart. With Tenzin encouraging her to do what she felt was right, Korra chose not to close the portals.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "A New Era"
      ],
      "text": "As she and Tenzin head to the Northern portal, she lamented that despite being connected to Raava, she still had lost her connection to her past lives. She moved to close the portal, only to hesitate, considering that Unalaq may have been right about Wan keeping both worlds apart. With Tenzin encouraging her to do what she felt was right, Korra chose not to close the portals."
    },
    {
      "body": "Returning to the physical world, Mako approached Korra, explaining the truth about their fight. Korra admitted that she had regained that memory while in the Tree of Time. Mako explained that the reason he did not tell her was because he did not want to hurt her and a part of him wished that fight never happened. Korra explained to Mako that they had different goals in life, and what they had will never work out, thus ending their relationship. Korra kissed Mako one last time, and they told each other that they would always love one another.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "A New Era"
      ],
      "text": "Returning to the physical world, Mako approached Korra, explaining the truth about their fight. Korra admitted that she had regained that memory while in the Tree of Time. Mako explained that the reason he did not tell her was because he did not want to hurt her and a part of him wished that fight never happened. Korra explained to Mako that they had different goals in life, and what they had will never work out, thus ending their relationship. Korra kissed Mako one last time, and they told each other that they would always love one another."
    },
    {
      "body": "Later on, Korra publicly addressed the Southern Water Tribe, declaring that with Unalaq's defeat, the civil war of the Water Tribes was over and the South was now independent. Korra explained that the Council of Elders decided to make Tonraq the new chief, and that she left both portals open so peace can be brought to both worlds; spirits could visit the human world and humans could visit the Spirit World. She declared she would no longer be the bridge between both worlds, and that a new age had begun as spirits freely roam around the physical world once more.",
      "links": [],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "A New Era"
      ],
      "text": "Later on, Korra publicly addressed the Southern Water Tribe, declaring that with Unalaq's defeat, the civil war of the Water Tribes was over and the South was now independent. Korra explained that the Council of Elders decided to make Tonraq the new chief, and that she left both portals open so peace can be brought to both worlds; spirits could visit the human world and humans could visit the Spirit World. She declared she would no longer be the bridge between both worlds, and that a new age had begun as spirits freely roam around the physical world once more."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "See also"
      ],
      "text": "Korra"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Korra (153 AG - 170 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Korra_(153_AG_-_170_AG)",
            "page": "History_of_Korra_(153_AG_-_170_AG)"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "See also"
      ],
      "text": "History of Korra (153 AG - 170 AG)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Korra (late 171 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Korra_(late_171_AG)",
            "page": "History_of_Korra_(late_171_AG)"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "See also"
      ],
      "text": "History of Korra (late 171 AG)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Korra (171 - 173 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Korra#171_-_173_AG",
            "page": "Korra"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "See also"
      ],
      "text": "History of Korra (171 - 173 AG)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Korra (174 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Korra_(174_AG)",
            "page": "History_of_Korra_(174_AG)"
          }
        }
      ],
      "section": [
        "History of Korra (171 AG - Harmonic Convergence)",
        "See also"
      ],
      "text": "History of Korra (174 AG)"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Korra_(171_AG_-_Harmonic_Convergence)",
    "file": "avatar.wikia.com/wiki/History_of_Korra_(171_AG_-_Harmonic_Convergence).html",
    "page": "History_of_Korra_(171_AG_-_Harmonic_Convergence)",
    "title": "History of Korra (171 AG - Harmonic Convergence)"
  }
}