{
  "categories": [
    {
      "body": "Azula",
      "target": {
        "href": "Category_Azula",
        "page": "Category_Azula"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "href": "Category_Character_histories",
        "page": "Category_Character_histories"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "After ${link_0} ${link_1} sent her on a mission to capture her ${link_2} and ${link_3}, ${link_4} formed a small and elite team composed of her two closest friends, ${link_5} and ${link_6}. During their pursuit, they encountered ${link_7} and established them as a prime target.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_1}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "brother",
          "key": "${link_2}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "uncle",
          "key": "${link_3}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Azula",
          "key": "${link_4}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Mai",
          "key": "${link_5}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_6}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_7}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "After Fire Lord Ozai sent her on a mission to capture her brother and uncle, Azula formed a small and elite team composed of her two closest friends, Mai and Ty Lee. During their pursuit, they encountered Team Avatar and established them as a prime target."
    },
    {
      "body": "${link_0} tricked ${link_1} into returning to the ${link_2}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Fire Nation Capital",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        }
      ],
      "text": "Azula tricked Zuko into returning to the Fire Nation Capital."
    },
    {
      "body": "When Fire Lord Ozai branded Iroh a traitor and her brother Zuko a failure, Azula willingly obeyed her father's command to capture them. While en route, she worked toward perfecting her ability to ${link_0} with the aid of her advisers and teachers, ${link_1}. Azula eventually found Zuko and Iroh in a ${link_2} and attempted to capture them both, luring Zuko with the false promise of being accepted home with open arms. Zuko believed his sister, but Iroh was skeptical, and though he boarded the ${link_3} with Zuko, he remained incredulous and vigilant. After the ${link_4} accidentally referred to Zuko and Iroh as prisoners, Zuko became enraged and began dueling Azula. She easily evaded his attacks and struck back with taunts and brief attacks. She almost managed to fire a bolt of lightning at him in an attempt to finish him off, however Iroh intervened. He ${link_5} toward a nearby cliff, kicked her off her ship, and proceeded to flee from the resort with Zuko. Soon after, she threatened the local ${link_6} villagers with cruel punishment from the Fire Lord should one of them harbor the traitors.",
      "links": [
        {
          "body": "create lightning",
          "key": "${link_0}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "Lo and Li",
          "key": "${link_1}",
          "target": {
            "href": "Lo_and_Li",
            "page": "Lo_and_Li"
          }
        },
        {
          "body": "village resort",
          "key": "${link_2}",
          "target": {
            "href": "Village_resort",
            "page": "Village_resort"
          }
        },
        {
          "body": "ship",
          "key": "${link_3}",
          "target": {
            "href": "Royal_barge",
            "page": "Royal_barge"
          }
        },
        {
          "body": "captain",
          "key": "${link_4}",
          "target": {
            "href": "Azula%27s_ship_captain",
            "page": "Azula%27s_ship_captain"
          }
        },
        {
          "body": "redirected the lightning",
          "key": "${link_5}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_6}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "When Fire Lord Ozai branded Iroh a traitor and her brother Zuko a failure, Azula willingly obeyed her father's command to capture them. While en route, she worked toward perfecting her ability to create lightning with the aid of her advisers and teachers, Lo and Li. Azula eventually found Zuko and Iroh in a village resort and attempted to capture them both, luring Zuko with the false promise of being accepted home with open arms. Zuko believed his sister, but Iroh was skeptical, and though he boarded the ship with Zuko, he remained incredulous and vigilant. After the captain accidentally referred to Zuko and Iroh as prisoners, Zuko became enraged and began dueling Azula. She easily evaded his attacks and struck back with taunts and brief attacks. She almost managed to fire a bolt of lightning at him in an attempt to finish him off, however Iroh intervened. He redirected the lightning toward a nearby cliff, kicked her off her ship, and proceeded to flee from the resort with Zuko. Soon after, she threatened the local Earth Kingdom villagers with cruel punishment from the Fire Lord should one of them harbor the traitors."
    },
    {
      "body": "After being advised by her twin masters that traveling with the ${link_0} was not a wise choice, Azula agreed and decided to abandon the unit, opting to find and recruit her two childhood friends. She first attempted to recruit Ty Lee, but the acrobat initially declined the offer because she enjoyed her life at the ${link_1}. To convince her to leave, Azula attended her performance that night and ordered the ${link_2} to set Ty Lee's safety net on fire and release the circus' dangerous animals, scaring the young performer. Azula met Ty Lee after the performance, and her friend agreed to join her mission, telling her that \"the universe [had] given [her] strong hints that it [was] time for a career change.\" The two traveled to ${link_3}, where Azula had an easier time recruiting Mai, who was willing to leave the boredom of the conquered city in favor of going on an exciting hunt. While in the city, Azula met with ${link_4} to discuss matters of the city and berated him for his failure at his task of governing the city. After this, she renamed Omashu as the city of New Ozai in honor of her father.",
      "links": [
        {
          "body": "Royal Procession",
          "key": "${link_0}",
          "target": {
            "href": "Royal_Procession",
            "page": "Royal_Procession"
          }
        },
        {
          "body": "circus",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_circus",
            "page": "Fire_Nation_circus"
          }
        },
        {
          "body": "circus master",
          "key": "${link_2}",
          "target": {
            "href": "Circus_master",
            "page": "Circus_master"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_3}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "Ukano",
          "key": "${link_4}",
          "target": {
            "href": "Ukano",
            "page": "Ukano"
          }
        }
      ],
      "text": "After being advised by her twin masters that traveling with the Royal Procession was not a wise choice, Azula agreed and decided to abandon the unit, opting to find and recruit her two childhood friends. She first attempted to recruit Ty Lee, but the acrobat initially declined the offer because she enjoyed her life at the circus. To convince her to leave, Azula attended her performance that night and ordered the circus master to set Ty Lee's safety net on fire and release the circus' dangerous animals, scaring the young performer. Azula met Ty Lee after the performance, and her friend agreed to join her mission, telling her that \"the universe [had] given [her] strong hints that it [was] time for a career change.\" The two traveled to Omashu, where Azula had an easier time recruiting Mai, who was willing to leave the boredom of the conquered city in favor of going on an exciting hunt. While in the city, Azula met with Ukano to discuss matters of the city and berated him for his failure at his task of governing the city. After this, she renamed Omashu as the city of New Ozai in honor of her father."
    },
    {
      "body": "${link_0} left ${link_1} with ${link_2} and ${link_3}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "New Ozai",
          "key": "${link_1}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "Mai",
          "key": "${link_2}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_3}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "text": "Azula left New Ozai with Mai and Ty Lee."
    },
    {
      "body": "While in the city, Azula first encountered the ${link_0}, ${link_1}. She and her new allies were almost able to defeat Aang and his friends, but their overall unpreparedness, not being able to work as a team, and a trump card delivered by a shrewd ${link_2} ${link_3} enabled Team Avatar the time needed to escape the city. Soon after the battle, she and her friends left the city and named the Avatar as a new target in addition to capturing her brother and uncle.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "King",
          "key": "${link_2}",
          "target": {
            "href": "King_of_Omashu",
            "page": "King_of_Omashu"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_3}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        }
      ],
      "text": "While in the city, Azula first encountered the Avatar, Aang. She and her new allies were almost able to defeat Aang and his friends, but their overall unpreparedness, not being able to work as a team, and a trump card delivered by a shrewd King Bumi enabled Team Avatar the time needed to escape the city. Soon after the battle, she and her friends left the city and named the Avatar as a new target in addition to capturing her brother and uncle."
    },
    {
      "body": "${link_0} Azula and her two friends relentlessly pursued the Avatar's group, using a highly advanced ${link_1} ${link_2} and three ${link_3} as mounts to pursue them night and day. After wearing down the foursome, Azula decided they should split up after uncovering Aang's deception to lead the team off course. Azula encountered the Avatar in ${link_4} and prepared to fight him; however, she was interrupted by her brother Zuko, who had tracked them and had his own plans for capturing Aang. Azula fought the two boys and, despite the fact that most of her opponents' attack were concentrated on her, she dominated the fight, easily landing a knockout blow on Zuko and later trapping Aang beneath some fallen rubble. Victory was denied to her, however, when ${link_5}, ${link_6} and ${link_7} showed up to rescue Aang, while Iroh arrived to help Zuko. Cornered, she claimed she would be willing to give in, saying that \"a princess surrenders with honor\", but to everyone's surprise and dismay, Azula took advantage of Iroh momentarily being off guard and seriously wounded him with a bolt of blue fire. She was able to escape as the four ${link_8} attacked with their respective elements.",
      "links": [
        {
          "body": "Princess",
          "key": "${link_0}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "tank train",
          "key": "${link_2}",
          "target": {
            "href": "Tank_train",
            "page": "Tank_train"
          }
        },
        {
          "body": "mongoose lizards",
          "key": "${link_3}",
          "target": {
            "href": "Mongoose_lizard",
            "page": "Mongoose_lizard"
          }
        },
        {
          "body": "an abandoned town",
          "key": "${link_4}",
          "target": {
            "href": "Tu_Zin",
            "page": "Tu_Zin"
          }
        },
        {
          "body": "Katara",
          "key": "${link_5}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_6}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Toph",
          "key": "${link_7}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "benders",
          "key": "${link_8}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "Princess Azula and her two friends relentlessly pursued the Avatar's group, using a highly advanced Fire Nation tank train and three mongoose lizards as mounts to pursue them night and day. After wearing down the foursome, Azula decided they should split up after uncovering Aang's deception to lead the team off course. Azula encountered the Avatar in an abandoned town and prepared to fight him; however, she was interrupted by her brother Zuko, who had tracked them and had his own plans for capturing Aang. Azula fought the two boys and, despite the fact that most of her opponents' attack were concentrated on her, she dominated the fight, easily landing a knockout blow on Zuko and later trapping Aang beneath some fallen rubble. Victory was denied to her, however, when Katara, Sokka and Toph showed up to rescue Aang, while Iroh arrived to help Zuko. Cornered, she claimed she would be willing to give in, saying that \"a princess surrenders with honor\", but to everyone's surprise and dismay, Azula took advantage of Iroh momentarily being off guard and seriously wounded him with a bolt of blue fire. She was able to escape as the four benders attacked with their respective elements."
    },
    {
      "body": "${link_0} attempted to stop ${link_1} from destroying the ${link_2}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Fire Nation drill",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        }
      ],
      "text": "Azula attempted to stop Aang from destroying the Fire Nation drill."
    },
    {
      "body": "A few weeks later, Azula and her allies oversaw ${link_0} ${link_1}'s efforts to use a ${link_2} to break through the Outer Wall of ${link_3}. When the engineers reported an accident involving an ambushed engineer, stolen drill schematics, and further sabotage, Azula realized it was the work of the Avatar. Upon finding Aang, Katara, and Sokka attempting to break the engine's braces, Azula forced Aang and his gang to quickly flee. She sent Mai and Ty Lee after Katara and Sokka while she followed Aang, once again claiming personal ownership over the Avatar's capture. She caught Aang trying to bore a hole at the top of the drill and they began a brutal match. Her ${link_4} nearly overwhelmed the young Avatar, but he continued to fight as the drill bored its way through the wall. The fight ended in a rather undignified manner when the drill's slurry pipes burst and Azula collided with Aang; both nearly fell off the drill. Azula tried to regain the advantage, but Aang was faster, as by the time she had recovered, he was already on his way up the wall to land a powerful final blow to destroy the drill. Azula gave one final strike with flame, but was a second too slow. Aang's powerful impact on the earthen wedge destroyed the drill and knocked Azula away, marking the Fire Nation's defeat.",
      "links": [
        {
          "body": "War Minister",
          "key": "${link_0}",
          "target": {
            "href": "War_Minister",
            "page": "War_Minister"
          }
        },
        {
          "body": "Qin",
          "key": "${link_1}",
          "target": {
            "href": "Qin",
            "page": "Qin"
          }
        },
        {
          "body": "giant drill",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "firebending",
          "key": "${link_4}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "A few weeks later, Azula and her allies oversaw War Minister Qin's efforts to use a giant drill to break through the Outer Wall of Ba Sing Se. When the engineers reported an accident involving an ambushed engineer, stolen drill schematics, and further sabotage, Azula realized it was the work of the Avatar. Upon finding Aang, Katara, and Sokka attempting to break the engine's braces, Azula forced Aang and his gang to quickly flee. She sent Mai and Ty Lee after Katara and Sokka while she followed Aang, once again claiming personal ownership over the Avatar's capture. She caught Aang trying to bore a hole at the top of the drill and they began a brutal match. Her firebending nearly overwhelmed the young Avatar, but he continued to fight as the drill bored its way through the wall. The fight ended in a rather undignified manner when the drill's slurry pipes burst and Azula collided with Aang; both nearly fell off the drill. Azula tried to regain the advantage, but Aang was faster, as by the time she had recovered, he was already on his way up the wall to land a powerful final blow to destroy the drill. Azula gave one final strike with flame, but was a second too slow. Aang's powerful impact on the earthen wedge destroyed the drill and knocked Azula away, marking the Fire Nation's defeat."
    },
    {
      "body": "${link_0} performed a horizontal mid-air spin, simultaneously avoiding ${link_1}'s sword thrust.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Suki",
          "key": "${link_1}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        }
      ],
      "text": "Azula performed a horizontal mid-air spin, simultaneously avoiding Suki's sword thrust."
    },
    {
      "body": "Following this incident, Azula began hunting for ${link_0}, following his trail of fur. When the princess and her companions finally came across him, he was in a forest clearing being tended to by a group of female warriors—the ${link_1}. After a few snide remarks in which she dismissed the warriors as the Avatar's \"fan girls\", Azula and her friends initiated a fight. Azula engaged ${link_2} in a swift one-on-one battle and managed to disarm the warrior and kick her to the ground; however, she was distracted by another Kyoshi Warrior and turned to fight her instead. By the time she returned to Suki, Suki had already driven Appa off with a flaming branch. Suki proceeded to take a firm stance, whereas Azula condescendingly teased her again, before rushing in to battle—the girls clashed, but the rest of the fight was left unseen.",
      "links": [
        {
          "body": "the Avatar's bison",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Suki",
          "key": "${link_2}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        }
      ],
      "text": "Following this incident, Azula began hunting for the Avatar's bison, following his trail of fur. When the princess and her companions finally came across him, he was in a forest clearing being tended to by a group of female warriors—the Kyoshi Warriors. After a few snide remarks in which she dismissed the warriors as the Avatar's \"fan girls\", Azula and her friends initiated a fight. Azula engaged Suki in a swift one-on-one battle and managed to disarm the warrior and kick her to the ground; however, she was distracted by another Kyoshi Warrior and turned to fight her instead. By the time she returned to Suki, Suki had already driven Appa off with a flaming branch. Suki proceeded to take a firm stance, whereas Azula condescendingly teased her again, before rushing in to battle—the girls clashed, but the rest of the fight was left unseen."
    },
    {
      "body": "Later, it was revealed that the Kyoshi Warriors did not claim victory in this battle, as Azula and her team had stolen some of their attire and disguised themselves as Kyoshi Warriors, thereby successfully deceiving the ${link_0} and infiltrating the city.",
      "links": [
        {
          "body": "Earth King",
          "key": "${link_0}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "Later, it was revealed that the Kyoshi Warriors did not claim victory in this battle, as Azula and her team had stolen some of their attire and disguised themselves as Kyoshi Warriors, thereby successfully deceiving the Earth King and infiltrating the city."
    },
    {
      "body": "Shortly after, the Earth King revealed that he was having a troubling week with ${link_0} and the ${link_1} planning to take over. Azula's initial smug amusement at the irony of the situation turned to a sudden concern when he revealed the Earth Kingdom's plan to ${link_2} on the ${link_3}. Azula was visibly caught off-guard by this information and immediately began to consider what to do.",
      "links": [
        {
          "body": "Long Feng",
          "key": "${link_0}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_1}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "invade the Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        },
        {
          "body": "day of a solar eclipse",
          "key": "${link_3}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        }
      ],
      "text": "Shortly after, the Earth King revealed that he was having a troubling week with Long Feng and the Dai Li planning to take over. Azula's initial smug amusement at the irony of the situation turned to a sudden concern when he revealed the Earth Kingdom's plan to invade the Fire Nation on the day of a solar eclipse. Azula was visibly caught off-guard by this information and immediately began to consider what to do."
    },
    {
      "body": "${link_0}, ${link_1}, and ${link_2} disguised themselves as the ${link_3}, successfully infiltrating the ${link_4} circle of trust.",
      "links": [
        {
          "body": "Ty Lee",
          "key": "${link_0}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Mai",
          "key": "${link_2}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_3}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Earth King's",
          "key": "${link_4}",
          "target": {
            "href": "Kuei",
            "page": "Kuei"
          }
        }
      ],
      "text": "Ty Lee, Azula, and Mai disguised themselves as the Kyoshi Warriors, successfully infiltrating the Earth King's circle of trust."
    },
    {
      "body": "Afterward, she confided to Ty Lee and Mai that she planned to take control of the Dai Li and ${link_0}. She developed a plan to inform the Dai Li of their true nature and thus spread the word on to their leader, Long Feng. The plan was successful, and Azula was taken by Dai Li agents in the middle of the night to Long Feng, who struck a deal with her. He gave her control of the Dai Li to overthrow the government in exchange for the Avatar.",
      "links": [
        {
          "body": "take down Ba Sing Se from the inside",
          "key": "${link_0}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        }
      ],
      "text": "Afterward, she confided to Ty Lee and Mai that she planned to take control of the Dai Li and take down Ba Sing Se from the inside. She developed a plan to inform the Dai Li of their true nature and thus spread the word on to their leader, Long Feng. The plan was successful, and Azula was taken by Dai Li agents in the middle of the night to Long Feng, who struck a deal with her. He gave her control of the Dai Li to overthrow the government in exchange for the Avatar."
    },
    {
      "body": "Meanwhile, Katara discovered that Zuko and Iroh were in the city and approached Azula, thinking her to be Suki, informing her of her brother's presence. Azula revealed herself, and before Katara could warn anyone, Ty Lee took the young ${link_0} down. Azula proceeded to lock her in the ${link_1} beneath the city and have a \"family reunion\" by sending a letter to Iroh and Zuko, telling them that the Earth King wished for them to serve him tea. Near the beginning of coup, the pair fell into her trap and became surrounded by Dai Li agents. Iroh managed to escape them and the palace—Zuko, on the other hand, chose to stay behind to face Azula, challenging her to an ${link_2}. His sister nonchalantly turned him down, and he was subsequently overwhelmed by the Dai Li. He was later imprisoned in the same dungeon as Katara.",
      "links": [
        {
          "body": "waterbender",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Crystal Catacombs",
          "key": "${link_1}",
          "target": {
            "href": "Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_2}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        }
      ],
      "text": "Meanwhile, Katara discovered that Zuko and Iroh were in the city and approached Azula, thinking her to be Suki, informing her of her brother's presence. Azula revealed herself, and before Katara could warn anyone, Ty Lee took the young waterbender down. Azula proceeded to lock her in the Crystal Catacombs beneath the city and have a \"family reunion\" by sending a letter to Iroh and Zuko, telling them that the Earth King wished for them to serve him tea. Near the beginning of coup, the pair fell into her trap and became surrounded by Dai Li agents. Iroh managed to escape them and the palace—Zuko, on the other hand, chose to stay behind to face Azula, challenging her to an Agni Kai. His sister nonchalantly turned him down, and he was subsequently overwhelmed by the Dai Li. He was later imprisoned in the same dungeon as Katara."
    },
    {
      "body": "Finally, Azula unleashed her coup upon the city. She had the Dai Li arrest the ${link_0}, the Earth King's highest ranking generals, while she personally captured the Earth King. Sokka and Toph were arrested as well while attempting to warn the Earth King of the danger, and Azula sent them off to a separate dungeon. Immediately afterward, Long Feng arrived on the scene and commanded the Dai Li to arrest Azula, smugly proclaiming a double-cross. The laugh was all Azula's, though, as she gleefully explained that the Dai Li were so impressed by her that they no longer knew who to follow. In fact, a Dai Li agent had remarked earlier to Long Feng that Azula was \"both terrifying and inspirational at the same time\", a perfect example of her talents. In a smug and verbose speech, she denounced him for his lack of the divine right to rule—something she possessed and boasted about. She ended by commanding Long Feng to bow to her since he could not compete with somebody born to rule. He grudgingly obliged, saying that she had beaten him at his own game. She scathingly replied that he was \"never even a player\".",
      "links": [
        {
          "body": "Council of Five",
          "key": "${link_0}",
          "target": {
            "href": "Council_of_Five",
            "page": "Council_of_Five"
          }
        }
      ],
      "text": "Finally, Azula unleashed her coup upon the city. She had the Dai Li arrest the Council of Five, the Earth King's highest ranking generals, while she personally captured the Earth King. Sokka and Toph were arrested as well while attempting to warn the Earth King of the danger, and Azula sent them off to a separate dungeon. Immediately afterward, Long Feng arrived on the scene and commanded the Dai Li to arrest Azula, smugly proclaiming a double-cross. The laugh was all Azula's, though, as she gleefully explained that the Dai Li were so impressed by her that they no longer knew who to follow. In fact, a Dai Li agent had remarked earlier to Long Feng that Azula was \"both terrifying and inspirational at the same time\", a perfect example of her talents. In a smug and verbose speech, she denounced him for his lack of the divine right to rule—something she possessed and boasted about. She ended by commanding Long Feng to bow to her since he could not compete with somebody born to rule. He grudgingly obliged, saying that she had beaten him at his own game. She scathingly replied that he was \"never even a player\"."
    },
    {
      "body": "${link_0} engaged ${link_1} at full throttle.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Azula engaged Aang at full throttle."
    },
    {
      "body": "Azula appeared in the Catacombs' prison cell after Aang and Iroh found Katara and Zuko. Aang and Katara had been sent off by Iroh to find Sokka and Toph while he remained behind for a moment with Zuko. Once alone, he tried to persuade Zuko to follow his lead and choose good. However, his choice was made complicated when Azula suddenly entered. Using the Dai Li to immobilize Iroh, she put her tongue and wit to the ultimate test, promising that their father would restore Zuko's honor and that she needed him—she promised him everything if he would help her. She closed the argument by leaving him to choose his own destiny and went to battle Katara and the Avatar. However, things were not going in her favor during the beginning of the battle, as her attacks could not break through their defense, and she found herself surrounded on both sides by Aang and Katara. Just when it seemed that she might lose the battle, her work came to fruition. Zuko arrived, and after a moment of consideration, chose to attack the Avatar, triggering a long battle to ensue. After some time, Azula attacked Katara, but only to be held back in a dire predicament with one leg and one arm immobilized in water. Azula was saved by Zuko's timely intervention, and she gave him an approving look before proceeding to fight the Avatar. After disabling him, she moved to end the stalemate between her brother and Katara. Together, she and Zuko easily overwhelmed the waterbender. The Dai Li joined them within a few moments, and Azula and her brother appeared unstoppable.",
      "links": [],
      "text": "Azula appeared in the Catacombs' prison cell after Aang and Iroh found Katara and Zuko. Aang and Katara had been sent off by Iroh to find Sokka and Toph while he remained behind for a moment with Zuko. Once alone, he tried to persuade Zuko to follow his lead and choose good. However, his choice was made complicated when Azula suddenly entered. Using the Dai Li to immobilize Iroh, she put her tongue and wit to the ultimate test, promising that their father would restore Zuko's honor and that she needed him—she promised him everything if he would help her. She closed the argument by leaving him to choose his own destiny and went to battle Katara and the Avatar. However, things were not going in her favor during the beginning of the battle, as her attacks could not break through their defense, and she found herself surrounded on both sides by Aang and Katara. Just when it seemed that she might lose the battle, her work came to fruition. Zuko arrived, and after a moment of consideration, chose to attack the Avatar, triggering a long battle to ensue. After some time, Azula attacked Katara, but only to be held back in a dire predicament with one leg and one arm immobilized in water. Azula was saved by Zuko's timely intervention, and she gave him an approving look before proceeding to fight the Avatar. After disabling him, she moved to end the stalemate between her brother and Katara. Together, she and Zuko easily overwhelmed the waterbender. The Dai Li joined them within a few moments, and Azula and her brother appeared unstoppable."
    },
    {
      "body": "${link_0} ${link_1} ${link_2} whilst he was in the ${link_3}, marking the fall of ${link_4}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "shot",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_3}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_4}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "Azula shot Aang whilst he was in the Avatar State, marking the fall of Ba Sing Se."
    },
    {
      "body": "Aang closed himself off in a chamber of crystal; the rest of the room stared as he entered the ${link_0}. However, Azula positioned herself behind the Avatar and used her lightning to strike the Avatar in the back before he could unleash his own assault. She would have successfully severed the ${link_1} if not for Katara's timely recovery and swift waterbending; all the same, the Avatar was unable to fight, and Azula and Zuko were unquestionably the victors. As the siblings approached the defeated duo, though, they were blocked by the appearance of Iroh. He temporarily held off Azula, Zuko, and the Dai Li, allowing himself to be captured once Katara had made her escape with Aang. Later, in the Earth King's throne room, Azula assured a concerned Zuko that he had restored his honor by joining her, and that Iroh had been the one who had betrayed him—not the other way around. His honor was restored, she explained, for after a hundred years, she and Zuko had finally conquered the Earth Kingdom city of Ba Sing Se.",
      "links": [
        {
          "body": "Avatar State",
          "key": "${link_0}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Avatar Cycle",
          "key": "${link_1}",
          "target": {
            "href": "Avatar#Avatar_Cycle",
            "page": "Avatar"
          }
        }
      ],
      "text": "Aang closed himself off in a chamber of crystal; the rest of the room stared as he entered the Avatar State. However, Azula positioned herself behind the Avatar and used her lightning to strike the Avatar in the back before he could unleash his own assault. She would have successfully severed the Avatar Cycle if not for Katara's timely recovery and swift waterbending; all the same, the Avatar was unable to fight, and Azula and Zuko were unquestionably the victors. As the siblings approached the defeated duo, though, they were blocked by the appearance of Iroh. He temporarily held off Azula, Zuko, and the Dai Li, allowing himself to be captured once Katara had made her escape with Aang. Later, in the Earth King's throne room, Azula assured a concerned Zuko that he had restored his honor by joining her, and that Iroh had been the one who had betrayed him—not the other way around. His honor was restored, she explained, for after a hundred years, she and Zuko had finally conquered the Earth Kingdom city of Ba Sing Se."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Azula_(Spring_100_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Azula_(Spring_100_AG).html",
    "page": "History_of_Azula_(Spring_100_AG)",
    "title": "History of Azula (Spring 100 AG)"
  }
}