{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character histories",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_histories",
        "page": "Category_Character_histories"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)"
      ],
      "text": ""
    },
    {
      "body": "${link_0} was orphaned when he was eight years old and was forced to take care of his younger brother, ${link_1}, in any way possible. This led him to run small-time scams, an attitude which brought him in contact with the ${link_2}, until he and Bolin were taken in by ${link_3}, who offered the brothers a place to stay and a purpose, namely becoming professional ${link_4}.",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Triple Threat Triad",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "Toza",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Toza",
            "page": "Toza"
          }
        },
        {
          "body": "pro-benders",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending",
            "page": "Pro-bending"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)"
      ],
      "text": "Mako was orphaned when he was eight years old and was forced to take care of his younger brother, Bolin, in any way possible. This led him to run small-time scams, an attitude which brought him in contact with the Triple Threat Triad, until he and Bolin were taken in by Toza, who offered the brothers a place to stay and a purpose, namely becoming professional pro-benders."
    },
    {
      "body": "At first, Mako scarcely acknowledged ${link_0}, assuming she was just another one of Bolin's \"fangirls\". This caused the two of them to have an initial bitterness toward one another; however, he impressed Korra when he single-handedly defeated the ${link_1} in the third round of a pro-bending match. Still, he seemed indifferent to Korra's presence even after he learned that she was the ${link_2}, though he did acknowledge her bending abilities after witnessing her quick learning of earthbending from his younger brother.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Golden Temple Tigerdillos",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Golden_Temple_Tigerdillos",
            "page": "Golden_Temple_Tigerdillos"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Meeting Avatar Korra"
      ],
      "text": "At first, Mako scarcely acknowledged Korra, assuming she was just another one of Bolin's \"fangirls\". This caused the two of them to have an initial bitterness toward one another; however, he impressed Korra when he single-handedly defeated the Golden Temple Tigerdillos in the third round of a pro-bending match. Still, he seemed indifferent to Korra's presence even after he learned that she was the Avatar, though he did acknowledge her bending abilities after witnessing her quick learning of earthbending from his younger brother."
    },
    {
      "body": "When Hasook did not show up for the final match prior to the tournament, Mako rejected Korra's offer to join the team, saying he would rather be disqualified than be made a fool. However, Korra and Bolin ignored Mako's objections and Korra joined the team, much to Mako's annoyance. Korra had trouble picking up on the rules at first and infuriated Mako due to her lack of understanding; however, after Korra held her own against a barrage in round three, enabling them to win the match with a knockout, Mako thanked her, and for the first time he truly accepted and complimented her.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Meeting Avatar Korra"
      ],
      "text": "When Hasook did not show up for the final match prior to the tournament, Mako rejected Korra's offer to join the team, saying he would rather be disqualified than be made a fool. However, Korra and Bolin ignored Mako's objections and Korra joined the team, much to Mako's annoyance. Korra had trouble picking up on the rules at first and infuriated Mako due to her lack of understanding; however, after Korra held her own against a barrage in round three, enabling them to win the match with a knockout, Mako thanked her, and for the first time he truly accepted and complimented her."
    },
    {
      "body": "Later, Mako, Bolin, and Korra were practicing for the tournament early in the morning when ${link_0}, the director of the league, came to give the team their winnings from the last match. However, Mako saw this ${link_1} disappear as swiftly as it came, as Butakha immediately deducted their arrears and informed the team that they had to pay thirty thousand yuans for the championship pot in order to compete in the tournament, or they would be disqualified. Bolin suggested that he could get ${link_2} to perform circus tricks at ${link_3}, but Mako shot this idea down, commenting that he would figure something out as usual, and found work at a ${link_4}. When he returned to the arena after a hard day's work, he could not find Bolin. Believing he was with Korra, he traveled to ${link_5} to ask her for his location. At her negation, they decided to go through the city looking for him. Outside ${link_6}, they met ${link_7}, who told them albeit with some bribing, that Bolin had been recruited by the Triple Threat Triad. When Mako and Korra made it to the ${link_8}, they learned that Bolin had been captured by the ${link_9} in a raid and set out to rescue him. However, their encounter with two Equalist ${link_10} ended in their defeat. Due to ${link_11}'s intervention, they remained unharmed and traveled on to ${link_12} to find the ${link_13}, who reluctantly told them that Bolin was likely taken to the ${link_14} called \"${link_15}\".",
      "links": [
        {
          "body": "Butakha",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Butakha",
            "page": "Butakha"
          }
        },
        {
          "body": "money",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Currency#United_Republic_of_Nations",
            "page": "Currency"
          }
        },
        {
          "body": "Pabu",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Pabu",
            "page": "Pabu"
          }
        },
        {
          "body": "Central City Station",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Central_City_Station",
            "page": "Central_City_Station"
          }
        },
        {
          "body": "power plant",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_power_plant",
            "page": "Republic_City_power_plant"
          }
        },
        {
          "body": "Air Temple Island",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Central City Station",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Central_City_Station",
            "page": "Central_City_Station"
          }
        },
        {
          "body": "Skoochy",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Skoochy",
            "page": "Skoochy"
          }
        },
        {
          "body": "gang's headquarters",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad_headquarters",
            "page": "Triple_Threat_Triad_headquarters"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "chi blockers",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/Chi_blocking",
            "page": "Chi_blocking"
          }
        },
        {
          "body": "Naga",
          "key": "${link_11}",
          "target": {
            "external": false,
            "href": "/wiki/Naga",
            "page": "Naga"
          }
        },
        {
          "body": "Republic City Park",
          "key": "${link_12}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar_Korra_Park",
            "page": "Avatar_Korra_Park"
          }
        },
        {
          "body": "protester",
          "key": "${link_13}",
          "target": {
            "external": false,
            "href": "/wiki/Protester",
            "page": "Protester"
          }
        },
        {
          "body": "Equalist rally",
          "key": "${link_14}",
          "target": {
            "external": false,
            "href": "/wiki/Rally_building",
            "page": "Rally_building"
          }
        },
        {
          "body": "The Revelation",
          "key": "${link_15}",
          "target": {
            "external": false,
            "href": "/wiki/The_Revelation",
            "page": "The_Revelation"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Saving Bolin"
      ],
      "text": "Later, Mako, Bolin, and Korra were practicing for the tournament early in the morning when Butakha, the director of the league, came to give the team their winnings from the last match. However, Mako saw this money disappear as swiftly as it came, as Butakha immediately deducted their arrears and informed the team that they had to pay thirty thousand yuans for the championship pot in order to compete in the tournament, or they would be disqualified. Bolin suggested that he could get Pabu to perform circus tricks at Central City Station, but Mako shot this idea down, commenting that he would figure something out as usual, and found work at a power plant. When he returned to the arena after a hard day's work, he could not find Bolin. Believing he was with Korra, he traveled to Air Temple Island to ask her for his location. At her negation, they decided to go through the city looking for him. Outside Central City Station, they met Skoochy, who told them albeit with some bribing, that Bolin had been recruited by the Triple Threat Triad. When Mako and Korra made it to the gang's headquarters, they learned that Bolin had been captured by the Equalists in a raid and set out to rescue him. However, their encounter with two Equalist chi blockers ended in their defeat. Due to Naga's intervention, they remained unharmed and traveled on to Republic City Park to find the protester, who reluctantly told them that Bolin was likely taken to the Equalist rally called \"The Revelation\"."
    },
    {
      "body": "At the rally, they discovered that ${link_0} was going to demonstrate his power to take away bending forever on the kidnapped Triad members and Bolin. In order to save his brother, Mako told Korra to make a large veil of steam erupt from the pipes on the side of the rally hall, which distracted the Equalists and allowed him to rescue Bolin. When the brothers got outside, their escape was thwarted by the intervention of the ${link_1}, who attacked and overpowered them with his ${link_2}, but before he could do further damage, Korra disabled him with her ${link_3}, and helped Mako and Bolin escape on Naga.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Lieutenant",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "electrified kali sticks",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Electrified_kali_sticks",
            "page": "Electrified_kali_sticks"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Saving Bolin"
      ],
      "text": "At the rally, they discovered that Amon was going to demonstrate his power to take away bending forever on the kidnapped Triad members and Bolin. In order to save his brother, Mako told Korra to make a large veil of steam erupt from the pipes on the side of the rally hall, which distracted the Equalists and allowed him to rescue Bolin. When the brothers got outside, their escape was thwarted by the intervention of the Lieutenant, who attacked and overpowered them with his electrified kali sticks, but before he could do further damage, Korra disabled him with her earthbending, and helped Mako and Bolin escape on Naga."
    },
    {
      "body": "A few days after the events of the Equalist rally, Mako was hit by a moped driven by ${link_0} when he ran across the street without looking. She quickly helped him to stand up and apologized. Although initially angered by the crash, Mako lost his train of thought and anger the moment he laid eyes on Asami, memorized by her beauty. After she recognized him as a pro-bender, she asked him on a date to ${link_1} as a part of her apology. Initially, Mako was hesitant, stating he did not have the proper attire for such a formal setting. However, Asami assured him that it would be taken care of, and Mako agreed, appearing love-struck as Asami left.",
      "links": [
        {
          "body": "Asami Sato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Kwong's Cuisine",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kwong%27s_Cuisine",
            "page": "Kwong%27s_Cuisine"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Meeting the Satos"
      ],
      "text": "A few days after the events of the Equalist rally, Mako was hit by a moped driven by Asami Sato when he ran across the street without looking. She quickly helped him to stand up and apologized. Although initially angered by the crash, Mako lost his train of thought and anger the moment he laid eyes on Asami, memorized by her beauty. After she recognized him as a pro-bender, she asked him on a date to Kwong's Cuisine as a part of her apology. Initially, Mako was hesitant, stating he did not have the proper attire for such a formal setting. However, Asami assured him that it would be taken care of, and Mako agreed, appearing love-struck as Asami left."
    },
    {
      "body": "Upon his arrival at the restaurant later that evening, Mako was given suitable clothes. When the waiter attempted to remove Mako's scarf, he immediately stopped him. The waiter complied with the order and showed Mako the table, where Asami was already waiting for him. During their date, Mako learned she was the daughter of the successful industrialist, ${link_0}, and was invited by her to personally meet him, an offer Mako gladly accepted. When Mako met Hiroshi the next day at ${link_1}, the industrialist informed Mako that, after hearing Asami about his team and its financial problems, he had decided he would sponsor the Fire Ferrets' bid in the Pro-bending Tournament, provided that they would bear Future Industries' logo on their uniforms. Excited to be able to participate in the tournament after all, Mako readily agreed to wear the logo on their uniforms and promised the Fire Ferrets would make the most of that opportunity.",
      "links": [
        {
          "body": "Hiroshi Sato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Future Industries",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries",
            "page": "Future_Industries"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Meeting the Satos"
      ],
      "text": "Upon his arrival at the restaurant later that evening, Mako was given suitable clothes. When the waiter attempted to remove Mako's scarf, he immediately stopped him. The waiter complied with the order and showed Mako the table, where Asami was already waiting for him. During their date, Mako learned she was the daughter of the successful industrialist, Hiroshi Sato, and was invited by her to personally meet him, an offer Mako gladly accepted. When Mako met Hiroshi the next day at Future Industries, the industrialist informed Mako that, after hearing Asami about his team and its financial problems, he had decided he would sponsor the Fire Ferrets' bid in the Pro-bending Tournament, provided that they would bear Future Industries' logo on their uniforms. Excited to be able to participate in the tournament after all, Mako readily agreed to wear the logo on their uniforms and promised the Fire Ferrets would make the most of that opportunity."
    },
    {
      "body": "Mako later went with Asami to a gala that was being held at ${link_0} in honor of Korra by ${link_1} ${link_2}. Their relationship continued to blossom afterward, and one of their dates took them to Republic City Park for a carriage ride. During this ride, Asami wondered why Mako never wore the scarf she had purchased for him. He confided in her the importance of his red scarf, being that it was the last reminder of his father he still possessed.",
      "links": [
        {
          "body": "City Hall",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/City_Hall",
            "page": "City_Hall"
          }
        },
        {
          "body": "Councilman",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Tarrlok",
            "page": "Tarrlok"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Meeting the Satos"
      ],
      "text": "Mako later went with Asami to a gala that was being held at City Hall in honor of Korra by Councilman Tarrlok. Their relationship continued to blossom afterward, and one of their dates took them to Republic City Park for a carriage ride. During this ride, Asami wondered why Mako never wore the scarf she had purchased for him. He confided in her the importance of his red scarf, being that it was the last reminder of his father he still possessed."
    },
    {
      "body": "On the eve of their first match of the Pro-bending Tournament, Bolin asked Mako's opinion about the idea of him dating Korra. Mako at first mistook the question as Bolin asking him what he thought of Mako dating the Avatar, and said that she is great, but it made more sense for him to go for Asami. However, when Bolin corrected him and said he meant himself, Mako replied that it was better for Korra to remain as just a friend and that dating teammates is a bad idea. Meanwhile, Mako continued to remain involved with Asami, leaving a training session early to spend time with her.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Romantic issues"
      ],
      "text": "On the eve of their first match of the Pro-bending Tournament, Bolin asked Mako's opinion about the idea of him dating Korra. Mako at first mistook the question as Bolin asking him what he thought of Mako dating the Avatar, and said that she is great, but it made more sense for him to go for Asami. However, when Bolin corrected him and said he meant himself, Mako replied that it was better for Korra to remain as just a friend and that dating teammates is a bad idea. Meanwhile, Mako continued to remain involved with Asami, leaving a training session early to spend time with her."
    },
    {
      "body": "After the Fire Ferrets won the first match of the tournament against the Red Sands Rabaroos, Korra spilled out her feelings to Mako, who apologized and gently refused Korra by stating that he did not feel the same for her. Though she was discouraged, Bolin cheered her up and took her out for a night in Republic City. Mako observed them angrily as his teammates left the dressing room together, even though Asami was with him. Following this, Korra returned to an irritated Mako, and they soon started an argument. Mako claimed that he was only worried about what Korra was doing with Bolin as he was looking out for his little brother and did not want to see him get his heart broken. However, Korra accused him of being jealous, and the two departed angrily.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Romantic issues"
      ],
      "text": "After the Fire Ferrets won the first match of the tournament against the Red Sands Rabaroos, Korra spilled out her feelings to Mako, who apologized and gently refused Korra by stating that he did not feel the same for her. Though she was discouraged, Bolin cheered her up and took her out for a night in Republic City. Mako observed them angrily as his teammates left the dressing room together, even though Asami was with him. Following this, Korra returned to an irritated Mako, and they soon started an argument. Mako claimed that he was only worried about what Korra was doing with Bolin as he was looking out for his little brother and did not want to see him get his heart broken. However, Korra accused him of being jealous, and the two departed angrily."
    },
    {
      "body": "Their conflict almost caused the Fire Ferrets to lose their next match due to lack of teamwork, as neither of them were focused on the task at hand. When the match was brought to a tiebreaker, Bolin overruled Mako's decision to fight it out, stating that his head \"wasn't in the game\", which proved to be a smart move. After the match, Mako approached Korra and admitted to having feelings for her, but that he was confused because he liked Asami as well. He was interrupted when Korra suddenly lurched forward and kissed him. Although surprised by her actions, Mako sincerely returned the kiss. However, their romantic moment was witnessed by Bolin, who quickly fled the scene tearfully with a broken heart. After blaming Korra for the entire situation as she was the instigator of the kiss, he gave chase.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Romantic issues"
      ],
      "text": "Their conflict almost caused the Fire Ferrets to lose their next match due to lack of teamwork, as neither of them were focused on the task at hand. When the match was brought to a tiebreaker, Bolin overruled Mako's decision to fight it out, stating that his head \"wasn't in the game\", which proved to be a smart move. After the match, Mako approached Korra and admitted to having feelings for her, but that he was confused because he liked Asami as well. He was interrupted when Korra suddenly lurched forward and kissed him. Although surprised by her actions, Mako sincerely returned the kiss. However, their romantic moment was witnessed by Bolin, who quickly fled the scene tearfully with a broken heart. After blaming Korra for the entire situation as she was the instigator of the kiss, he gave chase."
    },
    {
      "body": "The next day, Mako discovered that his brother had spent the night at ${link_0}. Bolin refused to come home with him, stating that he was no longer his brother, rather a \"brother-betrayer\". Mako wound up carrying Bolin out of the establishment against his will. The older brother emphasized again that \"dating a teammate was a bad idea\", to which Bolin weakly responded, \"You're a bad idea!\"",
      "links": [
        {
          "body": "Narook's Seaweed Noodlery",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Narook%27s_Seaweed_Noodlery",
            "page": "Narook%27s_Seaweed_Noodlery"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Romantic issues"
      ],
      "text": "The next day, Mako discovered that his brother had spent the night at Narook's Seaweed Noodlery. Bolin refused to come home with him, stating that he was no longer his brother, rather a \"brother-betrayer\". Mako wound up carrying Bolin out of the establishment against his will. The older brother emphasized again that \"dating a teammate was a bad idea\", to which Bolin weakly responded, \"You're a bad idea!\""
    },
    {
      "body": "The growing rift and mixed feelings began to divide the team, and they struggled in the semifinals: Mako even inadvertently hit Bolin in round two, and the team lost the first two rounds by a large margin; in round three, Mako was knocked out of the ring early for a second time, and an injured Bolin soon followed. Mako helped his brother out of the water, and as they ascended to the locker room with the elevator, they apologized for letting what happened with Korra divide them. They subsequently watched Korra score an improbable hat trick to advance the team to the finals. When Korra joined them, Mako thanked her sincerely for not giving up on the team, and they all promised each other that they could still be friends despite all of the confusion.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Romantic issues"
      ],
      "text": "The growing rift and mixed feelings began to divide the team, and they struggled in the semifinals: Mako even inadvertently hit Bolin in round two, and the team lost the first two rounds by a large margin; in round three, Mako was knocked out of the ring early for a second time, and an injured Bolin soon followed. Mako helped his brother out of the water, and as they ascended to the locker room with the elevator, they apologized for letting what happened with Korra divide them. They subsequently watched Korra score an improbable hat trick to advance the team to the finals. When Korra joined them, Mako thanked her sincerely for not giving up on the team, and they all promised each other that they could still be friends despite all of the confusion."
    },
    {
      "body": "As Mako and his teammates prepared for the final match, they heard Amon interrupt a radio broadcast and threaten the United Republic Council with \"severe consequences\" if they allowed the tournament to continue. Korra and the team rode to City Hall on Naga to try and stop the Council from making this decision, but by the time they arrived, they learned that the Council had unanimously agreed to do so, much to their disappointment. Just before Tarrlok declared the decision final, ${link_0} entered City Hall. Demanding the Council show backbone and allow the tournament to continue, Lin offered the security of the ${link_1}. The Council agreed to Lin's offer, and to the Fire Ferrets' excitement, the match continued as planned.",
      "links": [
        {
          "body": "Lin Beifong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Metalbending Police Force",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "The Pro-bending Championship"
      ],
      "text": "As Mako and his teammates prepared for the final match, they heard Amon interrupt a radio broadcast and threaten the United Republic Council with \"severe consequences\" if they allowed the tournament to continue. Korra and the team rode to City Hall on Naga to try and stop the Council from making this decision, but by the time they arrived, they learned that the Council had unanimously agreed to do so, much to their disappointment. Just before Tarrlok declared the decision final, Lin Beifong entered City Hall. Demanding the Council show backbone and allow the tournament to continue, Lin offered the security of the Metalbending Police Force. The Council agreed to Lin's offer, and to the Fire Ferrets' excitement, the match continued as planned."
    },
    {
      "body": "The championship proved to be a closely contended but controversially officiated match. The ${link_0} committed a series of illegal moves, which even prompted Mako to suspect that they had paid off the ${link_1}. The Fire Ferrets lost via knockout in round three. After the match, the Equalists attacked the arena, primarily through use of electrified kali sticks and ${link_2}. These attacks also stunned the still water-bound Fire Ferrets, who were promptly tied to a wooden post supporting the ring.",
      "links": [
        {
          "body": "White Falls Wolfbats",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/White_Falls_Wolfbats",
            "page": "White_Falls_Wolfbats"
          }
        },
        {
          "body": "match's official",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending_referees",
            "page": "Pro-bending_referees"
          }
        },
        {
          "body": "electrified gloves",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Electrified_glove",
            "page": "Electrified_glove"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "The Pro-bending Championship"
      ],
      "text": "The championship proved to be a closely contended but controversially officiated match. The White Falls Wolfbats committed a series of illegal moves, which even prompted Mako to suspect that they had paid off the match's official. The Fire Ferrets lost via knockout in round three. After the match, the Equalists attacked the arena, primarily through use of electrified kali sticks and electrified gloves. These attacks also stunned the still water-bound Fire Ferrets, who were promptly tied to a wooden post supporting the ring."
    },
    {
      "body": "Fortunately for the team, Pabu was lurking in the vicinity. Bolin called the fire ferret over and motioned him to bite through the rope, which Mako initially dismissed as his brother making childish animal sounds. After Pabu's successful rescue, Mako and Bolin made their way to the arena's concourse and anxiously awaited Korra's return from pursuing Amon and the Equalists. When Korra returned following her rescue by Lin, Mako was the first to greet Korra with a big hug, telling her that he was glad she was safe.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "The Pro-bending Championship"
      ],
      "text": "Fortunately for the team, Pabu was lurking in the vicinity. Bolin called the fire ferret over and motioned him to bite through the rope, which Mako initially dismissed as his brother making childish animal sounds. After Pabu's successful rescue, Mako and Bolin made their way to the arena's concourse and anxiously awaited Korra's return from pursuing Amon and the Equalists. When Korra returned following her rescue by Lin, Mako was the first to greet Korra with a big hug, telling her that he was glad she was safe."
    },
    {
      "body": "In the aftermath of the Equalists' attack on the arena, the authorities closed down the building, forcing Mako and Bolin to move elsewhere. Accepting Asami's offer, the brothers moved to the ${link_0}, where they got a taste of the high life. However, troubles soon arose when Korra overheard Hiroshi uttering a disturbing message about preparing to \"strike\", suggesting he could be part of the Equalists. Mako, however, refused to believe Korra and bluntly stated that their friendship would be over if she continued her crusade against Asami's father, as he thought she only did that out of jealousy of his relationship with Asami.",
      "links": [
        {
          "body": "Sato estate",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sato_estate",
            "page": "Sato_estate"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "A new home"
      ],
      "text": "In the aftermath of the Equalists' attack on the arena, the authorities closed down the building, forcing Mako and Bolin to move elsewhere. Accepting Asami's offer, the brothers moved to the Sato estate, where they got a taste of the high life. However, troubles soon arose when Korra overheard Hiroshi uttering a disturbing message about preparing to \"strike\", suggesting he could be part of the Equalists. Mako, however, refused to believe Korra and bluntly stated that their friendship would be over if she continued her crusade against Asami's father, as he thought she only did that out of jealousy of his relationship with Asami."
    },
    {
      "body": "When Korra's accusations proved to hold merit and a search of the Sato estate was carried out, Mako was ordered by Lin Beifong to stay in Hiroshi's workplace together with Bolin and Asami under the supervision of ${link_0}, while she with Tenzin, Korra, and several metalbending officers made their way down a tunnel. However, when Mako heard a suspicious noise coming from the ${link_1}, he tricked the guard and knocked him over with a fire sneeze. After insisting that his girlfriend remain upstairs, Mako ventured down into the tunnel with Bolin, discovering that Hiroshi was not only an Equalist, but had also managed to overpower Korra and the others. Knowing that help was needed, he hoisted Korra on his back and was about to drag Lin away when he and Bolin were stopped by Hiroshi. After confronting his girlfriend's father about his pro-bending sponsorship of Fire Ferrets and everything all being a lie, Mako and the others were rescued by Asami, who stunned her father and the Lieutenant with an Equalist glove.",
      "links": [
        {
          "body": "Officer Song",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Song_(officer)",
            "page": "Song_(officer)"
          }
        },
        {
          "body": "underground factory",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Equalist_factory",
            "page": "Equalist_factory"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "A new home"
      ],
      "text": "When Korra's accusations proved to hold merit and a search of the Sato estate was carried out, Mako was ordered by Lin Beifong to stay in Hiroshi's workplace together with Bolin and Asami under the supervision of Officer Song, while she with Tenzin, Korra, and several metalbending officers made their way down a tunnel. However, when Mako heard a suspicious noise coming from the underground factory, he tricked the guard and knocked him over with a fire sneeze. After insisting that his girlfriend remain upstairs, Mako ventured down into the tunnel with Bolin, discovering that Hiroshi was not only an Equalist, but had also managed to overpower Korra and the others. Knowing that help was needed, he hoisted Korra on his back and was about to drag Lin away when he and Bolin were stopped by Hiroshi. After confronting his girlfriend's father about his pro-bending sponsorship of Fire Ferrets and everything all being a lie, Mako and the others were rescued by Asami, who stunned her father and the Lieutenant with an Equalist glove."
    },
    {
      "body": "Once the group escaped via ${link_0}, Mako apologized to Korra afterward for not believing her, and accepted her previous offer to come live with her at Air Temple Island. He was later seen comforting a distraught Asami over her father's Equalist revelation.",
      "links": [
        {
          "body": "airship",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Police_airship",
            "page": "Police_airship"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "A new home"
      ],
      "text": "Once the group escaped via airship, Mako apologized to Korra afterward for not believing her, and accepted her previous offer to come live with her at Air Temple Island. He was later seen comforting a distraught Asami over her father's Equalist revelation."
    },
    {
      "body": "After moving to Air Temple Island with his brother and girlfriend, Mako became a part of what Bolin called the \"new ${link_0}\" along with Asami, Bolin, and Korra. Using a Satomobile, the four patrolled the streets of Republic City looking for Equalists. They soon found, defeated, and captured several of them, much to Tarrlok's dismay. The next night they went out again only to find that the police were arresting innocent nonbenders and accusing them of being Equalists. While trying to defend Asami after Tarrlok's order to arrest her, Mako faced the police and was arrested as well. Korra was about to unleash her earthbending powers on Tarrlok and his policemen, but Mako convinced her that it was not worth it, implying that it would only make things worse. She backed down, and he was taken to prison alongside his brother and Asami.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Forming Team Avatar"
      ],
      "text": "After moving to Air Temple Island with his brother and girlfriend, Mako became a part of what Bolin called the \"new Team Avatar\" along with Asami, Bolin, and Korra. Using a Satomobile, the four patrolled the streets of Republic City looking for Equalists. They soon found, defeated, and captured several of them, much to Tarrlok's dismay. The next night they went out again only to find that the police were arresting innocent nonbenders and accusing them of being Equalists. While trying to defend Asami after Tarrlok's order to arrest her, Mako faced the police and was arrested as well. Korra was about to unleash her earthbending powers on Tarrlok and his policemen, but Mako convinced her that it was not worth it, implying that it would only make things worse. She backed down, and he was taken to prison alongside his brother and Asami."
    },
    {
      "body": "Sometime later, Mako and Bolin, sitting in the same cell, were broken out of prison by Lin Beifong, and he happily reunited with Asami, sharing a kiss. After learning about Korra's disappearance from the City Hall, Mako seemed very concerned and set out to do everything possible to find her. The two brothers, along with Asami, Tenzin, and Lin, proceeded to search for Korra, whom they believed was kidnapped by the Equalists. At an Equalist base under the city, the group found and freed Lin's captured officers, and Mako, after pinning one of the Equalists up against the wall and threatening him, learned that the organization had never attacked City Hall, nor did they have Korra, meaning Tarrlok was lying about their attack. Mako and the group successfully escaped from the base and began making their way to City Hall, despite the Equalist's attempts to stop them.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Searching for Korra"
      ],
      "text": "Sometime later, Mako and Bolin, sitting in the same cell, were broken out of prison by Lin Beifong, and he happily reunited with Asami, sharing a kiss. After learning about Korra's disappearance from the City Hall, Mako seemed very concerned and set out to do everything possible to find her. The two brothers, along with Asami, Tenzin, and Lin, proceeded to search for Korra, whom they believed was kidnapped by the Equalists. At an Equalist base under the city, the group found and freed Lin's captured officers, and Mako, after pinning one of the Equalists up against the wall and threatening him, learned that the organization had never attacked City Hall, nor did they have Korra, meaning Tarrlok was lying about their attack. Mako and the group successfully escaped from the base and began making their way to City Hall, despite the Equalist's attempts to stop them."
    },
    {
      "body": "When confronting Tarrlok in the City Hall, the group discovered that he was a ${link_0}. When they were about to attack, the Councilman retaliated, knocking them all unconscious with his dark ability. However, after they regained consciousness, they continued the search, and later found Naga wandering the streets of Republic City, carrying Korra. Tenzin and Lin immediately bombarded her with questions, but Mako roughly pushed them aside, saying that she needed space, and quickly carried Korra to ${link_1}, commenting how he was so worried about her and assuring her she was safe now while gently brushing a few strands of her hair from her face. It was these events that led Mako to realize his true feelings for Korra.",
      "links": [
        {
          "body": "bloodbender",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "Oogi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Oogi",
            "page": "Oogi"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Searching for Korra"
      ],
      "text": "When confronting Tarrlok in the City Hall, the group discovered that he was a bloodbender. When they were about to attack, the Councilman retaliated, knocking them all unconscious with his dark ability. However, after they regained consciousness, they continued the search, and later found Naga wandering the streets of Republic City, carrying Korra. Tenzin and Lin immediately bombarded her with questions, but Mako roughly pushed them aside, saying that she needed space, and quickly carried Korra to Oogi, commenting how he was so worried about her and assuring her she was safe now while gently brushing a few strands of her hair from her face. It was these events that led Mako to realize his true feelings for Korra."
    },
    {
      "body": "After rescuing Korra, Mako took great care in making sure she recovered from the incident completely, going so far as even hovering over her while she slept. After dinner on Air Temple Island, Mako entered the kitchen and requested more hot water to make tea for Korra. He was met with a sharp response from an irritated Asami, which prompted Pema to leave to allow the couple to talk. Asami told Mako that she noticed how he had been spending so much time with Korra, and revealed that she knew he and Korra had kissed and urged Mako to be honest about his feelings for the Avatar. The firebender was not able to come up with a response that satisfied Asami, instead countering that they concentrate on their own relationship at the moment to which an irritated Asami replied they might not have a relationship to worry about and left, leaving behind a frustrated Mako.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "The Equalists attack"
      ],
      "text": "After rescuing Korra, Mako took great care in making sure she recovered from the incident completely, going so far as even hovering over her while she slept. After dinner on Air Temple Island, Mako entered the kitchen and requested more hot water to make tea for Korra. He was met with a sharp response from an irritated Asami, which prompted Pema to leave to allow the couple to talk. Asami told Mako that she noticed how he had been spending so much time with Korra, and revealed that she knew he and Korra had kissed and urged Mako to be honest about his feelings for the Avatar. The firebender was not able to come up with a response that satisfied Asami, instead countering that they concentrate on their own relationship at the moment to which an irritated Asami replied they might not have a relationship to worry about and left, leaving behind a frustrated Mako."
    },
    {
      "body": "Soon after, the Equalists began attacking Republic City. Mako, along with the rest of Team Avatar, made their way to the city and recovered Asami's Satomobile. Mako burned the tickets the car had acquired since Korra had crashed it into a lamppost, after Bolin stressed about the tickets and he pointed out that the police had more important things to worry about, referring to the city being under attack. Asami assumed her position in the driver's seat and told Mako, who was about to sit down in the passenger's seat, to sit in the back \"with Korra\", showing she was still angry with him. The young Avatar asked Mako if everything was all right, to which he sarcastically responded that it was \"terrific\".",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "The Equalists attack"
      ],
      "text": "Soon after, the Equalists began attacking Republic City. Mako, along with the rest of Team Avatar, made their way to the city and recovered Asami's Satomobile. Mako burned the tickets the car had acquired since Korra had crashed it into a lamppost, after Bolin stressed about the tickets and he pointed out that the police had more important things to worry about, referring to the city being under attack. Asami assumed her position in the driver's seat and told Mako, who was about to sit down in the passenger's seat, to sit in the back \"with Korra\", showing she was still angry with him. The young Avatar asked Mako if everything was all right, to which he sarcastically responded that it was \"terrific\"."
    },
    {
      "body": "The group collided with a gang of Equalist henchmen, aided by ${link_0}, who had captured Tenzin. Mako aided in freeing the airbender by utilizing a combination of firebending and lightning redirection. When one of Hiroshi's mecha tanks shot out a wire to electrocute him, Mako managed to channel the electricity back to the machine using his bending, thus defeating his opponent. After the encounter, they flew back to Air Temple Island to defend it against Equalist airships. Upon arriving, they found that Lin, along with Tenzin's children, had successfully repelled the attacks and required no further assistance from them. Later that day, the attacks pressed on however, and Mako and his friends were forced into hiding in a water pipeline. He comforted Korra, who looked sadly on at the occupying city from a safe distance, an act which did not go unnoticed by Asami.",
      "links": [
        {
          "body": "mecha tanks",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_tank",
            "page": "Mecha_tank"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "The Equalists attack"
      ],
      "text": "The group collided with a gang of Equalist henchmen, aided by mecha tanks, who had captured Tenzin. Mako aided in freeing the airbender by utilizing a combination of firebending and lightning redirection. When one of Hiroshi's mecha tanks shot out a wire to electrocute him, Mako managed to channel the electricity back to the machine using his bending, thus defeating his opponent. After the encounter, they flew back to Air Temple Island to defend it against Equalist airships. Upon arriving, they found that Lin, along with Tenzin's children, had successfully repelled the attacks and required no further assistance from them. Later that day, the attacks pressed on however, and Mako and his friends were forced into hiding in a water pipeline. He comforted Korra, who looked sadly on at the occupying city from a safe distance, an act which did not go unnoticed by Asami."
    },
    {
      "body": "While hiding under the city, Korra and Mako stole chi blocker uniforms, and infiltrated Equalist rallies to stay up-to-date on Amon's movements. Korra was growing restless and increasingly more agitated at being branded a coward for \"running away\", but Mako advised her to be patient. The two rejoined Bolin and Asami (who was still frustrated at Mako) and ate dinner with ${link_0}. Later that night, when neither of them could sleep, Mako told Korra that because of everything that has happened, he could not imagine his life without her. He went on to say Korra was the most loyal, brave and selfless person he had ever known. Korra was flattered and reciprocated his feelings, but after a tender moment, quickly opted for them to get some rest for the United Forces' morning arrival.",
      "links": [
        {
          "body": "Gommu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Gommu",
            "page": "Gommu"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Stopping Amon"
      ],
      "text": "While hiding under the city, Korra and Mako stole chi blocker uniforms, and infiltrated Equalist rallies to stay up-to-date on Amon's movements. Korra was growing restless and increasingly more agitated at being branded a coward for \"running away\", but Mako advised her to be patient. The two rejoined Bolin and Asami (who was still frustrated at Mako) and ate dinner with Gommu. Later that night, when neither of them could sleep, Mako told Korra that because of everything that has happened, he could not imagine his life without her. He went on to say Korra was the most loyal, brave and selfless person he had ever known. Korra was flattered and reciprocated his feelings, but after a tender moment, quickly opted for them to get some rest for the United Forces' morning arrival."
    },
    {
      "body": "When General Iroh appeared, the United Forces fleet was swiftly destroyed by the Equalists and their newly crafted air fleet. Korra managed to rescue the general, and brought him back to the hideout. Iroh decided that with the Equalist air fleet in power, it would be impossible for the remaining fleet to take back the city. With the group's help, Iroh and Mako deduced where the air fleet hangar was, and everyone prepared themselves to leave. Korra, however, refused to go, as she believed it was her duty to stay in the city and confront Amon. Rather than letting her face Amon by herself, Mako insisted on accompanying her, while Bolin, Asami, and Iroh continued on their path to take down the air ships. Mako and Bolin hugged each other goodbye, and Mako apologized to Asami about how crazy things had gotten between them, and told her that he wanted her to know that he still cared for her. Asami said she still cared for him too, and kissed him on the cheek, ending their relationship.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Stopping Amon"
      ],
      "text": "When General Iroh appeared, the United Forces fleet was swiftly destroyed by the Equalists and their newly crafted air fleet. Korra managed to rescue the general, and brought him back to the hideout. Iroh decided that with the Equalist air fleet in power, it would be impossible for the remaining fleet to take back the city. With the group's help, Iroh and Mako deduced where the air fleet hangar was, and everyone prepared themselves to leave. Korra, however, refused to go, as she believed it was her duty to stay in the city and confront Amon. Rather than letting her face Amon by herself, Mako insisted on accompanying her, while Bolin, Asami, and Iroh continued on their path to take down the air ships. Mako and Bolin hugged each other goodbye, and Mako apologized to Asami about how crazy things had gotten between them, and told her that he wanted her to know that he still cared for her. Asami said she still cared for him too, and kissed him on the cheek, ending their relationship."
    },
    {
      "body": "Mako and Korra returned to Air Temple Island hoping to ambush Amon, but they instead found an imprisoned Tarrlok. He told Mako and Korra that he and Amon were brothers, and went on to tell them about their childhood, and that Amon was actually a very powerful bloodbender. Mako realized trying to ambush Amon directly would be a horrible idea, but Korra theorized that if they were able to expose Amon as a bender in front of his supporters, the Revolution would crumble. Tarrlok apologized to Korra for his actions and the duo soon left to attend Amon's rally at the Pro-bending Arena.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Stopping Amon"
      ],
      "text": "Mako and Korra returned to Air Temple Island hoping to ambush Amon, but they instead found an imprisoned Tarrlok. He told Mako and Korra that he and Amon were brothers, and went on to tell them about their childhood, and that Amon was actually a very powerful bloodbender. Mako realized trying to ambush Amon directly would be a horrible idea, but Korra theorized that if they were able to expose Amon as a bender in front of his supporters, the Revolution would crumble. Tarrlok apologized to Korra for his actions and the duo soon left to attend Amon's rally at the Pro-bending Arena."
    },
    {
      "body": "When Mako and Korra made it to the arena, Korra made an attempt to persuade Amon's supporters that he was really a waterbender and a bloodbender. However, Amon revealed his face and the \"scar\" he was supposedly given by the firebender who had killed his father, to the crowd, making his supporters believe that Korra was a liar. Mako promptly opted for the two of them to escape, but Amon revealed that he captured Tenzin and his family, and prepared to take their bending away. Korra distraughtly denied that they were captured, saying \"[they] saw them get away\". Initially Mako told her that Amon was just baiting her; however when Amon made his way toward the airbenders, Mako fired a bolt of lightning at him, which he barely dodged. Mako and Korra used their firebending to reach the stage, free Tenzin and his family, and escape out into corridors.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Stopping Amon"
      ],
      "text": "When Mako and Korra made it to the arena, Korra made an attempt to persuade Amon's supporters that he was really a waterbender and a bloodbender. However, Amon revealed his face and the \"scar\" he was supposedly given by the firebender who had killed his father, to the crowd, making his supporters believe that Korra was a liar. Mako promptly opted for the two of them to escape, but Amon revealed that he captured Tenzin and his family, and prepared to take their bending away. Korra distraughtly denied that they were captured, saying \"[they] saw them get away\". Initially Mako told her that Amon was just baiting her; however when Amon made his way toward the airbenders, Mako fired a bolt of lightning at him, which he barely dodged. Mako and Korra used their firebending to reach the stage, free Tenzin and his family, and escape out into corridors."
    },
    {
      "body": "While Tenzin and his children escaped, Mako and Korra retreated and hid in one of the fitness rooms. Amon followed them and began to bloodbend Korra; Mako tried to stop him only to be subdued as well. Amon proceeded to take Korra's bending away, much to Mako's horror. Amon approached him, still keeping a hold on him. However, Mako managed to fight Amon's grasp and blasted him away with lightning. Mako quickly picked up a barely conscious Korra and attempted to escape, reassuring her that she would be okay. Amon, though, was able to catch up with them and stop Mako once again with bloodbending. Amon complimented Mako on his ability to \"get the better of him\", and commented on what a pity it was for him to take away his superior bending skills. Meanwhile, Korra watched, and just when Mako was about to lose his bending, Korra unlocked her airbending and knocked Amon away with an air blast.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Stopping Amon"
      ],
      "text": "While Tenzin and his children escaped, Mako and Korra retreated and hid in one of the fitness rooms. Amon followed them and began to bloodbend Korra; Mako tried to stop him only to be subdued as well. Amon proceeded to take Korra's bending away, much to Mako's horror. Amon approached him, still keeping a hold on him. However, Mako managed to fight Amon's grasp and blasted him away with lightning. Mako quickly picked up a barely conscious Korra and attempted to escape, reassuring her that she would be okay. Amon, though, was able to catch up with them and stop Mako once again with bloodbending. Amon complimented Mako on his ability to \"get the better of him\", and commented on what a pity it was for him to take away his superior bending skills. Meanwhile, Korra watched, and just when Mako was about to lose his bending, Korra unlocked her airbending and knocked Amon away with an air blast."
    },
    {
      "body": "Amon tried to bloodbend Korra again, but she managed to knock him out of a window and into the harbor in front of the Equalist mob. Amon's mask fell off and his \"scar\" (which was only make-up) faded away. Not knowing this, he defensively used waterbending to propel himself out of the water in front of the crowd, losing his supporters. As he sped away toward Air Temple Island, Mako tried to beat him down with fireblasts, to no avail. Mako embraced Korra, who was still weak from losing her bending.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "Stopping Amon"
      ],
      "text": "Amon tried to bloodbend Korra again, but she managed to knock him out of a window and into the harbor in front of the Equalist mob. Amon's mask fell off and his \"scar\" (which was only make-up) faded away. Not knowing this, he defensively used waterbending to propel himself out of the water in front of the crowd, losing his supporters. As he sped away toward Air Temple Island, Mako tried to beat him down with fireblasts, to no avail. Mako embraced Korra, who was still weak from losing her bending."
    },
    {
      "body": "Mako and Korra were reunited with Bolin, Tenzin and his family, Lin, Asami, and Iroh on Air Temple Island, and watched as Commander Bumi arrived. Later, Mako and the rest of the group went to the South Pole so Katara could try to restore Korra's bending. Despite her best efforts, Katara was unable to mend the block that was keeping Korra from bending water, earth, and fire. Korra emerged, and she quietly stepped outside. Mako followed her and tried to console her. Korra told him to go back to Republic City; thinking that without her bending she was no longer the Avatar, and Mako should not do her any favors by staying. Mako told her that he did not care if she was the Avatar or not, and he explained that when she was kidnapped by Tarrlok, he thought he would never see her again, and it made him realize how much he cared for her. Mako told Korra that he loved her, but it was too much for her to handle and she ran away on Naga. Tenzin came to stand behind Mako, who was calling after her, and said that they must give her time to come to terms with what had happened, leaving Mako to stand there and look on sadly after her.",
      "links": [],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "A new start"
      ],
      "text": "Mako and Korra were reunited with Bolin, Tenzin and his family, Lin, Asami, and Iroh on Air Temple Island, and watched as Commander Bumi arrived. Later, Mako and the rest of the group went to the South Pole so Katara could try to restore Korra's bending. Despite her best efforts, Katara was unable to mend the block that was keeping Korra from bending water, earth, and fire. Korra emerged, and she quietly stepped outside. Mako followed her and tried to console her. Korra told him to go back to Republic City; thinking that without her bending she was no longer the Avatar, and Mako should not do her any favors by staying. Mako told her that he did not care if she was the Avatar or not, and he explained that when she was kidnapped by Tarrlok, he thought he would never see her again, and it made him realize how much he cared for her. Mako told Korra that he loved her, but it was too much for her to handle and she ran away on Naga. Tenzin came to stand behind Mako, who was calling after her, and said that they must give her time to come to terms with what had happened, leaving Mako to stand there and look on sadly after her."
    },
    {
      "body": "Mako later pursued Korra out into the tundra, and witnessed her going into the Avatar State for the first time at the cliff's edge. He watched in awe and delight, and when Korra came out of the Avatar State, he smiled warmly at her and walked toward her with open arms. Korra jumped into his arms and embraced him, telling him that she loved him too. The two kissed, and eventually returned to their friends and families. Later, while standing beside his brother, he witnessed Korra ${link_0} and Tenzin praising her as \"Avatar Korra\".",
      "links": [
        {
          "body": "restoring Lin's earthbending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Energybending",
            "page": "Energybending"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "A new start"
      ],
      "text": "Mako later pursued Korra out into the tundra, and witnessed her going into the Avatar State for the first time at the cliff's edge. He watched in awe and delight, and when Korra came out of the Avatar State, he smiled warmly at her and walked toward her with open arms. Korra jumped into his arms and embraced him, telling him that she loved him too. The two kissed, and eventually returned to their friends and families. Later, while standing beside his brother, he witnessed Korra restoring Lin's earthbending and Tenzin praising her as \"Avatar Korra\"."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "See also"
      ],
      "text": "Mako"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Mako (171 AG - Harmonic Convergence)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Mako_(171_AG_-_Harmonic_Convergence)",
            "page": "History_of_Mako_(171_AG_-_Harmonic_Convergence)"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "See also"
      ],
      "text": "History of Mako (171 AG - Harmonic Convergence)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Mako (late 171 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Mako_(late_171_AG)",
            "page": "History_of_Mako_(late_171_AG)"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "See also"
      ],
      "text": "History of Mako (late 171 AG)"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "History of Mako (174 AG)",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_Mako_(174_AG)",
            "page": "History_of_Mako_(174_AG)"
          }
        }
      ],
      "section": [
        "History of Mako (152 AG – 170 AG)",
        "See also"
      ],
      "text": "History of Mako (174 AG)"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/History_of_Mako_(152_AG_-_170_AG)",
    "file": "avatar.wikia.com/wiki/History_of_Mako_(152_AG_-_170_AG).html",
    "page": "History_of_Mako_(152_AG_-_170_AG)",
    "title": "History of Mako (152 AG – 170 AG)"
  }
}