{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Equipment",
      "target": {
        "href": "Category_Equipment",
        "page": "Category_Equipment"
      }
    },
    {
      "body": "Objects",
      "target": {
        "href": "Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Weapons",
      "target": {
        "href": "Category_Weapons",
        "page": "Category_Weapons"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} primarily used hook swords in battle.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        }
      ],
      "text": "Jet primarily used hook swords in battle."
    },
    {
      "body": "Hook swords, also known as twin hooks, tigerheads, or tiger blades, are three weapons in one: A long pole with a hook at the end, an arced blade above the fist, and spearhead beneath the handle. They were ${link_0}'s primary weapons. In addition to combat, Jet also used these to maneuver through the trees. Many years later, the ${link_1} leader ${link_2} would also make highly effective use of hook swords in combat.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        },
        {
          "body": "Triple Threat Triad",
          "key": "${link_1}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "Tokuga",
          "key": "${link_2}",
          "target": {
            "href": "Tokuga",
            "page": "Tokuga"
          }
        }
      ],
      "text": "Hook swords, also known as twin hooks, tigerheads, or tiger blades, are three weapons in one: A long pole with a hook at the end, an arced blade above the fist, and spearhead beneath the handle. They were Jet's primary weapons. In addition to combat, Jet also used these to maneuver through the trees. Many years later, the Triple Threat Triad leader Tokuga would also make highly effective use of hook swords in combat."
    },
    {
      "body": "The majority of the time, Jet simply used his tigerheads as dual swords. He used his hook swords to disarm opponents, parry their strikes, or knock them off their feet by hooking their ankles. Jet also could hook them together to create a nunchuck-like weapon. However, he found many other inventive uses for his hook swords:",
      "links": [],
      "text": "The majority of the time, Jet simply used his tigerheads as dual swords. He used his hook swords to disarm opponents, parry their strikes, or knock them off their feet by hooking their ankles. Jet also could hook them together to create a nunchuck-like weapon. However, he found many other inventive uses for his hook swords:"
    },
    {
      "body": "The former ${link_0} never made an appearance without his hook swords.",
      "links": [
        {
          "body": "Freedom Fighter",
          "key": "${link_0}",
          "target": {
            "href": "Freedom_Fighters",
            "page": "Freedom_Fighters"
          }
        }
      ],
      "text": "The former Freedom Fighter never made an appearance without his hook swords."
    },
    {
      "body": "Tokuga uses a pair of tigerheads that are nearly identical to Jet's, albeit lacking the spearhead tip at the pommel, which ends instead in a simple point. They are Tokuga's primary handheld weapons, which he uses in conjunction with ${link_0} in a highly effective and agile style of combat. He has used them to swing from objects, deflect projectiles thrown at him, and to trip opposing benders by catching them by the ankle.",
      "links": [
        {
          "body": "chi blocking",
          "key": "${link_0}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        }
      ],
      "text": "Tokuga uses a pair of tigerheads that are nearly identical to Jet's, albeit lacking the spearhead tip at the pommel, which ends instead in a simple point. They are Tokuga's primary handheld weapons, which he uses in conjunction with chi blocking in a highly effective and agile style of combat. He has used them to swing from objects, deflect projectiles thrown at him, and to trip opposing benders by catching them by the ankle."
    },
    {
      "body": "In the real world, the tigerhead is an exotic Chinese weapon traditionally associated with Northern styles of Chinese martial arts but are now often practiced by Southern styles as well.",
      "links": [],
      "text": "In the real world, the tigerhead is an exotic Chinese weapon traditionally associated with Northern styles of Chinese martial arts but are now often practiced by Southern styles as well."
    },
    {
      "body": "Most antique examples and artistic depictions of the tiger blades are from the late Qing Chinese Dynasty or later. The hook swords were an exclusively discreet civilian weapon, appearing in none of the official listings of Chinese armaments. These weapons were also often utilized by Shaolin monks.",
      "links": [],
      "text": "Most antique examples and artistic depictions of the tiger blades are from the late Qing Chinese Dynasty or later. The hook swords were an exclusively discreet civilian weapon, appearing in none of the official listings of Chinese armaments. These weapons were also often utilized by Shaolin monks."
    },
    {
      "body": "Often used in pairs, the hooks of the weapons may be used to trap or deflect other weapons. Modern routines for hook swords are often very flashy and may involve techniques such as linking paired weapons and wielding them as a single long, flexible weapon. They are also known as 'qian kun ri yue dao', meaning \"heaven and earth, sun moon sword\".",
      "links": [],
      "text": "Often used in pairs, the hooks of the weapons may be used to trap or deflect other weapons. Modern routines for hook swords are often very flashy and may involve techniques such as linking paired weapons and wielding them as a single long, flexible weapon. They are also known as 'qian kun ri yue dao', meaning \"heaven and earth, sun moon sword\"."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Hook_swords",
    "file": "avatar.wikia.com/wiki/Hook_swords.html",
    "page": "Hook_swords",
    "title": "Hook swords"
  }
}