{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Equipment",
      "target": {
        "href": "Category_Equipment",
        "page": "Category_Equipment"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Military",
      "target": {
        "href": "Category_Military",
        "page": "Category_Military"
      }
    },
    {
      "body": "Objects",
      "target": {
        "href": "Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Republic City",
      "target": {
        "href": "Category_Republic_City",
        "page": "Category_Republic_City"
      }
    },
    {
      "body": "Vehicles",
      "target": {
        "href": "Category_Vehicles",
        "page": "Category_Vehicles"
      }
    },
    {
      "body": "Weapons",
      "target": {
        "href": "Category_Weapons",
        "page": "Category_Weapons"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The prototypes of the hummingbird ${link_0} were deployed against ${link_1}'s mecha giant during her ${link_2} on ${link_3}.",
      "links": [
        {
          "body": "mecha suit",
          "key": "${link_0}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_1}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "attack",
          "key": "${link_2}",
          "target": {
            "href": "Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_3}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "text": "The prototypes of the hummingbird mecha suit were deployed against Kuvira's mecha giant during her attack on Republic City."
    },
    {
      "body": "The hummingbird mecha suit is a small, nimble machine capable of flying in any direction, including vertical take-off and landing capabilities. Originally conceived by ${link_0} for construction projects, it was developed by her and ${link_1} in 174 ${link_2} for ${link_3} ${link_4} to aid in the defense of ${link_5} against ${link_6} and ${link_7}. Before they could be deployed, however, all the machines, save for the prototypes stored at Asami's office, were destroyed when Kuvira blew up the ${link_8}' factory where they were stationed with her ${link_9}.",
      "links": [
        {
          "body": "Asami Sato",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_1}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "AG",
          "key": "${link_2}",
          "target": {
            "href": "History_of_the_World_of_Avatar",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "President",
          "key": "${link_3}",
          "target": {
            "href": "President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_4}",
          "target": {
            "href": "Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_5}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_6}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "her army",
          "key": "${link_7}",
          "target": {
            "href": "Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        },
        {
          "body": "Future Industries",
          "key": "${link_8}",
          "target": {
            "href": "Future_Industries",
            "page": "Future_Industries"
          }
        },
        {
          "body": "spirit energy cannon",
          "key": "${link_9}",
          "target": {
            "href": "Spirit_energy_cannon",
            "page": "Spirit_energy_cannon"
          }
        }
      ],
      "text": "The hummingbird mecha suit is a small, nimble machine capable of flying in any direction, including vertical take-off and landing capabilities. Originally conceived by Asami Sato for construction projects, it was developed by her and Varrick in 174 AG for President Raiko to aid in the defense of Republic City against Kuvira and her army. Before they could be deployed, however, all the machines, save for the prototypes stored at Asami's office, were destroyed when Kuvira blew up the Future Industries' factory where they were stationed with her spirit energy cannon."
    },
    {
      "body": "When ${link_0} and Varrick alerted President Raiko and the other ${link_1} leaders about Kuvira's ${link_2}, Raiko ordered Varrick and Asami, as Republic City's two brightest minds, to come up with a way to defend the city against the imminent threat. After observing dragonfly hummingbirds, Asami got the idea to build a ${link_3} that could fly in any direction. However, when the two inventors presented their plans to the president, he was furious to learn that Varrick refused to equip them with spirit energy weapons. Despite Raiko's insistence, Asami and Varrick set out to manufacture the suits as they designed, without making any modifications to the weapons' arsenal.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "world",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "spirit energy cannon",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_energy_cannon",
            "page": "Spirit_energy_cannon"
          }
        },
        {
          "body": "mecha suit",
          "key": "${link_3}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        }
      ],
      "text": "When Bolin and Varrick alerted President Raiko and the other world leaders about Kuvira's spirit energy cannon, Raiko ordered Varrick and Asami, as Republic City's two brightest minds, to come up with a way to defend the city against the imminent threat. After observing dragonfly hummingbirds, Asami got the idea to build a mecha suit that could fly in any direction. However, when the two inventors presented their plans to the president, he was furious to learn that Varrick refused to equip them with spirit energy weapons. Despite Raiko's insistence, Asami and Varrick set out to manufacture the suits as they designed, without making any modifications to the weapons' arsenal."
    },
    {
      "body": "After completing several prototypes at Asami's office, they moved production to one of Future Industries' factories, where Varrick oversaw the assembly lines. Although managing to complete over a dozen hummingbird mecha suits, they could never be deployed in battle, as they were all destroyed, along with the factory, by Kuvira's spirit energy cannon. Despite this setback, Asami and Varrick set out to adapt the still intact prototypes at her office in order to make them fly, so they could provide air support to the ${link_0} attempting to take down Kuvira's enormous mecha suit carrying the spirit energy cannon. ${link_1} was also released from ${link_2} by ${link_3} to provide assistance, which he did by helping to attach plasma saws to the suit that would allow them to cut into Kuvira's platinum giant. The suits went into battle with Varrick and ${link_4} in one and Hiroshi and Asami in the other. The former pair's suit was destroyed before they could cut a hole and thus had to eject themselves before they lost their lives. The latter was able to cut an opening in the suit's leg, though Hiroshi gave himself up to do so, ejecting Asami before he was crushed.",
      "links": [
        {
          "body": "benders",
          "key": "${link_0}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_1}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "prison",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City_prison",
            "page": "Republic_City_prison"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_3}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Zhu Li",
          "key": "${link_4}",
          "target": {
            "href": "Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        }
      ],
      "text": "After completing several prototypes at Asami's office, they moved production to one of Future Industries' factories, where Varrick oversaw the assembly lines. Although managing to complete over a dozen hummingbird mecha suits, they could never be deployed in battle, as they were all destroyed, along with the factory, by Kuvira's spirit energy cannon. Despite this setback, Asami and Varrick set out to adapt the still intact prototypes at her office in order to make them fly, so they could provide air support to the benders attempting to take down Kuvira's enormous mecha suit carrying the spirit energy cannon. Hiroshi Sato was also released from prison by Lin Beifong to provide assistance, which he did by helping to attach plasma saws to the suit that would allow them to cut into Kuvira's platinum giant. The suits went into battle with Varrick and Zhu Li in one and Hiroshi and Asami in the other. The former pair's suit was destroyed before they could cut a hole and thus had to eject themselves before they lost their lives. The latter was able to cut an opening in the suit's leg, though Hiroshi gave himself up to do so, ejecting Asami before he was crushed."
    },
    {
      "body": "Several weeks later, the hummingbird mecha suits were used at the construction site of the housing project spearheaded by Future Industries and Varrick Global Industries to weld iron beams at great heights.",
      "links": [],
      "text": "Several weeks later, the hummingbird mecha suits were used at the construction site of the housing project spearheaded by Future Industries and Varrick Global Industries to weld iron beams at great heights."
    },
    {
      "body": "The hummingbird ${link_0} is designed to be operated by two people.",
      "links": [
        {
          "body": "mecha suit",
          "key": "${link_0}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        }
      ],
      "text": "The hummingbird mecha suit is designed to be operated by two people."
    },
    {
      "body": "The hummingbird mecha suit is designed to be piloted by two people, one in the head and one in the belly; the head pilot is in charge of flying while the belly pilot controls the weapons. While in the air, the landing gear, based on the legs of the dragonfly hummingbird, retract to form a more compact and aerodynamic machine. The vehicle is designed with vertical take-off and can fly in any direction. The machine is also able to land anywhere, both vertically and horizontally, using magnetic landing pads that fold down to attach the suit to the surface.",
      "links": [],
      "text": "The hummingbird mecha suit is designed to be piloted by two people, one in the head and one in the belly; the head pilot is in charge of flying while the belly pilot controls the weapons. While in the air, the landing gear, based on the legs of the dragonfly hummingbird, retract to form a more compact and aerodynamic machine. The vehicle is designed with vertical take-off and can fly in any direction. The machine is also able to land anywhere, both vertically and horizontally, using magnetic landing pads that fold down to attach the suit to the surface."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Hummingbird_mecha_suit",
    "file": "avatar.wikia.com/wiki/Hummingbird_mecha_suit.html",
    "page": "Hummingbird_mecha_suit",
    "title": "Hummingbird mecha suit"
  }
}