{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Real world",
      "target": {
        "href": "Category_Real_world",
        "page": "Category_Real_world"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "",
      "links": [],
      "text": ""
    },
    {
      "body": "This article needs references to support its information. ${link_0}.",
      "links": [
        {
          "body": "See how to add them",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Wiki_S.O.S#Adding_references",
            "page": "Avatar_Wiki_S.O.S"
          }
        }
      ],
      "text": "This article needs references to support its information. See how to add them."
    },
    {
      "body": "${link_0} and ${link_1} are aesthetically and conceptually influenced by many real-world cultures, particularly China and other parts of East Asia. Other notable influences come from South Asia, mainly India, and various indigenous cultures from around the world. Contemporary American storytelling tropes are also interspersed throughout, such as the archetypal \"Hero's Journey\".",
      "links": [
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_0}",
          "target": {
            "href": "Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        },
        {
          "body": "The Legend of Korra",
          "key": "${link_1}",
          "target": {
            "href": "The_Legend_of_Korra",
            "page": "The_Legend_of_Korra"
          }
        }
      ],
      "text": "Avatar: The Last Airbender and The Legend of Korra are aesthetically and conceptually influenced by many real-world cultures, particularly China and other parts of East Asia. Other notable influences come from South Asia, mainly India, and various indigenous cultures from around the world. Contemporary American storytelling tropes are also interspersed throughout, such as the archetypal \"Hero's Journey\"."
    },
    {
      "body": "Chihiro and Kohaku, two characters from Hayao Miyazaki's Spirited Away, a major influence on Avatar.",
      "links": [],
      "text": "Chihiro and Kohaku, two characters from Hayao Miyazaki's Spirited Away, a major influence on Avatar."
    },
    {
      "body": "The artistic and animation styles used in Avatar are clearly influenced by various forms of Japanese anime.",
      "links": [],
      "text": "The artistic and animation styles used in Avatar are clearly influenced by various forms of Japanese anime."
    },
    {
      "body": "Avatar creators ${link_0} and ${link_1} confirmed a particular anime influence in a magazine interview:",
      "links": [
        {
          "body": "Bryan Konietzko",
          "key": "${link_0}",
          "target": {
            "href": "Bryan_Konietzko",
            "page": "Bryan_Konietzko"
          }
        },
        {
          "body": "Michael Dante DiMartino",
          "key": "${link_1}",
          "target": {
            "href": "Michael_Dante_DiMartino",
            "page": "Michael_Dante_DiMartino"
          }
        }
      ],
      "text": "Avatar creators Bryan Konietzko and Michael Dante DiMartino confirmed a particular anime influence in a magazine interview:"
    },
    {
      "body": "\"The best anime balances great action sequences with humor and emotion, something we try to do on Avatar. We love all the films of Hayao Miyazaki, especially Spirited Away and Princess Mononoke. Both movies deal with spirituality and the environment in an entertaining way. Also, there's a lot of great animation.\"",
      "links": [],
      "text": "\"The best anime balances great action sequences with humor and emotion, something we try to do on Avatar. We love all the films of Hayao Miyazaki, especially Spirited Away and Princess Mononoke. Both movies deal with spirituality and the environment in an entertaining way. Also, there's a lot of great animation.\""
    },
    {
      "body": "According to an interview with the artists of Avatar, ${link_0}'s design was based on the Catbus in My Neighbor Totoro, due to the peculiar task of creating a mammal with six legs.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "According to an interview with the artists of Avatar, Appa's design was based on the Catbus in My Neighbor Totoro, due to the peculiar task of creating a mammal with six legs."
    },
    {
      "body": "Avatar draws inspiration from Shinichiro Watanabe's Cowboy Bebop and Samurai Champloo, as well as FLCL of Gainax. Other various studios from which inspiration was drawn include STUDIO4 °C, Production I.G, and Studio Ghibli. Bryan has commented that some of his most cherished Watanabe fight scenes were the fight between Bebop's Spike Spiegel and a drug smuggler in \"Asteroid Blues\", as well as the duel between Mugen and Sara in the Champloo episode \"Elegy of Entrapment (Verse 2)\". Avatar director Giancarlo Volpe also claims the staff \"were all ordered to buy FLCL and watch every single episode of it\".",
      "links": [],
      "text": "Avatar draws inspiration from Shinichiro Watanabe's Cowboy Bebop and Samurai Champloo, as well as FLCL of Gainax. Other various studios from which inspiration was drawn include STUDIO4 °C, Production I.G, and Studio Ghibli. Bryan has commented that some of his most cherished Watanabe fight scenes were the fight between Bebop's Spike Spiegel and a drug smuggler in \"Asteroid Blues\", as well as the duel between Mugen and Sara in the Champloo episode \"Elegy of Entrapment (Verse 2)\". Avatar director Giancarlo Volpe also claims the staff \"were all ordered to buy FLCL and watch every single episode of it\"."
    },
    {
      "body": "The choreographed martial art ${link_0} moves were profoundly inspired by Asian cinema. Avatar creators Bryan Konietzko and Michael Dante DiMartino stated the particular influence in a magazine interview:",
      "links": [
        {
          "body": "bending",
          "key": "${link_0}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "The choreographed martial art bending moves were profoundly inspired by Asian cinema. Avatar creators Bryan Konietzko and Michael Dante DiMartino stated the particular influence in a magazine interview:"
    },
    {
      "body": "\"Asian cinema is really good at action comedy. Shaolin Soccer is one of our favorite movies. It has tons of fantastic action and lots of funny moments. Some of the effects provided inspiration for how bending moves might look on the show.\"",
      "links": [],
      "text": "\"Asian cinema is really good at action comedy. Shaolin Soccer is one of our favorite movies. It has tons of fantastic action and lots of funny moments. Some of the effects provided inspiration for how bending moves might look on the show.\""
    },
    {
      "body": "Numerous moments in the series also draws parallels with the highly acclaimed film Crouching Tiger, Hidden Dragon, one of the highest grossing foreign films to date. In particular, the score for the film and the types of weapons can be seen within the series, more commonly toward the end of ${link_0} and the entirety of ${link_1}. Notably, the fighting style used by the ${link_2} closely resembles the Jade Fox's acupressure technique, and ${link_3}'s own fighting style mimics several scenes in this film. This style can be seen throughout numerous other wuxia films.",
      "links": [
        {
          "body": "Book Two: Earth",
          "key": "${link_0}",
          "target": {
            "href": "Book_Two__Earth",
            "page": "Book_Two__Earth"
          }
        },
        {
          "body": "Book Three: Fire",
          "key": "${link_1}",
          "target": {
            "href": "Book_Three__Fire",
            "page": "Book_Three__Fire"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_2}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Azula",
          "key": "${link_3}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Numerous moments in the series also draws parallels with the highly acclaimed film Crouching Tiger, Hidden Dragon, one of the highest grossing foreign films to date. In particular, the score for the film and the types of weapons can be seen within the series, more commonly toward the end of Book Two: Earth and the entirety of Book Three: Fire. Notably, the fighting style used by the Kyoshi Warriors closely resembles the Jade Fox's acupressure technique, and Azula's own fighting style mimics several scenes in this film. This style can be seen throughout numerous other wuxia films."
    },
    {
      "body": "Another similarity is that of Zhang Ziyi's character, Yu Jiao Long, and ${link_0}. Both are the daughters of noblemen, and are expected to continue to bring honor to their family. In Jiao's case, it is by entering an arranged marriage; Toph must remain hidden and submissive to please her parents. Both are forced to keep the extent of their talents a secret, an idea that is echoed in the title of the film, and both characters also developed through allowing these secrets to become known, and the problems held with their parents were either left ambiguous, or never resolved.",
      "links": [
        {
          "body": "Toph Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Another similarity is that of Zhang Ziyi's character, Yu Jiao Long, and Toph Beifong. Both are the daughters of noblemen, and are expected to continue to bring honor to their family. In Jiao's case, it is by entering an arranged marriage; Toph must remain hidden and submissive to please her parents. Both are forced to keep the extent of their talents a secret, an idea that is echoed in the title of the film, and both characters also developed through allowing these secrets to become known, and the problems held with their parents were either left ambiguous, or never resolved."
    },
    {
      "body": "In addition, the fight scenes in John Woo films have been alluded to as an influence, and the shot of ${link_0} and the ${link_1} in \"${link_2}\" was stated to be a direct reference to Woo.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "doves",
          "key": "${link_1}",
          "target": {
            "href": "Dove",
            "page": "Dove"
          }
        },
        {
          "body": "The Beach",
          "key": "${link_2}",
          "target": {
            "href": "The_Beach",
            "page": "The_Beach"
          }
        }
      ],
      "text": "In addition, the fight scenes in John Woo films have been alluded to as an influence, and the shot of Zuko and the doves in \"The Beach\" was stated to be a direct reference to Woo."
    },
    {
      "body": "Book series and novels such as Harry Potter and The Lord of the Rings were a heavy influence in developing the story of Avatar. The creators wanted to tell their own epic \"legend & love story\". The creators have stated that they have relied on traditional archetypes and motifs for creating their characters. They have cited Joseph Campbell as an influence in creating the storyline and characters for the show.",
      "links": [],
      "text": "Book series and novels such as Harry Potter and The Lord of the Rings were a heavy influence in developing the story of Avatar. The creators wanted to tell their own epic \"legend & love story\". The creators have stated that they have relied on traditional archetypes and motifs for creating their characters. They have cited Joseph Campbell as an influence in creating the storyline and characters for the show."
    },
    {
      "body": "The Five Elements were first developed in India and the Five Classical Elements of Hinduism and Buddhism: earth, water, air, fire, and Aether, have been influential in the development of the show, providing the backbone of the five elements seen in the Avatar series.",
      "links": [],
      "text": "The Five Elements were first developed in India and the Five Classical Elements of Hinduism and Buddhism: earth, water, air, fire, and Aether, have been influential in the development of the show, providing the backbone of the five elements seen in the Avatar series."
    },
    {
      "body": "The culture of the ${link_0}, as well as their location in the polar regions of the world, is primarily based on the real-life Arctic cultures such as the Inuit and Yupik. Elements of their society also draw from many other indigenous cultures, including Aboriginal Australians, Native Americans, and Pacific Islanders.",
      "links": [
        {
          "body": "Water Tribes",
          "key": "${link_0}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        }
      ],
      "text": "The culture of the Water Tribes, as well as their location in the polar regions of the world, is primarily based on the real-life Arctic cultures such as the Inuit and Yupik. Elements of their society also draw from many other indigenous cultures, including Aboriginal Australians, Native Americans, and Pacific Islanders."
    },
    {
      "body": "The architecture, clothing and ${link_0} of the Earth Kingdom seems to be based primarily on China and its neighboring states. The many tribes and towns throughout the Earth Kingdom can also resemble other cultures.",
      "links": [
        {
          "body": "culture",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom#Culture",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "The architecture, clothing and culture of the Earth Kingdom seems to be based primarily on China and its neighboring states. The many tribes and towns throughout the Earth Kingdom can also resemble other cultures."
    },
    {
      "body": "Ba Sing Se, the capital of the Earth Kingdom is based on ancient Chinese capitals such as Beijing, as the creators were inspired by the idea of an isolated city. It also has significant influences from Qing Dynasty China.",
      "links": [],
      "text": "Ba Sing Se, the capital of the Earth Kingdom is based on ancient Chinese capitals such as Beijing, as the creators were inspired by the idea of an isolated city. It also has significant influences from Qing Dynasty China."
    },
    {
      "body": "The ${link_0} of the ${link_1} is primarily inspired by China, South Asia and Southeast Asia.",
      "links": [
        {
          "body": "culture",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation#Culture",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "The culture of the Fire Nation is primarily inspired by China, South Asia and Southeast Asia."
    },
    {
      "body": "The ${link_0} are based primarily on Tibetan culture, the Shaolin Monks, and Sri Lankan Buddhism. Other influences are drawn from Hinduism - notably, the seven chakras.",
      "links": [
        {
          "body": "Air Nomads",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "text": "The Air Nomads are based primarily on Tibetan culture, the Shaolin Monks, and Sri Lankan Buddhism. Other influences are drawn from Hinduism - notably, the seven chakras."
    },
    {
      "body": "The four main bending styles are based almost entirely upon traditional Chinese martial arts.",
      "links": [],
      "text": "The four main bending styles are based almost entirely upon traditional Chinese martial arts."
    },
    {
      "body": "Ba Gua, the basis for ${link_0}.",
      "links": [
        {
          "body": "airbending",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Ba Gua, the basis for airbending."
    },
    {
      "body": "The erratic, circular movements of Airbending are derived from Ba Gua. It is sometimes called Bagua Zhang's, a characteristic method of stance and movement based on the theory of continuously changing in response to the situation at hand in order to overcome an opponent with skill rather than brute force. It is more broadly grouped as an internal practice.",
      "links": [],
      "text": "The erratic, circular movements of Airbending are derived from Ba Gua. It is sometimes called Bagua Zhang's, a characteristic method of stance and movement based on the theory of continuously changing in response to the situation at hand in order to overcome an opponent with skill rather than brute force. It is more broadly grouped as an internal practice."
    },
    {
      "body": "Airbending is notable for being almost entirely defensive, however it is reputed to be the most dynamic of the four bending arts. Airbenders can overwhelm many opponents at once with large and powerful attacks that could prove fatal; however due to the pacifist nature of the Air Nomads such attacks are rarely used.",
      "links": [],
      "text": "Airbending is notable for being almost entirely defensive, however it is reputed to be the most dynamic of the four bending arts. Airbenders can overwhelm many opponents at once with large and powerful attacks that could prove fatal; however due to the pacifist nature of the Air Nomads such attacks are rarely used."
    },
    {
      "body": "Tai Chi, the basis for ${link_0}.",
      "links": [
        {
          "body": "waterbending",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Tai Chi, the basis for waterbending."
    },
    {
      "body": "The slow, flowing movements of T'ai Chi are the basis of waterbending. In the real world, T'ai Chi, and the martial practice of T'ai Chi Chuan, is classified as an \"internal style\", which means that it emphasizes refinement and relaxation before aggression. It emphasizes alignment, body structure, breath, and visualization. The combat forms of waterbending revolve around those of the Chen and Wu styles, self-defense and fighting respectively, of T'ai Chi Ch'uan.",
      "links": [],
      "text": "The slow, flowing movements of T'ai Chi are the basis of waterbending. In the real world, T'ai Chi, and the martial practice of T'ai Chi Chuan, is classified as an \"internal style\", which means that it emphasizes refinement and relaxation before aggression. It emphasizes alignment, body structure, breath, and visualization. The combat forms of waterbending revolve around those of the Chen and Wu styles, self-defense and fighting respectively, of T'ai Chi Ch'uan."
    },
    {
      "body": "Waterbenders have the ability to heal by using water as a catalyst for manipulating Chi paths in the body. Tai Chi is said to have many health benefits, particularly in the non-martial realm of Tai Chi Chih. This form focuses on developing and balancing one's chi.",
      "links": [],
      "text": "Waterbenders have the ability to heal by using water as a catalyst for manipulating Chi paths in the body. Tai Chi is said to have many health benefits, particularly in the non-martial realm of Tai Chi Chih. This form focuses on developing and balancing one's chi."
    },
    {
      "body": "Hung Gar, the basis for ${link_0}.",
      "links": [
        {
          "body": "earthbending",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Hung Gar, the basis for earthbending."
    },
    {
      "body": "The firmly rooted stances and powerful strikes of Hung Gar are the basis for earthbending. In the real world, Hung Gar is an \"external style\", which means that its art emphasizes use of the art for defense purposes before refinement and relaxation.",
      "links": [],
      "text": "The firmly rooted stances and powerful strikes of Hung Gar are the basis for earthbending. In the real world, Hung Gar is an \"external style\", which means that its art emphasizes use of the art for defense purposes before refinement and relaxation."
    },
    {
      "body": "Toph's bending is unique in that it is based on Chu Gar Southern Praying Mantis instead of Hung Gar. This style, also \"external\", emphasizes more close-range attacks from the upper body, keeping the feet firmly on the ground or very close to it.",
      "links": [],
      "text": "Toph's bending is unique in that it is based on Chu Gar Southern Praying Mantis instead of Hung Gar. This style, also \"external\", emphasizes more close-range attacks from the upper body, keeping the feet firmly on the ground or very close to it."
    },
    {
      "body": "Northern Shaolin kung fu, the basis for ${link_0}.",
      "links": [
        {
          "body": "firebending",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Northern Shaolin kung fu, the basis for firebending."
    },
    {
      "body": "The fast, hard, aggressive strikes of Northern Shaolin style are used for firebending. The style sacrifices defense for fierce attacks. Northern Shaolin is complex and subtle art that retains a pure essence of structured movement and posture. In the Chinese martial art classification system, Northern Shaolin is an \"external\" art.",
      "links": [],
      "text": "The fast, hard, aggressive strikes of Northern Shaolin style are used for firebending. The style sacrifices defense for fierce attacks. Northern Shaolin is complex and subtle art that retains a pure essence of structured movement and posture. In the Chinese martial art classification system, Northern Shaolin is an \"external\" art."
    },
    {
      "body": "Firebending is notable for its intensive attacking style and general lack of adequate defense moves, although some notable firebenders utilize creative defensive moves. For example, ${link_0} can create fire walls, and Zuko can easily block and shoot down incoming objects.",
      "links": [
        {
          "body": "Jeong Jeong",
          "key": "${link_0}",
          "target": {
            "href": "Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        }
      ],
      "text": "Firebending is notable for its intensive attacking style and general lack of adequate defense moves, although some notable firebenders utilize creative defensive moves. For example, Jeong Jeong can create fire walls, and Zuko can easily block and shoot down incoming objects."
    },
    {
      "body": "Sokka's boomerang is based on the 'returning boomerangs', one of two curved weapons used by Aboriginal Australians. Other tribal groups around the world, including Native Americans and South Asians, have used boomerangs to hunt, but these boomerangs would not return to the thrower. The name 'boomerang' was used by the Turuwal people who lived in South Sydney, and is used only to refer to boomerangs which did return.",
      "links": [],
      "text": "Sokka's boomerang is based on the 'returning boomerangs', one of two curved weapons used by Aboriginal Australians. Other tribal groups around the world, including Native Americans and South Asians, have used boomerangs to hunt, but these boomerangs would not return to the thrower. The name 'boomerang' was used by the Turuwal people who lived in South Sydney, and is used only to refer to boomerangs which did return."
    },
    {
      "body": "Zuko dual-wields dao sabres, often while in his Blue Spirit persona. One of the four major Chinese weapons, the dao is known as \"the most reckless and daring of all weapons\". Unlike Sokka's space sword, Zuko's swords are like traditional dao — single handed and single edged.",
      "links": [],
      "text": "Zuko dual-wields dao sabres, often while in his Blue Spirit persona. One of the four major Chinese weapons, the dao is known as \"the most reckless and daring of all weapons\". Unlike Sokka's space sword, Zuko's swords are like traditional dao — single handed and single edged."
    },
    {
      "body": "Also known as tiger hook swords or 'Heaven and Sun Moon Sword' (乾坤日月刀), these weapons have a blade similar to that of the jian, though possibly thicker or unsharpened, with a prong or hook similar to a shepherd's crook near the tip. Guards are substantial, in the style of butterfly swords. Often used in pairs, the hooks of the weapons may be used to trap or deflect other weapons.",
      "links": [],
      "text": "Also known as tiger hook swords or 'Heaven and Sun Moon Sword' (乾坤日月刀), these weapons have a blade similar to that of the jian, though possibly thicker or unsharpened, with a prong or hook similar to a shepherd's crook near the tip. Guards are substantial, in the style of butterfly swords. Often used in pairs, the hooks of the weapons may be used to trap or deflect other weapons."
    },
    {
      "body": "Sokka's \"space sword\" is a jian (剑), a Chinese, double-edged straight sword. The jian has a 2,500-year history and is considered one of the major Chinese weapons. Known as \"The Gentleman of Weapons\" the jian is a multi-purpose weapon used for cutting, thrusting, slashing, and stabbing. One of the trademarks of Chinese wuxia storytelling, special jian swords, like Sokka's \"space sword\" are often featured prominently in the story.",
      "links": [],
      "text": "Sokka's \"space sword\" is a jian (剑), a Chinese, double-edged straight sword. The jian has a 2,500-year history and is considered one of the major Chinese weapons. Known as \"The Gentleman of Weapons\" the jian is a multi-purpose weapon used for cutting, thrusting, slashing, and stabbing. One of the trademarks of Chinese wuxia storytelling, special jian swords, like Sokka's \"space sword\" are often featured prominently in the story."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Influences_on_the_Avatar_series",
    "file": "avatar.wikia.com/wiki/Influences_on_the_Avatar_series.html",
    "page": "Influences_on_the_Avatar_series",
    "title": "Influences on the Avatar series"
  }
}