{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "href": "Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    },
    {
      "body": "Iroh",
      "target": {
        "href": "Category_Iroh",
        "page": "Category_Iroh"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Iroh acquired many allies due to his wisdom and easy-going, friendly personality; his ${link_2} as a ${link_3} citizen, however, resulted in rivalry with others.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "status",
          "key": "${link_2}",
          "target": {
            "href": "Society_in_the_World_of_Avatar",
            "page": "Society_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "This page is comprised of Iroh's relationships with other characters in the World of Avatar. Iroh acquired many allies due to his wisdom and easy-going, friendly personality; his status as a Fire Nation citizen, however, resulted in rivalry with others."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Iroh and Azula."
    },
    {
      "body": "Little is known about Iroh's relationship with ${link_0}. While Iroh seemingly cared for Azula when she was little, as seen when he sent her a doll from the ${link_1}, that attachment deteriorated. Iroh once stated that Azula was \"crazy and [needed] to go down\" (these words were oddly prophetic as Azula suffered a mental breakdown and was eventually defeated while she was in this condition). He did attempt to speak courteously toward her after having not seen her for a long time; however, she did not seem to return the favor kindly and insisted he be silent while she spoke to ${link_2}. During ${link_3}, Azula severely wounded Iroh with a blast of fire. Iroh consistently advised Zuko not to give in to her deceit and selfish demands. It was he who urged Zuko to face her one final time in order to claim his rightful title as ${link_4}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Siege of Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "href": "Siege_of_Ba_Sing_Se",
            "page": "Siege_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_2}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "a later encounter",
          "key": "${link_3}",
          "target": {
            "href": "Confrontation_at_Tu_Zin",
            "page": "Confrontation_at_Tu_Zin"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_4}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "text": "Little is known about Iroh's relationship with Azula. While Iroh seemingly cared for Azula when she was little, as seen when he sent her a doll from the Siege of Ba Sing Se, that attachment deteriorated. Iroh once stated that Azula was \"crazy and [needed] to go down\" (these words were oddly prophetic as Azula suffered a mental breakdown and was eventually defeated while she was in this condition). He did attempt to speak courteously toward her after having not seen her for a long time; however, she did not seem to return the favor kindly and insisted he be silent while she spoke to Zuko. During a later encounter, Azula severely wounded Iroh with a blast of fire. Iroh consistently advised Zuko not to give in to her deceit and selfish demands. It was he who urged Zuko to face her one final time in order to claim his rightful title as Fire Lord."
    },
    {
      "body": "It is known that ${link_0} was a fierce defender of Iroh's birthright; he expressed outrage when ${link_1} suggested that Iroh should be stripped of it due to ${link_2}'s death, suggesting favoritism toward his older son. Azulon felt Iroh's terrible pain after the death of Lu Ten and did not seem angry at his son after he abandoned the Siege of ${link_3}. Iroh never attended his father's funeral, as he was still on his way home.",
      "links": [
        {
          "body": "Azulon",
          "key": "${link_0}",
          "target": {
            "href": "Azulon",
            "page": "Azulon"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_1}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Lu Ten",
          "key": "${link_2}",
          "target": {
            "href": "Lu_Ten",
            "page": "Lu_Ten"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "It is known that Azulon was a fierce defender of Iroh's birthright; he expressed outrage when Ozai suggested that Iroh should be stripped of it due to Lu Ten's death, suggesting favoritism toward his older son. Azulon felt Iroh's terrible pain after the death of Lu Ten and did not seem angry at his son after he abandoned the Siege of Ba Sing Se. Iroh never attended his father's funeral, as he was still on his way home."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Lu Ten",
          "key": "${link_1}",
          "target": {
            "href": "Lu_Ten",
            "page": "Lu_Ten"
          }
        }
      ],
      "text": "Iroh and Lu Ten."
    },
    {
      "body": "Iroh appeared to have had a close relationship with his son Lu Ten, as they loved to play together during the latter's childhood. During the Siege of Ba Sing Se, where Iroh was the general in command, Lu Ten died in battle. The loss of his only son was so overwhelming that Iroh gave up on what could have been his greatest military achievement. Iroh continued to care deeply about his son, namely commemorating Lu Ten's birthday. In Ba Sing Se, he made a small shrine for his son and lit some incense. Upon the shrine, Iroh placed a picture of his son, on which Lu Ten wrote that he promised to see him soon after the war. He also sang about his son twice. Iroh seemed to have tried to fill this void in his life by trying to be a father figure to Zuko, since the latter's father largely ignored or acted abusively toward him and his ${link_0} could no longer raise him.",
      "links": [
        {
          "body": "mother",
          "key": "${link_0}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        }
      ],
      "text": "Iroh appeared to have had a close relationship with his son Lu Ten, as they loved to play together during the latter's childhood. During the Siege of Ba Sing Se, where Iroh was the general in command, Lu Ten died in battle. The loss of his only son was so overwhelming that Iroh gave up on what could have been his greatest military achievement. Iroh continued to care deeply about his son, namely commemorating Lu Ten's birthday. In Ba Sing Se, he made a small shrine for his son and lit some incense. Upon the shrine, Iroh placed a picture of his son, on which Lu Ten wrote that he promised to see him soon after the war. He also sang about his son twice. Iroh seemed to have tried to fill this void in his life by trying to be a father figure to Zuko, since the latter's father largely ignored or acted abusively toward him and his mother could no longer raise him."
    },
    {
      "body": "Iroh should traditionally have become Fire Lord after Azulon's death, and Lu Ten would have succeeded Iroh had he not died in battle.",
      "links": [],
      "text": "Iroh should traditionally have become Fire Lord after Azulon's death, and Lu Ten would have succeeded Iroh had he not died in battle."
    },
    {
      "body": "While Iroh and his brother did not have any known interactions, the status of their relationship has been made clear: tension and mutual dislike. Ozai unquestionably bore resentment toward Iroh for being the firstborn son, and in his desire for the throne attempted to convince their father, Azulon, that Iroh was not a suitable successor after the death of ${link_0}, Iroh's son. Despite this animosity, however, Iroh never challenged his brother to reclaim his birthright. Holding little respect for his older brother, Ozai often belittled and spoke condescendingly of him, a trait inherited by his daughter. Iroh was not fond of the person his younger brother became and described him as being very powerful, yet merciless.",
      "links": [
        {
          "body": "Lu Ten",
          "key": "${link_0}",
          "target": {
            "href": "Lu_Ten",
            "page": "Lu_Ten"
          }
        }
      ],
      "text": "While Iroh and his brother did not have any known interactions, the status of their relationship has been made clear: tension and mutual dislike. Ozai unquestionably bore resentment toward Iroh for being the firstborn son, and in his desire for the throne attempted to convince their father, Azulon, that Iroh was not a suitable successor after the death of Lu Ten, Iroh's son. Despite this animosity, however, Iroh never challenged his brother to reclaim his birthright. Holding little respect for his older brother, Ozai often belittled and spoke condescendingly of him, a trait inherited by his daughter. Iroh was not fond of the person his younger brother became and described him as being very powerful, yet merciless."
    },
    {
      "body": "It is known that Ursa cared for her brother-in-law and publicly scolded Azula when the latter stated if Iroh were to be killed in the Siege of Ba Sing Se, Ozai would become the Fire Lord's heir. Ursa defended Iroh, saying that it would be terrible if he did not survive the siege, and was devastated to learn that the general lost his son, Lu Ten, during the battle.",
      "links": [],
      "text": "It is known that Ursa cared for her brother-in-law and publicly scolded Azula when the latter stated if Iroh were to be killed in the Siege of Ba Sing Se, Ozai would become the Fire Lord's heir. Ursa defended Iroh, saying that it would be terrible if he did not survive the siege, and was devastated to learn that the general lost his son, Lu Ten, during the battle."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Iroh and Zuko."
    },
    {
      "body": "Iroh always cared for Zuko. After Lu Ten's death, Iroh began to think of Zuko as his own son and cared for him like a father. Iroh supported Zuko in every way he could and was a constant mentor to the troubled boy throughout his banishment.",
      "links": [],
      "text": "Iroh always cared for Zuko. After Lu Ten's death, Iroh began to think of Zuko as his own son and cared for him like a father. Iroh supported Zuko in every way he could and was a constant mentor to the troubled boy throughout his banishment."
    },
    {
      "body": "Iroh offered Zuko advice on how to defeat ${link_0} when the two faced off in an ${link_1}. At the end of the fight, Iroh stopped Zhao from harming Zuko from behind, declaring that his nephew had more honor than the commander despite being exiled. Iroh voiced his affection for Zuko when they traveled toward the ${link_2}. He showed great sadness when he thought Zuko had died and later confessed his fatherly nature to Zuko by telling him he thought of Zuko as his own. Despite Zuko's claims that he would be fine on his quest to capture the Avatar, Iroh still looked genuinely worried.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_1}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "text": "Iroh offered Zuko advice on how to defeat Zhao when the two faced off in an Agni Kai. At the end of the fight, Iroh stopped Zhao from harming Zuko from behind, declaring that his nephew had more honor than the commander despite being exiled. Iroh voiced his affection for Zuko when they traveled toward the Northern Water Tribe. He showed great sadness when he thought Zuko had died and later confessed his fatherly nature to Zuko by telling him he thought of Zuko as his own. Despite Zuko's claims that he would be fine on his quest to capture the Avatar, Iroh still looked genuinely worried."
    },
    {
      "body": "When Zuko and Iroh traveled throughout the ${link_0}, they became more reliant on each other. Even though they were all each other had left, Zuko left Iroh for a short time. Iroh later encountered and talked with ${link_1}, and during this meeting, according to Toph, Iroh would not stop talking about Zuko. Before he and Zuko reunited, Toph suggested that Iroh tell Zuko that he needed him.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "When Zuko and Iroh traveled throughout the Earth Kingdom, they became more reliant on each other. Even though they were all each other had left, Zuko left Iroh for a short time. Iroh later encountered and talked with Toph, and during this meeting, according to Toph, Iroh would not stop talking about Zuko. Before he and Zuko reunited, Toph suggested that Iroh tell Zuko that he needed him."
    },
    {
      "body": "Iroh resumed Zuko's ${link_0} and taught him how to ${link_1}, but would not ${link_2} at Zuko due to the risks.",
      "links": [
        {
          "body": "firebending training",
          "key": "${link_0}",
          "target": {
            "href": "Firebending_training",
            "page": "Firebending_training"
          }
        },
        {
          "body": "redirect lightning",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        },
        {
          "body": "shoot lightning",
          "key": "${link_2}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        }
      ],
      "text": "Iroh resumed Zuko's firebending training and taught him how to redirect lightning, but would not shoot lightning at Zuko due to the risks."
    },
    {
      "body": "Iroh later decided that he and Zuko would be safe from Azula's grasp if they fled to Ba Sing Se as ${link_0}. During their stay there, Iroh and Zuko worked together in ${link_1} in the city's Lower Ring, and they lived together in an ${link_2}. Despite Zuko's obvious disdain for his life as a refugee, Iroh remained patient and constantly encouraged Zuko to look at the positives. He went so far as to encourage Zuko to find a nice \"lady friend\" and prompted Zuko to go on his date with ${link_3}.",
      "links": [
        {
          "body": "refugees",
          "key": "${link_0}",
          "target": {
            "href": "Refugees",
            "page": "Refugees"
          }
        },
        {
          "body": "a tea shop",
          "key": "${link_1}",
          "target": {
            "href": "Pao_Family_Tea_House",
            "page": "Pao_Family_Tea_House"
          }
        },
        {
          "body": "apartment",
          "key": "${link_2}",
          "target": {
            "href": "Iroh_and_Zuko%27s_apartment",
            "page": "Iroh_and_Zuko%27s_apartment"
          }
        },
        {
          "body": "Jin",
          "key": "${link_3}",
          "target": {
            "href": "Jin",
            "page": "Jin"
          }
        }
      ],
      "text": "Iroh later decided that he and Zuko would be safe from Azula's grasp if they fled to Ba Sing Se as refugees. During their stay there, Iroh and Zuko worked together in a tea shop in the city's Lower Ring, and they lived together in an apartment. Despite Zuko's obvious disdain for his life as a refugee, Iroh remained patient and constantly encouraged Zuko to look at the positives. He went so far as to encourage Zuko to find a nice \"lady friend\" and prompted Zuko to go on his date with Jin."
    },
    {
      "body": "When Zuko learned that ${link_0} was in the city looking for his ${link_1}, Iroh encouraged Zuko not to go looking for trouble. When Zuko tried to capture ${link_2}, Iroh stopped him and insisted that he had to stop letting others control his destiny, namely his father. This encouraged Zuko to instead free Appa and abandon his identity as the Blue Spirit, whom he was dressed as during the capture.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "bison",
          "key": "${link_1}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "Appa",
          "key": "${link_2}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "When Zuko learned that Aang was in the city looking for his bison, Iroh encouraged Zuko not to go looking for trouble. When Zuko tried to capture Appa, Iroh stopped him and insisted that he had to stop letting others control his destiny, namely his father. This encouraged Zuko to instead free Appa and abandon his identity as the Blue Spirit, whom he was dressed as during the capture."
    },
    {
      "body": "The two returned to their apartment after Zuko freed Appa, but almost immediately after arriving, Zuko collapsed to the floor with a terrible fever. Through his sickness, Iroh was by Zuko's side day and night to comfort him and care for him, knowing that his spirit would be cleansed as a result of his better decisions. Zuko started taking on a more positive attitude after he regained his health and the two were happy to work in ${link_0} in the Upper Ring.",
      "links": [
        {
          "body": "their new tea shop",
          "key": "${link_0}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "text": "The two returned to their apartment after Zuko freed Appa, but almost immediately after arriving, Zuko collapsed to the floor with a terrible fever. Through his sickness, Iroh was by Zuko's side day and night to comfort him and care for him, knowing that his spirit would be cleansed as a result of his better decisions. Zuko started taking on a more positive attitude after he regained his health and the two were happy to work in their new tea shop in the Upper Ring."
    },
    {
      "body": "Zuko and Iroh's relationship was jeopardized during the events that eventually occurred. Azula captured Zuko and asked him to help her ${link_0}, which would earn Zuko his father's respect and possibly restore his honor. Iroh vehemently insisted that Zuko must do what his heart told him and not to give into another's demands. This failed when Zuko helped Azula defeat Aang and ${link_1} and conquer Ba Sing Se. Iroh was later captured and was clearly ashamed of Zuko's actions. Zuko regretted his actions almost immediately.",
      "links": [
        {
          "body": "conquer the city",
          "key": "${link_0}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Zuko and Iroh's relationship was jeopardized during the events that eventually occurred. Azula captured Zuko and asked him to help her conquer the city, which would earn Zuko his father's respect and possibly restore his honor. Iroh vehemently insisted that Zuko must do what his heart told him and not to give into another's demands. This failed when Zuko helped Azula defeat Aang and Katara and conquer Ba Sing Se. Iroh was later captured and was clearly ashamed of Zuko's actions. Zuko regretted his actions almost immediately."
    },
    {
      "body": "During his time in the ${link_0}, Iroh initially refused to speak to Zuko, who called him a crazy old man. In an attempt to calm Zuko's inner turmoil, he revealed to Zuko his relationship with ${link_1} ${link_2} and that he could help restore balance to the world. Zuko eventually realized this destiny and joined Aang in his fight against the Fire Nation, but was too late to reconcile with Iroh, who had fled from prison during the ${link_3}",
      "links": [
        {
          "body": "Capital City Prison",
          "key": "${link_0}",
          "target": {
            "href": "Capital_City_Prison",
            "page": "Capital_City_Prison"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "solar eclipse.",
          "key": "${link_3}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        }
      ],
      "text": "During his time in the Capital City Prison, Iroh initially refused to speak to Zuko, who called him a crazy old man. In an attempt to calm Zuko's inner turmoil, he revealed to Zuko his relationship with Avatar Roku and that he could help restore balance to the world. Zuko eventually realized this destiny and joined Aang in his fight against the Fire Nation, but was too late to reconcile with Iroh, who had fled from prison during the solar eclipse."
    },
    {
      "body": "Iroh and Zuko finally reunited prior to the arrival of ${link_0}, with a repentant Zuko begging Iroh for forgiveness. Iroh quickly forgave his nephew, stating that he was never angry with him, but was sad that Zuko had lost his way. Zuko affirmed this, but said Iroh helped him find it. Iroh later encouraged Zuko to take his place as Fire Lord, as he was the more suitable heir due to his reputation and what he had learned from his mistakes. He prompted Zuko to ask for help defeating Azula, since she would not give up the throne easily. Zuko asked Katara, who accepted the request.",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "text": "Iroh and Zuko finally reunited prior to the arrival of Sozin's Comet, with a repentant Zuko begging Iroh for forgiveness. Iroh quickly forgave his nephew, stating that he was never angry with him, but was sad that Zuko had lost his way. Zuko affirmed this, but said Iroh helped him find it. Iroh later encouraged Zuko to take his place as Fire Lord, as he was the more suitable heir due to his reputation and what he had learned from his mistakes. He prompted Zuko to ask for help defeating Azula, since she would not give up the throne easily. Zuko asked Katara, who accepted the request."
    },
    {
      "body": "Iroh's guidance to his nephew gave Zuko the strength needed to defeat Azula and to claim his rightful place as Fire Lord, and the desire to restore peace and unity to the divided world. Zuko and Iroh were on much better terms when the ${link_0} was over, and the two were happy to be serving their friends tea together in Ba Sing Se after the ${link_1}.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "city's liberation",
          "key": "${link_1}",
          "target": {
            "href": "Liberation_of_Ba_Sing_Se",
            "page": "Liberation_of_Ba_Sing_Se"
          }
        }
      ],
      "text": "Iroh's guidance to his nephew gave Zuko the strength needed to defeat Azula and to claim his rightful place as Fire Lord, and the desire to restore peace and unity to the divided world. Zuko and Iroh were on much better terms when the Hundred Year War was over, and the two were happy to be serving their friends tea together in Ba Sing Se after the city's liberation."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "June",
          "key": "${link_0}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "June and Iroh."
    },
    {
      "body": "Early in ${link_0}, a bounty hunter named ${link_1} ventured onto ${link_2} in order to capture a stowaway who had taken refuge there. Iroh developed an immediate interest in her. Soon after, Iroh and Zuko tracked her down and hired her to find Aang, using the scent from ${link_3}. They successfully found Aang at a nearby ${link_4} where a duel subsequently ensued. When June's ${link_5}, ${link_6}, was blinded by the miasma of perfume that Katara had ${link_7}, he lashed out in confusion, striking both June and Zuko and paralyzing them. Iroh caught June and feigned paralysis in order to hold her closely. When Zuko pointed this out, Iroh tried to quiet him. June overheard this, expressing clear irritation.",
      "links": [
        {
          "body": "100 AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#War_years_.280_.E2.80.93_100_AG.29",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "June",
          "key": "${link_1}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "Zuko's ship",
          "key": "${link_2}",
          "target": {
            "href": "Zuko%27s_ship",
            "page": "Zuko%27s_ship"
          }
        },
        {
          "body": "Katara's necklace",
          "key": "${link_3}",
          "target": {
            "href": "Katara%27s_necklace",
            "page": "Katara%27s_necklace"
          }
        },
        {
          "body": "abbey",
          "key": "${link_4}",
          "target": {
            "href": "Abbey",
            "page": "Abbey"
          }
        },
        {
          "body": "shirshu",
          "key": "${link_5}",
          "target": {
            "href": "Shirshu",
            "page": "Shirshu"
          }
        },
        {
          "body": "Nyla",
          "key": "${link_6}",
          "target": {
            "href": "Nyla",
            "page": "Nyla"
          }
        },
        {
          "body": "waterbent",
          "key": "${link_7}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Early in 100 AG, a bounty hunter named June ventured onto Zuko's ship in order to capture a stowaway who had taken refuge there. Iroh developed an immediate interest in her. Soon after, Iroh and Zuko tracked her down and hired her to find Aang, using the scent from Katara's necklace. They successfully found Aang at a nearby abbey where a duel subsequently ensued. When June's shirshu, Nyla, was blinded by the miasma of perfume that Katara had waterbent, he lashed out in confusion, striking both June and Zuko and paralyzing them. Iroh caught June and feigned paralysis in order to hold her closely. When Zuko pointed this out, Iroh tried to quiet him. June overheard this, expressing clear irritation."
    },
    {
      "body": "Months later, when Zuko and the rest of ${link_0} appealed to June for aid in finding Aang, and later Iroh, she recalled him quickly.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Months later, when Zuko and the rest of Team Avatar appealed to June for aid in finding Aang, and later Iroh, she recalled him quickly."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Iroh and Aang."
    },
    {
      "body": "Interaction between Aang and Iroh was minimal. During their first encounter, Iroh aided Zuko in attacking Aang, although Aang apparently did not hold a grudge against him for assisting Zuko. Aang found an ally in Iroh when they were defending the ${link_0} from Zhao. During a confrontation in an abandoned Earth Kingdom town, Iroh and Team Avatar joined forces and cornered Azula; the elder was wounded by Azula moments later. Iroh and Aang formally interacted when the firebender approached the team, requesting Toph's help in finding Zuko. While the two made their way to the ${link_1} of Ba Sing Se where Zuko had been imprisoned, Aang asked for Iroh's advice regarding the ${link_2} and the emotional dilemma he faced. Iroh stated that power was overrated and assured Aang he had made the right choice in coming to Katara's aid.",
      "links": [
        {
          "body": "Moon Spirit",
          "key": "${link_0}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Crystal Catacombs",
          "key": "${link_1}",
          "target": {
            "href": "Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "Interaction between Aang and Iroh was minimal. During their first encounter, Iroh aided Zuko in attacking Aang, although Aang apparently did not hold a grudge against him for assisting Zuko. Aang found an ally in Iroh when they were defending the Moon Spirit from Zhao. During a confrontation in an abandoned Earth Kingdom town, Iroh and Team Avatar joined forces and cornered Azula; the elder was wounded by Azula moments later. Iroh and Aang formally interacted when the firebender approached the team, requesting Toph's help in finding Zuko. While the two made their way to the Crystal Catacombs of Ba Sing Se where Zuko had been imprisoned, Aang asked for Iroh's advice regarding the Avatar State and the emotional dilemma he faced. Iroh stated that power was overrated and assured Aang he had made the right choice in coming to Katara's aid."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Iroh and Korra."
    },
    {
      "body": "Living in the ${link_0}, having left his body in the mortal world, Iroh met Avatar ${link_1} during her search for ${link_2} and the spirit portals. He helped her to escape the dark forest in which she found herself trapped and invited her to his tea shop where he was celebrating the wedding of ${link_3} with his spirit friends. He assisted Korra in overcoming her self-doubt and advised her to stay positive, both while being in the Spirit World, as in the mortal world. Since she had peace and light within her, Iroh told Korra that she had the ability to change her surrounding, giving that she searched for the light, as if she were to search for darkness, that would be all she would ever see. When Korra was leaving to return a wounded ${link_4} to its nest, Iroh wished her luck and told her he hoped to see her soon again, in her own life or the next life.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_2}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "May-Jim",
          "key": "${link_3}",
          "target": {
            "href": "May-Jim",
            "page": "May-Jim"
          }
        },
        {
          "body": "dragon bird spirit",
          "key": "${link_4}",
          "target": {
            "href": "Dragon_bird_spirit",
            "page": "Dragon_bird_spirit"
          }
        }
      ],
      "text": "Living in the Spirit World, having left his body in the mortal world, Iroh met Avatar Korra during her search for Jinora and the spirit portals. He helped her to escape the dark forest in which she found herself trapped and invited her to his tea shop where he was celebrating the wedding of May-Jim with his spirit friends. He assisted Korra in overcoming her self-doubt and advised her to stay positive, both while being in the Spirit World, as in the mortal world. Since she had peace and light within her, Iroh told Korra that she had the ability to change her surrounding, giving that she searched for the light, as if she were to search for darkness, that would be all she would ever see. When Korra was leaving to return a wounded dragon bird spirit to its nest, Iroh wished her luck and told her he hoped to see her soon again, in her own life or the next life."
    },
    {
      "body": "After trading the physical world for the Spirit World, Iroh made many friends among the spirits, with whom he would drink ${link_0} and play ${link_1} at his new abode.",
      "links": [
        {
          "body": "tea",
          "key": "${link_0}",
          "target": {
            "href": "Tea",
            "page": "Tea"
          }
        },
        {
          "body": "Pai Sho",
          "key": "${link_1}",
          "target": {
            "href": "Pai_Sho",
            "page": "Pai_Sho"
          }
        }
      ],
      "text": "After trading the physical world for the Spirit World, Iroh made many friends among the spirits, with whom he would drink tea and play Pai Sho at his new abode."
    },
    {
      "body": "${link_0} and members of ${link_1}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Iroh and members of Team Avatar."
    },
    {
      "body": "Other than Aang, Zuko, and Toph, Iroh had little formal interaction with the rest of Team Avatar. Naturally, they were enemies while Zuko pursued the group, but as Zuko gradually changed his ways, Iroh came to respect the group more and more. He never actually fought them in direct combat, and thus few hard feelings existed between him and the other members. He sought the team's help to save Zuko from Azula's clutches in Ba Sing Se and later saved Aang and Katara's lives when Azula and Zuko tried to finish them off. Iroh later helped the team determine how they should assist in Ozai's final defeat when Sozin's Comet arrived. He clearly respected all of their abilities, as he did not argue when they chose their tasks, only offering encouragement. When the Hundred Year War was over, Iroh seemed to have befriended the entire team.",
      "links": [],
      "text": "Other than Aang, Zuko, and Toph, Iroh had little formal interaction with the rest of Team Avatar. Naturally, they were enemies while Zuko pursued the group, but as Zuko gradually changed his ways, Iroh came to respect the group more and more. He never actually fought them in direct combat, and thus few hard feelings existed between him and the other members. He sought the team's help to save Zuko from Azula's clutches in Ba Sing Se and later saved Aang and Katara's lives when Azula and Zuko tried to finish them off. Iroh later helped the team determine how they should assist in Ozai's final defeat when Sozin's Comet arrived. He clearly respected all of their abilities, as he did not argue when they chose their tasks, only offering encouragement. When the Hundred Year War was over, Iroh seemed to have befriended the entire team."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Iroh and Toph."
    },
    {
      "body": "Iroh met Toph by accident during her temporary leave of absence from Team Avatar. Alone in the woods, Toph ${link_0} someone move behind a large boulder. She quickly assumed her ${link_1} stance and launched a preemptive attack on an unsuspecting Iroh, whose only response was complaining of a sharp pain in his tailbone. They were shown later having tea and talking about Toph's relationship with Aang and the group. Toph resented being told what to do and having to comply with rules and protocol within the group. Iroh compared her sense of self-reliance and independence with Zuko's. He stated that \"there [was] nothing wrong with letting people who love you help you\". Toph chose to acknowledge Iroh's words of wisdom and returned to help the gang. Having earned her trust, Iroh came to her for help when Zuko was captured in Ba Sing Se.",
      "links": [
        {
          "body": "sensed",
          "key": "${link_0}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Iroh met Toph by accident during her temporary leave of absence from Team Avatar. Alone in the woods, Toph sensed someone move behind a large boulder. She quickly assumed her earthbending stance and launched a preemptive attack on an unsuspecting Iroh, whose only response was complaining of a sharp pain in his tailbone. They were shown later having tea and talking about Toph's relationship with Aang and the group. Toph resented being told what to do and having to comply with rules and protocol within the group. Iroh compared her sense of self-reliance and independence with Zuko's. He stated that \"there [was] nothing wrong with letting people who love you help you\". Toph chose to acknowledge Iroh's words of wisdom and returned to help the gang. Having earned her trust, Iroh came to her for help when Zuko was captured in Ba Sing Se."
    },
    {
      "body": "After end of the Hundred Year War, they shared tea with the rest of the Team Avatar in Iroh's tea shop, the Jasmine Dragon, in Ba Sing Se.",
      "links": [],
      "text": "After end of the Hundred Year War, they shared tea with the rest of the Team Avatar in Iroh's tea shop, the Jasmine Dragon, in Ba Sing Se."
    },
    {
      "body": "${link_0} using his ${link_1} against the ${link_2}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "breath of fire",
          "key": "${link_1}",
          "target": {
            "href": "Firebending#Special_techniques",
            "page": "Firebending"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_2}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "Iroh using his breath of fire against the Dai Li."
    },
    {
      "body": "Iroh first encountered the ${link_0} in Ba Sing Se when he and Zuko were tricked into coming to the ${link_1}'s palace to personally serve him tea, unaware that the invitation was a bait to lure them into a trap set by Azula for herself and the Dai Li to capture them. Iroh in turn tricked Azula and the Dai Li by asking if he ever told Azula how he earned the title of \"Dragon of the West\". With that, he answered his own question with a demonstration by drinking his tea and exhaling a powerful torrent of fire at the Dai Li. With the agents distracted, Iroh and Zuko ran away, the former still breathing fire at the Dai Li before catching up with the latter. Iroh escaped the clutches of his niece, but Zuko declared it was time he faced his sister, only to be captured himself. Aware that Team Avatar was in Ba Sing Se, Iroh sought their help in saving his nephew from captivity, forming an official alliance with Team Avatar and vowing himself not to allow Zuko to hurt or hinder Team Avatar ever again.",
      "links": [
        {
          "body": "Dai Li",
          "key": "${link_0}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_1}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "Iroh first encountered the Dai Li in Ba Sing Se when he and Zuko were tricked into coming to the Earth King's palace to personally serve him tea, unaware that the invitation was a bait to lure them into a trap set by Azula for herself and the Dai Li to capture them. Iroh in turn tricked Azula and the Dai Li by asking if he ever told Azula how he earned the title of \"Dragon of the West\". With that, he answered his own question with a demonstration by drinking his tea and exhaling a powerful torrent of fire at the Dai Li. With the agents distracted, Iroh and Zuko ran away, the former still breathing fire at the Dai Li before catching up with the latter. Iroh escaped the clutches of his niece, but Zuko declared it was time he faced his sister, only to be captured himself. Aware that Team Avatar was in Ba Sing Se, Iroh sought their help in saving his nephew from captivity, forming an official alliance with Team Avatar and vowing himself not to allow Zuko to hurt or hinder Team Avatar ever again."
    },
    {
      "body": "Aang and Iroh made their way to the Crystal Catacombs and rescued Katara and Zuko from their underground prison. His anger returning, Zuko asked Iroh what his uncle was doing in Aang's company. Iroh withheld his nephew, telling Aang and Katara to join Sokka and Toph and that he and Zuko would later help them defeat Azula, ${link_0}, and the Dai Li. After Aang and Katara departed, Iroh attempted to persuade the ${link_1} to denounce his quest to capture the Avatar and instead aid him in saving Ba Sing Se from Fire Nation domination.",
      "links": [
        {
          "body": "Long Feng",
          "key": "${link_0}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        },
        {
          "body": "prince",
          "key": "${link_1}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "text": "Aang and Iroh made their way to the Crystal Catacombs and rescued Katara and Zuko from their underground prison. His anger returning, Zuko asked Iroh what his uncle was doing in Aang's company. Iroh withheld his nephew, telling Aang and Katara to join Sokka and Toph and that he and Zuko would later help them defeat Azula, Long Feng, and the Dai Li. After Aang and Katara departed, Iroh attempted to persuade the prince to denounce his quest to capture the Avatar and instead aid him in saving Ba Sing Se from Fire Nation domination."
    },
    {
      "body": "Azula and two Dai Li agents arrived on scene, having overheard the entire exchange. The agents bound Iroh's hands and feet, immobilizing him. Azula persuaded Zuko to join forces with her and together the two, with the help of the Dai Li, took down Aang and Katara until Aang lay dead in the cornered Katara's arms. Fully changed from his days as the ruthless Fire Nation ${link_0} and free from the clutches of Zuko to choose his own destiny, Iroh intervened, solely to help Katara escape. He drew the attention of their enemies, allowing Katara to carry herself and Aang out of the Crystal Catacombs to safety. Once his two friends were safe from danger and harm, Iroh willingly surrendered to their foes. Here at long last, it was the Dai Li who immobilized Iroh this time permanently and who therefore brought about his capture by the Fire Nation.",
      "links": [
        {
          "body": "general",
          "key": "${link_0}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#General_2",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Azula and two Dai Li agents arrived on scene, having overheard the entire exchange. The agents bound Iroh's hands and feet, immobilizing him. Azula persuaded Zuko to join forces with her and together the two, with the help of the Dai Li, took down Aang and Katara until Aang lay dead in the cornered Katara's arms. Fully changed from his days as the ruthless Fire Nation general and free from the clutches of Zuko to choose his own destiny, Iroh intervened, solely to help Katara escape. He drew the attention of their enemies, allowing Katara to carry herself and Aang out of the Crystal Catacombs to safety. Once his two friends were safe from danger and harm, Iroh willingly surrendered to their foes. Here at long last, it was the Dai Li who immobilized Iroh this time permanently and who therefore brought about his capture by the Fire Nation."
    },
    {
      "body": "The ${link_0} cornering ${link_1} and ${link_2}.",
      "links": [
        {
          "body": "Rough Rhinos",
          "key": "${link_0}",
          "target": {
            "href": "Rough_Rhinos",
            "page": "Rough_Rhinos"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_2}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "The Rough Rhinos cornering Zuko and Iroh."
    },
    {
      "body": "As stated by Iroh, he and the ${link_0} had had past encounters with one another. The retired general appeared to regard the Fire Nation cavalry group to a certain extent, acknowledging their proficiency in various weapons and capability as a singing group. The Rough Rhinos, however, did not seem to reciprocate this respect; they took it upon themselves to apprehend Zuko and Iroh when they were branded as Fire Nation fugitives. Their first and only encounter was a small skirmish in which Zuko and Iroh effortlessly bested the five thugs.",
      "links": [
        {
          "body": "Rough Rhinos",
          "key": "${link_0}",
          "target": {
            "href": "Rough_Rhinos",
            "page": "Rough_Rhinos"
          }
        }
      ],
      "text": "As stated by Iroh, he and the Rough Rhinos had had past encounters with one another. The retired general appeared to regard the Fire Nation cavalry group to a certain extent, acknowledging their proficiency in various weapons and capability as a singing group. The Rough Rhinos, however, did not seem to reciprocate this respect; they took it upon themselves to apprehend Zuko and Iroh when they were branded as Fire Nation fugitives. Their first and only encounter was a small skirmish in which Zuko and Iroh effortlessly bested the five thugs."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        }
      ],
      "text": "Iroh and Zhao."
    },
    {
      "body": "Zhao was a high-ranking and ambitious officer, rising in rank from ${link_0} to ${link_1} to ${link_2}, and finally ${link_3}. He was in the ${link_4} and Zuko's major rival in the hunt for Avatar Aang. Iroh, on the other hand, was completely neutral in regards to their enmity.",
      "links": [
        {
          "body": "lieutenant",
          "key": "${link_0}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#Lieutenant_2",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "captain",
          "key": "${link_1}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#Captain_3",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "commander",
          "key": "${link_2}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#Commander",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "admiral",
          "key": "${link_3}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Fire Navy",
          "key": "${link_4}",
          "target": {
            "href": "Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        }
      ],
      "text": "Zhao was a high-ranking and ambitious officer, rising in rank from lieutenant to captain to commander, and finally admiral. He was in the Fire Navy and Zuko's major rival in the hunt for Avatar Aang. Iroh, on the other hand, was completely neutral in regards to their enmity."
    },
    {
      "body": "Zhao showed Iroh much respect by bowing to him and calling him \"Great Hero\" of the Fire Nation when Iroh and Zuko visited Zhao's harbor for ship repairs. There, Iroh was wholeheartedly prepared to join Zhao for a drink when the latter offered him and Zuko, and even urged Zuko to show Zhao his respect by accepting the offer.",
      "links": [],
      "text": "Zhao showed Iroh much respect by bowing to him and calling him \"Great Hero\" of the Fire Nation when Iroh and Zuko visited Zhao's harbor for ship repairs. There, Iroh was wholeheartedly prepared to join Zhao for a drink when the latter offered him and Zuko, and even urged Zuko to show Zhao his respect by accepting the offer."
    },
    {
      "body": "Zhao discovered that the Avatar had returned and decided to detain Zuko to prevent him from capturing the Avatar first. This infuriated Zuko and, in their subsequent argument, Zhao mocked Zuko's plight, telling him that his father did not really want him home. Iroh consistently withheld Zuko from the argument, remaining on neither his nor Zhao's side during the outburst. Zuko challenged Zhao to an Agni Kai in which he later defeated Zhao, but chose not to scar or kill Zhao upon his victory. As he walked away, the latter attempted a dishonorable attack, which was blocked by Iroh. Iroh urged a vengeful Zuko not to taint his victory. Iroh scolded Zhao for the way such a great commander acted disgracefully in defeat and told Zhao that even in exile, Zuko had more honor than Zhao. Before leaving, Iroh at that moment thanked Zhao for the ginseng tea.",
      "links": [],
      "text": "Zhao discovered that the Avatar had returned and decided to detain Zuko to prevent him from capturing the Avatar first. This infuriated Zuko and, in their subsequent argument, Zhao mocked Zuko's plight, telling him that his father did not really want him home. Iroh consistently withheld Zuko from the argument, remaining on neither his nor Zhao's side during the outburst. Zuko challenged Zhao to an Agni Kai in which he later defeated Zhao, but chose not to scar or kill Zhao upon his victory. As he walked away, the latter attempted a dishonorable attack, which was blocked by Iroh. Iroh urged a vengeful Zuko not to taint his victory. Iroh scolded Zhao for the way such a great commander acted disgracefully in defeat and told Zhao that even in exile, Zuko had more honor than Zhao. Before leaving, Iroh at that moment thanked Zhao for the ginseng tea."
    },
    {
      "body": "Zuko entered into Fire Nation waters in pursuit of the Avatar, thus violating the terms of his exile; however, Zhao allowed him to pass. Iroh told Zuko that Zhao wanted to follow Zuko to the prize they were both seeking, the Avatar. Under Zuko's instruction, Iroh defied Zhao by continuing to head northward by means to distract Zhao while Zuko used the smoke of his ship as a cover. Despite this treacherous act, Zhao found no reason to dislike Iroh or consider him an enemy. Upon learning that Zhao was promoted from Commander to Admiral, Iroh was expressively neutral and replied, \"Good for him.\" When Zhao vowed to attack the Northern Water Tribe, he took Zuko's crew by force to aid him in his assault and unhesitatingly offered Iroh to join them. Zuko ran to attack Zhao, but once again, Iroh withheld him. Before leaving, Zhao kept his offer for Iroh to join him on his mission. Zhao secretly planned to assassinate Zuko so that he could capture the Avatar without Zuko hindering him. To this end, Zhao commissioned pirates who were enemies of Zuko to destroy Zuko's ship. The Prince survived, however, and with his uncle's help, stowed away on Zhao's fleet by means to secretly reach the North Pole and capture the Avatar. In order to help Zuko disguise himself; Iroh joined Zhao on his mission. Iroh lied to Zhao that Zuko was dead and Zhao lied to Iroh of his devastation. In the light of their Siege of the ${link_0}, Iroh toasted the Fire Nation and Zhao toasted victory.",
      "links": [
        {
          "body": "Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        }
      ],
      "text": "Zuko entered into Fire Nation waters in pursuit of the Avatar, thus violating the terms of his exile; however, Zhao allowed him to pass. Iroh told Zuko that Zhao wanted to follow Zuko to the prize they were both seeking, the Avatar. Under Zuko's instruction, Iroh defied Zhao by continuing to head northward by means to distract Zhao while Zuko used the smoke of his ship as a cover. Despite this treacherous act, Zhao found no reason to dislike Iroh or consider him an enemy. Upon learning that Zhao was promoted from Commander to Admiral, Iroh was expressively neutral and replied, \"Good for him.\" When Zhao vowed to attack the Northern Water Tribe, he took Zuko's crew by force to aid him in his assault and unhesitatingly offered Iroh to join them. Zuko ran to attack Zhao, but once again, Iroh withheld him. Before leaving, Zhao kept his offer for Iroh to join him on his mission. Zhao secretly planned to assassinate Zuko so that he could capture the Avatar without Zuko hindering him. To this end, Zhao commissioned pirates who were enemies of Zuko to destroy Zuko's ship. The Prince survived, however, and with his uncle's help, stowed away on Zhao's fleet by means to secretly reach the North Pole and capture the Avatar. In order to help Zuko disguise himself; Iroh joined Zhao on his mission. Iroh lied to Zhao that Zuko was dead and Zhao lied to Iroh of his devastation. In the light of their Siege of the Water Tribe, Iroh toasted the Fire Nation and Zhao toasted victory."
    },
    {
      "body": "As Zhao's naval fleet charged ruthlessly upon the North Pole sea, Zhao told Iroh how their siege would be historical. Iroh urged Zhao to be careful what he wished for, warning that history was not always kind to its subjects. Zhao assured Iroh that the ${link_0} would be nothing like the Siege of Ba Sing Se. Iroh was a kindhearted man and retired former general, but he merely joined Zhao and tried to be a good warrior as he once was, not for the triumph of the Fire Nation, but solely for the welfare of his beloved nephew. On the second day of the naval siege against the Water Tribe, Iroh reminded Zhao that if the enemy was not defeated before the full moon rose, victory would be inevitable. Zhao revealed his plan to kill Tui, the Moon Spirit, to permanently eradicate waterbending. Iroh angrily advised Zhao that the spirits were not to be trifled with. Zhao acknowledged Iroh's fear of the spirits, but that did not stop him from undertaking his monstrous plan to eliminate Tui. When the Moon turned red and the Northern waterbenders visibly fell powerless before their besiegers, Zhao stood triumphant with Tui at his mercy.",
      "links": [
        {
          "body": "Siege of the North",
          "key": "${link_0}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        }
      ],
      "text": "As Zhao's naval fleet charged ruthlessly upon the North Pole sea, Zhao told Iroh how their siege would be historical. Iroh urged Zhao to be careful what he wished for, warning that history was not always kind to its subjects. Zhao assured Iroh that the Siege of the North would be nothing like the Siege of Ba Sing Se. Iroh was a kindhearted man and retired former general, but he merely joined Zhao and tried to be a good warrior as he once was, not for the triumph of the Fire Nation, but solely for the welfare of his beloved nephew. On the second day of the naval siege against the Water Tribe, Iroh reminded Zhao that if the enemy was not defeated before the full moon rose, victory would be inevitable. Zhao revealed his plan to kill Tui, the Moon Spirit, to permanently eradicate waterbending. Iroh angrily advised Zhao that the spirits were not to be trifled with. Zhao acknowledged Iroh's fear of the spirits, but that did not stop him from undertaking his monstrous plan to eliminate Tui. When the Moon turned red and the Northern waterbenders visibly fell powerless before their besiegers, Zhao stood triumphant with Tui at his mercy."
    },
    {
      "body": "Team Avatar arrived to stop Zhao's evil scheme. Aang told the Admiral that destroying the Moon would hurt everyone, including its destroyer, and the absence of the Moon would put everything out of balance with imaginable chaos inflicted on the world; Iroh arrived, supporting Aang's statement. Zhao calmly declared Iroh a traitor of the Fire Nation, after a time of neutrality in his rivalry against Zuko, and admitted himself unsurprised at Iroh's treachery. Now Zhao's enemy, only because of the former's plot to kill Tui, Iroh angrily warned Zhao that he would inflict on Zhao whatever fate Zhao subjected Tui to and demanded Tui be released back into the ${link_0}. Zhao agreed at first, but driven by his violent anger, relentlessly killed Tui and destroyed the Moon, to Iroh's shock. Immediately, Iroh attacked Zhao, incapacitating the latter's guards. Zhao was terrified by Iroh's demonstration of firebending, his ambition evolving into cowardice. Fearing the old man, Zhao fled the scene. That was the last Iroh and Zhao saw of each other because shortly after this event, ${link_1} sought revenge on Zhao for killing Tui, ultimately imprisoning him in the Spirit World.",
      "links": [
        {
          "body": "oasis pond",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "La",
          "key": "${link_1}",
          "target": {
            "href": "La",
            "page": "La"
          }
        }
      ],
      "text": "Team Avatar arrived to stop Zhao's evil scheme. Aang told the Admiral that destroying the Moon would hurt everyone, including its destroyer, and the absence of the Moon would put everything out of balance with imaginable chaos inflicted on the world; Iroh arrived, supporting Aang's statement. Zhao calmly declared Iroh a traitor of the Fire Nation, after a time of neutrality in his rivalry against Zuko, and admitted himself unsurprised at Iroh's treachery. Now Zhao's enemy, only because of the former's plot to kill Tui, Iroh angrily warned Zhao that he would inflict on Zhao whatever fate Zhao subjected Tui to and demanded Tui be released back into the oasis pond. Zhao agreed at first, but driven by his violent anger, relentlessly killed Tui and destroyed the Moon, to Iroh's shock. Immediately, Iroh attacked Zhao, incapacitating the latter's guards. Zhao was terrified by Iroh's demonstration of firebending, his ambition evolving into cowardice. Fearing the old man, Zhao fled the scene. That was the last Iroh and Zhao saw of each other because shortly after this event, La sought revenge on Zhao for killing Tui, ultimately imprisoning him in the Spirit World."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Iroh%27s_relationships",
    "file": "avatar.wikia.com/wiki/Iroh's_relationships.html",
    "page": "Iroh's_relationships",
    "title": "Iroh's relationships"
  }
}