{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Settlements",
      "target": {
        "href": "Category_Settlements",
        "page": "Category_Settlements"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "Northwestern ${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Earth Kingdom",
              "key": "${link_0}",
              "target": {
                "href": "Earth_Kingdom",
                "page": "Earth_Kingdom"
              }
            }
          ],
          "text": "Northwestern Earth Kingdom",
          "value": "Northwestern ${link_0}",
          "value_text": "Northwestern Earth Kingdom"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "Hideout",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Hideout",
          "value": "Hideout",
          "value_text": "Hideout"
        }
      ]
    },
    {
      "key": "Leader",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Jeong Jeong",
              "key": "${link_0}",
              "target": {
                "href": "Jeong_Jeong",
                "page": "Jeong_Jeong"
              }
            }
          ],
          "text": "Jeong Jeong",
          "value": "${link_0}",
          "value_text": "Jeong Jeong"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\" (only appearance)",
          "extra": "(only appearance)",
          "extra_text": "(only appearance)",
          "links": [
            {
              "body": "The Deserter",
              "key": "${link_0}",
              "target": {
                "href": "The_Deserter",
                "page": "The_Deserter"
              }
            }
          ],
          "text": "\"The Deserter\" (only appearance)",
          "value": "\"${link_0}\"",
          "value_text": "\"The Deserter\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Jeong Jeong's camp was a temporary settlement ${link_0} in the northwestern area of the ${link_1}, hidden in the ${link_2} outside of a ${link_3}. Set up as a hideout for ${link_4} and his followers, the camp was built to house them for the winter of 99 ${link_5}.",
      "links": [
        {
          "body": "located",
          "key": "${link_0}",
          "target": {
            "href": "Geography_of_the_World_of_Avatar",
            "page": "Geography_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "woodlands",
          "key": "${link_2}",
          "target": {
            "href": "Flora_in_the_World_of_Avatar",
            "page": "Flora_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Fire Nation colonial village",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation_colonial_village",
            "page": "Fire_Nation_colonial_village"
          }
        },
        {
          "body": "Jeong Jeong",
          "key": "${link_4}",
          "target": {
            "href": "Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        },
        {
          "body": "AG",
          "key": "${link_5}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "Jeong Jeong's camp was a temporary settlement located in the northwestern area of the Earth Kingdom, hidden in the woodlands outside of a Fire Nation colonial village. Set up as a hideout for Jeong Jeong and his followers, the camp was built to house them for the winter of 99 AG."
    },
    {
      "body": "The woodlands surrounding the camp had long been inhabited by primitive Earth Kingdom tribes. Jeong Jeong's defection from the ${link_0} ${link_1} forced him to move from place-to-place, never staying in one area for more than one season. Eventually, in the winter of 99 AG, he settled here, attracting the attention of a local tribe who declared Jeong Jeong a living ${link_2}. The tribe allowed him to reside among them for however long he wished. Jeong Jeong also became the leader of a secret cult following here, which led ${link_3} to this camp after he too deserted the Fire Nation.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "military",
          "key": "${link_1}",
          "target": {
            "href": "Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "god",
          "key": "${link_2}",
          "target": {
            "href": "Spiritual_beliefs_in_the_World_of_Avatar",
            "page": "Spiritual_beliefs_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Chey",
          "key": "${link_3}",
          "target": {
            "href": "Chey",
            "page": "Chey"
          }
        }
      ],
      "text": "The woodlands surrounding the camp had long been inhabited by primitive Earth Kingdom tribes. Jeong Jeong's defection from the Fire Nation military forced him to move from place-to-place, never staying in one area for more than one season. Eventually, in the winter of 99 AG, he settled here, attracting the attention of a local tribe who declared Jeong Jeong a living god. The tribe allowed him to reside among them for however long he wished. Jeong Jeong also became the leader of a secret cult following here, which led Chey to this camp after he too deserted the Fire Nation."
    },
    {
      "body": "${link_0}, who had been rescued by Chey and guided by ${link_1}, arrived at the campsite during the winter of 100 AG. ${link_2} went to see Jeong Jeong inside his hut, saying he wanted to learn ${link_3} from him. Jeong Jeong was angered by the ${link_4}'s presence and at once ordered him to leave because he was not ready. However, his words were halted by a startling vision of Avatar ${link_5}, who urged him to teach Aang nonetheless. Jeong Jeong did not attempt to resist him and immediately began teaching Aang.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Lin Yee",
          "key": "${link_1}",
          "target": {
            "href": "Lin_Yee",
            "page": "Lin_Yee"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "firebending",
          "key": "${link_3}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_4}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Roku",
          "key": "${link_5}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        }
      ],
      "text": "Team Avatar, who had been rescued by Chey and guided by Lin Yee, arrived at the campsite during the winter of 100 AG. Aang went to see Jeong Jeong inside his hut, saying he wanted to learn firebending from him. Jeong Jeong was angered by the Avatar's presence and at once ordered him to leave because he was not ready. However, his words were halted by a startling vision of Avatar Roku, who urged him to teach Aang nonetheless. Jeong Jeong did not attempt to resist him and immediately began teaching Aang."
    },
    {
      "body": "${link_0} ${link_1} for the first time while at ${link_2}'s camp.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "firebent",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Jeong Jeong",
          "key": "${link_2}",
          "target": {
            "href": "Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        }
      ],
      "text": "Aang firebent for the first time while at Jeong Jeong's camp."
    },
    {
      "body": "Progress was slow for the Avatar, who was often impatient with his master. Jeong Jeong told Aang to keep calm, focus on breathing, and feel the sun's heat - the source of firebending. However, Aang wanted to try something more ambitious. Eventually, he was allowed to start controlling real fire, much to his delight. Aang was told to control the flame burning on a leaf, though he felt slightly restricted by this and decided to take it further by generating his own fire. He started small, but slowly began to do more and more as he moved on. At the end, he was able to generate a huge ring of fire around himself. Catastrophically, Aang accidentally extended the ring too far out and subsequently burned ${link_0}'s hands. She ran away crying as ${link_1} and Jeong Jeong chased after her.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Progress was slow for the Avatar, who was often impatient with his master. Jeong Jeong told Aang to keep calm, focus on breathing, and feel the sun's heat - the source of firebending. However, Aang wanted to try something more ambitious. Eventually, he was allowed to start controlling real fire, much to his delight. Aang was told to control the flame burning on a leaf, though he felt slightly restricted by this and decided to take it further by generating his own fire. He started small, but slowly began to do more and more as he moved on. At the end, he was able to generate a huge ring of fire around himself. Catastrophically, Aang accidentally extended the ring too far out and subsequently burned Katara's hands. She ran away crying as Sokka and Jeong Jeong chased after her."
    },
    {
      "body": "Jeong Jeong found Katara by the river; she had been able to ${link_0} her burns with ${link_1}. Alone, Jeong Jeong told Katara that he wished to be a waterbender, stating that water brings life and that fire brings destruction. Shortly thereafter, the two were notified that ${link_2} and his army were approaching the camp by ${link_3}, in search of the Avatar. Katara ran back to the campsite to find Aang, who was sulking inside Jeong Jeong's hut. Ashamed of his actions, he apologized to Katara and promised never to firebend again, though he was happy to discover that Katara was able to heal herself. After learning that Zhao had arrived, he left the camp to fight the Admiral by the river. After a brief battle with Zhao, Aang and his friends left the camp.",
      "links": [
        {
          "body": "heal",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_2}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "boat",
          "key": "${link_3}",
          "target": {
            "href": "Transportation_in_the_World_of_Avatar",
            "page": "Transportation_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Jeong Jeong found Katara by the river; she had been able to heal her burns with waterbending. Alone, Jeong Jeong told Katara that he wished to be a waterbender, stating that water brings life and that fire brings destruction. Shortly thereafter, the two were notified that Zhao and his army were approaching the camp by boat, in search of the Avatar. Katara ran back to the campsite to find Aang, who was sulking inside Jeong Jeong's hut. Ashamed of his actions, he apologized to Katara and promised never to firebend again, though he was happy to discover that Katara was able to heal herself. After learning that Zhao had arrived, he left the camp to fight the Admiral by the river. After a brief battle with Zhao, Aang and his friends left the camp."
    },
    {
      "body": "Shortly before the battle, all of Jeong Jeong's followers left the camp. When Chey came back sometime afterward, he was confused to see the site abandoned. At first, he thought it was a joke of some sort.",
      "links": [],
      "text": "Shortly before the battle, all of Jeong Jeong's followers left the camp. When Chey came back sometime afterward, he was confused to see the site abandoned. At first, he thought it was a joke of some sort."
    },
    {
      "body": "${link_0} lived in a small hut within the camp.",
      "links": [
        {
          "body": "Jeong Jeong",
          "key": "${link_0}",
          "target": {
            "href": "Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        }
      ],
      "text": "Jeong Jeong lived in a small hut within the camp."
    },
    {
      "body": "Jeong Jeong's camp was located deep within a forest outside a colonial Fire Nation town. It was centered around a small, hilly clearing on the shores of a shallow pond. Fish could be found here, as Sokka was once seen fishing at this pond while atop a rock.",
      "links": [],
      "text": "Jeong Jeong's camp was located deep within a forest outside a colonial Fire Nation town. It was centered around a small, hilly clearing on the shores of a shallow pond. Fish could be found here, as Sokka was once seen fishing at this pond while atop a rock."
    },
    {
      "body": "The camp was only sparsely populated, as there were just four ${link_0}. Each building was connected to the other buildings via unpaved pathways, between which there was yellow grass. Three pathways culminated at small beach on the pond shoreline. A tiny, wooden bridge connected the beach to an island just offshore. The island was almost entirely concealed by a hut, its only feature. Like all the other buildings, the hut was shaped like a half-cylinder tipped to its flat side. The roof was metallic and at the front, there was a single, half-circle shaped entrance that connected to the bridge. The interior of the building contained no furniture and had a dirt floor.",
      "links": [
        {
          "body": "buildings",
          "key": "${link_0}",
          "target": {
            "href": "Architecture_in_the_World_of_Avatar",
            "page": "Architecture_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "The camp was only sparsely populated, as there were just four buildings. Each building was connected to the other buildings via unpaved pathways, between which there was yellow grass. Three pathways culminated at small beach on the pond shoreline. A tiny, wooden bridge connected the beach to an island just offshore. The island was almost entirely concealed by a hut, its only feature. Like all the other buildings, the hut was shaped like a half-cylinder tipped to its flat side. The roof was metallic and at the front, there was a single, half-circle shaped entrance that connected to the bridge. The interior of the building contained no furniture and had a dirt floor."
    },
    {
      "body": "No huts were located at the center of the clearing; all were off to the sides. The largest of the huts was located on the island. Aside from grass and a few shrubs and bushes, there was very little vegetation in the clearing. Most of the camp pathways were straight and did not curve.",
      "links": [],
      "text": "No huts were located at the center of the clearing; all were off to the sides. The largest of the huts was located on the island. Aside from grass and a few shrubs and bushes, there was very little vegetation in the clearing. Most of the camp pathways were straight and did not curve."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Jeong_Jeong%27s_camp",
    "file": "avatar.wikia.com/wiki/Jeong_Jeong's_camp.html",
    "page": "Jeong_Jeong's_camp",
    "title": "Jeong Jeong's camp"
  }
}