{
  "categories": [
    {
      "body": "Featured articles",
      "target": {
        "href": "Category_Featured_articles",
        "page": "Category_Featured_articles"
      }
    },
    {
      "body": "A-class articles",
      "target": {
        "href": "Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Bending",
      "target": {
        "href": "Category_Bending",
        "page": "Category_Bending"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "href": "Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} employed positive jing in battle in concurrence with ${link_1}'s utilization of neutral jing.",
      "links": [
        {
          "body": "The Gopher",
          "key": "${link_0}",
          "target": {
            "href": "The_Gopher",
            "page": "The_Gopher"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "The Gopher employed positive jing in battle in concurrence with Toph's utilization of neutral jing."
    },
    {
      "body": "Jing is a term that describes the myriad of options toward which one can direct his or her energy, both internally and externally. According to ${link_0}, they correspond to tactics and strategies in battle.",
      "links": [
        {
          "body": "Bumi",
          "key": "${link_0}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        }
      ],
      "text": "Jing is a term that describes the myriad of options toward which one can direct his or her energy, both internally and externally. According to Bumi, they correspond to tactics and strategies in battle."
    },
    {
      "body": "According to Bumi, there are, at least technically, eighty-five distinct types or \"degrees\" of jing, although only the main three have been mentioned:",
      "links": [],
      "text": "According to Bumi, there are, at least technically, eighty-five distinct types or \"degrees\" of jing, although only the main three have been mentioned:"
    },
    {
      "body": "The octopus form is one of the many techniques in ${link_0} that allows waterbenders to maintain a balance between positive and negative jing.",
      "links": [
        {
          "body": "waterbending",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "The octopus form is one of the many techniques in waterbending that allows waterbenders to maintain a balance between positive and negative jing."
    },
    {
      "body": "Positive jing is an aggressive expression of chi. As such, it complements the more aggressive tactics of ${link_0} during combat. Firebenders typically prefer action to inaction or conflict avoidance, relying heavily on preemptive strikes to overwhelm their opponents with sheer power. These positive jing attributes are also found in the attitudes and personalities that are common among the people of the ${link_1}.",
      "links": [
        {
          "body": "firebenders",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "Positive jing is an aggressive expression of chi. As such, it complements the more aggressive tactics of firebenders during combat. Firebenders typically prefer action to inaction or conflict avoidance, relying heavily on preemptive strikes to overwhelm their opponents with sheer power. These positive jing attributes are also found in the attitudes and personalities that are common among the people of the Fire Nation."
    },
    {
      "body": "Negative jing is mostly exercised in ${link_0}, reflecting the ${link_1}' pacifistic lifestyle and their philosophy that all life is sacred; they assert that fighting is only to be used as a last resort when conflict cannot be avoided. Airbenders are more mobile fighters compared to ${link_2} and possess a highly dynamic fighting style; to \"avoid and evade\" is recognized as a typical airbender tactic.",
      "links": [
        {
          "body": "airbending",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_1}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "earthbenders",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Negative jing is mostly exercised in airbending, reflecting the Air Nomads' pacifistic lifestyle and their philosophy that all life is sacred; they assert that fighting is only to be used as a last resort when conflict cannot be avoided. Airbenders are more mobile fighters compared to earthbenders and possess a highly dynamic fighting style; to \"avoid and evade\" is recognized as a typical airbender tactic."
    },
    {
      "body": "In the case of ${link_0}, common maneuvers involve following the ${link_1} and the ${link_2}'s example of \"push and pull\". As such, waterbenders will alternate between and maintain a balance of both positive and negative jing in combat, allowing them to turn defense into offense as they use their opponent's force against them while conserving their own.",
      "links": [
        {
          "body": "waterbending",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "moon",
          "key": "${link_1}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "ocean",
          "key": "${link_2}",
          "target": {
            "href": "La",
            "page": "La"
          }
        }
      ],
      "text": "In the case of waterbending, common maneuvers involve following the moon and the ocean's example of \"push and pull\". As such, waterbenders will alternate between and maintain a balance of both positive and negative jing in combat, allowing them to turn defense into offense as they use their opponent's force against them while conserving their own."
    },
    {
      "body": "${link_0} is a specialized technique under ${link_1} which utilizes concepts involved with neutral jing.",
      "links": [
        {
          "body": "Seismic sense",
          "key": "${link_0}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Seismic sense is a specialized technique under earthbending which utilizes concepts involved with neutral jing."
    },
    {
      "body": "Neutral jing is stated to be the key to earthbending. Fundamentally, neutral jing involves listening, though seemingly doing nothing, and waiting for the right moment to strike. When in combat, earthbenders are more stationary combatants, usually waiting for their opponent to come to them, while standing their ground and meeting their opponents' attacks head-on, before delivering a deadly strike of their own. Neutral jing forms the basis of true earthbending, and is the concept used by the first earthbenders, the ${link_0}. The idea is also fundamental in ${link_1}, a perceptive fighting style used by select benders, one of whom was ${link_2}.",
      "links": [
        {
          "body": "badgermoles",
          "key": "${link_0}",
          "target": {
            "href": "Badgermole",
            "page": "Badgermole"
          }
        },
        {
          "body": "seismic sense",
          "key": "${link_1}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        },
        {
          "body": "Toph",
          "key": "${link_2}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Neutral jing is stated to be the key to earthbending. Fundamentally, neutral jing involves listening, though seemingly doing nothing, and waiting for the right moment to strike. When in combat, earthbenders are more stationary combatants, usually waiting for their opponent to come to them, while standing their ground and meeting their opponents' attacks head-on, before delivering a deadly strike of their own. Neutral jing forms the basis of true earthbending, and is the concept used by the first earthbenders, the badgermoles. The idea is also fundamental in seismic sense, a perceptive fighting style used by select benders, one of whom was Toph."
    },
    {
      "body": "As highlighted, someone who has mastered neutral jing is someone who waits and listens before striking. Bumi relied on neutral jing while earthbending, to the extent that he refused to flee ${link_0} even when ${link_1} came to his rescue. His desire to wait for an opportune moment to strike was initially baffling to ${link_2} and to Aang, although the Avatar later accepted Bumi's decision. The monarch eventually freed himself during the ${link_3}, recognizing it as the precise moment to strike as his captors were defenseless without their firebending.",
      "links": [
        {
          "body": "Omashu",
          "key": "${link_0}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "his soldiers",
          "key": "${link_2}",
          "target": {
            "href": "Omashu_Resistance",
            "page": "Omashu_Resistance"
          }
        },
        {
          "body": "Day of Black Sun",
          "key": "${link_3}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        }
      ],
      "text": "As highlighted, someone who has mastered neutral jing is someone who waits and listens before striking. Bumi relied on neutral jing while earthbending, to the extent that he refused to flee Omashu even when Aang came to his rescue. His desire to wait for an opportune moment to strike was initially baffling to his soldiers and to Aang, although the Avatar later accepted Bumi's decision. The monarch eventually freed himself during the Day of Black Sun, recognizing it as the precise moment to strike as his captors were defenseless without their firebending."
    },
    {
      "body": "Discussion about the concept of jing between ${link_0} Aang and ${link_1} Bumi:",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "King",
          "key": "${link_1}",
          "target": {
            "href": "King_of_Omashu",
            "page": "King_of_Omashu"
          }
        }
      ],
      "text": "Discussion about the concept of jing between Avatar Aang and King Bumi:"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Jing",
    "file": "avatar.wikia.com/wiki/Jing.html",
    "page": "Jing",
    "title": "Jing"
  }
}