{
  "categories": [
    {
      "body": "Featured articles",
      "target": {
        "href": "Category_Featured_articles",
        "page": "Category_Featured_articles"
      }
    },
    {
      "body": "A-class articles",
      "target": {
        "href": "Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Fashion",
      "target": {
        "href": "Category_Fashion",
        "page": "Category_Fashion"
      }
    },
    {
      "body": "Katara",
      "target": {
        "href": "Category_Katara",
        "page": "Category_Katara"
      }
    },
    {
      "body": "Objects",
      "target": {
        "href": "Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Water Tribes",
      "target": {
        "href": "Category_Water_Tribes",
        "page": "Category_Water_Tribes"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0}'s necklace features the ${link_1} emblem.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Katara's necklace features the waterbending emblem."
    },
    {
      "body": "Katara's necklace is a blue ${link_0} with a light blue, hand-crafted jewel bearing the ${link_1} ${link_2}. It was originally crafted by ${link_3} as a ${link_4} for ${link_5}, but it has since become a family heirloom passed from one generation to the next, starting with Kanna, who passed it to ${link_6}, who finally passed it to ${link_7}. The necklace is Katara's most treasured possession, serving as her only memento of her deceased mother.",
      "links": [
        {
          "body": "choker",
          "key": "${link_0}",
          "target": {
            "href": "Fashion_in_the_World_of_Avatar",
            "page": "Fashion_in_the_World_of_Avatar"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "symbol",
          "key": "${link_2}",
          "target": {
            "href": "Waterbending#Elemental_symbol",
            "page": "Waterbending"
          }
        },
        {
          "body": "Pakku",
          "key": "${link_3}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "betrothal necklace",
          "key": "${link_4}",
          "target": {
            "href": "Betrothal_necklace",
            "page": "Betrothal_necklace"
          }
        },
        {
          "body": "Kanna",
          "key": "${link_5}",
          "target": {
            "href": "Kanna",
            "page": "Kanna"
          }
        },
        {
          "body": "Kya",
          "key": "${link_6}",
          "target": {
            "href": "Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        },
        {
          "body": "Katara",
          "key": "${link_7}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Katara's necklace is a blue choker with a light blue, hand-crafted jewel bearing the waterbending symbol. It was originally crafted by Pakku as a betrothal necklace for Kanna, but it has since become a family heirloom passed from one generation to the next, starting with Kanna, who passed it to Kya, who finally passed it to Katara. The necklace is Katara's most treasured possession, serving as her only memento of her deceased mother."
    },
    {
      "body": "Around 40 ${link_0}, Master Pakku of the ${link_1} crafted this pendant as a betrothal necklace for his arranged wife, Kanna. It served as a proclamation of his affection and adulation for the young woman. However, Kanna did not appreciate the Northern Water Tribe's sexist customs, so she fled to the ${link_2} seeking a new beginning. Despite this, Kanna kept the necklace with her.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "Around 40 AG, Master Pakku of the Northern Water Tribe crafted this pendant as a betrothal necklace for his arranged wife, Kanna. It served as a proclamation of his affection and adulation for the young woman. However, Kanna did not appreciate the Northern Water Tribe's sexist customs, so she fled to the Southern Water Tribe seeking a new beginning. Despite this, Kanna kept the necklace with her."
    },
    {
      "body": "Eventually, Kanna passed the necklace on to Kya, the wife of ${link_0}, her son. Kya wore the necklace six years prior to the ${link_1}'s return, during a ${link_2} ${link_3} that claimed her life. Following her death, the necklace was passed onto Kya's eight-year-old daughter, Katara.",
      "links": [
        {
          "body": "Hakoda",
          "key": "${link_0}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "raid",
          "key": "${link_3}",
          "target": {
            "href": "Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        }
      ],
      "text": "Eventually, Kanna passed the necklace on to Kya, the wife of Hakoda, her son. Kya wore the necklace six years prior to the Avatar's return, during a Fire Nation raid that claimed her life. Following her death, the necklace was passed onto Kya's eight-year-old daughter, Katara."
    },
    {
      "body": "In 99 AG, Katara explained to ${link_0} that she kept the necklace, as it was the only reminder of her mother. However, she also agreed that the necklace itself was not enough to fill the emotional void caused by her mother's death. Shortly afterward, she began a revolt on a Fire Nation ${link_1}, only to discover her necklace missing following her escape. During this time, the necklace came into the possession of ${link_2}, who found the lost necklace lying on the abandoned rig.",
      "links": [
        {
          "body": "Haru",
          "key": "${link_0}",
          "target": {
            "href": "Haru",
            "page": "Haru"
          }
        },
        {
          "body": "prison rig",
          "key": "${link_1}",
          "target": {
            "href": "Prison_rig",
            "page": "Prison_rig"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_2}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "In 99 AG, Katara explained to Haru that she kept the necklace, as it was the only reminder of her mother. However, she also agreed that the necklace itself was not enough to fill the emotional void caused by her mother's death. Shortly afterward, she began a revolt on a Fire Nation prison rig, only to discover her necklace missing following her escape. During this time, the necklace came into the possession of Zuko, who found the lost necklace lying on the abandoned rig."
    },
    {
      "body": "${link_0} attempted to bribe ${link_1} with the necklace in exchange for information on ${link_2}'s whereabouts.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Zuko attempted to bribe Katara with the necklace in exchange for information on Aang's whereabouts."
    },
    {
      "body": "Weeks later, Zuko discovered and captured Katara as she was attempting to practice waterbending using a stolen ${link_0}. After binding her to a tree, he revealed that he was in possession of her lost necklace, the last tie Katara had to her mother. Zuko bribed her with the keepsake, promising to return it if she was willing to relinquish ${link_1}. Katara refused, and she escaped shortly afterward with Aang and ${link_2}, leaving Zuko with the necklace.",
      "links": [
        {
          "body": "waterbending scroll",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending_scroll",
            "page": "Waterbending_scroll"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_2}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Weeks later, Zuko discovered and captured Katara as she was attempting to practice waterbending using a stolen waterbending scroll. After binding her to a tree, he revealed that he was in possession of her lost necklace, the last tie Katara had to her mother. Zuko bribed her with the keepsake, promising to return it if she was willing to relinquish Aang. Katara refused, and she escaped shortly afterward with Aang and Sokka, leaving Zuko with the necklace."
    },
    {
      "body": "Later, near ${link_0}, Aang crafted a new necklace for Katara out of flowers and Sokka's fishing line. She wore the hand-crafted necklace at various times during her stay at the village, but never wore it again after her departure.",
      "links": [
        {
          "body": "Makapu Village",
          "key": "${link_0}",
          "target": {
            "href": "Makapu_Village",
            "page": "Makapu_Village"
          }
        }
      ],
      "text": "Later, near Makapu Village, Aang crafted a new necklace for Katara out of flowers and Sokka's fishing line. She wore the hand-crafted necklace at various times during her stay at the village, but never wore it again after her departure."
    },
    {
      "body": "Zuko contracted a bounty hunter, ${link_0}, who used the scent from Katara's necklace for her ${link_1} to track down Katara. Catching up with her once more, Zuko captured the young waterbender and her brother, Sokka, and confronted Aang in battle at an ${link_2}. It was during this battle that Aang successfully recovered Katara's necklace from Zuko. As they flew away on ${link_3}, he returned the necklace to Katara, who thanked him with a kiss on the cheek.",
      "links": [
        {
          "body": "June",
          "key": "${link_0}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "shirshu",
          "key": "${link_1}",
          "target": {
            "href": "Shirshu",
            "page": "Shirshu"
          }
        },
        {
          "body": "abbey",
          "key": "${link_2}",
          "target": {
            "href": "Abbey",
            "page": "Abbey"
          }
        },
        {
          "body": "Appa",
          "key": "${link_3}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Zuko contracted a bounty hunter, June, who used the scent from Katara's necklace for her shirshu to track down Katara. Catching up with her once more, Zuko captured the young waterbender and her brother, Sokka, and confronted Aang in battle at an abbey. It was during this battle that Aang successfully recovered Katara's necklace from Zuko. As they flew away on Appa, he returned the necklace to Katara, who thanked him with a kiss on the cheek."
    },
    {
      "body": "While at the Northern Water Tribe, a skilled ${link_0}, ${link_1}, recognized Katara as Kanna's granddaughter after observing the carvings on Katara's necklace. It was here that Katara learned that her grandmother was raised in the Northern Water Tribe. Later, Katara dueled with Pakku, a waterbending master who refused to take her on as his apprentice, due to prejudice toward women in the Northern Water Tribe culture. During this skirmish, the necklace fell from Katara's neck and onto the icy floor of the sparring circle. Katara was soon defeated by being encased in a prison of ice. Having defeated Katara, Pakku began to leave the arena and saw the necklace that he had hand-crafted sixty years prior. This was what convinced him to finally put away his old prejudices and teach Katara, his past love's granddaughter, waterbending.",
      "links": [
        {
          "body": "healer",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        },
        {
          "body": "Yugoda",
          "key": "${link_1}",
          "target": {
            "href": "Yugoda",
            "page": "Yugoda"
          }
        }
      ],
      "text": "While at the Northern Water Tribe, a skilled healer, Yugoda, recognized Katara as Kanna's granddaughter after observing the carvings on Katara's necklace. It was here that Katara learned that her grandmother was raised in the Northern Water Tribe. Later, Katara dueled with Pakku, a waterbending master who refused to take her on as his apprentice, due to prejudice toward women in the Northern Water Tribe culture. During this skirmish, the necklace fell from Katara's neck and onto the icy floor of the sparring circle. Katara was soon defeated by being encased in a prison of ice. Having defeated Katara, Pakku began to leave the arena and saw the necklace that he had hand-crafted sixty years prior. This was what convinced him to finally put away his old prejudices and teach Katara, his past love's granddaughter, waterbending."
    },
    {
      "body": "Having learned of Kanna's whereabouts, Pakku headed to the South Pole to aid in rebuilding efforts and to reunite with his lost love. From that point on, the necklace remained safely in Katara's possession during her journey to ${link_0}, where she was captured by ${link_1} and imprisoned alongside Zuko during the overthrowing of the ${link_2}. Katara began to berate Zuko for his and his nation's cruelty toward the world. She further expressed her grief by telling Zuko of how his nation murdered her mother, clutching onto the necklace as she broke down into tears. This was what sparked Zuko to share his mother's loss with Katara, which convinced her that he had the ability to change.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_2}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "Having learned of Kanna's whereabouts, Pakku headed to the South Pole to aid in rebuilding efforts and to reunite with his lost love. From that point on, the necklace remained safely in Katara's possession during her journey to Ba Sing Se, where she was captured by Azula and imprisoned alongside Zuko during the overthrowing of the Earth King. Katara began to berate Zuko for his and his nation's cruelty toward the world. She further expressed her grief by telling Zuko of how his nation murdered her mother, clutching onto the necklace as she broke down into tears. This was what sparked Zuko to share his mother's loss with Katara, which convinced her that he had the ability to change."
    },
    {
      "body": "Having escaped Aang's death and Zuko joining with Azula's group, Team Avatar sneaked into the Fire Nation, obtaining local attire in order to blend in. Katara modeled for Aang once again, leading him to comment that the necklace would reveal her identity. Reluctantly, Katara removed it as it was obviously an accessory from the ${link_0}. Katara wore the necklace again after she discarded her Fire Nation disguise during the ${link_1}, and continued to wear it afterward, except in cases that required her to sport her Fire Nation attire, such as when she watched a ${link_2} on ${link_3} and when she and ${link_4} searched for Aang.",
      "links": [
        {
          "body": "Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Day of Black Sun",
          "key": "${link_1}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "play",
          "key": "${link_2}",
          "target": {
            "href": "The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        },
        {
          "body": "Ember Island",
          "key": "${link_3}",
          "target": {
            "href": "Ember_Island",
            "page": "Ember_Island"
          }
        },
        {
          "body": "Suki",
          "key": "${link_4}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        }
      ],
      "text": "Having escaped Aang's death and Zuko joining with Azula's group, Team Avatar sneaked into the Fire Nation, obtaining local attire in order to blend in. Katara modeled for Aang once again, leading him to comment that the necklace would reveal her identity. Reluctantly, Katara removed it as it was obviously an accessory from the Water Tribe. Katara wore the necklace again after she discarded her Fire Nation disguise during the Day of Black Sun, and continued to wear it afterward, except in cases that required her to sport her Fire Nation attire, such as when she watched a play on Ember Island and when she and Suki searched for Aang."
    },
    {
      "body": "Katara held her fingertips to the necklace when ${link_0} told her that ${link_1} would be proud of her.",
      "links": [
        {
          "body": "Hakoda",
          "key": "${link_0}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "her mother",
          "key": "${link_1}",
          "target": {
            "href": "Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        }
      ],
      "text": "Katara held her fingertips to the necklace when Hakoda told her that her mother would be proud of her."
    },
    {
      "body": "When Katara and Sokka reunited with their father at Zuko's coronation as ${link_0}, Hakoda told Katara and her brother that he heard of their brave feats in the final stages of the ${link_1}, and that he was the proudest father in the world. In addition, he turned to Katara and stated their mother would be proud as well. This brought tears to Katara's eyes, as she rested her fingertips against the carved stone of her mother's necklace.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_1}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "When Katara and Sokka reunited with their father at Zuko's coronation as Fire Lord, Hakoda told Katara and her brother that he heard of their brave feats in the final stages of the Hundred Year War, and that he was the proudest father in the world. In addition, he turned to Katara and stated their mother would be proud as well. This brought tears to Katara's eyes, as she rested her fingertips against the carved stone of her mother's necklace."
    },
    {
      "body": "Over a year since the end of the Hundred Year War, Katara still donned her mother's necklace as part of her new Water Tribe ensemble, and continued to wear it into her old age.",
      "links": [],
      "text": "Over a year since the end of the Hundred Year War, Katara still donned her mother's necklace as part of her new Water Tribe ensemble, and continued to wear it into her old age."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Katara%27s_necklace",
    "file": "avatar.wikia.com/wiki/Katara's_necklace.html",
    "page": "Katara's_necklace",
    "title": "Katara's necklace"
  }
}