{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "external": false,
        "href": "/wiki/Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Needs help",
      "target": {
        "external": false,
        "href": "/wiki/Category_Needs_help",
        "page": "Category_Needs_help"
      }
    },
    {
      "body": "Katara",
      "target": {
        "external": false,
        "href": "/wiki/Category_Katara",
        "page": "Category_Katara"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Katara is a warm, caring person who met many people on her journey around the world.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "Katara's relationships"
      ],
      "text": "This page is comprised of Katara's relationships with other characters in the World of Avatar. Katara is a warm, caring person who met many people on her journey around the world."
    },
    {
      "body": "Katara has shown to have a loving and caring relationship with her three children. Katara trained her second child and only daughter, ${link_0}, in ${link_1}, who became a master ${link_2} in her own right, and she was supportive of Kya when her daughter revealed her sexual orientation to her. Following ${link_3}'s passing, Kya returned to the ${link_4} to tend to her grieving mother.",
      "links": [
        {
          "body": "Kya",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kya",
            "page": "Kya"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "healer",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Healing",
            "page": "Healing"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Bumi and Kya"
      ],
      "text": "Katara has shown to have a loving and caring relationship with her three children. Katara trained her second child and only daughter, Kya, in waterbending, who became a master healer in her own right, and she was supportive of Kya when her daughter revealed her sexual orientation to her. Following Aang's passing, Kya returned to the Southern Water Tribe to tend to her grieving mother."
    },
    {
      "body": "Katara revealed to ${link_0} that her first two children, ${link_1} and Kya, were rambunctious as children, whereas her last-born, ${link_2} was on the serious side. Katara showed concern about Tenzin's uptight personality toward his older siblings, and after the ${link_3}, she insisted that Tenzin took his siblings in his vacation to the ${link_4}, telling him he would come to appreciate the time he spent with them when he reached her age.",
      "links": [
        {
          "body": "Pema",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pema",
            "page": "Pema"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Glacier Spirits Festival",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Glacier_Spirits_Festival",
            "page": "Glacier_Spirits_Festival"
          }
        },
        {
          "body": "air temples",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Air_temple",
            "page": "Air_temple"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Bumi and Kya"
      ],
      "text": "Katara revealed to Pema that her first two children, Bumi and Kya, were rambunctious as children, whereas her last-born, Tenzin was on the serious side. Katara showed concern about Tenzin's uptight personality toward his older siblings, and after the Glacier Spirits Festival, she insisted that Tenzin took his siblings in his vacation to the air temples, telling him he would come to appreciate the time he spent with them when he reached her age."
    },
    {
      "body": "Katara has a loving relationship with her grandchildren ${link_0}, ${link_1}, ${link_2}, and ${link_3}, who refer to her as Gran-Gran. All of the children, sans an unborn Rohan, were happy and excited to visit their grandmother at the ${link_4}, especially Jinora, who stated that she had been reading all about Katara's old adventures. Katara was happy to see them too, smiling enthusiastically when they were talking to her.",
      "links": [
        {
          "body": "Jinora",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Ikki",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ikki",
            "page": "Ikki"
          }
        },
        {
          "body": "Meelo",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Meelo",
            "page": "Meelo"
          }
        },
        {
          "body": "Rohan",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Rohan",
            "page": "Rohan"
          }
        },
        {
          "body": "South Pole",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Grandchildren"
      ],
      "text": "Katara has a loving relationship with her grandchildren Jinora, Ikki, Meelo, and Rohan, who refer to her as Gran-Gran. All of the children, sans an unborn Rohan, were happy and excited to visit their grandmother at the South Pole, especially Jinora, who stated that she had been reading all about Katara's old adventures. Katara was happy to see them too, smiling enthusiastically when they were talking to her."
    },
    {
      "body": "When Jinora's spirit was trapped in the ${link_0}, leaving her physical body defenseless, Katara felt worried for her granddaughter. After the airbender woke up, she greeted her grandmother with a smile and told her how much she had missed her.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Grandchildren"
      ],
      "text": "When Jinora's spirit was trapped in the Spirit World, leaving her physical body defenseless, Katara felt worried for her granddaughter. After the airbender woke up, she greeted her grandmother with a smile and told her how much she had missed her."
    },
    {
      "body": "${link_0} was Katara and ${link_1}'s father and a prominent figure in his daughter's life. His departure from the Southern Water Tribe to fight in the ${link_2} had a profound impact on Katara, who felt abandoned and betrayed by him, in spite of the fact that she knew his reasons for departing. Hakoda consoled his daughter by telling her that his departure had a heavy emotional toll on him as well.",
      "links": [
        {
          "body": "Hakoda",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Hakoda"
      ],
      "text": "Hakoda was Katara and Sokka's father and a prominent figure in his daughter's life. His departure from the Southern Water Tribe to fight in the Hundred Year War had a profound impact on Katara, who felt abandoned and betrayed by him, in spite of the fact that she knew his reasons for departing. Hakoda consoled his daughter by telling her that his departure had a heavy emotional toll on him as well."
    },
    {
      "body": "Since their reunion, Hakoda aided ${link_0} several times with preparations for the ${link_1}. After becoming wounded during battle, Katara healed her father and decided to assist him in following the troops to the ${link_2} while the other members continued their search for ${link_3}. She was clearly distraught at having to leave him behind in the ${link_4} when the Invasion plan failed. The two were reunited once again when Sokka and ${link_5} traveled to the ${link_6} Prison to free Hakoda. Although forced to separate soon afterward when ${link_7} attacked their campsite at the ${link_8}, they joined once more as a family after their spectacular victory in the War.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        },
        {
          "body": "Royal Palace",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_Royal_Palace",
            "page": "Fire_Nation_Royal_Palace"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "Azula",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Hakoda"
      ],
      "text": "Since their reunion, Hakoda aided Team Avatar several times with preparations for the invasion of the Fire Nation. After becoming wounded during battle, Katara healed her father and decided to assist him in following the troops to the Royal Palace while the other members continued their search for Ozai. She was clearly distraught at having to leave him behind in the Fire Nation when the Invasion plan failed. The two were reunited once again when Sokka and Zuko traveled to the Boiling Rock Prison to free Hakoda. Although forced to separate soon afterward when Azula attacked their campsite at the Western Air Temple, they joined once more as a family after their spectacular victory in the War."
    },
    {
      "body": "${link_0} was Katara and Sokka's grandmother. With their ${link_1} deceased and their father off fighting in the War, Kanna was the only other relative they had at the time and thus became their caretaker. Katara and Sokka had a habit of calling her \"Gran Gran\". It was hinted that despite their strong relationship, being left under Kanna's care did not compensate for her father's departure from the tribe to fight in the war.",
      "links": [
        {
          "body": "Kanna",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kanna",
            "page": "Kanna"
          }
        },
        {
          "body": "mother",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Kanna"
      ],
      "text": "Kanna was Katara and Sokka's grandmother. With their mother deceased and their father off fighting in the War, Kanna was the only other relative they had at the time and thus became their caretaker. Katara and Sokka had a habit of calling her \"Gran Gran\". It was hinted that despite their strong relationship, being left under Kanna's care did not compensate for her father's departure from the tribe to fight in the war."
    },
    {
      "body": "It was revealed that Kanna ran away from the ${link_0} to escape an arranged marriage. Katara sympathized with her grandmother's decision, as she also faced the Northern Tribe's prejudices against its female citizens.",
      "links": [
        {
          "body": "Northern Water Tribe",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Kanna"
      ],
      "text": "It was revealed that Kanna ran away from the Northern Water Tribe to escape an arranged marriage. Katara sympathized with her grandmother's decision, as she also faced the Northern Tribe's prejudices against its female citizens."
    },
    {
      "body": "Katara's mother, Kya, was an extremely important figure in her life, with her death having a traumatic impact on both Katara and Sokka. Kya was killed during a ${link_0} on their village when Katara was young, forcing her young daughter to take on a maternal role in her family. Her only inheritance was a ${link_1} first owned by her grandmother, passed down to each generation as a family heirloom.",
      "links": [
        {
          "body": "Fire Nation raid",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        },
        {
          "body": "necklace",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Katara%27s_necklace",
            "page": "Katara%27s_necklace"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Kya"
      ],
      "text": "Katara's mother, Kya, was an extremely important figure in her life, with her death having a traumatic impact on both Katara and Sokka. Kya was killed during a Fire Nation raid on their village when Katara was young, forcing her young daughter to take on a maternal role in her family. Her only inheritance was a necklace first owned by her grandmother, passed down to each generation as a family heirloom."
    },
    {
      "body": "It was revealed that Kya sacrificed herself to save Katara's life when the Fire Nation came to the Southern Water Tribe, seeking to kill the last waterbender. In a courageous act to save her daughter who happened to be the said target, Kya lied to the ${link_0} of the raid, saying she was the last waterbender. Katara tried to avenge her mother's death by killing the soldier who murdered her, but ultimately spared him due to an ethical conflict.",
      "links": [
        {
          "body": "leader",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Yon_Rha",
            "page": "Yon_Rha"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Kya"
      ],
      "text": "It was revealed that Kya sacrificed herself to save Katara's life when the Fire Nation came to the Southern Water Tribe, seeking to kill the last waterbender. In a courageous act to save her daughter who happened to be the said target, Kya lied to the leader of the raid, saying she was the last waterbender. Katara tried to avenge her mother's death by killing the soldier who murdered her, but ultimately spared him due to an ethical conflict."
    },
    {
      "body": "Despite her age at the time of Kya's death, Katara deeply loved her mother and cherished what few memories she had of her. She prized the betrothal necklace given to her by Kya, it being the only material object she had left to remember her. Katara later named her only daughter after Kya, in memory of her mother.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Kya"
      ],
      "text": "Despite her age at the time of Kya's death, Katara deeply loved her mother and cherished what few memories she had of her. She prized the betrothal necklace given to her by Kya, it being the only material object she had left to remember her. Katara later named her only daughter after Kya, in memory of her mother."
    },
    {
      "body": "${link_0} and Katara did not get off to such a great start when they first met. Due to the Northern Water Tribe patriarchal structure, he refused to teach Katara fighting techniques used in waterbending. After defeating her in a fight, he recognized her necklace as the betrothal necklace he made for Kanna sixty years earlier. Realizing that his customs had cost him his fiancée, he agreed to teach her. Their relationship improved as he taught Katara, eventually leading to her becoming his best pupil. After a short time of training, he deemed her worthy of the title of waterbending master. When the two parted ways, Pakku gave her an amulet containing ${link_1} from the ${link_2}, which she later used to revive ${link_3} after Azula shot him with lightning when in the Avatar State. Later, Katara persuaded Sokka to train under a master, saying she would not have mastered waterbending without Pakku's tutoring.",
      "links": [
        {
          "body": "Pakku",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "water",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_water",
            "page": "Spirit_water"
          }
        },
        {
          "body": "Spirit Oasis",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Pakku"
      ],
      "text": "Pakku and Katara did not get off to such a great start when they first met. Due to the Northern Water Tribe patriarchal structure, he refused to teach Katara fighting techniques used in waterbending. After defeating her in a fight, he recognized her necklace as the betrothal necklace he made for Kanna sixty years earlier. Realizing that his customs had cost him his fiancée, he agreed to teach her. Their relationship improved as he taught Katara, eventually leading to her becoming his best pupil. After a short time of training, he deemed her worthy of the title of waterbending master. When the two parted ways, Pakku gave her an amulet containing water from the Spirit Oasis, which she later used to revive Aang after Azula shot him with lightning when in the Avatar State. Later, Katara persuaded Sokka to train under a master, saying she would not have mastered waterbending without Pakku's tutoring."
    },
    {
      "body": "Katara was overjoyed to learn about Pakku's engagement to Kanna and their marriage two years later, although she would have like to have attended their ceremony if they had not eloped. Apart from their strong personal relationship, their professional one remained one of mutual respect, with Pakku asking for Katara's assistance with his new waterbending school at the South Pole.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Pakku"
      ],
      "text": "Katara was overjoyed to learn about Pakku's engagement to Kanna and their marriage two years later, although she would have like to have attended their ceremony if they had not eloped. Apart from their strong personal relationship, their professional one remained one of mutual respect, with Pakku asking for Katara's assistance with his new waterbending school at the South Pole."
    },
    {
      "body": "Sokka was Katara's older brother, with an age difference of one year. The Water Tribe siblings were arguably the most dynamic familial relationship shown in the series, rivaled only by Zuko and ${link_0}. The opening scene of the series depicted them enjoying a pastime together, before entering an argument session with one another. Sokka's sarcastic nature often clashed with Katara's more serious and caring one, leading to disagreements and \"sibling spats\". They often kept the other in check with attitudes, whether in Sokka's goofiness and pessimism or Katara's temper and optimism. The two frequently teased and annoyed each other throughout their journeys, including jests about the other's love life, even accidentally.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Sokka"
      ],
      "text": "Sokka was Katara's older brother, with an age difference of one year. The Water Tribe siblings were arguably the most dynamic familial relationship shown in the series, rivaled only by Zuko and Iroh. The opening scene of the series depicted them enjoying a pastime together, before entering an argument session with one another. Sokka's sarcastic nature often clashed with Katara's more serious and caring one, leading to disagreements and \"sibling spats\". They often kept the other in check with attitudes, whether in Sokka's goofiness and pessimism or Katara's temper and optimism. The two frequently teased and annoyed each other throughout their journeys, including jests about the other's love life, even accidentally."
    },
    {
      "body": "Overall, because of all they had gone through together, Sokka and Katara were close and loved each other very much. They frequently defended and protected each other, and worked well together: Katara's bending prowess accompanied by Sokka's mental creativity and weapons specialty created a powerful duo. It was revealed that Katara had replaced Sokka's image of his mother which clearly represents how highly Sokka thought of Katara.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Sokka"
      ],
      "text": "Overall, because of all they had gone through together, Sokka and Katara were close and loved each other very much. They frequently defended and protected each other, and worked well together: Katara's bending prowess accompanied by Sokka's mental creativity and weapons specialty created a powerful duo. It was revealed that Katara had replaced Sokka's image of his mother which clearly represents how highly Sokka thought of Katara."
    },
    {
      "body": "Although Katara teased Sokka about his role of \"being the leader\" in the group, she still remained respectful of him. Katara refused to set off on a journey to rescue Aang without her brother's company. She also did not object her brother's argument that banishing Aang from their tribe was justifiably an act of protection. In essence, these two siblings, despite their daily trials and tribulations, held each other in high respect and were close. At the end of the Hundred Year War, the two got into an argument after Sokka caught Katara kissing Aang. Later, Katara snapped at Sokka again, clearly disgusted with his constant references to 'oogies' whenever she and Aang shared a close, romantic moment.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Sokka"
      ],
      "text": "Although Katara teased Sokka about his role of \"being the leader\" in the group, she still remained respectful of him. Katara refused to set off on a journey to rescue Aang without her brother's company. She also did not object her brother's argument that banishing Aang from their tribe was justifiably an act of protection. In essence, these two siblings, despite their daily trials and tribulations, held each other in high respect and were close. At the end of the Hundred Year War, the two got into an argument after Sokka caught Katara kissing Aang. Later, Katara snapped at Sokka again, clearly disgusted with his constant references to 'oogies' whenever she and Aang shared a close, romantic moment."
    },
    {
      "body": "Sokka died some time before 170 ${link_0}, and in reference to her brother's passing, Katara greatly encouraged her three children to spend more time with each while they were still able.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#After_war_.28100_AG_.E2.80.93_Present.29",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Sokka"
      ],
      "text": "Sokka died some time before 170 AG, and in reference to her brother's passing, Katara greatly encouraged her three children to spend more time with each while they were still able."
    },
    {
      "body": "The two are shown to have a loving relationship that is deep, yet seemingly put off by Tenzin's composed and serious demeanor. However, she clearly loves him and his family. Tenzin is particularly sensitive to having his mother bring up childhood memories, and of her being mentioned, becoming angry at ${link_0} for \"bringing [his] mother into\" their dispute.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Relatives",
        "Tenzin"
      ],
      "text": "The two are shown to have a loving relationship that is deep, yet seemingly put off by Tenzin's composed and serious demeanor. However, she clearly loves him and his family. Tenzin is particularly sensitive to having his mother bring up childhood memories, and of her being mentioned, becoming angry at Korra for \"bringing [his] mother into\" their dispute."
    },
    {
      "body": "Katara, who listened to her grandmother's stories regarding the ${link_0}, believed that he would one day return to save the world, despite that some had lost hope. When Aang was released from the iceberg by Katara, she developed an immediate attachment to the young airbender, believing him to be special. Katara was fascinated by ${link_1}, and eagerly introduced Aang to her entire village, including her grandmother ${link_2}. Katara also admired Aang's ${link_3}, claiming that it was \"amazing.\" She insisted that he could teach her ${link_4}, as she believed he was filled with \"much wisdom.\" Upon learning that Katara is the last remaining waterbender in the South Pole, Aang offered to take Katara to the North Pole on Appa so that she could be taught by a waterbending master. The two later went penguin sledding together, something Katara claimed she had not done since she was \"a kid,\" showing the lighthearted nature of their relationship. After sledding together, Aang and Katara stumbled upon a ${link_5}, and Aang encouraged Katara to explore it with him. Once on the ship, Katara explains that it is likely that Aang has been in the iceberg for around 100 years. She consoles him, saying that there must be a \"bright side\" to his situation. Aang states \"I did get to meet you\" as his response, which Katara responds to with a ${link_6}.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang's tattoos",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Body_markings_in_the_World_of_Avatar",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Kanna",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Kanna",
            "page": "Kanna"
          }
        },
        {
          "body": "airbending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Fire Navy ship",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_cruiser",
            "page": "Fire_Nation_cruiser"
          }
        },
        {
          "body": "warm smile",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Transcript_The_Boy_in_the_Iceberg",
            "page": "Transcript_The_Boy_in_the_Iceberg"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "Katara, who listened to her grandmother's stories regarding the Avatar, believed that he would one day return to save the world, despite that some had lost hope. When Aang was released from the iceberg by Katara, she developed an immediate attachment to the young airbender, believing him to be special. Katara was fascinated by Aang's tattoos, and eagerly introduced Aang to her entire village, including her grandmother Kanna. Katara also admired Aang's airbending, claiming that it was \"amazing.\" She insisted that he could teach her waterbending, as she believed he was filled with \"much wisdom.\" Upon learning that Katara is the last remaining waterbender in the South Pole, Aang offered to take Katara to the North Pole on Appa so that she could be taught by a waterbending master. The two later went penguin sledding together, something Katara claimed she had not done since she was \"a kid,\" showing the lighthearted nature of their relationship. After sledding together, Aang and Katara stumbled upon a Fire Navy ship, and Aang encouraged Katara to explore it with him. Once on the ship, Katara explains that it is likely that Aang has been in the iceberg for around 100 years. She consoles him, saying that there must be a \"bright side\" to his situation. Aang states \"I did get to meet you\" as his response, which Katara responds to with a warm smile."
    },
    {
      "body": "After this trip to the Fire Navy ship, Aang and Katara are met apprehensively by ${link_0} and other members of the Water Tribe, including Kanna. Katara defends Aang, claiming that the flare signal from the ship was an accident. When Kanna reprimands Katara for being near the ship in the first place, Aang intervenes and takes responsibility for bringing Katara onto the ship. When Sokka accuses Aang of being the enemy, Katara insists that Aang is not malicious because he has brought \"fun\" to their village. Katara pleads with Kanna not to exile Aang, and ultimately decides to be \"banished\" alongside him. Katara hesitates once Sokka speaks up and she is unsure of whether she should stay with her family or leave with Aang. Aang tells Katara that he does not want to come between her and her family and reassures her that he will return to the Air Nation. When a young girl from the Water Tribe runs to Aang to tell him that he will be missed, Aang states that he will \"miss [her] too\" before looking to a saddened Katara one last time before departing.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "After this trip to the Fire Navy ship, Aang and Katara are met apprehensively by Sokka and other members of the Water Tribe, including Kanna. Katara defends Aang, claiming that the flare signal from the ship was an accident. When Kanna reprimands Katara for being near the ship in the first place, Aang intervenes and takes responsibility for bringing Katara onto the ship. When Sokka accuses Aang of being the enemy, Katara insists that Aang is not malicious because he has brought \"fun\" to their village. Katara pleads with Kanna not to exile Aang, and ultimately decides to be \"banished\" alongside him. Katara hesitates once Sokka speaks up and she is unsure of whether she should stay with her family or leave with Aang. Aang tells Katara that he does not want to come between her and her family and reassures her that he will return to the Air Nation. When a young girl from the Water Tribe runs to Aang to tell him that he will be missed, Aang states that he will \"miss [her] too\" before looking to a saddened Katara one last time before departing."
    },
    {
      "body": "When Aang agrees to go with ${link_0} to protect Katara's village, Katara is seen on the verge of tears after begging him not to go. Katara wastes no time in convincing Sokka to go after ${link_1} to rescue Aang and rambles about how he is deserving of their help despite Sokka's initial dislike for him. Sokka states that they're going to \"save [her] boyfriend,\" which Katara attempts to deny before Sokka interrupts her. As Kanna fares Sokka and Katara goodbye, she tells them that their destinies are intertwined with Aang's and that they found him for a reason.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Zuko's ship",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko%27s_ship",
            "page": "Zuko%27s_ship"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "When Aang agrees to go with Zuko to protect Katara's village, Katara is seen on the verge of tears after begging him not to go. Katara wastes no time in convincing Sokka to go after Zuko's ship to rescue Aang and rambles about how he is deserving of their help despite Sokka's initial dislike for him. Sokka states that they're going to \"save [her] boyfriend,\" which Katara attempts to deny before Sokka interrupts her. As Kanna fares Sokka and Katara goodbye, she tells them that their destinies are intertwined with Aang's and that they found him for a reason."
    },
    {
      "body": "As Katara and Sokka approach Zuko's ship on Appa to save Aang, he is knocked into the water by Zuko. Katara cries out his name and this ultimately triggers ${link_0}. Upon reaching the ship and witnessing Aang's waterbending, Katara helps support Aang and asks him if he's okay. After they escaped, Katara praised Aang's waterbending, and encouraged him to work toward mastering the four elements. The ${link_1} can be heard playing in the back.",
      "links": [
        {
          "body": "the Avatar State",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/The_Avatar_State",
            "page": "The_Avatar_State"
          }
        },
        {
          "body": "\"Kataang Theme\"",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Soundtrack_of_Avatar__The_Last_Airbender",
            "page": "Soundtrack_of_Avatar__The_Last_Airbender"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "As Katara and Sokka approach Zuko's ship on Appa to save Aang, he is knocked into the water by Zuko. Katara cries out his name and this ultimately triggers the Avatar State. Upon reaching the ship and witnessing Aang's waterbending, Katara helps support Aang and asks him if he's okay. After they escaped, Katara praised Aang's waterbending, and encouraged him to work toward mastering the four elements. The \"Kataang Theme\" can be heard playing in the back."
    },
    {
      "body": "When visiting the ${link_0} for the first time, Katara sympathized with Aang, noting that the Fire Nation could have killed the Airbenders, as they are ruthless and killed her mother. Katara later waterbent snow on the helmet of a Fire Nation soldier, hoping to conceal the Fire Nation's invasion of the Air Temple and ultimately protect Aang from the painful reality that was to come. After discovering the corpse of ${link_1}, Aang enters the Avatar State and Katara attempts to calm him down. Katara tells Aang that she understands how painful the loss of a loved one can be and refers to her deceased mother ${link_2} as she offers her support. She also states that her and Sokka are his new family. As Aang leaves the Avatar State, Katara reaches out to hold his hand, and pulls him into a hug once he realizes that he is the last Airbender.",
      "links": [
        {
          "body": "Southern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        },
        {
          "body": "Monk Gyatso",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Gyatso",
            "page": "Gyatso"
          }
        },
        {
          "body": "Kya",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "When visiting the Southern Air Temple for the first time, Katara sympathized with Aang, noting that the Fire Nation could have killed the Airbenders, as they are ruthless and killed her mother. Katara later waterbent snow on the helmet of a Fire Nation soldier, hoping to conceal the Fire Nation's invasion of the Air Temple and ultimately protect Aang from the painful reality that was to come. After discovering the corpse of Monk Gyatso, Aang enters the Avatar State and Katara attempts to calm him down. Katara tells Aang that she understands how painful the loss of a loved one can be and refers to her deceased mother Kya as she offers her support. She also states that her and Sokka are his new family. As Aang leaves the Avatar State, Katara reaches out to hold his hand, and pulls him into a hug once he realizes that he is the last Airbender."
    },
    {
      "body": "As the series progressed, Katara grew protective and defensive of Aang. From the first episode on, there are various instances in which Katara can be seen sneering and frowning at Sokka and other characters whenever they makes sarcastic, dubious, or negative commentaries relating to Aang.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "As the series progressed, Katara grew protective and defensive of Aang. From the first episode on, there are various instances in which Katara can be seen sneering and frowning at Sokka and other characters whenever they makes sarcastic, dubious, or negative commentaries relating to Aang."
    },
    {
      "body": "Aang revealed his past life at the Southern Air Temple to her, his reasons for running away, and how he feels responsible for the War. Katara remains the only known person Aang has personally confided all of this information. Being that she was his closest friend, Katara offered Aang emotional support throughout their travels.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "Aang revealed his past life at the Southern Air Temple to her, his reasons for running away, and how he feels responsible for the War. Katara remains the only known person Aang has personally confided all of this information. Being that she was his closest friend, Katara offered Aang emotional support throughout their travels."
    },
    {
      "body": "Later on, after Aang was thought to be dead and revived by Katara, using water from the Spirit Oasis in the ${link_0}. Katara went on to heal and personally care for Aang. Shortly after Aang awoke from his comatose state, he disappeared and Katara broke down in horror and fear, feeling abandoned yet again, relating the feeling to when her father left. However, she was the first to embrace Aang in a hug when he was found lying on the shores of ${link_1}. Tears of happiness can also be seen streaming down her face.",
      "links": [
        {
          "body": "Coup of Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Crescent Island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Crescent_Island",
            "page": "Crescent_Island"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "Later on, after Aang was thought to be dead and revived by Katara, using water from the Spirit Oasis in the Coup of Ba Sing Se. Katara went on to heal and personally care for Aang. Shortly after Aang awoke from his comatose state, he disappeared and Katara broke down in horror and fear, feeling abandoned yet again, relating the feeling to when her father left. However, she was the first to embrace Aang in a hug when he was found lying on the shores of Crescent Island. Tears of happiness can also be seen streaming down her face."
    },
    {
      "body": "Aang took an immediate liking to Katara, starting with an instant crush, which gradually developed into stronger and purer feelings of love for the young waterbender as the series progressed. Even though there had been numerous hints that she was interested in Aang romantically, Katara's feelings for the Avatar had been mostly ambiguous, even to herself. During the intermission of ${link_0} play performed by the ${link_1}, Katara confessed to Aang that she was not sure about seeking a romantic relationship with him at that time, saying that she was confused and that there was a war going on. Her actions, however, could be associated with a fear of losing him to Ozai, with her denial of her true feelings for him being a way to spare her the pain of what might come. Despite her inner turmoil at that point, she still had strong faith that he would prevail over Ozai as expressed in her statement, \"Aang won't lose. He's going to come back. He has to.\"",
      "links": [
        {
          "body": "The Boy in the Iceberg",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        },
        {
          "body": "Ember Island Players",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ember_Island_Players",
            "page": "Ember_Island_Players"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "Aang took an immediate liking to Katara, starting with an instant crush, which gradually developed into stronger and purer feelings of love for the young waterbender as the series progressed. Even though there had been numerous hints that she was interested in Aang romantically, Katara's feelings for the Avatar had been mostly ambiguous, even to herself. During the intermission of The Boy in the Iceberg play performed by the Ember Island Players, Katara confessed to Aang that she was not sure about seeking a romantic relationship with him at that time, saying that she was confused and that there was a war going on. Her actions, however, could be associated with a fear of losing him to Ozai, with her denial of her true feelings for him being a way to spare her the pain of what might come. Despite her inner turmoil at that point, she still had strong faith that he would prevail over Ozai as expressed in her statement, \"Aang won't lose. He's going to come back. He has to.\""
    },
    {
      "body": "This ambiguity was finally eliminated after the war, when, outside of the ${link_0}, the two shared a warm embrace and a kiss. Unlike past kisses, which were mostly kisses on the cheek, Katara threw her arms around Aang's neck and initiated a more passionate kiss than they had ever shared before. By doing so, Katara showed that her romantic feelings were entirely mutual, and the two began a long-term romantic relationship.",
      "links": [
        {
          "body": "Jasmine Dragon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "This ambiguity was finally eliminated after the war, when, outside of the Jasmine Dragon, the two shared a warm embrace and a kiss. Unlike past kisses, which were mostly kisses on the cheek, Katara threw her arms around Aang's neck and initiated a more passionate kiss than they had ever shared before. By doing so, Katara showed that her romantic feelings were entirely mutual, and the two began a long-term romantic relationship."
    },
    {
      "body": "Katara's love for and protection of Aang remained evident a year later. When Aang was attacked by Zuko's soldiers in ${link_0}, Katara retaliated by launching several attacks until she was restrained by Zuko. When Aang responded by engaging the Avatar State, Katara again successfully pulled him out of it, saying he could not end Zuko that way. Aang later thanked Katara for this act, and the two shared a warm hug.",
      "links": [
        {
          "body": "Yu Dao",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Yu_Dao",
            "page": "Yu_Dao"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "Katara's love for and protection of Aang remained evident a year later. When Aang was attacked by Zuko's soldiers in Yu Dao, Katara retaliated by launching several attacks until she was restrained by Zuko. When Aang responded by engaging the Avatar State, Katara again successfully pulled him out of it, saying he could not end Zuko that way. Aang later thanked Katara for this act, and the two shared a warm hug."
    },
    {
      "body": "As the crisis in Yu Dao reached a boiling point, with ${link_0} ${link_1} threatening all out war against the Fire Nation, the couple traveled to the colony in an attempt to evacuate its residents from the incoming dual invasion. Following their trip to Ba Sing Se, Katara revealed to Aang that she no longer supported the Harmony Restoration Movement as she thought about their potential future mixed bloodline, much like the current Morishita family. Confused over what that could mean for them specifically, Katara encouraged Aang to isolate himself from the active battle and think about what forced separation of the nations would mean. While Toph and Sokka questioned the Avatar's decision to leave, Katara declared her trust in him to make the right decision.",
      "links": [
        {
          "body": "Earth King",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Kuei",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kuei",
            "page": "Kuei"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "As the crisis in Yu Dao reached a boiling point, with Earth King Kuei threatening all out war against the Fire Nation, the couple traveled to the colony in an attempt to evacuate its residents from the incoming dual invasion. Following their trip to Ba Sing Se, Katara revealed to Aang that she no longer supported the Harmony Restoration Movement as she thought about their potential future mixed bloodline, much like the current Morishita family. Confused over what that could mean for them specifically, Katara encouraged Aang to isolate himself from the active battle and think about what forced separation of the nations would mean. While Toph and Sokka questioned the Avatar's decision to leave, Katara declared her trust in him to make the right decision."
    },
    {
      "body": "After Aang returned, he engaged the Avatar State and opened a fissure in the ground, which nearly caused Zuko to plummet below and die. After Aang saved the Fire Lord and got out of the state, Katara rushed over and hugged him. After the crisis ended, she smiled as she watched Aang train the ${link_0} to become the new ${link_1}.",
      "links": [
        {
          "body": "Official Avatar Aang Fan Club",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Official_Avatar_Aang_Fan_Club",
            "page": "Official_Avatar_Aang_Fan_Club"
          }
        },
        {
          "body": "Air Acolytes",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Acolytes",
            "page": "Air_Acolytes"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "After Aang returned, he engaged the Avatar State and opened a fissure in the ground, which nearly caused Zuko to plummet below and die. After Aang saved the Fire Lord and got out of the state, Katara rushed over and hugged him. After the crisis ended, she smiled as she watched Aang train the Official Avatar Aang Fan Club to become the new Air Acolytes."
    },
    {
      "body": "Katara eventually married Aang and she later gave birth to the couple's three children: A waterbending daughter named ${link_0}, named after Katara's mother, a nonbender son named ${link_1}, named after Aang's old friend named King ${link_2}, and an airbending son named Tenzin.",
      "links": [
        {
          "body": "Kya",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kya",
            "page": "Kya"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "Katara eventually married Aang and she later gave birth to the couple's three children: A waterbending daughter named Kya, named after Katara's mother, a nonbender son named Bumi, named after Aang's old friend named King Bumi, and an airbending son named Tenzin."
    },
    {
      "body": "In her elderly years, even after Aang's somewhat early death in 153 AG, Katara still loves and misses him dearly. She later assisted in training Korra as the next incarnation of the Avatar.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Aang"
      ],
      "text": "In her elderly years, even after Aang's somewhat early death in 153 AG, Katara still loves and misses him dearly. She later assisted in training Korra as the next incarnation of the Avatar."
    },
    {
      "body": "When Katara first met ${link_0}, she was entranced with the young freedom fighter: tall and athletic, brave, an expert dual swordsman, charismatic and verbally smooth. Her liking for Jet went as far as doubting and even criticizing her own brother when he said Jet could not be trusted. Jet later revealed a much different side to his personality when he said he was willing to hurt innocent people to defeat the Fire Nation. Katara was enraged by this and used her waterbending to freeze him to a tree. When she witnessed Jet's gang flood an occupied ${link_1} ${link_2}, she abandoned her feelings for Jet and left him frozen.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jet",
            "page": "Jet"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "village",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Gaipan",
            "page": "Gaipan"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Jet"
      ],
      "text": "When Katara first met Jet, she was entranced with the young freedom fighter: tall and athletic, brave, an expert dual swordsman, charismatic and verbally smooth. Her liking for Jet went as far as doubting and even criticizing her own brother when he said Jet could not be trusted. Jet later revealed a much different side to his personality when he said he was willing to hurt innocent people to defeat the Fire Nation. Katara was enraged by this and used her waterbending to freeze him to a tree. When she witnessed Jet's gang flood an occupied Earth Kingdom village, she abandoned her feelings for Jet and left him frozen."
    },
    {
      "body": "Katara met Jet again in Ba Sing Se where he offered to help find ${link_0} to which everyone accepted, although Katara was reluctant to do so, leading Toph to tease Katara about Jet being her ex-boyfriend. Sokka later teased Katara about her having kissed Jet. Despite all this, Katara was eventually able to set her anger aside after coming to the conclusion that Jet had changed his ways. Jet was fatally wounded by ${link_1} and the team was forced to leave him and his freedom fighters behind. Katara was shown to be deeply remorseful when the group left ${link_2}, somehow knowing that Jet would not make it. Jet later succumbed to his wounds.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Long_Feng",
            "page": "Long_Feng"
          }
        },
        {
          "body": "Lake Laogai",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Lake_Laogai",
            "page": "Lake_Laogai"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Jet"
      ],
      "text": "Katara met Jet again in Ba Sing Se where he offered to help find Appa to which everyone accepted, although Katara was reluctant to do so, leading Toph to tease Katara about Jet being her ex-boyfriend. Sokka later teased Katara about her having kissed Jet. Despite all this, Katara was eventually able to set her anger aside after coming to the conclusion that Jet had changed his ways. Jet was fatally wounded by Long Feng and the team was forced to leave him and his freedom fighters behind. Katara was shown to be deeply remorseful when the group left Lake Laogai, somehow knowing that Jet would not make it. Jet later succumbed to his wounds."
    },
    {
      "body": "Months after his death, in the summer of 100 AG, Zuko and Katara went on a mission to find the man who killed Katara's mother, with Katara clearly intent on getting revenge. Aang recognized her rage and remarked that she was acting like Jet. Katara vehemently denied this, claiming that it was different because she was out to get a monster, while Jet was out to kill innocents. She evidently had not forgotten his crimes despite his heroic \"death\", suggesting there may have been a part of her that was still angry with Jet for his past actions.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Jet"
      ],
      "text": "Months after his death, in the summer of 100 AG, Zuko and Katara went on a mission to find the man who killed Katara's mother, with Katara clearly intent on getting revenge. Aang recognized her rage and remarked that she was acting like Jet. Katara vehemently denied this, claiming that it was different because she was out to get a monster, while Jet was out to kill innocents. She evidently had not forgotten his crimes despite his heroic \"death\", suggesting there may have been a part of her that was still angry with Jet for his past actions."
    },
    {
      "body": "It was hinted in the brief flashbacks of his memories that Jet might also have had genuine romantic feelings for Katara.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Love interests",
        "Jet"
      ],
      "text": "It was hinted in the brief flashbacks of his memories that Jet might also have had genuine romantic feelings for Katara."
    },
    {
      "body": "From when she first first met him, Katara and Appa shared a strong relationship, with the waterbender expressing little doubt of Appa's flying skills, despite Sokka's claims. When Aang was later captured by Zuko, she trusted in Appa's capabilities to fly and help them rescue Aang. Their relationship remained firm with Appa deeming Katara a kind caretaker, specifically exemplified when he allowed her and Zuko to ride him even with Aang absent. She showed concern for Appa upon learning of his capture by the sandbenders and joy once reunited with him.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Allies",
        "Appa"
      ],
      "text": "From when she first first met him, Katara and Appa shared a strong relationship, with the waterbender expressing little doubt of Appa's flying skills, despite Sokka's claims. When Aang was later captured by Zuko, she trusted in Appa's capabilities to fly and help them rescue Aang. Their relationship remained firm with Appa deeming Katara a kind caretaker, specifically exemplified when he allowed her and Zuko to ride him even with Aang absent. She showed concern for Appa upon learning of his capture by the sandbenders and joy once reunited with him."
    },
    {
      "body": "Katara first met ${link_0} while he was secretly practicing ${link_1} outside of his village which was occupied by Fire Nation forces. Haru was surprised and distrustful of the group at first, but soon overcame these feelings and gave them a place to stay for the night. Katara and Haru became fast friends and sympathized with each other's losses in the Hundred Year War, namely Haru's imprisoned father and Katara's deceased mother. After Haru was arrested by the Fire Nation for earthbending, Katara tricked the Fire Nation into arresting her so she could save Haru.",
      "links": [
        {
          "body": "Haru",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Haru",
            "page": "Haru"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Haru"
      ],
      "text": "Katara first met Haru while he was secretly practicing earthbending outside of his village which was occupied by Fire Nation forces. Haru was surprised and distrustful of the group at first, but soon overcame these feelings and gave them a place to stay for the night. Katara and Haru became fast friends and sympathized with each other's losses in the Hundred Year War, namely Haru's imprisoned father and Katara's deceased mother. After Haru was arrested by the Fire Nation for earthbending, Katara tricked the Fire Nation into arresting her so she could save Haru."
    },
    {
      "body": "Katara was able to free Haru and his father, ${link_0}, from prison after she renewed their will to fight for freedom. Together, they freed all the earthbenders from their prison and fled to safety. Katara's actions inspired Haru and his people to free their village of the invaders which they were successful in doing.",
      "links": [
        {
          "body": "Tyro",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tyro",
            "page": "Tyro"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Haru"
      ],
      "text": "Katara was able to free Haru and his father, Tyro, from prison after she renewed their will to fight for freedom. Together, they freed all the earthbenders from their prison and fled to safety. Katara's actions inspired Haru and his people to free their village of the invaders which they were successful in doing."
    },
    {
      "body": "Haru and Katara were happily reunited prior to the ${link_0} invasion and fought together during the battle to take over the ${link_1}. The attack failed and Haru briefly joined the others, venturing to the Western Air Temple.",
      "links": [
        {
          "body": "Day of Black Sun",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "Fire Nation Capital",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Haru"
      ],
      "text": "Haru and Katara were happily reunited prior to the Day of Black Sun invasion and fought together during the battle to take over the Fire Nation Capital. The attack failed and Haru briefly joined the others, venturing to the Western Air Temple."
    },
    {
      "body": "When Azula attacked the temple, Haru accompanied Katara's father while the rest escaped the temple on Appa. They reunited again during Zuko's coronation.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Allies",
        "Haru"
      ],
      "text": "When Azula attacked the temple, Haru accompanied Katara's father while the rest escaped the temple on Appa. They reunited again during Zuko's coronation."
    },
    {
      "body": "Haru was also briefly mentioned when Toph joked that he and Katara had had a secret thing together when the latter declared that she had a surprise for everyone. Haru has been cited by fans as one of Katara's possible love interests, but she herself denied this.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Allies",
        "Haru"
      ],
      "text": "Haru was also briefly mentioned when Toph joked that he and Katara had had a secret thing together when the latter declared that she had a surprise for everyone. Haru has been cited by fans as one of Katara's possible love interests, but she herself denied this."
    },
    {
      "body": "Iroh was originally one of Katara's enemies, albeit indirectly, as the ${link_0} was aiding his nephew, ${link_1} Zuko, in capturing Aang and restoring his honor in the Fire Nation, actually attacking the Avatar and his friends early in their journey. Katara and Iroh first met when Zuko and his soldiers formed an alliance with a group of pirates by means of capturing Team Avatar, who had stolen a ${link_2} from the pirates, which resulted in Zuko taking Katara hostage. When Aang and Sokka were captured by the pirates and brought to her, Katara told Aang it was all her fault. He denied it, but Iroh agreed with Katara, which caused Katara to frown at him.",
      "links": [
        {
          "body": "firebender",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Prince",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "waterbending scroll",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending_scroll",
            "page": "Waterbending_scroll"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Iroh"
      ],
      "text": "Iroh was originally one of Katara's enemies, albeit indirectly, as the firebender was aiding his nephew, Prince Zuko, in capturing Aang and restoring his honor in the Fire Nation, actually attacking the Avatar and his friends early in their journey. Katara and Iroh first met when Zuko and his soldiers formed an alliance with a group of pirates by means of capturing Team Avatar, who had stolen a waterbending scroll from the pirates, which resulted in Zuko taking Katara hostage. When Aang and Sokka were captured by the pirates and brought to her, Katara told Aang it was all her fault. He denied it, but Iroh agreed with Katara, which caused Katara to frown at him."
    },
    {
      "body": "While the Avatar was learning waterbending in the North Pole, the Fire Navy attacked the Northern Water Tribe. Amidst the ensuing battle, ${link_0} ${link_1} was able to infiltrate the Spirit Oasis and attempted to slay the ${link_2}. When Aang was unable to stop him, Iroh unofficially teamed up with the airbender and his friends by intervening and warning Zhao to let the spirit go, as upsetting the natural balance would not only affect the ${link_3} but also the entire world; when the admiral arrogantly refused and murdered the moon spirit, the old man defeated the rest of the Fire Nation soldiers before assisting ${link_4} ${link_5} in her sacrifice.",
      "links": [
        {
          "body": "Admiral",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Moon Spirit",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Princess",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Yue",
            "page": "Yue"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Iroh"
      ],
      "text": "While the Avatar was learning waterbending in the North Pole, the Fire Navy attacked the Northern Water Tribe. Amidst the ensuing battle, Admiral Zhao was able to infiltrate the Spirit Oasis and attempted to slay the Moon Spirit. When Aang was unable to stop him, Iroh unofficially teamed up with the airbender and his friends by intervening and warning Zhao to let the spirit go, as upsetting the natural balance would not only affect the Water Tribe but also the entire world; when the admiral arrogantly refused and murdered the moon spirit, the old man defeated the rest of the Fire Nation soldiers before assisting Princess Yue in her sacrifice."
    },
    {
      "body": "Some weeks later, a thoroughly sleep-deprived Aang was fighting a ${link_0} between Zuko, Princess Azula, and himself; Iroh, along with Katara, Sokka, and Toph arrived to aid him. When Iroh was distracted upon finding out that Toph was affiliated with the Avatar, Azula seriously injured her uncle. Aang, Katara, Toph, and Zuko unleashed all their ${link_1} power at Azula who deflected it and with a firebending move, was able to escape. Despite a past of attacks against Aang, Katara bore no real grudge against Iroh, as the latter had merely accompanied Zuko on the exiled prince's attempts to capture the Avatar, nor did Iroh take issue with the waterbender. Regardless, Katara offered to heal Iroh only to be violently rebuffed by Zuko.",
      "links": [
        {
          "body": "three-way duel",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Confrontation_at_Tu_Zin",
            "page": "Confrontation_at_Tu_Zin"
          }
        },
        {
          "body": "bending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Iroh"
      ],
      "text": "Some weeks later, a thoroughly sleep-deprived Aang was fighting a three-way duel between Zuko, Princess Azula, and himself; Iroh, along with Katara, Sokka, and Toph arrived to aid him. When Iroh was distracted upon finding out that Toph was affiliated with the Avatar, Azula seriously injured her uncle. Aang, Katara, Toph, and Zuko unleashed all their bending power at Azula who deflected it and with a firebending move, was able to escape. Despite a past of attacks against Aang, Katara bore no real grudge against Iroh, as the latter had merely accompanied Zuko on the exiled prince's attempts to capture the Avatar, nor did Iroh take issue with the waterbender. Regardless, Katara offered to heal Iroh only to be violently rebuffed by Zuko."
    },
    {
      "body": "Later, when Zuko and Iroh were in Ba Sing Se and had opened the Jasmine Dragon, Katara visited the teashop with ${link_0}, where she discovered her two enemies. Katara did not trust Zuko and Iroh who had come in peace to live as refugees at Ba Sing Se. Katara immediately rushed to the ${link_1} to divulge Zuko and Iroh's identities and presence to the ${link_2}. Not long after, Azula, who was disguised in the city as a ${link_3}, captured both Katara and Zuko. Iroh knew that Team Avatar was in Ba Sing Se and sought Aang, Sokka, and Toph to help him save his nephew from captivity, forming a permanent official alliance with Team Avatar and vowing himself not to allow Zuko to hurt or hinder Team Avatar ever again. Aang and Iroh made their way to the ${link_4} and rescued Katara and Zuko from their underground prison.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Momo",
            "page": "Momo"
          }
        },
        {
          "body": "Earth Kingdom Royal Palace",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Kuei",
            "page": "Kuei"
          }
        },
        {
          "body": "Kyoshi Warrior",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Crystal Catacombs",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Iroh"
      ],
      "text": "Later, when Zuko and Iroh were in Ba Sing Se and had opened the Jasmine Dragon, Katara visited the teashop with Momo, where she discovered her two enemies. Katara did not trust Zuko and Iroh who had come in peace to live as refugees at Ba Sing Se. Katara immediately rushed to the Earth Kingdom Royal Palace to divulge Zuko and Iroh's identities and presence to the Earth King. Not long after, Azula, who was disguised in the city as a Kyoshi Warrior, captured both Katara and Zuko. Iroh knew that Team Avatar was in Ba Sing Se and sought Aang, Sokka, and Toph to help him save his nephew from captivity, forming a permanent official alliance with Team Avatar and vowing himself not to allow Zuko to hurt or hinder Team Avatar ever again. Aang and Iroh made their way to the Crystal Catacombs and rescued Katara and Zuko from their underground prison."
    },
    {
      "body": "At the end of the conflict at hand, Azula drew Zuko away from his and Iroh's good side and toward his and her evil side. Together, Zuko and Azula, with the help of the ${link_0}, took down Aang and Katara until Aang lay dead in the cornered Katara's arms. Katara was helpless and thought all was lost as she carried her deceased lover's body in her arms. Fully changed from his days as the ruthless Fire Nation general and free from the clutches of Zuko to choose his own destiny, Iroh stepped in on the scene, there for no reason other than to help Katara escape, much to Katara's surprise. He drew the attention of their enemies, so that a reassured Katara carried herself and Aang out of the Crystal Catacombs to safety. When Iroh saved her and Aang's lives, he seemed to have befriended Katara at this point.",
      "links": [
        {
          "body": "Dai Li",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Iroh"
      ],
      "text": "At the end of the conflict at hand, Azula drew Zuko away from his and Iroh's good side and toward his and her evil side. Together, Zuko and Azula, with the help of the Dai Li, took down Aang and Katara until Aang lay dead in the cornered Katara's arms. Katara was helpless and thought all was lost as she carried her deceased lover's body in her arms. Fully changed from his days as the ruthless Fire Nation general and free from the clutches of Zuko to choose his own destiny, Iroh stepped in on the scene, there for no reason other than to help Katara escape, much to Katara's surprise. He drew the attention of their enemies, so that a reassured Katara carried herself and Aang out of the Crystal Catacombs to safety. When Iroh saved her and Aang's lives, he seemed to have befriended Katara at this point."
    },
    {
      "body": "Katara and Iroh met again when the former and her companions, which now included a much changed Zuko sought the latter to help them defeat Ozai, as Aang had mysteriously gone missing. Iroh later helped the team to determine how they should assist in Ozai's final defeat when ${link_0} arrived. It is clear that he respected all of their abilities, as he did not argue when Katara chose her task to assist Zuko in defeating Azula, only offering encouragement. The two remained friends after the Hundred Year War.",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Iroh"
      ],
      "text": "Katara and Iroh met again when the former and her companions, which now included a much changed Zuko sought the latter to help them defeat Ozai, as Aang had mysteriously gone missing. Iroh later helped the team to determine how they should assist in Ozai's final defeat when Sozin's Comet arrived. It is clear that he respected all of their abilities, as he did not argue when Katara chose her task to assist Zuko in defeating Azula, only offering encouragement. The two remained friends after the Hundred Year War."
    },
    {
      "body": "After the death of her husband, the ${link_0} was reincarnated in Korra, a fellow native of the Southern Water Tribe. Katara was entrusted with the task of teaching the new Avatar waterbending, just like she had once done for Aang, and trained her in the art of healing as well. Katara was also present during Korra's firebending test, noticing her bending prowess. Although the ${link_1} uttered doubts about letting Korra start her airbending training with Tenzin, Katara supported Korra. Later, when Korra was about to escape the ${link_2} to go find her own path as the Avatar, Katara found her in the stables with Naga. She understood that Korra had to go, as it was time for her and her generation to take on the responsibility of keeping peace and balance in the world.",
      "links": [
        {
          "body": "Avatar Spirit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_Spirit",
            "page": "Avatar"
          }
        },
        {
          "body": "Order of the White Lotus",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        },
        {
          "body": "Southern Water Tribe compound",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_compound",
            "page": "Southern_Water_Tribe_compound"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Korra"
      ],
      "text": "After the death of her husband, the Avatar Spirit was reincarnated in Korra, a fellow native of the Southern Water Tribe. Katara was entrusted with the task of teaching the new Avatar waterbending, just like she had once done for Aang, and trained her in the art of healing as well. Katara was also present during Korra's firebending test, noticing her bending prowess. Although the Order of the White Lotus uttered doubts about letting Korra start her airbending training with Tenzin, Katara supported Korra. Later, when Korra was about to escape the Southern Water Tribe compound to go find her own path as the Avatar, Katara found her in the stables with Naga. She understood that Korra had to go, as it was time for her and her generation to take on the responsibility of keeping peace and balance in the world."
    },
    {
      "body": "Five weeks after the ${link_0}, Korra trusted Katara enough to help her recover both mentally and physically. With progress being slow, Katara was snapped at by a frustrated Avatar, though the elderly waterbender saw it for what it was and helped Korra to overcome her frustration by sharing the memory of Aang's hardship when he had found out his entire culture had been decimated. Katara subsequently assisted Korra in her first few steps. The two waterbenders continued to work with each other and eventually, Korra was able to recover physically and left the South Pole.",
      "links": [
        {
          "body": "insurrection of the Red Lotus",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Insurrection_of_the_Red_Lotus",
            "page": "Insurrection_of_the_Red_Lotus"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Korra"
      ],
      "text": "Five weeks after the insurrection of the Red Lotus, Korra trusted Katara enough to help her recover both mentally and physically. With progress being slow, Katara was snapped at by a frustrated Avatar, though the elderly waterbender saw it for what it was and helped Korra to overcome her frustration by sharing the memory of Aang's hardship when he had found out his entire culture had been decimated. Katara subsequently assisted Korra in her first few steps. The two waterbenders continued to work with each other and eventually, Korra was able to recover physically and left the South Pole."
    },
    {
      "body": "Katara often referred to Momo in the usual manner of a pet owner, calling him cute, or joking about him. However, she sometimes seemed to view Momo as more than a pet. When he fell down after hallucinating on cactus juice, she cradled and carried him away. Momo was Katara's only companion when she was summoned by the ${link_0} to plan for the upcoming battle. Afterward, she talked to Momo conversationally, and when they decided to visit the Jasmine Dragon, Katara ordered a \"table for two\", implying that Momo would get his own seat. Katara also tried being humorous by placing Momo on her head, and at one point, he managed to untie her from a tree to which Zuko had tied her, an action that prompted Katara to promise him a \"bushel of apples\".",
      "links": [
        {
          "body": "Council of Five",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Council_of_Five",
            "page": "Council_of_Five"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Momo"
      ],
      "text": "Katara often referred to Momo in the usual manner of a pet owner, calling him cute, or joking about him. However, she sometimes seemed to view Momo as more than a pet. When he fell down after hallucinating on cactus juice, she cradled and carried him away. Momo was Katara's only companion when she was summoned by the Council of Five to plan for the upcoming battle. Afterward, she talked to Momo conversationally, and when they decided to visit the Jasmine Dragon, Katara ordered a \"table for two\", implying that Momo would get his own seat. Katara also tried being humorous by placing Momo on her head, and at one point, he managed to untie her from a tree to which Zuko had tied her, an action that prompted Katara to promise him a \"bushel of apples\"."
    },
    {
      "body": "Katara met the leader of the Kyoshi Warriors when Aang traveled to ${link_0} to ride the ${link_1}. They were later captured and taken to the village where ${link_2}, mistrustful of outsiders, threatened to throw them into the water to feed the ${link_3}. When Sokka voiced disdain that he was defeated by girls, Katara quickly made an apology to Suki before any violence could escalate and told Aang to prove himself to be the Avatar. Katara also voiced her glee to her disgruntled brother the next morning about the fact that \"a bunch of girls kicked [his] butt.\"",
      "links": [
        {
          "body": "Kyoshi Island",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "elephant koi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Elephant_koi",
            "page": "Elephant_koi"
          }
        },
        {
          "body": "Suki",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Suki",
            "page": "Suki"
          }
        },
        {
          "body": "unagi",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Unagi",
            "page": "Unagi"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Suki"
      ],
      "text": "Katara met the leader of the Kyoshi Warriors when Aang traveled to Kyoshi Island to ride the elephant koi. They were later captured and taken to the village where Suki, mistrustful of outsiders, threatened to throw them into the water to feed the unagi. When Sokka voiced disdain that he was defeated by girls, Katara quickly made an apology to Suki before any violence could escalate and told Aang to prove himself to be the Avatar. Katara also voiced her glee to her disgruntled brother the next morning about the fact that \"a bunch of girls kicked [his] butt.\""
    },
    {
      "body": "Katara accompanied Sokka to Kyoshi Island where she learned that Suki had left her home to support the war effort. The two met again on the way to Ba Sing Se where she was taken aback by how drastically different Suki appeared without make-up. When ${link_0} went into labor, Katara asked for Suki's help in the delivery.",
      "links": [
        {
          "body": "Ying",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ying",
            "page": "Ying"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Suki"
      ],
      "text": "Katara accompanied Sokka to Kyoshi Island where she learned that Suki had left her home to support the war effort. The two met again on the way to Ba Sing Se where she was taken aback by how drastically different Suki appeared without make-up. When Ying went into labor, Katara asked for Suki's help in the delivery."
    },
    {
      "body": "After joining Team Avatar for good, Suki and Katara worked together in a search for Aang and were both irritated when they came upon the ${link_0} who portrayed him instead.",
      "links": [
        {
          "body": "actress",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ember_Island_Players#Actress_Aang",
            "page": "Ember_Island_Players"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Suki"
      ],
      "text": "After joining Team Avatar for good, Suki and Katara worked together in a search for Aang and were both irritated when they came upon the actress who portrayed him instead."
    },
    {
      "body": "Toph was the young earthbending master that befriended and joined Team Avatar in order to help Aang master earthbending and escape her overprotective parents. Katara was initially excited to have another girl in the group; however, shortly after joining Team Avatar, the two began feuding, with Katara's motherly and teamwork morals and Toph's more cavalier attitude causing heated conflict.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Allies",
        "Toph Beifong"
      ],
      "text": "Toph was the young earthbending master that befriended and joined Team Avatar in order to help Aang master earthbending and escape her overprotective parents. Katara was initially excited to have another girl in the group; however, shortly after joining Team Avatar, the two began feuding, with Katara's motherly and teamwork morals and Toph's more cavalier attitude causing heated conflict."
    },
    {
      "body": "Katara insisted that Toph contribute to the team's routine of setting up camp to which the earthbender refused. She and Toph continually argued with one another, both fighting each other due to their conflicting yet equally stubborn personalities along with different backgrounds. When Katara berated Toph for scamming local residents for monetary gain, the latter retorted, accusing her of being overbearing and acting motherly. However, they respected one another's formidability in bending and later grew to respect their differences. Along the way they became good friends, and enjoyed a day together at a spa during their time in Ba Sing Se. Toph also voiced that Katara was \"fun\", or at the least, fun to argue with.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Allies",
        "Toph Beifong"
      ],
      "text": "Katara insisted that Toph contribute to the team's routine of setting up camp to which the earthbender refused. She and Toph continually argued with one another, both fighting each other due to their conflicting yet equally stubborn personalities along with different backgrounds. When Katara berated Toph for scamming local residents for monetary gain, the latter retorted, accusing her of being overbearing and acting motherly. However, they respected one another's formidability in bending and later grew to respect their differences. Along the way they became good friends, and enjoyed a day together at a spa during their time in Ba Sing Se. Toph also voiced that Katara was \"fun\", or at the least, fun to argue with."
    },
    {
      "body": "Their friendship clearly continued after the Hundred Year War, as Katara was happy to see Toph when she arrived from ${link_0} to join the team on the journey to Yu Dao, though Katara was later upset with her after licking her hand to demonstrate \"oogies\".",
      "links": [
        {
          "body": "her metalbending academy",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Beifong_Metalbending_Academy",
            "page": "Beifong_Metalbending_Academy"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Toph Beifong"
      ],
      "text": "Their friendship clearly continued after the Hundred Year War, as Katara was happy to see Toph when she arrived from her metalbending academy to join the team on the journey to Yu Dao, though Katara was later upset with her after licking her hand to demonstrate \"oogies\"."
    },
    {
      "body": "Katara briefly interacted with the Northern Water Tribe princess during the ${link_0}, when she aided Aang in seeking help from the Spirits by taking him to the Spirit Oasis. Yue informed Katara about how waterbenders are particularly strong during the night due to the presence of the moon. She accompanied Sokka and Katara in rescuing Aang from Prince Zuko, offering words of comfort to a concerned Katara. When the moon spirit was killed by Admiral Zhao, Katara was there to witness Yue's sacrifice.",
      "links": [
        {
          "body": "Siege of the North",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Yue"
      ],
      "text": "Katara briefly interacted with the Northern Water Tribe princess during the Siege of the North, when she aided Aang in seeking help from the Spirits by taking him to the Spirit Oasis. Yue informed Katara about how waterbenders are particularly strong during the night due to the presence of the moon. She accompanied Sokka and Katara in rescuing Aang from Prince Zuko, offering words of comfort to a concerned Katara. When the moon spirit was killed by Admiral Zhao, Katara was there to witness Yue's sacrifice."
    },
    {
      "body": "Katara's relationship with Zuko was complicated. They first met when Zuko invaded the Southern Water Tribe village. Their relationship was often antagonistic as Zuko continued his attempts to capture Aang. She grew to hate him when Zuko threatened to hurt her and her brother and tried bribery, using her mother's necklace. Regardless, Katara offered to help Zuko by healing Iroh only to be violently rebuffed. Later, when the two were imprisoned in the Crystal Catacombs, Katara began to trust Zuko after he revealed that he too had lost his mother to the Fire Nation, saying: \"I'm sorry. That's something we have in common.\" She eventually trusted him to the point where she offered to heal his scar. Later, when Zuko betrayed her and the team by joining Azula, Katara was visibly hurt and her hatred for Zuko only worsened, as she took his betrayal personally.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "Katara's relationship with Zuko was complicated. They first met when Zuko invaded the Southern Water Tribe village. Their relationship was often antagonistic as Zuko continued his attempts to capture Aang. She grew to hate him when Zuko threatened to hurt her and her brother and tried bribery, using her mother's necklace. Regardless, Katara offered to help Zuko by healing Iroh only to be violently rebuffed. Later, when the two were imprisoned in the Crystal Catacombs, Katara began to trust Zuko after he revealed that he too had lost his mother to the Fire Nation, saying: \"I'm sorry. That's something we have in common.\" She eventually trusted him to the point where she offered to heal his scar. Later, when Zuko betrayed her and the team by joining Azula, Katara was visibly hurt and her hatred for Zuko only worsened, as she took his betrayal personally."
    },
    {
      "body": "Consequently, Katara was the most vocal of the group in not allowing Zuko to join them. When Zuko was eventually accepted, Katara confronted him, coldly voicing her distrust of Zuko and his sudden willingness to help Aang, even going so far as to threaten Zuko's life. Even long after the others in the group trusted Zuko, she still remained harsh toward him. Zuko tried to stay out of Katara's way, but eventually confronted her when Katara remained unmoved by his sacrifice even after he saved the team from Azula. This led Zuko to try and reconcile with her by offering to help Katara avenge the death of her mother. With the help of a \"forgiveness speech\" by Aang, their complex relationship was finally thawed out and Katara forgave Zuko.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "Consequently, Katara was the most vocal of the group in not allowing Zuko to join them. When Zuko was eventually accepted, Katara confronted him, coldly voicing her distrust of Zuko and his sudden willingness to help Aang, even going so far as to threaten Zuko's life. Even long after the others in the group trusted Zuko, she still remained harsh toward him. Zuko tried to stay out of Katara's way, but eventually confronted her when Katara remained unmoved by his sacrifice even after he saved the team from Azula. This led Zuko to try and reconcile with her by offering to help Katara avenge the death of her mother. With the help of a \"forgiveness speech\" by Aang, their complex relationship was finally thawed out and Katara forgave Zuko."
    },
    {
      "body": "Katara and Zuko became good friends and grew to respect one another greatly. When Sozin's Comet arrived, Katara personally assured Zuko that Iroh would forgive him. Later, Zuko specifically asked Katara to help him overthrow Azula — an offer she gladly accepted. When the two arrived, Azula challenged Zuko to an ${link_0}; Zuko accepted the challenge, explaining to Katara that he felt victory was feasible as Azula was noticeably \"slipping\". During the duel Azula fired a bolt of lightning at Katara, and Zuko rushed to her aid, becoming critically wounded after a botched attempt at ${link_1}. This forced Katara to fight Azula on her own. After disarming the princess, she immediately ran over to heal Zuko and voiced her gratefulness for saving her life, and vice versa. The two remained friends after the Hundred Year War.",
      "links": [
        {
          "body": "Agni Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Agni_Kai",
            "page": "Agni_Kai"
          }
        },
        {
          "body": "lightning redirection",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "Katara and Zuko became good friends and grew to respect one another greatly. When Sozin's Comet arrived, Katara personally assured Zuko that Iroh would forgive him. Later, Zuko specifically asked Katara to help him overthrow Azula — an offer she gladly accepted. When the two arrived, Azula challenged Zuko to an Agni Kai; Zuko accepted the challenge, explaining to Katara that he felt victory was feasible as Azula was noticeably \"slipping\". During the duel Azula fired a bolt of lightning at Katara, and Zuko rushed to her aid, becoming critically wounded after a botched attempt at lightning redirection. This forced Katara to fight Azula on her own. After disarming the princess, she immediately ran over to heal Zuko and voiced her gratefulness for saving her life, and vice versa. The two remained friends after the Hundred Year War."
    },
    {
      "body": "Later on, when Katara retaliated against Zuko's guards for attacking Aang, Zuko restrained Katara for attacking his people, to the point where Katara claimed he was hurting her. After this, however, the two again seemed at ease with each other, including Katara suggesting a peaceful end to the debate between him and Aang with a meeting between them and the Earth King.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "Later on, when Katara retaliated against Zuko's guards for attacking Aang, Zuko restrained Katara for attacking his people, to the point where Katara claimed he was hurting her. After this, however, the two again seemed at ease with each other, including Katara suggesting a peaceful end to the debate between him and Aang with a meeting between them and the Earth King."
    },
    {
      "body": "Katara encountered Mai for the first time in Omashu, along with Azula and Ty Lee; most of the time, their only interaction was through combat. She initially managed to overpower Mai with her bending until Ty Lee disabled her chi; Mai promptly tried to kill her, but was disarmed and blasted off the platform by Sokka and Appa. The two next encountered each other at the ${link_0} in a duel that pitted the Water Tribe siblings against Mai and Ty Lee. Mai overpowered a sleep-deprived Katara and pinned her to a tree with a sai. Rather than attack her further, Mai remarked that her victory was boring, though the two were defeated by Appa seconds thereafter.",
      "links": [
        {
          "body": "Nan Shan River",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Nan_Shan_River",
            "page": "Nan_Shan_River"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Neutral",
        "Mai"
      ],
      "text": "Katara encountered Mai for the first time in Omashu, along with Azula and Ty Lee; most of the time, their only interaction was through combat. She initially managed to overpower Mai with her bending until Ty Lee disabled her chi; Mai promptly tried to kill her, but was disarmed and blasted off the platform by Sokka and Appa. The two next encountered each other at the Nan Shan River in a duel that pitted the Water Tribe siblings against Mai and Ty Lee. Mai overpowered a sleep-deprived Katara and pinned her to a tree with a sai. Rather than attack her further, Mai remarked that her victory was boring, though the two were defeated by Appa seconds thereafter."
    },
    {
      "body": "Katara briefly encountered Mai along with Azula and Ty Lee when they were disguised as Kyoshi Warriors in Ba Sing Se. She did not see Mai again until the end of the Hundred Year War at the Jasmine Dragon back in the Earth Kingdom capital, where she watched briefly while Mai and Suki played a game of Pai Sho.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Neutral",
        "Mai"
      ],
      "text": "Katara briefly encountered Mai along with Azula and Ty Lee when they were disguised as Kyoshi Warriors in Ba Sing Se. She did not see Mai again until the end of the Hundred Year War at the Jasmine Dragon back in the Earth Kingdom capital, where she watched briefly while Mai and Suki played a game of Pai Sho."
    },
    {
      "body": "While they never formally met, Katara first encountered ${link_0} in ${link_1} when the acrobat accompanied Princess Azula and ${link_2} in a prisoner exchange; the group intended to trade Mai's brother, ${link_3}, for King Bumi. When Mai called off the deal on Azula's orders, the two groups attacked each other. When Katara tried to disarm Mai, Ty Lee ${link_4}, rendering her waterbending useless. Although Sokka and Appa's intervention saved Katara, Katara became fearful of Ty Lee's ability. She even remarked that she feared Ty Lee the most out of the trio of women.",
      "links": [
        {
          "body": "Ty Lee",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "Mai",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Tom-Tom",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Tom-Tom",
            "page": "Tom-Tom"
          }
        },
        {
          "body": "blocked her chi",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Chi_blocking",
            "page": "Chi_blocking"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Neutral",
        "Ty Lee"
      ],
      "text": "While they never formally met, Katara first encountered Ty Lee in Omashu when the acrobat accompanied Princess Azula and Mai in a prisoner exchange; the group intended to trade Mai's brother, Tom-Tom, for King Bumi. When Mai called off the deal on Azula's orders, the two groups attacked each other. When Katara tried to disarm Mai, Ty Lee blocked her chi, rendering her waterbending useless. Although Sokka and Appa's intervention saved Katara, Katara became fearful of Ty Lee's ability. She even remarked that she feared Ty Lee the most out of the trio of women."
    },
    {
      "body": "Katara met Ty Lee in battle on several occasions including at the Outer Wall of Ba Sing Se. When Ty Lee pursued her and Sokka through the ${link_0}'s slurry system, Katara bent the liquefied material, trapping Ty Lee and hatefully called her a \"circus freak\". Later, Ty Lee disabled Katara in Ba Sing Se during the coup d'état, resulting in the latter being captured. The two did not interact for the remainder of the Hundred Year War, nor at Zuko's coronation.",
      "links": [
        {
          "body": "Fire Nation drill",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Neutral",
        "Ty Lee"
      ],
      "text": "Katara met Ty Lee in battle on several occasions including at the Outer Wall of Ba Sing Se. When Ty Lee pursued her and Sokka through the Fire Nation drill's slurry system, Katara bent the liquefied material, trapping Ty Lee and hatefully called her a \"circus freak\". Later, Ty Lee disabled Katara in Ba Sing Se during the coup d'état, resulting in the latter being captured. The two did not interact for the remainder of the Hundred Year War, nor at Zuko's coronation."
    },
    {
      "body": "After the Hundred Year War's end, Ty Lee became a member of the Kyoshi Warriors and a trusted ally of Team Avatar, whom the team met again after Zuko released ${link_0} in a bid to find their mother ${link_1}. Although they did not interact directly, it seems the previous enmity between the two girls has ended, with neither expressing any discomfort at the other's presence.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Ursa",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ursa",
            "page": "Ursa"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Neutral",
        "Ty Lee"
      ],
      "text": "After the Hundred Year War's end, Ty Lee became a member of the Kyoshi Warriors and a trusted ally of Team Avatar, whom the team met again after Zuko released Azula in a bid to find their mother Ursa. Although they did not interact directly, it seems the previous enmity between the two girls has ended, with neither expressing any discomfort at the other's presence."
    },
    {
      "body": "Katara first battled Azula when she and the rest of the team joined forces with Zuko and Iroh to defeat her in a duel. They briefly met again when Katara was captured after she mistook a disguised Azula for Suki and warned her that Zuko and Iroh were in the city. The two girls fought each other in the underground city of Old Ba Sing Se, where Katara held her ground against the Fire Nation Princess and actually gained the upper hand at one point. Only with Zuko's help was Azula able to defeat Katara.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Enemies",
        "Azula"
      ],
      "text": "Katara first battled Azula when she and the rest of the team joined forces with Zuko and Iroh to defeat her in a duel. They briefly met again when Katara was captured after she mistook a disguised Azula for Suki and warned her that Zuko and Iroh were in the city. The two girls fought each other in the underground city of Old Ba Sing Se, where Katara held her ground against the Fire Nation Princess and actually gained the upper hand at one point. Only with Zuko's help was Azula able to defeat Katara."
    },
    {
      "body": "Eager to defeat Azula, Katara accompanied Zuko on a journey to the Fire Nation Capital during the events of Sozin's Comet; Zuko, however, was wounded while protecting her from his sister's lightning strike during their Agni Kai. Realizing she could not heal Zuko unless she put Azula out of action, Katara tricked the princess, allowing her to freeze Azula near the palace water canals, chain her on the ground and ultimately defeat her.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Enemies",
        "Azula"
      ],
      "text": "Eager to defeat Azula, Katara accompanied Zuko on a journey to the Fire Nation Capital during the events of Sozin's Comet; Zuko, however, was wounded while protecting her from his sister's lightning strike during their Agni Kai. Realizing she could not heal Zuko unless she put Azula out of action, Katara tricked the princess, allowing her to freeze Azula near the palace water canals, chain her on the ground and ultimately defeat her."
    },
    {
      "body": "Katara and Azula met again face-to-face a year after the War's end when Zuko summoned her and the group to the Royal Palace to enlist their aid in finding his mother ${link_0}. Katara immediately attacked Azula with her waterbending as the Princess entered the room, though the firebender easily evaded these and remained completely unimpressed by this gesture. When Zuko explained that he agreed to let Azula travel unbound if she helped him find their mother, Katara warned against such a move as Azula was still dangerous, but reluctantly agreed regardless. She remained on high alert around the other girl, and when Azula zapped Sokka for asserting his authority on her, she was quick to intervene and angrily berated the Princess for harming her brother. Azula could not be intimidated, and throughout the course of their journey to ${link_1}, the princess repeatedly mocked Katara as a \"snow peasant\" and an \"uneducated co-conspirator\" of Ursa, believing the group to have been working with Ursa to destroy her. When Azula endangered Aang, Katara was quick to encase her in ice and berated her once more, much to the princess' initial outrage. Even after Azula saved the group from a mysterious ${link_2} that attacked them with a swarm of ${link_3}, Katara still remained highly distrustful of Azula, agreeing to take a shift to keep an eye on the princess while she slept.",
      "links": [
        {
          "body": "Ursa",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ursa",
            "page": "Ursa"
          }
        },
        {
          "body": "Hira'a",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hira%27a",
            "page": "Hira%27a"
          }
        },
        {
          "body": "wolf spirit",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Wolf_spirit",
            "page": "Wolf_spirit"
          }
        },
        {
          "body": "moth wasps",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Moth_wasp",
            "page": "Moth_wasp"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Enemies",
        "Azula"
      ],
      "text": "Katara and Azula met again face-to-face a year after the War's end when Zuko summoned her and the group to the Royal Palace to enlist their aid in finding his mother Ursa. Katara immediately attacked Azula with her waterbending as the Princess entered the room, though the firebender easily evaded these and remained completely unimpressed by this gesture. When Zuko explained that he agreed to let Azula travel unbound if she helped him find their mother, Katara warned against such a move as Azula was still dangerous, but reluctantly agreed regardless. She remained on high alert around the other girl, and when Azula zapped Sokka for asserting his authority on her, she was quick to intervene and angrily berated the Princess for harming her brother. Azula could not be intimidated, and throughout the course of their journey to Hira'a, the princess repeatedly mocked Katara as a \"snow peasant\" and an \"uneducated co-conspirator\" of Ursa, believing the group to have been working with Ursa to destroy her. When Azula endangered Aang, Katara was quick to encase her in ice and berated her once more, much to the princess' initial outrage. Even after Azula saved the group from a mysterious wolf spirit that attacked them with a swarm of moth wasps, Katara still remained highly distrustful of Azula, agreeing to take a shift to keep an eye on the princess while she slept."
    },
    {
      "body": "It is interesting to note that Katara remains the only member of Team Avatar who has been able to face Azula on equal terms one-on-one when forced to battle and actually defeat her, a fact the Princess angrily acknowledged when ranting against a hallucinated image of her mother.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Enemies",
        "Azula"
      ],
      "text": "It is interesting to note that Katara remains the only member of Team Avatar who has been able to face Azula on equal terms one-on-one when forced to battle and actually defeat her, a fact the Princess angrily acknowledged when ranting against a hallucinated image of her mother."
    },
    {
      "body": "During their journey to ${link_0}, Katara found Azula unbearable, begrudging her for recklessly burning a section of the mysterious forest they were in.",
      "links": [
        {
          "body": "Hira'a",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hira%27a",
            "page": "Hira%27a"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Enemies",
        "Azula"
      ],
      "text": "During their journey to Hira'a, Katara found Azula unbearable, begrudging her for recklessly burning a section of the mysterious forest they were in."
    },
    {
      "body": "Upon first meeting her, Katara was quite fond of ${link_0} even comparing the elderly innkeeper to her own grandmother. Upon learning she was also a waterbender from the Southern Water Tribe, she was both touched by her story and excited to learn the southern traditions. Katara learned various waterbending techniques from Hama, but soon discovered Hama's true nature when she tried to teach her ${link_1}, a dark technique of waterbending that allows a waterbender to control the fluids in another organism. Katara defied Hama, vowing never to utilize the technique. The two fought a short duel; Katara momentarily gained the upper hand until Sokka and Aang arrived at the scene and became victims of Hama's technique. When she intended to kill Aang by sending Sokka's sword straight at him, Katara realized the only solution was to utilize bloodbending on her. Hama was taken prisoner by Fire Nation villagers, calling an end to her job and congratulating Katara on her new status, leaving the young waterbender in tears. While Katara seemed to be deeply affected by this encounter, she took similar actions when she tracked down her mother's killer with Zuko's help, even using bloodbending to subdue the man whom she thought was the killer.",
      "links": [
        {
          "body": "Hama",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hama",
            "page": "Hama"
          }
        },
        {
          "body": "bloodbending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bloodbending",
            "page": "Bloodbending"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Enemies",
        "Hama"
      ],
      "text": "Upon first meeting her, Katara was quite fond of Hama even comparing the elderly innkeeper to her own grandmother. Upon learning she was also a waterbender from the Southern Water Tribe, she was both touched by her story and excited to learn the southern traditions. Katara learned various waterbending techniques from Hama, but soon discovered Hama's true nature when she tried to teach her bloodbending, a dark technique of waterbending that allows a waterbender to control the fluids in another organism. Katara defied Hama, vowing never to utilize the technique. The two fought a short duel; Katara momentarily gained the upper hand until Sokka and Aang arrived at the scene and became victims of Hama's technique. When she intended to kill Aang by sending Sokka's sword straight at him, Katara realized the only solution was to utilize bloodbending on her. Hama was taken prisoner by Fire Nation villagers, calling an end to her job and congratulating Katara on her new status, leaving the young waterbender in tears. While Katara seemed to be deeply affected by this encounter, she took similar actions when she tracked down her mother's killer with Zuko's help, even using bloodbending to subdue the man whom she thought was the killer."
    },
    {
      "body": "Katara and Long Feng first met when she and Toph were attempting to sneak into ${link_0}'s party so they could talk to the Earth King. In order to gain entrance into the party, they told Long Feng their parents were waiting for them and that they had lost their invitations. Long Feng permitted them to enter, but quickly apprehended Katara and the rest of Team Avatar. Following this, he strictly warned them to no longer interfere with his ${link_1}, or else they would be expelled from the city. The team listened to him at first, but soon defied his orders by infiltrating his secret headquarters underneath Lake Laogai and later invading the Earth Kingdom Royal Palace where they informed Kuei of the conspiracy, resulting in Long Feng's arrest.",
      "links": [
        {
          "body": "Bosco",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bosco",
            "page": "Bosco"
          }
        },
        {
          "body": "conspiracy",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Conspiracy_of_Ba_Sing_Se",
            "page": "Conspiracy_of_Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Enemies",
        "Long Feng"
      ],
      "text": "Katara and Long Feng first met when she and Toph were attempting to sneak into Bosco's party so they could talk to the Earth King. In order to gain entrance into the party, they told Long Feng their parents were waiting for them and that they had lost their invitations. Long Feng permitted them to enter, but quickly apprehended Katara and the rest of Team Avatar. Following this, he strictly warned them to no longer interfere with his conspiracy, or else they would be expelled from the city. The team listened to him at first, but soon defied his orders by infiltrating his secret headquarters underneath Lake Laogai and later invading the Earth Kingdom Royal Palace where they informed Kuei of the conspiracy, resulting in Long Feng's arrest."
    },
    {
      "body": "Katara first met the Fire Nation soldier, Yon Rha, and his unit, the ${link_0}, when they attacked her village when she was only eight years-old. When Katara ran to find her mother, Kya, she was horrified to find that Yon Rha was holding her hostage in their house. Yon Rha demanded that she leave which she did upon Kya's insistence. Yon Rha demanded that Kya tell him the identity of the last waterbender of the Southern Water Tribe; she lied, claiming her to be the waterbender, in order to protect Katara, and was promptly killed by Yon Rha.",
      "links": [
        {
          "body": "Southern Raiders",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Raiders",
            "page": "Southern_Raiders"
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Enemies",
        "Yon Rha"
      ],
      "text": "Katara first met the Fire Nation soldier, Yon Rha, and his unit, the Southern Raiders, when they attacked her village when she was only eight years-old. When Katara ran to find her mother, Kya, she was horrified to find that Yon Rha was holding her hostage in their house. Yon Rha demanded that she leave which she did upon Kya's insistence. Yon Rha demanded that Kya tell him the identity of the last waterbender of the Southern Water Tribe; she lied, claiming her to be the waterbender, in order to protect Katara, and was promptly killed by Yon Rha."
    },
    {
      "body": "Katara never forgot Yon Rha's face, particularly remembering the hateful look in his eyes. She forever held a deep hatred for Yon Rha and was determined to exact revenge on him for her mother's death. Zuko offered to help her track him down which she eventually did. She interrogated Yon Rha and forced him to confess that he killed Kya. Katara realized that her mother had died to save her life and nearly killed Yon Rha in a fit of rage. However, she could not bring herself to carry out her action and ultimately spared Yon Rha when she saw how truly pathetic he was. He was willing to sacrifice his own mother in exchange for mercy, causing Katara to despise his cowardice, proving that he was truly not worth killing. She left him cowering and crying in the rain. Despite her actions, Katara swore she would never forgive Yon Rha for his crime.",
      "links": [],
      "section": [
        "Katara's relationships",
        "Enemies",
        "Yon Rha"
      ],
      "text": "Katara never forgot Yon Rha's face, particularly remembering the hateful look in his eyes. She forever held a deep hatred for Yon Rha and was determined to exact revenge on him for her mother's death. Zuko offered to help her track him down which she eventually did. She interrogated Yon Rha and forced him to confess that he killed Kya. Katara realized that her mother had died to save her life and nearly killed Yon Rha in a fit of rage. However, she could not bring herself to carry out her action and ultimately spared Yon Rha when she saw how truly pathetic he was. He was willing to sacrifice his own mother in exchange for mercy, causing Katara to despise his cowardice, proving that he was truly not worth killing. She left him cowering and crying in the rain. Despite her actions, Katara swore she would never forgive Yon Rha for his crime."
    },
    {
      "body": "${link_0} The creators themselves have commented in an interview that they had always favored the idea of a relationship between Aang and Katara; the Track Team even named a short theme song, titled \"Kataang\", after their romance.",
      "links": [
        {
          "body": "↑",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/#cite_ref-37",
            "page": ""
          }
        }
      ],
      "section": [
        "Katara's relationships",
        "Notes"
      ],
      "text": "↑ The creators themselves have commented in an interview that they had always favored the idea of a relationship between Aang and Katara; the Track Team even named a short theme song, titled \"Kataang\", after their romance."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Katara%27s_relationships",
    "file": "avatar.wikia.com/wiki/Katara's_relationships.html",
    "page": "Katara's_relationships",
    "title": "Katara's relationships"
  }
}