{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "href": "Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}, extending from her early life at the ${link_2} to her later life in ${link_3}. Korra is a vivacious and caring young woman whose antics find her both dangerous enemies and loving friends.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_3}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "text": "This page is comprised of Korra's relationships with other characters in the World of Avatar, extending from her early life at the Southern Water Tribe to her later life in Republic City. Korra is a vivacious and caring young woman whose antics find her both dangerous enemies and loving friends."
    },
    {
      "body": "Korra's cousins, ${link_0}, have a mutual low opinion of Korra, despite her position as the ${link_1}. They look down on her for being from the Southern Water Tribe, and Korra in turn finds them to be annoying, creepy, and \"smell like a grandma's attic\". The relationship between them worsened during the ${link_2}, as Eska blamed Korra for Bolin leaving her and accused the Avatar of stealing her husband. After the apocalyptic battle against Unalaq, who had merged with Vaatu to become the Dark Avatar, they were glad that Korra defeated their father, ending up on good terms.",
      "links": [
        {
          "body": "Desna and Eska",
          "key": "${link_0}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Water Tribe Civil War",
          "key": "${link_2}",
          "target": {
            "href": "Water_Tribe_Civil_War",
            "page": "Water_Tribe_Civil_War"
          }
        }
      ],
      "text": "Korra's cousins, Desna and Eska, have a mutual low opinion of Korra, despite her position as the Avatar. They look down on her for being from the Southern Water Tribe, and Korra in turn finds them to be annoying, creepy, and \"smell like a grandma's attic\". The relationship between them worsened during the Water Tribe Civil War, as Eska blamed Korra for Bolin leaving her and accused the Avatar of stealing her husband. After the apocalyptic battle against Unalaq, who had merged with Vaatu to become the Dark Avatar, they were glad that Korra defeated their father, ending up on good terms."
    },
    {
      "body": "${link_0} embraced her parents, ${link_1} and ${link_2}, before her departure from the ${link_3}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_1}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Senna",
          "key": "${link_2}",
          "target": {
            "href": "Senna",
            "page": "Senna"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_3}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "Korra embraced her parents, Tonraq and Senna, before her departure from the Southern Water Tribe."
    },
    {
      "body": "Korra's parents are caring and understanding of their daughter, and she seems to have a good relationship with them. They discovered she was the Avatar when Korra began ${link_0} ${link_1}, ${link_2}, and ${link_3} at only four years old. They were supportive of their young daughter, enough so to let her travel to Republic City and follow her destiny. Korra bade her parents farewell before she embarked on her voyage to the city. After Korra lost most of her bending abilities to ${link_4}, and ${link_5} traveled to the ${link_6}, ${link_7} and ${link_8} anxiously awaited alongside their daughter's friends to see if ${link_9} was able to return Korra's bending, and they later witnessed with pride how their daughter successfully restored Lin Beifong's bending abilities.",
      "links": [
        {
          "body": "bending",
          "key": "${link_0}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "water",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "earth",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "fire",
          "key": "${link_3}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Amon",
          "key": "${link_4}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_5}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "South Pole",
          "key": "${link_6}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_7}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Senna",
          "key": "${link_8}",
          "target": {
            "href": "Senna",
            "page": "Senna"
          }
        },
        {
          "body": "Katara",
          "key": "${link_9}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Korra's parents are caring and understanding of their daughter, and she seems to have a good relationship with them. They discovered she was the Avatar when Korra began bending water, earth, and fire at only four years old. They were supportive of their young daughter, enough so to let her travel to Republic City and follow her destiny. Korra bade her parents farewell before she embarked on her voyage to the city. After Korra lost most of her bending abilities to Amon, and Team Avatar traveled to the South Pole, Tonraq and Senna anxiously awaited alongside their daughter's friends to see if Katara was able to return Korra's bending, and they later witnessed with pride how their daughter successfully restored Lin Beifong's bending abilities."
    },
    {
      "body": "Korra's relationship with her father suffered tension when, at the ${link_0} in 171 ${link_1}, she found out that it was he and Tenzin who made the decision to keep her locked up in the ${link_2}. This decision only further convinced the Avatar to take in ${link_3} as her spiritual mentor. Korra, upset that her father had not let her live her own life, acted colder to him on the journey to the South Pole. These feelings only worsened when Tonraq told her that he was banished from the Northern Water Tribe for destroying a spirit forest in an attempt to ward off an ${link_4} by ${link_5}. Korra was left angered that her father kept this secret for so long, and later refused to talk to him at all, except to tell him to leave before she encountered the ${link_6}.",
      "links": [
        {
          "body": "Glacier Spirits Festival",
          "key": "${link_0}",
          "target": {
            "href": "Glacier_Spirits_Festival",
            "page": "Glacier_Spirits_Festival"
          }
        },
        {
          "body": "AG",
          "key": "${link_1}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Southern Water Tribe compound",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Water_Tribe_compound",
            "page": "Southern_Water_Tribe_compound"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_3}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "invasion",
          "key": "${link_4}",
          "target": {
            "href": "Barbarian_invasion",
            "page": "Barbarian_invasion"
          }
        },
        {
          "body": "barbarians",
          "key": "${link_5}",
          "target": {
            "href": "Barbarians",
            "page": "Barbarians"
          }
        },
        {
          "body": "Everstorm",
          "key": "${link_6}",
          "target": {
            "href": "Everstorm",
            "page": "Everstorm"
          }
        }
      ],
      "text": "Korra's relationship with her father suffered tension when, at the Glacier Spirits Festival in 171 AG, she found out that it was he and Tenzin who made the decision to keep her locked up in the Southern Water Tribe compound. This decision only further convinced the Avatar to take in Unalaq as her spiritual mentor. Korra, upset that her father had not let her live her own life, acted colder to him on the journey to the South Pole. These feelings only worsened when Tonraq told her that he was banished from the Northern Water Tribe for destroying a spirit forest in an attempt to ward off an invasion by barbarians. Korra was left angered that her father kept this secret for so long, and later refused to talk to him at all, except to tell him to leave before she encountered the Everstorm."
    },
    {
      "body": "This strain only increased in the prelude of the civil war due to their differing opinions about Unalaq's presence and intentions. Her hostility to her father spilled over to her mother when she tried mediating between them. When Korra learned from her mother that Tonraq was approached to be part of a kidnapping attempt of Unalaq, she immediately assumed that her father had accepted the offer. Despite her anger with him, she did offer the rebels a chance to escape without consequences in an attempt to save her father. She was shocked to learn that her father was not part of the group and was deemed a traitor by the other rebels. Distraught, Korra ran back to her parents, apologizing to them for the pain she caused, and Tonraq apologized in return for holding her back. When Senna revealed that they knew Korra would eventually no longer need them, the Avatar insisted that she still needed them and the family shared a hug, only for the moment to be interrupted by Unalaq, who arrested Tonraq and Senna.",
      "links": [],
      "text": "This strain only increased in the prelude of the civil war due to their differing opinions about Unalaq's presence and intentions. Her hostility to her father spilled over to her mother when she tried mediating between them. When Korra learned from her mother that Tonraq was approached to be part of a kidnapping attempt of Unalaq, she immediately assumed that her father had accepted the offer. Despite her anger with him, she did offer the rebels a chance to escape without consequences in an attempt to save her father. She was shocked to learn that her father was not part of the group and was deemed a traitor by the other rebels. Distraught, Korra ran back to her parents, apologizing to them for the pain she caused, and Tonraq apologized in return for holding her back. When Senna revealed that they knew Korra would eventually no longer need them, the Avatar insisted that she still needed them and the family shared a hug, only for the moment to be interrupted by Unalaq, who arrested Tonraq and Senna."
    },
    {
      "body": "Despite Korra's attempts to prove both of her parents' innocence, Tonraq was found guilty of treason and sentenced to death. Enraged, Korra threatened to take Judge ${link_0}'s life if he would not change his mind, and due to Unalaq's intervention, the sentence was reduced to life imprisonment. Nevertheless, Korra was still determined to free her father, even suggesting breaking him out of prison, though Tonraq urged her not to as to prevent an outbreak of war. However, after confronting Hotah once more, she learned that Unalaq had orchestrated both her father's banishment and his imprisonment. Korra subsequently decided to enlist her friends in an attempted jailbreak, only to learn that Tonraq was being transferred to the North. Team Avatar gave chase and freed the rebels on the ship. While chided by Tonraq for her rashness, Korra, upon reaching safety, revealed the truth and offered her help to oppose Unalaq. However, Tonraq refused her assistance, instead tasking her with getting the United Forces on the South's side. With a final hug, both father and daughter departed on their separate ways.",
      "links": [
        {
          "body": "Hotah",
          "key": "${link_0}",
          "target": {
            "href": "Hotah",
            "page": "Hotah"
          }
        }
      ],
      "text": "Despite Korra's attempts to prove both of her parents' innocence, Tonraq was found guilty of treason and sentenced to death. Enraged, Korra threatened to take Judge Hotah's life if he would not change his mind, and due to Unalaq's intervention, the sentence was reduced to life imprisonment. Nevertheless, Korra was still determined to free her father, even suggesting breaking him out of prison, though Tonraq urged her not to as to prevent an outbreak of war. However, after confronting Hotah once more, she learned that Unalaq had orchestrated both her father's banishment and his imprisonment. Korra subsequently decided to enlist her friends in an attempted jailbreak, only to learn that Tonraq was being transferred to the North. Team Avatar gave chase and freed the rebels on the ship. While chided by Tonraq for her rashness, Korra, upon reaching safety, revealed the truth and offered her help to oppose Unalaq. However, Tonraq refused her assistance, instead tasking her with getting the United Forces on the South's side. With a final hug, both father and daughter departed on their separate ways."
    },
    {
      "body": "Later, when Korra returned to the Southern Water Tribe to close the spirit portals and stop Unalaq, her mother informed her the Southern rebels had been severely injured and her father had been captured by Unalaq. Korra stated she would get him back but was later captured and brought to the same tent Tonraq was in after attempting to infiltrate the spirit portal. Tonraq expressed his sadness, telling Korra that he was sorry that he had failed her, but the latter did not relinquish hope, stating that they still had a chance. As a testament to her words, Bumi miraculously rescued and freed the group. As they approached the entrance to the portal, Tonraq urged them to go, stating that he would repel intruders, but noticing her father's agony, Korra refused to let him fight and asked ${link_0} to take him back to her mother and the other injured ones at the White Lotus Compound. The two lovingly embraced before departing separate ways.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "text": "Later, when Korra returned to the Southern Water Tribe to close the spirit portals and stop Unalaq, her mother informed her the Southern rebels had been severely injured and her father had been captured by Unalaq. Korra stated she would get him back but was later captured and brought to the same tent Tonraq was in after attempting to infiltrate the spirit portal. Tonraq expressed his sadness, telling Korra that he was sorry that he had failed her, but the latter did not relinquish hope, stating that they still had a chance. As a testament to her words, Bumi miraculously rescued and freed the group. As they approached the entrance to the portal, Tonraq urged them to go, stating that he would repel intruders, but noticing her father's agony, Korra refused to let him fight and asked Asami to take him back to her mother and the other injured ones at the White Lotus Compound. The two lovingly embraced before departing separate ways."
    },
    {
      "body": "When Korra started a relationship with Asami, Korra could not wait to share her excitement with her parents, and they were the first to receive the news. Although Tonraq and Senna were happy for them, they also warned their daughter that not everybody would react the same way as they did and suggested keeping the relationship private. Korra took their advice the wrong way and accused her father of being narrow-minded before leaving a not long after they had arrived. However, after talking about the subject with Asami and ${link_0} and learning of the stigma that certain parts of the world had toward same-sex couples, Korra admitted that her parents might have had a point.",
      "links": [
        {
          "body": "Kya",
          "key": "${link_0}",
          "target": {
            "href": "Kya",
            "page": "Kya"
          }
        }
      ],
      "text": "When Korra started a relationship with Asami, Korra could not wait to share her excitement with her parents, and they were the first to receive the news. Although Tonraq and Senna were happy for them, they also warned their daughter that not everybody would react the same way as they did and suggested keeping the relationship private. Korra took their advice the wrong way and accused her father of being narrow-minded before leaving a not long after they had arrived. However, after talking about the subject with Asami and Kya and learning of the stigma that certain parts of the world had toward same-sex couples, Korra admitted that her parents might have had a point."
    },
    {
      "body": "${link_0} insisted that he had faith in ${link_1}'s potential to become a great ${link_2}.",
      "links": [
        {
          "body": "Unalaq",
          "key": "${link_0}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Unalaq insisted that he had faith in Korra's potential to become a great Avatar."
    },
    {
      "body": "At first, Korra had a good relationship with her paternal uncle. When they met during the Glacier Spirits Festival in 171 AG, they greeted each other respectfully and warmly. During the festival's banquet, Unalaq revealed to her that it had been Tonraq and Tenzin who were responsible for her seclusion, not Aang or the White Lotus. Coupled with the tensions rising between her and Tenzin, Korra took up Unalaq's offer to be her spiritual mentor when she learned he was capable of calming dark spirits. When faced with having to enter the spirit forest in the South Pole by herself, Unalaq expressed confidence in her abilities, something Korra greatly appreciated, having felt other people were always telling her what to do. However, upon discovering the truth about her uncle's treachery, and the realization he had only been helping her for his own benefit, she severed all ties with him as her spiritual mentor, calling him a greedy and jealous man. Despite this, the short time Korra spent learning from her uncle was invaluable, as she learned how to pacify dark spirits. Following her uncle's transformation into the ${link_0} and his later defeat, Korra expressed regret at not being able to save him, despite all the hardships he had put her through.",
      "links": [
        {
          "body": "Dark Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Dark_Avatar",
            "page": "Dark_Avatar"
          }
        }
      ],
      "text": "At first, Korra had a good relationship with her paternal uncle. When they met during the Glacier Spirits Festival in 171 AG, they greeted each other respectfully and warmly. During the festival's banquet, Unalaq revealed to her that it had been Tonraq and Tenzin who were responsible for her seclusion, not Aang or the White Lotus. Coupled with the tensions rising between her and Tenzin, Korra took up Unalaq's offer to be her spiritual mentor when she learned he was capable of calming dark spirits. When faced with having to enter the spirit forest in the South Pole by herself, Unalaq expressed confidence in her abilities, something Korra greatly appreciated, having felt other people were always telling her what to do. However, upon discovering the truth about her uncle's treachery, and the realization he had only been helping her for his own benefit, she severed all ties with him as her spiritual mentor, calling him a greedy and jealous man. Despite this, the short time Korra spent learning from her uncle was invaluable, as she learned how to pacify dark spirits. Following her uncle's transformation into the Dark Avatar and his later defeat, Korra expressed regret at not being able to save him, despite all the hardships he had put her through."
    },
    {
      "body": "${link_0} and ${link_1} worked together as members of ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "text": "Korra and Asami worked together as members of Team Avatar."
    },
    {
      "body": "Asami Sato was already dating Mako by the time she first met Korra, and that caused the young Avatar to be a little off-set by her and sparked a sense of jealousy for the wealthy young lady (Mako was her crush as well). Due to Asami's well-rounded upbringing and sophisticated demeanor, Korra initially saw her as \"kind of prissy\", and that made her feel a sense of inferiority when she compared her qualities and personality traits to Asami's (she genuinely felt that she had no chance of winning Mako over as long as Asami was around). However, after getting to know her better, Korra became truly grateful for Asami's friendship because without her and her father, the Fire Ferrets would not have been able to participate in the finals of the ${link_0}. Korra even thanked her for her father's financial support after the conclusion of the Fire Ferrets' semifinal match.",
      "links": [
        {
          "body": "Pro-bending Tournament",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending#Pro-bending_Tournament",
            "page": "Pro-bending"
          }
        }
      ],
      "text": "Asami Sato was already dating Mako by the time she first met Korra, and that caused the young Avatar to be a little off-set by her and sparked a sense of jealousy for the wealthy young lady (Mako was her crush as well). Due to Asami's well-rounded upbringing and sophisticated demeanor, Korra initially saw her as \"kind of prissy\", and that made her feel a sense of inferiority when she compared her qualities and personality traits to Asami's (she genuinely felt that she had no chance of winning Mako over as long as Asami was around). However, after getting to know her better, Korra became truly grateful for Asami's friendship because without her and her father, the Fire Ferrets would not have been able to participate in the finals of the Pro-bending Tournament. Korra even thanked her for her father's financial support after the conclusion of the Fire Ferrets' semifinal match."
    },
    {
      "body": "Still, Korra's initial jealousy for Asami and Mako's relationship remained and it showed when she genuinely seemed shocked when Bolin announced that he and Mako were moving in with Asami on ${link_0}. When Asami called out to Korra and invited her to come over for a visit, Korra initially declined, claiming that she had \"Avatar stuff to do\", but when Bolin used playful persuasion, Korra accepted the invitation and came over the next day. Still viewing her as \"kind of prissy\", Korra was, at first, expecting Asami to make the group to do something stereotypically \"girly\", but when Asami suggested that they go to ${link_1} and offered the Avatar to ride with her in a race, Korra suddenly gained a newfound respect for Asami and even admitted that she was wrong about her. Asami in turn was not offended when Korra acknowledged her prejudice against her and this marked a new beginning in their friendship. Secretly, Korra also felt relieved to have found someone who could be just as intense as her, having constantly been criticized for this trait in the past; she had never had anyone in her life who got her the way Asami did.",
      "links": [
        {
          "body": "her estate",
          "key": "${link_0}",
          "target": {
            "href": "Sato_estate",
            "page": "Sato_estate"
          }
        },
        {
          "body": "her family's racetrack",
          "key": "${link_1}",
          "target": {
            "href": "Future_Industries_test_course",
            "page": "Future_Industries_test_course"
          }
        }
      ],
      "text": "Still, Korra's initial jealousy for Asami and Mako's relationship remained and it showed when she genuinely seemed shocked when Bolin announced that he and Mako were moving in with Asami on her estate. When Asami called out to Korra and invited her to come over for a visit, Korra initially declined, claiming that she had \"Avatar stuff to do\", but when Bolin used playful persuasion, Korra accepted the invitation and came over the next day. Still viewing her as \"kind of prissy\", Korra was, at first, expecting Asami to make the group to do something stereotypically \"girly\", but when Asami suggested that they go to her family's racetrack and offered the Avatar to ride with her in a race, Korra suddenly gained a newfound respect for Asami and even admitted that she was wrong about her. Asami in turn was not offended when Korra acknowledged her prejudice against her and this marked a new beginning in their friendship. Secretly, Korra also felt relieved to have found someone who could be just as intense as her, having constantly been criticized for this trait in the past; she had never had anyone in her life who got her the way Asami did."
    },
    {
      "body": "After finding out that Hiroshi was a part of the Equalists, Korra wished for Mako to comfort Asami despite her own affections and even invited her and the brothers to live with her on Air Temple Island. Asami joined Team Avatar on the island, however, after learning from Ikki that Korra has feelings for Mako, Asami was shown to be a bit suspicious about Korra and Mako's close relationship, though she took it out on Mako instead of Korra. This was further exacerbated by Mako's protective behavior toward Korra after her abduction by Tarrlok. Despite this, the two stayed friends, as Asami was with the others when Katara tried to restore Korra's bending after it was severed by Amon. She happily spectated how Korra restored Lin Beifong's bending.",
      "links": [],
      "text": "After finding out that Hiroshi was a part of the Equalists, Korra wished for Mako to comfort Asami despite her own affections and even invited her and the brothers to live with her on Air Temple Island. Asami joined Team Avatar on the island, however, after learning from Ikki that Korra has feelings for Mako, Asami was shown to be a bit suspicious about Korra and Mako's close relationship, though she took it out on Mako instead of Korra. This was further exacerbated by Mako's protective behavior toward Korra after her abduction by Tarrlok. Despite this, the two stayed friends, as Asami was with the others when Katara tried to restore Korra's bending after it was severed by Amon. She happily spectated how Korra restored Lin Beifong's bending."
    },
    {
      "body": "${link_0} was comforted by ${link_1} after facing pressure from the ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Republic City press",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City_press",
            "page": "Republic_City_press"
          }
        }
      ],
      "text": "Korra was comforted by Asami after facing pressure from the Republic City press."
    },
    {
      "body": "Despite their relationships with Mako, after the Harmonic Convergence Korra and Asami still remained great friends. Korra would vent to Asami about the issues she was having with the United Republic's president and her frustrations with the fact that her polling numbers were low, while the nonbender would comfort her good friend. Asami also became Korra's driving teacher and occasionally gave the Avatar lessons in which she would sit in the passenger seat and give Korra advice while they navigated around Republic City. During one such lesson, the two talked about their feelings toward their relationship with Mako. Asami confessed that she had kissed him while the two had broken up. Korra said she did not mind, and in turn admitted to and apologized for kissing Mako during the time he and Asami had been dating. Asami also said she did not mind and in fact had known for a while. Korra replied by saying she was glad that despite their relationships with Mako, they had still remained good friends.",
      "links": [],
      "text": "Despite their relationships with Mako, after the Harmonic Convergence Korra and Asami still remained great friends. Korra would vent to Asami about the issues she was having with the United Republic's president and her frustrations with the fact that her polling numbers were low, while the nonbender would comfort her good friend. Asami also became Korra's driving teacher and occasionally gave the Avatar lessons in which she would sit in the passenger seat and give Korra advice while they navigated around Republic City. During one such lesson, the two talked about their feelings toward their relationship with Mako. Asami confessed that she had kissed him while the two had broken up. Korra said she did not mind, and in turn admitted to and apologized for kissing Mako during the time he and Asami had been dating. Asami also said she did not mind and in fact had known for a while. Korra replied by saying she was glad that despite their relationships with Mako, they had still remained good friends."
    },
    {
      "body": "When ${link_0} was badly injured due to ${link_1} poisoning, ${link_2} remained by her side to support her in any way she could.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "mercury",
          "key": "${link_1}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "text": "When Korra was badly injured due to mercury poisoning, Asami remained by her side to support her in any way she could."
    },
    {
      "body": "After Korra was banished from Republic City, the two spent a lot of time together while looking for new airbenders and grew increasingly closer to one another. They occasionally trained together and tended to group together when Team Avatar split into groups of two. Worried about Korra's wellbeing, Asami watched over her when the Avatar meditated into the ${link_0} in hopes to confront ${link_1}. After Korra got severely injured during her battle with him, Asami took care of her during the first two weeks of her recovery, offering to listen whenever she felt the need to talk or be there for her when she needed anything else. During this time, Korra found herself beginning to fall in love with Asami, but due to her confused mental state, she was unsure whether her feelings were real or not.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_1}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        }
      ],
      "text": "After Korra was banished from Republic City, the two spent a lot of time together while looking for new airbenders and grew increasingly closer to one another. They occasionally trained together and tended to group together when Team Avatar split into groups of two. Worried about Korra's wellbeing, Asami watched over her when the Avatar meditated into the Spirit World in hopes to confront Zaheer. After Korra got severely injured during her battle with him, Asami took care of her during the first two weeks of her recovery, offering to listen whenever she felt the need to talk or be there for her when she needed anything else. During this time, Korra found herself beginning to fall in love with Asami, but due to her confused mental state, she was unsure whether her feelings were real or not."
    },
    {
      "body": "When Korra left two weeks after her ${link_0} poisoning to the South Pole, hoping to advance her recovery, Asami was willing to accompany her to the South Pole though she rejected the proposal by noting that the few weeks she would spend by herself would be good for her. However, the recovery did not progress as swiftly as hoped and those weeks turned into months and then years. During that time, Asami wrote numerous letters to Korra, telling Korra that she missed her and that Republic City was not the same without her, as well as keeping Korra up-to-date with how her life was going. Although she also received letters from Mako and Bolin, Korra only wrote back to Asami to confide in her about her fears of being unable to make a full recovery, stating that it was easier to talk to her about it all than to Mako and Bolin, trusting her not to say anything to the brothers.",
      "links": [
        {
          "body": "mercury",
          "key": "${link_0}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        }
      ],
      "text": "When Korra left two weeks after her mercury poisoning to the South Pole, hoping to advance her recovery, Asami was willing to accompany her to the South Pole though she rejected the proposal by noting that the few weeks she would spend by herself would be good for her. However, the recovery did not progress as swiftly as hoped and those weeks turned into months and then years. During that time, Asami wrote numerous letters to Korra, telling Korra that she missed her and that Republic City was not the same without her, as well as keeping Korra up-to-date with how her life was going. Although she also received letters from Mako and Bolin, Korra only wrote back to Asami to confide in her about her fears of being unable to make a full recovery, stating that it was easier to talk to her about it all than to Mako and Bolin, trusting her not to say anything to the brothers."
    },
    {
      "body": "Three years after their separation, Korra was glad to reunite with Asami. Embracing each other warmly, Asami complimented Korra's new haircut, making the Avatar blush, and Korra immediately returned the sentiment by noting that Asami was \"looking snazzy as always\". However, the years of separation had taken their toll. When Asami revealed that she had visited her father in prison, Korra made a well-intended remark about Asami and Hiroshi's relationship to remind Asami that her father may have been only manipulating her like before to which the nonbender took offense. Regardless of the tension and bickering that ensued between the friends, they still managed to work together to save a ${link_0} ${link_1}. Reminiscing about \"old times\" due to the rescue mission, the friends reconciled their differences and warmly embraced each other.",
      "links": [
        {
          "body": "kidnapped",
          "key": "${link_0}",
          "target": {
            "href": "Attempted_kidnapping_of_Prince_Wu",
            "page": "Attempted_kidnapping_of_Prince_Wu"
          }
        },
        {
          "body": "Wu",
          "key": "${link_1}",
          "target": {
            "href": "Wu",
            "page": "Wu"
          }
        }
      ],
      "text": "Three years after their separation, Korra was glad to reunite with Asami. Embracing each other warmly, Asami complimented Korra's new haircut, making the Avatar blush, and Korra immediately returned the sentiment by noting that Asami was \"looking snazzy as always\". However, the years of separation had taken their toll. When Asami revealed that she had visited her father in prison, Korra made a well-intended remark about Asami and Hiroshi's relationship to remind Asami that her father may have been only manipulating her like before to which the nonbender took offense. Regardless of the tension and bickering that ensued between the friends, they still managed to work together to save a kidnapped Wu. Reminiscing about \"old times\" due to the rescue mission, the friends reconciled their differences and warmly embraced each other."
    },
    {
      "body": "A few days later, Korra opened up to Asami about her worries of the Avatar no longer being needed in the world. Although Korra listed many reasons that had led her to that conclusion, Asami countered them all by emphasizing all the good that Korra had done and eventually, with Tenzin's help, she was able to convince the Avatar that she should never give up fighting for balance.",
      "links": [],
      "text": "A few days later, Korra opened up to Asami about her worries of the Avatar no longer being needed in the world. Although Korra listed many reasons that had led her to that conclusion, Asami countered them all by emphasizing all the good that Korra had done and eventually, with Tenzin's help, she was able to convince the Avatar that she should never give up fighting for balance."
    },
    {
      "body": "During ${link_0} and ${link_1}'s wedding, Korra distanced herself from the party and, after Tenzin left her by herself, she asked Asami to sit down with her for a while. As the two women gazed at the Republic City skyline, Korra apologized to Asami for not having come back sooner, though found her apology readily accepted, as Asami noted that she was just glad Korra was there now as she could not have handled losing both her and her father on the same day. Giving Asami a comforting hug, Korra proposed to go on a relaxing vacation together, just the two of them. Asami agreed and proposed to venture into the Spirit World. As they crossed over, they gazed lovingly into each other's eyes, quietly acknowledging their romantic feelings for the other, and officially started their relationship.",
      "links": [
        {
          "body": "Zhu Li",
          "key": "${link_0}",
          "target": {
            "href": "Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_1}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "text": "During Zhu Li and Varrick's wedding, Korra distanced herself from the party and, after Tenzin left her by herself, she asked Asami to sit down with her for a while. As the two women gazed at the Republic City skyline, Korra apologized to Asami for not having come back sooner, though found her apology readily accepted, as Asami noted that she was just glad Korra was there now as she could not have handled losing both her and her father on the same day. Giving Asami a comforting hug, Korra proposed to go on a relaxing vacation together, just the two of them. Asami agreed and proposed to venture into the Spirit World. As they crossed over, they gazed lovingly into each other's eyes, quietly acknowledging their romantic feelings for the other, and officially started their relationship."
    },
    {
      "body": "${link_0} and ${link_1} shared a kiss while on a romantic getaway in the ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Korra and Asami shared a kiss while on a romantic getaway in the Spirit World."
    },
    {
      "body": "Traveling around the Spirit World together, the couple strengthened their relationship. After being attacked by a ${link_0}, which resulted in the loss of all their supplies and the decision to cut their vacation short, Asami did not want to return before they shared a loving kiss. On the way back, Korra confessed to Asami how grateful she had been of the fact that Asami had been there for her after her mercury poisoning when she could not have been there for herself and that it had been no accident that she only wrote to her during that time. Enthusiastic about their new relationship, Korra could not wait to tell the world, starting with her parents, though reigned in her excitement after her parents urged her to keep their relationship private and Asami confessed that she preferred to keep Korra to herself as long as possible. Realizing that not everybody would be as excited about their relationship as they were, Korra appeased Asami's worry by noting that, no matter what anybody said, she would always protect her and their relationship.",
      "links": [
        {
          "body": "rock spirit",
          "key": "${link_0}",
          "target": {
            "href": "Rock_spirit",
            "page": "Rock_spirit"
          }
        }
      ],
      "text": "Traveling around the Spirit World together, the couple strengthened their relationship. After being attacked by a rock spirit, which resulted in the loss of all their supplies and the decision to cut their vacation short, Asami did not want to return before they shared a loving kiss. On the way back, Korra confessed to Asami how grateful she had been of the fact that Asami had been there for her after her mercury poisoning when she could not have been there for herself and that it had been no accident that she only wrote to her during that time. Enthusiastic about their new relationship, Korra could not wait to tell the world, starting with her parents, though reigned in her excitement after her parents urged her to keep their relationship private and Asami confessed that she preferred to keep Korra to herself as long as possible. Realizing that not everybody would be as excited about their relationship as they were, Korra appeased Asami's worry by noting that, no matter what anybody said, she would always protect her and their relationship."
    },
    {
      "body": "Despite being back among the people, Korra and Asami continued to be naturally drawn to each other and worked together flawlessly, supporting and protecting each other when necessary: When Asami was being threatened by the Triple Thread, Korra dropped everything to save her, and when Korra was feeling disheartened about Raiko's opposition of her and the city's crippled state, Asami managed to cheer her up, noting that they will be able to overcome anything as long as they faced it together.",
      "links": [],
      "text": "Despite being back among the people, Korra and Asami continued to be naturally drawn to each other and worked together flawlessly, supporting and protecting each other when necessary: When Asami was being threatened by the Triple Thread, Korra dropped everything to save her, and when Korra was feeling disheartened about Raiko's opposition of her and the city's crippled state, Asami managed to cheer her up, noting that they will be able to overcome anything as long as they faced it together."
    },
    {
      "body": "Their relationship did bring forth some difficulties for them, however, as Asami was targeted by Korra's enemies in order to force the hand of the Avatar: ${link_0} blamed Korra for becoming disfigured by a spirit and kidnapped Asami to make sure Korra would not intervene in his conquest of Republic City. Despite that, the couple managed to overcome those by trusting their friends and each other, having in faith in the fact that they can indeed overcome anything as long as they are together. Three weeks after their ordeal with Tokuga, Korra told Asami she loves her, a confession that was readily reciprocated.",
      "links": [
        {
          "body": "Tokuga",
          "key": "${link_0}",
          "target": {
            "href": "Tokuga",
            "page": "Tokuga"
          }
        }
      ],
      "text": "Their relationship did bring forth some difficulties for them, however, as Asami was targeted by Korra's enemies in order to force the hand of the Avatar: Tokuga blamed Korra for becoming disfigured by a spirit and kidnapped Asami to make sure Korra would not intervene in his conquest of Republic City. Despite that, the couple managed to overcome those by trusting their friends and each other, having in faith in the fact that they can indeed overcome anything as long as they are together. Three weeks after their ordeal with Tokuga, Korra told Asami she loves her, a confession that was readily reciprocated."
    },
    {
      "body": "${link_0} and ${link_1} shared their first kiss outside of the ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_2}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        }
      ],
      "text": "Korra and Mako shared their first kiss outside of the Pro-bending Arena."
    },
    {
      "body": "Korra first met ${link_0} after ${link_1} let her into the ${link_2} changing room to watch their match. Mako was hostile toward Korra despite her friendly introduction, assuming she was another one of Bolin's \"crazy fan-girls\". Korra watched Mako in awe as he knocked out the opposing team single-handedly in the third round. After the match, Korra attempted to entreat Mako once again, though he continued acting indifferent toward her presence. Despite being disappointed by Mako's rude behavior, she eagerly asked Bolin to show her a few pro-bending moves, and by doing so, revealed to them both that she was, in fact, the Avatar. Mako, vaguely impressed by her skills, stated that her earthbending was \"not bad\", to which Korra wished to know what it would take to impress him. At the next match, when ${link_3} appeared to be a no-show, Korra filled in as the replacement waterbender. After a rocky start, she helped the ${link_4} win the match, prompting Mako to call her \"a natural\". He gave her a permanent spot on the team.",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "pro-bending",
          "key": "${link_2}",
          "target": {
            "href": "Pro-bending",
            "page": "Pro-bending"
          }
        },
        {
          "body": "Hasook",
          "key": "${link_3}",
          "target": {
            "href": "Hasook",
            "page": "Hasook"
          }
        },
        {
          "body": "Fire Ferrets",
          "key": "${link_4}",
          "target": {
            "href": "Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        }
      ],
      "text": "Korra first met Mako after Bolin let her into the pro-bending changing room to watch their match. Mako was hostile toward Korra despite her friendly introduction, assuming she was another one of Bolin's \"crazy fan-girls\". Korra watched Mako in awe as he knocked out the opposing team single-handedly in the third round. After the match, Korra attempted to entreat Mako once again, though he continued acting indifferent toward her presence. Despite being disappointed by Mako's rude behavior, she eagerly asked Bolin to show her a few pro-bending moves, and by doing so, revealed to them both that she was, in fact, the Avatar. Mako, vaguely impressed by her skills, stated that her earthbending was \"not bad\", to which Korra wished to know what it would take to impress him. At the next match, when Hasook appeared to be a no-show, Korra filled in as the replacement waterbender. After a rocky start, she helped the Fire Ferrets win the match, prompting Mako to call her \"a natural\". He gave her a permanent spot on the team."
    },
    {
      "body": "Later, when Bolin was kidnapped by the ${link_0}, Mako assumed that he had gone to go see Korra, so he visited ${link_1} while the Avatar was training. Upon seeing that Mako was approaching, ${link_2} and ${link_3} teased Korra for her apparent crush on the firebender. After conversing briefly, the two set out to find Bolin together. During the search, the pair came across ${link_4}, who told them that Bolin went off with the ${link_5}. Mako, daunted by the night-long search, was frustrated by Bolin's disappearance, however, Korra promptly assured Mako that they would find his brother. After a heart-warming talk about Mako's past, they fell asleep against each other, causing Korra and Mako to be embarrassed when they awoke. Later on, while trying to infiltrate an Equalist rally to rescue Bolin, Mako gave Korra his scarf, and they posed as a couple to attract less attention.",
      "links": [
        {
          "body": "Equalists",
          "key": "${link_0}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Air Temple Island",
          "key": "${link_1}",
          "target": {
            "href": "Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_2}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Ikki",
          "key": "${link_3}",
          "target": {
            "href": "Ikki",
            "page": "Ikki"
          }
        },
        {
          "body": "Skoochy",
          "key": "${link_4}",
          "target": {
            "href": "Skoochy",
            "page": "Skoochy"
          }
        },
        {
          "body": "Triple Threat Triad",
          "key": "${link_5}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        }
      ],
      "text": "Later, when Bolin was kidnapped by the Equalists, Mako assumed that he had gone to go see Korra, so he visited Air Temple Island while the Avatar was training. Upon seeing that Mako was approaching, Jinora and Ikki teased Korra for her apparent crush on the firebender. After conversing briefly, the two set out to find Bolin together. During the search, the pair came across Skoochy, who told them that Bolin went off with the Triple Threat Triad. Mako, daunted by the night-long search, was frustrated by Bolin's disappearance, however, Korra promptly assured Mako that they would find his brother. After a heart-warming talk about Mako's past, they fell asleep against each other, causing Korra and Mako to be embarrassed when they awoke. Later on, while trying to infiltrate an Equalist rally to rescue Bolin, Mako gave Korra his scarf, and they posed as a couple to attract less attention."
    },
    {
      "body": "When Mako started to date ${link_0}, Korra became jealous of their relationship, as shown when Mako and Asami were showing off their affection for each other, therefore making Korra turn away in disgust.",
      "links": [
        {
          "body": "Asami Sato",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "text": "When Mako started to date Asami Sato, Korra became jealous of their relationship, as shown when Mako and Asami were showing off their affection for each other, therefore making Korra turn away in disgust."
    },
    {
      "body": "When Korra was helping Ikki and Jinora feed the ${link_0}, the two became curious about Mako and Korra's impending romance and asked her about it. Stating that she did not have feelings for Mako, she created a hypothetical situation, stating, \"But let's just pretend I am interested in him, what would I do?\" Given elaborate and dramatic answers by the two, Korra was alarmed by ${link_1}, who had heard the entire conversation. After empathizing with Korra and giving her advice, Pema told Korra to confess her feelings. After an amazing match, Korra followed through with Pema's advice and confessed her feelings to Mako, but he turned her down, stating that he did not return her romantic feelings and he was with Asami. Korra was instead asked out by Bolin, who gave her enough confidence to be \"date worthy\" again.",
      "links": [
        {
          "body": "winged lemurs",
          "key": "${link_0}",
          "target": {
            "href": "Ring-tailed_winged_lemur",
            "page": "Ring-tailed_winged_lemur"
          }
        },
        {
          "body": "Pema",
          "key": "${link_1}",
          "target": {
            "href": "Pema",
            "page": "Pema"
          }
        }
      ],
      "text": "When Korra was helping Ikki and Jinora feed the winged lemurs, the two became curious about Mako and Korra's impending romance and asked her about it. Stating that she did not have feelings for Mako, she created a hypothetical situation, stating, \"But let's just pretend I am interested in him, what would I do?\" Given elaborate and dramatic answers by the two, Korra was alarmed by Pema, who had heard the entire conversation. After empathizing with Korra and giving her advice, Pema told Korra to confess her feelings. After an amazing match, Korra followed through with Pema's advice and confessed her feelings to Mako, but he turned her down, stating that he did not return her romantic feelings and he was with Asami. Korra was instead asked out by Bolin, who gave her enough confidence to be \"date worthy\" again."
    },
    {
      "body": "${link_0} and ${link_1}'s relationship briefly suffered as a result of their jealousy.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "Korra and Mako's relationship briefly suffered as a result of their jealousy."
    },
    {
      "body": "Mako, being jealous of Korra's impending relationship with Bolin, confronted her before their next match. He stated that he knew she was only dating his brother to get back at him, but Korra retorted, claiming that Mako was saying that only because he himself was, in fact, jealous. The firebender responded that he was only looking out for his younger brother and did not want his heart to be broken, leading the two to have a fight, which caused more complications in their teamwork in the ring.",
      "links": [],
      "text": "Mako, being jealous of Korra's impending relationship with Bolin, confronted her before their next match. He stated that he knew she was only dating his brother to get back at him, but Korra retorted, claiming that Mako was saying that only because he himself was, in fact, jealous. The firebender responded that he was only looking out for his younger brother and did not want his heart to be broken, leading the two to have a fight, which caused more complications in their teamwork in the ring."
    },
    {
      "body": "After the match, Mako confronted Korra and admitted that he had not been totally honest with her. He explained that he did have feelings for her, but was confused due to his relationship with Asami. Korra impulsively kissed Mako, and he kissed back her in return, causing her to blush in delight. However, after she broke it off she noticed that Bolin was standing nearby watching them, and was blamed by Mako for breaking Bolin's heart. This caused another fight between the two and more drama within their team. After Korra won the match, they all apologized to each other and agreed to be friends again, despite the lingering romantic tension.",
      "links": [],
      "text": "After the match, Mako confronted Korra and admitted that he had not been totally honest with her. He explained that he did have feelings for her, but was confused due to his relationship with Asami. Korra impulsively kissed Mako, and he kissed back her in return, causing her to blush in delight. However, after she broke it off she noticed that Bolin was standing nearby watching them, and was blamed by Mako for breaking Bolin's heart. This caused another fight between the two and more drama within their team. After Korra won the match, they all apologized to each other and agreed to be friends again, despite the lingering romantic tension."
    },
    {
      "body": "At the pro-bending championship match, Asami blew a kiss at Mako. Mako returned it as Korra watched with a disgusted expression, indicating that she was still jealous of their romantic relationship. When Korra returned safely from pursuing Amon, Mako immediately rushed over to hug her and told her that he was \"so glad\" she was safe.",
      "links": [],
      "text": "At the pro-bending championship match, Asami blew a kiss at Mako. Mako returned it as Korra watched with a disgusted expression, indicating that she was still jealous of their romantic relationship. When Korra returned safely from pursuing Amon, Mako immediately rushed over to hug her and told her that he was \"so glad\" she was safe."
    },
    {
      "body": "After the ${link_0} was closed down, Korra quickly rushed over to the attic as Mako and Bolin were packing, convinced that they would be forced to return to the streets, but Korra told them that they could stay at Air Temple Island. However, the Avatar learned that Asami had already offered them to stay with her in the ${link_1}, much to her frustration.",
      "links": [
        {
          "body": "Pro-bending Arena",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "Sato estate",
          "key": "${link_1}",
          "target": {
            "href": "Sato_estate",
            "page": "Sato_estate"
          }
        }
      ],
      "text": "After the Pro-bending Arena was closed down, Korra quickly rushed over to the attic as Mako and Bolin were packing, convinced that they would be forced to return to the streets, but Korra told them that they could stay at Air Temple Island. However, the Avatar learned that Asami had already offered them to stay with her in the Sato estate, much to her frustration."
    },
    {
      "body": "${link_0} and ${link_1}'s relationship was further strained when Korra began to suspect ${link_2} of being an ${link_3}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_2}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_3}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        }
      ],
      "text": "Korra and Mako's relationship was further strained when Korra began to suspect Hiroshi Sato of being an Equalist."
    },
    {
      "body": "After Korra formed suspicions about ${link_0} working with the Equalists, she questioned Asami about her father's background. Mako defended the Satos, and later accused Korra of being jealous, even going so far as threatening to break off their friendship if the Avatar continued suspecting about Asami's father and pressing the issue. However, after Korra's suspicions proved true, Mako, Bolin, and Asami made their way into Hiroshi's ${link_1}, only to find that Korra, ${link_2}, ${link_3}, and several ${link_4} had already been defeated. To lead her to safety, Mako hoisted the Avatar up on his shoulders while Asami confronted her father. After Asami defeated Hiroshi, the team escaped on a ${link_5}. There, Korra accepted Mako's apology and invited him, Bolin, and Asami to live on Air Temple Island. She subsequently told Mako to comfort Asami, whom she said really needed him at that moment.",
      "links": [
        {
          "body": "Hiroshi",
          "key": "${link_0}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "secret underground factory",
          "key": "${link_1}",
          "target": {
            "href": "Equalist_factory",
            "page": "Equalist_factory"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_2}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_3}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "metalbending officers",
          "key": "${link_4}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "police airship",
          "key": "${link_5}",
          "target": {
            "href": "Police_airship",
            "page": "Police_airship"
          }
        }
      ],
      "text": "After Korra formed suspicions about Hiroshi working with the Equalists, she questioned Asami about her father's background. Mako defended the Satos, and later accused Korra of being jealous, even going so far as threatening to break off their friendship if the Avatar continued suspecting about Asami's father and pressing the issue. However, after Korra's suspicions proved true, Mako, Bolin, and Asami made their way into Hiroshi's secret underground factory, only to find that Korra, Tenzin, Lin Beifong, and several metalbending officers had already been defeated. To lead her to safety, Mako hoisted the Avatar up on his shoulders while Asami confronted her father. After Asami defeated Hiroshi, the team escaped on a police airship. There, Korra accepted Mako's apology and invited him, Bolin, and Asami to live on Air Temple Island. She subsequently told Mako to comfort Asami, whom she said really needed him at that moment."
    },
    {
      "body": "Korra was later crying over her failures in ${link_0} when Mako, Bolin, and Asami found her. Mako helped comfort and assure her that they were in the fight together, joining in to form a new Team Avatar. While they were patrolling Republic City, Mako helped Korra into the car. They shared a smile, resulting in Asami giving a jealous squint of suspicion. However, their team was short lived when ${link_1} arrested Mako, Bolin and Asami for interfering with his laws. Korra threatened to attack the Councilman at the risk of being imprisoned, but Mako told her that it was not worth it, and that they would all be okay. She stood down, and assured him and his brother that she would speak with Tenzin about releasing them.",
      "links": [
        {
          "body": "airbending",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_1}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        }
      ],
      "text": "Korra was later crying over her failures in airbending when Mako, Bolin, and Asami found her. Mako helped comfort and assure her that they were in the fight together, joining in to form a new Team Avatar. While they were patrolling Republic City, Mako helped Korra into the car. They shared a smile, resulting in Asami giving a jealous squint of suspicion. However, their team was short lived when Tarrlok arrested Mako, Bolin and Asami for interfering with his laws. Korra threatened to attack the Councilman at the risk of being imprisoned, but Mako told her that it was not worth it, and that they would all be okay. She stood down, and assured him and his brother that she would speak with Tenzin about releasing them."
    },
    {
      "body": "Later on when Korra was kidnapped, Mako displayed visible agitation and disbelief at her disappearance. During the search, he seemed to be concerned for Korra's well-being. He snapped at Asami, and came close to hurting an Equalist trying to learn of her whereabouts. When the group finally found Korra, Mako pushed Lin and Tenzin out of the way demanding that they give her some space. He picked her up and carried her in his arms, telling her how worried he was. She responded by saying she was all right and was glad he was there, and put her head closer to his chest. He gently laid her down on Oogi and softly touched her face, telling her she was safe now to which she smiled back.",
      "links": [],
      "text": "Later on when Korra was kidnapped, Mako displayed visible agitation and disbelief at her disappearance. During the search, he seemed to be concerned for Korra's well-being. He snapped at Asami, and came close to hurting an Equalist trying to learn of her whereabouts. When the group finally found Korra, Mako pushed Lin and Tenzin out of the way demanding that they give her some space. He picked her up and carried her in his arms, telling her how worried he was. She responded by saying she was all right and was glad he was there, and put her head closer to his chest. He gently laid her down on Oogi and softly touched her face, telling her she was safe now to which she smiled back."
    },
    {
      "body": "While recovering back at Air Temple Island, Mako sat by her bedside and held her hand softly when she was sleeping, and constantly doted on her making sure she recovered and bringing her tea. While she sadly watched Air Temple Island being invaded, Mako wrapped his arm around her shoulders to comfort her and lead her away down the pipelines.",
      "links": [],
      "text": "While recovering back at Air Temple Island, Mako sat by her bedside and held her hand softly when she was sleeping, and constantly doted on her making sure she recovered and bringing her tea. While she sadly watched Air Temple Island being invaded, Mako wrapped his arm around her shoulders to comfort her and lead her away down the pipelines."
    },
    {
      "body": "${link_0} and ${link_1} kissed after she entered the ${link_2} for the first time.",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "Mako and Korra kissed after she entered the Avatar State for the first time."
    },
    {
      "body": "Mako confronted Amon alongside Korra. He was greatly upset when Amon took away Korra's bending, but was able to resist Amon's ${link_0} and blasted him with lightning. He quickly picked up Korra, running from the room. She lamented about her lost bending, to which Mako said that \"everything will be all right.\" Amon soon caught up to them, causing him to drop Korra. As he was about to take away Mako's bending, Korra, desperate to save Mako, unlocked her airbending and defeated him. They shared a brief embrace and went to the ${link_1}. Mako was waiting with the rest of Korra's friends and family to hear if Katara had succeeded in restoring her bending. When Katara returned to announce that she was unable to restore Korra's bending, Mako, along with everyone else was deeply saddened by the news. As Korra walked out of the room highly disappointed, he followed in an attempt to reassure her. Korra told Mako to \"go away\" to which he responded \"I will but I just want you to know, I'm here for you\". She further explained that she meant to \"go back to Republic City, get on with your life\". Mako was confused and she stated since \"I'm not the Avatar anymore, you don't have to do me anymore favors\". Mako told her that he did not care if she was the Avatar or not, and that when Tarrlok took her he was losing his mind over the thought of never seeing her again. He confessed his love for her, but due to the loss of her connection with the other elements, she could not respond properly and left in sadness. Mako, worried about Korra, went after her and witnessed her go into the ${link_2} for the first time. When Korra noticed his presence, she leapt into his arms for an embrace. Korra admitted her love for him and they shared a passionate kiss, indicating the official start of their romantic relationship.",
      "links": [
        {
          "body": "bloodbending",
          "key": "${link_0}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "Southern Water Tribe compound",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe_compound",
            "page": "Southern_Water_Tribe_compound"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "Mako confronted Amon alongside Korra. He was greatly upset when Amon took away Korra's bending, but was able to resist Amon's bloodbending and blasted him with lightning. He quickly picked up Korra, running from the room. She lamented about her lost bending, to which Mako said that \"everything will be all right.\" Amon soon caught up to them, causing him to drop Korra. As he was about to take away Mako's bending, Korra, desperate to save Mako, unlocked her airbending and defeated him. They shared a brief embrace and went to the Southern Water Tribe compound. Mako was waiting with the rest of Korra's friends and family to hear if Katara had succeeded in restoring her bending. When Katara returned to announce that she was unable to restore Korra's bending, Mako, along with everyone else was deeply saddened by the news. As Korra walked out of the room highly disappointed, he followed in an attempt to reassure her. Korra told Mako to \"go away\" to which he responded \"I will but I just want you to know, I'm here for you\". She further explained that she meant to \"go back to Republic City, get on with your life\". Mako was confused and she stated since \"I'm not the Avatar anymore, you don't have to do me anymore favors\". Mako told her that he did not care if she was the Avatar or not, and that when Tarrlok took her he was losing his mind over the thought of never seeing her again. He confessed his love for her, but due to the loss of her connection with the other elements, she could not respond properly and left in sadness. Mako, worried about Korra, went after her and witnessed her go into the Avatar State for the first time. When Korra noticed his presence, she leapt into his arms for an embrace. Korra admitted her love for him and they shared a passionate kiss, indicating the official start of their romantic relationship."
    },
    {
      "body": "Six months later, Korra and Mako's relationship was still going strong, and they had been the talk of the city. The two valued each other's opinions, going to one another for advice, as well as simply recalling the events of their days. Korra tended to lean on Mako for support and advice, though they also enjoyed more relaxed and romantic times together. Korra apologized to Mako, admitting that she could be difficult due to the strain of being the Avatar, and was aware that she took it out on him when she perceived him to side with others on certain issues.",
      "links": [],
      "text": "Six months later, Korra and Mako's relationship was still going strong, and they had been the talk of the city. The two valued each other's opinions, going to one another for advice, as well as simply recalling the events of their days. Korra tended to lean on Mako for support and advice, though they also enjoyed more relaxed and romantic times together. Korra apologized to Mako, admitting that she could be difficult due to the strain of being the Avatar, and was aware that she took it out on him when she perceived him to side with others on certain issues."
    },
    {
      "body": "${link_0} and ${link_1} fought over the best way to handle the brewing ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "civil war",
          "key": "${link_2}",
          "target": {
            "href": "Water_Tribe_Civil_War",
            "page": "Water_Tribe_Civil_War"
          }
        }
      ],
      "text": "Korra and Mako fought over the best way to handle the brewing civil war."
    },
    {
      "body": "When they returned to Republic City and Mako resumed his job as a police officer, Korra and Mako began having different views on how to handle the brewing civil war between the Water Tribes; Korra insisted on actively taking back her homeland, while Mako tried to avoid conflict and stuck to his duties as an officer first. Mako's sense of duty caused him to inform ${link_0} ${link_1} about Korra's plans to go behind his back and secretly seek Southern support from the ${link_2}. Infuriated by this betrayal, Korra confronted Mako, and after a heated argument, the firebender concluded that their two jobs were too incompatible, and he reluctantly broke up with the Avatar.",
      "links": [
        {
          "body": "President",
          "key": "${link_0}",
          "target": {
            "href": "President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_1}",
          "target": {
            "href": "Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "United Forces",
          "key": "${link_2}",
          "target": {
            "href": "United_Forces",
            "page": "United_Forces"
          }
        }
      ],
      "text": "When they returned to Republic City and Mako resumed his job as a police officer, Korra and Mako began having different views on how to handle the brewing civil war between the Water Tribes; Korra insisted on actively taking back her homeland, while Mako tried to avoid conflict and stuck to his duties as an officer first. Mako's sense of duty caused him to inform President Raiko about Korra's plans to go behind his back and secretly seek Southern support from the United Forces. Infuriated by this betrayal, Korra confronted Mako, and after a heated argument, the firebender concluded that their two jobs were too incompatible, and he reluctantly broke up with the Avatar."
    },
    {
      "body": "Soon after their break up, Korra was attacked by a dark spirit, which caused her to lose part of her memory, including her split with Mako. As such, she ran up to him and kissed him when he was released from prison, telling him how much she had missed him. Surprised, Mako asked her if she was not mad at him anymore, to which Korra explained what had happened to her. Unable to tell her that their argument broke off their relationship, Mako told her the fight had not been that bad.",
      "links": [],
      "text": "Soon after their break up, Korra was attacked by a dark spirit, which caused her to lose part of her memory, including her split with Mako. As such, she ran up to him and kissed him when he was released from prison, telling him how much she had missed him. Surprised, Mako asked her if she was not mad at him anymore, to which Korra explained what had happened to her. Unable to tell her that their argument broke off their relationship, Mako told her the fight had not been that bad."
    },
    {
      "body": "After Unalaq's defeat, Mako summoned the courage to talk to Korra about what had really happened during their argument, and that they had actually broken up. Korra informed him that after mediating in the ${link_0}, she had regained that part of her memory, and asked why he had chosen not to tell her the truth. Mako agreed he should have done so, but admitted that he did not want to hurt her again and that he partially wished the split had not happened. They both agreed that even though they would always love each other, their relationship just did not work because of their different goals in life. After sharing one last kiss, they went their separate ways.",
      "links": [
        {
          "body": "Tree of Time",
          "key": "${link_0}",
          "target": {
            "href": "Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "text": "After Unalaq's defeat, Mako summoned the courage to talk to Korra about what had really happened during their argument, and that they had actually broken up. Korra informed him that after mediating in the Tree of Time, she had regained that part of her memory, and asked why he had chosen not to tell her the truth. Mako agreed he should have done so, but admitted that he did not want to hurt her again and that he partially wished the split had not happened. They both agreed that even though they would always love each other, their relationship just did not work because of their different goals in life. After sharing one last kiss, they went their separate ways."
    },
    {
      "body": "After their breakup, Korra tried to remain on friendly terms with Mako, but he became awkward and disoriented every time they met, especially when the Avatar was with Asami. Despite those feelings, Mako continued to assert his admiration and loyalty toward her, telling Prince Wu that he appreciated how much he had learned and grown through getting to know Korra. Even after nearly being killed during the fight for Republic City, Mako firmly told Korra that he would always be there for her.",
      "links": [],
      "text": "After their breakup, Korra tried to remain on friendly terms with Mako, but he became awkward and disoriented every time they met, especially when the Avatar was with Asami. Despite those feelings, Mako continued to assert his admiration and loyalty toward her, telling Prince Wu that he appreciated how much he had learned and grown through getting to know Korra. Even after nearly being killed during the fight for Republic City, Mako firmly told Korra that he would always be there for her."
    },
    {
      "body": "${link_0} restored ${link_1}'s ability to bend all of the elements.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Aang restored Korra's ability to bend all of the elements."
    },
    {
      "body": "Avatar Korra is Aang's immediate reincarnation, though she initially had no connection with him, as she had difficulty with the spiritual side of being the Avatar. She did, however, learn waterbending from Aang's wife, Katara, with whom she had a strong bond, even sneaking to Republic City with her blessing.",
      "links": [],
      "text": "Avatar Korra is Aang's immediate reincarnation, though she initially had no connection with him, as she had difficulty with the spiritual side of being the Avatar. She did, however, learn waterbending from Aang's wife, Katara, with whom she had a strong bond, even sneaking to Republic City with her blessing."
    },
    {
      "body": "After her first encounter with Amon, Korra began having various visions of Aang, and even, at one point, mistook him for his son, Tenzin. Korra initially was unable to figure out what the visions meant until she brought them up with Tenzin, who said that Aang's spirit could be trying to contact her.",
      "links": [],
      "text": "After her first encounter with Amon, Korra began having various visions of Aang, and even, at one point, mistook him for his son, Tenzin. Korra initially was unable to figure out what the visions meant until she brought them up with Tenzin, who said that Aang's spirit could be trying to contact her."
    },
    {
      "body": "Korra finally made a connection with Aang when Tarrlok imprisoned her in her following the revealing of his bloodbending abilities. Remembering what Tenzin told her, Korra meditated and discovered Aang's struggles with ${link_0} forty years prior. With these visions, Korra believed that Aang had been trying to warn her of Tarrlok but he was actually warning about Amon.",
      "links": [
        {
          "body": "Yakone",
          "key": "${link_0}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        }
      ],
      "text": "Korra finally made a connection with Aang when Tarrlok imprisoned her in her following the revealing of his bloodbending abilities. Remembering what Tenzin told her, Korra meditated and discovered Aang's struggles with Yakone forty years prior. With these visions, Korra believed that Aang had been trying to warn her of Tarrlok but he was actually warning about Amon."
    },
    {
      "body": "Aang and Korra had no further contact until the latter lost her bending to Amon with airbending as her only element. When Katara could not ${link_0} her, a devastated Korra ran off crying. Suddenly, a man approached her, and assuming that it was Tenzin, she told him that she wanted to be left alone. However, the man turned out to be Aang, who told her that she had called for him. Aang told her that she had finally connected with her spiritual self. Korra asked how this was possible, and Aang told her, \"When we hit our lowest point, we are open to the greatest change\". Suddenly all of the previous Avatars appeared behind Aang, who used ${link_1} to restore her bending, and passed on the knowledge to her. Korra later used it to restore Lin Beifong's earthbending.",
      "links": [
        {
          "body": "heal",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        },
        {
          "body": "energybending",
          "key": "${link_1}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        }
      ],
      "text": "Aang and Korra had no further contact until the latter lost her bending to Amon with airbending as her only element. When Katara could not heal her, a devastated Korra ran off crying. Suddenly, a man approached her, and assuming that it was Tenzin, she told him that she wanted to be left alone. However, the man turned out to be Aang, who told her that she had called for him. Aang told her that she had finally connected with her spiritual self. Korra asked how this was possible, and Aang told her, \"When we hit our lowest point, we are open to the greatest change\". Suddenly all of the previous Avatars appeared behind Aang, who used energybending to restore her bending, and passed on the knowledge to her. Korra later used it to restore Lin Beifong's earthbending."
    },
    {
      "body": "${link_0} helped guide ${link_1} after she lost her memory.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Aang helped guide Korra after she lost her memory."
    },
    {
      "body": "After Korra was infected by a dark spirit and lost her memories as well as her connection to her Avatar Spirit, Aang appeared before her in a vision, reminding her that she was the Avatar. Although Korra was able to purge the effects of the dark spirit, she ultimately lost her connection to Aang and her other past lives when Vaatu ripped Raava out of her, enabling Unalaq to destroy the light spirit; with each waterbending blow Raava received, the connection to the past Avatars suffered, until it was ultimately destroyed with the spirit herself. Even though Korra managed to merge with Raava again, the connection to the past Avatars was lost.",
      "links": [],
      "text": "After Korra was infected by a dark spirit and lost her memories as well as her connection to her Avatar Spirit, Aang appeared before her in a vision, reminding her that she was the Avatar. Although Korra was able to purge the effects of the dark spirit, she ultimately lost her connection to Aang and her other past lives when Vaatu ripped Raava out of her, enabling Unalaq to destroy the light spirit; with each waterbending blow Raava received, the connection to the past Avatars suffered, until it was ultimately destroyed with the spirit herself. Even though Korra managed to merge with Raava again, the connection to the past Avatars was lost."
    },
    {
      "body": "${link_0} and ${link_1} enjoyed each other's company while out on a date.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        }
      ],
      "text": "Korra and Bolin enjoyed each other's company while out on a date."
    },
    {
      "body": "Bolin allowed Korra entrance into the Pro-bending Arena by telling ${link_0} that she was with him. Bolin found Korra attractive from the moment he saw her, but she only viewed him as a friend, even after he brought her a cupcake and a rose as gifts for saving him from Amon. Finally, after officially asking her out, Korra accepted to go on a date with Bolin. The two had fun and he stated that she was \"one of a kind\". After Bolin saw Korra kissing Mako, he ran away crying with Korra feeling deeply ashamed that she had hurt him. After winning the semifinals of the tournament, Korra healed Bolin's injured shoulder, and the two agreed that everything would be all right between them. She thanked him for the great time she had with him, and returned the compliment that he was \"one of a kind\". When Korra went to confront the ${link_1} to protest their cancellation of the championship match, Bolin was right by Korra's side and agreed with her completely. Later, when Korra defeated ${link_2} during the coin toss battle, Bolin cheered her victory by announcing Korra as his \"hero\". Bolin also showed concern while awaiting Korra's return from fighting the Equalists after they attacked the arena following the championship match. He was relieved that Korra was all right when Amon attacked the Pro-bending Arena, hugging her quickly after Mako.",
      "links": [
        {
          "body": "Toza",
          "key": "${link_0}",
          "target": {
            "href": "Toza",
            "page": "Toza"
          }
        },
        {
          "body": "council",
          "key": "${link_1}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "Tahno",
          "key": "${link_2}",
          "target": {
            "href": "Tahno",
            "page": "Tahno"
          }
        }
      ],
      "text": "Bolin allowed Korra entrance into the Pro-bending Arena by telling Toza that she was with him. Bolin found Korra attractive from the moment he saw her, but she only viewed him as a friend, even after he brought her a cupcake and a rose as gifts for saving him from Amon. Finally, after officially asking her out, Korra accepted to go on a date with Bolin. The two had fun and he stated that she was \"one of a kind\". After Bolin saw Korra kissing Mako, he ran away crying with Korra feeling deeply ashamed that she had hurt him. After winning the semifinals of the tournament, Korra healed Bolin's injured shoulder, and the two agreed that everything would be all right between them. She thanked him for the great time she had with him, and returned the compliment that he was \"one of a kind\". When Korra went to confront the council to protest their cancellation of the championship match, Bolin was right by Korra's side and agreed with her completely. Later, when Korra defeated Tahno during the coin toss battle, Bolin cheered her victory by announcing Korra as his \"hero\". Bolin also showed concern while awaiting Korra's return from fighting the Equalists after they attacked the arena following the championship match. He was relieved that Korra was all right when Amon attacked the Pro-bending Arena, hugging her quickly after Mako."
    },
    {
      "body": "Despite Bolin having feelings for Korra, she still thinks of him as one of her best friends and cares deeply for him like a brother. She entrusted Naga into watching over and taking care of Bolin.",
      "links": [],
      "text": "Despite Bolin having feelings for Korra, she still thinks of him as one of her best friends and cares deeply for him like a brother. She entrusted Naga into watching over and taking care of Bolin."
    },
    {
      "body": "${link_0} met ${link_1} after saving his life.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh_(United_Forces_general)",
            "page": "Iroh_(United_Forces_general)"
          }
        }
      ],
      "text": "Korra met Iroh after saving his life."
    },
    {
      "body": "Iroh, the general of the ${link_0} and grandson of Lord ${link_1}, viewed Korra as his ally, stating he was looking forward to taking back Republic City together after he received word that the city had been overrun by Amon's forces. The two formally met after Korra saved him after the latter's ship was struck by a bomb that knocked him into the bay unconscious. Later, at ${link_2}'s hideout, the two, along with the rest of Team Avatar, devised a plan to ground Hiroshi's new line of aircrafts as to enable the safe arrival of the next wave of naval reinforcements. At the last moment, Korra backed out of the plan, going after Amon directly instead, saying that she had to face the Equalist leader. Initially, Iroh disagreed, thinking it was far too dangerous, though later respected the Avatar's decision to face her destiny, remarking that his grandfather would have done the same.",
      "links": [
        {
          "body": "United Forces",
          "key": "${link_0}",
          "target": {
            "href": "United_Forces",
            "page": "United_Forces"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Gommu",
          "key": "${link_2}",
          "target": {
            "href": "Gommu",
            "page": "Gommu"
          }
        }
      ],
      "text": "Iroh, the general of the United Forces and grandson of Lord Zuko, viewed Korra as his ally, stating he was looking forward to taking back Republic City together after he received word that the city had been overrun by Amon's forces. The two formally met after Korra saved him after the latter's ship was struck by a bomb that knocked him into the bay unconscious. Later, at Gommu's hideout, the two, along with the rest of Team Avatar, devised a plan to ground Hiroshi's new line of aircrafts as to enable the safe arrival of the next wave of naval reinforcements. At the last moment, Korra backed out of the plan, going after Amon directly instead, saying that she had to face the Equalist leader. Initially, Iroh disagreed, thinking it was far too dangerous, though later respected the Avatar's decision to face her destiny, remarking that his grandfather would have done the same."
    },
    {
      "body": "Six months later, Korra approached Iroh, requesting military intervention to stop the ${link_0}. The general readily agreed to help, though before they could make plans of any sort, President Raiko intervened and threatened to have Iroh court-martialed if a single ship left the harbor. After Raiko had left, Iroh apologized that he could do nothing, but suggested that Korra traveled to the Fire Nation and seek help there, stating that his mother and grandfather would be happy to aid the Avatar. Korra thanked him and the two parted ways in good standing.",
      "links": [
        {
          "body": "Water Tribe Civil War",
          "key": "${link_0}",
          "target": {
            "href": "Water_Tribe_Civil_War",
            "page": "Water_Tribe_Civil_War"
          }
        }
      ],
      "text": "Six months later, Korra approached Iroh, requesting military intervention to stop the Water Tribe Civil War. The general readily agreed to help, though before they could make plans of any sort, President Raiko intervened and threatened to have Iroh court-martialed if a single ship left the harbor. After Raiko had left, Iroh apologized that he could do nothing, but suggested that Korra traveled to the Fire Nation and seek help there, stating that his mother and grandfather would be happy to aid the Avatar. Korra thanked him and the two parted ways in good standing."
    },
    {
      "body": "${link_0} aided ${link_1} to cross over to the ${link_2} for the first time.",
      "links": [
        {
          "body": "Jinora",
          "key": "${link_0}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Jinora aided Korra to cross over to the Spirit World for the first time."
    },
    {
      "body": "Jinora later took on the role of Korra's spiritual mentor, though her young age sparked a protective streak in Korra once in the Spirit World and the Avatar became worried about her safety upon being separated from her. When Korra realized that Unalaq had taken Jinora captive, she was quick to abandon her goal of closing the Southern spirit portal and comply with Unalaq's wish to open the Northern one instead in order to save Jinora's soul, despite the girl's urge to prevent Vaatu from escaping. When she was forced to leave the Spirit World without Jinora when her uncle did not release her, Korra was distraught over having to tell Tenzin and Pema what happened to their daughter and apologized sincerely over her inability to protect her.",
      "links": [],
      "text": "Jinora later took on the role of Korra's spiritual mentor, though her young age sparked a protective streak in Korra once in the Spirit World and the Avatar became worried about her safety upon being separated from her. When Korra realized that Unalaq had taken Jinora captive, she was quick to abandon her goal of closing the Southern spirit portal and comply with Unalaq's wish to open the Northern one instead in order to save Jinora's soul, despite the girl's urge to prevent Vaatu from escaping. When she was forced to leave the Spirit World without Jinora when her uncle did not release her, Korra was distraught over having to tell Tenzin and Pema what happened to their daughter and apologized sincerely over her inability to protect her."
    },
    {
      "body": "${link_0} warmly embraced ${link_1} after the latter allowed him to join the group.",
      "links": [
        {
          "body": "Kai",
          "key": "${link_0}",
          "target": {
            "href": "Kai",
            "page": "Kai"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Kai warmly embraced Korra after the latter allowed him to join the group."
    },
    {
      "body": "Being the first airbender to show interest joining Team Avatar to rebuild the Air Nation, Korra happily accepted ${link_0} into the group. Under the impression that the young airbender was being chased by outlaws, she readily defended him against the five men pursuing him. After the truth was revealed that it was Kai who was the outlaw and the five men to be police officers, Korra still did not give up on Kai, stating that he only needed guidance to change and convinced Tenzin and the policemen to release the young airbender into their custody. While being thanked by Kai with a warm hug, she did, however, lightly warn him to not make her regret her decision.",
      "links": [
        {
          "body": "Kai",
          "key": "${link_0}",
          "target": {
            "href": "Kai",
            "page": "Kai"
          }
        }
      ],
      "text": "Being the first airbender to show interest joining Team Avatar to rebuild the Air Nation, Korra happily accepted Kai into the group. Under the impression that the young airbender was being chased by outlaws, she readily defended him against the five men pursuing him. After the truth was revealed that it was Kai who was the outlaw and the five men to be police officers, Korra still did not give up on Kai, stating that he only needed guidance to change and convinced Tenzin and the policemen to release the young airbender into their custody. While being thanked by Kai with a warm hug, she did, however, lightly warn him to not make her regret her decision."
    },
    {
      "body": "${link_0} trusted ${link_1} and turned to her for help and guidance.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Korra trusted Katara and turned to her for help and guidance."
    },
    {
      "body": "As her waterbending teacher, Katara has known Korra since she was little. Korra learned presumably everything Katara knew about the art, save for bloodbending, and she stated that Katara is the \"best waterbending teacher\". Katara knew that Korra had to find her way as the Avatar and let her escape to Republic City. Katara even said that Korra reminded her of herself as a young girl.",
      "links": [],
      "text": "As her waterbending teacher, Katara has known Korra since she was little. Korra learned presumably everything Katara knew about the art, save for bloodbending, and she stated that Katara is the \"best waterbending teacher\". Katara knew that Korra had to find her way as the Avatar and let her escape to Republic City. Katara even said that Korra reminded her of herself as a young girl."
    },
    {
      "body": "Five weeks after her battle with Zaheer, Korra sought out Katara's help to recover physically and mentally. Although Katara was able to get through to her, progress was slow and Korra eventually grew frustrated with the old healer as well. However, Katara did not mind and shared the memory about Aang's suffering in regards to the loss of his entire culture with the young Avatar. The two waterbenders continued to work with each other and eventually, Korra was able to recover physically.",
      "links": [],
      "text": "Five weeks after her battle with Zaheer, Korra sought out Katara's help to recover physically and mentally. Although Katara was able to get through to her, progress was slow and Korra eventually grew frustrated with the old healer as well. However, Katara did not mind and shared the memory about Aang's suffering in regards to the loss of his entire culture with the young Avatar. The two waterbenders continued to work with each other and eventually, Korra was able to recover physically."
    },
    {
      "body": "${link_0} and ${link_1} worked together to fight the ${link_2} after ${link_3}'s ${link_4}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_1}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_2}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Amon",
          "key": "${link_3}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "attack on the Pro-bending Arena",
          "key": "${link_4}",
          "target": {
            "href": "Attack_on_the_Pro-bending_Arena",
            "page": "Attack_on_the_Pro-bending_Arena"
          }
        }
      ],
      "text": "Korra and Lin Beifong worked together to fight the Equalists after Amon's attack on the Pro-bending Arena."
    },
    {
      "body": "Lin Beifong, the daughter of ${link_0} and chief of the Metalbending Police Force, initially despised Korra, viewing her as a threat to the ${link_1} she had worked hard to establish. She refused to give the Avatar any special treatment for her position, despite the friendship shared between Korra's past incarnation and Lin's mother. This was most expressed at the gala that Tarrlok held in honor of Korra, where she snapped that she had done nothing to deserve such praise.",
      "links": [
        {
          "body": "Toph Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "law and order",
          "key": "${link_1}",
          "target": {
            "href": "Law_and_order_in_the_World_of_Avatar",
            "page": "Law_and_order_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Lin Beifong, the daughter of Toph Beifong and chief of the Metalbending Police Force, initially despised Korra, viewing her as a threat to the law and order she had worked hard to establish. She refused to give the Avatar any special treatment for her position, despite the friendship shared between Korra's past incarnation and Lin's mother. This was most expressed at the gala that Tarrlok held in honor of Korra, where she snapped that she had done nothing to deserve such praise."
    },
    {
      "body": "Their relationship took a better turn when Lin agreed with Korra that shutting down the Pro-bending Arena would mean caving to Amon, which convinced Tarrlok and the rest of the council to keep it open. After the Equalists attacked the arena and attempted to flee, Korra came after them, but fell from her waterbending lift. Lin quickly jumped into action and saved her by using her metal cables, and allowed her to reach the arena's roof to fight the Equalists. Together, they tried to defeat as many as they could and reach Amon, but most of them escaped.",
      "links": [],
      "text": "Their relationship took a better turn when Lin agreed with Korra that shutting down the Pro-bending Arena would mean caving to Amon, which convinced Tarrlok and the rest of the council to keep it open. After the Equalists attacked the arena and attempted to flee, Korra came after them, but fell from her waterbending lift. Lin quickly jumped into action and saved her by using her metal cables, and allowed her to reach the arena's roof to fight the Equalists. Together, they tried to defeat as many as they could and reach Amon, but most of them escaped."
    },
    {
      "body": "After the fight, Korra fell again from the roof, and Lin allowed Amon to get away in favor of using her cables to save Korra once more. The chief brought Korra to the concourse of the arena, allowing the Avatar to reunite with her teammates. Korra expressed her thanks to Lin for saving her life.",
      "links": [],
      "text": "After the fight, Korra fell again from the roof, and Lin allowed Amon to get away in favor of using her cables to save Korra once more. The chief brought Korra to the concourse of the arena, allowing the Avatar to reunite with her teammates. Korra expressed her thanks to Lin for saving her life."
    },
    {
      "body": "Lin showed a lot compassion toward the Avatar when Katara said that she could not restore Korra's bending. Lin stated that Katara was the best healer in the world and needed to keep trying. Later on, after Korra encountered Avatar Aang and was able to successfully restore Lin's bending, her face lightened and she smiled slightly. She looked her in the eye and sincerely thanked her.",
      "links": [],
      "text": "Lin showed a lot compassion toward the Avatar when Katara said that she could not restore Korra's bending. Lin stated that Katara was the best healer in the world and needed to keep trying. Later on, after Korra encountered Avatar Aang and was able to successfully restore Lin's bending, her face lightened and she smiled slightly. She looked her in the eye and sincerely thanked her."
    },
    {
      "body": "${link_0} bent down to return the embrace ${link_1} gave her.",
      "links": [
        {
          "body": "Naga",
          "key": "${link_0}",
          "target": {
            "href": "Naga",
            "page": "Naga"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Naga bent down to return the embrace Korra gave her."
    },
    {
      "body": "${link_0} is Korra's ${link_1} and animal companion, giving the two a deep, spiritual connection. Korra regards Naga as her \"best friend\", and takes her almost everywhere she goes. As such, Korra is typically alongside her polar bear dog, whether the two are riding throughout ${link_2} or simply lounging together.",
      "links": [
        {
          "body": "Naga",
          "key": "${link_0}",
          "target": {
            "href": "Naga",
            "page": "Naga"
          }
        },
        {
          "body": "polar bear dog",
          "key": "${link_1}",
          "target": {
            "href": "Polar_bear_dog",
            "page": "Polar_bear_dog"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "text": "Naga is Korra's polar bear dog and animal companion, giving the two a deep, spiritual connection. Korra regards Naga as her \"best friend\", and takes her almost everywhere she goes. As such, Korra is typically alongside her polar bear dog, whether the two are riding throughout Republic City or simply lounging together."
    },
    {
      "body": "Naga is undyingly loyal and protective of Korra, obeying her every command, even to the extent where she was willing to wait in the same spot until Korra returned from confronting Tarrlok. Naga also tracked her owner down after she did not return, finding her unconscious against a tree. She awakened Korra with a lick and the two returned to Republic City. Upon entering the city, Naga howled, which allowed Team Avatar, Lin, and Tenzin to find them. In return, Korra treats Naga with the respect of a comrade and companion rather than merely a pet.",
      "links": [],
      "text": "Naga is undyingly loyal and protective of Korra, obeying her every command, even to the extent where she was willing to wait in the same spot until Korra returned from confronting Tarrlok. Naga also tracked her owner down after she did not return, finding her unconscious against a tree. She awakened Korra with a lick and the two returned to Republic City. Upon entering the city, Naga howled, which allowed Team Avatar, Lin, and Tenzin to find them. In return, Korra treats Naga with the respect of a comrade and companion rather than merely a pet."
    },
    {
      "body": "Opal was the first airbender Korra trained. The two got along immediately during a basic training session, with the two sharing compliments along the way. When Korra sensed tension between Lin and Opal's mother, Suyin, she asked Opal to talk to Lin to see if it would help.",
      "links": [],
      "text": "Opal was the first airbender Korra trained. The two got along immediately during a basic training session, with the two sharing compliments along the way. When Korra sensed tension between Lin and Opal's mother, Suyin, she asked Opal to talk to Lin to see if it would help."
    },
    {
      "body": "${link_0} comforted ${link_1} in her depressed state about not being able to ${link_2}.",
      "links": [
        {
          "body": "Pabu",
          "key": "${link_0}",
          "target": {
            "href": "Pabu",
            "page": "Pabu"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "airbend",
          "key": "${link_2}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Pabu comforted Korra in her depressed state about not being able to airbend."
    },
    {
      "body": "Pabu is Bolin's pet ${link_0}. He showed deep loyalty to Team Avatar when they were tied to one of the support beams of the Pro-bending Arena by the Lieutenant, Pabu swam to them and chewed away the ropes to free them. When Korra was feeling despair at not having mastered airbending, Pabu found her crying, crawled onto her lap, and started licking the tears off her face in an attempt to lift her spirits.",
      "links": [
        {
          "body": "fire ferret",
          "key": "${link_0}",
          "target": {
            "href": "Fire_ferret",
            "page": "Fire_ferret"
          }
        }
      ],
      "text": "Pabu is Bolin's pet fire ferret. He showed deep loyalty to Team Avatar when they were tied to one of the support beams of the Pro-bending Arena by the Lieutenant, Pabu swam to them and chewed away the ropes to free them. When Korra was feeling despair at not having mastered airbending, Pabu found her crying, crawled onto her lap, and started licking the tears off her face in an attempt to lift her spirits."
    },
    {
      "body": "${link_0} provided ${link_1} with helpful advice about relationships.",
      "links": [
        {
          "body": "Pema",
          "key": "${link_0}",
          "target": {
            "href": "Pema",
            "page": "Pema"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Pema provided Korra with helpful advice about relationships."
    },
    {
      "body": "When Korra was distraught by her romantic feelings for Mako, Pema advised her to tell Mako how she truly feels. Pema explained how she was in a similar situation years earlier with Tenzin, who was dating Lin Beifong at the time. She said that despite her fear of rejection, she confessed her feelings to Tenzin, prompting Korra to do the same with Mako.",
      "links": [],
      "text": "When Korra was distraught by her romantic feelings for Mako, Pema advised her to tell Mako how she truly feels. Pema explained how she was in a similar situation years earlier with Tenzin, who was dating Lin Beifong at the time. She said that despite her fear of rejection, she confessed her feelings to Tenzin, prompting Korra to do the same with Mako."
    },
    {
      "body": "Later, after Korra was kidnapped, Pema helped nurse her and made sure she was well-fed when she woke up again.",
      "links": [],
      "text": "Later, after Korra was kidnapped, Pema helped nurse her and made sure she was well-fed when she woke up again."
    },
    {
      "body": "${link_0} gave ${link_1} a hug before leaving ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Suyin",
          "key": "${link_1}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "Zaofu",
          "key": "${link_2}",
          "target": {
            "href": "Zaofu",
            "page": "Zaofu"
          }
        }
      ],
      "text": "Korra gave Suyin a hug before leaving Zaofu."
    },
    {
      "body": "Korra first met Suyin Beifong when she traveled to ${link_0}, home of the Metal Clan, to recruit a new airbender. Korra was pleased to meet her, and shocked upon learning that Suyin was Lin's estranged half-sister. After meeting all her children, including the new airbender named Opal, Korra agreed to stay in Zaofu, wondering why Lin could be mad at her half-sister since Suyin was so \"nice\". During dinner, Korra and the matriarch discussed Korra's search of airbenders and Hou-Ting's rule, with Suyin providing advice to starting paying attention to political affairs. After dinner, Suyin explained how she ran away and built Zaofu from scratch, impressing the Avatar, who stated that it was amazing.",
      "links": [
        {
          "body": "Zaofu",
          "key": "${link_0}",
          "target": {
            "href": "Zaofu",
            "page": "Zaofu"
          }
        }
      ],
      "text": "Korra first met Suyin Beifong when she traveled to Zaofu, home of the Metal Clan, to recruit a new airbender. Korra was pleased to meet her, and shocked upon learning that Suyin was Lin's estranged half-sister. After meeting all her children, including the new airbender named Opal, Korra agreed to stay in Zaofu, wondering why Lin could be mad at her half-sister since Suyin was so \"nice\". During dinner, Korra and the matriarch discussed Korra's search of airbenders and Hou-Ting's rule, with Suyin providing advice to starting paying attention to political affairs. After dinner, Suyin explained how she ran away and built Zaofu from scratch, impressing the Avatar, who stated that it was amazing."
    },
    {
      "body": "The next day, Suyin began training Korra in the art of metalbending. advising the Avatar when latter experienced difficulties. Taking Suyin's advice, Korra was able to find the fine pieces of earth within the metal, and effectively metalbend, prompting Suyin to congratulate her and proclaim her as \"the first metalbending Avatar\".",
      "links": [],
      "text": "The next day, Suyin began training Korra in the art of metalbending. advising the Avatar when latter experienced difficulties. Taking Suyin's advice, Korra was able to find the fine pieces of earth within the metal, and effectively metalbend, prompting Suyin to congratulate her and proclaim her as \"the first metalbending Avatar\"."
    },
    {
      "body": "During the ${link_0}, Suyin devised a plan with Lin to rescue Korra from the clutches of the ${link_1}. Upon discovery that ${link_2} was the mole who aided Zaheer and his gang in infiltrating the city, Suyin went against Lin's orders and provided Team Avatar with the resources to track down Aiwei and bring him back, earning a warm hug and thanks from the Avatar.",
      "links": [
        {
          "body": "attempted kidnapping of Korra",
          "key": "${link_0}",
          "target": {
            "href": "Attempted_kidnapping_of_Avatar_Korra",
            "page": "Attempted_kidnapping_of_Avatar_Korra"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_1}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "Aiwei",
          "key": "${link_2}",
          "target": {
            "href": "Aiwei",
            "page": "Aiwei"
          }
        }
      ],
      "text": "During the attempted kidnapping of Korra, Suyin devised a plan with Lin to rescue Korra from the clutches of the Red Lotus. Upon discovery that Aiwei was the mole who aided Zaheer and his gang in infiltrating the city, Suyin went against Lin's orders and provided Team Avatar with the resources to track down Aiwei and bring him back, earning a warm hug and thanks from the Avatar."
    },
    {
      "body": "${link_0} asserted her position as the ${link_1} in response to ${link_2}'s attempt to convince her to rejoin his ${link_3}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_2}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "task force",
          "key": "${link_3}",
          "target": {
            "href": "Tarrlok%27s_task_force",
            "page": "Tarrlok%27s_task_force"
          }
        }
      ],
      "text": "Korra asserted her position as the Avatar in response to Tarrlok's attempt to convince her to rejoin his task force."
    },
    {
      "body": "Korra and Tarrlok worked together on a number of Equalist raids along with ${link_0}. After encountering Amon on Aang Memorial Island, however, Korra decided to leave the task force.",
      "links": [
        {
          "body": "his task force",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok%27s_task_force",
            "page": "Tarrlok%27s_task_force"
          }
        }
      ],
      "text": "Korra and Tarrlok worked together on a number of Equalist raids along with his task force. After encountering Amon on Aang Memorial Island, however, Korra decided to leave the task force."
    },
    {
      "body": "After refusing to rejoin Tarrlok's task force, the councilman began harboring negative feelings toward Korra. After Korra, Mako, Bolin, Asami, and Pabu captured a number of escaped Equalists, Tarrlok confronted the Avatar, telling her to stay out of his way and to let the police handle things. Later, Team Avatar confronted Tarrlok as he was trying to arrest a large number of harmless nonbenders. The entire team was arrested, except for Korra. Later that night Korra sneaked off Air Temple Island with Naga and headed toward City Hall. Once she arrived, she broke into Tarrlok's office via a window and confronted him. After a brief conversation, Tarrlok launched an attack on Korra, thus prompting her to fight back. The confrontation resulted in the destruction of Tarrlok's office, as well as other parts of City Hall. Right as Korra was about to deliver a strong firebending attack, Tarrlok began to bloodbend the Avatar into submission. Korra was shocked at the fact that Tarrlok could bloodbend without the aid of the full moon, to which Tarrlok replied, \"There's a lot you don't know about me.\" Tarrlok proceeded to lift Korra into the air via bloodbending and slam her against one of City Hall's interior pillars. As she began to wake up, she found that she was tied up in the back of a truck, with Tarrlok standing at the door. Tarrlok told Korra that he was taking her somewhere far away, and that she would never see Republic City again.",
      "links": [],
      "text": "After refusing to rejoin Tarrlok's task force, the councilman began harboring negative feelings toward Korra. After Korra, Mako, Bolin, Asami, and Pabu captured a number of escaped Equalists, Tarrlok confronted the Avatar, telling her to stay out of his way and to let the police handle things. Later, Team Avatar confronted Tarrlok as he was trying to arrest a large number of harmless nonbenders. The entire team was arrested, except for Korra. Later that night Korra sneaked off Air Temple Island with Naga and headed toward City Hall. Once she arrived, she broke into Tarrlok's office via a window and confronted him. After a brief conversation, Tarrlok launched an attack on Korra, thus prompting her to fight back. The confrontation resulted in the destruction of Tarrlok's office, as well as other parts of City Hall. Right as Korra was about to deliver a strong firebending attack, Tarrlok began to bloodbend the Avatar into submission. Korra was shocked at the fact that Tarrlok could bloodbend without the aid of the full moon, to which Tarrlok replied, \"There's a lot you don't know about me.\" Tarrlok proceeded to lift Korra into the air via bloodbending and slam her against one of City Hall's interior pillars. As she began to wake up, she found that she was tied up in the back of a truck, with Tarrlok standing at the door. Tarrlok told Korra that he was taking her somewhere far away, and that she would never see Republic City again."
    },
    {
      "body": "Tarrlok proceeded to take her to a cabin, situated high in the mountains on the outskirts of Republic City, and locked her in a box in the basement. After being frustrated about this, Korra meditated until Tarrlok returned, and he informed her that everyone now knew he was a bloodbender. He said that he would start over, but take Korra with him as a hostage. Before he could, however, Amon showed up and took Tarrlok's bending away, allowing Korra to escape.",
      "links": [],
      "text": "Tarrlok proceeded to take her to a cabin, situated high in the mountains on the outskirts of Republic City, and locked her in a box in the basement. After being frustrated about this, Korra meditated until Tarrlok returned, and he informed her that everyone now knew he was a bloodbender. He said that he would start over, but take Korra with him as a hostage. Before he could, however, Amon showed up and took Tarrlok's bending away, allowing Korra to escape."
    },
    {
      "body": "While in prison, ${link_0} explained his childhood to ${link_1} and ${link_2}.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_2}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "While in prison, Tarrlok explained his childhood to Korra and Mako."
    },
    {
      "body": "After deciding to destroy Amon in an ambush, Korra and Mako went to Air Temple Island to wait for his return. However, after going into an attic to hide, the duo found Tarrlok locked in a cage. Tarrlok immediately apologized for his actions toward Korra and the rest of Team Avatar, and revealed to the two that Amon was his brother. After the shock wore off, Tarrlok proceeded to tell the two about the fateful story of the relationship between himself and Amon, who was originally named Noatak, and their father, former crime boss, Yakone. The story provided Korra and Mako with critical information needed to expose Amon as a bender. Tarrlok told the two not to tell anyone where they got the information. In the end, Tarrlok was a valuable ally in the destruction of the Anti-bending Revolution.",
      "links": [],
      "text": "After deciding to destroy Amon in an ambush, Korra and Mako went to Air Temple Island to wait for his return. However, after going into an attic to hide, the duo found Tarrlok locked in a cage. Tarrlok immediately apologized for his actions toward Korra and the rest of Team Avatar, and revealed to the two that Amon was his brother. After the shock wore off, Tarrlok proceeded to tell the two about the fateful story of the relationship between himself and Amon, who was originally named Noatak, and their father, former crime boss, Yakone. The story provided Korra and Mako with critical information needed to expose Amon as a bender. Tarrlok told the two not to tell anyone where they got the information. In the end, Tarrlok was a valuable ally in the destruction of the Anti-bending Revolution."
    },
    {
      "body": "${link_0} embraced ${link_1} as she admitted her fear of ${link_2} to him.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_1}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Amon",
          "key": "${link_2}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        }
      ],
      "text": "Korra embraced Tenzin as she admitted her fear of Amon to him."
    },
    {
      "body": "Although their relationship as student and teacher started out poorly, Korra truly believes that Tenzin is an amazing airbender and a great teacher. His teachings have helped Korra through her struggles and have taught her valuable lessons, such as how to dodge attacks in the pro-bending ring. Tenzin reassured her that she could tell him anything, to which Korra admitted her fears of Amon, crying in his arms while he comforted her after her frightening encounter with the Equalists' leader. In this way, he played the part of a father figure for Korra. After learning that she had lost her bending, Tenzin was quick to comfort and support her through reassuring comments such as: \"You saved Republic City\", to which Korra placed her hand on his.",
      "links": [],
      "text": "Although their relationship as student and teacher started out poorly, Korra truly believes that Tenzin is an amazing airbender and a great teacher. His teachings have helped Korra through her struggles and have taught her valuable lessons, such as how to dodge attacks in the pro-bending ring. Tenzin reassured her that she could tell him anything, to which Korra admitted her fears of Amon, crying in his arms while he comforted her after her frightening encounter with the Equalists' leader. In this way, he played the part of a father figure for Korra. After learning that she had lost her bending, Tenzin was quick to comfort and support her through reassuring comments such as: \"You saved Republic City\", to which Korra placed her hand on his."
    },
    {
      "body": "Six months later, their relationship took a turn for the worse, with Korra growing bored with airbending practice, believing to have mastered it, despite Tenzin's opinion that she still needed to master real airbending instead of Korra-style airbending. Upon learning that Tenzin was partially responsible for her seclusion growing up, they reached a breaking point, Korra deciding to take up Unalaq's offer to be her teacher, feeling she and Tenzin had gone as far as they could together.",
      "links": [],
      "text": "Six months later, their relationship took a turn for the worse, with Korra growing bored with airbending practice, believing to have mastered it, despite Tenzin's opinion that she still needed to master real airbending instead of Korra-style airbending. Upon learning that Tenzin was partially responsible for her seclusion growing up, they reached a breaking point, Korra deciding to take up Unalaq's offer to be her teacher, feeling she and Tenzin had gone as far as they could together."
    },
    {
      "body": "${link_0} and ${link_1} reconciled due to the harsh nature of their earlier departure from one another.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_1}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        }
      ],
      "text": "Korra and Tenzin reconciled due to the harsh nature of their earlier departure from one another."
    },
    {
      "body": "Weeks later, Korra met Tenzin and his family at the ${link_0}, and although their departure had not been in the best circumstances, she was warmly received by the family. After she informed them about recent developments of the Water Tribe Civil War, of which they knew nothing about, Tenzin readily accepted Korra's call for help to enter the Spirit World. After a dark spirit attack, Tenzin regretted not being able to aid her spiritually, noting Unalaq's teachings had actually gotten her somewhere since she was able to purify the dark spirits. However, Korra quickly assured him that Unalaq taught her to help himself, while he had taught her to help her. She apologized to Tenzin for her earlier treatment of him, acknowledging that she should have never turned her back on him as her mentor and admitting that she needed him more than ever. Having reconciled their differences, the two shared a hug.",
      "links": [
        {
          "body": "Eastern Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        }
      ],
      "text": "Weeks later, Korra met Tenzin and his family at the Eastern Air Temple, and although their departure had not been in the best circumstances, she was warmly received by the family. After she informed them about recent developments of the Water Tribe Civil War, of which they knew nothing about, Tenzin readily accepted Korra's call for help to enter the Spirit World. After a dark spirit attack, Tenzin regretted not being able to aid her spiritually, noting Unalaq's teachings had actually gotten her somewhere since she was able to purify the dark spirits. However, Korra quickly assured him that Unalaq taught her to help himself, while he had taught her to help her. She apologized to Tenzin for her earlier treatment of him, acknowledging that she should have never turned her back on him as her mentor and admitting that she needed him more than ever. Having reconciled their differences, the two shared a hug."
    },
    {
      "body": "During ${link_0}, Tenzin found an unconscious Korra. He was shocked upon learning that Unalaq had severed Korra's connection with Raava and all her past lives, yet he still attempted to console the depressed Korra, giving her the knowledge of connecting with the cosmic energies of the universe to defeat Vaatu. When Korra's spirit returned to her body and the Avatar Cycle was renewed, Tenzin praised her, stating that \"[she was] amazing\".",
      "links": [
        {
          "body": "Harmonic Convergence",
          "key": "${link_0}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        }
      ],
      "text": "During Harmonic Convergence, Tenzin found an unconscious Korra. He was shocked upon learning that Unalaq had severed Korra's connection with Raava and all her past lives, yet he still attempted to console the depressed Korra, giving her the knowledge of connecting with the cosmic energies of the universe to defeat Vaatu. When Korra's spirit returned to her body and the Avatar Cycle was renewed, Tenzin praised her, stating that \"[she was] amazing\"."
    },
    {
      "body": "Weeks later, Tenzin excitedly joined Korra on her mission to rebuild the ${link_0}. After learning that ${link_1}, the ${link_2}, was abducting airbenders and conscripting them into a secret army, Tenzin helped Korra bust them out. The two, along with the rest of Team Avatar, were successful in doing so and escaped Ba Sing Se with the new airbenders. Tenzin assured her that she had done well before the two embraced and parted ways, with Korra continuing her search of airbenders and Tenzin headed to the ${link_3} to begin training. Later, Tenzin and Korra communicated with each other via the radio. Korra gave Tenzin advice on how to inspire the unmotivated airbenders, which impressed the master and prompted him to compliment her as a wise Avatar.",
      "links": [
        {
          "body": "Air Nomads",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_1}",
          "target": {
            "href": "Hou-Ting",
            "page": "Hou-Ting"
          }
        },
        {
          "body": "Earth Queen",
          "key": "${link_2}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Northern Air Temple",
          "key": "${link_3}",
          "target": {
            "href": "Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        }
      ],
      "text": "Weeks later, Tenzin excitedly joined Korra on her mission to rebuild the Air Nomads. After learning that Hou-Ting, the Earth Queen, was abducting airbenders and conscripting them into a secret army, Tenzin helped Korra bust them out. The two, along with the rest of Team Avatar, were successful in doing so and escaped Ba Sing Se with the new airbenders. Tenzin assured her that she had done well before the two embraced and parted ways, with Korra continuing her search of airbenders and Tenzin headed to the Northern Air Temple to begin training. Later, Tenzin and Korra communicated with each other via the radio. Korra gave Tenzin advice on how to inspire the unmotivated airbenders, which impressed the master and prompted him to compliment her as a wise Avatar."
    },
    {
      "body": "${link_0} warmly hugged ${link_1}, ${link_2}, and ${link_3} upon reuniting with them after three years of absence.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_1}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Ikki",
          "key": "${link_2}",
          "target": {
            "href": "Ikki",
            "page": "Ikki"
          }
        },
        {
          "body": "Meelo",
          "key": "${link_3}",
          "target": {
            "href": "Meelo",
            "page": "Meelo"
          }
        }
      ],
      "text": "Korra warmly hugged Jinora, Ikki, and Meelo upon reuniting with them after three years of absence."
    },
    {
      "body": "${link_0}, ${link_1}, and ${link_2} were generally friendly toward Korra. They appeared genuinely happy when she decided to stay with them. Later, they sincerely tried to provide good information to Korra when she was attempting to weave her way through the airbender gates. Ikki and Jinora were also some of the first people Korra talked to about her crush on Mako, and they both tried to provide their best advice for her situation.",
      "links": [
        {
          "body": "Ikki",
          "key": "${link_0}",
          "target": {
            "href": "Ikki",
            "page": "Ikki"
          }
        },
        {
          "body": "Meelo",
          "key": "${link_1}",
          "target": {
            "href": "Meelo",
            "page": "Meelo"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_2}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        }
      ],
      "text": "Ikki, Meelo, and Jinora were generally friendly toward Korra. They appeared genuinely happy when she decided to stay with them. Later, they sincerely tried to provide good information to Korra when she was attempting to weave her way through the airbender gates. Ikki and Jinora were also some of the first people Korra talked to about her crush on Mako, and they both tried to provide their best advice for her situation."
    },
    {
      "body": "After Korra traveled the world by herself in order to make a full recovery from her mercury poisoning, she was emotionally touched when Jinora, Ikki, and Meelo scoured the Earth Kingdom to find her. Upon reuniting, the foursome warmly hugged, declaring how much they had missed each other. As they later traveled to Zaofu together, Korra was especially concerned to keep Ikki and Meelo safe, as she dared not expose them to possible imprisonment at the hands of ${link_0}.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        }
      ],
      "text": "After Korra traveled the world by herself in order to make a full recovery from her mercury poisoning, she was emotionally touched when Jinora, Ikki, and Meelo scoured the Earth Kingdom to find her. Upon reuniting, the foursome warmly hugged, declaring how much they had missed each other. As they later traveled to Zaofu together, Korra was especially concerned to keep Ikki and Meelo safe, as she dared not expose them to possible imprisonment at the hands of Kuvira."
    },
    {
      "body": "${link_0} hugged ${link_1} in gratitude for helping get the residual traces of ${link_2} out of her body.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "mercury",
          "key": "${link_2}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        }
      ],
      "text": "Korra hugged Toph in gratitude for helping get the residual traces of mercury out of her body."
    },
    {
      "body": "While knowing of her and having history together in her past life as Aang, Korra did not personally meet Toph until 174 AG. After losing her ability to enter the Avatar State, Korra was guided to the ${link_0} by a spirit, where she found an elderly Toph living in solitude. Much like her attitude toward Aang, Toph had a tendency of belittling Korra, even calling her pathetic for losing all the time. In turn, Korra considered her a \"crankier and more miserable version of Lin\". Despite her attitude, Toph agreed to help train Korra, in which she thoroughly enjoyed smacking her the Avatar around, showing no sensitivity in her methods and flat-out pointing out her mistakes in combat. Ultimately, Toph became instrumental to Korra's recovery, as she showed the Avatar how to reconnect with her surroundings and herself as well as reveal the fact that there were still residual traces of ${link_1} in her body, which were the cause of her mental block. Toph aided Korra to let go of her fears accumulated in past battles and remove the remaining traces of poison in her body, allowing her to regain access to the Avatar State. Proud of Korra's self-accomplishments, Toph even allowed the Avatar to hug her, noting that she had earned that, which the elderly master returned with a pat on the back.",
      "links": [
        {
          "body": "Foggy Swamp",
          "key": "${link_0}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "mercury",
          "key": "${link_1}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        }
      ],
      "text": "While knowing of her and having history together in her past life as Aang, Korra did not personally meet Toph until 174 AG. After losing her ability to enter the Avatar State, Korra was guided to the Foggy Swamp by a spirit, where she found an elderly Toph living in solitude. Much like her attitude toward Aang, Toph had a tendency of belittling Korra, even calling her pathetic for losing all the time. In turn, Korra considered her a \"crankier and more miserable version of Lin\". Despite her attitude, Toph agreed to help train Korra, in which she thoroughly enjoyed smacking her the Avatar around, showing no sensitivity in her methods and flat-out pointing out her mistakes in combat. Ultimately, Toph became instrumental to Korra's recovery, as she showed the Avatar how to reconnect with her surroundings and herself as well as reveal the fact that there were still residual traces of mercury in her body, which were the cause of her mental block. Toph aided Korra to let go of her fears accumulated in past battles and remove the remaining traces of poison in her body, allowing her to regain access to the Avatar State. Proud of Korra's self-accomplishments, Toph even allowed the Avatar to hug her, noting that she had earned that, which the elderly master returned with a pat on the back."
    },
    {
      "body": "Although ${link_0} had betrayed ${link_1}'s ${link_2}, she still respected him and would often listen to his ideas.",
      "links": [
        {
          "body": "Varrick",
          "key": "${link_0}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "friends",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "text": "Although Varrick had betrayed Korra's friends, she still respected him and would often listen to his ideas."
    },
    {
      "body": "Korra first met Varrick when the two attended a meeting at Korra's parents' house to discuss the Northerners' presence in the Southern Water Tribe. She was appalled by Varrick's suggestion that the two tribes engage in civil war, calling the businessman crazy, though agreed nonetheless to meet with Unalaq to discuss the Southerners' frustration. Upon learning of Unalaq's treachery, Varrick lent ${link_0} to Korra, who utilized a ${link_1} stowed away in the vessel to rescue the rebels and escape to safety. When they were back in Republic City, he continued to support her by offering her ideas on what she could do next, like going to the United Forces troops directly after President Raiko refused to lend his support.",
      "links": [
        {
          "body": "his yacht",
          "key": "${link_0}",
          "target": {
            "href": "Varrick%27s_yacht",
            "page": "Varrick%27s_yacht"
          }
        },
        {
          "body": "biplane",
          "key": "${link_1}",
          "target": {
            "href": "Biplane",
            "page": "Biplane"
          }
        }
      ],
      "text": "Korra first met Varrick when the two attended a meeting at Korra's parents' house to discuss the Northerners' presence in the Southern Water Tribe. She was appalled by Varrick's suggestion that the two tribes engage in civil war, calling the businessman crazy, though agreed nonetheless to meet with Unalaq to discuss the Southerners' frustration. Upon learning of Unalaq's treachery, Varrick lent his yacht to Korra, who utilized a biplane stowed away in the vessel to rescue the rebels and escape to safety. When they were back in Republic City, he continued to support her by offering her ideas on what she could do next, like going to the United Forces troops directly after President Raiko refused to lend his support."
    },
    {
      "body": "As Harmonic Convergence approached, Team Avatar visited Varrick in his extravagant cell needed advice on how to deal with Unalaq. Although angry with his actions, Korra did acknowledge that the businessman had warned him about Unalaq, and gladly accepted the Zhu Li, Varrick's personal battleship, as a peace offering from him. The two did not meet again until weeks later in Zaofu, where Korra was surprised to learn that Varrick was spearheading the new technology division. The businessman later helped Team Avatar find out who had helped Zaheer's gang infiltrate Zaofu and kidnap Korra.",
      "links": [],
      "text": "As Harmonic Convergence approached, Team Avatar visited Varrick in his extravagant cell needed advice on how to deal with Unalaq. Although angry with his actions, Korra did acknowledge that the businessman had warned him about Unalaq, and gladly accepted the Zhu Li, Varrick's personal battleship, as a peace offering from him. The two did not meet again until weeks later in Zaofu, where Korra was surprised to learn that Varrick was spearheading the new technology division. The businessman later helped Team Avatar find out who had helped Zaheer's gang infiltrate Zaofu and kidnap Korra."
    },
    {
      "body": "Zuko gave ${link_0} advice on how to act as the ${link_1}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Zuko gave Korra advice on how to act as the Avatar."
    },
    {
      "body": "After learning that Zaheer and his allies' true goals included assassinating all world leaders to ultimately bring forth anarchy, Korra turned to Zuko for advice. Since she could no longer contact Aang himself, she hoped that Zuko would be able to provide her with some insight on how the Air Nomad would have acted in her place. Happy to act as the Avatar's advisor again, Zuko noted that while Aang would do anything in his power to save the Air Nation, he also cared deeply for the rest of the world and knew better than anyone the importance of there being an Avatar, as the entire world needed to be able to look toward them for hope. After Korra succeeded in stopping the Red Lotus, albeit leaving her crippled from their poison, Zuko congratulated her for her success, yet also worried for her in her current state.",
      "links": [],
      "text": "After learning that Zaheer and his allies' true goals included assassinating all world leaders to ultimately bring forth anarchy, Korra turned to Zuko for advice. Since she could no longer contact Aang himself, she hoped that Zuko would be able to provide her with some insight on how the Air Nomad would have acted in her place. Happy to act as the Avatar's advisor again, Zuko noted that while Aang would do anything in his power to save the Air Nation, he also cared deeply for the rest of the world and knew better than anyone the importance of there being an Avatar, as the entire world needed to be able to look toward them for hope. After Korra succeeded in stopping the Red Lotus, albeit leaving her crippled from their poison, Zuko congratulated her for her success, yet also worried for her in her current state."
    },
    {
      "body": "${link_0} was reluctant to undertake action against ${link_1}, as she had much respect for the woman and understood where she was coming from.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_1}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        }
      ],
      "text": "Korra was reluctant to undertake action against Kuvira, as she had much respect for the woman and understood where she was coming from."
    },
    {
      "body": "Korra respected Kuvira, as she was the loyal captain of Suyin's guard who had saved Tonraq. Although she did not agree with Kuvira's declaration of establishing the Earth Empire, Korra understood where the metalbender came from, as Kuvira had been forced to make some tough decisions to stabilize the Earth Kingdom due to Korra's absence and she understood what it felt like to have people be angry due to a decision made. Korra's respect for and sense of debt at the address of the metalbender made her reluctant to take decisive action against the ${link_0} commander, favoring negotiations before physical action. Despite this, Korra could not let Kuvira forcefully annex Zaofu and agreed to a one-on-one battle with the metalbender. Although she managed to gain the upper hand in the Avatar State, she lost the fight when she hallucinated Kuvira to have her head in the Avatar State.",
      "links": [
        {
          "body": "army",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        }
      ],
      "text": "Korra respected Kuvira, as she was the loyal captain of Suyin's guard who had saved Tonraq. Although she did not agree with Kuvira's declaration of establishing the Earth Empire, Korra understood where the metalbender came from, as Kuvira had been forced to make some tough decisions to stabilize the Earth Kingdom due to Korra's absence and she understood what it felt like to have people be angry due to a decision made. Korra's respect for and sense of debt at the address of the metalbender made her reluctant to take decisive action against the army commander, favoring negotiations before physical action. Despite this, Korra could not let Kuvira forcefully annex Zaofu and agreed to a one-on-one battle with the metalbender. Although she managed to gain the upper hand in the Avatar State, she lost the fight when she hallucinated Kuvira to have her head in the Avatar State."
    },
    {
      "body": "In a final confrontation with Kuvira, the two master benders fought on par with each other, ultimately leading to a draw as the giant ${link_0} they battled in exploded. Despite this, Kuvira attempted to finish Korra with the spirit cannon, but it began firing out of control and turned on Kuvira. Much to her surprise, Korra risked her own life to save hers and blocked the blast with energybending; the excess energy culminated in the creation of a new spirit portal. Regaining consciousness in the Spirit World, Kuvira could not fathom why Korra would save her, so the Avatar explained that it was because she saw a lot of herself in the metalbender, stating that they were both fierce and determined to succeed, sometimes even without thinking things through. When the metalbender snapped that she had been merely trying to help her people in the absence of the Avatar, Korra understood that Kuvira had only been trying to create a place where she and her people would never have to feel vulnerable again and sympathized with the hardships that come from a life as an orphan. She explained that while she still had her parents, she knew how it felt to live in fear, disclosing that she would have done anything to feel in control again after she had been poisoned by Zaheer. Connecting with Kuvira like that allowed the metalbender to realize the error in her ways and voluntarily surrender herself.",
      "links": [
        {
          "body": "mecha suit",
          "key": "${link_0}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        }
      ],
      "text": "In a final confrontation with Kuvira, the two master benders fought on par with each other, ultimately leading to a draw as the giant mecha suit they battled in exploded. Despite this, Kuvira attempted to finish Korra with the spirit cannon, but it began firing out of control and turned on Kuvira. Much to her surprise, Korra risked her own life to save hers and blocked the blast with energybending; the excess energy culminated in the creation of a new spirit portal. Regaining consciousness in the Spirit World, Kuvira could not fathom why Korra would save her, so the Avatar explained that it was because she saw a lot of herself in the metalbender, stating that they were both fierce and determined to succeed, sometimes even without thinking things through. When the metalbender snapped that she had been merely trying to help her people in the absence of the Avatar, Korra understood that Kuvira had only been trying to create a place where she and her people would never have to feel vulnerable again and sympathized with the hardships that come from a life as an orphan. She explained that while she still had her parents, she knew how it felt to live in fear, disclosing that she would have done anything to feel in control again after she had been poisoned by Zaheer. Connecting with Kuvira like that allowed the metalbender to realize the error in her ways and voluntarily surrender herself."
    },
    {
      "body": "Tensions rose between ${link_0} and ${link_1} in the aftermath of the ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_1}",
          "target": {
            "href": "Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "Unalaq Crisis",
          "key": "${link_2}",
          "target": {
            "href": "Unalaq_Crisis",
            "page": "Unalaq_Crisis"
          }
        }
      ],
      "text": "Tensions rose between Korra and Raiko in the aftermath of the Unalaq Crisis."
    },
    {
      "body": "Korra first met President Raiko while attempting to gain support for the Southern Water Tribe in the brewing Water Tribe Civil War, but the president refused to provide military backing, angering Korra, accusing him of doing nothing while the tribe suffered from Unalaq's occupation. Later, while Korra was talking to General Iroh about moving ships to the South Pole to launch a sneak attack, Raiko showed up and warned her she was bordering on insurrection, prompting the Avatar to declare that she hated him.",
      "links": [],
      "text": "Korra first met President Raiko while attempting to gain support for the Southern Water Tribe in the brewing Water Tribe Civil War, but the president refused to provide military backing, angering Korra, accusing him of doing nothing while the tribe suffered from Unalaq's occupation. Later, while Korra was talking to General Iroh about moving ships to the South Pole to launch a sneak attack, Raiko showed up and warned her she was bordering on insurrection, prompting the Avatar to declare that she hated him."
    },
    {
      "body": "After the ${link_0}, Raiko blamed Korra for the spirit vines overrunning Republic City, saying she had put the city in a difficult position. Despite her reminding the president that she saved the city and its inhabitants from the Dark Avatar, the two remained on poor terms and when Raiko banished Korra because he believed she was creating daily crises, she left the city in frustration with him. However, despite their disagreements, Korra refused to be part of Zaheer's idea to overthrow all world leaders, including Raiko.",
      "links": [
        {
          "body": "Unalaq Crisis",
          "key": "${link_0}",
          "target": {
            "href": "Unalaq_Crisis",
            "page": "Unalaq_Crisis"
          }
        }
      ],
      "text": "After the Unalaq Crisis, Raiko blamed Korra for the spirit vines overrunning Republic City, saying she had put the city in a difficult position. Despite her reminding the president that she saved the city and its inhabitants from the Dark Avatar, the two remained on poor terms and when Raiko banished Korra because he believed she was creating daily crises, she left the city in frustration with him. However, despite their disagreements, Korra refused to be part of Zaheer's idea to overthrow all world leaders, including Raiko."
    },
    {
      "body": "Two weeks after her defeat of Zaheer, Raiko formally welcomed Korra back to Republic City, thanking her for stopping the Red Lotus and apologizing for the way their relationship had previously ended.",
      "links": [],
      "text": "Two weeks after her defeat of Zaheer, Raiko formally welcomed Korra back to Republic City, thanking her for stopping the Red Lotus and apologizing for the way their relationship had previously ended."
    },
    {
      "body": "${link_0} provoked ${link_1} in their first encounter.",
      "links": [
        {
          "body": "Tahno",
          "key": "${link_0}",
          "target": {
            "href": "Tahno",
            "page": "Tahno"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Tahno provoked Korra in their first encounter."
    },
    {
      "body": "Tahno first met Korra at ${link_0} while the Avatar was on a date with Bolin. Hostility immediately ensued between the two as Tahno and Korra made eye-contact with each other in the noodle restaurant, leading to Tahno approaching the pair with his clique to mock the Fire Ferrets and trash-talk with them. Their first hostile exchange set the tone for their follow encounters, as Tahno continued to provoke Korra, both on and off the pro-bending field, which irked her to the point where she used his photograph as target practice.",
      "links": [
        {
          "body": "Narook's Seaweed Noodlery",
          "key": "${link_0}",
          "target": {
            "href": "Narook%27s_Seaweed_Noodlery",
            "page": "Narook%27s_Seaweed_Noodlery"
          }
        }
      ],
      "text": "Tahno first met Korra at Narook's Seaweed Noodlery while the Avatar was on a date with Bolin. Hostility immediately ensued between the two as Tahno and Korra made eye-contact with each other in the noodle restaurant, leading to Tahno approaching the pair with his clique to mock the Fire Ferrets and trash-talk with them. Their first hostile exchange set the tone for their follow encounters, as Tahno continued to provoke Korra, both on and off the pro-bending field, which irked her to the point where she used his photograph as target practice."
    },
    {
      "body": "Despite their continuous animosity toward the other, Korra felt sorry for Tahno after Amon had taken his bending away, and she readily agreed to get Amon back on his behalf.",
      "links": [],
      "text": "Despite their continuous animosity toward the other, Korra felt sorry for Tahno after Amon had taken his bending away, and she readily agreed to get Amon back on his behalf."
    },
    {
      "body": "${link_0} first encountered ${link_1} on ${link_2}.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Aang Memorial Island",
          "key": "${link_2}",
          "target": {
            "href": "Aang_Memorial_Island",
            "page": "Aang_Memorial_Island"
          }
        }
      ],
      "text": "Amon first encountered Korra on Aang Memorial Island."
    },
    {
      "body": "Korra first met Amon in person at an Equalist rally while trying to rescue Bolin. She and Mako sneaked into the building disguised as a couple and witnessed Amon giving his speech about the Equalist movement. Korra was both frightened and infuriated by Amon's words and display of power. After she and Mako rescued Bolin, she briefly attacked the ${link_0} outside and escaped. The ${link_1} were about ready to follow, but Amon stopped them, saying that she was the perfect messenger to tell the city of his power.",
      "links": [
        {
          "body": "Lieutenant",
          "key": "${link_0}",
          "target": {
            "href": "Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "chi blockers",
          "key": "${link_1}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        }
      ],
      "text": "Korra first met Amon in person at an Equalist rally while trying to rescue Bolin. She and Mako sneaked into the building disguised as a couple and witnessed Amon giving his speech about the Equalist movement. Korra was both frightened and infuriated by Amon's words and display of power. After she and Mako rescued Bolin, she briefly attacked the Lieutenant outside and escaped. The chi blockers were about ready to follow, but Amon stopped them, saying that she was the perfect messenger to tell the city of his power."
    },
    {
      "body": "After this, Korra's anxiety toward Amon caused her to begin having nightmares that were so severe, she would wake up screaming. Regardless, she continued to deny her fear of Amon, forcing herself into emotional dismay. When ${link_0} invited Korra to join his task force, she denied his invitation, saying her airbending training took priority over anything else; however, Korra was shirking the task force so she could continue running away from her fears. Eager to prove to herself and everyone else that she was unafraid of Amon, Korra eventually joined Tarrlok's task force and later challenged Amon to a one-on-one duel on ${link_1}. There, she was ambushed by chi blockers and knocked unconscious. When she woke up, Amon approached her directly. Korra was terrified that he was going to take her bending away, though he did not, stating that doing so would only make her a martyr. He told her that he had a plan, and that he was going to save her for last. Amon knocked Korra unconscious, and when she awoke, she broke down when Tenzin came.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Aang Memorial Island",
          "key": "${link_1}",
          "target": {
            "href": "Aang_Memorial_Island",
            "page": "Aang_Memorial_Island"
          }
        }
      ],
      "text": "After this, Korra's anxiety toward Amon caused her to begin having nightmares that were so severe, she would wake up screaming. Regardless, she continued to deny her fear of Amon, forcing herself into emotional dismay. When Tarrlok invited Korra to join his task force, she denied his invitation, saying her airbending training took priority over anything else; however, Korra was shirking the task force so she could continue running away from her fears. Eager to prove to herself and everyone else that she was unafraid of Amon, Korra eventually joined Tarrlok's task force and later challenged Amon to a one-on-one duel on Aang Memorial Island. There, she was ambushed by chi blockers and knocked unconscious. When she woke up, Amon approached her directly. Korra was terrified that he was going to take her bending away, though he did not, stating that doing so would only make her a martyr. He told her that he had a plan, and that he was going to save her for last. Amon knocked Korra unconscious, and when she awoke, she broke down when Tenzin came."
    },
    {
      "body": "${link_0} ${link_1} ${link_2}'s ${link_3} away during the ${link_4}.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "took",
          "key": "${link_1}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "bending",
          "key": "${link_3}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Equalist victory rally",
          "key": "${link_4}",
          "target": {
            "href": "Equalist_victory_rally",
            "page": "Equalist_victory_rally"
          }
        }
      ],
      "text": "Amon took Korra's bending away during the Equalist victory rally."
    },
    {
      "body": "As the days passed, the Equalists started their siege on Republic City. Korra and her teammates were on the city, fighting against the other Equalists and ${link_0}. Amon was observing them from his airship. After the attack ended, the Equalists had already conquered the city. Korra and Mako planned to ambush Amon while disguised as Equalists. However, the Equalist leader was ready for a fight which resulted to Korra's severed connection with the other elements. When Mako tried to run away while carrying Korra, Amon bloodbent him and almost took his bending. Korra quickly stood up and airbent for the first time, she created several air blasts that pushed Amon through a window and fell right into the sea. Amon, in a desperate attempt to stop himself from drowning, propelled himself out of the water by using a water spout. This action caused an uproar among the crowd which led them to believe that Avatar was indeed telling the truth and their trust in Amon no longer existed.",
      "links": [
        {
          "body": "mecha tanks",
          "key": "${link_0}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        }
      ],
      "text": "As the days passed, the Equalists started their siege on Republic City. Korra and her teammates were on the city, fighting against the other Equalists and mecha tanks. Amon was observing them from his airship. After the attack ended, the Equalists had already conquered the city. Korra and Mako planned to ambush Amon while disguised as Equalists. However, the Equalist leader was ready for a fight which resulted to Korra's severed connection with the other elements. When Mako tried to run away while carrying Korra, Amon bloodbent him and almost took his bending. Korra quickly stood up and airbent for the first time, she created several air blasts that pushed Amon through a window and fell right into the sea. Amon, in a desperate attempt to stop himself from drowning, propelled himself out of the water by using a water spout. This action caused an uproar among the crowd which led them to believe that Avatar was indeed telling the truth and their trust in Amon no longer existed."
    },
    {
      "body": "${link_0} was convinced ${link_1} was an ${link_2}, which led to her attempting to stop him from supplying ${link_3} with more inventions.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Hiroshi",
          "key": "${link_1}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_2}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Amon",
          "key": "${link_3}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        }
      ],
      "text": "Korra was convinced Hiroshi was an Equalist, which led to her attempting to stop him from supplying Amon with more inventions."
    },
    {
      "body": "Hiroshi Sato had offered to personally sponsor the Fire Ferrets in the Pro-bending Tournament, after the team incurred financial issues. Following the team's invite to the Sato mansion, however, Korra began to suspect Hiroshi of working for the Equalists when she overheard a phone call he had with an unknown individual after the shutdown of ${link_0}. Korra, Lin, her police force, and Tenzin began to investigate Future Industries and the mansion at the formers urging, and their investigation turned up a secret factory where Hiroshi was producing technology for the Equalists, including the electrified gloves and mecha tanks, proving Korra's suspicions correct. The invading party encountered Hiroshi and the Equalists, sparking a fight, in which Hiroshi was successful in stunning them with electric ropes. Hiroshi was eventually arrested and imprisoned, though Korra remained skeptical of him, immediately questioning his intentions when Asami revealed that he had contacted her again three years after she last saw him. However, when ${link_1}, Korra was able to set aside her misgivings about Hiroshi to let him help her and her allies to defeat the threat.",
      "links": [
        {
          "body": "Cabbage Corp",
          "key": "${link_0}",
          "target": {
            "href": "Cabbage_Corp",
            "page": "Cabbage_Corp"
          }
        },
        {
          "body": "Republic City came under siege by Kuvira's enormous mecha suit",
          "key": "${link_1}",
          "target": {
            "href": "Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        }
      ],
      "text": "Hiroshi Sato had offered to personally sponsor the Fire Ferrets in the Pro-bending Tournament, after the team incurred financial issues. Following the team's invite to the Sato mansion, however, Korra began to suspect Hiroshi of working for the Equalists when she overheard a phone call he had with an unknown individual after the shutdown of Cabbage Corp. Korra, Lin, her police force, and Tenzin began to investigate Future Industries and the mansion at the formers urging, and their investigation turned up a secret factory where Hiroshi was producing technology for the Equalists, including the electrified gloves and mecha tanks, proving Korra's suspicions correct. The invading party encountered Hiroshi and the Equalists, sparking a fight, in which Hiroshi was successful in stunning them with electric ropes. Hiroshi was eventually arrested and imprisoned, though Korra remained skeptical of him, immediately questioning his intentions when Asami revealed that he had contacted her again three years after she last saw him. However, when Republic City came under siege by Kuvira's enormous mecha suit, Korra was able to set aside her misgivings about Hiroshi to let him help her and her allies to defeat the threat."
    },
    {
      "body": "${link_0}, believing ${link_1} would turn over information about ${link_2}'s ${link_3}, agreed to retrieve her tax payments.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_1}",
          "target": {
            "href": "Hou-Ting",
            "page": "Hou-Ting"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_2}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_3}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Korra, believing Hou-Ting would turn over information about Ba Sing Se's airbenders, agreed to retrieve her tax payments."
    },
    {
      "body": "Although Korra met Earth Queen Hou-Tung with the intention of requesting her help to find the new airbenders in Ba Sing Se, she soon struck out with the royal when it became clear the Queen held a grudge against the Avatar for Aang and Zuko's decision to convert Earth Kingdom territory to the United Republic of Nations. Their initial dislike of one another only intensified when Korra discovered that Hou-Ting had not only lied about there being no airbenders in Ba Sing Se but had been secretly arresting and training them to form her own private airbending army. Ignoring the queen's threat that she would bear down with the entire might of the Earth Kingdom on the Avatar, Korra and her friends freed the captured airbenders and transported them out of the Earth Kingdom capital to the Northern Air Temple, an action that led the Queen to issue wanted posters against Korra and the rest of Team Avatar for \"crimes against the Kingdom\". Although Korra was enraged about the Queen's actions, she still disagreed with Zaheer's statement that leader's like her needed to be taken out. Despite her misgivings about the royal, Korra was genuinely shocked to learn that Zaheer had killed the Hou-Ting.",
      "links": [],
      "text": "Although Korra met Earth Queen Hou-Tung with the intention of requesting her help to find the new airbenders in Ba Sing Se, she soon struck out with the royal when it became clear the Queen held a grudge against the Avatar for Aang and Zuko's decision to convert Earth Kingdom territory to the United Republic of Nations. Their initial dislike of one another only intensified when Korra discovered that Hou-Ting had not only lied about there being no airbenders in Ba Sing Se but had been secretly arresting and training them to form her own private airbending army. Ignoring the queen's threat that she would bear down with the entire might of the Earth Kingdom on the Avatar, Korra and her friends freed the captured airbenders and transported them out of the Earth Kingdom capital to the Northern Air Temple, an action that led the Queen to issue wanted posters against Korra and the rest of Team Avatar for \"crimes against the Kingdom\". Although Korra was enraged about the Queen's actions, she still disagreed with Zaheer's statement that leader's like her needed to be taken out. Despite her misgivings about the royal, Korra was genuinely shocked to learn that Zaheer had killed the Hou-Ting."
    },
    {
      "body": "The ${link_0} opposed ${link_1} as she attempted to obtain ${link_2}'s whereabouts.",
      "links": [
        {
          "body": "protester",
          "key": "${link_0}",
          "target": {
            "href": "Protester",
            "page": "Protester"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_2}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        }
      ],
      "text": "The protester opposed Korra as she attempted to obtain Bolin's whereabouts."
    },
    {
      "body": "Korra first met this protester when she was roaming ${link_0}. She overheard him trying to persuade a group of nonbenders to support the Equalists. Korra tried to challenge his bold disrespectful words about bending, but her hot-headed attitude caused the protester to gain the support of the crowd. After Bolin had been captured by Amon, Korra, alongside Mako, forced the protester to tell where the Equalists might have taken Bolin. After threatening him, he finally told her about \"the Revelation\".",
      "links": [
        {
          "body": "Republic City Park",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Korra_Park",
            "page": "Avatar_Korra_Park"
          }
        }
      ],
      "text": "Korra first met this protester when she was roaming Republic City Park. She overheard him trying to persuade a group of nonbenders to support the Equalists. Korra tried to challenge his bold disrespectful words about bending, but her hot-headed attitude caused the protester to gain the support of the crowd. After Bolin had been captured by Amon, Korra, alongside Mako, forced the protester to tell where the Equalists might have taken Bolin. After threatening him, he finally told her about \"the Revelation\"."
    },
    {
      "body": "${link_0} encountered the ${link_1} upon her arrival in ${link_2}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Triple Threat Triad",
          "key": "${link_1}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "text": "Korra encountered the Triple Threat Triad upon her arrival in Republic City."
    },
    {
      "body": "Korra first met the Triple Threat Triad while she and Naga were wandering around Republic City, upon their arrival. Korra did not know much of the city policy in regards to dealing with criminals. Wishing only to help the old man who was being threatened by the triad, Korra directly assisted him, and fought against the triad, allowing the police to arrest them. Days later, when the Fire Ferrets needed some money in order to keep their place in the tournament, Bolin met Shady Shin, his old friend convincing Bolin to assist the triad for some money. Korra and Mako grew worried about him, and ended up searching for Bolin at the ${link_0}.",
      "links": [
        {
          "body": "Triple Threat Triad's headquarters",
          "key": "${link_0}",
          "target": {
            "href": "Triple_Threat_Triad_headquarters",
            "page": "Triple_Threat_Triad_headquarters"
          }
        }
      ],
      "text": "Korra first met the Triple Threat Triad while she and Naga were wandering around Republic City, upon their arrival. Korra did not know much of the city policy in regards to dealing with criminals. Wishing only to help the old man who was being threatened by the triad, Korra directly assisted him, and fought against the triad, allowing the police to arrest them. Days later, when the Fire Ferrets needed some money in order to keep their place in the tournament, Bolin met Shady Shin, his old friend convincing Bolin to assist the triad for some money. Korra and Mako grew worried about him, and ended up searching for Bolin at the Triple Threat Triad's headquarters."
    },
    {
      "body": "Although the Red Lotus tried to kidnap her when she was five years old, Korra first learned of the group's existence thirteen years later, after those responsible for the attempt had escaped. After narrowly escaping being ${link_0} by them again, Korra confronted the Red Lotus' leader, Zaheer, in the Spirit World. Although she initially prepared to battle him, she trusted him enough to hold a non-threatening conversation after he offered her the opportunity to talk, since neither of them had their bending abilities at that moment.",
      "links": [
        {
          "body": "kidnapped",
          "key": "${link_0}",
          "target": {
            "href": "Attempted_kidnapping_of_Avatar_Korra",
            "page": "Attempted_kidnapping_of_Avatar_Korra"
          }
        }
      ],
      "text": "Although the Red Lotus tried to kidnap her when she was five years old, Korra first learned of the group's existence thirteen years later, after those responsible for the attempt had escaped. After narrowly escaping being kidnapped by them again, Korra confronted the Red Lotus' leader, Zaheer, in the Spirit World. Although she initially prepared to battle him, she trusted him enough to hold a non-threatening conversation after he offered her the opportunity to talk, since neither of them had their bending abilities at that moment."
    },
    {
      "body": "Although ${link_0} tried to kill ${link_1} and end the ${link_2}, he eventually helped her to overcome her fear of him and restore communication with ${link_3}.",
      "links": [
        {
          "body": "Zaheer",
          "key": "${link_0}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Avatar Cycle",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_Cycle",
            "page": "Avatar"
          }
        },
        {
          "body": "Raava",
          "key": "${link_3}",
          "target": {
            "href": "Raava",
            "page": "Raava"
          }
        }
      ],
      "text": "Although Zaheer tried to kill Korra and end the Avatar Cycle, he eventually helped her to overcome her fear of him and restore communication with Raava."
    },
    {
      "body": "Some time later, Korra gave herself up to Zaheer in order to save the Air Nation, which resulted in her being poisoned with mercury in an attempt to destroy her and the Avatar Cycle. Although she managed to free herself, the battle she had with Zaheer, especially his attempt to asphyxiate her, put a lot of strain on her, both physically and mentally. Although the airbender was imprisoned, Korra remained mentally affected by him. The fear she had for him grew over the years to follow, blocking her ability to meditate into the Spirit World and communicate with Raava; every time she attempted to cross over, she would be plagued by visions of him trying to kill her.",
      "links": [],
      "text": "Some time later, Korra gave herself up to Zaheer in order to save the Air Nation, which resulted in her being poisoned with mercury in an attempt to destroy her and the Avatar Cycle. Although she managed to free herself, the battle she had with Zaheer, especially his attempt to asphyxiate her, put a lot of strain on her, both physically and mentally. Although the airbender was imprisoned, Korra remained mentally affected by him. The fear she had for him grew over the years to follow, blocking her ability to meditate into the Spirit World and communicate with Raava; every time she attempted to cross over, she would be plagued by visions of him trying to kill her."
    },
    {
      "body": "Korra decided to face Zaheer in 174 AG, hoping the confrontation would convince her he was no longer a threat, though she still cowered in fear when he soared toward her. Zaheer pointed out that Korra blaming him for having ruined her was merely a crutch to make herself feel better. Since their interests aligned, namely stopping Kuvira, who had forcefully placed the Earth Kingdom under her military dictatorship, Zaheer decided to help her. Although Korra initially refused, not trusting him, she eventually agreed, realizing she had no other options left. Meditating together, Korra was plagued by another vision of Zaheer's past attempt to murder her. Although she grew fearful, Zaheer urged her to let it play out and stop fearing what might have been. Focusing on his voice and following his advice, Korra was able to truly let go of her fear and enter the Spirit World, where she regained her ability to communicate with Raava.",
      "links": [],
      "text": "Korra decided to face Zaheer in 174 AG, hoping the confrontation would convince her he was no longer a threat, though she still cowered in fear when he soared toward her. Zaheer pointed out that Korra blaming him for having ruined her was merely a crutch to make herself feel better. Since their interests aligned, namely stopping Kuvira, who had forcefully placed the Earth Kingdom under her military dictatorship, Zaheer decided to help her. Although Korra initially refused, not trusting him, she eventually agreed, realizing she had no other options left. Meditating together, Korra was plagued by another vision of Zaheer's past attempt to murder her. Although she grew fearful, Zaheer urged her to let it play out and stop fearing what might have been. Focusing on his voice and following his advice, Korra was able to truly let go of her fear and enter the Spirit World, where she regained her ability to communicate with Raava."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Korra%27s_relationships",
    "file": "avatar.wikia.com/wiki/Korra's_relationships.html",
    "page": "Korra's_relationships",
    "title": "Korra's relationships"
  }
}