{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Establishments",
      "target": {
        "href": "Category_Establishments",
        "page": "Category_Establishments"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Kyoshi Island",
              "key": "${link_0}",
              "target": {
                "href": "Kyoshi_Island",
                "page": "Kyoshi_Island"
              }
            }
          ],
          "text": "Kyoshi Island",
          "value": "${link_0}",
          "value_text": "Kyoshi Island"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "Shrine to ${link_0} ${link_1}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Avatar",
              "key": "${link_0}",
              "target": {
                "href": "Avatar",
                "page": "Avatar"
              }
            },
            {
              "body": "Kyoshi",
              "key": "${link_1}",
              "target": {
                "href": "Kyoshi",
                "page": "Kyoshi"
              }
            }
          ],
          "text": "Shrine to Avatar Kyoshi",
          "value": "Shrine to ${link_0} ${link_1}",
          "value_text": "Shrine to Avatar Kyoshi"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\" (only appearance)",
          "extra": "(only appearance)",
          "extra_text": "(only appearance)",
          "links": [
            {
              "body": "Avatar Day",
              "key": "${link_0}",
              "target": {
                "href": "Avatar_Day",
                "page": "Avatar_Day"
              }
            }
          ],
          "text": "\"Avatar Day\" (only appearance)",
          "value": "\"${link_0}\"",
          "value_text": "\"Avatar Day\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The Kyoshi Shrine, ${link_0} on ${link_1}, was a sanctuary dedicated to ${link_2} ${link_3} after her death. Originally a village temple, it was converted in accordance to Kyoshi's deep connection with the site. The temple preserved several relics associated with the Avatar, including her headdress, fans, kimono, and boots.",
      "links": [
        {
          "body": "located",
          "key": "${link_0}",
          "target": {
            "href": "Geography_of_the_World_of_Avatar",
            "page": "Geography_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_3}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        }
      ],
      "text": "The Kyoshi Shrine, located on Kyoshi Island, was a sanctuary dedicated to Avatar Kyoshi after her death. Originally a village temple, it was converted in accordance to Kyoshi's deep connection with the site. The temple preserved several relics associated with the Avatar, including her headdress, fans, kimono, and boots."
    },
    {
      "body": "According to the people of ${link_0}, Avatar Kyoshi was responsible for the demise of their great leader, ${link_1} the Great. In order to clear Kyoshi's name, Avatar ${link_2} agreed to stand trial. To aid their friend, ${link_3} and ${link_4} traveled to Kyoshi Island in an attempt to find evidence that could prove the Avatar's innocence. ${link_5} took the duo to Avatar Kyoshi's shrine, hoping that the relics contained within could help solidify Aang's case and clear Kyoshi's name. The clerics told the visitors of the shrine that Kyoshi's relics were still connected to her spirit. Although Oyaji held a strong restriction on the visitors' permission to touch the artifacts, the duo inspected them closely and came to uplifting conclusions. By examining the relics, Kyoshi's large boots in particular, Katara was able to deduce that Kyoshi did not murder Chin, for the small footprint located on the protruding cliff outside Chin Village did not match the large footprints Kyoshi's boots would have left. Sokka chipped in by judging from the painting, The Birth of Kyoshi, that Kyoshi could not have been at Chin Village murdering Chin if she was on Kyoshi Island attending a ceremony at the same time.",
      "links": [
        {
          "body": "Chin Village",
          "key": "${link_0}",
          "target": {
            "href": "Chin_Village",
            "page": "Chin_Village"
          }
        },
        {
          "body": "Chin",
          "key": "${link_1}",
          "target": {
            "href": "Chin",
            "page": "Chin"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_3}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Katara",
          "key": "${link_4}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Oyaji",
          "key": "${link_5}",
          "target": {
            "href": "Oyaji",
            "page": "Oyaji"
          }
        }
      ],
      "text": "According to the people of Chin Village, Avatar Kyoshi was responsible for the demise of their great leader, Chin the Great. In order to clear Kyoshi's name, Avatar Aang agreed to stand trial. To aid their friend, Sokka and Katara traveled to Kyoshi Island in an attempt to find evidence that could prove the Avatar's innocence. Oyaji took the duo to Avatar Kyoshi's shrine, hoping that the relics contained within could help solidify Aang's case and clear Kyoshi's name. The clerics told the visitors of the shrine that Kyoshi's relics were still connected to her spirit. Although Oyaji held a strong restriction on the visitors' permission to touch the artifacts, the duo inspected them closely and came to uplifting conclusions. By examining the relics, Kyoshi's large boots in particular, Katara was able to deduce that Kyoshi did not murder Chin, for the small footprint located on the protruding cliff outside Chin Village did not match the large footprints Kyoshi's boots would have left. Sokka chipped in by judging from the painting, The Birth of Kyoshi, that Kyoshi could not have been at Chin Village murdering Chin if she was on Kyoshi Island attending a ceremony at the same time."
    },
    {
      "body": "The interior of the Kyoshi Shrine features several items that belonged to ${link_0} ${link_1}.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        }
      ],
      "text": "The interior of the Kyoshi Shrine features several items that belonged to Avatar Kyoshi."
    },
    {
      "body": "The Kyoshi Shrine boasted a wide variety of historic artifacts related to Kyoshi, including her boots, the biggest of all the Avatars, her green kimono, her typical headdress, and her fans, which she used to augment her bending.",
      "links": [],
      "text": "The Kyoshi Shrine boasted a wide variety of historic artifacts related to Kyoshi, including her boots, the biggest of all the Avatars, her green kimono, her typical headdress, and her fans, which she used to augment her bending."
    },
    {
      "body": "The Birth of Kyoshi is a painting which shows the origin of Kyoshi Island. It was painted in 270 ${link_0} at sunset on the day Kyoshi split the island from the mainland. It is a renowned relic of Kyoshi Island and one of the most respected holdings of the Kyoshi Shrine.",
      "links": [
        {
          "body": "BG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "The Birth of Kyoshi is a painting which shows the origin of Kyoshi Island. It was painted in 270 BG at sunset on the day Kyoshi split the island from the mainland. It is a renowned relic of Kyoshi Island and one of the most respected holdings of the Kyoshi Shrine."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Kyoshi_Shrine",
    "file": "avatar.wikia.com/wiki/Kyoshi_Shrine.html",
    "page": "Kyoshi_Shrine",
    "title": "Kyoshi Shrine"
  }
}