{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earthbending",
      "target": {
        "href": "Category_Earthbending",
        "page": "Category_Earthbending"
      }
    },
    {
      "body": "Specialized bending techniques",
      "target": {
        "href": "Category_Specialized_bending_techniques",
        "page": "Category_Specialized_bending_techniques"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} is the last known lavabender to be alive by 174 ${link_1}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "AG",
          "key": "${link_1}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "Bolin is the last known lavabender to be alive by 174 AG."
    },
    {
      "body": "Lavabending is a ${link_0} of ${link_1} that allows the user to manipulate molten earth. This rare ability allows the bender to phase-change earth into lava, lava into earth, and otherwise manipulate existing lava with great dexterity.",
      "links": [
        {
          "body": "specialized sub-skill",
          "key": "${link_0}",
          "target": {
            "href": "Specialized_bending_techniques",
            "page": "Specialized_bending_techniques"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Lavabending is a specialized sub-skill of earthbending that allows the user to manipulate molten earth. This rare ability allows the bender to phase-change earth into lava, lava into earth, and otherwise manipulate existing lava with great dexterity."
    },
    {
      "body": "${link_0} ${link_1} used lavabending to split her ${link_2} from the mainland.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        },
        {
          "body": "peninsula",
          "key": "${link_2}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        }
      ],
      "text": "Avatar Kyoshi used lavabending to split her peninsula from the mainland."
    },
    {
      "body": "The first known use of lavabending was by the ${link_0} who preceded ${link_1}, who used the technique while in the ${link_2} to cause the simultaneous eruption of four small volcanoes.",
      "links": [
        {
          "body": "Fire Nation Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Yangchen%27s_predecessor",
            "page": "Yangchen%27s_predecessor"
          }
        },
        {
          "body": "Yangchen",
          "key": "${link_1}",
          "target": {
            "href": "Yangchen",
            "page": "Yangchen"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "The first known use of lavabending was by the Fire Nation Avatar who preceded Yangchen, who used the technique while in the Avatar State to cause the simultaneous eruption of four small volcanoes."
    },
    {
      "body": "Centuries later, the technique was utilized by ${link_0} ${link_1} when ${link_2} approached her ${link_3} in an attempt to claim it as part of his empire. In order to protect her people, Kyoshi utilized her bending to split the peninsula from the ${link_4} mainland. In order to accomplish this, Kyoshi created fissures and bent lava up from underneath the landmass in order to sever it completely from the continent.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        },
        {
          "body": "Chin",
          "key": "${link_2}",
          "target": {
            "href": "Chin",
            "page": "Chin"
          }
        },
        {
          "body": "peninsula",
          "key": "${link_3}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_4}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Centuries later, the technique was utilized by Avatar Kyoshi when Chin approached her peninsula in an attempt to claim it as part of his empire. In order to protect her people, Kyoshi utilized her bending to split the peninsula from the Earth Kingdom mainland. In order to accomplish this, Kyoshi created fissures and bent lava up from underneath the landmass in order to sever it completely from the continent."
    },
    {
      "body": "While attempting to master the Avatar State by harnessing the energy of the sun during the ${link_0} in 55 ${link_1}, Avatar ${link_2} remained stuck in the Avatar State as a result of the overwhelming power that rushed through his body. During this time, he inadvertently caused the eruption of a small volcano near the ${link_3} on ${link_4}. Roku eventually mastered the Avatar State and used lavabending once more in 12 BG, diverting a massive lava flow in an attempt to save his ${link_5} from a volcanic eruption.",
      "links": [
        {
          "body": "winter solstice",
          "key": "${link_0}",
          "target": {
            "href": "Winter_solstice",
            "page": "Winter_solstice"
          }
        },
        {
          "body": "BG",
          "key": "${link_1}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Fire Temple",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Temple",
            "page": "Fire_Temple"
          }
        },
        {
          "body": "Crescent Island",
          "key": "${link_4}",
          "target": {
            "href": "Crescent_Island",
            "page": "Crescent_Island"
          }
        },
        {
          "body": "home island",
          "key": "${link_5}",
          "target": {
            "href": "Roku%27s_island",
            "page": "Roku%27s_island"
          }
        }
      ],
      "text": "While attempting to master the Avatar State by harnessing the energy of the sun during the winter solstice in 55 BG, Avatar Roku remained stuck in the Avatar State as a result of the overwhelming power that rushed through his body. During this time, he inadvertently caused the eruption of a small volcano near the Fire Temple on Crescent Island. Roku eventually mastered the Avatar State and used lavabending once more in 12 BG, diverting a massive lava flow in an attempt to save his home island from a volcanic eruption."
    },
    {
      "body": "Following his death, Avatar Roku manifested through Aang in 99 AG and used lavabending to destroy the Fire Temple during the winter solstice, in order to punish the ${link_0} who had since abandoned their duties to the Avatar in service of the ${link_1}.",
      "links": [
        {
          "body": "Fire Sages",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "text": "Following his death, Avatar Roku manifested through Aang in 99 AG and used lavabending to destroy the Fire Temple during the winter solstice, in order to punish the Fire Sages who had since abandoned their duties to the Avatar in service of the Fire Lord."
    },
    {
      "body": "${link_0} could create shuriken-like lava projectiles from just a few pieces of earth.",
      "links": [
        {
          "body": "Ghazan",
          "key": "${link_0}",
          "target": {
            "href": "Ghazan",
            "page": "Ghazan"
          }
        }
      ],
      "text": "Ghazan could create shuriken-like lava projectiles from just a few pieces of earth."
    },
    {
      "body": "In 171 AG, Ghazan created a shuriken-like lava projectile using three pieces of earth, which he subsequently used to break out of his ${link_0} and subdue his ${link_1}. The earthbender used the same technique in order to liberate ${link_2} from her ${link_3} shortly after his escape. During his ${link_4}'s escape from ${link_5}, Ghazan turned a portion of the road into lava in order to stall police cars in pursuit of him and his associates. He used the technique once again in a much grander scale in order to create a moat of lava around him and his group during their infiltration of ${link_6}.",
      "links": [
        {
          "body": "prison",
          "key": "${link_0}",
          "target": {
            "href": "White_Lotus_prisons#Ghazan.27s_prison",
            "page": "White_Lotus_prisons"
          }
        },
        {
          "body": "guards",
          "key": "${link_1}",
          "target": {
            "href": "White_Lotus_sentries",
            "page": "White_Lotus_sentries"
          }
        },
        {
          "body": "Ming-Hua",
          "key": "${link_2}",
          "target": {
            "href": "Ming-Hua",
            "page": "Ming-Hua"
          }
        },
        {
          "body": "prison",
          "key": "${link_3}",
          "target": {
            "href": "White_Lotus_prisons#Ming-Hua.27s_prison",
            "page": "White_Lotus_prisons"
          }
        },
        {
          "body": "group",
          "key": "${link_4}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_5}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Zaofu",
          "key": "${link_6}",
          "target": {
            "href": "Zaofu",
            "page": "Zaofu"
          }
        }
      ],
      "text": "In 171 AG, Ghazan created a shuriken-like lava projectile using three pieces of earth, which he subsequently used to break out of his prison and subdue his guards. The earthbender used the same technique in order to liberate Ming-Hua from her prison shortly after his escape. During his group's escape from Republic City, Ghazan turned a portion of the road into lava in order to stall police cars in pursuit of him and his associates. He used the technique once again in a much grander scale in order to create a moat of lava around him and his group during their infiltration of Zaofu."
    },
    {
      "body": "During the battle that ensued, Ghazan lifted a column of lava in order to prevent ${link_0} guards from building a bridge toward him and the others. In the ${link_1}, he manipulated fireball-shaped blobs of lava and used them to overwhelm ${link_2}'s earth shields.",
      "links": [
        {
          "body": "metalbending",
          "key": "${link_0}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "Misty Palms Oasis",
          "key": "${link_1}",
          "target": {
            "href": "Misty_Palms_Oasis",
            "page": "Misty_Palms_Oasis"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_2}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        }
      ],
      "text": "During the battle that ensued, Ghazan lifted a column of lava in order to prevent metalbending guards from building a bridge toward him and the others. In the Misty Palms Oasis, he manipulated fireball-shaped blobs of lava and used them to overwhelm Bolin's earth shields."
    },
    {
      "body": "${link_0} brought down the Inner Wall of ${link_1} with lavabending.",
      "links": [
        {
          "body": "Ghazan",
          "key": "${link_0}",
          "target": {
            "href": "Ghazan",
            "page": "Ghazan"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "Ghazan brought down the Inner Wall of Ba Sing Se with lavabending."
    },
    {
      "body": "After the Red Lotus assassinated the ${link_0} and Zaheer announced the independence of ${link_1}'s citizens, Ghazan used lavabending to single-handedly tear down the Inner Wall that divided the city's rings. Liquefying the base of the wall, he caused the lava to expand, resulting in the explosive collapse of the structure.",
      "links": [
        {
          "body": "Earth Queen",
          "key": "${link_0}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "After the Red Lotus assassinated the Earth Queen and Zaheer announced the independence of Ba Sing Se's citizens, Ghazan used lavabending to single-handedly tear down the Inner Wall that divided the city's rings. Liquefying the base of the wall, he caused the lava to expand, resulting in the explosive collapse of the structure."
    },
    {
      "body": "When the Red Lotus invaded the ${link_0}, Ghazan used lavabending to block ${link_1} and his fellow ${link_2} from escaping. He also used the technique later on in his fight with ${link_3}, causing irreparable damage to the temple's infrastructure. Several days later, Ghazan used lava to subdue the members of Team Avatar, destroying the entire Northern Air Temple simply by turning a single portion into lava. While fleeing from the temple grounds, Bolin discovered his lavabending capabilities and used his newfound skill to divert a wave of lava before turning it back into solid earth.",
      "links": [
        {
          "body": "Northern Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        },
        {
          "body": "Kai",
          "key": "${link_1}",
          "target": {
            "href": "Kai",
            "page": "Kai"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_2}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_3}",
          "target": {
            "href": "Bumi",
            "page": "Bumi"
          }
        }
      ],
      "text": "When the Red Lotus invaded the Northern Air Temple, Ghazan used lavabending to block Kai and his fellow airbenders from escaping. He also used the technique later on in his fight with Bumi, causing irreparable damage to the temple's infrastructure. Several days later, Ghazan used lava to subdue the members of Team Avatar, destroying the entire Northern Air Temple simply by turning a single portion into lava. While fleeing from the temple grounds, Bolin discovered his lavabending capabilities and used his newfound skill to divert a wave of lava before turning it back into solid earth."
    },
    {
      "body": "In a series of caves near the Northern Air Temple, Ghazan turned the earth underneath Avatar Korra into a pool of lava and later created more heated earth during his battle with Bolin. During the duel, both Bolin and Ghazan created and redirected lava tendrils until the latter was eventually cornered with the arrival of Mako, forcing him to turn the surrounding cave walls into lava and bringing the cave down around him, killing himself.",
      "links": [],
      "text": "In a series of caves near the Northern Air Temple, Ghazan turned the earth underneath Avatar Korra into a pool of lava and later created more heated earth during his battle with Bolin. During the duel, both Bolin and Ghazan created and redirected lava tendrils until the latter was eventually cornered with the arrival of Mako, forcing him to turn the surrounding cave walls into lava and bringing the cave down around him, killing himself."
    },
    {
      "body": "By 174 AG, Bolin perfected his control over the skill and utilized it more readily in combat; he used it to melt the armor of two ${link_0} from the ${link_1} when he, ${link_2}, and ${link_3} tried to desert the army. A couple of days later, after he and Varrick were captured by escaped prisoners, Bolin used lavabending to separate them from the hostile fugitives, who believed them to be Earth Empire loyalists. Forging an alliance with the prisoners, Bolin used the art later that day again to create a large stream of lava, defending the entire group against two Earth Empire soldiers at a military checkpoint.",
      "links": [
        {
          "body": "mecha suits",
          "key": "${link_0}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        },
        {
          "body": "military of the Earth Empire",
          "key": "${link_1}",
          "target": {
            "href": "Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_2}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "Zhu Li",
          "key": "${link_3}",
          "target": {
            "href": "Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        }
      ],
      "text": "By 174 AG, Bolin perfected his control over the skill and utilized it more readily in combat; he used it to melt the armor of two mecha suits from the military of the Earth Empire when he, Varrick, and Zhu Li tried to desert the army. A couple of days later, after he and Varrick were captured by escaped prisoners, Bolin used lavabending to separate them from the hostile fugitives, who believed them to be Earth Empire loyalists. Forging an alliance with the prisoners, Bolin used the art later that day again to create a large stream of lava, defending the entire group against two Earth Empire soldiers at a military checkpoint."
    },
    {
      "body": "${link_0} used his own version of the lava disc to cut through the metal interior of the enormous ${link_1}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "mecha suit",
          "key": "${link_1}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        }
      ],
      "text": "Bolin used his own version of the lava disc to cut through the metal interior of the enormous mecha suit."
    },
    {
      "body": "While trying to stop ${link_0}'s giant mecha suit from ${link_1} Republic City, Bolin sunk its left foot in a pool of lava to give the airbenders the opportunity to knock it over, though Kuvira managed to pull out of the danger unscathed. Later, he lavabent a disc, which he used to cut through a metal hatch, as well as in combat against a metalbender. Some time later, he used Ghazan's shuriken-like lava projectile to cut through ${link_2}'s ${link_3}, taking the ${link_4}'s leader by surprise.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "taking over",
          "key": "${link_1}",
          "target": {
            "href": "Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "Tokuga",
          "key": "${link_2}",
          "target": {
            "href": "Tokuga",
            "page": "Tokuga"
          }
        },
        {
          "body": "hook swords",
          "key": "${link_3}",
          "target": {
            "href": "Hook_swords",
            "page": "Hook_swords"
          }
        },
        {
          "body": "Triple Threat Triad",
          "key": "${link_4}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        }
      ],
      "text": "While trying to stop Kuvira's giant mecha suit from taking over Republic City, Bolin sunk its left foot in a pool of lava to give the airbenders the opportunity to knock it over, though Kuvira managed to pull out of the danger unscathed. Later, he lavabent a disc, which he used to cut through a metal hatch, as well as in combat against a metalbender. Some time later, he used Ghazan's shuriken-like lava projectile to cut through Tokuga's hook swords, taking the Triple Threat Triad's leader by surprise."
    },
    {
      "body": "${link_0} created a moat of lava around him and his ${link_1}, using the lava as both a protective barrier and ample ammunition to attack.",
      "links": [
        {
          "body": "Ghazan",
          "key": "${link_0}",
          "target": {
            "href": "Ghazan",
            "page": "Ghazan"
          }
        },
        {
          "body": "group",
          "key": "${link_1}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        }
      ],
      "text": "Ghazan created a moat of lava around him and his group, using the lava as both a protective barrier and ample ammunition to attack."
    },
    {
      "body": "Lavabending provides an earthbender with an array of both offensive and defensive possibilities during battle. Not much earth is necessary to create a useful amount of lava to bend, as three small rocks have been seen to be fashioned into a shuriken-like projectile capable of burning through wood. This is beneficial in environments with very little earth to manipulate, as only several small pieces of earth are required to create enough lava for a bender to use in battle. In addition, the use of lavabending to turn a portion of the earth into lava allows earthbenders to isolate themselves from their opponents and avoid battles at close range. The attacks at a lavabender's disposal range from small scale, like the lava shuriken, to larger attacks, such as conjuring blasts of lava or entire streams or waves, straight out of the earth.",
      "links": [],
      "text": "Lavabending provides an earthbender with an array of both offensive and defensive possibilities during battle. Not much earth is necessary to create a useful amount of lava to bend, as three small rocks have been seen to be fashioned into a shuriken-like projectile capable of burning through wood. This is beneficial in environments with very little earth to manipulate, as only several small pieces of earth are required to create enough lava for a bender to use in battle. In addition, the use of lavabending to turn a portion of the earth into lava allows earthbenders to isolate themselves from their opponents and avoid battles at close range. The attacks at a lavabender's disposal range from small scale, like the lava shuriken, to larger attacks, such as conjuring blasts of lava or entire streams or waves, straight out of the earth."
    },
    {
      "body": "The use of earth in a liquid state turns this bending into something closer to ${link_0}, requiring more fluid movements and allowing a more supple combat style. Due to its own nature, lava can spread and cause more damage when left unattended, much like fire is perceived by more prudent firebenders.",
      "links": [
        {
          "body": "waterbending",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "The use of earth in a liquid state turns this bending into something closer to waterbending, requiring more fluid movements and allowing a more supple combat style. Due to its own nature, lava can spread and cause more damage when left unattended, much like fire is perceived by more prudent firebenders."
    },
    {
      "body": "† indicates deceased.",
      "links": [],
      "text": "† indicates deceased."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Lavabending",
    "file": "avatar.wikia.com/wiki/Lavabending.html",
    "page": "Lavabending",
    "title": "Lavabending"
  }
}