{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "World of Avatar",
      "target": {
        "href": "Category_World_of_Avatar",
        "page": "Category_World_of_Avatar"
      }
    }
  ],
  "facts": [
    {
      "key": "Type",
      "value": [
        {
          "body": "Laws and judicial systems",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Laws and judicial systems",
          "value": "Laws and judicial systems",
          "value_text": "Laws and judicial systems"
        }
      ]
    },
    {
      "key": "Examples",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Metalbending Police Force",
              "key": "${link_0}",
              "target": {
                "href": "Republic_City_Police#Metalbending_Police_Force",
                "page": "Republic_City_Police"
              }
            }
          ],
          "text": "Metalbending Police Force",
          "value": "${link_0}",
          "value_text": "Metalbending Police Force"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The ${link_0} as well as the ${link_1} each have their own methods of law enforcement accomplished by unique judicial systems. Although these separate divisions of police may have different standards and policies, they all maintain the same goal of keeping the peace in their respective lands.",
      "links": [
        {
          "body": "four nations",
          "key": "${link_0}",
          "target": {
            "href": "Four_nations",
            "page": "Four_nations"
          }
        },
        {
          "body": "United Republic of Nations",
          "key": "${link_1}",
          "target": {
            "href": "United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        }
      ],
      "text": "The four nations as well as the United Republic of Nations each have their own methods of law enforcement accomplished by unique judicial systems. Although these separate divisions of police may have different standards and policies, they all maintain the same goal of keeping the peace in their respective lands."
    },
    {
      "body": "A notable characteristic of their unique culture, ${link_0} civilization is the only nation not known to have a judicial system. No known cases of crime or misconduct have been reported in Air Nomad civilization, exemplifying the effectiveness of their philosophy and teachings. A society which abets pacifism and equality, this country is the most peaceful and utopian in the ${link_1}.",
      "links": [
        {
          "body": "Air Nomad",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "world",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "A notable characteristic of their unique culture, Air Nomad civilization is the only nation not known to have a judicial system. No known cases of crime or misconduct have been reported in Air Nomad civilization, exemplifying the effectiveness of their philosophy and teachings. A society which abets pacifism and equality, this country is the most peaceful and utopian in the world."
    },
    {
      "body": "${link_0} became ${link_1} of the ${link_2} in 80 ${link_3}.",
      "links": [
        {
          "body": "Arnook",
          "key": "${link_0}",
          "target": {
            "href": "Arnook",
            "page": "Arnook"
          }
        },
        {
          "body": "Chief",
          "key": "${link_1}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "AG",
          "key": "${link_3}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "Arnook became Chief of the Northern Water Tribe in 80 AG."
    },
    {
      "body": "The ${link_0} is divided into three parts, each portion being completely independent of the others. Therefore, while the ${link_1} and ${link_2} Water Tribes have differing judicial systems, the ${link_3} lacks a known system of law enforcement. Execution, life imprisonment, and exile were three known punishments.",
      "links": [
        {
          "body": "Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Northern",
          "key": "${link_1}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Southern",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Foggy Swamp Tribe",
          "key": "${link_3}",
          "target": {
            "href": "Foggy_Swamp_Tribe",
            "page": "Foggy_Swamp_Tribe"
          }
        }
      ],
      "text": "The Water Tribe is divided into three parts, each portion being completely independent of the others. Therefore, while the Northern and Southern Water Tribes have differing judicial systems, the Foggy Swamp Tribe lacks a known system of law enforcement. Execution, life imprisonment, and exile were three known punishments."
    },
    {
      "body": "The ${link_0} of the Northern Water Tribe is in charge of the entire judicial system, including crime-fighting, law interpretation, and court trial. The chief has complete control over the entire system, being able to bend the law to his will. The council sometimes intervenes, generally to advise or assist the chief in his actions.",
      "links": [
        {
          "body": "head chief",
          "key": "${link_0}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        }
      ],
      "text": "The head chief of the Northern Water Tribe is in charge of the entire judicial system, including crime-fighting, law interpretation, and court trial. The chief has complete control over the entire system, being able to bend the law to his will. The council sometimes intervenes, generally to advise or assist the chief in his actions."
    },
    {
      "body": "The only known laws in the Northern Water Tribe are those that pertain to the rights of women. The law imposes major restrictions on women's rights that prohibit them from learning ${link_0} or choosing their own spouse. Most women align themselves to these rules, so the consequences for defying them are not well understood. When ${link_1} ${link_2} was caught teaching ${link_3} waterbending, his master, ${link_4}, suspended the Avatar's lessons, however, the event did not result in a trial or arrest.",
      "links": [
        {
          "body": "waterbending",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Pakku",
          "key": "${link_4}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        }
      ],
      "text": "The only known laws in the Northern Water Tribe are those that pertain to the rights of women. The law imposes major restrictions on women's rights that prohibit them from learning waterbending or choosing their own spouse. Most women align themselves to these rules, so the consequences for defying them are not well understood. When Avatar Aang was caught teaching Katara waterbending, his master, Pakku, suspended the Avatar's lessons, however, the event did not result in a trial or arrest."
    },
    {
      "body": "By 171 AG, the laws prohibiting women from choosing their spouses or learning offensive waterbending had apparently been lifted as Eska was both a skilled waterbender in battle and forcibly engaged herself to Bolin despite being female.",
      "links": [],
      "text": "By 171 AG, the laws prohibiting women from choosing their spouses or learning offensive waterbending had apparently been lifted as Eska was both a skilled waterbender in battle and forcibly engaged herself to Bolin despite being female."
    },
    {
      "body": "${link_0} used his authority to banish ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Sokka used his authority to banish Aang."
    },
    {
      "body": "Following the ${link_0} on tribe dealt by the ${link_1}, the political system of the Southern Water Tribe quickly became disorganized. No formal judicial system was created after this in the near future. By the time of Avatar Aang's arrival at the only remaining village in 99 ${link_2}, all men had left to support the ${link_3} in the ${link_4}. Sokka, who was still a teenager, now led the villagers, leaving everyone to report to him, meaning he was the one who judged the village's rules and determined the consequences for breaking them. Sokka also had the ability to banish anybody who was under his authority from the village. The only person known to have been banished was Aang, whom the warrior said had something to do with the Fire Nation, but the decision was only brought on by paranoia.",
      "links": [
        {
          "body": "attacks",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        },
        {
          "body": "Southern Raiders",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Raiders",
            "page": "Southern_Raiders"
          }
        },
        {
          "body": "AG",
          "key": "${link_2}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_3}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_4}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "Following the attacks on tribe dealt by the Southern Raiders, the political system of the Southern Water Tribe quickly became disorganized. No formal judicial system was created after this in the near future. By the time of Avatar Aang's arrival at the only remaining village in 99 AG, all men had left to support the Earth Kingdom in the Hundred Year War. Sokka, who was still a teenager, now led the villagers, leaving everyone to report to him, meaning he was the one who judged the village's rules and determined the consequences for breaking them. Sokka also had the ability to banish anybody who was under his authority from the village. The only person known to have been banished was Aang, whom the warrior said had something to do with the Fire Nation, but the decision was only brought on by paranoia."
    },
    {
      "body": "The Southern Water Tribe progressed significantly from the end of the Hundred Year War onward in terms of population and power, and later would establish a more complex judicial system.",
      "links": [],
      "text": "The Southern Water Tribe progressed significantly from the end of the Hundred Year War onward in terms of population and power, and later would establish a more complex judicial system."
    },
    {
      "body": "Because of its weak central government and high level of local autonomy, the ${link_0} lacks a unified legal code. Each town has its own set of laws, and the judicial system varies from one region to another, which is typically overseen by local officials or magistrates.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Because of its weak central government and high level of local autonomy, the Earth Kingdom lacks a unified legal code. Each town has its own set of laws, and the judicial system varies from one region to another, which is typically overseen by local officials or magistrates."
    },
    {
      "body": "${link_0}, the sprawling capital of the Earth Kingdom and most expansive city in the world, is, as of Fire Lord Zuko's coronation, dangerously unstable in concern to proper criminal handling.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "Ba Sing Se, the sprawling capital of the Earth Kingdom and most expansive city in the world, is, as of Fire Lord Zuko's coronation, dangerously unstable in concern to proper criminal handling."
    },
    {
      "body": "In the time of Avatar Kyoshi, there came to be a great and disastrous ${link_0} by Ba Sing Se's denizens against the ${link_1} ${link_2}; the peasants under his rule were furious at him for his inability to defend them when Chin the Conqueror nearly overtook their nation. In order to quell the uprising, Kyoshi formed the ${link_3}, an elite group of earthbenders who would be capable of protecting Ba Sing Se's citizens from harm in the years to come.",
      "links": [
        {
          "body": "uprising",
          "key": "${link_0}",
          "target": {
            "href": "Peasant_Uprising_in_Ba_Sing_Se",
            "page": "Peasant_Uprising_in_Ba_Sing_Se"
          }
        },
        {
          "body": "then-current",
          "key": "${link_1}",
          "target": {
            "href": "46th_Earth_King",
            "page": "46th_Earth_King"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_2}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_3}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "In the time of Avatar Kyoshi, there came to be a great and disastrous uprising by Ba Sing Se's denizens against the then-current Earth King; the peasants under his rule were furious at him for his inability to defend them when Chin the Conqueror nearly overtook their nation. In order to quell the uprising, Kyoshi formed the Dai Li, an elite group of earthbenders who would be capable of protecting Ba Sing Se's citizens from harm in the years to come."
    },
    {
      "body": "${link_0} was ${link_1} by the ${link_2}.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        },
        {
          "body": "brainwashed",
          "key": "${link_1}",
          "target": {
            "href": "Brainwashing",
            "page": "Brainwashing"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_2}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "Jet was brainwashed by the Dai Li."
    },
    {
      "body": "The Dai Li became the Impenetrable City's main governing force under ${link_0} ${link_1} after the 51st Earth King's death, an event which left four-year-old ${link_2} as technical leader of the kingdom, but because he was unable to perform this duty at his age, Long Feng was appointed his \"adviser\", thereby giving him control of Ba Sing Se and the Earth Kingdom.",
      "links": [
        {
          "body": "Grand Secretariat",
          "key": "${link_0}",
          "target": {
            "href": "Grand_Secretariat_of_Ba_Sing_Se",
            "page": "Grand_Secretariat_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_1}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        },
        {
          "body": "Kuei",
          "key": "${link_2}",
          "target": {
            "href": "Kuei",
            "page": "Kuei"
          }
        }
      ],
      "text": "The Dai Li became the Impenetrable City's main governing force under Grand Secretariat Long Feng after the 51st Earth King's death, an event which left four-year-old Kuei as technical leader of the kingdom, but because he was unable to perform this duty at his age, Long Feng was appointed his \"adviser\", thereby giving him control of Ba Sing Se and the Earth Kingdom."
    },
    {
      "body": "The Dai Li, upon Long Feng's command, enacted rules and policies that had to be adhered. No one was permitted to speak of the War within the walls, and Kuei could not be informed of the century-long onslaught at any cost. Punishment for breaking these laws was severe; ${link_0} was a common method of silencing citizens who acted out of line.",
      "links": [
        {
          "body": "brainwashing",
          "key": "${link_0}",
          "target": {
            "href": "Brainwashing",
            "page": "Brainwashing"
          }
        }
      ],
      "text": "The Dai Li, upon Long Feng's command, enacted rules and policies that had to be adhered. No one was permitted to speak of the War within the walls, and Kuei could not be informed of the century-long onslaught at any cost. Punishment for breaking these laws was severe; brainwashing was a common method of silencing citizens who acted out of line."
    },
    {
      "body": "${link_0} was kept in one of the prison cells of the ${link_1} ${link_2}.",
      "links": [
        {
          "body": "Long Feng",
          "key": "${link_0}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Royal Palace",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        }
      ],
      "text": "Long Feng was kept in one of the prison cells of the Earth Kingdom Royal Palace."
    },
    {
      "body": "It would appear that imprisonment was used before brainwashing was conceived, as Kuei sentenced Long Feng to indefinite imprisonment upon learning of the ${link_0}. Prison cells in the ${link_1} were unsightly and unkempt, nothing like the atmosphere found in Omashu's holding places. The cells were also constructed out of metal to prevent any earthbending prisoners from bending their way out, though this was rendered useless once Toph Beifong  invented ${link_2}.",
      "links": [
        {
          "body": "conspiracy",
          "key": "${link_0}",
          "target": {
            "href": "Conspiracy_of_Ba_Sing_Se",
            "page": "Conspiracy_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Royal Palace",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        },
        {
          "body": "metalbending",
          "key": "${link_2}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        }
      ],
      "text": "It would appear that imprisonment was used before brainwashing was conceived, as Kuei sentenced Long Feng to indefinite imprisonment upon learning of the conspiracy. Prison cells in the Royal Palace were unsightly and unkempt, nothing like the atmosphere found in Omashu's holding places. The cells were also constructed out of metal to prevent any earthbending prisoners from bending their way out, though this was rendered useless once Toph Beifong  invented metalbending."
    },
    {
      "body": "Ba Sing Se was soon ${link_0} by ${link_1} Azula, and with the Earth Kingdom now under Fire Nation rule, soldiers were stationed all over the kingdom, including Ba Sing Se, making the city fall under the Fire Nation's judgment and governing, however, it was eventually ${link_2} by the ${link_3}.",
      "links": [
        {
          "body": "captured",
          "key": "${link_0}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Princess",
          "key": "${link_1}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "liberated",
          "key": "${link_2}",
          "target": {
            "href": "Liberation_of_Ba_Sing_Se",
            "page": "Liberation_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Order of the White Lotus",
          "key": "${link_3}",
          "target": {
            "href": "Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        }
      ],
      "text": "Ba Sing Se was soon captured by Princess Azula, and with the Earth Kingdom now under Fire Nation rule, soldiers were stationed all over the kingdom, including Ba Sing Se, making the city fall under the Fire Nation's judgment and governing, however, it was eventually liberated by the Order of the White Lotus."
    },
    {
      "body": "In 171 AG, Ba Sing Se was under the rule of Earth Queen ${link_0}, who used her Dai Li agents to abduct new airbenders in her city and conscript them into an airbending army. They were kept underground in the Earth Queen's Temple and underwent a strict training regimen, which included being forced to strike one another as well as to defend themselves from earth projectiles. Any airbender that acted out of line was sent to solitary confinement, otherwise known as 'The Hole'. Desertion of the army was a crime punishable by death, a sentence not even children were exempt from.",
      "links": [
        {
          "body": "Hou-Ting",
          "key": "${link_0}",
          "target": {
            "href": "Hou-Ting",
            "page": "Hou-Ting"
          }
        }
      ],
      "text": "In 171 AG, Ba Sing Se was under the rule of Earth Queen Hou-Ting, who used her Dai Li agents to abduct new airbenders in her city and conscript them into an airbending army. They were kept underground in the Earth Queen's Temple and underwent a strict training regimen, which included being forced to strike one another as well as to defend themselves from earth projectiles. Any airbender that acted out of line was sent to solitary confinement, otherwise known as 'The Hole'. Desertion of the army was a crime punishable by death, a sentence not even children were exempt from."
    },
    {
      "body": "The city soon fell into anarchy after Hou-Ting was assassinated by ${link_0}.",
      "links": [
        {
          "body": "Zaheer",
          "key": "${link_0}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        }
      ],
      "text": "The city soon fell into anarchy after Hou-Ting was assassinated by Zaheer."
    },
    {
      "body": "${link_0} is known for its unconventional judicial system and barbaric style of execution. The sole government leader of the village, the mayor, has complete control over the entire judicial system. He or she is allowed to bend the laws to his or her preference and deliver all case verdicts.",
      "links": [
        {
          "body": "Chin Village",
          "key": "${link_0}",
          "target": {
            "href": "Chin_Village",
            "page": "Chin_Village"
          }
        }
      ],
      "text": "Chin Village is known for its unconventional judicial system and barbaric style of execution. The sole government leader of the village, the mayor, has complete control over the entire judicial system. He or she is allowed to bend the laws to his or her preference and deliver all case verdicts."
    },
    {
      "body": "${link_0} was the Mayor of ${link_1}.",
      "links": [
        {
          "body": "Tong",
          "key": "${link_0}",
          "target": {
            "href": "Tong",
            "page": "Tong"
          }
        },
        {
          "body": "Chin Village",
          "key": "${link_1}",
          "target": {
            "href": "Chin_Village",
            "page": "Chin_Village"
          }
        }
      ],
      "text": "Tong was the Mayor of Chin Village."
    },
    {
      "body": "${link_0} is used in the village, although only while waiting for a trial to begin. Several prisoners can be fit into a single jail cell, most of which are located outdoors. If a criminal is found guilty, execution is almost always employed. However, prisoners are not allowed to defend themselves and cannot use defense lawyers or evidence in their trials. Public execution in Chin Village is done with the ${link_1}. At the end of a trial, the wheel is spun at an amphitheater to determine what type of punishment the criminal will receive. Different portions of the wheel have different types of punishment depicted on them, most of which are harsh and deadly. The punishments range from being boiled alive to participating in community service.",
      "links": [
        {
          "body": "Imprisonment",
          "key": "${link_0}",
          "target": {
            "href": "Chin_Village_prison",
            "page": "Chin_Village_prison"
          }
        },
        {
          "body": "Wheel of Punishment",
          "key": "${link_1}",
          "target": {
            "href": "Wheel_of_Punishment",
            "page": "Wheel_of_Punishment"
          }
        }
      ],
      "text": "Imprisonment is used in the village, although only while waiting for a trial to begin. Several prisoners can be fit into a single jail cell, most of which are located outdoors. If a criminal is found guilty, execution is almost always employed. However, prisoners are not allowed to defend themselves and cannot use defense lawyers or evidence in their trials. Public execution in Chin Village is done with the Wheel of Punishment. At the end of a trial, the wheel is spun at an amphitheater to determine what type of punishment the criminal will receive. Different portions of the wheel have different types of punishment depicted on them, most of which are harsh and deadly. The punishments range from being boiled alive to participating in community service."
    },
    {
      "body": "The only known law in Chin Village is the prohibition of murder and use of foreign currency. This last rule, however, is not always applied; when ${link_0} first paid money in Water Tribe currency, they were not panned, but were detained the second time they did so.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "The only known law in Chin Village is the prohibition of murder and use of foreign currency. This last rule, however, is not always applied; when Team Avatar first paid money in Water Tribe currency, they were not panned, but were detained the second time they did so."
    },
    {
      "body": "Despite being located in Earth Kingdom territory, the ${link_0} was ${link_1} by the ${link_2} for much of the later stages of the Hundred Year War. From 94 AG to 100 AG, ${link_3} controlled the village's judicial system. Earth Kingdom natives did not play a role in the village's politics, and were more often than not belittled by firebenders. Occasionally, natives reported unseen crime to the Fire Nation.",
      "links": [
        {
          "body": "mining village",
          "key": "${link_0}",
          "target": {
            "href": "Mining_village",
            "page": "Mining_village"
          }
        },
        {
          "body": "governed",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_colonies",
            "page": "Fire_Nation_colonies"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "firebenders",
          "key": "${link_3}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Despite being located in Earth Kingdom territory, the mining village was governed by the Fire Nation for much of the later stages of the Hundred Year War. From 94 AG to 100 AG, firebenders controlled the village's judicial system. Earth Kingdom natives did not play a role in the village's politics, and were more often than not belittled by firebenders. Occasionally, natives reported unseen crime to the Fire Nation."
    },
    {
      "body": "A ${link_0} used his ${link_1} to intimidate ${link_2}.",
      "links": [
        {
          "body": "tax collector",
          "key": "${link_0}",
          "target": {
            "href": "Tax_collector",
            "page": "Tax_collector"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Haru's mother",
          "key": "${link_2}",
          "target": {
            "href": "Haru%27s_mother",
            "page": "Haru%27s_mother"
          }
        }
      ],
      "text": "A tax collector used his firebending to intimidate Haru's mother."
    },
    {
      "body": "A notable law in the village was the restriction on ${link_0} during the Fire Nation's reign. As a safety precaution against rebelling natives, earthbending had been declared illegal by official authorities. When caught in the act, earthbenders were immediately arrested and later brought to an offshore ${link_1} by boat. Here, there was no earth they could use to bend and escape. However, after Team Avatar's intervention in 99 AG, the prisoners escaped the rig.",
      "links": [
        {
          "body": "earthbending",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "prison rig",
          "key": "${link_1}",
          "target": {
            "href": "Prison_rig",
            "page": "Prison_rig"
          }
        }
      ],
      "text": "A notable law in the village was the restriction on earthbending during the Fire Nation's reign. As a safety precaution against rebelling natives, earthbending had been declared illegal by official authorities. When caught in the act, earthbenders were immediately arrested and later brought to an offshore prison rig by boat. Here, there was no earth they could use to bend and escape. However, after Team Avatar's intervention in 99 AG, the prisoners escaped the rig."
    },
    {
      "body": "Another rule required natives to pay taxes to the Fire Nation. If any refused to do so, ${link_0} retaliated with firebending attacks.",
      "links": [
        {
          "body": "tax collectors",
          "key": "${link_0}",
          "target": {
            "href": "Tax_collector",
            "page": "Tax_collector"
          }
        }
      ],
      "text": "Another rule required natives to pay taxes to the Fire Nation. If any refused to do so, tax collectors retaliated with firebending attacks."
    },
    {
      "body": "The unnaturally comfortable holding cells in the ${link_0} feature plush beds.",
      "links": [
        {
          "body": "Omashu Royal Palace",
          "key": "${link_0}",
          "target": {
            "href": "Omashu_Royal_Palace",
            "page": "Omashu_Royal_Palace"
          }
        }
      ],
      "text": "The unnaturally comfortable holding cells in the Omashu Royal Palace feature plush beds."
    },
    {
      "body": "The highest position in ${link_0}'s judicial system is the ${link_1}. Boasting unchallenged authority throughout the city, the king holds control over much of the city's systems of law enforcement. He decides the rules of the city and is in charge of the police force as well as commanding the city's military defenders. Omashu is not known to hold trials; instead, criminals are brought before the king in his ${link_2}, where punishment is determined by officials. Since there are no trials, the arrested are usually imprisoned while the king approaches a final verdict. Being part of the palace, the jail cells are surprisingly well-decorated, capacious, clean, nicely refurbished and comfortable. They have several beds, tables, rugs, chairs, and other furniture that allow them to accommodate multiple prisoners at a time. It was noted that there was once a \"bad chamber\", but it was newly refurbished.",
      "links": [
        {
          "body": "Omashu",
          "key": "${link_0}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "king",
          "key": "${link_1}",
          "target": {
            "href": "King_of_Omashu",
            "page": "King_of_Omashu"
          }
        },
        {
          "body": "palace",
          "key": "${link_2}",
          "target": {
            "href": "Omashu_Royal_Palace",
            "page": "Omashu_Royal_Palace"
          }
        }
      ],
      "text": "The highest position in Omashu's judicial system is the king. Boasting unchallenged authority throughout the city, the king holds control over much of the city's systems of law enforcement. He decides the rules of the city and is in charge of the police force as well as commanding the city's military defenders. Omashu is not known to hold trials; instead, criminals are brought before the king in his palace, where punishment is determined by officials. Since there are no trials, the arrested are usually imprisoned while the king approaches a final verdict. Being part of the palace, the jail cells are surprisingly well-decorated, capacious, clean, nicely refurbished and comfortable. They have several beds, tables, rugs, chairs, and other furniture that allow them to accommodate multiple prisoners at a time. It was noted that there was once a \"bad chamber\", but it was newly refurbished."
    },
    {
      "body": "Omashu's single known law refers to the protection of public and private property, including the infrastructure of the city's elaborate ${link_0}. Causing damage to any type of property is strictly forbidden and considered a severe offense. When Team Avatar committed this crime, Aang, was required to complete three tricky challenges for ${link_1}, the city's reigning monarch, or his friends would have become consumed by self-growing ${link_2}.",
      "links": [
        {
          "body": "delivery system",
          "key": "${link_0}",
          "target": {
            "href": "Omashu_delivery_system",
            "page": "Omashu_delivery_system"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "jennamite",
          "key": "${link_2}",
          "target": {
            "href": "Jennamite",
            "page": "Jennamite"
          }
        }
      ],
      "text": "Omashu's single known law refers to the protection of public and private property, including the infrastructure of the city's elaborate delivery system. Causing damage to any type of property is strictly forbidden and considered a severe offense. When Team Avatar committed this crime, Aang, was required to complete three tricky challenges for Bumi, the city's reigning monarch, or his friends would have become consumed by self-growing jennamite."
    },
    {
      "body": "${link_0} ${link_1} gambled while slacking off.",
      "links": [
        {
          "body": "Plains village",
          "key": "${link_0}",
          "target": {
            "href": "Plains_village",
            "page": "Plains_village"
          }
        },
        {
          "body": "soldiers",
          "key": "${link_1}",
          "target": {
            "href": "Military_of_the_Earth_Kingdom",
            "page": "Military_of_the_Earth_Kingdom"
          }
        }
      ],
      "text": "Plains village soldiers gambled while slacking off."
    },
    {
      "body": "During the Hundred Year War, the village was protected from crime by a small battalion of ${link_0}. The soldiers, however, were noted by the villagers as being very corrupt and ineffective in doing their job. With no laws restraining them in their duty, they were free to do whatever they desire. The soldiers often misused this ability, stealing food and supplies from villagers to use for their own purposes.",
      "links": [
        {
          "body": "Earth Kingdom soldiers",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Earth_Kingdom",
            "page": "Military_of_the_Earth_Kingdom"
          }
        }
      ],
      "text": "During the Hundred Year War, the village was protected from crime by a small battalion of Earth Kingdom soldiers. The soldiers, however, were noted by the villagers as being very corrupt and ineffective in doing their job. With no laws restraining them in their duty, they were free to do whatever they desire. The soldiers often misused this ability, stealing food and supplies from villagers to use for their own purposes."
    },
    {
      "body": "Due to Zaofu's autonomy, the city has its own judicial system that is centered around ${link_0} and the law enforcement of the security team. Truth seers such as Aiwei made it possible for there to be almost no lies in Zaofu. Suspects are generally questioned by a truth seer until they are proven to be lying, whereupon they are arrested. One of the heaviest crimes in the city is to betray the Metal Clan and the matriarch will go through great lengths to see the offender brought to justice. Zaofu's security team acts as police as well as first line of defense to the city. The guards can be earthbenders, metalbenders, and firebenders, who generally wear metal chest armor with shoulder pads, forearm guards as well as helmets. Metalbending guards also employ metal cables extending through their forearm guards, which can be lengthened or retracted through metalbending.",
      "links": [
        {
          "body": "truth seeing",
          "key": "${link_0}",
          "target": {
            "href": "Seismic_sense#Lie_detection",
            "page": "Seismic_sense"
          }
        }
      ],
      "text": "Due to Zaofu's autonomy, the city has its own judicial system that is centered around truth seeing and the law enforcement of the security team. Truth seers such as Aiwei made it possible for there to be almost no lies in Zaofu. Suspects are generally questioned by a truth seer until they are proven to be lying, whereupon they are arrested. One of the heaviest crimes in the city is to betray the Metal Clan and the matriarch will go through great lengths to see the offender brought to justice. Zaofu's security team acts as police as well as first line of defense to the city. The guards can be earthbenders, metalbenders, and firebenders, who generally wear metal chest armor with shoulder pads, forearm guards as well as helmets. Metalbending guards also employ metal cables extending through their forearm guards, which can be lengthened or retracted through metalbending."
    },
    {
      "body": "After Kuvira was appointed interim President of the Earth Kingdom in 171 AG and later when she dissolved the Earth Kingdom in favor of an Earth Empire under her rule, laws were changed significantly in many areas, most notably the treatment of citizens of non-Earth Kingdom ancestry: they were arrested and detained in facilities dubbed \"reeducation camps\", along with anyone who dissented.",
      "links": [],
      "text": "After Kuvira was appointed interim President of the Earth Kingdom in 171 AG and later when she dissolved the Earth Kingdom in favor of an Earth Empire under her rule, laws were changed significantly in many areas, most notably the treatment of citizens of non-Earth Kingdom ancestry: they were arrested and detained in facilities dubbed \"reeducation camps\", along with anyone who dissented."
    },
    {
      "body": "Kuvira's power was unchecked withing the Earth Empire, and treason was met with severe consequences, with even a slight hesitance at obeying her orders carrying the threat of detention. Martial law was imposed in many states, and the inhabitants were forced to mine the resources necessary to fuel Kuvira's war machine. Though the city-states were permitted to keep their original leaders if they joined the Empire willingly, those who were forcibly annexed were imprisoned.",
      "links": [],
      "text": "Kuvira's power was unchecked withing the Earth Empire, and treason was met with severe consequences, with even a slight hesitance at obeying her orders carrying the threat of detention. Martial law was imposed in many states, and the inhabitants were forced to mine the resources necessary to fuel Kuvira's war machine. Though the city-states were permitted to keep their original leaders if they joined the Empire willingly, those who were forcibly annexed were imprisoned."
    },
    {
      "body": "Although there are many stereotypes, as made evident by Sokka, that the Fire Nation executed criminals publicly and had a corrupt judicial system, it has been shown that the people there incorporate reasonable laws and punishments. The ${link_0} acted as law enforcement within the nation and its ${link_1}.",
      "links": [
        {
          "body": "Fire Nation Army",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "Fire Nation colonies",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_colonies",
            "page": "Fire_Nation_colonies"
          }
        }
      ],
      "text": "Although there are many stereotypes, as made evident by Sokka, that the Fire Nation executed criminals publicly and had a corrupt judicial system, it has been shown that the people there incorporate reasonable laws and punishments. The Fire Nation Army acted as law enforcement within the nation and its Fire Nation colonies."
    },
    {
      "body": "${link_0} was transferred to the ${link_1} for being the leader of the ${link_2}.",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_1}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_2}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        }
      ],
      "text": "Suki was transferred to the Boiling Rock for being the leader of the Kyoshi Warriors."
    },
    {
      "body": "During the Hundred Year War, the Fire Nation accumulated many prisoners of war. It appears that leaders of Fire Nation resistance programs during the War, such as ${link_0}, were imprisoned at the high security prison known as the ${link_1}, as were other dangerous criminals. Most every respectable Fire Nation prison contained an interrogation room that could be used to strike fear into the prisoners, as was the case at the Boiling Rock. Other prisoners of war were typically sent to specialized prisons where they could not bend and had little chance of escape. For example, ${link_2} and his fellow earthbenders were taken aboard a ship made of metal with no obvious source of earth. ${link_3}, on the other hand, was sent to ${link_4} specifically made and regulated to restrict waterbenders. Domestic prisoners of war, including ${link_5} and Ozai, were usually sent to ${link_6}.",
      "links": [
        {
          "body": "Hakoda",
          "key": "${link_0}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_1}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "Tyro",
          "key": "${link_2}",
          "target": {
            "href": "Tyro",
            "page": "Tyro"
          }
        },
        {
          "body": "Hama",
          "key": "${link_3}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "a prison",
          "key": "${link_4}",
          "target": {
            "href": "Waterbender_prison",
            "page": "Waterbender_prison"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_5}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "a prison near the Fire Nation's capital",
          "key": "${link_6}",
          "target": {
            "href": "Capital_City_Prison",
            "page": "Capital_City_Prison"
          }
        }
      ],
      "text": "During the Hundred Year War, the Fire Nation accumulated many prisoners of war. It appears that leaders of Fire Nation resistance programs during the War, such as Hakoda, were imprisoned at the high security prison known as the Boiling Rock, as were other dangerous criminals. Most every respectable Fire Nation prison contained an interrogation room that could be used to strike fear into the prisoners, as was the case at the Boiling Rock. Other prisoners of war were typically sent to specialized prisons where they could not bend and had little chance of escape. For example, Tyro and his fellow earthbenders were taken aboard a ship made of metal with no obvious source of earth. Hama, on the other hand, was sent to a prison specifically made and regulated to restrict waterbenders. Domestic prisoners of war, including Iroh and Ozai, were usually sent to a prison near the Fire Nation's capital."
    },
    {
      "body": "Prior to the creation of a presidential government in 171 AG, laws in the nation were enacted by the ${link_0}, which consisted of one representative from each nation. The Water Tribe, however, had two representatives, one from each respective tribal division. One member of the Council acted as chairman. In early times, the Council chairman appeared as judge and jury for court cases, such as the ${link_1} of ${link_2}, in which Chairman Sokka acted as a judge.",
      "links": [
        {
          "body": "United Republic Council",
          "key": "${link_0}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "trial",
          "key": "${link_1}",
          "target": {
            "href": "Yakone%27s_trial",
            "page": "Yakone%27s_trial"
          }
        },
        {
          "body": "Yakone",
          "key": "${link_2}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        }
      ],
      "text": "Prior to the creation of a presidential government in 171 AG, laws in the nation were enacted by the United Republic Council, which consisted of one representative from each nation. The Water Tribe, however, had two representatives, one from each respective tribal division. One member of the Council acted as chairman. In early times, the Council chairman appeared as judge and jury for court cases, such as the trial of Yakone, in which Chairman Sokka acted as a judge."
    },
    {
      "body": "${link_0} ${link_1} patrol the skies of ${link_2}.",
      "links": [
        {
          "body": "Metalbending Police Force",
          "key": "${link_0}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "airships",
          "key": "${link_1}",
          "target": {
            "href": "Police_airship",
            "page": "Police_airship"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "text": "Metalbending Police Force airships patrol the skies of Republic City."
    },
    {
      "body": "The capital of the ${link_0}, Republic City, has a definitive system of law enforcement. In public, malfeasance appears to be contained by officials who are stationed throughout numerous areas of the metropolis. These officials enforce laws enacted by the government. For example, an official stationed in the ${link_1} attempted to reprimand Avatar ${link_2} for fishing on park grounds.",
      "links": [
        {
          "body": "United Republic of Nations",
          "key": "${link_0}",
          "target": {
            "href": "United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        },
        {
          "body": "city's park",
          "key": "${link_1}",
          "target": {
            "href": "Avatar_Korra_Park",
            "page": "Avatar_Korra_Park"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "The capital of the United Republic of Nations, Republic City, has a definitive system of law enforcement. In public, malfeasance appears to be contained by officials who are stationed throughout numerous areas of the metropolis. These officials enforce laws enacted by the government. For example, an official stationed in the city's park attempted to reprimand Avatar Korra for fishing on park grounds."
    },
    {
      "body": "One major institution of Republic City's judicial branch is the ${link_0}. The title of ${link_1} is given to the highest-ranking member of the force. The chief takes on the job of interrogation and determines whether or not an accused malefactor should be imprisoned for his or her actions. In extreme circumstances, the chief is also present at court hearings for dangerous criminals.",
      "links": [
        {
          "body": "Metalbending Police Force",
          "key": "${link_0}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "Chief of Police",
          "key": "${link_1}",
          "target": {
            "href": "Chief_of_Police",
            "page": "Chief_of_Police"
          }
        }
      ],
      "text": "One major institution of Republic City's judicial branch is the Metalbending Police Force. The title of Chief of Police is given to the highest-ranking member of the force. The chief takes on the job of interrogation and determines whether or not an accused malefactor should be imprisoned for his or her actions. In extreme circumstances, the chief is also present at court hearings for dangerous criminals."
    },
    {
      "body": "The ${link_0} is ${link_1} in ${link_2}.",
      "links": [
        {
          "body": "Triple Threat Triad",
          "key": "${link_0}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "headquartered",
          "key": "${link_1}",
          "target": {
            "href": "Triple_Threat_Triad_headquarters",
            "page": "Triple_Threat_Triad_headquarters"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "text": "The Triple Threat Triad is headquartered in Republic City."
    },
    {
      "body": "${link_0} are infamous with the citizens of ${link_1}. These organizations, all of which only permit ${link_2} to enter their groups, use their abilities to extort Republic City's denizens, especially those who are unable to bend the elements. The ${link_3}, for example, is made up of water, earth, and firebenders who intimidate nonbending citizens of Republic City to force their will upon them. The Triad operates from its ${link_4}, which serves as its main base of operations. The criminal activity of these groups has made them strong targets by the local police. Furthermore, these triads engage in turf wars, and have been known to recruit benders to participate in order to gain an advantage over other gangs.",
      "links": [
        {
          "body": "Underground triads",
          "key": "${link_0}",
          "target": {
            "href": "Bending_triads_(disambiguation)",
            "page": "Bending_triads_(disambiguation)"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "benders",
          "key": "${link_2}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Triple Threat Triad",
          "key": "${link_3}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "headquarters",
          "key": "${link_4}",
          "target": {
            "href": "Triple_Threat_Triad_headquarters",
            "page": "Triple_Threat_Triad_headquarters"
          }
        }
      ],
      "text": "Underground triads are infamous with the citizens of Republic City. These organizations, all of which only permit benders to enter their groups, use their abilities to extort Republic City's denizens, especially those who are unable to bend the elements. The Triple Threat Triad, for example, is made up of water, earth, and firebenders who intimidate nonbending citizens of Republic City to force their will upon them. The Triad operates from its headquarters, which serves as its main base of operations. The criminal activity of these groups has made them strong targets by the local police. Furthermore, these triads engage in turf wars, and have been known to recruit benders to participate in order to gain an advantage over other gangs."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Law_and_order_in_the_World_of_Avatar",
    "file": "avatar.wikia.com/wiki/Law_and_order_in_the_World_of_Avatar.html",
    "page": "Law_and_order_in_the_World_of_Avatar",
    "title": "Law and order in the World of Avatar"
  }
}