{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Lin is a direct, uncompromising, strict, and occasionally hot-headed woman. As the ${link_2} of the ${link_3}, she regards the city's welfare as her top priority, and her goal is to end all criminal activity in ${link_4}.",
      "links": [
        {
          "body": "Lin Beifong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Chief",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Chief_of_Police",
            "page": "Chief_of_Police"
          }
        },
        {
          "body": "Metalbending Police Force",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships"
      ],
      "text": "This page is comprised of Lin Beifong's relationships with other characters in the World of Avatar. Lin is a direct, uncompromising, strict, and occasionally hot-headed woman. As the Chief of the Metalbending Police Force, she regards the city's welfare as her top priority, and her goal is to end all criminal activity in Republic City."
    },
    {
      "body": "Lin is the oldest child of ${link_0} and inherited her mother's ${link_1} prowess, receiving training in all the various skills and techniques, including ${link_2} and ${link_3}. Growing up, Lin was given the freedom to make her own choices, as Toph wanted to give her daughter the opportunity to find her own path. Ultimately, however, Lin became more interested in simply getting her mother's attention, though grew cold over not knowing about her father and came to believe that while her mother claimed she and her half-sister ${link_4} were a blessing, she never meant it and was unhappy with how they turned out. Lin carried on her mother's legacy by becoming the Chief of the Metalbending Police Force, but came to regret how she based her entire life and career solely on the basis of winning her mother's approval, which she did not receive. She later implored her niece ${link_5} to make decisions based on what was best for her and not to make the same mistakes she had. Despite their tumultuous relationship, Toph would later express to Suyin after their reconciliation years later that she was proud of Lin and her accomplishments.",
      "links": [
        {
          "body": "Toph Beifong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "metalbending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "seismic sense",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Seismic_sense",
            "page": "Seismic_sense"
          }
        },
        {
          "body": "Suyin",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "Opal",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Opal",
            "page": "Opal"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Relatives",
        "Toph Beifong"
      ],
      "text": "Lin is the oldest child of Toph Beifong and inherited her mother's earthbending prowess, receiving training in all the various skills and techniques, including metalbending and seismic sense. Growing up, Lin was given the freedom to make her own choices, as Toph wanted to give her daughter the opportunity to find her own path. Ultimately, however, Lin became more interested in simply getting her mother's attention, though grew cold over not knowing about her father and came to believe that while her mother claimed she and her half-sister Suyin were a blessing, she never meant it and was unhappy with how they turned out. Lin carried on her mother's legacy by becoming the Chief of the Metalbending Police Force, but came to regret how she based her entire life and career solely on the basis of winning her mother's approval, which she did not receive. She later implored her niece Opal to make decisions based on what was best for her and not to make the same mistakes she had. Despite their tumultuous relationship, Toph would later express to Suyin after their reconciliation years later that she was proud of Lin and her accomplishments."
    },
    {
      "body": "Lin and Toph share certain similarities, such as a tough and straightforward attitude and a dislike for childish antics, such as Bolin's endless talking. Toph also did not let ${link_0}'s status as the ${link_1} affect her judgment, just as Lin refused to compromise and give ${link_2} special treatment when she was arrested for damages to the city. A notable difference, however, is that Toph was quite relaxed about rules, albeit only during her childhood, whereas Lin rigidly follows and enforces them. However, Lin has shown that she is willing to break them when the people she cares about are in jeopardy.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Relatives",
        "Toph Beifong"
      ],
      "text": "Lin and Toph share certain similarities, such as a tough and straightforward attitude and a dislike for childish antics, such as Bolin's endless talking. Toph also did not let Aang's status as the Avatar affect her judgment, just as Lin refused to compromise and give Korra special treatment when she was arrested for damages to the city. A notable difference, however, is that Toph was quite relaxed about rules, albeit only during her childhood, whereas Lin rigidly follows and enforces them. However, Lin has shown that she is willing to break them when the people she cares about are in jeopardy."
    },
    {
      "body": "Despite their similarities, Lin and Toph's relationship was strained, as Toph's refusal to discuss anything related to Lin's father weighed on her, which eventually led to them becoming estranged in 154 AG. After making amends with Suyin in 171 AG, Lin considered reaching out to Toph in order to work things out with her as well. However, when mother and daughter reunited by chance in 174 AG, Lin only grew more resentful of Toph, who casually revealed the identity of her father to Bolin. When Toph confronted her about her anger, Lin unloaded on her mother that she made her furious without even knowing or caring about the reason. Although she was still willing to work with her mother to save their family, she declared to be done with her afterward, a decision Toph solemnly accepted if that was what Lin desired. After she was saved by Toph, Lin apologized to her mother for her harsh words. Toph in turn admitted to not being the best parent, though was proud of how her children turned out. Saying that it was enough for her to know that Lin did not hate her, Lin accepted Toph's words and gave her a small hug.",
      "links": [],
      "section": [
        "Lin Beifong's relationships",
        "Relatives",
        "Toph Beifong"
      ],
      "text": "Despite their similarities, Lin and Toph's relationship was strained, as Toph's refusal to discuss anything related to Lin's father weighed on her, which eventually led to them becoming estranged in 154 AG. After making amends with Suyin in 171 AG, Lin considered reaching out to Toph in order to work things out with her as well. However, when mother and daughter reunited by chance in 174 AG, Lin only grew more resentful of Toph, who casually revealed the identity of her father to Bolin. When Toph confronted her about her anger, Lin unloaded on her mother that she made her furious without even knowing or caring about the reason. Although she was still willing to work with her mother to save their family, she declared to be done with her afterward, a decision Toph solemnly accepted if that was what Lin desired. After she was saved by Toph, Lin apologized to her mother for her harsh words. Toph in turn admitted to not being the best parent, though was proud of how her children turned out. Saying that it was enough for her to know that Lin did not hate her, Lin accepted Toph's words and gave her a small hug."
    },
    {
      "body": "Ever since she was a young woman, Lin had a rather hostile relationship with her half-sister, Suyin. While their mother was raised in a highly strict environment, Toph gave her daughters more freedom than she had as a child. While Lin was a stickler to rules, Suyin was more rebellious. Lin expressed disappointment in Suyin's association with delinquents and believed she was wasting her immense talent and potential, while also resentful of how Suyin always seemed to escape the consequences of her actions. Suyin in turn believed Lin's strict nature drove others away and the reason why she was always alone. Sometime before 142 AG, Lin and Suyin had a falling out, after which Suyin moved away and established the city of ${link_0}. Suyin tried to reach out to Lin, however, Lin never responded to her. Suyin had stated she already gave up any chance of them reconciling. As far as Lin was concerned, Suyin was the rebellious teenager who broke their family apart. Their hostile relationship reignited when Lin and Team Avatar arrived in Zaofu after there were reports of a new airbender. Despite Suyin's kindness and declaration that she was a new person, Lin remained bitter and, after undergoing acupuncture sessions to relieve her of her stress from the past and present, Lin dueled Suyin after the two argued over Suyin still being a rebel and Lin maintaining her bitterness. The duel was quickly broken up by Opal, and Lin collapsed with exhaustion. After sleeping for sixteen hours the result of the acupuncture and finally being able to vent all of her pent up frustration Lin awakened refreshed and anew, letting go of her resentment to finally reconcile with her sister and forming a relationship with her estranged family members of the Metal Clan like her niece Opal.",
      "links": [
        {
          "body": "Zaofu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zaofu",
            "page": "Zaofu"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Relatives",
        "Suyin Beifong"
      ],
      "text": "Ever since she was a young woman, Lin had a rather hostile relationship with her half-sister, Suyin. While their mother was raised in a highly strict environment, Toph gave her daughters more freedom than she had as a child. While Lin was a stickler to rules, Suyin was more rebellious. Lin expressed disappointment in Suyin's association with delinquents and believed she was wasting her immense talent and potential, while also resentful of how Suyin always seemed to escape the consequences of her actions. Suyin in turn believed Lin's strict nature drove others away and the reason why she was always alone. Sometime before 142 AG, Lin and Suyin had a falling out, after which Suyin moved away and established the city of Zaofu. Suyin tried to reach out to Lin, however, Lin never responded to her. Suyin had stated she already gave up any chance of them reconciling. As far as Lin was concerned, Suyin was the rebellious teenager who broke their family apart. Their hostile relationship reignited when Lin and Team Avatar arrived in Zaofu after there were reports of a new airbender. Despite Suyin's kindness and declaration that she was a new person, Lin remained bitter and, after undergoing acupuncture sessions to relieve her of her stress from the past and present, Lin dueled Suyin after the two argued over Suyin still being a rebel and Lin maintaining her bitterness. The duel was quickly broken up by Opal, and Lin collapsed with exhaustion. After sleeping for sixteen hours the result of the acupuncture and finally being able to vent all of her pent up frustration Lin awakened refreshed and anew, letting go of her resentment to finally reconcile with her sister and forming a relationship with her estranged family members of the Metal Clan like her niece Opal."
    },
    {
      "body": "Lin and Suyin's relationship improved immensely after their reconciliation. When Suyin feared for Opal's safety at the Northern Air Temple due to the Red Lotus' approach, Lin was quick to place a comforting arm around her half-sister and ensure her that everything would work out. The sisters were able to work together and when ${link_0} managed to corner them during their battle atop ${link_1}'s Peak, Lin covered Suyin's head, protecting her against the falling rocks, and told her she loved her, before drawing the ${link_2}'s fire away from her half-sister, giving Suyin the opportunity to attack an unguarded P'Li.",
      "links": [
        {
          "body": "P'Li",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/P%27Li",
            "page": "P%27Li"
          }
        },
        {
          "body": "Laghima",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Laghima",
            "page": "Laghima"
          }
        },
        {
          "body": "combustionbender",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Specialized_bending_techniques#Combustionbending",
            "page": "Specialized_bending_techniques"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Relatives",
        "Suyin Beifong"
      ],
      "text": "Lin and Suyin's relationship improved immensely after their reconciliation. When Suyin feared for Opal's safety at the Northern Air Temple due to the Red Lotus' approach, Lin was quick to place a comforting arm around her half-sister and ensure her that everything would work out. The sisters were able to work together and when P'Li managed to corner them during their battle atop Laghima's Peak, Lin covered Suyin's head, protecting her against the falling rocks, and told her she loved her, before drawing the combustionbender's fire away from her half-sister, giving Suyin the opportunity to attack an unguarded P'Li."
    },
    {
      "body": "As Lin held a grudge with Suyin due to their history together, she gave her niece the cold shoulders the same way how she did it to her half-sister. She only patched things up with Opal after she fainted from the tussle with Suyin which was caused by the acupuncture that brought back bad memories she had with Suyin. However, after finally letting go of the bulk of her anger and recovering from her exhaustion, Lin took initiative and approached Opal, encouraging her niece to choose her own path, acknowledging that she was a bright young woman who showed huge potential as an airbender, prompting the two to end their rift with a warm embrace.",
      "links": [],
      "section": [
        "Lin Beifong's relationships",
        "Relatives",
        "Opal"
      ],
      "text": "As Lin held a grudge with Suyin due to their history together, she gave her niece the cold shoulders the same way how she did it to her half-sister. She only patched things up with Opal after she fainted from the tussle with Suyin which was caused by the acupuncture that brought back bad memories she had with Suyin. However, after finally letting go of the bulk of her anger and recovering from her exhaustion, Lin took initiative and approached Opal, encouraging her niece to choose her own path, acknowledging that she was a bright young woman who showed huge potential as an airbender, prompting the two to end their rift with a warm embrace."
    },
    {
      "body": "By 174 AG, Lin's trust in Opal had grown to the point where she was willing to take the young woman along with her on a dangerous, unsanctioned mission to save the rest of their family.",
      "links": [],
      "section": [
        "Lin Beifong's relationships",
        "Relatives",
        "Opal"
      ],
      "text": "By 174 AG, Lin's trust in Opal had grown to the point where she was willing to take the young woman along with her on a dangerous, unsanctioned mission to save the rest of their family."
    },
    {
      "body": "Lin and ${link_0} seem to have a distant, yet professional relationship. They interact contentiously, but she seems to warm up to him at times. She is not so inflexible or unreasonable as to refuse Tenzin's request to let Korra off with a warning at their first meeting. As the past Avatar's son and Toph's daughter, Tenzin and Lin have known each other since they were children. Eventually, they had a romantic relationship, but it began to falter when Tenzin realized they had \"different goals\", according to him; one of which was Lin's lack of interest toward having children unlike Tenzin. Pema confessed her love to Tenzin while he was still with Lin, resulting in his decision to break off his relationship with the earthbender. Lin did not take the breakup well, going on a rampage that caused significant damage to Air Temple Island and trying to have Pema thrown in jail. Ever since, their own priorities in life continued to draw them apart, causing their interactions to become somewhat strained. As noted by Korra, Lin appears to still have some unresolved feelings for Tenzin. On the night of the ${link_1} match, Tenzin requested they call a truce, to which Lin vaguely brought up their old relation and agreed. When they were both caught off guard during the match and stunned by Equalists, Lin's first action upon recovering was to check on Tenzin. When the Equalists invaded Air Temple Island, Lin fought them off to protect Tenzin's family. They left the island on ${link_2} but were soon pursued by Equalist airships. She saved the airbenders by using metalbending to destroy one of the airships. However, she was defeated by surrounding Equalists and later lost her bending to Amon.",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Pro-bending Championship Tournament",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending#Pro-bending_Tournament",
            "page": "Pro-bending"
          }
        },
        {
          "body": "Oogi",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Oogi",
            "page": "Oogi"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Love interest",
        "Tenzin"
      ],
      "text": "Lin and Tenzin seem to have a distant, yet professional relationship. They interact contentiously, but she seems to warm up to him at times. She is not so inflexible or unreasonable as to refuse Tenzin's request to let Korra off with a warning at their first meeting. As the past Avatar's son and Toph's daughter, Tenzin and Lin have known each other since they were children. Eventually, they had a romantic relationship, but it began to falter when Tenzin realized they had \"different goals\", according to him; one of which was Lin's lack of interest toward having children unlike Tenzin. Pema confessed her love to Tenzin while he was still with Lin, resulting in his decision to break off his relationship with the earthbender. Lin did not take the breakup well, going on a rampage that caused significant damage to Air Temple Island and trying to have Pema thrown in jail. Ever since, their own priorities in life continued to draw them apart, causing their interactions to become somewhat strained. As noted by Korra, Lin appears to still have some unresolved feelings for Tenzin. On the night of the Pro-bending Championship Tournament match, Tenzin requested they call a truce, to which Lin vaguely brought up their old relation and agreed. When they were both caught off guard during the match and stunned by Equalists, Lin's first action upon recovering was to check on Tenzin. When the Equalists invaded Air Temple Island, Lin fought them off to protect Tenzin's family. They left the island on Oogi but were soon pursued by Equalist airships. She saved the airbenders by using metalbending to destroy one of the airships. However, she was defeated by surrounding Equalists and later lost her bending to Amon."
    },
    {
      "body": "However, even Lin's sacrifice was not enough to save the airbenders, and they were captured and later broken free by Korra. Lin Beifong also attended to Korra's healing session with ${link_0}, however it was unsuccessful. Afterward Korra was visited by Avatar Aang, who gave her back her bending. Later, Tenzin watched as Korra restored Lin's bending, appearing shocked but proud.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Love interest",
        "Tenzin"
      ],
      "text": "However, even Lin's sacrifice was not enough to save the airbenders, and they were captured and later broken free by Korra. Lin Beifong also attended to Korra's healing session with Katara, however it was unsuccessful. Afterward Korra was visited by Avatar Aang, who gave her back her bending. Later, Tenzin watched as Korra restored Lin's bending, appearing shocked but proud."
    },
    {
      "body": "When she held the position as the city's police chief, Lin was uncompromising in her duty of stopping crime and protecting the citizens of Republic City. As such, she immediately disliked Korra when the young Avatar flagrantly destroyed public and private property, and caused a great deal of collateral damage during her battle against three members of the criminal ${link_0}, despite having assisted in their apprehension. Korra's stunt at evading arrest also did little to impress Lin, who asserted that the Avatar's style of \"vigilante justice\" had no place in her city. It was clear her opinion of the Avatar had not changed with her attendance of ${link_1}'s gala at ${link_2}, where Lin stated outright that Korra had done \"nothing to deserve\" the praise of the city.",
      "links": [
        {
          "body": "Triple Threat Triad",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "City Hall",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/City_Hall",
            "page": "City_Hall"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Allies",
        "Korra"
      ],
      "text": "When she held the position as the city's police chief, Lin was uncompromising in her duty of stopping crime and protecting the citizens of Republic City. As such, she immediately disliked Korra when the young Avatar flagrantly destroyed public and private property, and caused a great deal of collateral damage during her battle against three members of the criminal Triple Threat Triad, despite having assisted in their apprehension. Korra's stunt at evading arrest also did little to impress Lin, who asserted that the Avatar's style of \"vigilante justice\" had no place in her city. It was clear her opinion of the Avatar had not changed with her attendance of Tarrlok's gala at City Hall, where Lin stated outright that Korra had done \"nothing to deserve\" the praise of the city."
    },
    {
      "body": "When the ${link_0} arrived at City Hall to protest against the ${link_1}'s stance of appeasing ${link_2}'s request and closing down the ${link_3}, Lin agreed with the team, affirming that it was \"time the benders of this city displayed some strength and unity\" against the ${link_4} threat, much to Korra's surprise. While guarding the arena alongside her fellow metalbending officers and ${link_5}, she noted how different Korra was from Aang, stating that Korra was \"tough as nails\" compared to the previous Avatar. In turn, Tenzin stressed that Lin and Korra were similar in that regard, and would get along if Lin would give her another chance. When the Equalists attacked and Korra attempted to pursue Amon, Lin came to her aid, propelling her to the roof using her metalbending, thus allowing her to intercept the escaping Equalists. Lin was also a key combatant in the battle on the arena's rooftop against the ${link_6} and his lackeys. Korra came to the rescue of an electrocuted Lin, and the latter later used her metal cables to take down two Equalist ${link_7} that were approaching Korra.",
      "links": [
        {
          "body": "Fire Ferrets",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        },
        {
          "body": "United Republic Council",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "Amon",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Lieutenant",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "chi blockers",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Chi_blocking",
            "page": "Chi_blocking"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Allies",
        "Korra"
      ],
      "text": "When the Fire Ferrets arrived at City Hall to protest against the United Republic Council's stance of appeasing Amon's request and closing down the Pro-bending Arena, Lin agreed with the team, affirming that it was \"time the benders of this city displayed some strength and unity\" against the Equalist threat, much to Korra's surprise. While guarding the arena alongside her fellow metalbending officers and Tenzin, she noted how different Korra was from Aang, stating that Korra was \"tough as nails\" compared to the previous Avatar. In turn, Tenzin stressed that Lin and Korra were similar in that regard, and would get along if Lin would give her another chance. When the Equalists attacked and Korra attempted to pursue Amon, Lin came to her aid, propelling her to the roof using her metalbending, thus allowing her to intercept the escaping Equalists. Lin was also a key combatant in the battle on the arena's rooftop against the Lieutenant and his lackeys. Korra came to the rescue of an electrocuted Lin, and the latter later used her metal cables to take down two Equalist chi blockers that were approaching Korra."
    },
    {
      "body": "Though her goal was to leave Korra after evening the odds in order to infiltrate the Equalist ${link_0}, Lin reacted quickly to save the Avatar from falling to her death through the glass dome of the Pro-bending Arena, revealing that she was concerned for the Avatar's safety more than her duty of pursuing Amon. After witnessing how she had handled herself against the Equalists, Lin came to respect Korra and at least take her opinion into consideration. Following her capture by Amon, Lin was given a chance to keep her bending if she told Amon where Korra was. Lin refused, and Amon took her bending away. Following Korra's access of her spiritual nature, and regaining her own ${link_1} from the spirit of Aang, Korra used ${link_2} to restore Lin's own bending abilities, for which she was grateful.",
      "links": [
        {
          "body": "airship",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Equalist_airship",
            "page": "Equalist_airship"
          }
        },
        {
          "body": "bending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "energybending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Energybending",
            "page": "Energybending"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Allies",
        "Korra"
      ],
      "text": "Though her goal was to leave Korra after evening the odds in order to infiltrate the Equalist airship, Lin reacted quickly to save the Avatar from falling to her death through the glass dome of the Pro-bending Arena, revealing that she was concerned for the Avatar's safety more than her duty of pursuing Amon. After witnessing how she had handled herself against the Equalists, Lin came to respect Korra and at least take her opinion into consideration. Following her capture by Amon, Lin was given a chance to keep her bending if she told Amon where Korra was. Lin refused, and Amon took her bending away. Following Korra's access of her spiritual nature, and regaining her own bending from the spirit of Aang, Korra used energybending to restore Lin's own bending abilities, for which she was grateful."
    },
    {
      "body": "Six months later, when Korra returned to Republic City after the ${link_0} broke out, Lin sarcastically blamed her for starting it.",
      "links": [
        {
          "body": "Water Tribe Civil War",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Water_Tribe_Civil_War",
            "page": "Water_Tribe_Civil_War"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Allies",
        "Korra"
      ],
      "text": "Six months later, when Korra returned to Republic City after the Water Tribe Civil War broke out, Lin sarcastically blamed her for starting it."
    },
    {
      "body": "After Korra defeated Vaatu, Lin received word from Lord ${link_0} that ${link_1} and the ${link_2} had escaped, and ventured to Ba Sing Se to warn the group and take Korra back to Republic City. However, upon Korra's desire to rescue Ba Sing Se's airbenders instead, Lin decided to join the mission. Although she kept her distance on the outside, Lin cared deeply for Korra, constantly worrying for her well-being, though she also trusted the Avatar's judgment. When Korra was wheelchair bound during her recovery from her battle with Zaheer, Lin was sympathetic toward her, openly showing her affection by placing a comforting hand on her shoulder and telling her to hang in there, before readily helping her to ascend the stairs to the temple on Air Temple Island.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Red_Lotus",
            "page": "Red_Lotus"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Allies",
        "Korra"
      ],
      "text": "After Korra defeated Vaatu, Lin received word from Lord Zuko that Zaheer and the Red Lotus had escaped, and ventured to Ba Sing Se to warn the group and take Korra back to Republic City. However, upon Korra's desire to rescue Ba Sing Se's airbenders instead, Lin decided to join the mission. Although she kept her distance on the outside, Lin cared deeply for Korra, constantly worrying for her well-being, though she also trusted the Avatar's judgment. When Korra was wheelchair bound during her recovery from her battle with Zaheer, Lin was sympathetic toward her, openly showing her affection by placing a comforting hand on her shoulder and telling her to hang in there, before readily helping her to ascend the stairs to the temple on Air Temple Island."
    },
    {
      "body": "Lin is the daughter of Toph, the founder of the Metalbending Police Force, and so has always had a connection to the ${link_0}. Eventually, Lin joined the force and became the Chief of Police, following in her mother's footsteps. Lin only recruited the most superior metalbenders into her force. When ${link_1} became a police officer, she saw potential in him and took him under her wing. Under her tutelage, he managed to rise in the ranks and eventually became her right-hand man.",
      "links": [
        {
          "body": "law",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Law_and_order_in_the_World_of_Avatar",
            "page": "Law_and_order_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Saikhan",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Saikhan",
            "page": "Saikhan"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Allies",
        "Metalbending officers"
      ],
      "text": "Lin is the daughter of Toph, the founder of the Metalbending Police Force, and so has always had a connection to the law. Eventually, Lin joined the force and became the Chief of Police, following in her mother's footsteps. Lin only recruited the most superior metalbenders into her force. When Saikhan became a police officer, she saw potential in him and took him under her wing. Under her tutelage, he managed to rise in the ranks and eventually became her right-hand man."
    },
    {
      "body": "After several officers were captured during the fight between ${link_0} and the Metalbending Police Force, Lin stated that she was going to resign from her position as Chief of Police in order to rescue the officers \"her way\", outside of the law. She also refused to send her men into any situation she would not have gone into herself and fought fiercely alongside them on many occasions. Acts like this have earned Lin the deep respect of many of her men.",
      "links": [
        {
          "body": "Hiroshi Sato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Allies",
        "Metalbending officers"
      ],
      "text": "After several officers were captured during the fight between Hiroshi Sato and the Metalbending Police Force, Lin stated that she was going to resign from her position as Chief of Police in order to rescue the officers \"her way\", outside of the law. She also refused to send her men into any situation she would not have gone into herself and fought fiercely alongside them on many occasions. Acts like this have earned Lin the deep respect of many of her men."
    },
    {
      "body": "With Lin and Tenzin's relationship growing cold, Pema used this as an opportunity to confess her love to Tenzin, which culminated in marriage. Tenzin claimed that Lin tried to imprison Pema, but failed, implying a hostile relationship between the two women. Years later, Lin appeared to be on civil terms with Pema prior to the Equalist attack on ${link_0}, accepting the duties of helping Pema and her family, and was even visibly concerned when Pema underwent labor during the attack.",
      "links": [
        {
          "body": "Air Temple Island",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Allies",
        "Pema"
      ],
      "text": "With Lin and Tenzin's relationship growing cold, Pema used this as an opportunity to confess her love to Tenzin, which culminated in marriage. Tenzin claimed that Lin tried to imprison Pema, but failed, implying a hostile relationship between the two women. Years later, Lin appeared to be on civil terms with Pema prior to the Equalist attack on Air Temple Island, accepting the duties of helping Pema and her family, and was even visibly concerned when Pema underwent labor during the attack."
    },
    {
      "body": "Saikhan was Lin's right-hand man when she was chief, and also captain of the Metalbending Police Force. Under Lin's tutelage, he rose swiftly in rank, and because of this, he holds her in high regard. Lin trusted Saikhan to the extent where she appointed him as her successor as Chief of Police following her resignation after the ${link_0}. However, after becoming her replacement, their relationship appears to have somewhat strained due to Saikhan's apparent switch of loyalty to Tarrlok.",
      "links": [
        {
          "body": "battle at the Equalist factory",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Battle_at_the_Equalist_factory",
            "page": "Battle_at_the_Equalist_factory"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Allies",
        "Saikhan"
      ],
      "text": "Saikhan was Lin's right-hand man when she was chief, and also captain of the Metalbending Police Force. Under Lin's tutelage, he rose swiftly in rank, and because of this, he holds her in high regard. Lin trusted Saikhan to the extent where she appointed him as her successor as Chief of Police following her resignation after the battle at the Equalist factory. However, after becoming her replacement, their relationship appears to have somewhat strained due to Saikhan's apparent switch of loyalty to Tarrlok."
    },
    {
      "body": "During the investigation of Hiroshi Sato and ${link_0}, relations between Lin and ${link_1} were initially hostile, as ${link_2} was disgusted at the suspicions and allegations Lin had toward her father. Upon the discovery of the ${link_3} underneath the ${link_4}, Lin disallowed Asami, ${link_5}, and ${link_6} from entering, and ordered ${link_7} to keep an eye on them. As Lin and the others were defeated during the battle that occurred soon after, Mako, Bolin, and Asami, outsmarting Song and disobeying Lin's orders, were able to rescue Lin and the others, saving her from being imprisoned by Equalists.",
      "links": [
        {
          "body": "Future Industries",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries",
            "page": "Future_Industries"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "hidden factory",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Equalist_factory",
            "page": "Equalist_factory"
          }
        },
        {
          "body": "Sato estate",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Sato_estate",
            "page": "Sato_estate"
          }
        },
        {
          "body": "Mako",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Officer Song",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Song_(officer)",
            "page": "Song_(officer)"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Allies",
        "Team Avatar"
      ],
      "text": "During the investigation of Hiroshi Sato and Future Industries, relations between Lin and Team Avatar were initially hostile, as Asami was disgusted at the suspicions and allegations Lin had toward her father. Upon the discovery of the hidden factory underneath the Sato estate, Lin disallowed Asami, Mako, and Bolin from entering, and ordered Officer Song to keep an eye on them. As Lin and the others were defeated during the battle that occurred soon after, Mako, Bolin, and Asami, outsmarting Song and disobeying Lin's orders, were able to rescue Lin and the others, saving her from being imprisoned by Equalists."
    },
    {
      "body": "When Lin heard about Korra's kidnapping days later, her first action was to free Team Avatar from prison to aid her in her search, presumably having gained her respect after saving her in the past. She and Tenzin worked with the team throughout their search for Korra, and, despite not finding her, they found an underground Equalist facility, rescued Lin's metalbending officers, and discovered that Tarrlok was the one who kidnapped Korra. After learning this information, they returned to City Hall to confront Tarrlok, and were all subdued by his bloodbending as he made his escape. When they came to, they attempted to follow him in hopes of finding Korra, and managed to eventually find her being carried into the city by ${link_0}.",
      "links": [
        {
          "body": "Naga",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Naga",
            "page": "Naga"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Allies",
        "Team Avatar"
      ],
      "text": "When Lin heard about Korra's kidnapping days later, her first action was to free Team Avatar from prison to aid her in her search, presumably having gained her respect after saving her in the past. She and Tenzin worked with the team throughout their search for Korra, and, despite not finding her, they found an underground Equalist facility, rescued Lin's metalbending officers, and discovered that Tarrlok was the one who kidnapped Korra. After learning this information, they returned to City Hall to confront Tarrlok, and were all subdued by his bloodbending as he made his escape. When they came to, they attempted to follow him in hopes of finding Korra, and managed to eventually find her being carried into the city by Naga."
    },
    {
      "body": "Both Lin and the members of Team Avatar were present during Korra's healing session with ${link_0}, and Mako, Bolin, and Asami witnessed Korra's energybending and Lin regaining her bending abilities.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Allies",
        "Team Avatar"
      ],
      "text": "Both Lin and the members of Team Avatar were present during Korra's healing session with Katara, and Mako, Bolin, and Asami witnessed Korra's energybending and Lin regaining her bending abilities."
    },
    {
      "body": "Lin was friendly with ${link_0}, ${link_1}, and ${link_2}, despite the rocky romantic history between her and their father. While the island was under attack, Lin was protective of the children, telling them to hide inside the women's quarters during the assault. However, when she was in danger of being captured by the Lieutenant, the children came to her rescue and defeated the intruders with ${link_3}. Later, when the Equalists began pursuing Tenzin and his family, who were escaping on Oogi, Lin sacrificed herself to prevent the Equalist airships from capturing the family by launching herself onto the airships to destroy them. Although she managed to destroy one of them, she was captured and had her bending ${link_4} away by Amon. As Tenzin's family escaped the scene, Meelo acknowledged Lin as his hero.",
      "links": [
        {
          "body": "Jinora",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Ikki",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ikki",
            "page": "Ikki"
          }
        },
        {
          "body": "Meelo",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Meelo",
            "page": "Meelo"
          }
        },
        {
          "body": "airbending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "stripped",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Bloodbending#Bending_severing",
            "page": "Bloodbending"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Allies",
        "Tenzin's children"
      ],
      "text": "Lin was friendly with Jinora, Ikki, and Meelo, despite the rocky romantic history between her and their father. While the island was under attack, Lin was protective of the children, telling them to hide inside the women's quarters during the assault. However, when she was in danger of being captured by the Lieutenant, the children came to her rescue and defeated the intruders with airbending. Later, when the Equalists began pursuing Tenzin and his family, who were escaping on Oogi, Lin sacrificed herself to prevent the Equalist airships from capturing the family by launching herself onto the airships to destroy them. Although she managed to destroy one of them, she was captured and had her bending stripped away by Amon. As Tenzin's family escaped the scene, Meelo acknowledged Lin as his hero."
    },
    {
      "body": "As former Chief of Police, Lin acknowledged Amon as a threat to the safety of Republic City's citizens. When the Pro-bending Tournament was sabotaged by the Equalists, she was rendered unconscious while Amon staged his speech. When she awoke, she pursued him and aided Korra in battling the Lieutenant, as well as a few chi blockers. After the battle, she expressed regret at falling for his plan.",
      "links": [],
      "section": [
        "Lin Beifong's relationships",
        "Enemies",
        "Amon"
      ],
      "text": "As former Chief of Police, Lin acknowledged Amon as a threat to the safety of Republic City's citizens. When the Pro-bending Tournament was sabotaged by the Equalists, she was rendered unconscious while Amon staged his speech. When she awoke, she pursued him and aided Korra in battling the Lieutenant, as well as a few chi blockers. After the battle, she expressed regret at falling for his plan."
    },
    {
      "body": "When she was captured and taken to Amon himself, he ordered that she tell him of the Avatar's whereabouts; in exchange, she would be permitted to keep her bending. Lin, however, refused to reveal anything, subsequently losing her earthbending and metalbending abilities with her defiance. Following Korra's access of her spiritual nature and regaining of her own bending from Aang's spirit, the Avatar used energybending to restore Lin's bending abilities.",
      "links": [],
      "section": [
        "Lin Beifong's relationships",
        "Enemies",
        "Amon"
      ],
      "text": "When she was captured and taken to Amon himself, he ordered that she tell him of the Avatar's whereabouts; in exchange, she would be permitted to keep her bending. Lin, however, refused to reveal anything, subsequently losing her earthbending and metalbending abilities with her defiance. Following Korra's access of her spiritual nature and regaining of her own bending from Aang's spirit, the Avatar used energybending to restore Lin's bending abilities."
    },
    {
      "body": "As the United Republic Council prepared to cancel the Pro-bending Tournament Finals after Amon's threat on the arena, Chief Beifong interfered and convinced the Council to keep the arena open. She promised that the Metalbending Police Force would be able to protect the arena from any Equalist attack. Tarrlok asked Lin if she would personally accept responsibility for anything that happened during the finals, to which she agreed. Tenzin remarked that Tarrlok did not have Lin's best interest in mind, telling her that he was playing her.",
      "links": [],
      "section": [
        "Lin Beifong's relationships",
        "Enemies",
        "Tarrlok"
      ],
      "text": "As the United Republic Council prepared to cancel the Pro-bending Tournament Finals after Amon's threat on the arena, Chief Beifong interfered and convinced the Council to keep the arena open. She promised that the Metalbending Police Force would be able to protect the arena from any Equalist attack. Tarrlok asked Lin if she would personally accept responsibility for anything that happened during the finals, to which she agreed. Tenzin remarked that Tarrlok did not have Lin's best interest in mind, telling her that he was playing her."
    },
    {
      "body": "After failing to protect the Pro-bending Arena from the Equalists' attack, Councilman Tarrlok publicly stated at a ${link_0} conference that Chief Beifong had failed Republic City, and that new leadership was needed. Later, on the way to Hiroshi Sato's estate after receiving a tip that he was manufacturing weapons for the Equalists, Tenzin and Lin realized that if their search proved wrong, Lin would lose her job as Chief of Police. After losing many of her officers during the battle at the Equalist factory, she resigned as Chief of Police in order to rescue her officers without the law's limitations. Tarrlok began manipulating Chief Saikhan to carry out his desired laws, stifling anyone in his way, including the new Team Avatar. Korra confronted Tarrlok about releasing her friends and told him that what he was doing made him \"just as bad as Amon.\" Enraged, the councilman attacked the Avatar with ${link_1}, but Korra soon gained the upper hand. Out of a water source and sensing his defeat, Tarrlok bloodbent her into submission and took her to ${link_2}, far away from Republic City. To cover up Korra's absence, the waterbender planted fake evidence of an Equalist attack. Lin, Tenzin, and the rest of Team Avatar left to look for Korra in an ${link_3}, finding only the captured officers, who had already been stripped of their ability to bend by Amon. They deduced that it was actually Tarrlok who had kidnapped Korra and framed the Equalists. Quickly, they ran back to City Hall and confronted the chairman. At first, the waterbender denied the accusations. However, ${link_4} intervened, telling them he had seen Tarrlok lock Korra in his truck. Lin asked the page why he waited until that time to confess the news, to which the page revealed that it was because of Tarrlok's bloodbending powers. Lin, Tenzin, and Team Avatar attempted to attack him, but he bloodbent them to unconsciousness and fled the scene before they could do so.",
      "links": [
        {
          "body": "press",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_press",
            "page": "Republic_City_press"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "his mountain hideout",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Tarrlok%27s_hideout",
            "page": "Tarrlok%27s_hideout"
          }
        },
        {
          "body": "underground Equalist prison",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_tunnel_network",
            "page": "Republic_City_tunnel_network"
          }
        },
        {
          "body": "his servant",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Council_page",
            "page": "Council_page"
          }
        }
      ],
      "section": [
        "Lin Beifong's relationships",
        "Enemies",
        "Tarrlok"
      ],
      "text": "After failing to protect the Pro-bending Arena from the Equalists' attack, Councilman Tarrlok publicly stated at a press conference that Chief Beifong had failed Republic City, and that new leadership was needed. Later, on the way to Hiroshi Sato's estate after receiving a tip that he was manufacturing weapons for the Equalists, Tenzin and Lin realized that if their search proved wrong, Lin would lose her job as Chief of Police. After losing many of her officers during the battle at the Equalist factory, she resigned as Chief of Police in order to rescue her officers without the law's limitations. Tarrlok began manipulating Chief Saikhan to carry out his desired laws, stifling anyone in his way, including the new Team Avatar. Korra confronted Tarrlok about releasing her friends and told him that what he was doing made him \"just as bad as Amon.\" Enraged, the councilman attacked the Avatar with waterbending, but Korra soon gained the upper hand. Out of a water source and sensing his defeat, Tarrlok bloodbent her into submission and took her to his mountain hideout, far away from Republic City. To cover up Korra's absence, the waterbender planted fake evidence of an Equalist attack. Lin, Tenzin, and the rest of Team Avatar left to look for Korra in an underground Equalist prison, finding only the captured officers, who had already been stripped of their ability to bend by Amon. They deduced that it was actually Tarrlok who had kidnapped Korra and framed the Equalists. Quickly, they ran back to City Hall and confronted the chairman. At first, the waterbender denied the accusations. However, his servant intervened, telling them he had seen Tarrlok lock Korra in his truck. Lin asked the page why he waited until that time to confess the news, to which the page revealed that it was because of Tarrlok's bloodbending powers. Lin, Tenzin, and Team Avatar attempted to attack him, but he bloodbent them to unconsciousness and fled the scene before they could do so."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Lin_Beifong%27s_relationships",
    "file": "avatar.wikia.com/wiki/Lin_Beifong's_relationships.html",
    "page": "Lin_Beifong's_relationships",
    "title": "Lin Beifong's relationships"
  }
}