{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Establishments",
      "target": {
        "href": "Category_Establishments",
        "page": "Category_Establishments"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Republic City",
      "target": {
        "href": "Category_Republic_City",
        "page": "Category_Republic_City"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Republic City",
              "key": "${link_0}",
              "target": {
                "href": "Republic_City",
                "page": "Republic_City"
              }
            }
          ],
          "text": "Republic City",
          "value": "${link_0}",
          "value_text": "Republic City"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "Mall",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Mall",
          "value": "Mall",
          "value_text": "Mall"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\" (only appearance)",
          "extra": "(only appearance)",
          "extra_text": "(only appearance)",
          "links": [
            {
              "body": "The Coronation",
              "key": "${link_0}",
              "target": {
                "href": "The_Coronation",
                "page": "The_Coronation"
              }
            }
          ],
          "text": "\"The Coronation\" (only appearance)",
          "value": "\"${link_0}\"",
          "value_text": "\"The Coronation\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Little Ba Sing Se Fashion Mall is a ${link_0} complex in ${link_1}. Built to resemble the ${link_2} capital, ${link_3}, it is divided into several rings, with each ring offering commodities of a different financial class.",
      "links": [
        {
          "body": "building",
          "key": "${link_0}",
          "target": {
            "href": "Architecture_in_the_World_of_Avatar",
            "page": "Architecture_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "Little Ba Sing Se Fashion Mall is a building complex in Republic City. Built to resemble the Earth Kingdom capital, Ba Sing Se, it is divided into several rings, with each ring offering commodities of a different financial class."
    },
    {
      "body": "Following his coronation, during which ${link_0} denounced his claim on the throne and seized power for herself, ${link_1} ${link_2} took ${link_3} to the shopping mall and bought him a smoothie in the lower ring. He planned on taking Mako to the middle ring afterward so that the bodyguard could pick up some new suits before visiting the boutiques in the upper ring of the establishment for himself. Before they could execute any of the plans, Wu noticed two other girls wearing T-shirts with Kuvira's face and emblem printed on them. Furious, he asked them where had they bought the clothes and promptly ran over to the shop, shouting that the Kuvira merchandise was \"junk\" that could not be sold in the Little Ba Sing Se Fashion Mall of which he was the \"Little King\". Offended, the customers booed him out, moving Wu to throw his smoothie at them. Before the angered shoppers could reach Wu, Mako pulled the king along with him through the street of the lower ring. By ${link_4} a barrier, he bought them time to escape in one of the allies, which was decorated with a defiled poster of Wu.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_1}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Wu",
          "key": "${link_2}",
          "target": {
            "href": "Wu",
            "page": "Wu"
          }
        },
        {
          "body": "Mako",
          "key": "${link_3}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "firebending",
          "key": "${link_4}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Following his coronation, during which Kuvira denounced his claim on the throne and seized power for herself, Earth King Wu took Mako to the shopping mall and bought him a smoothie in the lower ring. He planned on taking Mako to the middle ring afterward so that the bodyguard could pick up some new suits before visiting the boutiques in the upper ring of the establishment for himself. Before they could execute any of the plans, Wu noticed two other girls wearing T-shirts with Kuvira's face and emblem printed on them. Furious, he asked them where had they bought the clothes and promptly ran over to the shop, shouting that the Kuvira merchandise was \"junk\" that could not be sold in the Little Ba Sing Se Fashion Mall of which he was the \"Little King\". Offended, the customers booed him out, moving Wu to throw his smoothie at them. Before the angered shoppers could reach Wu, Mako pulled the king along with him through the street of the lower ring. By firebending a barrier, he bought them time to escape in one of the allies, which was decorated with a defiled poster of Wu."
    },
    {
      "body": "The duo retreated further into the mall and made their way to the \"upper ring\", where a replica of the ${link_0} was situated. Exiting the elevator, Wu ran for the palace, which was actually a restaurant, and was amazed to find a replica of the throne there as well. Making his way to the royal seat, he stole the fake ceremonial items from the child that was seated in the chair. Sinking down on the throne, he started crying about his failed coronation day, lamenting it was the worst day of his life. Mako asked if he truly wanted to be king of the Earth Kingdom considering that he had not done anything in the past three years to benefit the Earth Kingdom as opposed to Kuvira. Wu thanked Mako for being honest, though shortly after that, the duo was forced to run away again when the customers from the Kuvira shop found them.",
      "links": [
        {
          "body": "Earth Kingdom Royal Palace",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        }
      ],
      "text": "The duo retreated further into the mall and made their way to the \"upper ring\", where a replica of the Earth Kingdom Royal Palace was situated. Exiting the elevator, Wu ran for the palace, which was actually a restaurant, and was amazed to find a replica of the throne there as well. Making his way to the royal seat, he stole the fake ceremonial items from the child that was seated in the chair. Sinking down on the throne, he started crying about his failed coronation day, lamenting it was the worst day of his life. Mako asked if he truly wanted to be king of the Earth Kingdom considering that he had not done anything in the past three years to benefit the Earth Kingdom as opposed to Kuvira. Wu thanked Mako for being honest, though shortly after that, the duo was forced to run away again when the customers from the Kuvira shop found them."
    },
    {
      "body": "The \"Lower Ring\" of the Little ${link_0} Mall houses many small food and drink stalls as well as some souvenir shops.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "The \"Lower Ring\" of the Little Ba Sing Se Mall houses many small food and drink stalls as well as some souvenir shops."
    },
    {
      "body": "Made to resemble the walled city of Ba Sing Se, Little Ba Sing Se Fashion Mall is divided into several rings in which a number of restaurants, boutiques, and shops are located, including food stalls for fruit, seafood, and a carpet shop. The mall has a number of levels, with many of the shops being two-tiered. It culminates with a Royal Palace-themed gift shop and restaurant in the very center, reachable by an elevator.",
      "links": [],
      "text": "Made to resemble the walled city of Ba Sing Se, Little Ba Sing Se Fashion Mall is divided into several rings in which a number of restaurants, boutiques, and shops are located, including food stalls for fruit, seafood, and a carpet shop. The mall has a number of levels, with many of the shops being two-tiered. It culminates with a Royal Palace-themed gift shop and restaurant in the very center, reachable by an elevator."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Little_Ba_Sing_Se_Fashion_Mall",
    "file": "avatar.wikia.com/wiki/Little_Ba_Sing_Se_Fashion_Mall.html",
    "page": "Little_Ba_Sing_Se_Fashion_Mall",
    "title": "Little Ba Sing Se Fashion Mall"
  }
}