{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "href": "Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    },
    {
      "body": "Mai",
      "target": {
        "href": "Category_Mai",
        "page": "Category_Mai"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Mai shared a series of complex relationships with others, often stemming from conflicting personalities.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "This page is comprised of Mai's relationships with other characters in the World of Avatar. Mai shared a series of complex relationships with others, often stemming from conflicting personalities."
    },
    {
      "body": "${link_0} and her family.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        }
      ],
      "text": "Mai and her family."
    },
    {
      "body": "Mai was born into one of the wealthiest families in the ${link_0}, her father, ${link_1}, being a prominent politician who eventually became the governor of ${link_2}, later renamed New Ozai. Growing up, her father was still rising among the ranks and therefore, the family became preoccupied with achieving higher favor with the ${link_3}. As Ukano's only daughter, Mai was expected to behave properly among the politicians in order to ensure her father's respectability was preserved. As a result, Mai was taught to keep her opinions and emotions to herself; her personal needs were always second to her parents'.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Ukano",
          "key": "${link_1}",
          "target": {
            "href": "Ukano",
            "page": "Ukano"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_2}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "text": "Mai was born into one of the wealthiest families in the Fire Nation, her father, Ukano, being a prominent politician who eventually became the governor of Omashu, later renamed New Ozai. Growing up, her father was still rising among the ranks and therefore, the family became preoccupied with achieving higher favor with the Fire Lord. As Ukano's only daughter, Mai was expected to behave properly among the politicians in order to ensure her father's respectability was preserved. As a result, Mai was taught to keep her opinions and emotions to herself; her personal needs were always second to her parents'."
    },
    {
      "body": "Coming from a wealthy family, Mai was spoiled as long as she remained in line and her mother, ${link_0}, encouraged her to indulge in their riches. Finding little comfort in material things, craving excitement and freedom instead, Mai displayed a rebellious attitude toward her parents and eventually left home to join ${link_1} on her quest to capture ${link_2} and ${link_3}.",
      "links": [
        {
          "body": "Michi",
          "key": "${link_0}",
          "target": {
            "href": "Michi",
            "page": "Michi"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_2}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_3}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Coming from a wealthy family, Mai was spoiled as long as she remained in line and her mother, Michi, encouraged her to indulge in their riches. Finding little comfort in material things, craving excitement and freedom instead, Mai displayed a rebellious attitude toward her parents and eventually left home to join Azula on her quest to capture Zuko and Iroh."
    },
    {
      "body": "Mai leaving her defeated ${link_0}, taking ${link_1} with her.",
      "links": [
        {
          "body": "father",
          "key": "${link_0}",
          "target": {
            "href": "Ukano",
            "page": "Ukano"
          }
        },
        {
          "body": "Tom-Tom",
          "key": "${link_1}",
          "target": {
            "href": "Tom-Tom",
            "page": "Tom-Tom"
          }
        }
      ],
      "text": "Mai leaving her defeated father, taking Tom-Tom with her."
    },
    {
      "body": "Mai eventually encountered her father again, following her breakup with Zuko during the events of the ${link_0}. Discovering him to be the leader of the \"${link_1}\", a movement loyal to Fire Lord ${link_2}, whose aim was to restore him to the throne and to overthrow the \"usurper\", Zuko, she protested his actions. The animosity between father and daughter grew, as Ukano desired Mai to join him, deeming her to be a valuable asset to his organisation due to her knowledge about Zuko. Mai did not agree with him, however, and was further incensed by the fact that he had included ${link_3} in his organization. In defiance, she took Tom-Tom with her and severed her ties with her father, though she kept track of his actions and actively worked to thwart them. When she encountered him a next time, she called him and his beliefs \"insane\", though nonetheless allowed him to escape.",
      "links": [
        {
          "body": "Harmony Restoration Movement",
          "key": "${link_0}",
          "target": {
            "href": "Harmony_Restoration_Movement",
            "page": "Harmony_Restoration_Movement"
          }
        },
        {
          "body": "New Ozai Society",
          "key": "${link_1}",
          "target": {
            "href": "New_Ozai_Society",
            "page": "New_Ozai_Society"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_2}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Tom-Tom",
          "key": "${link_3}",
          "target": {
            "href": "Tom-Tom",
            "page": "Tom-Tom"
          }
        }
      ],
      "text": "Mai eventually encountered her father again, following her breakup with Zuko during the events of the Harmony Restoration Movement. Discovering him to be the leader of the \"New Ozai Society\", a movement loyal to Fire Lord Ozai, whose aim was to restore him to the throne and to overthrow the \"usurper\", Zuko, she protested his actions. The animosity between father and daughter grew, as Ukano desired Mai to join him, deeming her to be a valuable asset to his organisation due to her knowledge about Zuko. Mai did not agree with him, however, and was further incensed by the fact that he had included Tom-Tom in his organization. In defiance, she took Tom-Tom with her and severed her ties with her father, though she kept track of his actions and actively worked to thwart them. When she encountered him a next time, she called him and his beliefs \"insane\", though nonetheless allowed him to escape."
    },
    {
      "body": "Though estranged from her father, Mai reunited with her mother, who had since left her husband and taken up residence at ${link_0}'s as well. While Michi expressed deep regret at her husband's endangerment of their children and was content to be living with her children at Mura's, Mai remained indifferent.",
      "links": [
        {
          "body": "Mura",
          "key": "${link_0}",
          "target": {
            "href": "Mura",
            "page": "Mura"
          }
        }
      ],
      "text": "Though estranged from her father, Mai reunited with her mother, who had since left her husband and taken up residence at Mura's as well. While Michi expressed deep regret at her husband's endangerment of their children and was content to be living with her children at Mura's, Mai remained indifferent."
    },
    {
      "body": "Mai's Aunt Mura owned a flower shop somewhere in the Fire Nation. She was a compassionate aunt toward Mai and tried to cheer her up by hiring her to work at the shop after her breakup with Zuko. She also expressed much excitement toward her niece when she was asked out on a date by ${link_0}, and when Tom-Tom tried to show his sister the flower from their aunt, Mura told him not to bother her because she believed Mai was thinking about the good time she had the night before on her date.",
      "links": [
        {
          "body": "Kei Lo",
          "key": "${link_0}",
          "target": {
            "href": "Kei_Lo",
            "page": "Kei_Lo"
          }
        }
      ],
      "text": "Mai's Aunt Mura owned a flower shop somewhere in the Fire Nation. She was a compassionate aunt toward Mai and tried to cheer her up by hiring her to work at the shop after her breakup with Zuko. She also expressed much excitement toward her niece when she was asked out on a date by Kei Lo, and when Tom-Tom tried to show his sister the flower from their aunt, Mura told him not to bother her because she believed Mai was thinking about the good time she had the night before on her date."
    },
    {
      "body": "Mai taking ${link_0} with her to avoid his indoctrination.",
      "links": [
        {
          "body": "Tom-Tom",
          "key": "${link_0}",
          "target": {
            "href": "Tom-Tom",
            "page": "Tom-Tom"
          }
        }
      ],
      "text": "Mai taking Tom-Tom with her to avoid his indoctrination."
    },
    {
      "body": "Mai's little brother, Tom-Tom, was born two years prior to the return of ${link_0} ${link_1}. During their stay in Omashu, her family agreed to exchange the imprisoned ${link_2} ${link_3} for Tom-Tom, who accidentally wound up with the Avatar's ${link_4} when they fled Omashu. During the exchange, Mai appeared eager to get her brother back, but ${link_5} Azula criticized that trading a king for a toddler was foolish. After considering this prospect, Mai unhesitatingly let the Avatar's group keep Tom-Tom, demonstrating a callous disregard for her baby brother.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "King",
          "key": "${link_2}",
          "target": {
            "href": "King_of_Omashu",
            "page": "King_of_Omashu"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_3}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "group",
          "key": "${link_4}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Princess",
          "key": "${link_5}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "text": "Mai's little brother, Tom-Tom, was born two years prior to the return of Avatar Aang. During their stay in Omashu, her family agreed to exchange the imprisoned King Bumi for Tom-Tom, who accidentally wound up with the Avatar's group when they fled Omashu. During the exchange, Mai appeared eager to get her brother back, but Princess Azula criticized that trading a king for a toddler was foolish. After considering this prospect, Mai unhesitatingly let the Avatar's group keep Tom-Tom, demonstrating a callous disregard for her baby brother."
    },
    {
      "body": "After her breakup with Zuko and during her date with Kei Lo, Mai ran into Tom-Tom again after being led to the New Ozai Society. Upon seeing her, Tom-Tom was very happy to see his sister, whom he had been missing very much. Mai embraced her brother and voiced anger at the fact that her father had brought him to a place where the movement was hoarding weapons for battle, exhibiting a strong sense of protectiveness over him not displayed during the events in New Ozai a year before. When her father urged her to join the movement against Zuko, Mai collected her brother and fought off the loyalists who tried to capture her as she attempted to escape, and quickly defeated the entire group before she or her brother came to harm. After fleeing the scene, she returned to her Aunt Mura's flower shop where she worked with Tom-Tom in close company. Tom-Tom demonstrated concern for his older sister as she sulked over a picture of herself and Zuko together.",
      "links": [],
      "text": "After her breakup with Zuko and during her date with Kei Lo, Mai ran into Tom-Tom again after being led to the New Ozai Society. Upon seeing her, Tom-Tom was very happy to see his sister, whom he had been missing very much. Mai embraced her brother and voiced anger at the fact that her father had brought him to a place where the movement was hoarding weapons for battle, exhibiting a strong sense of protectiveness over him not displayed during the events in New Ozai a year before. When her father urged her to join the movement against Zuko, Mai collected her brother and fought off the loyalists who tried to capture her as she attempted to escape, and quickly defeated the entire group before she or her brother came to harm. After fleeing the scene, she returned to her Aunt Mura's flower shop where she worked with Tom-Tom in close company. Tom-Tom demonstrated concern for his older sister as she sulked over a picture of herself and Zuko together."
    },
    {
      "body": "Weeks later, Mai reunited with Ty Lee and repeated her disgust of how her father had endangered Tom-Tom by involving him in the New Ozai Society rebellion. When her brother was kidnapped several weeks later by the ${link_0}, Mai tried to save him, though failed. However, her desire to protect him was greater than her anger with Zuko, as she agreed to enlist his help to rescue Tom-Tom.",
      "links": [
        {
          "body": "Kemurikage",
          "key": "${link_0}",
          "target": {
            "href": "Kemurikage",
            "page": "Kemurikage"
          }
        }
      ],
      "text": "Weeks later, Mai reunited with Ty Lee and repeated her disgust of how her father had endangered Tom-Tom by involving him in the New Ozai Society rebellion. When her brother was kidnapped several weeks later by the Kemurikage, Mai tried to save him, though failed. However, her desire to protect him was greater than her anger with Zuko, as she agreed to enlist his help to rescue Tom-Tom."
    },
    {
      "body": "Mai appeared to have a strong relationship with the ${link_0}, her uncle. He seemed to care deeply about her state of happiness as he was more than willing to inform her, as opposed to the Fire Lord, of Zuko's capture at the ${link_1}, deeming it a punishment for his abandonment. In addition, he \"pulled a few strings\" for her, releasing her after she was imprisoned there under Azula's orders. This revealed he truly cares for her, despite the fact that Mai had tarnished her uncle's zero-escape record at the prison, a record the warden took enormous pride in, through aiding Zuko's ${link_2}.",
      "links": [
        {
          "body": "warden",
          "key": "${link_0}",
          "target": {
            "href": "Warden_(Boiling_Rock)",
            "page": "Warden_(Boiling_Rock)"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_1}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "escape",
          "key": "${link_2}",
          "target": {
            "href": "Escape_from_the_Boiling_Rock",
            "page": "Escape_from_the_Boiling_Rock"
          }
        }
      ],
      "text": "Mai appeared to have a strong relationship with the warden, her uncle. He seemed to care deeply about her state of happiness as he was more than willing to inform her, as opposed to the Fire Lord, of Zuko's capture at the Boiling Rock, deeming it a punishment for his abandonment. In addition, he \"pulled a few strings\" for her, releasing her after she was imprisoned there under Azula's orders. This revealed he truly cares for her, despite the fact that Mai had tarnished her uncle's zero-escape record at the prison, a record the warden took enormous pride in, through aiding Zuko's escape."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Mai and Zuko."
    },
    {
      "body": "As children of the Fire Nation royal court, Mai and Zuko were acquaintances. She harbored feelings for him as a younger child, blushing when she caught sight of him walking by. When Azula decided to make fun of their little crushes on each other, she invented a game that involved Azula putting an apple on Mai's head and lighting it on fire. When he saw the potential danger, Zuko ran to get the apple off Mai's head, and in doing so ended up knocking both of them into a fountain. After the Avatar was thought dead, the princess and ${link_0} arranged a date between the two when Zuko voiced reluctance to return to the Fire Nation. The couple quickly unfolded the ruse and set off to explore the city. When they ran into ${link_1}, Mai decided to play along when Zuko told Jin she was a knife thrower at the circus where they performed. During an attempt to perform the same act, Jin nearly hit Zuko, causing him to fall into the fountain. She proceeded to lean over him with a smug smile and whisper, \"Now we're even.\" At the end of the date, the two reminisced their childhood and shared a kiss.",
      "links": [
        {
          "body": "Ty Lee",
          "key": "${link_0}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Jin",
          "key": "${link_1}",
          "target": {
            "href": "Jin",
            "page": "Jin"
          }
        }
      ],
      "text": "As children of the Fire Nation royal court, Mai and Zuko were acquaintances. She harbored feelings for him as a younger child, blushing when she caught sight of him walking by. When Azula decided to make fun of their little crushes on each other, she invented a game that involved Azula putting an apple on Mai's head and lighting it on fire. When he saw the potential danger, Zuko ran to get the apple off Mai's head, and in doing so ended up knocking both of them into a fountain. After the Avatar was thought dead, the princess and Ty Lee arranged a date between the two when Zuko voiced reluctance to return to the Fire Nation. The couple quickly unfolded the ruse and set off to explore the city. When they ran into Jin, Mai decided to play along when Zuko told Jin she was a knife thrower at the circus where they performed. During an attempt to perform the same act, Jin nearly hit Zuko, causing him to fall into the fountain. She proceeded to lean over him with a smug smile and whisper, \"Now we're even.\" At the end of the date, the two reminisced their childhood and shared a kiss."
    },
    {
      "body": "They continued their relationship with Mai exhibiting strong feelings for Zuko and vice versa. Their relationship went through a slight rough patch, where the two broke up temporarily during Zuko's fit of temper. They soon got back together after confessing their issues. During the ${link_0}, Zuko left the Fire Nation to join the Avatar; he left her a note, stating that he was breaking up with her.",
      "links": [
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "text": "They continued their relationship with Mai exhibiting strong feelings for Zuko and vice versa. Their relationship went through a slight rough patch, where the two broke up temporarily during Zuko's fit of temper. They soon got back together after confessing their issues. During the invasion of the Fire Nation, Zuko left the Fire Nation to join the Avatar; he left her a note, stating that he was breaking up with her."
    },
    {
      "body": "${link_0} confronting ${link_1} in the ${link_2}'s interrogation room.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_2}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        }
      ],
      "text": "Mai confronting Zuko in the Boiling Rock's interrogation room."
    },
    {
      "body": "Mai later confronted Zuko when he was imprisoned, stating that he broke her heart. When the prison guards were ordered to cut the lines of the gondola Zuko was riding to escape the Boiling Rock, Mai intervened and aided his escape. When questioned for her actions, she replied, \"Saving the jerk who dumped me.\" Azula, outraged at her betrayal and willingness to aid her brother, ordered her to be imprisoned. After ${link_0} was overthrown, Mai reunited with Zuko and helped him get dressed for his coronation. She forgave him for his past actions and confessed her feelings for him. The two kissed, but she hastily warned him never to \"break up with [her] again.\"",
      "links": [
        {
          "body": "Ozai",
          "key": "${link_0}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Mai later confronted Zuko when he was imprisoned, stating that he broke her heart. When the prison guards were ordered to cut the lines of the gondola Zuko was riding to escape the Boiling Rock, Mai intervened and aided his escape. When questioned for her actions, she replied, \"Saving the jerk who dumped me.\" Azula, outraged at her betrayal and willingness to aid her brother, ordered her to be imprisoned. After Ozai was overthrown, Mai reunited with Zuko and helped him get dressed for his coronation. She forgave him for his past actions and confessed her feelings for him. The two kissed, but she hastily warned him never to \"break up with [her] again.\""
    },
    {
      "body": "Being in Zuko's presence tended to bring out a more passionate side of Mai. Her normally pessimistic, dull attitude was overshadowed by a show of happiness and affection when she spent time with him.",
      "links": [],
      "text": "Being in Zuko's presence tended to bring out a more passionate side of Mai. Her normally pessimistic, dull attitude was overshadowed by a show of happiness and affection when she spent time with him."
    },
    {
      "body": "Mai and Zuko maintained a strong relationship well over a year after the ${link_0}, even as the ${link_1} began to fail. After several failed assassination attempts on him, including one from ${link_2} from the colony of ${link_3}, Zuko left the Royal City to confront the colonists there while failing to inform Mai of his intentions. Mai feared for his safety and only learned about his departure from the city soldiers, which seemed to hurt her as he did not confide in his intent to go to the ${link_4}. Mai confronted Zuko about this when he returned, conveying sadness and concern for Zuko as he was no longer in a balanced state of mind, prompting him to apologize for his actions.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Harmony Restoration Movement",
          "key": "${link_1}",
          "target": {
            "href": "Harmony_Restoration_Movement",
            "page": "Harmony_Restoration_Movement"
          }
        },
        {
          "body": "a would-be assassin",
          "key": "${link_2}",
          "target": {
            "href": "Kori_Morishita",
            "page": "Kori_Morishita"
          }
        },
        {
          "body": "Yu Dao",
          "key": "${link_3}",
          "target": {
            "href": "Yu_Dao",
            "page": "Yu_Dao"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_4}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Mai and Zuko maintained a strong relationship well over a year after the Hundred Year War, even as the Harmony Restoration Movement began to fail. After several failed assassination attempts on him, including one from a would-be assassin from the colony of Yu Dao, Zuko left the Royal City to confront the colonists there while failing to inform Mai of his intentions. Mai feared for his safety and only learned about his departure from the city soldiers, which seemed to hurt her as he did not confide in his intent to go to the Earth Kingdom. Mai confronted Zuko about this when he returned, conveying sadness and concern for Zuko as he was no longer in a balanced state of mind, prompting him to apologize for his actions."
    },
    {
      "body": "During his trip to Yu Dao, Mai personally asked the ${link_0} to protect Zuko from any further assassinations, feeling the ${link_1} simply were not skilled enough to do so. Mai continued to comfort and support Zuko as he mulled over how to restore order to the restless colonies.",
      "links": [
        {
          "body": "Kyoshi Warriors",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Imperial Guards",
          "key": "${link_1}",
          "target": {
            "href": "Royal_Procession",
            "page": "Royal_Procession"
          }
        }
      ],
      "text": "During his trip to Yu Dao, Mai personally asked the Kyoshi Warriors to protect Zuko from any further assassinations, feeling the Imperial Guards simply were not skilled enough to do so. Mai continued to comfort and support Zuko as he mulled over how to restore order to the restless colonies."
    },
    {
      "body": "It was through this crisis that Mai's dedication to Zuko was further emphasized, with her going to great lengths to protect him and demonstrating visible concern for his well-being.",
      "links": [],
      "text": "It was through this crisis that Mai's dedication to Zuko was further emphasized, with her going to great lengths to protect him and demonstrating visible concern for his well-being."
    },
    {
      "body": "${link_0} breaking up with ${link_1} after he hid his visits to ${link_2} from her.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "his father",
          "key": "${link_2}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Mai breaking up with Zuko after he hid his visits to his father from her."
    },
    {
      "body": "However, over time, Mai grew upset with Zuko's keeping of secrets from her, stating that he \"loved [his] secrets more than [her]\". After finding out through ${link_0} about Zuko's repeated visits to his father, she broke up with him, leaving the ${link_1} despite Zuko stating that he loved her.",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Royal Palace",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_Royal_Palace",
            "page": "Fire_Nation_Royal_Palace"
          }
        }
      ],
      "text": "However, over time, Mai grew upset with Zuko's keeping of secrets from her, stating that he \"loved [his] secrets more than [her]\". After finding out through Suki about Zuko's repeated visits to his father, she broke up with him, leaving the Royal Palace despite Zuko stating that he loved her."
    },
    {
      "body": "Despite choosing to end their relationship, Mai still felt some affection toward Zuko, as she pined over a picture of her former boyfriend after rescuing her brother from a meeting of the New Ozai Society. Additionally, she continued to protect him, using Kei Lo for information on her father's plans and enlisting help from her friends in the Kyoshi Warriors, though remained doubtful about their relationship.",
      "links": [],
      "text": "Despite choosing to end their relationship, Mai still felt some affection toward Zuko, as she pined over a picture of her former boyfriend after rescuing her brother from a meeting of the New Ozai Society. Additionally, she continued to protect him, using Kei Lo for information on her father's plans and enlisting help from her friends in the Kyoshi Warriors, though remained doubtful about their relationship."
    },
    {
      "body": "Nevertheless, Mai accepted Zuko's assistance when the Kemurikage kidnapped Tom-Tom though remained largely distant toward him, only making offhand responses to his remarks. When the two were left alone outside of the first Fire Lord's crypt, Mai scolded Zuko for stating that he missed her. She admitted that she did not feel as strongly about Kei Lo as she did about Zuko, though that was as she needed it to be after Zuko broke her heart twice. After the group returned to the Fire Nation Capital, Mai expressed her frustration at Zuko's disregard for other's feelings to Kei Lo and realized that she was still preoccupied with Zuko's actions. Although she reminisced over her past relationship in her room and looked at a picture of her with Zuko, Mai promptly set the image aside to look at one of her and Tom-Tom, prioritizing her family over her feelings for Zuko.",
      "links": [],
      "text": "Nevertheless, Mai accepted Zuko's assistance when the Kemurikage kidnapped Tom-Tom though remained largely distant toward him, only making offhand responses to his remarks. When the two were left alone outside of the first Fire Lord's crypt, Mai scolded Zuko for stating that he missed her. She admitted that she did not feel as strongly about Kei Lo as she did about Zuko, though that was as she needed it to be after Zuko broke her heart twice. After the group returned to the Fire Nation Capital, Mai expressed her frustration at Zuko's disregard for other's feelings to Kei Lo and realized that she was still preoccupied with Zuko's actions. Although she reminisced over her past relationship in her room and looked at a picture of her with Zuko, Mai promptly set the image aside to look at one of her and Tom-Tom, prioritizing her family over her feelings for Zuko."
    },
    {
      "body": "Mai met Kei Lo in the weeks following her breakup with Zuko, as he visited her aunt's flower shop and bought her flowers to show his affection. Although she was indifferent to his gestures, she eventually reluctantly agreed to go out with him on Mura's encouragement. During their date, Kei Lo amused Mai with his jokes and antics, though she denied such feelings when questioned on it. When Kei Lo brought Mai to a meeting of the New Ozai Society, she disarmed the entire rebel force present, including Kei Lo, who tried to insist his affection was genuine before being dealt a knockout punch.",
      "links": [],
      "text": "Mai met Kei Lo in the weeks following her breakup with Zuko, as he visited her aunt's flower shop and bought her flowers to show his affection. Although she was indifferent to his gestures, she eventually reluctantly agreed to go out with him on Mura's encouragement. During their date, Kei Lo amused Mai with his jokes and antics, though she denied such feelings when questioned on it. When Kei Lo brought Mai to a meeting of the New Ozai Society, she disarmed the entire rebel force present, including Kei Lo, who tried to insist his affection was genuine before being dealt a knockout punch."
    },
    {
      "body": "In spite of this first encounter, Kei Lo continued to see Mai, who realized she could use him to thwart her father's intentions. Meeting often in the weeks that followed, Mai feigned affection for Kei Lo, putting on an uncharacteristically enthusiastic facade as she pried him for information. In truth, Mai felt little genuine affection for him, seeing him as a \"patsy\" of her father. Even after Ty Lee monitored Kei Lo on Mai's request and sensed no malicious intent, Mai refused to trust him.",
      "links": [],
      "text": "In spite of this first encounter, Kei Lo continued to see Mai, who realized she could use him to thwart her father's intentions. Meeting often in the weeks that followed, Mai feigned affection for Kei Lo, putting on an uncharacteristically enthusiastic facade as she pried him for information. In truth, Mai felt little genuine affection for him, seeing him as a \"patsy\" of her father. Even after Ty Lee monitored Kei Lo on Mai's request and sensed no malicious intent, Mai refused to trust him."
    },
    {
      "body": "Due to Kei Lo's warning, Mai and Ty Lee were able to devise a decoy operation in order to help Zuko return to the capital safely, though it failed. Although Kei Lo abandoned the Society during the battle, Mai rounded on him, demanding answers. He insisted that the Society knew he was meeting her and fed him false information regarding the location of the ambush. He aided Mai as she went to confront her father, though was injured in the process. She later helped him get home, and when Kei Lo repeated his true feelings for her, she stated in a more genuine manner that she now trusted him.",
      "links": [],
      "text": "Due to Kei Lo's warning, Mai and Ty Lee were able to devise a decoy operation in order to help Zuko return to the capital safely, though it failed. Although Kei Lo abandoned the Society during the battle, Mai rounded on him, demanding answers. He insisted that the Society knew he was meeting her and fed him false information regarding the location of the ambush. He aided Mai as she went to confront her father, though was injured in the process. She later helped him get home, and when Kei Lo repeated his true feelings for her, she stated in a more genuine manner that she now trusted him."
    },
    {
      "body": "A month later, Mai questioned Kei Lo again on why he left the Society, expressing doubt and confusion as to why he would do so for her. He admitted that he wanted to find a place where he belonged due to spending much of his life as an orphan, though now that he had found Mai, he felt that he belonged to someone, nearly prompting a kiss from Mai though their conversation was interrupted by the arrival of assailants dressed as the Kemurikage, who abducted Mai's brother before she or Kei Lo could stop them.",
      "links": [],
      "text": "A month later, Mai questioned Kei Lo again on why he left the Society, expressing doubt and confusion as to why he would do so for her. He admitted that he wanted to find a place where he belonged due to spending much of his life as an orphan, though now that he had found Mai, he felt that he belonged to someone, nearly prompting a kiss from Mai though their conversation was interrupted by the arrival of assailants dressed as the Kemurikage, who abducted Mai's brother before she or Kei Lo could stop them."
    },
    {
      "body": "Mai and Kei Lo became increasingly affectionate following the incident, with the latter even calling her \"babe\". Mai allowed Kei Lo to guide her in picking the locks within the Dragonbone Catacombs, remarking how impressed she was with her boyfriend's skills. However, she admitted to Zuko shortly thereafter that she did not feel as strongly about Kei Lo as she did for him, and that she allowed herself to be in a relationship with Kei Lo since she would not be heartbroken if the relationship ended. After the group's return to the Fire Nation Capital, Mai used her concern over Tom-Tom as a way to excuse her comments about Zuko and subsequently kissed Kei Lo to reassure him that she did not feel anything for the Fire Lord.",
      "links": [],
      "text": "Mai and Kei Lo became increasingly affectionate following the incident, with the latter even calling her \"babe\". Mai allowed Kei Lo to guide her in picking the locks within the Dragonbone Catacombs, remarking how impressed she was with her boyfriend's skills. However, she admitted to Zuko shortly thereafter that she did not feel as strongly about Kei Lo as she did for him, and that she allowed herself to be in a relationship with Kei Lo since she would not be heartbroken if the relationship ended. After the group's return to the Fire Nation Capital, Mai used her concern over Tom-Tom as a way to excuse her comments about Zuko and subsequently kissed Kei Lo to reassure him that she did not feel anything for the Fire Lord."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Mai and Team Avatar."
    },
    {
      "body": "Mai was an enemy of Team Avatar throughout most of the series. After allying with Azula, she was more than happy to engage them in combat; despite their ${link_0} skills, Mai was more than a match for any member of the team, managing to defeat, an albeit sleep deprived, ${link_1} in a matter of seconds and disabling the Kyoshi Warriors. She took part in the ${link_2} of ${link_3}, but continued to display a nonchalant attitude; she did not make any effort to prevent ${link_4} and ${link_5} from rescuing the ${link_6}'s ${link_7}. Katara was the sole member of Team Avatar who managed to catch Mai off-guard, immobilizing Mai's arm in an ice encasing before Ty Lee ${link_8} the ${link_9}'s ${link_10}.",
      "links": [
        {
          "body": "bending",
          "key": "${link_0}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "fall",
          "key": "${link_2}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_4}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Toph",
          "key": "${link_5}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_6}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "pet bear",
          "key": "${link_7}",
          "target": {
            "href": "Bosco",
            "page": "Bosco"
          }
        },
        {
          "body": "blocked",
          "key": "${link_8}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        },
        {
          "body": "waterbender",
          "key": "${link_9}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "chi",
          "key": "${link_10}",
          "target": {
            "href": "Chi",
            "page": "Chi"
          }
        }
      ],
      "text": "Mai was an enemy of Team Avatar throughout most of the series. After allying with Azula, she was more than happy to engage them in combat; despite their bending skills, Mai was more than a match for any member of the team, managing to defeat, an albeit sleep deprived, Katara in a matter of seconds and disabling the Kyoshi Warriors. She took part in the fall of Ba Sing Se, but continued to display a nonchalant attitude; she did not make any effort to prevent Sokka and Toph from rescuing the Earth King's pet bear. Katara was the sole member of Team Avatar who managed to catch Mai off-guard, immobilizing Mai's arm in an ice encasing before Ty Lee blocked the waterbender's chi."
    },
    {
      "body": "Mai was imprisoned during the final weeks of the War due to her betrayal of Azula for helping Zuko flee the Boiling Rock Prison after Azula left him for dead. In doing so, she unintentionally saved former enemies Sokka and Suki. When Mai was released from prison following the conclusion of the War, she made peace with Team Avatar and befriended them. Mai joined the team at the ${link_0}, where she played ${link_1} with Suki and teased Sokka over his mediocre drawing of the group.",
      "links": [
        {
          "body": "Jasmine Dragon",
          "key": "${link_0}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        },
        {
          "body": "Pai Sho",
          "key": "${link_1}",
          "target": {
            "href": "Pai_Sho",
            "page": "Pai_Sho"
          }
        }
      ],
      "text": "Mai was imprisoned during the final weeks of the War due to her betrayal of Azula for helping Zuko flee the Boiling Rock Prison after Azula left him for dead. In doing so, she unintentionally saved former enemies Sokka and Suki. When Mai was released from prison following the conclusion of the War, she made peace with Team Avatar and befriended them. Mai joined the team at the Jasmine Dragon, where she played Pai Sho with Suki and teased Sokka over his mediocre drawing of the group."
    },
    {
      "body": "After the war, Mai came to value her bond with Team Avatar, enlisting Ty Lee, Suki, and the other ${link_0} to help protect Zuko after several attempts on his life. When ${link_1} was believed to be kidnapped by the ${link_2}, Mai warmly greeted Aang and readily accepted his help in tracking down the perpetrators.",
      "links": [
        {
          "body": "Kyoshi Warriors",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Tom-Tom",
          "key": "${link_1}",
          "target": {
            "href": "Tom-Tom",
            "page": "Tom-Tom"
          }
        },
        {
          "body": "Kemurikage",
          "key": "${link_2}",
          "target": {
            "href": "Kemurikage",
            "page": "Kemurikage"
          }
        }
      ],
      "text": "After the war, Mai came to value her bond with Team Avatar, enlisting Ty Lee, Suki, and the other Kyoshi Warriors to help protect Zuko after several attempts on his life. When Tom-Tom was believed to be kidnapped by the Kemurikage, Mai warmly greeted Aang and readily accepted his help in tracking down the perpetrators."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_1}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "text": "Mai and Ty Lee."
    },
    {
      "body": "Ty Lee is Mai's best friend whom she met at the ${link_0} as younger children. Despite Mai's pessimistic attitude and Ty Lee's flightiness, which occasionally led to personality clashes between the two, they held a mutual respect for each other. When younger, Ty Lee enjoyed playing pranks on Mai, partaking in a trick Azula devised to embarrass both Mai and Zuko, who were childhood sweethearts. Ty Lee often tried to encourage Mai to be more open and outgoing.",
      "links": [
        {
          "body": "Royal Fire Academy for Girls",
          "key": "${link_0}",
          "target": {
            "href": "Royal_Fire_Academy_for_Girls",
            "page": "Royal_Fire_Academy_for_Girls"
          }
        }
      ],
      "text": "Ty Lee is Mai's best friend whom she met at the Royal Fire Academy for Girls as younger children. Despite Mai's pessimistic attitude and Ty Lee's flightiness, which occasionally led to personality clashes between the two, they held a mutual respect for each other. When younger, Ty Lee enjoyed playing pranks on Mai, partaking in a trick Azula devised to embarrass both Mai and Zuko, who were childhood sweethearts. Ty Lee often tried to encourage Mai to be more open and outgoing."
    },
    {
      "body": "Ty Lee and Mai reunited years later in Omashu when Azula recruited the two to aid her in her mission to capture Zuko and Iroh. The two were happy to see each other and continually cooperated in battle with the Avatar and the ${link_0}. When Azula was preoccupied elsewhere, Mai and Ty Lee always battled alongside each other. They proved more than a match for their enemies with their combined skills of chi blocking and shuriken-jutsu.",
      "links": [
        {
          "body": "Earth Kingdom Army",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Earth_Kingdom",
            "page": "Military_of_the_Earth_Kingdom"
          }
        }
      ],
      "text": "Ty Lee and Mai reunited years later in Omashu when Azula recruited the two to aid her in her mission to capture Zuko and Iroh. The two were happy to see each other and continually cooperated in battle with the Avatar and the Earth Kingdom Army. When Azula was preoccupied elsewhere, Mai and Ty Lee always battled alongside each other. They proved more than a match for their enemies with their combined skills of chi blocking and shuriken-jutsu."
    },
    {
      "body": "Ty Lee and Mai continued to enjoy each other's company upon returning to the Fire Nation after capturing Ba Sing Se, the Earth Kingdom capital. They spent a weekend on ${link_0} together along with Zuko and Azula. While vacationing there, their personalities once again clashed; however, after open confessions about their troubled lifestyles, they grew to understand each other's problems. Ty Lee accompanied Azula and Mai to the Boiling Rock prison where Zuko and his allies were attempting an escape; Azula left him to die in the boiling lake surrounding the prison, prompting Mai to save his life. Ty Lee, terrified that Azula would hurt Mai for her actions, promptly disabled the princess with her chi blocking when the latter prepared to attack, much to Mai's surprise. They tried to escape together but were soon arrested and imprisoned for betraying the princess.",
      "links": [
        {
          "body": "Ember Island",
          "key": "${link_0}",
          "target": {
            "href": "Ember_Island",
            "page": "Ember_Island"
          }
        }
      ],
      "text": "Ty Lee and Mai continued to enjoy each other's company upon returning to the Fire Nation after capturing Ba Sing Se, the Earth Kingdom capital. They spent a weekend on Ember Island together along with Zuko and Azula. While vacationing there, their personalities once again clashed; however, after open confessions about their troubled lifestyles, they grew to understand each other's problems. Ty Lee accompanied Azula and Mai to the Boiling Rock prison where Zuko and his allies were attempting an escape; Azula left him to die in the boiling lake surrounding the prison, prompting Mai to save his life. Ty Lee, terrified that Azula would hurt Mai for her actions, promptly disabled the princess with her chi blocking when the latter prepared to attack, much to Mai's surprise. They tried to escape together but were soon arrested and imprisoned for betraying the princess."
    },
    {
      "body": "After the two girls were released from prison with the Hundred Year War's conclusion, they maintained a strong friendship, despite not being together all that often. As such, Mai entrusted Ty Lee and the Kyoshi Warriors with Zuko's protection following several threats made against his life and tolerated being hugged by her.",
      "links": [],
      "text": "After the two girls were released from prison with the Hundred Year War's conclusion, they maintained a strong friendship, despite not being together all that often. As such, Mai entrusted Ty Lee and the Kyoshi Warriors with Zuko's protection following several threats made against his life and tolerated being hugged by her."
    },
    {
      "body": "Mai's trust in her friend continued to be strong, as she readily enlisted Ty Lee's help to gauge Kei Lo's true intentions and learn more about Ukano's plans for overthrowing Zuko. Their friendship was also comfortable enough that they could voice criticism about each other, as Ty Lee berated Mai for feigning affection for Kei Lo to get him to talk, scolding her for being \"fake\" and dishonest, while Mai chided Ty Lee for being what she saw as petty. Nevertheless, the two continued to support each other and made an effective team in combat.",
      "links": [],
      "text": "Mai's trust in her friend continued to be strong, as she readily enlisted Ty Lee's help to gauge Kei Lo's true intentions and learn more about Ukano's plans for overthrowing Zuko. Their friendship was also comfortable enough that they could voice criticism about each other, as Ty Lee berated Mai for feigning affection for Kei Lo to get him to talk, scolding her for being \"fake\" and dishonest, while Mai chided Ty Lee for being what she saw as petty. Nevertheless, the two continued to support each other and made an effective team in combat."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Mai and Azula."
    },
    {
      "body": "Mai and Princess Azula first met as children at the Royal Fire Academy for Girls and had been friends for many years. However, their relationship is perhaps the most complex of Mai's relationships. As children, Azula enjoyed teasing Mai and playing pranks on her, especially after noticing Mai's crush on her brother, Zuko. In one incident, Azula tricked Zuko into knocking Mai into a fountain by setting fire to an apple she placed on Mai's head. Mai was not harmed, however, she was clearly irritated and could have potentially been injured.",
      "links": [],
      "text": "Mai and Princess Azula first met as children at the Royal Fire Academy for Girls and had been friends for many years. However, their relationship is perhaps the most complex of Mai's relationships. As children, Azula enjoyed teasing Mai and playing pranks on her, especially after noticing Mai's crush on her brother, Zuko. In one incident, Azula tricked Zuko into knocking Mai into a fountain by setting fire to an apple she placed on Mai's head. Mai was not harmed, however, she was clearly irritated and could have potentially been injured."
    },
    {
      "body": "Azula reunited with Mai in the occupied city of Omashu and recruited her as a member of her elite team tasked with capturing Iroh and Zuko. Mai appeared glad to see Azula and readily accepted the princess' request, seeing it as an opportunity to escape Omashu, which she dreaded. Prior to their departure, Mai's father, the governor, agreed to exchange King Bumi to the Earth Kingdom ${link_0} in return for his son Tom-Tom, who had accidentally followed Team Avatar and the Omashu civilians when they were evacuated from the city. Azula put Mai in charge of the exchange, but was able to manipulate Mai into calling off the deal and surrendering Tom-Tom to the enemy. Mai complied, an action that endangered Tom-Tom's life in the battle that followed.",
      "links": [
        {
          "body": "Resistance",
          "key": "${link_0}",
          "target": {
            "href": "Omashu_Resistance",
            "page": "Omashu_Resistance"
          }
        }
      ],
      "text": "Azula reunited with Mai in the occupied city of Omashu and recruited her as a member of her elite team tasked with capturing Iroh and Zuko. Mai appeared glad to see Azula and readily accepted the princess' request, seeing it as an opportunity to escape Omashu, which she dreaded. Prior to their departure, Mai's father, the governor, agreed to exchange King Bumi to the Earth Kingdom Resistance in return for his son Tom-Tom, who had accidentally followed Team Avatar and the Omashu civilians when they were evacuated from the city. Azula put Mai in charge of the exchange, but was able to manipulate Mai into calling off the deal and surrendering Tom-Tom to the enemy. Mai complied, an action that endangered Tom-Tom's life in the battle that followed."
    },
    {
      "body": "Mai openly cooperated with Azula's efforts to capture Zuko, Iroh, and the Avatar, and was an active participant in the capture of Ba Sing Se. However, she also displayed a lack of regard for her orders. When the Fire Nation attempted to ${link_0} through the Outer Wall of Ba Sing Se, Mai refused to pursue Sokka and Katara through the drill's slurry system, saying that Azula could \"shoot all the ${link_1} she [wanted]\" at her. She refused to fight Team Avatar in Ba Sing Se out of boredom, allowing them to merely take the Earth King's bear Bosco away, without any struggle.",
      "links": [
        {
          "body": "drill",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        },
        {
          "body": "lightning",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        }
      ],
      "text": "Mai openly cooperated with Azula's efforts to capture Zuko, Iroh, and the Avatar, and was an active participant in the capture of Ba Sing Se. However, she also displayed a lack of regard for her orders. When the Fire Nation attempted to drill through the Outer Wall of Ba Sing Se, Mai refused to pursue Sokka and Katara through the drill's slurry system, saying that Azula could \"shoot all the lightning she [wanted]\" at her. She refused to fight Team Avatar in Ba Sing Se out of boredom, allowing them to merely take the Earth King's bear Bosco away, without any struggle."
    },
    {
      "body": "Azula decided to return to the Fire Nation with her imprisoned uncle Iroh and drag Zuko along. When he refused, Azula used Zuko and Mai's childhood crushes on each other to convince him otherwise, arranging a dinner date between the two. The two caught on to her scheme; however, they did eventually reunite and Zuko agreed to come home.",
      "links": [],
      "text": "Azula decided to return to the Fire Nation with her imprisoned uncle Iroh and drag Zuko along. When he refused, Azula used Zuko and Mai's childhood crushes on each other to convince him otherwise, arranging a dinner date between the two. The two caught on to her scheme; however, they did eventually reunite and Zuko agreed to come home."
    },
    {
      "body": "After the group returned home, Mai and Azula's relationship underwent noticeable tension. While Mai and Zuko were enjoying a romantic picnic near the ${link_0}, Azula interrupted them in order to speak with Zuko. When they refused, Azula forced Mai to leave by lying that Ty Lee needed help with her tangled braid. Mai complied, but gave Azula a quick, venomous glare as she passed. During the group's stay on Ember Island, they revealed the stories of their rough childhoods to each other. When Azula analyzed the reasons for Mai's lack of emotions, Mai demanded the princess leave her alone. Mai informed Zuko of a war meeting to which Azula was invited. Zuko was not told of this beforehand and the two of them became suspicious of Azula.",
      "links": [
        {
          "body": "Fire Nation Capital",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        }
      ],
      "text": "After the group returned home, Mai and Azula's relationship underwent noticeable tension. While Mai and Zuko were enjoying a romantic picnic near the Fire Nation Capital, Azula interrupted them in order to speak with Zuko. When they refused, Azula forced Mai to leave by lying that Ty Lee needed help with her tangled braid. Mai complied, but gave Azula a quick, venomous glare as she passed. During the group's stay on Ember Island, they revealed the stories of their rough childhoods to each other. When Azula analyzed the reasons for Mai's lack of emotions, Mai demanded the princess leave her alone. Mai informed Zuko of a war meeting to which Azula was invited. Zuko was not told of this beforehand and the two of them became suspicious of Azula."
    },
    {
      "body": "${link_0} brandishing one of her stilettos at the outset of her impending fight with ${link_1}, before the latter was disabled by ${link_2}.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_2}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "text": "Mai brandishing one of her stilettos at the outset of her impending fight with Azula, before the latter was disabled by Ty Lee."
    },
    {
      "body": "Mai and Azula's friendship finally came to an end during the events on the Boiling Rock. When the girls learned that Zuko had been captured at the Boiling Rock, Mai, along with Azula and Ty Lee, went to the prison to interrogate Zuko on his reasons for leaving her on the ${link_0} to help the Avatar. When Zuko attempted to escape with his friend Sokka and some of the prisoners, Azula and Ty Lee fought them on the ${link_1}. The guards attempted to cut the lines above the boiling lake, so Azula left the group to die. Mai supposedly witnessed this and betrayed Azula to save Zuko's life by fighting the guards.",
      "links": [
        {
          "body": "Day of Black Sun",
          "key": "${link_0}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "gondola",
          "key": "${link_1}",
          "target": {
            "href": "Gondola",
            "page": "Gondola"
          }
        }
      ],
      "text": "Mai and Azula's friendship finally came to an end during the events on the Boiling Rock. When the girls learned that Zuko had been captured at the Boiling Rock, Mai, along with Azula and Ty Lee, went to the prison to interrogate Zuko on his reasons for leaving her on the Day of Black Sun to help the Avatar. When Zuko attempted to escape with his friend Sokka and some of the prisoners, Azula and Ty Lee fought them on the gondola. The guards attempted to cut the lines above the boiling lake, so Azula left the group to die. Mai supposedly witnessed this and betrayed Azula to save Zuko's life by fighting the guards."
    },
    {
      "body": "Mai was arrested afterward where Azula proceeded to interrogate her. When asked why she aided Zuko, Mai stated that Azula did not know her as well as she previously conceived and said, \"I love Zuko more than I fear you.\" Azula became enraged and attempted to strike Mai down, who prepared to fight her with her knives. However, before either could strike, Ty Lee disabled Azula to save Mai, leading to the two girls' arrest. Mai and Ty Lee gave Azula one last look of defiance before they were dragged into the prison.",
      "links": [],
      "text": "Mai was arrested afterward where Azula proceeded to interrogate her. When asked why she aided Zuko, Mai stated that Azula did not know her as well as she previously conceived and said, \"I love Zuko more than I fear you.\" Azula became enraged and attempted to strike Mai down, who prepared to fight her with her knives. However, before either could strike, Ty Lee disabled Azula to save Mai, leading to the two girls' arrest. Mai and Ty Lee gave Azula one last look of defiance before they were dragged into the prison."
    },
    {
      "body": "Even after the Hundred Year War's conclusion, Mai never forgave Azula for her actions and kept referring to her as a \"lunatic\" while fearing the worst if the princess would ever come back for her.",
      "links": [],
      "text": "Even after the Hundred Year War's conclusion, Mai never forgave Azula for her actions and kept referring to her as a \"lunatic\" while fearing the worst if the princess would ever come back for her."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Mai%27s_relationships",
    "file": "avatar.wikia.com/wiki/Mai's_relationships.html",
    "page": "Mai's_relationships",
    "title": "Mai's relationships"
  }
}