{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "external": false,
        "href": "/wiki/Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of Mako's relationships with other characters in the ${link_0}. Though ${link_1}'s troubled past has left him emotionally scarred and slightly cynical, he is capable of immense love and sacrifice toward his intimates.",
      "links": [
        {
          "body": "World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        }
      ],
      "section": [
        "Mako's relationships"
      ],
      "text": "This page is comprised of Mako's relationships with other characters in the World of Avatar. Though Mako's troubled past has left him emotionally scarred and slightly cynical, he is capable of immense love and sacrifice toward his intimates."
    },
    {
      "body": "When Mako's parents died, he was left orphaned on the streets along with his younger ${link_0}. He began working for the ${link_1} by running numbers so he could survive and provide for Bolin and himself. Later, when questioned by Korra about this, he justified this by saying he was \"doing what [he] could [...] to protect [his] little brother\". Eventually, ${link_2} discovered Mako fighting on the streets and invited the brothers to live in the attic of the ${link_3}, and work odd jobs to pay rent. The brothers accepted, and together they formed their own ${link_4} team, the ${link_5}.",
      "links": [
        {
          "body": "brother",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Triple Threat Triad",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "Toza",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Toza",
            "page": "Toza"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "pro-bending",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending",
            "page": "Pro-bending"
          }
        },
        {
          "body": "Fire Ferrets",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Relatives",
        "Bolin"
      ],
      "text": "When Mako's parents died, he was left orphaned on the streets along with his younger brother. He began working for the Triple Threat Triad by running numbers so he could survive and provide for Bolin and himself. Later, when questioned by Korra about this, he justified this by saying he was \"doing what [he] could [...] to protect [his] little brother\". Eventually, Toza discovered Mako fighting on the streets and invited the brothers to live in the attic of the Pro-bending Arena, and work odd jobs to pay rent. The brothers accepted, and together they formed their own pro-bending team, the Fire Ferrets."
    },
    {
      "body": "Though Mako's serious, brooding personality occasionally conflicts with Bolin's goofier, happier nature, the firebender loves his brother, and is very protective of him. Before the quarterfinals of the ${link_0}, he confronted Korra for admitting her feelings for him and, after being rejected, going on a date with Bolin, as he did not want his brother's heart to be broken. When Bolin witnessed Korra and Mako kiss, a sight that left him devastated, Mako berated Korra and ran after Bolin to find and comfort him. Despite being called a \"brother-betrayer\", he was able to reconcile with Bolin during the semifinals, restoring their brotherly relationship.",
      "links": [
        {
          "body": "Pro-bending Tournament",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending#Pro-bending_Tournament",
            "page": "Pro-bending"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Relatives",
        "Bolin"
      ],
      "text": "Though Mako's serious, brooding personality occasionally conflicts with Bolin's goofier, happier nature, the firebender loves his brother, and is very protective of him. Before the quarterfinals of the Pro-bending Tournament, he confronted Korra for admitting her feelings for him and, after being rejected, going on a date with Bolin, as he did not want his brother's heart to be broken. When Bolin witnessed Korra and Mako kiss, a sight that left him devastated, Mako berated Korra and ran after Bolin to find and comfort him. Despite being called a \"brother-betrayer\", he was able to reconcile with Bolin during the semifinals, restoring their brotherly relationship."
    },
    {
      "body": "When Mako prepared to depart with Korra to fight Amon after he had taken control of Republic City, the two hugged and said that they loved each other.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Relatives",
        "Bolin"
      ],
      "text": "When Mako prepared to depart with Korra to fight Amon after he had taken control of Republic City, the two hugged and said that they loved each other."
    },
    {
      "body": "Six months later, Mako and Bolin's relationship suffered some strain, despite still being mostly positive. While having relationship troubles with Eska, Bolin asked Mako for advice on how to end it. Due to his job as a cop, Mako became somewhat dismissive of Bolin, hardly registering and showing little interest in Bolin's new career as a mover star, and telling him to \"figure something out\" when Bolin asked him what to do upon returning from the Southern Water Tribe, which Bolin later shot back at him. This, and Bolin's recent friendship with Varrick also made him doubt Mako's conclusion that Varrick was behind the attacks on Asami's shipments. Upon learning of Mako and Asami's rapprochement, Bolin admonished them.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Relatives",
        "Bolin"
      ],
      "text": "Six months later, Mako and Bolin's relationship suffered some strain, despite still being mostly positive. While having relationship troubles with Eska, Bolin asked Mako for advice on how to end it. Due to his job as a cop, Mako became somewhat dismissive of Bolin, hardly registering and showing little interest in Bolin's new career as a mover star, and telling him to \"figure something out\" when Bolin asked him what to do upon returning from the Southern Water Tribe, which Bolin later shot back at him. This, and Bolin's recent friendship with Varrick also made him doubt Mako's conclusion that Varrick was behind the attacks on Asami's shipments. Upon learning of Mako and Asami's rapprochement, Bolin admonished them."
    },
    {
      "body": "After Mako's imprisonment, Bolin visited him in jail, offering him a poster of his mover's finale. Mako was annoyed that Bolin still did not believe him on his word, and urged him to be on the lookout for anything suspicious during the screening. A few hours later, Bolin visited Mako again in prison to personally recall his rescue of ${link_0} ${link_1}. Mako was delivered the news of his release and received an apology from Bolin for ever having doubted him. Mako readily accepted it, and the two brothers shared a hug, rekindling their relationship.",
      "links": [
        {
          "body": "President",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Raiko",
            "page": "Raiko"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Relatives",
        "Bolin"
      ],
      "text": "After Mako's imprisonment, Bolin visited him in jail, offering him a poster of his mover's finale. Mako was annoyed that Bolin still did not believe him on his word, and urged him to be on the lookout for anything suspicious during the screening. A few hours later, Bolin visited Mako again in prison to personally recall his rescue of President Raiko. Mako was delivered the news of his release and received an apology from Bolin for ever having doubted him. Mako readily accepted it, and the two brothers shared a hug, rekindling their relationship."
    },
    {
      "body": "From their quest to find airbending recruits onward, Mako spent more time with his brother. He displayed a great deal of faith in his brother's abilities, entrusting him to land a shot on P'Li's forehead during a stressful situation and encouraging him to metalbend the bars of their cell in the Earth Kingdom.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Relatives",
        "Bolin"
      ],
      "text": "From their quest to find airbending recruits onward, Mako spent more time with his brother. He displayed a great deal of faith in his brother's abilities, entrusting him to land a shot on P'Li's forehead during a stressful situation and encouraging him to metalbend the bars of their cell in the Earth Kingdom."
    },
    {
      "body": "However, after Bolin joined ${link_0} following the ${link_1}, the brothers lost sight of one other due to Bolin traveling the Earth Kingdom and Mako staying in Republic City, though they kept in touch regularly via letters. They had a falling out, however, over Kuvira and her motives, though when Bolin returned to Republic City, having defected from Kuvira's army, Mako was merely glad to see his brother safe and sound as he had been worried about him. When Bolin apologized and declared himself to be an idiot for having ignored Mako's advice, Mako readily accepted the apology, though waved off the \"idiot\"-remark, noting that Bolin had only been doing what he thought was right.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "insurrection of the Red Lotus",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Insurrection_of_the_Red_Lotus",
            "page": "Insurrection_of_the_Red_Lotus"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Relatives",
        "Bolin"
      ],
      "text": "However, after Bolin joined Kuvira following the insurrection of the Red Lotus, the brothers lost sight of one other due to Bolin traveling the Earth Kingdom and Mako staying in Republic City, though they kept in touch regularly via letters. They had a falling out, however, over Kuvira and her motives, though when Bolin returned to Republic City, having defected from Kuvira's army, Mako was merely glad to see his brother safe and sound as he had been worried about him. When Bolin apologized and declared himself to be an idiot for having ignored Mako's advice, Mako readily accepted the apology, though waved off the \"idiot\"-remark, noting that Bolin had only been doing what he thought was right."
    },
    {
      "body": "It is suggested that Mako was close to his parents, particularly his father, ${link_0}. When he was eight, he witnessed a firebender mugger murder both his mother and father, leaving him orphaned on the streets with his brother, Bolin, who was six at the time. His only remaining relic of them is his father's scarf that he almost always wears. Asami had bought him a new silk scarf, but Mako never wore it, explaining that he felt as though his father's scarf kept him safe. He has a deep attachment to it. Eleven years later, when Mako and Bolin met their family in ${link_1} for the first time, Mako solemnly told them of their parents' demise. Seeing how sad his paternal grandmother, ${link_2}, was at the loss of her son, Mako decided to give her his scarf, feeling she needed it more.",
      "links": [
        {
          "body": "San",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/San",
            "page": "San"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Yin",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Yin",
            "page": "Yin"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Relatives",
        "Parents"
      ],
      "text": "It is suggested that Mako was close to his parents, particularly his father, San. When he was eight, he witnessed a firebender mugger murder both his mother and father, leaving him orphaned on the streets with his brother, Bolin, who was six at the time. His only remaining relic of them is his father's scarf that he almost always wears. Asami had bought him a new silk scarf, but Mako never wore it, explaining that he felt as though his father's scarf kept him safe. He has a deep attachment to it. Eleven years later, when Mako and Bolin met their family in Ba Sing Se for the first time, Mako solemnly told them of their parents' demise. Seeing how sad his paternal grandmother, Yin, was at the loss of her son, Mako decided to give her his scarf, feeling she needed it more."
    },
    {
      "body": "Mako met ${link_0} after she accidentally hit him with her moped. Initially, he was angry at her due to her lack of attentiveness to other people on the road, but immediately forgot his train of thought the moment he laid eyes on her. When she invited him to go on a date as an apology for the incident, the love-struck firebender gladly accepted. Their relationship hit off immediately and they spent a lot of time together. While enjoying a romantic carriage ride through ${link_1}, Mako entrusted in Asami that his red scarf was the only memento he still had of his deceased father. After Asami told him that she had lost her mother at a young age as well, they locked in an intimate embrace.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Republic City Park",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar_Korra_Park",
            "page": "Avatar_Korra_Park"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Asami Sato"
      ],
      "text": "Mako met Asami after she accidentally hit him with her moped. Initially, he was angry at her due to her lack of attentiveness to other people on the road, but immediately forgot his train of thought the moment he laid eyes on her. When she invited him to go on a date as an apology for the incident, the love-struck firebender gladly accepted. Their relationship hit off immediately and they spent a lot of time together. While enjoying a romantic carriage ride through Republic City Park, Mako entrusted in Asami that his red scarf was the only memento he still had of his deceased father. After Asami told him that she had lost her mother at a young age as well, they locked in an intimate embrace."
    },
    {
      "body": "Even when training for the big Pro-bending Tournament, Mako made time to go out on dates with Asami, and she was present after every match to congratulate him and the team. When ${link_0} confessed her true romantic feelings to him, Mako turned her down, using his own romantic relationship with Asami as an excuse.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Asami Sato"
      ],
      "text": "Even when training for the big Pro-bending Tournament, Mako made time to go out on dates with Asami, and she was present after every match to congratulate him and the team. When Korra confessed her true romantic feelings to him, Mako turned her down, using his own romantic relationship with Asami as an excuse."
    },
    {
      "body": "Asami invited Mako and his brother to stay in the ${link_0} after the Pro-bending Arena was closed down following the Equalists' attack. When the Satos were investigated on Korra's suspicions, Mako defended Asami against the Avatar, even going so far as threatening to end his friendship with Korra if she continued to berate Asami. After it was proven that Hiroshi Sato was working with the Equalists, Mako comforted the distraught Asami after taking Korra's advice when they left the Sato estate.",
      "links": [
        {
          "body": "Sato estate",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sato_estate",
            "page": "Sato_estate"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Asami Sato"
      ],
      "text": "Asami invited Mako and his brother to stay in the Sato estate after the Pro-bending Arena was closed down following the Equalists' attack. When the Satos were investigated on Korra's suspicions, Mako defended Asami against the Avatar, even going so far as threatening to end his friendship with Korra if she continued to berate Asami. After it was proven that Hiroshi Sato was working with the Equalists, Mako comforted the distraught Asami after taking Korra's advice when they left the Sato estate."
    },
    {
      "body": "After ${link_0} busted her, Mako, and Bolin out of jail, Asami ran toward Mako, who asked if she was all right. Asami confirmed, and they kissed. However, after hearing of Korra's capture, Mako barely paid any attention to Asami, and she learned from Bolin that Korra and Mako had kissed, making it hard for her to trust him. While he carried Korra in his arms, he bypassed everybody, even Bolin, and focused his attention solely on Korra in that moment, greatly upsetting Asami.",
      "links": [
        {
          "body": "Lin Beifong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Asami Sato"
      ],
      "text": "After Lin Beifong busted her, Mako, and Bolin out of jail, Asami ran toward Mako, who asked if she was all right. Asami confirmed, and they kissed. However, after hearing of Korra's capture, Mako barely paid any attention to Asami, and she learned from Bolin that Korra and Mako had kissed, making it hard for her to trust him. While he carried Korra in his arms, he bypassed everybody, even Bolin, and focused his attention solely on Korra in that moment, greatly upsetting Asami."
    },
    {
      "body": "Having knowledge of Mako and Korra's past relationship and her suspicions confirmed, she became upset and jealous. When confronted about his kiss with Korra and his romantic feelings for the Avatar, Mako looked away guiltily and denied her accusation, stating that his reaction to Korra's capture was justified. Asami was left disappointed and hurt when Mako could not reassure her that she was just imagining things. Feeling betrayed, she ignored Mako and even told him to sit in the back seat of the Satomobile with Korra. She felt even more marginalized when Mako's attention was focused on Korra after Amon attacked Republic City, despite the fact her boyfriend was aware of how insecure she was feeling.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Asami Sato"
      ],
      "text": "Having knowledge of Mako and Korra's past relationship and her suspicions confirmed, she became upset and jealous. When confronted about his kiss with Korra and his romantic feelings for the Avatar, Mako looked away guiltily and denied her accusation, stating that his reaction to Korra's capture was justified. Asami was left disappointed and hurt when Mako could not reassure her that she was just imagining things. Feeling betrayed, she ignored Mako and even told him to sit in the back seat of the Satomobile with Korra. She felt even more marginalized when Mako's attention was focused on Korra after Amon attacked Republic City, despite the fact her boyfriend was aware of how insecure she was feeling."
    },
    {
      "body": "During the ${link_0}, Mako and Asami separated. However, they appeared to reconcile prior to him leaving with Korra to face Amon, as he told her that he would always care about her.",
      "links": [
        {
          "body": "battle for Republic City",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Battle_for_Republic_City",
            "page": "Battle_for_Republic_City"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Asami Sato"
      ],
      "text": "During the battle for Republic City, Mako and Asami separated. However, they appeared to reconcile prior to him leaving with Korra to face Amon, as he told her that he would always care about her."
    },
    {
      "body": "After Asami assumed control of Future Industries, she found herself struggling to turn profits, and shipments of goods to the South were being stolen. Mako decided to help her find out who was responsible by setting up a sting operation with the ${link_0}. While on the ship, Mako told Asami about he and Korra's split. The firebender soon overheard triad members talking about the operation being a setup, and the two escaped from the ship, barely outrunning triad members in pursuit. They rushed to a warehouse where Asami was keeping all of Future Industries inventory, only to find it had all been stolen. Mako tried to comfort his downbeat friend, who was ready to give up on everything. Touched by Mako's concern for her and her company, Asami kissed him. Mako quickly pulled away, clearly confused, while Asami apologized.",
      "links": [
        {
          "body": "Triple Threat Triad",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Asami Sato"
      ],
      "text": "After Asami assumed control of Future Industries, she found herself struggling to turn profits, and shipments of goods to the South were being stolen. Mako decided to help her find out who was responsible by setting up a sting operation with the Triple Threat Triad. While on the ship, Mako told Asami about he and Korra's split. The firebender soon overheard triad members talking about the operation being a setup, and the two escaped from the ship, barely outrunning triad members in pursuit. They rushed to a warehouse where Asami was keeping all of Future Industries inventory, only to find it had all been stolen. Mako tried to comfort his downbeat friend, who was ready to give up on everything. Touched by Mako's concern for her and her company, Asami kissed him. Mako quickly pulled away, clearly confused, while Asami apologized."
    },
    {
      "body": "Mako later found out through ${link_0} that ${link_1} was responsible for the act, and rushed to Future Industries to inform Asami, only to find out that she had closed a deal with the industrialist that allowed him to buy majority control of the company, thus saving her and Future Industries. The firebender reluctantly backed away upon hearing the news.",
      "links": [
        {
          "body": "Two Toed Ping",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Two_Toed_Ping",
            "page": "Two_Toed_Ping"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Asami Sato"
      ],
      "text": "Mako later found out through Two Toed Ping that Varrick was responsible for the act, and rushed to Future Industries to inform Asami, only to find out that she had closed a deal with the industrialist that allowed him to buy majority control of the company, thus saving her and Future Industries. The firebender reluctantly backed away upon hearing the news."
    },
    {
      "body": "In the days after, Mako and Asami's relationship gradually began to grow more intimate, although they kept it secretive to the outside world, denying any kind of involvement when someone pointed it out. However, Asami was shocked when Mako was arrested on the charges of robbing the Future Industries' warehouse, and was unable to believe it. Later, when Mako released after Bolin saved Raiko and proved Varrick as the criminal, Asami smiled warmly, but before she could embrace Mako, Korra, fresh off her reconnection with the Avatar Spirit, beat her to it, hugging and kissing a surprised Mako. Upon this act of affection, Asami glared at Mako, angered by his infidelity. Yet, relationships set aside, the two seemed to be back as good friends in time to help Korra defeat Vaatu. Later, both joined Korra on her journey to rebuild the Air Nomads.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Asami Sato"
      ],
      "text": "In the days after, Mako and Asami's relationship gradually began to grow more intimate, although they kept it secretive to the outside world, denying any kind of involvement when someone pointed it out. However, Asami was shocked when Mako was arrested on the charges of robbing the Future Industries' warehouse, and was unable to believe it. Later, when Mako released after Bolin saved Raiko and proved Varrick as the criminal, Asami smiled warmly, but before she could embrace Mako, Korra, fresh off her reconnection with the Avatar Spirit, beat her to it, hugging and kissing a surprised Mako. Upon this act of affection, Asami glared at Mako, angered by his infidelity. Yet, relationships set aside, the two seemed to be back as good friends in time to help Korra defeat Vaatu. Later, both joined Korra on her journey to rebuild the Air Nomads."
    },
    {
      "body": "While trying to find ${link_0}, a bomb was set off, and Mako shielded Asami from the blast.",
      "links": [
        {
          "body": "Aiwei",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aiwei",
            "page": "Aiwei"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Asami Sato"
      ],
      "text": "While trying to find Aiwei, a bomb was set off, and Mako shielded Asami from the blast."
    },
    {
      "body": "When Mako first met Korra, he thought she was just another one of Bolin's \"crazy fangirls\" and practically ignored her. Even after he discovered she was the ${link_0} and joined the Fire Ferrets, he was still rather tough on her. When Bolin went missing, Mako was reluctant at first to accept Korra's help in searching for him, but he eventually complied. The two got along quite well and when Korra asked about the fate of his parents, Mako felt comfortable to tell her the truth. Later, they fell asleep against each other, and felt embarrassed when they woke up. However, when infiltrating into an ${link_1} ${link_2}, Korra put her arm around Mako's to look more casual, which he only allowed because she stated that they would attract less attention that way. He also allowed Korra to wear his scarf, which was the only thing he had left of his father. Mako came to respect her as a friend and felt that he and her shared a powerful connection.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "rally",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Rally_building",
            "page": "Rally_building"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "When Mako first met Korra, he thought she was just another one of Bolin's \"crazy fangirls\" and practically ignored her. Even after he discovered she was the Avatar and joined the Fire Ferrets, he was still rather tough on her. When Bolin went missing, Mako was reluctant at first to accept Korra's help in searching for him, but he eventually complied. The two got along quite well and when Korra asked about the fate of his parents, Mako felt comfortable to tell her the truth. Later, they fell asleep against each other, and felt embarrassed when they woke up. However, when infiltrating into an Equalist rally, Korra put her arm around Mako's to look more casual, which he only allowed because she stated that they would attract less attention that way. He also allowed Korra to wear his scarf, which was the only thing he had left of his father. Mako came to respect her as a friend and felt that he and her shared a powerful connection."
    },
    {
      "body": "When Bolin asked some time later what Mako thought of Korra as a girlfriend, he thought the question was about him and Korra, and said she was great, but that it made more sense for him to go for Asami. He took it back when he realized that Bolin meant the question for himself, saying that she was not girlfriend material and he should not date a teammate. That night, Korra confessed her feelings for him after they won the game by saying that she thought they were \"meant for each other\". Unsure, Mako gently rejected her and told her that he did not feel the same way and he was with Asami. However, when his girlfriend walked in and he took her to the side, he darted a sad look while eyeing Korra and Bolin glumly after she had accepted to go on a \"romantic date\" with the earthbender.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "When Bolin asked some time later what Mako thought of Korra as a girlfriend, he thought the question was about him and Korra, and said she was great, but that it made more sense for him to go for Asami. He took it back when he realized that Bolin meant the question for himself, saying that she was not girlfriend material and he should not date a teammate. That night, Korra confessed her feelings for him after they won the game by saying that she thought they were \"meant for each other\". Unsure, Mako gently rejected her and told her that he did not feel the same way and he was with Asami. However, when his girlfriend walked in and he took her to the side, he darted a sad look while eyeing Korra and Bolin glumly after she had accepted to go on a \"romantic date\" with the earthbender."
    },
    {
      "body": "After the end of Korra and Bolin's date, Mako confronted Korra and accused her of playing games with Bolin only to get back at him. Korra saw through his façade and remarked that he was jealous, which he strongly denied, using his relationship with Asami as an excuse. Both of them glared at one another and stormed away. After a particularly rocky match due to their uneasiness with each other, he went out to talk to Korra and confessed his true feelings by saying while she was \"infuriating and drove him crazy\", he still thought she was \"pretty amazing\". However, despite admitting that he had deep feelings for Korra, he also had such feelings for Asami, leaving him confused and unsure of how to handle this. Korra immediately followed this statement by impulsively kissing him; he was stunned, but kissed her back with equal enjoyment. This moment was disrupted by a heartbroken Bolin, who fled from the scene crying. This led to a quick, heated argument between Korra and Mako. After the pro-bending match, they acknowledged that taking their relationship further was causing friction between them and everyone else, agreeing to for now just maintain a casual friendship, despite their mutual affection for each other.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "After the end of Korra and Bolin's date, Mako confronted Korra and accused her of playing games with Bolin only to get back at him. Korra saw through his façade and remarked that he was jealous, which he strongly denied, using his relationship with Asami as an excuse. Both of them glared at one another and stormed away. After a particularly rocky match due to their uneasiness with each other, he went out to talk to Korra and confessed his true feelings by saying while she was \"infuriating and drove him crazy\", he still thought she was \"pretty amazing\". However, despite admitting that he had deep feelings for Korra, he also had such feelings for Asami, leaving him confused and unsure of how to handle this. Korra immediately followed this statement by impulsively kissing him; he was stunned, but kissed her back with equal enjoyment. This moment was disrupted by a heartbroken Bolin, who fled from the scene crying. This led to a quick, heated argument between Korra and Mako. After the pro-bending match, they acknowledged that taking their relationship further was causing friction between them and everyone else, agreeing to for now just maintain a casual friendship, despite their mutual affection for each other."
    },
    {
      "body": "Mako appeared to be very protective and concerned for Korra's safety throughout the championship match and Amon's sudden attack on the arena, defending her from a three-on-one attack after she was knocked down and asking her to be careful when she set off after Amon during his escape. After being saved by ${link_0} Beifong from falling to her death from the arena ceiling, he was the first to run over to hug her and told her he was \"so glad\" she was okay.",
      "links": [
        {
          "body": "Chief",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Chief_of_Police",
            "page": "Chief_of_Police"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "Mako appeared to be very protective and concerned for Korra's safety throughout the championship match and Amon's sudden attack on the arena, defending her from a three-on-one attack after she was knocked down and asking her to be careful when she set off after Amon during his escape. After being saved by Chief Beifong from falling to her death from the arena ceiling, he was the first to run over to hug her and told her he was \"so glad\" she was okay."
    },
    {
      "body": "Mako and Korra's relationship hit another snag when Korra began suspecting Asami's father, ${link_0}, of working with the Equalists. Mako threatened to break off his friendship with Korra if she did not drop her investigation against the Satos. When Korra refused to drop her claim and stated that she was sorry, Mako gave her an angry look and walked away with Asami.",
      "links": [
        {
          "body": "Hiroshi Sato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "Mako and Korra's relationship hit another snag when Korra began suspecting Asami's father, Hiroshi Sato, of working with the Equalists. Mako threatened to break off his friendship with Korra if she did not drop her investigation against the Satos. When Korra refused to drop her claim and stated that she was sorry, Mako gave her an angry look and walked away with Asami."
    },
    {
      "body": "When Korra went with ${link_0}, Lin Beifong, and members of the ${link_1} to look for Hiroshi's ${link_2}, he wanted to go with her, but was told to remain with Bolin and Asami, and was watched by a metalbending officer. Before Korra disappeared down the tunnel, she cast a sad look back at Mako. He looked down out of guilt and shame because of accusing her of formulating lies and threatening to end their friendship earlier. Mako heard the platinum wall close, and with Bolin, he cleverly tricked the metalbender cop watching the three of them by sneezing out fire. The three made their way underground to save the investigating party. Mako and Bolin found Korra and the others unconscious, about to be taken to ${link_3} on Hiroshi's orders. The brothers attempt to get them to safety. While Bolin went to get Tenzin, Mako made his way to Korra, hoisted her onto his back, and started to help his brother drag Chief Beifong, but they were discovered by Hiroshi and some Equalists. It was only when Asami intervened, electrocuting her father with a glove which allowed them to escape to the ${link_4}.",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Metalbending Police Force",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "secret factory",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Equalist_factory",
            "page": "Equalist_factory"
          }
        },
        {
          "body": "Amon",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        },
        {
          "body": "police airship",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Police_airship",
            "page": "Police_airship"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "When Korra went with Tenzin, Lin Beifong, and members of the Metalbending Police Force to look for Hiroshi's secret factory, he wanted to go with her, but was told to remain with Bolin and Asami, and was watched by a metalbending officer. Before Korra disappeared down the tunnel, she cast a sad look back at Mako. He looked down out of guilt and shame because of accusing her of formulating lies and threatening to end their friendship earlier. Mako heard the platinum wall close, and with Bolin, he cleverly tricked the metalbender cop watching the three of them by sneezing out fire. The three made their way underground to save the investigating party. Mako and Bolin found Korra and the others unconscious, about to be taken to Amon on Hiroshi's orders. The brothers attempt to get them to safety. While Bolin went to get Tenzin, Mako made his way to Korra, hoisted her onto his back, and started to help his brother drag Chief Beifong, but they were discovered by Hiroshi and some Equalists. It was only when Asami intervened, electrocuting her father with a glove which allowed them to escape to the police airship."
    },
    {
      "body": "On board the airship, making their way to the Republic City coast, Mako apologized to Korra and admitted that she was right. Korra accepted the apology and invited Mako, Bolin, and Asami to live on Air Temple Island in addition to advising him to comfort his girlfriend in her time of need, despite her feelings for him.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "On board the airship, making their way to the Republic City coast, Mako apologized to Korra and admitted that she was right. Korra accepted the apology and invited Mako, Bolin, and Asami to live on Air Temple Island in addition to advising him to comfort his girlfriend in her time of need, despite her feelings for him."
    },
    {
      "body": "When Korra was crying, feeling like the \"worst Avatar ever\"; Mako and Bolin were the ones trying to look for her along with Asami on Air Temple Island. Mako tried to comfort her by telling her, ${link_0} did not learn all the elements right away and that he, Bolin, and Asami had her back. The four later formed Team Avatar and started to patrol Republic City's streets in order to fight crime. Before getting into the car when another police report aired from the Satomobile radio, Mako let Korra in first and smiled at each other in the car, much to Asami's displeasure. Later, when Mako, Bolin, and Asami were put into the police vehicle after defying Tarrlok; Mako darted Korra a sad look, which Korra returned with a sad expression, saying, \"Tenzin will get you out\".",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "When Korra was crying, feeling like the \"worst Avatar ever\"; Mako and Bolin were the ones trying to look for her along with Asami on Air Temple Island. Mako tried to comfort her by telling her, Aang did not learn all the elements right away and that he, Bolin, and Asami had her back. The four later formed Team Avatar and started to patrol Republic City's streets in order to fight crime. Before getting into the car when another police report aired from the Satomobile radio, Mako let Korra in first and smiled at each other in the car, much to Asami's displeasure. Later, when Mako, Bolin, and Asami were put into the police vehicle after defying Tarrlok; Mako darted Korra a sad look, which Korra returned with a sad expression, saying, \"Tenzin will get you out\"."
    },
    {
      "body": "When Mako learned that Korra was missing, he grew angry and refused to believe that she was gone and led the expedition to find her. After coming to his senses, he became very determined to find her, almost beating up an Equalist in order to obtain a lead to Korra's whereabouts. When Naga returned with Korra on her back, Mako pushed Lin and Tenzin out of the way, demanding that they should \"give her some space\". Asami watched with a sad look as Mako carried Korra in his arms and told her how worried he was about her and how relieved he was that she was okay. Korra responded by telling him that she was okay, smiled, and rested her head against his chest while he carefully carried her atop Oogi. He laid her down, and gently brushed her face and the mark on her cheek to reassure her that she was safe. Korra responded to Mako's touch by relaxing and closing her eyes.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "When Mako learned that Korra was missing, he grew angry and refused to believe that she was gone and led the expedition to find her. After coming to his senses, he became very determined to find her, almost beating up an Equalist in order to obtain a lead to Korra's whereabouts. When Naga returned with Korra on her back, Mako pushed Lin and Tenzin out of the way, demanding that they should \"give her some space\". Asami watched with a sad look as Mako carried Korra in his arms and told her how worried he was about her and how relieved he was that she was okay. Korra responded by telling him that she was okay, smiled, and rested her head against his chest while he carefully carried her atop Oogi. He laid her down, and gently brushed her face and the mark on her cheek to reassure her that she was safe. Korra responded to Mako's touch by relaxing and closing her eyes."
    },
    {
      "body": "Once Korra was back at Air Temple Island, Mako sat at her bedside with a worried look on his face. He held her hand and curled his fingers around it softly, waiting for her to wake up. Asami witnessed this with an angry and hurt expression, though her presence was unknown to Mako. He later asked Asami to boil some water for Korra and she responded to Mako by telling him to heat it up himself because he was a firebender. This led to an argument and Asami storming out of the kitchen. When Republic City finally fell, Mako was the one who comforted Korra, as she sadly watched Air Temple Island fall. He told her that they had to keep moving, and wrapped his arm around her. They walked together into the water pipeline, seeming oblivious to Asami, who appeared to have little emotion showing, and left her trailing behind everyone else.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "Once Korra was back at Air Temple Island, Mako sat at her bedside with a worried look on his face. He held her hand and curled his fingers around it softly, waiting for her to wake up. Asami witnessed this with an angry and hurt expression, though her presence was unknown to Mako. He later asked Asami to boil some water for Korra and she responded to Mako by telling him to heat it up himself because he was a firebender. This led to an argument and Asami storming out of the kitchen. When Republic City finally fell, Mako was the one who comforted Korra, as she sadly watched Air Temple Island fall. He told her that they had to keep moving, and wrapped his arm around her. They walked together into the water pipeline, seeming oblivious to Asami, who appeared to have little emotion showing, and left her trailing behind everyone else."
    },
    {
      "body": "After attending an Equalist rally disguised as chi blockers, Korra, frustrated by one of ${link_0}'s accusations, stated that they should \"go back up there and knock some heads!\" Mako told her to relax, assuring her that ${link_1} ${link_2} would arrive in a few days and that when he arrived, Amon would be the one who was running. Later that night, Korra was sitting awake by Naga when Mako sat down next to her, asking if she could not sleep either. She replied by telling him that she had a pit in her stomach, presumably from nervousness. The two continued to talk, and after Korra reminisced on the past, contemplating that a few months earlier she was in the South Pole practicing for her firebending test, and now she was in the middle of an \"all-out war\". Mako responded by telling her that \"we didn't even know each other then, and now [he couldn't] imagine [his] life without [her] in it\". He continued to describe her as the most loyal, brave, and self-less person he has ever known. Korra answered this by telling him that she also thought that he was \"pretty incredible\". The two shared a smile, and Mako leaned in closer to her, just as Korra told him she should get some sleep. He looked away ruefully and moved back, stating that he should too.",
      "links": [
        {
          "body": "Hiroshi Sato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "General",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#General_3",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh_(United_Forces_general)",
            "page": "Iroh_(United_Forces_general)"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "After attending an Equalist rally disguised as chi blockers, Korra, frustrated by one of Hiroshi Sato's accusations, stated that they should \"go back up there and knock some heads!\" Mako told her to relax, assuring her that General Iroh would arrive in a few days and that when he arrived, Amon would be the one who was running. Later that night, Korra was sitting awake by Naga when Mako sat down next to her, asking if she could not sleep either. She replied by telling him that she had a pit in her stomach, presumably from nervousness. The two continued to talk, and after Korra reminisced on the past, contemplating that a few months earlier she was in the South Pole practicing for her firebending test, and now she was in the middle of an \"all-out war\". Mako responded by telling her that \"we didn't even know each other then, and now [he couldn't] imagine [his] life without [her] in it\". He continued to describe her as the most loyal, brave, and self-less person he has ever known. Korra answered this by telling him that she also thought that he was \"pretty incredible\". The two shared a smile, and Mako leaned in closer to her, just as Korra told him she should get some sleep. He looked away ruefully and moved back, stating that he should too."
    },
    {
      "body": "When Korra said that she was going to face Amon by herself, Mako volunteered to go with her. Korra said, \"You don't have to do that\", in somber tone. He replied back in a strong, but soft manner, \"Yes, I do.\" When Korra and Mako infiltrated the Equalist rally at the former Pro-bending Arena, Mako continued to be very protective of Korra, as he demonstrated by moving to stand in front of her when a pair of Equalist chi blockers cornered them. After Amon taunted Korra by showing her the \"main event\", Tenzin and his family, handcuffed to poles on the stage, Mako touched her arm and stated that Amon was just \"trying to bait\" her. Later, when Amon bloodbent Korra, Mako risked himself by coming out of his hiding spot, angrily demanding Amon to let her go. After she got her bending taken away, he ran through the hallways of the arena with a barely conscious and weak Korra in his arms. She told him that her bending was gone, and he replied that everything would be all right and that they just needed to get out of there. When he almost got his firebending taken away, Korra, although unable to bend, was able to airbend for the first time, defending him. Mako looked in amazement as Korra blasted Amon out the window with her newly discovered airbending. He put his arm around Korra as she leaned on him, watching as Amon rose into the air on his water spout. After failing to stop his escape, he turned around to comfort Korra with a hug.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "When Korra said that she was going to face Amon by herself, Mako volunteered to go with her. Korra said, \"You don't have to do that\", in somber tone. He replied back in a strong, but soft manner, \"Yes, I do.\" When Korra and Mako infiltrated the Equalist rally at the former Pro-bending Arena, Mako continued to be very protective of Korra, as he demonstrated by moving to stand in front of her when a pair of Equalist chi blockers cornered them. After Amon taunted Korra by showing her the \"main event\", Tenzin and his family, handcuffed to poles on the stage, Mako touched her arm and stated that Amon was just \"trying to bait\" her. Later, when Amon bloodbent Korra, Mako risked himself by coming out of his hiding spot, angrily demanding Amon to let her go. After she got her bending taken away, he ran through the hallways of the arena with a barely conscious and weak Korra in his arms. She told him that her bending was gone, and he replied that everything would be all right and that they just needed to get out of there. When he almost got his firebending taken away, Korra, although unable to bend, was able to airbend for the first time, defending him. Mako looked in amazement as Korra blasted Amon out the window with her newly discovered airbending. He put his arm around Korra as she leaned on him, watching as Amon rose into the air on his water spout. After failing to stop his escape, he turned around to comfort Korra with a hug."
    },
    {
      "body": "Later, at the South Pole, Katara attempted to restore Korra's bending, but to no avail. A distraught Korra walked out of the room, and brushed past Mako, leaving him stunned and causing him to run out of the room after her, yelling after her to wait. Korra told him to go away, and after saying that he would, he let her know that he would always be there for her. After Korra stated that she was not the Avatar anymore, and he did not need to do her any more favors, Mako told her that he did not care if she was the Avatar or not. He proceeded to explain that when Tarrlok took her, he was \"losing his mind\" at the thought of never seeing her again, and that he realized that he loved her. Korra responded to him by stuttering out the words \"I can't\", and running out of the compound atop Naga, leaving him looking saddened and shocked. Tenzin approached him and advised him, saying that they needed to remain patient with her, and that it would take time for her to accept what happened. After witnessing Korra in the Avatar State, Mako looked up at her in awe, opening his arms as she ran toward him and embraced him. She subsequently admitted that she loved him as well and they shared a passionate kiss, establishing their new relationship.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "Later, at the South Pole, Katara attempted to restore Korra's bending, but to no avail. A distraught Korra walked out of the room, and brushed past Mako, leaving him stunned and causing him to run out of the room after her, yelling after her to wait. Korra told him to go away, and after saying that he would, he let her know that he would always be there for her. After Korra stated that she was not the Avatar anymore, and he did not need to do her any more favors, Mako told her that he did not care if she was the Avatar or not. He proceeded to explain that when Tarrlok took her, he was \"losing his mind\" at the thought of never seeing her again, and that he realized that he loved her. Korra responded to him by stuttering out the words \"I can't\", and running out of the compound atop Naga, leaving him looking saddened and shocked. Tenzin approached him and advised him, saying that they needed to remain patient with her, and that it would take time for her to accept what happened. After witnessing Korra in the Avatar State, Mako looked up at her in awe, opening his arms as she ran toward him and embraced him. She subsequently admitted that she loved him as well and they shared a passionate kiss, establishing their new relationship."
    },
    {
      "body": "During the following six months, their relationship continued strong, even becoming the talk of the town in Republic City. Despite this, they still faced some troubles. Over their habit of relaying each other their day to day, Mako was inquired on his opinions on Korra's training. When he gave it, he found that Korra perceived his opinions or lack thereof as taking the other's side, despite his assertion that there were no sides and that he and everyone else merely wanted the best for her, and he admitted to not being very good at \"Avatar counseling\". Korra was aware that she could be difficult over the strain of being the Avatar, to which Mako jokingly admitted that being the Avatar's boyfriend was not easy either.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "During the following six months, their relationship continued strong, even becoming the talk of the town in Republic City. Despite this, they still faced some troubles. Over their habit of relaying each other their day to day, Mako was inquired on his opinions on Korra's training. When he gave it, he found that Korra perceived his opinions or lack thereof as taking the other's side, despite his assertion that there were no sides and that he and everyone else merely wanted the best for her, and he admitted to not being very good at \"Avatar counseling\". Korra was aware that she could be difficult over the strain of being the Avatar, to which Mako jokingly admitted that being the Avatar's boyfriend was not easy either."
    },
    {
      "body": "When they returned to Republic City and Mako resumed his job as a police officer, Korra and Mako began having different views on how to handle the brewing civil war between the Water Tribes; Korra insisted on actively taking back her homeland, while Mako tried to avoid conflict and stuck to his duties as an officer first. Mako's sense of duty caused him to inform President Raiko about Korra's plans to go behind his back and secretly seek Southern support from the ${link_0}. Infuriated by this betrayal, Korra confronted Mako, and after a heated argument, the firebender concluded that their two jobs were too incompatible, and he broke up with the Avatar. Later, Mako stared sadly at a photo of him and Korra, reminiscing on the good times he had with her. He remained secretive about his break up to his friends, not wanting to talk about it.",
      "links": [
        {
          "body": "United Forces",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/United_Forces",
            "page": "United_Forces"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "When they returned to Republic City and Mako resumed his job as a police officer, Korra and Mako began having different views on how to handle the brewing civil war between the Water Tribes; Korra insisted on actively taking back her homeland, while Mako tried to avoid conflict and stuck to his duties as an officer first. Mako's sense of duty caused him to inform President Raiko about Korra's plans to go behind his back and secretly seek Southern support from the United Forces. Infuriated by this betrayal, Korra confronted Mako, and after a heated argument, the firebender concluded that their two jobs were too incompatible, and he broke up with the Avatar. Later, Mako stared sadly at a photo of him and Korra, reminiscing on the good times he had with her. He remained secretive about his break up to his friends, not wanting to talk about it."
    },
    {
      "body": "Soon after their break up, Korra was attacked by a dark spirit, which caused her to lose part of her memory, including her split with Mako. As such, she ran up to him and kissed him when he was released from prison, telling him how much she had missed him. Surprised, Mako asked her if she was not mad at him anymore due to their fight, to which Korra explained what had happened to her. Unable to tell her that their argument broke off their relationship, Mako lied and told her the fight had not been that bad when he was asked about it. Mako supported Korra when she was feeling anxious about the upcoming battle.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "Soon after their break up, Korra was attacked by a dark spirit, which caused her to lose part of her memory, including her split with Mako. As such, she ran up to him and kissed him when he was released from prison, telling him how much she had missed him. Surprised, Mako asked her if she was not mad at him anymore due to their fight, to which Korra explained what had happened to her. Unable to tell her that their argument broke off their relationship, Mako lied and told her the fight had not been that bad when he was asked about it. Mako supported Korra when she was feeling anxious about the upcoming battle."
    },
    {
      "body": "After Unalaq's defeat, Mako summoned the courage to talk to Korra about what had really happened during their argument, and that they had actually broken up. Korra informed him that after meditating in the ${link_0}, she had regained that part of her memory, and asked why he had chosen not to tell her the truth. Mako agreed he should have done so, but admitted that he did not want to hurt her again and that he partially wished the split had not happened. They both agreed that even though they would always love each other, their relationship just did not work because of their different goals in life. After sharing one last kiss, they went their separate ways.",
      "links": [
        {
          "body": "Tree of Time",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "After Unalaq's defeat, Mako summoned the courage to talk to Korra about what had really happened during their argument, and that they had actually broken up. Korra informed him that after meditating in the Tree of Time, she had regained that part of her memory, and asked why he had chosen not to tell her the truth. Mako agreed he should have done so, but admitted that he did not want to hurt her again and that he partially wished the split had not happened. They both agreed that even though they would always love each other, their relationship just did not work because of their different goals in life. After sharing one last kiss, they went their separate ways."
    },
    {
      "body": "Two weeks after their break-up, Mako still had a hard time communicating with Korra, trying to avoid interaction whenever possible and declining her help when she offered it. He also turned down Tenzin's offer to stay at Air Temple Island after his and Bolin's ${link_0} became infested with spirit vines, choosing instead to sleep under his desk at the police headquarters. Despite his awkwardness around Korra, Mako still retained his desire to help her, aiding her in the search for the newly emerged airbenders.",
      "links": [
        {
          "body": "apartment",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mako_and_Bolin%27s_apartment",
            "page": "Mako_and_Bolin%27s_apartment"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "Two weeks after their break-up, Mako still had a hard time communicating with Korra, trying to avoid interaction whenever possible and declining her help when she offered it. He also turned down Tenzin's offer to stay at Air Temple Island after his and Bolin's apartment became infested with spirit vines, choosing instead to sleep under his desk at the police headquarters. Despite his awkwardness around Korra, Mako still retained his desire to help her, aiding her in the search for the newly emerged airbenders."
    },
    {
      "body": "When ${link_0} and the ${link_1} attempted to kidnap Korra, Mako showed great concern for her, telling the criminals to let her go and warning ${link_2}'s guards of her capture. He also told Asami that they could not let the four take her. Later, after Korra escaped from the Earth Queen's forces and Mako found her, the two reunited with a tight embrace. Shortly afterward, he quickly let go, realizing the awkwardness of it, though emphasized nonetheless how happy he was to see her. Later, as Korra prepared to surrender herself to the Red Lotus in an effort to save the Air Nomads, she gave Mako a farewell hug, which he happily returned.",
      "links": [
        {
          "body": "Zaheer",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "Zaofu",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Zaofu",
            "page": "Zaofu"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "When Zaheer and the Red Lotus attempted to kidnap Korra, Mako showed great concern for her, telling the criminals to let her go and warning Zaofu's guards of her capture. He also told Asami that they could not let the four take her. Later, after Korra escaped from the Earth Queen's forces and Mako found her, the two reunited with a tight embrace. Shortly afterward, he quickly let go, realizing the awkwardness of it, though emphasized nonetheless how happy he was to see her. Later, as Korra prepared to surrender herself to the Red Lotus in an effort to save the Air Nomads, she gave Mako a farewell hug, which he happily returned."
    },
    {
      "body": "Mako was glad to see Korra again after three years of no contact, though grew disappointed and annoyed when he learned that Korra had been in contact with Asami and not him or his brother. Although tensions ran high between them with constant bickering to follow, they still managed to work well together to save Prince ${link_0}. After escaping Kuvira's men, Mako good-heartedly noted that getting on each other's nerves was just like old times for him and Korra, before they shared a warm embrace. Mako told Prince Wu that Korra had shown him the importance of placing others before himself and that she continues to inspire him.",
      "links": [
        {
          "body": "Wu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wu",
            "page": "Wu"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "Mako was glad to see Korra again after three years of no contact, though grew disappointed and annoyed when he learned that Korra had been in contact with Asami and not him or his brother. Although tensions ran high between them with constant bickering to follow, they still managed to work well together to save Prince Wu. After escaping Kuvira's men, Mako good-heartedly noted that getting on each other's nerves was just like old times for him and Korra, before they shared a warm embrace. Mako told Prince Wu that Korra had shown him the importance of placing others before himself and that she continues to inspire him."
    },
    {
      "body": "At Varrick and Zhu Li's wedding, after Korra thanked him for his role in taking down the Colossus, Mako replied that she did not have to thank him, assured her that he would always be willing to follow her into battle, and that he had her back. When he discovered that Korra had started a relationship with Asami, Mako was taken aback at the fact that both his ex-girlfriends were now dating each other, but he was nevertheless happy for the two of them. He later told Korra that he thought she and Asami were perfect for each other, adding that having dated both of them himself, he was the most qualified person to make that conclusion.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Love interests",
        "Korra"
      ],
      "text": "At Varrick and Zhu Li's wedding, after Korra thanked him for his role in taking down the Colossus, Mako replied that she did not have to thank him, assured her that he would always be willing to follow her into battle, and that he had her back. When he discovered that Korra had started a relationship with Asami, Mako was taken aback at the fact that both his ex-girlfriends were now dating each other, but he was nevertheless happy for the two of them. He later told Korra that he thought she and Asami were perfect for each other, adding that having dated both of them himself, he was the most qualified person to make that conclusion."
    },
    {
      "body": "Though Mako felt empathy at first for the new airbender upon discovering he was an orphan, his view changed after he learned that ${link_0} was a thief and he later warned the young boy that he would keep an eye on him. When the young airbender ran off, Mako initially refused to search for him, believing Kai did not care about the group, but did so after being reminded by Tenzin that he was their responsibility. Later, when Kai was forcefully enlisted into the Earth Queen's first airbending regiment, Mako, Bolin, and Jinora were able to rescue him, but while Bolin was quick to accept Kai's apology for getting them stuck in the Lower Ring and stealing their wallets, Mako was more hesitant, remarking that he had a lot of money in his wallet.",
      "links": [
        {
          "body": "Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kai",
            "page": "Kai"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Allies",
        "Kai"
      ],
      "text": "Though Mako felt empathy at first for the new airbender upon discovering he was an orphan, his view changed after he learned that Kai was a thief and he later warned the young boy that he would keep an eye on him. When the young airbender ran off, Mako initially refused to search for him, believing Kai did not care about the group, but did so after being reminded by Tenzin that he was their responsibility. Later, when Kai was forcefully enlisted into the Earth Queen's first airbending regiment, Mako, Bolin, and Jinora were able to rescue him, but while Bolin was quick to accept Kai's apology for getting them stuck in the Lower Ring and stealing their wallets, Mako was more hesitant, remarking that he had a lot of money in his wallet."
    },
    {
      "body": "Mako's attitude toward Kai became more positive after the latter rescued him, together with Bolin, Tenzin, and Asami, from the Northern Air Temple as it collapsed due to ${link_0}'s ${link_1}. Later, as they were preparing to leave to rescue Korra and the imprisoned airbenders, Mako thanked Kai for coming back to help them and apologized for having been hard on him before, although the two of them jokingly agreed that Kai had deserved it.",
      "links": [
        {
          "body": "Ghazan",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ghazan",
            "page": "Ghazan"
          }
        },
        {
          "body": "lavabending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lavabending",
            "page": "Lavabending"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Allies",
        "Kai"
      ],
      "text": "Mako's attitude toward Kai became more positive after the latter rescued him, together with Bolin, Tenzin, and Asami, from the Northern Air Temple as it collapsed due to Ghazan's lavabending. Later, as they were preparing to leave to rescue Korra and the imprisoned airbenders, Mako thanked Kai for coming back to help them and apologized for having been hard on him before, although the two of them jokingly agreed that Kai had deserved it."
    },
    {
      "body": "Pabu is the pet of Mako's younger brother, Bolin. While he does not show any apparent feelings toward the ${link_0}, Maku tolerates the creature living with them in close proximity, and when Bolin was kidnapped by the Equalists, he allowed Pabu to ride and sleep on his shoulder.",
      "links": [
        {
          "body": "fire ferret",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_ferret",
            "page": "Fire_ferret"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Allies",
        "Pabu"
      ],
      "text": "Pabu is the pet of Mako's younger brother, Bolin. While he does not show any apparent feelings toward the fire ferret, Maku tolerates the creature living with them in close proximity, and when Bolin was kidnapped by the Equalists, he allowed Pabu to ride and sleep on his shoulder."
    },
    {
      "body": "When Mako and Bolin were living on the streets, they became friends with Skoochy around the time he escaped his second orphanage. Skoochy and his friends quite often hang around the Central Station. When Bolin was missing, Mako and Korra went to Skoochy for information, and he did help them, at the cost of a few yuans on Mako's part. He told Mako that Bolin was paid a lot of yuans to help the Triple Threat Triad, which disturbed Mako.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Allies",
        "Skoochy"
      ],
      "text": "When Mako and Bolin were living on the streets, they became friends with Skoochy around the time he escaped his second orphanage. Skoochy and his friends quite often hang around the Central Station. When Bolin was missing, Mako and Korra went to Skoochy for information, and he did help them, at the cost of a few yuans on Mako's part. He told Mako that Bolin was paid a lot of yuans to help the Triple Threat Triad, which disturbed Mako."
    },
    {
      "body": "After Hiroshi was discovered to be an Equalist, Tenzin and his family did not mind when Korra invited Mako, Bolin, and Asami to live on Air Temple Island. When they arrived on Air Temple Island, Jinora, Ikki, and Meelo gave Mako and Bolin a tour. Tenzin later advised Mako on how he should deal with Korra who had to come to terms with the loss of her bending.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Allies",
        "Tenzin and his family"
      ],
      "text": "After Hiroshi was discovered to be an Equalist, Tenzin and his family did not mind when Korra invited Mako, Bolin, and Asami to live on Air Temple Island. When they arrived on Air Temple Island, Jinora, Ikki, and Meelo gave Mako and Bolin a tour. Tenzin later advised Mako on how he should deal with Korra who had to come to terms with the loss of her bending."
    },
    {
      "body": "Mako did not formally meet Tonraq until Korra introduced Mako to him in the Southern Water Tribe. Tonraq was initially hostile to the firebender, however the tensions soon ceased. Mako later offered to watch over and protect Korra when they traveled to the South Pole, a move that began to endear him to the waterbender. Despite Mako breaking up with Tonraq's daughter, the two remained on warm terms, with the firebender bowing respectfully to the Southern chief and receiving a welcoming smile back.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Allies",
        "Tonraq"
      ],
      "text": "Mako did not formally meet Tonraq until Korra introduced Mako to him in the Southern Water Tribe. Tonraq was initially hostile to the firebender, however the tensions soon ceased. Mako later offered to watch over and protect Korra when they traveled to the South Pole, a move that began to endear him to the waterbender. Despite Mako breaking up with Tonraq's daughter, the two remained on warm terms, with the firebender bowing respectfully to the Southern chief and receiving a welcoming smile back."
    },
    {
      "body": "Toza is a former pro-bender and current gym manager at the Pro-bending Arena. One day Toza discovered Mako fighting on the streets and invited him and Bolin to live in the attic of the arena. The brothers had to work strange jobs to pay their rent, which helped them focus on pro-bending. Overall, he was very good to them.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Allies",
        "Toza"
      ],
      "text": "Toza is a former pro-bender and current gym manager at the Pro-bending Arena. One day Toza discovered Mako fighting on the streets and invited him and Bolin to live in the attic of the arena. The brothers had to work strange jobs to pay their rent, which helped them focus on pro-bending. Overall, he was very good to them."
    },
    {
      "body": "Mako's relationship with ${link_0} was of a professional nature, as he was assigned to be the royal's bodyguard. Having to accompany him wherever he went and witnessing Wu's many quirks, Mako soon grew annoyed with the prince and could not wait until the royal would return to Ba Sing Se. He was genuinely distressed when he learned that Raiko had signed off on his transfer to the Earth Kingdom capital to permanently become the prince's bodyguard on the latter's request. He generally managed to keep his irritation in check, though when he saw Wu break down into tears after his failed coronation, Mako directly pointed out that his behavior has brought out contempt from others, which was an honesty the prince could respect. Despite his irritation with the prince, Mako took his job seriously and never left the royal's side, even when Wu needed to use the facilities. As such, Mako held himself responsible when the prince had been ${link_1} during the one time he had been too annoyed to accompany him to the bathroom and went through great lengths to track Wu down. After saving the prince, Mako brought him to the ${link_2}, where he would stay with Yin and the rest of his family. Although he still saw the prince as a weakling who had \"Wu down\" as his catchphrase, Mako felt comfortable enough to relay his brief history and relationships to the royal when he asked about it.",
      "links": [
        {
          "body": "Wu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wu",
            "page": "Wu"
          }
        },
        {
          "body": "kidnapped",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Attempted_kidnapping_of_Prince_Wu",
            "page": "Attempted_kidnapping_of_Prince_Wu"
          }
        },
        {
          "body": "Sato estate",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Sato_estate",
            "page": "Sato_estate"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Allies",
        "Wu"
      ],
      "text": "Mako's relationship with Wu was of a professional nature, as he was assigned to be the royal's bodyguard. Having to accompany him wherever he went and witnessing Wu's many quirks, Mako soon grew annoyed with the prince and could not wait until the royal would return to Ba Sing Se. He was genuinely distressed when he learned that Raiko had signed off on his transfer to the Earth Kingdom capital to permanently become the prince's bodyguard on the latter's request. He generally managed to keep his irritation in check, though when he saw Wu break down into tears after his failed coronation, Mako directly pointed out that his behavior has brought out contempt from others, which was an honesty the prince could respect. Despite his irritation with the prince, Mako took his job seriously and never left the royal's side, even when Wu needed to use the facilities. As such, Mako held himself responsible when the prince had been kidnapped during the one time he had been too annoyed to accompany him to the bathroom and went through great lengths to track Wu down. After saving the prince, Mako brought him to the Sato estate, where he would stay with Yin and the rest of his family. Although he still saw the prince as a weakling who had \"Wu down\" as his catchphrase, Mako felt comfortable enough to relay his brief history and relationships to the royal when he asked about it."
    },
    {
      "body": "Mako met Varrick as Asami's eccentric business partner, the one who was going to save her company. Since both of them were opposing Unalaq at that time, they created a bond of trust between them, with Mako willingly including Varrick in any plans that he had, unbeknownst of the businessman's hidden agenda, and Varrick offering any necessary resource.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Neutral",
        "Varrick"
      ],
      "text": "Mako met Varrick as Asami's eccentric business partner, the one who was going to save her company. Since both of them were opposing Unalaq at that time, they created a bond of trust between them, with Mako willingly including Varrick in any plans that he had, unbeknownst of the businessman's hidden agenda, and Varrick offering any necessary resource."
    },
    {
      "body": "However, after the ${link_0}, Mako conducted an investigation, using a confiscated remote detonator as his lead. When he visited Varrick's mover set to ask him some questions, he discovered that the technology used for remote detonators was a ${link_1} exclusive, thus incriminating Varrick as the true culprit behind the bombings. Determined to prove Varrick's foul play, Mako set out to gather the proof he needed. Knowing Mako was hot on his trail, Varrick attempted to put him under his employ, implying that something might befall Asami and Bolin if he declined.",
      "links": [
        {
          "body": "bombing of the Southern Water Tribe Cultural Center",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bombing_of_the_Southern_Water_Tribe_Cultural_Center",
            "page": "Bombing_of_the_Southern_Water_Tribe_Cultural_Center"
          }
        },
        {
          "body": "Varrick Global Industries",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Varrick_Global_Industries",
            "page": "Varrick_Global_Industries"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Neutral",
        "Varrick"
      ],
      "text": "However, after the bombing of the Southern Water Tribe Cultural Center, Mako conducted an investigation, using a confiscated remote detonator as his lead. When he visited Varrick's mover set to ask him some questions, he discovered that the technology used for remote detonators was a Varrick Global Industries exclusive, thus incriminating Varrick as the true culprit behind the bombings. Determined to prove Varrick's foul play, Mako set out to gather the proof he needed. Knowing Mako was hot on his trail, Varrick attempted to put him under his employ, implying that something might befall Asami and Bolin if he declined."
    },
    {
      "body": "Convinced of Varrick's guilt, Mako continued his quest for proof, though this led to his arrest when Varrick framed him for the bombing on the Southern Water Tribe Cultural Center. After Varrick was exposed as the mastermind behind the attacks on the cultural center and the thefts on Asami's company, the businessman was arrested and Mako was released. The firebender later visited him in prison, where he showed resentment toward the eccentric man, whom the former felt had little remorse for his actions, although he emphasized that he had done it solely to instigate a war as opposed to a personal grief against Mako. Despite his animosity toward Varrick, Mako readily accepted his help when he offered his personal battleship to Team Avatar to use in their fight against Unalaq. Upon meeting the fugitive in Zaofu, Mako, along with Asami and Lin, still see him as a criminal and still maintain a personal grudge against him.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Neutral",
        "Varrick"
      ],
      "text": "Convinced of Varrick's guilt, Mako continued his quest for proof, though this led to his arrest when Varrick framed him for the bombing on the Southern Water Tribe Cultural Center. After Varrick was exposed as the mastermind behind the attacks on the cultural center and the thefts on Asami's company, the businessman was arrested and Mako was released. The firebender later visited him in prison, where he showed resentment toward the eccentric man, whom the former felt had little remorse for his actions, although he emphasized that he had done it solely to instigate a war as opposed to a personal grief against Mako. Despite his animosity toward Varrick, Mako readily accepted his help when he offered his personal battleship to Team Avatar to use in their fight against Unalaq. Upon meeting the fugitive in Zaofu, Mako, along with Asami and Lin, still see him as a criminal and still maintain a personal grudge against him."
    },
    {
      "body": "Mako, alongside Korra, first encountered the ${link_0} when they were searching for Bolin, who had been kidnapped while working for the Triple Threat Triad. Mako and Korra, on their search for Bolin, saw him being taken away in a truck and followed it. They lost track of the truck when two Equalists turned around and fought them. The two Equalists, after ${link_1}, took off. After this, Korra and Mako went to the park in search of the ${link_2} Korra had met when she had arrived at Republic City. They met the man and found out about a rally Amon was having that night, where he would disclose a \"revelation\". Using the fliers the protester had, Mako and Korra found out where the rally was taking place. They went to the building and witnessed ${link_3} taking people's ${link_4} away. Bolin was in line to get his bending taken away, but Mako, with Korra's help, managed to grab Bolin in time and the three of them managed to escape.",
      "links": [
        {
          "body": "Equalists",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "blocking Mako and Korra's chi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Chi_blocking",
            "page": "Chi_blocking"
          }
        },
        {
          "body": "protester",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Protester",
            "page": "Protester"
          }
        },
        {
          "body": "Amon",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        },
        {
          "body": "bending",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Enemies",
        "Amon and the Equalists"
      ],
      "text": "Mako, alongside Korra, first encountered the Equalists when they were searching for Bolin, who had been kidnapped while working for the Triple Threat Triad. Mako and Korra, on their search for Bolin, saw him being taken away in a truck and followed it. They lost track of the truck when two Equalists turned around and fought them. The two Equalists, after blocking Mako and Korra's chi, took off. After this, Korra and Mako went to the park in search of the protester Korra had met when she had arrived at Republic City. They met the man and found out about a rally Amon was having that night, where he would disclose a \"revelation\". Using the fliers the protester had, Mako and Korra found out where the rally was taking place. They went to the building and witnessed Amon taking people's bending away. Bolin was in line to get his bending taken away, but Mako, with Korra's help, managed to grab Bolin in time and the three of them managed to escape."
    },
    {
      "body": "${link_0} is the former waterbending member of the Fire Ferrets. During a tournament-qualifying match against the Golden Temple Tigerdillos, Hasook was continually attacked by his opponents, being slow to react. In the third round of the match, he was hit early and knocked into Bolin. Both were eventually sent out of the ring, and although Mako won the match with a hat trick, he chastised Hasook for his poor play, thinking the waterbender to be useless. Hasook, frustrated by Mako, threw his helmet on the floor and walked out of the arena. He did not show up for the final qualifier, nearly forcing the Fire Ferrets to forfeit before Korra took Hasook's place.",
      "links": [
        {
          "body": "Hasook",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hasook",
            "page": "Hasook"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Enemies",
        "Hasook"
      ],
      "text": "Hasook is the former waterbending member of the Fire Ferrets. During a tournament-qualifying match against the Golden Temple Tigerdillos, Hasook was continually attacked by his opponents, being slow to react. In the third round of the match, he was hit early and knocked into Bolin. Both were eventually sent out of the ring, and although Mako won the match with a hat trick, he chastised Hasook for his poor play, thinking the waterbender to be useless. Hasook, frustrated by Mako, threw his helmet on the floor and walked out of the arena. He did not show up for the final qualifier, nearly forcing the Fire Ferrets to forfeit before Korra took Hasook's place."
    },
    {
      "body": "After Asami nearly ran Mako over with her moped, she invited him to dinner, where he discovered she was the daughter of ${link_0}, the creator of ${link_1}. After Asami told her father about Mako's situation, he told Mako that he too came from \"humble beginnings\" as a shoe shiner with just an idea: the Satomobile. He agreed to finance the Fire Ferrets, giving them the thirty-thousand ${link_2} the team needed to compete in the tournament, only under the condition that they agreed to wear the Future Industries logo on their uniforms.",
      "links": [
        {
          "body": "Hiroshi Sato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Satomobiles",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Satomobile",
            "page": "Satomobile"
          }
        },
        {
          "body": "yuans",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Currency#United_Republic_of_Nations",
            "page": "Currency"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Enemies",
        "Hiroshi Sato"
      ],
      "text": "After Asami nearly ran Mako over with her moped, she invited him to dinner, where he discovered she was the daughter of Hiroshi Sato, the creator of Satomobiles. After Asami told her father about Mako's situation, he told Mako that he too came from \"humble beginnings\" as a shoe shiner with just an idea: the Satomobile. He agreed to finance the Fire Ferrets, giving them the thirty-thousand yuans the team needed to compete in the tournament, only under the condition that they agreed to wear the Future Industries logo on their uniforms."
    },
    {
      "body": "Mako later learned that Korra was suspicious that Hiroshi was helping the Equalists, but originally thought that it was not true, and Korra was just thinking this out of jealousy. He even went as far as threatening to end their friendship if she did not stop with the accusations. Later, however, he discovered that Hiroshi was in fact an Equalist, upsetting him deeply. After Tenzin, Korra, and Lin and her officers were defeated by Hiroshi's mecha tanks, Mako, along with Bolin, confronted him, claiming that everything Hiroshi had done for them was just a cover-up. Hiroshi confirmed this, stating that the most difficulty he had with it was witnessing his daughter fall for a \"firebending street rat\" and prepared to attack. After intervention from Asami, they managed to escape. Mako later apologized to Korra about not believing her, claiming that Hiroshi as an Equalist was hard to believe, even at that time.",
      "links": [],
      "section": [
        "Mako's relationships",
        "Enemies",
        "Hiroshi Sato"
      ],
      "text": "Mako later learned that Korra was suspicious that Hiroshi was helping the Equalists, but originally thought that it was not true, and Korra was just thinking this out of jealousy. He even went as far as threatening to end their friendship if she did not stop with the accusations. Later, however, he discovered that Hiroshi was in fact an Equalist, upsetting him deeply. After Tenzin, Korra, and Lin and her officers were defeated by Hiroshi's mecha tanks, Mako, along with Bolin, confronted him, claiming that everything Hiroshi had done for them was just a cover-up. Hiroshi confirmed this, stating that the most difficulty he had with it was witnessing his daughter fall for a \"firebending street rat\" and prepared to attack. After intervention from Asami, they managed to escape. Mako later apologized to Korra about not believing her, claiming that Hiroshi as an Equalist was hard to believe, even at that time."
    },
    {
      "body": "Since the ${link_0} attempted to kidnap and harm Korra in order to further their anarchistic world goals, they were a direct enemy of her close friends. Unlike his younger brother, who had developed a loose mutual respect for Ghazan, Mako saw them as nothing more than criminals who needed to be stopped.",
      "links": [
        {
          "body": "Red Lotus",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Red_Lotus",
            "page": "Red_Lotus"
          }
        }
      ],
      "section": [
        "Mako's relationships",
        "Enemies",
        "Red Lotus"
      ],
      "text": "Since the Red Lotus attempted to kidnap and harm Korra in order to further their anarchistic world goals, they were a direct enemy of her close friends. Unlike his younger brother, who had developed a loose mutual respect for Ghazan, Mako saw them as nothing more than criminals who needed to be stopped."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Mako%27s_relationships",
    "file": "avatar.wikia.com/wiki/Mako's_relationships.html",
    "page": "Mako's_relationships",
    "title": "Mako's relationships"
  }
}