{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Equipment",
      "target": {
        "external": false,
        "href": "/wiki/Category_Equipment",
        "page": "Category_Equipment"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Military",
      "target": {
        "external": false,
        "href": "/wiki/Category_Military",
        "page": "Category_Military"
      }
    },
    {
      "body": "Objects",
      "target": {
        "external": false,
        "href": "/wiki/Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Vehicles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Vehicles",
        "page": "Category_Vehicles"
      }
    },
    {
      "body": "Weapons",
      "target": {
        "external": false,
        "href": "/wiki/Category_Weapons",
        "page": "Category_Weapons"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The mecha suit is an improved version of the platinum ${link_0} built by ${link_1}. To serve the ${link_2}, ${link_3} modernized those tanks to be more sleek and humanoid in design, allowing for greater mobility.",
      "links": [
        {
          "body": "mecha tanks",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "military of the Earth Empire",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "section": [
        "Mecha suit"
      ],
      "text": "The mecha suit is an improved version of the platinum mecha tanks built by Hiroshi Sato. To serve the military of the Earth Empire, Varrick modernized those tanks to be more sleek and humanoid in design, allowing for greater mobility."
    },
    {
      "body": "${link_0}'s army employed several battalions of mecha suits. In 174 ${link_1}, after the ${link_2} of the ${link_3} state of ${link_4} signed Kuvira's offer, they were deployed in the state's capital to secure the protection of its citizens. Upon their arrival, the pilots allowed children to play around in the vehicles.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "AG",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "governor",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Governor_of_Yi",
            "page": "Governor_of_Yi"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Yi",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Yi",
            "page": "Yi"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "History"
      ],
      "text": "Kuvira's army employed several battalions of mecha suits. In 174 AG, after the governor of the Earth Kingdom state of Yi signed Kuvira's offer, they were deployed in the state's capital to secure the protection of its citizens. Upon their arrival, the pilots allowed children to play around in the vehicles."
    },
    {
      "body": "After ${link_0} and Varrick became aware of Kuvira's darker nature, the two men and ${link_1} deserted the army, each securing a mecha suit to facilitate their escape. While debating on their course of action, they were ambushed by ${link_2} and two army sergeants, who were also each piloting a suit. In the ensuing battle, Bolin's suit and those of the two sergeants were destroyed.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Zhu Li",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        },
        {
          "body": "Baatar Jr.",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Baatar_Jr",
            "page": "Baatar_Jr"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "History"
      ],
      "text": "After Bolin and Varrick became aware of Kuvira's darker nature, the two men and Zhu Li deserted the army, each securing a mecha suit to facilitate their escape. While debating on their course of action, they were ambushed by Baatar Jr. and two army sergeants, who were also each piloting a suit. In the ensuing battle, Bolin's suit and those of the two sergeants were destroyed."
    },
    {
      "body": "When ${link_0} and ${link_1} violated the peace agreement Kuvira had set up with Korra, she ordered her army to attack the Avatar and the two airbenders. Although the infantry was blown backward by the whirlwind Opal and Jinora created, the mecha suits managed to push through. Before they could reach the women, however, ${link_2} swooped down on ${link_3} and barraged the suits with concentrated air blasts, pushing them back. The mecha suits tried to tie the ${link_4} to the ground by shooting grappling hooks at him, though the creature managed to take off in time.",
      "links": [
        {
          "body": "Opal",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Opal",
            "page": "Opal"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Meelo",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Meelo",
            "page": "Meelo"
          }
        },
        {
          "body": "Pepper",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Pepper",
            "page": "Pepper"
          }
        },
        {
          "body": "flying bison",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Flying_bison",
            "page": "Flying_bison"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "History"
      ],
      "text": "When Opal and Jinora violated the peace agreement Kuvira had set up with Korra, she ordered her army to attack the Avatar and the two airbenders. Although the infantry was blown backward by the whirlwind Opal and Jinora created, the mecha suits managed to push through. Before they could reach the women, however, Meelo swooped down on Pepper and barraged the suits with concentrated air blasts, pushing them back. The mecha suits tried to tie the flying bison to the ground by shooting grappling hooks at him, though the creature managed to take off in time."
    },
    {
      "body": "The mecha suits were also deployed to guard the border posts of the Earth Empire. When Bolin, Varrick, and several escapees from a reeducation camp attempted to pass the border, they were recognized and four mecha suits instantly surrounded them. Being superior in firepower and endurance, the suits pressed the benders back, though Varrick managed to immobilize them all with an impromptu-created electromagnetic pulse.",
      "links": [],
      "section": [
        "Mecha suit",
        "History"
      ],
      "text": "The mecha suits were also deployed to guard the border posts of the Earth Empire. When Bolin, Varrick, and several escapees from a reeducation camp attempted to pass the border, they were recognized and four mecha suits instantly surrounded them. Being superior in firepower and endurance, the suits pressed the benders back, though Varrick managed to immobilize them all with an impromptu-created electromagnetic pulse."
    },
    {
      "body": "Kuvira led another battalion of mecha suits to the ${link_0}, where she ordered them to start harvesting all the ${link_1} they could find at the base of the ${link_2}. They ran into some trouble, however, when the vines started to fight back, though by using their chainsaws and metal cables, the mecha suits were able to overpower the hostile vegetation.",
      "links": [
        {
          "body": "Foggy Swamp",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "spirit vines",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "banyan-grove tree",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Banyan-grove_tree",
            "page": "Banyan-grove_tree"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "History"
      ],
      "text": "Kuvira led another battalion of mecha suits to the Foggy Swamp, where she ordered them to start harvesting all the spirit vines they could find at the base of the banyan-grove tree. They ran into some trouble, however, when the vines started to fight back, though by using their chainsaws and metal cables, the mecha suits were able to overpower the hostile vegetation."
    },
    {
      "body": "As heavy machinery, the suits were also useful to aid Baatar Jr. in his work on assembling the ${link_0}. Capable of lifting heavy objects, they loaded the weapon with the power core that contained the spirit vine sample. When the ${link_1} attacked the ${link_2} where the cannon was stationed, they defended it, though were toppled when ${link_3} shifted the earth underneath their feet. A giant version of the mecha suits was developed in secret by Kuvira's army armed with the spirit energy cannon, using platinum from the dismantled domes of Zaofu.",
      "links": [
        {
          "body": "spirit energy cannon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_energy_cannon",
            "page": "Spirit_energy_cannon"
          }
        },
        {
          "body": "Beifong family",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Beifong_family",
            "page": "Beifong_family"
          }
        },
        {
          "body": "factory",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Empire_factory",
            "page": "Earth_Empire_factory"
          }
        },
        {
          "body": "Toph",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "History"
      ],
      "text": "As heavy machinery, the suits were also useful to aid Baatar Jr. in his work on assembling the spirit energy cannon. Capable of lifting heavy objects, they loaded the weapon with the power core that contained the spirit vine sample. When the Beifong family attacked the factory where the cannon was stationed, they defended it, though were toppled when Toph shifted the earth underneath their feet. A giant version of the mecha suits was developed in secret by Kuvira's army armed with the spirit energy cannon, using platinum from the dismantled domes of Zaofu."
    },
    {
      "body": "Kuvira's mecha suits began marching into Republic City to crush any resistance. A number of suits were disabled when Varrick created a larger electromagnetic pulse, though the giant mecha suit was unaffected due to it being powered by spirit energy. Another trio of suits cornered Prince ${link_0} and a number of refugees, only to be taken out by two ${link_1} Wu had tamed.",
      "links": [
        {
          "body": "Wu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wu",
            "page": "Wu"
          }
        },
        {
          "body": "badgermoles",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Badgermole",
            "page": "Badgermole"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "History"
      ],
      "text": "Kuvira's mecha suits began marching into Republic City to crush any resistance. A number of suits were disabled when Varrick created a larger electromagnetic pulse, though the giant mecha suit was unaffected due to it being powered by spirit energy. Another trio of suits cornered Prince Wu and a number of refugees, only to be taken out by two badgermoles Wu had tamed."
    },
    {
      "body": "When Kuvira's dismounted energy cannon incidentally created an explosion that devastated downtown, creating a new ${link_0}, Earth Empire mecha suits began searching the area for their leader. When Korra and Kuvira emerged from the portal, the suits' pilots assumed the Avatar had captured the latter and surrounded her. Kuvira ordered them to stand down, however, as she was surrendering to the republic. The mecha suits were subsequently stored at a police depot on the outskirts of Republic City.",
      "links": [
        {
          "body": "spirit portal",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_portal",
            "page": "Spirit_portal"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "History"
      ],
      "text": "When Kuvira's dismounted energy cannon incidentally created an explosion that devastated downtown, creating a new spirit portal, Earth Empire mecha suits began searching the area for their leader. When Korra and Kuvira emerged from the portal, the suits' pilots assumed the Avatar had captured the latter and surrounded her. Kuvira ordered them to stand down, however, as she was surrendering to the republic. The mecha suits were subsequently stored at a police depot on the outskirts of Republic City."
    },
    {
      "body": "Several weeks later, the ${link_0}, under the command of ${link_1}, attacked the depot and managed to take control of the suits. With their arsenal strengthened, the Triple Threats headed back to Republic City to lay claim to their turf.",
      "links": [
        {
          "body": "Triple Threat Triad",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "Tokuga",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tokuga",
            "page": "Tokuga"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "History"
      ],
      "text": "Several weeks later, the Triple Threat Triad, under the command of Tokuga, attacked the depot and managed to take control of the suits. With their arsenal strengthened, the Triple Threats headed back to Republic City to lay claim to their turf."
    },
    {
      "body": "Adapting Hiroshi Sato's design of the mecha suit, Varrick designed the mecha suits to have a more humanoid appearance, walking around on two legs and having two arms with four-fingered hands rather than claws. The legs have a build-in rod that can be shot into the ground in order to dig the suit in for extra balance and resistance. The visor was changed to a rotating ball with three windows. These changes allowed for more mobility, visibility, and precision. The new design also made them more resilient against bending attacks. The pilot boards the suit on the head instead of the body like in the old design.",
      "links": [],
      "section": [
        "Mecha suit",
        "Design"
      ],
      "text": "Adapting Hiroshi Sato's design of the mecha suit, Varrick designed the mecha suits to have a more humanoid appearance, walking around on two legs and having two arms with four-fingered hands rather than claws. The legs have a build-in rod that can be shot into the ground in order to dig the suit in for extra balance and resistance. The visor was changed to a rotating ball with three windows. These changes allowed for more mobility, visibility, and precision. The new design also made them more resilient against bending attacks. The pilot boards the suit on the head instead of the body like in the old design."
    },
    {
      "body": "In comparison to the older mecha tanks, the mecha suits are equipped with an upgraded weapon arsenal that includes a flamethrower, electrical charges, grapple hooks, and pistons in the arms to punch other suits. The more mobile model also allows the suit to execute more physical attacks, such as deliver punches and kicks and even utilize grappling maneuvers. The machines are also equipped with retractable chainsaws.",
      "links": [],
      "section": [
        "Mecha suit",
        "Weapons"
      ],
      "text": "In comparison to the older mecha tanks, the mecha suits are equipped with an upgraded weapon arsenal that includes a flamethrower, electrical charges, grapple hooks, and pistons in the arms to punch other suits. The more mobile model also allows the suit to execute more physical attacks, such as deliver punches and kicks and even utilize grappling maneuvers. The machines are also equipped with retractable chainsaws."
    },
    {
      "body": "In the case of the giant mecha suit, it was equipped with the spirit energy cannon as its main weapon.",
      "links": [],
      "section": [
        "Mecha suit",
        "Weapons"
      ],
      "text": "In the case of the giant mecha suit, it was equipped with the spirit energy cannon as its main weapon."
    },
    {
      "body": "Being electrically charged machines, the mecha suits are vulnerable to being shut down by an electromagnetic pulse. Although their armor is more resistant against bending attack, it can still be melted by a ${link_0}.",
      "links": [
        {
          "body": "lavabender",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lavabending",
            "page": "Lavabending"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "Weaknesses"
      ],
      "text": "Being electrically charged machines, the mecha suits are vulnerable to being shut down by an electromagnetic pulse. Although their armor is more resistant against bending attack, it can still be melted by a lavabender."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Baatar Jr.",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Baatar_Jr",
            "page": "Baatar_Jr"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "Known pilots"
      ],
      "text": "Baatar Jr."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "Known pilots"
      ],
      "text": "Bolin"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "Known pilots"
      ],
      "text": "Kuvira"
    },
    {
      "body": "Members of the ${link_0}",
      "links": [
        {
          "body": "military of the Earth Empire",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "Known pilots"
      ],
      "text": "Members of the military of the Earth Empire"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Varrick",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "Known pilots"
      ],
      "text": "Varrick"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Zhu Li",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "Known pilots"
      ],
      "text": "Zhu Li"
    },
    {
      "body": "The concept of the enormous mecha suit was originally conceived for the finale of ${link_0}, though ended up being used for the finale of ${link_1}.",
      "links": [
        {
          "body": "Book One: Air",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Book_One__Air",
            "page": "Book_One__Air"
          }
        },
        {
          "body": "Book Four: Balance",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Book_Four__Balance",
            "page": "Book_Four__Balance"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "Trivia"
      ],
      "text": "The concept of the enormous mecha suit was originally conceived for the finale of Book One: Air, though ended up being used for the finale of Book Four: Balance."
    },
    {
      "body": "The design of the enormous mecha suit was inspired by the robots from Max Fleischer's Superman cartoons, the Laputa robots from Hayao Miyazaki's Castle in the Sky, and Brad Bird's Iron Giant.",
      "links": [],
      "section": [
        "Mecha suit",
        "Trivia"
      ],
      "text": "The design of the enormous mecha suit was inspired by the robots from Max Fleischer's Superman cartoons, the Laputa robots from Hayao Miyazaki's Castle in the Sky, and Brad Bird's Iron Giant."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Hummingbird mecha suit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hummingbird_mecha_suit",
            "page": "Hummingbird_mecha_suit"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "See also"
      ],
      "text": "Hummingbird mecha suit"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Mecha tank",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_tank",
            "page": "Mecha_tank"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "See also"
      ],
      "text": "Mecha tank"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Technology in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Technology_in_the_World_of_Avatar",
            "page": "Technology_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "See also"
      ],
      "text": "Technology in the World of Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Weaponry in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Weaponry_in_the_World_of_Avatar",
            "page": "Weaponry_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Mecha suit",
        "See also"
      ],
      "text": "Weaponry in the World of Avatar"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Mecha_suit",
    "file": "avatar.wikia.com/wiki/Mecha_suit.html",
    "page": "Mecha_suit",
    "title": "Mecha suit"
  }
}