{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Objects",
      "target": {
        "external": false,
        "href": "/wiki/Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Red Lotus",
      "target": {
        "external": false,
        "href": "/wiki/Category_Red_Lotus",
        "page": "Category_Red_Lotus"
      }
    },
    {
      "body": "Weapons",
      "target": {
        "external": false,
        "href": "/wiki/Category_Weapons",
        "page": "Category_Weapons"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Mercury is a metallic, chemical element that is highly poisonous, and prolonged exposure to it will result in death. When administered to an ${link_0}, it will trigger the ${link_1}, which is why the ${link_2} used it on Avatar ${link_3} in 171 ${link_4} in an attempt to kill her in the Avatar State and end the ${link_5} for good.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "Korra",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "AG",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Avatar Cycle",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_Cycle",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "Mercury"
      ],
      "text": "Mercury is a metallic, chemical element that is highly poisonous, and prolonged exposure to it will result in death. When administered to an Avatar, it will trigger the Avatar State, which is why the Red Lotus used it on Avatar Korra in 171 AG in an attempt to kill her in the Avatar State and end the Avatar Cycle for good."
    },
    {
      "body": "As part of an attempt to bring forth worldwide anarchy, the Red Lotus intended to permanently end the Avatar Cycle. Having captured Avatar Korra, they used metalbending to transdermally administer the mercury, which immediately triggered a physical and mental reaction. As a side-effect, the mercury caused Korra to hallucinate, seeing the Red Lotus members' faces turn into those of ${link_0}, ${link_1}, and ${link_2}. Although she attempted to resist the poison's effects, she eventually caved in and she was forced into the Avatar State. Before she could be killed, however, the surge of power she received from ${link_3}'s spirit enabled her to break free from her chains and fight off her captors. She subsequently locked into battle with ${link_4}, though Korra found herself struggling to fight both him and the poison coursing through her veins, which gave Zaheer the upper hand. With the help of the new ${link_5}, she was able to overcome him, but she succumbed to the mercury nonetheless, her body having been exposed to the lethal substance too long. ${link_6} spurred ${link_7} to action, however, when she told her that the venom was metal-based; Suyin promptly removed most of it from Korra's system, saving the Avatar's life.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Raava",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Raava",
            "page": "Raava"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Suyin",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        }
      ],
      "section": [
        "Mercury",
        "History"
      ],
      "text": "As part of an attempt to bring forth worldwide anarchy, the Red Lotus intended to permanently end the Avatar Cycle. Having captured Avatar Korra, they used metalbending to transdermally administer the mercury, which immediately triggered a physical and mental reaction. As a side-effect, the mercury caused Korra to hallucinate, seeing the Red Lotus members' faces turn into those of Amon, Unalaq, and Vaatu. Although she attempted to resist the poison's effects, she eventually caved in and she was forced into the Avatar State. Before she could be killed, however, the surge of power she received from Raava's spirit enabled her to break free from her chains and fight off her captors. She subsequently locked into battle with Zaheer, though Korra found herself struggling to fight both him and the poison coursing through her veins, which gave Zaheer the upper hand. With the help of the new airbenders, she was able to overcome him, but she succumbed to the mercury nonetheless, her body having been exposed to the lethal substance too long. Jinora spurred Suyin to action, however, when she told her that the venom was metal-based; Suyin promptly removed most of it from Korra's system, saving the Avatar's life."
    },
    {
      "body": "Nonetheless, the poison had caused significant internal damage, rendering Korra unable to walk for nearly six months and incapable of contacting Raava or entering the Avatar State. It even obscured Raava's energy for other spirits. In addition, the residual traces of poison in her body prevented her from making a full recovery. With the help of ${link_0}, Korra was made aware of the metal remnants in her body. Although she subconsciously resisted the removal of the metallic poison at first, she eventually managed to let go of her fears and bent the substance out of her body, which Toph subsequently contained in an earthen shell.",
      "links": [
        {
          "body": "Toph Beifong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "section": [
        "Mercury",
        "History"
      ],
      "text": "Nonetheless, the poison had caused significant internal damage, rendering Korra unable to walk for nearly six months and incapable of contacting Raava or entering the Avatar State. It even obscured Raava's energy for other spirits. In addition, the residual traces of poison in her body prevented her from making a full recovery. With the help of Toph Beifong, Korra was made aware of the metal remnants in her body. Although she subconsciously resisted the removal of the metallic poison at first, she eventually managed to let go of her fears and bent the substance out of her body, which Toph subsequently contained in an earthen shell."
    },
    {
      "body": "The only known way to administer the metallic poison is by ${link_0} it into the victim's pores. Once administered, it has a hallucinogenic effect. After that stage, the victim will be hindered in their movements until the strain on their body eventually becomes too painful to bear and they will slip into unconsciousness, eventually resulting in death. When used on the Avatar, the Avatar State will be activated in an attempt to fight it off.",
      "links": [
        {
          "body": "metalbending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Metalbending",
            "page": "Metalbending"
          }
        }
      ],
      "section": [
        "Mercury",
        "Effects"
      ],
      "text": "The only known way to administer the metallic poison is by metalbending it into the victim's pores. Once administered, it has a hallucinogenic effect. After that stage, the victim will be hindered in their movements until the strain on their body eventually becomes too painful to bear and they will slip into unconsciousness, eventually resulting in death. When used on the Avatar, the Avatar State will be activated in an attempt to fight it off."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Mercury poisoning",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Mercury_poisoning",
            "page": "http://en.wikipedia.org/wiki/Mercury_poisoning"
          }
        }
      ],
      "section": [
        "Mercury",
        "External links"
      ],
      "text": "Mercury poisoning"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Mercury",
    "file": "avatar.wikia.com/wiki/Mercury.html",
    "page": "Mercury",
    "title": "Mercury"
  }
}