{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earthbending",
      "target": {
        "href": "Category_Earthbending",
        "page": "Category_Earthbending"
      }
    },
    {
      "body": "Specialized bending techniques",
      "target": {
        "href": "Category_Specialized_bending_techniques",
        "page": "Category_Specialized_bending_techniques"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} used metalbending to manipulate the plating on a ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Fire Nation cruiser",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_cruiser",
            "page": "Fire_Nation_cruiser"
          }
        }
      ],
      "text": "Toph used metalbending to manipulate the plating on a Fire Nation cruiser."
    },
    {
      "body": "Metalbending is a ${link_0} of ${link_1} that allows an earthbender to ferrokinetically bend processed metal in a similar fashion to bending regular earth. Long regarded an impossible feat, the technique was invented by ${link_2} to escape from a metal cage in which she was captured and transported by ${link_3} and Master ${link_4}. Since metal is merely earth that has been purified and refined, Toph used her ${link_5} to perceive the trace amounts of \"unpurified\" crude earth still present in the metal, target it, and use it to bend the purified metal itself.",
      "links": [
        {
          "body": "specialized sub-skill",
          "key": "${link_0}",
          "target": {
            "href": "Specialized_bending_techniques",
            "page": "Specialized_bending_techniques"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Toph Beifong",
          "key": "${link_2}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Xin Fu",
          "key": "${link_3}",
          "target": {
            "href": "Xin_Fu",
            "page": "Xin_Fu"
          }
        },
        {
          "body": "Yu",
          "key": "${link_4}",
          "target": {
            "href": "Yu",
            "page": "Yu"
          }
        },
        {
          "body": "seismic sense",
          "key": "${link_5}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        }
      ],
      "text": "Metalbending is a specialized sub-skill of earthbending that allows an earthbender to ferrokinetically bend processed metal in a similar fashion to bending regular earth. Long regarded an impossible feat, the technique was invented by Toph Beifong to escape from a metal cage in which she was captured and transported by Xin Fu and Master Yu. Since metal is merely earth that has been purified and refined, Toph used her seismic sense to perceive the trace amounts of \"unpurified\" crude earth still present in the metal, target it, and use it to bend the purified metal itself."
    },
    {
      "body": "Metalbenders can also bend liquid metals, such as ${link_0}, though utilize more fluid movements to do so, akin to ${link_1}. It is also possible to bend liquid metal inside someone's body.",
      "links": [
        {
          "body": "mercury",
          "key": "${link_0}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Metalbenders can also bend liquid metals, such as mercury, though utilize more fluid movements to do so, akin to waterbending. It is also possible to bend liquid metal inside someone's body."
    },
    {
      "body": "${link_0} discovered metalbending by ${link_1} the impurities within the metal of the cage in which she was imprisoned.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "sensing",
          "key": "${link_1}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        }
      ],
      "text": "Toph discovered metalbending by sensing the impurities within the metal of the cage in which she was imprisoned."
    },
    {
      "body": "For thousands of years, earthbenders were not able to manipulate processed earth. During the ${link_0}, the ${link_1} exploited this inability to detain captive earthbenders, such as when they forced earthbenders to work on a metallic ${link_2} in the middle of the ocean, and locked ${link_3} ${link_4} in a suspended metal cage following the takeover of ${link_5}. Other nations used the same tactic, such as when Xin Fu and the ${link_6} fighters captured Toph and ${link_7} in metal cages and suspended them in the air, a situation impossible to escape from through the use of conventional earthbending.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "prison rig",
          "key": "${link_2}",
          "target": {
            "href": "Prison_rig",
            "page": "Prison_rig"
          }
        },
        {
          "body": "King",
          "key": "${link_3}",
          "target": {
            "href": "King_of_Omashu",
            "page": "King_of_Omashu"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_4}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_5}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "Earth Rumble VI",
          "key": "${link_6}",
          "target": {
            "href": "Earth_Rumble_VI",
            "page": "Earth_Rumble_VI"
          }
        },
        {
          "body": "Aang",
          "key": "${link_7}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "For thousands of years, earthbenders were not able to manipulate processed earth. During the Hundred Year War, the Fire Nation exploited this inability to detain captive earthbenders, such as when they forced earthbenders to work on a metallic prison rig in the middle of the ocean, and locked King Bumi in a suspended metal cage following the takeover of Omashu. Other nations used the same tactic, such as when Xin Fu and the Earth Rumble VI fighters captured Toph and Aang in metal cages and suspended them in the air, a situation impossible to escape from through the use of conventional earthbending."
    },
    {
      "body": "This changed during the spring of 100 ${link_0}, however, when Toph Beifong was incarcerated in a metal cage by Xin Fu and her former teacher, Master Yu. While being transported back to ${link_1}, Toph realized that metal was only a form of processed earth and began to meditate in her prison until she was able to feel the trace amounts of earth in the metal. By utilizing these remaining fragments, she metalbent for the first time, allowing her escape while also imprisoning her captors inside the cage. From then on, she continued to practice and refine the technique, making it a vital asset to winning the Hundred Year War.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Gaoling",
          "key": "${link_1}",
          "target": {
            "href": "Gaoling",
            "page": "Gaoling"
          }
        }
      ],
      "text": "This changed during the spring of 100 AG, however, when Toph Beifong was incarcerated in a metal cage by Xin Fu and her former teacher, Master Yu. While being transported back to Gaoling, Toph realized that metal was only a form of processed earth and began to meditate in her prison until she was able to feel the trace amounts of earth in the metal. By utilizing these remaining fragments, she metalbent for the first time, allowing her escape while also imprisoning her captors inside the cage. From then on, she continued to practice and refine the technique, making it a vital asset to winning the Hundred Year War."
    },
    {
      "body": "${link_0} used metalbending to control the spools of metal cable on her back during her fight with ${link_1} atop the ${link_2}.",
      "links": [
        {
          "body": "Lin Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_1}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_2}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        }
      ],
      "text": "Lin Beifong used metalbending to control the spools of metal cable on her back during her fight with Equalists atop the Pro-bending Arena."
    },
    {
      "body": "After the Hundred Year War, Toph established the ${link_0} to share the technique with others. By 170 AG, metalbending had become the primary form of earthbending used by ${link_1}'s ${link_2}. The police use metal cables stored in cylindrical spool devices on their backs for various tasks, such as subduing criminals or for extra mobility around the city. The art also spread to earthbenders beyond the United Republic's borders, as some members of the ${link_3} became proficient in the art. In addition, the city of ${link_4} was constructed entirely by metalbending, an effort led by Toph's younger daughter, ${link_5}.",
      "links": [
        {
          "body": "Beifong Metalbending Academy",
          "key": "${link_0}",
          "target": {
            "href": "Beifong_Metalbending_Academy",
            "page": "Beifong_Metalbending_Academy"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "police force",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "Order of the White Lotus",
          "key": "${link_3}",
          "target": {
            "href": "Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        },
        {
          "body": "Zaofu",
          "key": "${link_4}",
          "target": {
            "href": "Zaofu",
            "page": "Zaofu"
          }
        },
        {
          "body": "Suyin Beifong",
          "key": "${link_5}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        }
      ],
      "text": "After the Hundred Year War, Toph established the Beifong Metalbending Academy to share the technique with others. By 170 AG, metalbending had become the primary form of earthbending used by Republic City's police force. The police use metal cables stored in cylindrical spool devices on their backs for various tasks, such as subduing criminals or for extra mobility around the city. The art also spread to earthbenders beyond the United Republic's borders, as some members of the Order of the White Lotus became proficient in the art. In addition, the city of Zaofu was constructed entirely by metalbending, an effort led by Toph's younger daughter, Suyin Beifong."
    },
    {
      "body": "Initially, Toph's metalbending seemed to be restricted to close-range manipulation. In almost all cases, she was standing close to or was in direct contact with the metal she intended to bend. She had \"scrunched\" or otherwise deformed sheets of metal, but had never caused it to freely reshape itself the way she had with earth, and was not known to have ever bent metal at a distance. However, when making direct contact with a prison's metal door, she was able to blast it off its hinges with such force that it ricocheted four times around the corridor beyond before coming to a rest.",
      "links": [],
      "text": "Initially, Toph's metalbending seemed to be restricted to close-range manipulation. In almost all cases, she was standing close to or was in direct contact with the metal she intended to bend. She had \"scrunched\" or otherwise deformed sheets of metal, but had never caused it to freely reshape itself the way she had with earth, and was not known to have ever bent metal at a distance. However, when making direct contact with a prison's metal door, she was able to blast it off its hinges with such force that it ricocheted four times around the corridor beyond before coming to a rest."
    },
    {
      "body": "${link_0} surrounded herself in metal armor.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Toph surrounded herself in metal armor."
    },
    {
      "body": "Over time, Toph greatly increased the range of her metalbending and started to incorporate the technique in her fighting style, as demonstrated when she knocked several Fire Nation guards off a ship from several meters away and trapped a ${link_0} agent in a metal column. She also developed the ability to \"see\" through metal, just as she could with regular earth.",
      "links": [
        {
          "body": "Dai Li",
          "key": "${link_0}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "Over time, Toph greatly increased the range of her metalbending and started to incorporate the technique in her fighting style, as demonstrated when she knocked several Fire Nation guards off a ship from several meters away and trapped a Dai Li agent in a metal column. She also developed the ability to \"see\" through metal, just as she could with regular earth."
    },
    {
      "body": "By the time she, ${link_0}, and ${link_1} set out to destroy ${link_2} ${link_3}'s ${link_4}, she controlled her metalbending more fluidly. She could easily tear a metal door off its hinges to fabricate herself a suit of armor and was able to manipulate the metal plating in the command bay of the airship from a short distance to pin her opponents against the walls. Toph was also able to metalbend the ship's floor upward to block a comet-charged fire blast just as a traditional earthbender would block attacks using a rock barrier. Her fine control over the art also allowed her to climb upside down along the metal ceiling of the airship while in her metal armor.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Suki",
          "key": "${link_1}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Phoenix King",
          "key": "${link_2}",
          "target": {
            "href": "Phoenix_King",
            "page": "Phoenix_King"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_3}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "airship fleet",
          "key": "${link_4}",
          "target": {
            "href": "Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        }
      ],
      "text": "By the time she, Sokka, and Suki set out to destroy Phoenix King Ozai's airship fleet, she controlled her metalbending more fluidly. She could easily tear a metal door off its hinges to fabricate herself a suit of armor and was able to manipulate the metal plating in the command bay of the airship from a short distance to pin her opponents against the walls. Toph was also able to metalbend the ship's floor upward to block a comet-charged fire blast just as a traditional earthbender would block attacks using a rock barrier. Her fine control over the art also allowed her to climb upside down along the metal ceiling of the airship while in her metal armor."
    },
    {
      "body": "${link_0} metalbent the rudder of a ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Fire Nation airship",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        }
      ],
      "text": "Toph metalbent the rudder of a Fire Nation airship."
    },
    {
      "body": "Toph later bent the rudder of an airship, causing it to spiral and collide with the other ships. When doing so, she took noticeably more time and concentration than if she had been required to do so with orthodox forms of earthbending.",
      "links": [],
      "text": "Toph later bent the rudder of an airship, causing it to spiral and collide with the other ships. When doing so, she took noticeably more time and concentration than if she had been required to do so with orthodox forms of earthbending."
    },
    {
      "body": "A full year later, Toph was fully capable of bending metal she was not in contact with. For example, when a ${link_0} invaded her academy, she demonstrated her ability by effortlessly bending a metal weapon around his head that was a few feet away from her. She stated that as long as someone was close enough to see the metal, she could bend it. She demonstrated this by metalbending screws and bolts from a distance to unscrew the wheels of Fire Nation ${link_1}. In her later life, she came to possess abilities such as being able to control cables from her armor, and being able to put on her armor, which appears to only be put on through metalbending.",
      "links": [
        {
          "body": "firebending teacher",
          "key": "${link_0}",
          "target": {
            "href": "Kunyo",
            "page": "Kunyo"
          }
        },
        {
          "body": "tanks",
          "key": "${link_1}",
          "target": {
            "href": "Tundra_tank",
            "page": "Tundra_tank"
          }
        }
      ],
      "text": "A full year later, Toph was fully capable of bending metal she was not in contact with. For example, when a firebending teacher invaded her academy, she demonstrated her ability by effortlessly bending a metal weapon around his head that was a few feet away from her. She stated that as long as someone was close enough to see the metal, she could bend it. She demonstrated this by metalbending screws and bolts from a distance to unscrew the wheels of Fire Nation tanks. In her later life, she came to possess abilities such as being able to control cables from her armor, and being able to put on her armor, which appears to only be put on through metalbending."
    },
    {
      "body": "${link_0}'s ${link_1} metalbent coins as part of their training.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "students",
          "key": "${link_1}",
          "target": {
            "href": "Team_Beifong",
            "page": "Team_Beifong"
          }
        }
      ],
      "text": "Toph's students metalbent coins as part of their training."
    },
    {
      "body": "Toph explained to Sokka how she found her first metalbending students; when she was close by each of them, her ${link_0} rumbled ever so slightly, due to the intense emotional state those particular people were in at the time. She realized that they were subconsciously metalbending the jewelry and thus figured that they had an aptitude for the art.",
      "links": [
        {
          "body": "meteorite bracelet",
          "key": "${link_0}",
          "target": {
            "href": "Toph%27s_bracelet",
            "page": "Toph%27s_bracelet"
          }
        }
      ],
      "text": "Toph explained to Sokka how she found her first metalbending students; when she was close by each of them, her meteorite bracelet rumbled ever so slightly, due to the intense emotional state those particular people were in at the time. She realized that they were subconsciously metalbending the jewelry and thus figured that they had an aptitude for the art."
    },
    {
      "body": "While teaching her first students, Toph forced them to remotely metalbend small coins rather than manipulate the metal via direct contact. Remote metalbending was favored over direct contact to break down the illusion of complete separation between bendable earth and purified metal at the beginning of the student's training.",
      "links": [],
      "text": "While teaching her first students, Toph forced them to remotely metalbend small coins rather than manipulate the metal via direct contact. Remote metalbending was favored over direct contact to break down the illusion of complete separation between bendable earth and purified metal at the beginning of the student's training."
    },
    {
      "body": "Despite how widespread metalbending would become over the next 70 years, it is noted that only one out of a hundred earthbenders ever master the art, though metalbending master Suyin Beifong believes the only real limitation in learning the ability are the ones a person places on themselves. When Suyin first taught Korra metalbending, she got her to feel the fine pieces of earth inside a metal meteorite sculpture.",
      "links": [],
      "text": "Despite how widespread metalbending would become over the next 70 years, it is noted that only one out of a hundred earthbenders ever master the art, though metalbending master Suyin Beifong believes the only real limitation in learning the ability are the ones a person places on themselves. When Suyin first taught Korra metalbending, she got her to feel the fine pieces of earth inside a metal meteorite sculpture."
    },
    {
      "body": "Metalbending ${link_0} use their abilities to enforce ${link_1} in ${link_2}.",
      "links": [
        {
          "body": "police officers",
          "key": "${link_0}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "law and order",
          "key": "${link_1}",
          "target": {
            "href": "Law_and_order_in_the_World_of_Avatar",
            "page": "Law_and_order_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "text": "Metalbending police officers use their abilities to enforce law and order in Republic City."
    },
    {
      "body": "In contemporary forms of metalbending, the Metalbending Police Force can bend metals without direct contact. An example of this advancement was shown when ${link_0} unlocked ${link_1}'s handcuffs from across the interrogation room with just a flick of her hand. In another instance, Lin was fighting ${link_2} ${link_3} on the roof of the ${link_4}. She knocked two chi blockers off the roof by metalbending parts of the support rods.",
      "links": [
        {
          "body": "Lin Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_2}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "chi blockers",
          "key": "${link_3}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_4}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        }
      ],
      "text": "In contemporary forms of metalbending, the Metalbending Police Force can bend metals without direct contact. An example of this advancement was shown when Lin Beifong unlocked Korra's handcuffs from across the interrogation room with just a flick of her hand. In another instance, Lin was fighting Equalist chi blockers on the roof of the Pro-bending Arena. She knocked two chi blockers off the roof by metalbending parts of the support rods."
    },
    {
      "body": "The ${link_0} in Zaofu incorporates metalbending into numerous aspects of life. They have found ways to utilize their bending in the areas of fine arts, such as dancing and sculpting, recreation, with the invention of ${link_1}, and architecture. In addition, the citizens of Zaofu employ a fluid variation of metalbending, as opposed to the more rigid and limited nature used in other parts of the Earth Kingdom.",
      "links": [
        {
          "body": "Metal Clan",
          "key": "${link_0}",
          "target": {
            "href": "Metal_Clan",
            "page": "Metal_Clan"
          }
        },
        {
          "body": "power disc",
          "key": "${link_1}",
          "target": {
            "href": "Power_disc",
            "page": "Power_disc"
          }
        }
      ],
      "text": "The Metal Clan in Zaofu incorporates metalbending into numerous aspects of life. They have found ways to utilize their bending in the areas of fine arts, such as dancing and sculpting, recreation, with the invention of power disc, and architecture. In addition, the citizens of Zaofu employ a fluid variation of metalbending, as opposed to the more rigid and limited nature used in other parts of the Earth Kingdom."
    },
    {
      "body": "Highly purified metals: Metalbending relies on bending the residue earth particles inside the metal. When the metal is highly purified, however, such as platinum, there are no or not enough particles left to bend, rendering the material impervious to the technique. ${link_0} took advantage of this weakness to construct his ${link_1} out of platinum to counter any effective resistance from the Metalbending Police Force. ${link_2} later did the same with her enormous ${link_3}.",
      "links": [
        {
          "body": "Hiroshi Sato",
          "key": "${link_0}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "mecha tanks",
          "key": "${link_1}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_2}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "mecha suit",
          "key": "${link_3}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        }
      ],
      "text": "Highly purified metals: Metalbending relies on bending the residue earth particles inside the metal. When the metal is highly purified, however, such as platinum, there are no or not enough particles left to bend, rendering the material impervious to the technique. Hiroshi Sato took advantage of this weakness to construct his mecha tanks out of platinum to counter any effective resistance from the Metalbending Police Force. Kuvira later did the same with her enormous mecha suit."
    },
    {
      "body": "Metal connected to the bender's body: Similar to waterbenders, metalbenders often carry a source of metal with them to be able to bend anywhere. The Metalbending Police Force did this in the form of spools of metal cables connected to the metalbender's body. However, metal is a great conductor of electricity. Therefore, if the opponent of a metalbender is equipped with electrified weapons, like the ${link_0} with his ${link_1}, a jolt of electricity sent through the cables can stun the bender. Similarly, carrying around metal renders the bender vulnerable to magnets, as a large enough magnet can be used to capture the bender by dragging them away by the metal spools carried on their body.",
      "links": [
        {
          "body": "Lieutenant",
          "key": "${link_0}",
          "target": {
            "href": "Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "electrified kali sticks",
          "key": "${link_1}",
          "target": {
            "href": "Electrified_kali_sticks",
            "page": "Electrified_kali_sticks"
          }
        }
      ],
      "text": "Metal connected to the bender's body: Similar to waterbenders, metalbenders often carry a source of metal with them to be able to bend anywhere. The Metalbending Police Force did this in the form of spools of metal cables connected to the metalbender's body. However, metal is a great conductor of electricity. Therefore, if the opponent of a metalbender is equipped with electrified weapons, like the Lieutenant with his electrified kali sticks, a jolt of electricity sent through the cables can stun the bender. Similarly, carrying around metal renders the bender vulnerable to magnets, as a large enough magnet can be used to capture the bender by dragging them away by the metal spools carried on their body."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Metalbending",
    "file": "avatar.wikia.com/wiki/Metalbending.html",
    "page": "Metalbending",
    "title": "Metalbending"
  }
}