{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Settlements",
      "target": {
        "href": "Category_Settlements",
        "page": "Category_Settlements"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "Western ${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Earth Kingdom",
              "key": "${link_0}",
              "target": {
                "href": "Earth_Kingdom",
                "page": "Earth_Kingdom"
              }
            }
          ],
          "text": "Western Earth Kingdom",
          "value": "Western ${link_0}",
          "value_text": "Western Earth Kingdom"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "Mining settlement",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Mining settlement",
          "value": "Mining settlement",
          "value_text": "Mining settlement"
        }
      ]
    },
    {
      "key": "Leader",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Tyro",
              "key": "${link_0}",
              "target": {
                "href": "Tyro",
                "page": "Tyro"
              }
            }
          ],
          "text": "Tyro",
          "value": "${link_0}",
          "value_text": "Tyro"
        },
        {
          "body": "${link_0} government (formerly)",
          "extra": "(formerly)",
          "extra_text": "(formerly)",
          "links": [
            {
              "body": "Fire Nation",
              "key": "${link_0}",
              "target": {
                "href": "Fire_Nation",
                "page": "Fire_Nation"
              }
            }
          ],
          "text": "Fire Nation government (formerly)",
          "value": "${link_0} government",
          "value_text": "Fire Nation government"
        },
        {
          "body": "${link_0} (formerly)",
          "extra": "(formerly)",
          "extra_text": "(formerly)",
          "links": [
            {
              "body": "Kuvira",
              "key": "${link_0}",
              "target": {
                "href": "Kuvira",
                "page": "Kuvira"
              }
            }
          ],
          "text": "Kuvira (formerly)",
          "value": "${link_0}",
          "value_text": "Kuvira"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\" (only appearance)",
          "extra": "(only appearance)",
          "extra_text": "(only appearance)",
          "links": [
            {
              "body": "Imprisoned",
              "key": "${link_0}",
              "target": {
                "href": "Imprisoned",
                "page": "Imprisoned"
              }
            }
          ],
          "text": "\"Imprisoned\" (only appearance)",
          "value": "\"${link_0}\"",
          "value_text": "\"Imprisoned\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The mining village is a minor settlement in the western ${link_0} ${link_1} near the ${link_2} shoreline.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "situated",
          "key": "${link_1}",
          "target": {
            "href": "Geography_of_the_World_of_Avatar",
            "page": "Geography_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Mo Ce Sea",
          "key": "${link_2}",
          "target": {
            "href": "Mo_Ce_Sea",
            "page": "Mo_Ce_Sea"
          }
        }
      ],
      "text": "The mining village is a minor settlement in the western Earth Kingdom situated near the Mo Ce Sea shoreline."
    },
    {
      "body": "During the ${link_0}, this mining village was occupied by the ${link_1}, during which time, its inhabitants were forced to mine for coal to be used for the ${link_2} as fuel. The Fire Nation also taxed the village heavily to help pay for its occupation and expansion in the Earth Kingdom.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Fire Navy",
          "key": "${link_2}",
          "target": {
            "href": "Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        }
      ],
      "text": "During the Hundred Year War, this mining village was occupied by the Fire Nation, during which time, its inhabitants were forced to mine for coal to be used for the Fire Navy as fuel. The Fire Nation also taxed the village heavily to help pay for its occupation and expansion in the Earth Kingdom."
    },
    {
      "body": "${link_0}, a young ${link_1} and devoted ally of the ${link_2}, was a native of this village who lived with ${link_3}. The village was also home to his father, ${link_4}, who was one of many earthbenders arrested by the Fire Nation and sent to the ${link_5} during the ${link_6}.",
      "links": [
        {
          "body": "Haru",
          "key": "${link_0}",
          "target": {
            "href": "Haru",
            "page": "Haru"
          }
        },
        {
          "body": "earthbender",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "his mother",
          "key": "${link_3}",
          "target": {
            "href": "Haru%27s_mother",
            "page": "Haru%27s_mother"
          }
        },
        {
          "body": "Tyro",
          "key": "${link_4}",
          "target": {
            "href": "Tyro",
            "page": "Tyro"
          }
        },
        {
          "body": "prison rig",
          "key": "${link_5}",
          "target": {
            "href": "Prison_rig",
            "page": "Prison_rig"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_6}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "Haru, a young earthbender and devoted ally of the Avatar, was a native of this village who lived with his mother. The village was also home to his father, Tyro, who was one of many earthbenders arrested by the Fire Nation and sent to the prison rig during the Hundred Year War."
    },
    {
      "body": "Sometime during 171 and 174 ${link_0}, ${link_1} annexed this village as part of her ${link_2}, and it remained under her control until she was arrested in 174 AG following her failed attempt to ${link_3} the ${link_4}.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_1}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "Earth Empire",
          "key": "${link_2}",
          "target": {
            "href": "Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        },
        {
          "body": "annex",
          "key": "${link_3}",
          "target": {
            "href": "Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "United Republic of Nations",
          "key": "${link_4}",
          "target": {
            "href": "United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        }
      ],
      "text": "Sometime during 171 and 174 AG, Kuvira annexed this village as part of her Earth Empire, and it remained under her control until she was arrested in 174 AG following her failed attempt to annex the United Republic of Nations."
    },
    {
      "body": "The village fell under Fire Nation control in 94 ${link_0}. In order to support the war effort, villagers were forced to mine coal and pay heavy taxes to local officials, engendering a sense of fear and anger toward them. Earthbending was strictly forbidden by the authorities, and any native seen in the act was immediately arrested and sent to a prison rig located several miles off the coast. In an attempt to free his village, Tyro led a revolt against Fire Nation rule. However, it was unsuccessful, and he was deported to the rig. Before long, the villagers lost their will to resist their oppressors.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "The village fell under Fire Nation control in 94 AG. In order to support the war effort, villagers were forced to mine coal and pay heavy taxes to local officials, engendering a sense of fear and anger toward them. Earthbending was strictly forbidden by the authorities, and any native seen in the act was immediately arrested and sent to a prison rig located several miles off the coast. In an attempt to free his village, Tyro led a revolt against Fire Nation rule. However, it was unsuccessful, and he was deported to the rig. Before long, the villagers lost their will to resist their oppressors."
    },
    {
      "body": "Avatar ${link_0} and ${link_1} visited this village shortly after the former's release from the iceberg, and were shocked to see the conditions its inhabitants were facing. They met Haru at his mother's store and soon went to visit his home, where ${link_2} learned about his tragic past. It was this shared loss of a parent that caused Katara to develop a platonic affection toward Haru, and when he was arrested for earthbending, this affection and her guilt at convincing him to earthbend compelled her to rescue him. Katara deceived authorities into arresting her so that she would be taken to the prison where Haru was being held captive.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "his friends",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Avatar Aang and his friends visited this village shortly after the former's release from the iceberg, and were shocked to see the conditions its inhabitants were facing. They met Haru at his mother's store and soon went to visit his home, where Katara learned about his tragic past. It was this shared loss of a parent that caused Katara to develop a platonic affection toward Haru, and when he was arrested for earthbending, this affection and her guilt at convincing him to earthbend compelled her to rescue him. Katara deceived authorities into arresting her so that she would be taken to the prison where Haru was being held captive."
    },
    {
      "body": "When Haru and Tyro were freed from imprisonment, they returned to their village with other former prisoners to liberate it from Fire Nation jurisdiction.",
      "links": [],
      "text": "When Haru and Tyro were freed from imprisonment, they returned to their village with other former prisoners to liberate it from Fire Nation jurisdiction."
    },
    {
      "body": "Following ${link_0} ${link_1}'s death and the ${link_2} of the Earth Kingdom in 171 AG, this village became integrated into Kuvira's empire sometime during her three-year rule of the nation and remained under her control until she was arrested in 174 AG following her failed attempt to ${link_3} the ${link_4}.",
      "links": [
        {
          "body": "Earth Queen",
          "key": "${link_0}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_1}",
          "target": {
            "href": "Hou-Ting",
            "page": "Hou-Ting"
          }
        },
        {
          "body": "fragmentation",
          "key": "${link_2}",
          "target": {
            "href": "Anarchy_in_the_Earth_Kingdom",
            "page": "Anarchy_in_the_Earth_Kingdom"
          }
        },
        {
          "body": "annex",
          "key": "${link_3}",
          "target": {
            "href": "Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "United Republic of Nations",
          "key": "${link_4}",
          "target": {
            "href": "United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        }
      ],
      "text": "Following Earth Queen Hou-Ting's death and the fragmentation of the Earth Kingdom in 171 AG, this village became integrated into Kuvira's empire sometime during her three-year rule of the nation and remained under her control until she was arrested in 174 AG following her failed attempt to annex the United Republic of Nations."
    },
    {
      "body": "The village is situated in a small valley.",
      "links": [],
      "text": "The village is situated in a small valley."
    },
    {
      "body": "The mining village is located in the snow-capped mountains of the western Earth Kingdom. These landforms have little ${link_0} on them and are yellow in coloration. The village is situated within a small valley, through which flows a small creek. An earthen wall surrounds the settlement, which has raised fortifications at its four corners.",
      "links": [
        {
          "body": "vegetation",
          "key": "${link_0}",
          "target": {
            "href": "Flora_in_the_World_of_Avatar",
            "page": "Flora_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "The mining village is located in the snow-capped mountains of the western Earth Kingdom. These landforms have little vegetation on them and are yellow in coloration. The village is situated within a small valley, through which flows a small creek. An earthen wall surrounds the settlement, which has raised fortifications at its four corners."
    },
    {
      "body": "The village contains only a few low-rise buildings. There are no paved roads, and dirt walkways that wind between the scattered structures of the village are the only thoroughfares. Most buildings are identical to each other; they all have a green roof, yellow walls, few windows, and a single wooden door at the front entrance. The windows have boards attached to them, which can be used to block light when necessary. The village's centerpiece building is a large palace-like structure found off to one side. It has intricate decorations and is a classic example of Earth Kingdom ${link_0}. A large, grand entrance is at the back of its front porch, which is supported by golden beams and pillars. The building is several stories tall, and has much floor space, making it the largest structure in the village. The uppermost floor has a small balcony that overlooks the entire village. Shingles cover the building's curved roof, which is green.",
      "links": [
        {
          "body": "architecture",
          "key": "${link_0}",
          "target": {
            "href": "Architecture_in_the_World_of_Avatar",
            "page": "Architecture_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "The village contains only a few low-rise buildings. There are no paved roads, and dirt walkways that wind between the scattered structures of the village are the only thoroughfares. Most buildings are identical to each other; they all have a green roof, yellow walls, few windows, and a single wooden door at the front entrance. The windows have boards attached to them, which can be used to block light when necessary. The village's centerpiece building is a large palace-like structure found off to one side. It has intricate decorations and is a classic example of Earth Kingdom architecture. A large, grand entrance is at the back of its front porch, which is supported by golden beams and pillars. The building is several stories tall, and has much floor space, making it the largest structure in the village. The uppermost floor has a small balcony that overlooks the entire village. Shingles cover the building's curved roof, which is green."
    },
    {
      "body": "The mining village has a very destitute market. Outdoors, there are many stalls and street side stands, from where hats and other cheap accessories can be purchased. Indoors, there are numerous shops and convenience stores. Haru's mother owns a worn-out grocery store, which sells an assortment of items.",
      "links": [],
      "text": "The mining village has a very destitute market. Outdoors, there are many stalls and street side stands, from where hats and other cheap accessories can be purchased. Indoors, there are numerous shops and convenience stores. Haru's mother owns a worn-out grocery store, which sells an assortment of items."
    },
    {
      "body": "${link_0}'s home is located in the surrounding mountains.",
      "links": [
        {
          "body": "Haru",
          "key": "${link_0}",
          "target": {
            "href": "Haru",
            "page": "Haru"
          }
        }
      ],
      "text": "Haru's home is located in the surrounding mountains."
    },
    {
      "body": "Haru's home is located in the mountains surrounding the village, and is close to the coast of the Mo Ce Sea. It is on a mountainside, and is surrounded by many similar houses scattered across the landscape. Behind Haru's home is an expansive evergreen forest.",
      "links": [],
      "text": "Haru's home is located in the mountains surrounding the village, and is close to the coast of the Mo Ce Sea. It is on a mountainside, and is surrounded by many similar houses scattered across the landscape. Behind Haru's home is an expansive evergreen forest."
    },
    {
      "body": "The design of the house is typical for a rural Earth Kingdom home. It is made of wood and has a slanted green roof with golden borders and lining. The house has a downhill-facing porch at its front entrance; it is supported by three wooden pillars. Two windows and a door open into the porch. The house is just one story tall.",
      "links": [],
      "text": "The design of the house is typical for a rural Earth Kingdom home. It is made of wood and has a slanted green roof with golden borders and lining. The house has a downhill-facing porch at its front entrance; it is supported by three wooden pillars. Two windows and a door open into the porch. The house is just one story tall."
    },
    {
      "body": "The property surrounding the house includes a few other buildings and facilities, including a barn with a water pump built near its entrance. The barn was constructed to store hay for the animals. It has a circular shape and is quite spacious. The barn is shaped like a hut, as it has a round roof and cylindrical sides. Like the house, wood is the main construction material for the barn, although plain dirt was used to make the floor. The entrance is a large wooden door – much larger than that of the house, as even massive animals can pass through them, including ${link_0}.",
      "links": [
        {
          "body": "flying bison",
          "key": "${link_0}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        }
      ],
      "text": "The property surrounding the house includes a few other buildings and facilities, including a barn with a water pump built near its entrance. The barn was constructed to store hay for the animals. It has a circular shape and is quite spacious. The barn is shaped like a hut, as it has a round roof and cylindrical sides. Like the house, wood is the main construction material for the barn, although plain dirt was used to make the floor. The entrance is a large wooden door – much larger than that of the house, as even massive animals can pass through them, including flying bison."
    },
    {
      "body": "Haru's mother operated a small shop in the marketplace of the mining village. The store is a tiny room with shelves lining the walls and a counter near the back. The shop sells basic food items, such as various types of berries, apples, and spices, as well as bowls, baskets, and other necessities.",
      "links": [],
      "text": "Haru's mother operated a small shop in the marketplace of the mining village. The store is a tiny room with shelves lining the walls and a counter near the back. The shop sells basic food items, such as various types of berries, apples, and spices, as well as bowls, baskets, and other necessities."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Mining_village",
    "file": "avatar.wikia.com/wiki/Mining_village.html",
    "page": "Mining_village",
    "title": "Mining village"
  }
}