{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Momo",
            "page": "Momo"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "Momo's relationships"
      ],
      "text": "This page is comprised of Momo's relationships with other characters in the World of Avatar."
    },
    {
      "body": "Of all the members of the ${link_0}, Momo seemed to share a closer relationship with ${link_1}. Appa and Momo were able to communicate, as they were seen sharing their separate experiences of traveling through the tunnels of the ${link_2}, seemingly understanding each other. Appa and Momo occasionally fought over equal portions of food, however, the two maintained a strong bond. At times, Appa did grow annoyed with Momo's antics and roared at him, to the latter's dismay. This was especially prevalent when the ${link_3} became trapped in a thicket of vines in the ${link_4}. Momo blew the ${link_5} twice and immediately after the second instance, Appa flipped his tail and hit the ${link_6} on the head, temporarily knocking him out. Despite this, it was evident that Momo cared for and missed Appa when the latter was stolen, as when ${link_7} mentioned Appa's name, Momo looked up hopefully but lowered his gaze with a forlorn expression when he realized that Appa was not there.",
      "links": [
        {
          "body": "group",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Cave of Two Lovers",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Cave_of_Two_Lovers",
            "page": "Cave_of_Two_Lovers"
          }
        },
        {
          "body": "flying bison",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "swamp",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "bison whistle",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Bison_whistle",
            "page": "Bison_whistle"
          }
        },
        {
          "body": "winged lemur",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Winged_lemur",
            "page": "Winged_lemur"
          }
        },
        {
          "body": "Aang",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        }
      ],
      "section": [
        "Momo's relationships",
        "Animals",
        "Appa"
      ],
      "text": "Of all the members of the group, Momo seemed to share a closer relationship with Appa. Appa and Momo were able to communicate, as they were seen sharing their separate experiences of traveling through the tunnels of the Cave of Two Lovers, seemingly understanding each other. Appa and Momo occasionally fought over equal portions of food, however, the two maintained a strong bond. At times, Appa did grow annoyed with Momo's antics and roared at him, to the latter's dismay. This was especially prevalent when the flying bison became trapped in a thicket of vines in the swamp. Momo blew the bison whistle twice and immediately after the second instance, Appa flipped his tail and hit the winged lemur on the head, temporarily knocking him out. Despite this, it was evident that Momo cared for and missed Appa when the latter was stolen, as when Aang mentioned Appa's name, Momo looked up hopefully but lowered his gaze with a forlorn expression when he realized that Appa was not there."
    },
    {
      "body": "During his time in ${link_0}, Momo tied some of Appa's fur around his leg and went searching for Appa, but he continually mistook figures and objects for being him. When he was eventually led to one of Appa's footprints by a trio of ${link_1}, a sad Momo curled up in its center, longing for his friend. After Appa was reunited with the group, Momo clung to the bison after the group had defeated ${link_2}, which showed that he was quite happy to see him again.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "pygmy pumas",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pygmy_puma",
            "page": "Pygmy_puma"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Long_Feng",
            "page": "Long_Feng"
          }
        }
      ],
      "section": [
        "Momo's relationships",
        "Animals",
        "Appa"
      ],
      "text": "During his time in Ba Sing Se, Momo tied some of Appa's fur around his leg and went searching for Appa, but he continually mistook figures and objects for being him. When he was eventually led to one of Appa's footprints by a trio of pygmy pumas, a sad Momo curled up in its center, longing for his friend. After Appa was reunited with the group, Momo clung to the bison after the group had defeated Long Feng, which showed that he was quite happy to see him again."
    },
    {
      "body": "When ${link_0} purchased ${link_1}, he and Momo developed an instant animosity, immediately fighting with each other. When the group left for town, leaving the two behind at their campsite, Sokka deemed Appa \"in charge\" of the pack. When the lemur and ${link_2} began scowling at one another, Appa ended their feud. Luckily for Momo, Hawky was sent off to deliver a message. Hawky never returned to Team Avatar, thus making Hawky and Momo's tense relationship short-lived.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Hawky",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hawky",
            "page": "Hawky"
          }
        },
        {
          "body": "hawk",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Messenger_hawk",
            "page": "Messenger_hawk"
          }
        }
      ],
      "section": [
        "Momo's relationships",
        "Animals",
        "Hawky"
      ],
      "text": "When Sokka purchased Hawky, he and Momo developed an instant animosity, immediately fighting with each other. When the group left for town, leaving the two behind at their campsite, Sokka deemed Appa \"in charge\" of the pack. When the lemur and hawk began scowling at one another, Appa ended their feud. Luckily for Momo, Hawky was sent off to deliver a message. Hawky never returned to Team Avatar, thus making Hawky and Momo's tense relationship short-lived."
    },
    {
      "body": "Momo once came across a trio of territorial ${link_0}. They chased him across the ${link_1} city of ${link_2} in an attempt to attack him, until all four of them were captured and sold to a restaurant for meat. Momo managed to escape and, after a moment's hesitation,freed the three pumas as well. Henceforth, the four animals got along with each other, and the pumas, as a token of gratitude, led Momo to Appa's footprint.",
      "links": [
        {
          "body": "pygmy pumas",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pygmy_puma",
            "page": "Pygmy_puma"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "Momo's relationships",
        "Animals",
        "Pygmy puma trio"
      ],
      "text": "Momo once came across a trio of territorial pygmy pumas. They chased him across the Earth Kingdom city of Ba Sing Se in an attempt to attack him, until all four of them were captured and sold to a restaurant for meat. Momo managed to escape and, after a moment's hesitation,freed the three pumas as well. Henceforth, the four animals got along with each other, and the pumas, as a token of gratitude, led Momo to Appa's footprint."
    },
    {
      "body": "Aang first met Momo when he returned home to the ${link_0}, initially frightening the creature by chasing after him playfully. They immediately became friends after Aang realized he and the lemur, along with Appa, were the only living remnants of the temple. He officially adopted Momo as his pet and gave him his name when he took a peach from Sokka's hand. Momo served as Aang's companion and was loyal to him. Momo also helped in many of Team Avatar's adventures, often using screeching sounds during fights, sometimes to signal for help. Momo followed Aang to the ${link_1}, when the latter was sleepwalking, and joined him at ${link_2}. When ${link_3} ${link_4}'s ${link_5} arrived at Wulong Forest, Aang told Momo to seek safety to which the lemur complied. Momo appeared again after Aang defeated the Fire Lord, and was last seen playing with Aang, who was using ${link_6}, and apparently \"insulted\" Sokka's crude artwork.",
      "links": [
        {
          "body": "Southern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        },
        {
          "body": "lion turtle",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lion_turtle#Era_of_the_Avatar",
            "page": "Lion_turtle"
          }
        },
        {
          "body": "Wulong Forest",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Wulong_Forest",
            "page": "Wulong_Forest"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "fleet",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        },
        {
          "body": "airbending",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        }
      ],
      "section": [
        "Momo's relationships",
        "Humans",
        "Aang"
      ],
      "text": "Aang first met Momo when he returned home to the Southern Air Temple, initially frightening the creature by chasing after him playfully. They immediately became friends after Aang realized he and the lemur, along with Appa, were the only living remnants of the temple. He officially adopted Momo as his pet and gave him his name when he took a peach from Sokka's hand. Momo served as Aang's companion and was loyal to him. Momo also helped in many of Team Avatar's adventures, often using screeching sounds during fights, sometimes to signal for help. Momo followed Aang to the lion turtle, when the latter was sleepwalking, and joined him at Wulong Forest. When Fire Lord Ozai's fleet arrived at Wulong Forest, Aang told Momo to seek safety to which the lemur complied. Momo appeared again after Aang defeated the Fire Lord, and was last seen playing with Aang, who was using airbending, and apparently \"insulted\" Sokka's crude artwork."
    },
    {
      "body": "${link_0} seemed to be fond of Momo. He said that Aang would need his friends, especially Momo, in their journey to defeat the ${link_1}. Bumi also seemed to believe that Momo had mastered \"a few ${link_2} himself\", despite Momo showing a general lack of fighting ability. Later, Bumi mysteriously believed that Momo was an important member of the group, more important than the ${link_3}, even, by comically saying \"Someone is missing from your group. Someone very important ... Where's Momo?\", instead of asking where the also missing Aang was.",
      "links": [
        {
          "body": "Bumi",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "jings",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Jing",
            "page": "Jing"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "Momo's relationships",
        "Humans",
        "Bumi"
      ],
      "text": "Bumi seemed to be fond of Momo. He said that Aang would need his friends, especially Momo, in their journey to defeat the Fire Nation. Bumi also seemed to believe that Momo had mastered \"a few jings himself\", despite Momo showing a general lack of fighting ability. Later, Bumi mysteriously believed that Momo was an important member of the group, more important than the Avatar, even, by comically saying \"Someone is missing from your group. Someone very important ... Where's Momo?\", instead of asking where the also missing Aang was."
    },
    {
      "body": "${link_0} often referred to Momo in the usual manner of a pet owner, calling him cute, or joking about him. When he fell down after hallucinating on ${link_1}, Katara cradled and carried him. However, she sometimes seemed to view Momo as more than a pet. Momo was Katara's only companion when she was summoned by the ${link_2} to plan for the upcoming battle. Afterward, she talked to Momo conversationally, and when they decided to visit the ${link_3}, Katara ordered a \"table for two\", implying that Momo would get his own seat. Katara also tried being humorous by placing Momo on her head, and at one point, he managed to untie her from a tree to which ${link_4} had tied her, an action that prompted Katara to promise him a \"bushel of apples\".",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "cactus juice",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Cactus_juice",
            "page": "Cactus_juice"
          }
        },
        {
          "body": "Council of Five",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Council_of_Five",
            "page": "Council_of_Five"
          }
        },
        {
          "body": "Jasmine Dragon",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        }
      ],
      "section": [
        "Momo's relationships",
        "Humans",
        "Katara"
      ],
      "text": "Katara often referred to Momo in the usual manner of a pet owner, calling him cute, or joking about him. When he fell down after hallucinating on cactus juice, Katara cradled and carried him. However, she sometimes seemed to view Momo as more than a pet. Momo was Katara's only companion when she was summoned by the Council of Five to plan for the upcoming battle. Afterward, she talked to Momo conversationally, and when they decided to visit the Jasmine Dragon, Katara ordered a \"table for two\", implying that Momo would get his own seat. Katara also tried being humorous by placing Momo on her head, and at one point, he managed to untie her from a tree to which Zuko had tied her, an action that prompted Katara to promise him a \"bushel of apples\"."
    },
    {
      "body": "Momo seemed to have a close relationship with Sokka. He was often seen riding on Sokka's shoulder or sitting next to him. When Sokka first met Momo, he attempted to eat him due to severe hunger. He and Aang chased Momo all around the Southern Air Temple. Momo later gave Sokka several peaches to feed him, although he stole the last one right out of Sokka's hand, and thus ensured their friendship. When they arrived at the ${link_0} on the ${link_1}, Katara said to Appa, \"You must be tired\", after a long, tiring journey to the island. Sokka, thinking she had said this to him, said he was not. When Katara said she was talking to Appa, Sokka retaliated by saying he was talking to Momo. He later rode on Sokka's back while they were running away from the ${link_2}. While flying to the ${link_3}, when a grumpy Sokka comically told everyone to climb on his back to fly, Momo jumped and sat on his back. Shortly after, Sokka was seen holding Momo on his lap. During the time at ${link_4} ${link_5}'s base, Sokka used Momo by putting him in his shirt, trying to shock Aang into triggering the ${link_6}, though it did not work. Later, when they were wandering through the ${link_7}, Sokka put Momo on his head for shade and later they both hallucinated on cactus juice, and they both shared a room at ${link_8}. After Katara and Zuko rode off on Appa, Sokka asked Aang if he could borrow Momo for a week; Aang questioned him as to why he needed Momo to which Sokka just shrugged. Sokka appeared slightly irritated after Momo, along with the rest of the group, criticized his rudimentary drawing of the team, questioning the lemur if he \"could do a better job\".",
      "links": [
        {
          "body": "Crescent Island",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Crescent_Island",
            "page": "Crescent_Island"
          }
        },
        {
          "body": "winter solstice",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Winter_solstice",
            "page": "Winter_solstice"
          }
        },
        {
          "body": "Fire Sages",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "North Pole",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "General",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#General",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Fong",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Fong",
            "page": "Fong"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        },
        {
          "body": "Hama's inn",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Hama%27s_inn",
            "page": "Hama%27s_inn"
          }
        }
      ],
      "section": [
        "Momo's relationships",
        "Humans",
        "Sokka"
      ],
      "text": "Momo seemed to have a close relationship with Sokka. He was often seen riding on Sokka's shoulder or sitting next to him. When Sokka first met Momo, he attempted to eat him due to severe hunger. He and Aang chased Momo all around the Southern Air Temple. Momo later gave Sokka several peaches to feed him, although he stole the last one right out of Sokka's hand, and thus ensured their friendship. When they arrived at the Crescent Island on the winter solstice, Katara said to Appa, \"You must be tired\", after a long, tiring journey to the island. Sokka, thinking she had said this to him, said he was not. When Katara said she was talking to Appa, Sokka retaliated by saying he was talking to Momo. He later rode on Sokka's back while they were running away from the Fire Sages. While flying to the North Pole, when a grumpy Sokka comically told everyone to climb on his back to fly, Momo jumped and sat on his back. Shortly after, Sokka was seen holding Momo on his lap. During the time at General Fong's base, Sokka used Momo by putting him in his shirt, trying to shock Aang into triggering the Avatar State, though it did not work. Later, when they were wandering through the Si Wong Desert, Sokka put Momo on his head for shade and later they both hallucinated on cactus juice, and they both shared a room at Hama's inn. After Katara and Zuko rode off on Appa, Sokka asked Aang if he could borrow Momo for a week; Aang questioned him as to why he needed Momo to which Sokka just shrugged. Sokka appeared slightly irritated after Momo, along with the rest of the group, criticized his rudimentary drawing of the team, questioning the lemur if he \"could do a better job\"."
    },
    {
      "body": "Momo wandered around the city of ${link_0}, looking for food, when he found a bowl of ${link_1} on a table. While Momo ate, the infant ${link_2} saw the lemur's tail and yanked on it out of curiosity, causing Momo to screech in pain. When Momo tried to evade him, Tom-Tom followed him and grabbed his tail as they flew all over Omashu. After the people of Omashu managed to make their escape, Tom-Tom was seen hugging Momo while the latter tried to desperately get away.",
      "links": [
        {
          "body": "Omashu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "lychee nuts",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lychee_nut",
            "page": "Lychee_nut"
          }
        },
        {
          "body": "Tom-Tom",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Tom-Tom",
            "page": "Tom-Tom"
          }
        }
      ],
      "section": [
        "Momo's relationships",
        "Humans",
        "Tom-Tom"
      ],
      "text": "Momo wandered around the city of Omashu, looking for food, when he found a bowl of lychee nuts on a table. While Momo ate, the infant Tom-Tom saw the lemur's tail and yanked on it out of curiosity, causing Momo to screech in pain. When Momo tried to evade him, Tom-Tom followed him and grabbed his tail as they flew all over Omashu. After the people of Omashu managed to make their escape, Tom-Tom was seen hugging Momo while the latter tried to desperately get away."
    },
    {
      "body": "Although ${link_0} and Momo barely interacted throughout the adventures of Team Avatar, Momo did ride on her shoulder when they were traveling through the ${link_1}. She was also comfortable with letting him eat nuts out of her hand. On a ${link_2} in Ba Sing Se, he slept on her lap while she petted him. While the team was sleeping during their journey through the Fire Nation, Momo was curled up next to Toph until Team Avatar was attacked by ${link_3}. At the ${link_4} ferry station, when told animals were not allowed aboard the ferries, Toph readily claimed that Momo was her \"seeing-eye lemur\", thereby granting him the right to travel via ferry. Despite these small interactions, they seemed to have established a sense of trust and formed a normal, friendly relationship.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Serpent's Pass",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Serpent%27s_Pass",
            "page": "Serpent%27s_Pass"
          }
        },
        {
          "body": "monorail",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Monorail",
            "page": "Monorail"
          }
        },
        {
          "body": "Combustion Man",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Combustion_Man",
            "page": "Combustion_Man"
          }
        },
        {
          "body": "Full Moon Bay",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Full_Moon_Bay",
            "page": "Full_Moon_Bay"
          }
        }
      ],
      "section": [
        "Momo's relationships",
        "Humans",
        "Toph"
      ],
      "text": "Although Toph and Momo barely interacted throughout the adventures of Team Avatar, Momo did ride on her shoulder when they were traveling through the Serpent's Pass. She was also comfortable with letting him eat nuts out of her hand. On a monorail in Ba Sing Se, he slept on her lap while she petted him. While the team was sleeping during their journey through the Fire Nation, Momo was curled up next to Toph until Team Avatar was attacked by Combustion Man. At the Full Moon Bay ferry station, when told animals were not allowed aboard the ferries, Toph readily claimed that Momo was her \"seeing-eye lemur\", thereby granting him the right to travel via ferry. Despite these small interactions, they seemed to have established a sense of trust and formed a normal, friendly relationship."
    },
    {
      "body": "While Zuko was Momo's enemy for quite a while, a result of the former's antagonism toward Team Avatar, he quickly warmed up to Zuko when the ${link_0} underwent a change of heart and expressed his desire to join the group, and was sad when Zuko was initially rejected. During one of Aang's ${link_1} lessons, Momo hid himself behind Zuko for protection.",
      "links": [
        {
          "body": "prince",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        }
      ],
      "section": [
        "Momo's relationships",
        "Humans",
        "Zuko"
      ],
      "text": "While Zuko was Momo's enemy for quite a while, a result of the former's antagonism toward Team Avatar, he quickly warmed up to Zuko when the prince underwent a change of heart and expressed his desire to join the group, and was sad when Zuko was initially rejected. During one of Aang's firebending lessons, Momo hid himself behind Zuko for protection."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Momo%27s_relationships",
    "file": "avatar.wikia.com/wiki/Momo's_relationships.html",
    "page": "Momo's_relationships",
    "title": "Momo's relationships"
  }
}