{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "external": false,
        "href": "/wiki/Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Landforms",
      "target": {
        "external": false,
        "href": "/wiki/Category_Landforms",
        "page": "Category_Landforms"
      }
    },
    {
      "body": "Locations",
      "target": {
        "external": false,
        "href": "/wiki/Category_Locations",
        "page": "Category_Locations"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "Northwestern ${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Earth Kingdom",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Earth_Kingdom",
                "page": "Earth_Kingdom"
              }
            }
          ],
          "text": "Northwestern Earth Kingdom",
          "value": "Northwestern ${link_0}",
          "value_text": "Northwestern Earth Kingdom"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "${link_0} trap",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Airbender",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Airbending",
                "page": "Airbending"
              }
            }
          ],
          "text": "Airbender trap",
          "value": "${link_0} trap",
          "value_text": "Airbender trap"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\" (only appearance)",
          "extra": "(only appearance)",
          "extra_text": "(only appearance)",
          "links": [
            {
              "body": "Relics",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Relics",
                "page": "Relics"
              }
            }
          ],
          "text": "\"Relics\" (only appearance)",
          "value": "\"${link_0}\"",
          "value_text": "\"Relics\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The mountain cave is a man-made cave ${link_0} in the mountains of the northwestern ${link_1}. It was created by the ${link_2} as part of a trap to capture and kill the few ${link_3} that had survived the ${link_4} and fled to the Earth Kingdom. The cave is located near the ${link_5}.",
      "links": [
        {
          "body": "situated",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Geography_of_the_World_of_Avatar",
            "page": "Geography_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Air Nomad Genocide",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "merchant town",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Merchant_town",
            "page": "Merchant_town"
          }
        }
      ],
      "section": [
        "Mountain cave"
      ],
      "text": "The mountain cave is a man-made cave situated in the mountains of the northwestern Earth Kingdom. It was created by the Fire Nation as part of a trap to capture and kill the few airbenders that had survived the Air Nomad Genocide and fled to the Earth Kingdom. The cave is located near the merchant town."
    },
    {
      "body": "Most of the ${link_0} population had been wiped out in the initial attack on the ${link_1} when ${link_2} passed by. However, the small number of airbenders that had survived proved too difficult for the Fire Nation to hunt down, and ${link_3} ${link_4} was forced to come up with a different strategy. After the cave was carved, ${link_5} placed various Air Nomad relics near and inside the cave to trick passing airbenders into thinking that it was inhabited by a fellow monk or nun. The trap was successful, and when Air Nomads entered the cave, soldiers hiding inside ambushed and killed the unsuspecting refugees. This tactic was repeated in caves across the Earth Kingdom.",
      "links": [
        {
          "body": "Air Nomad",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "air temples",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Air_temple",
            "page": "Air_temple"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "Fire Nation troops",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        }
      ],
      "section": [
        "Mountain cave",
        "History"
      ],
      "text": "Most of the Air Nomad population had been wiped out in the initial attack on the air temples when Sozin's Comet passed by. However, the small number of airbenders that had survived proved too difficult for the Fire Nation to hunt down, and Fire Lord Sozin was forced to come up with a different strategy. After the cave was carved, Fire Nation troops placed various Air Nomad relics near and inside the cave to trick passing airbenders into thinking that it was inhabited by a fellow monk or nun. The trap was successful, and when Air Nomads entered the cave, soldiers hiding inside ambushed and killed the unsuspecting refugees. This tactic was repeated in caves across the Earth Kingdom."
    },
    {
      "body": "A hundred years later, ${link_0} ${link_1} attempted to repeat the success of Sozin's trap with ${link_2} ${link_3}. The officer approached an Earth Kingdom ${link_4} and offered to give him all the Air Nomad relics in the mountain cave if he assisted in the capture of the Avatar. The merchant complied and told Aang he had gotten an Air Nomad pendant from a man in the mountains; the young airbender quickly became curious about the identity of this man, and believed that he may be an airbender due to his possession of an Air Nomad artifact. After nightfall, Aang went into the mountains alone to search for this man. He discovered a cave lit by candles and went inside, where he saw a person sitting among a large pile of Air Nomad relics. Initially, Aang wondered if it was the man who owned the pendant; however, as the figure turned around, he was shocked to see that the man was actually the merchant. At this point, Zhao's troops ambushed Aang and tied him up with rope. The admiral mocked Aang by stating how many other airbenders had fallen for the same trap, and that the Avatar's lack of military knowledge proved his downfall. Despite being tied up, Aang was able to retaliate easily with airbending, and used the relics around him to attack Zhao and his soldiers before running out of the cave.",
      "links": [
        {
          "body": "Admiral",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "merchant",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Merchant",
            "page": "Merchant"
          }
        }
      ],
      "section": [
        "Mountain cave",
        "History"
      ],
      "text": "A hundred years later, Admiral Zhao attempted to repeat the success of Sozin's trap with Avatar Aang. The officer approached an Earth Kingdom merchant and offered to give him all the Air Nomad relics in the mountain cave if he assisted in the capture of the Avatar. The merchant complied and told Aang he had gotten an Air Nomad pendant from a man in the mountains; the young airbender quickly became curious about the identity of this man, and believed that he may be an airbender due to his possession of an Air Nomad artifact. After nightfall, Aang went into the mountains alone to search for this man. He discovered a cave lit by candles and went inside, where he saw a person sitting among a large pile of Air Nomad relics. Initially, Aang wondered if it was the man who owned the pendant; however, as the figure turned around, he was shocked to see that the man was actually the merchant. At this point, Zhao's troops ambushed Aang and tied him up with rope. The admiral mocked Aang by stating how many other airbenders had fallen for the same trap, and that the Avatar's lack of military knowledge proved his downfall. Despite being tied up, Aang was able to retaliate easily with airbending, and used the relics around him to attack Zhao and his soldiers before running out of the cave."
    },
    {
      "body": "Airbending staff — Brown in coloration, this relic is similar to ${link_0} in design, but is of a shorter length and more simplistic. Overall, it is in bad condition, as the tips have snapped off and is tied in the middle to a bundle of rope.",
      "links": [
        {
          "body": "Aang's staff",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Airbender_staff",
            "page": "Airbender_staff"
          }
        }
      ],
      "section": [
        "Mountain cave",
        "Air Nomad relics"
      ],
      "text": "Airbending staff — Brown in coloration, this relic is similar to Aang's staff in design, but is of a shorter length and more simplistic. Overall, it is in bad condition, as the tips have snapped off and is tied in the middle to a bundle of rope."
    },
    {
      "body": "Beads — Small and fragile pieces of jewelery. Individual beads are brown and connected to other beads through a thin, black string.",
      "links": [],
      "section": [
        "Mountain cave",
        "Air Nomad relics"
      ],
      "text": "Beads — Small and fragile pieces of jewelery. Individual beads are brown and connected to other beads through a thin, black string."
    },
    {
      "body": "${link_0} — A decorative item used in rituals, though their shape and structure also allows for use as an airbending weapon. They are quite large and made from wooden planks, which culminate at the center and edges. Between the center and edge, the wooden planks have large gaps between each other.",
      "links": [
        {
          "body": "Dorje",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dorje",
            "page": "Dorje"
          }
        }
      ],
      "section": [
        "Mountain cave",
        "Air Nomad relics"
      ],
      "text": "Dorje — A decorative item used in rituals, though their shape and structure also allows for use as an airbending weapon. They are quite large and made from wooden planks, which culminate at the center and edges. Between the center and edge, the wooden planks have large gaps between each other."
    },
    {
      "body": "Gong — A thick circular disk that makes a loud sound when struck. One side is adorned with a green, white, and purple swirl for aesthetics. The top and sides of the disk are attached to a larger figure, which suspends it in the air. This figure is made from wood and has a blue top.",
      "links": [],
      "section": [
        "Mountain cave",
        "Air Nomad relics"
      ],
      "text": "Gong — A thick circular disk that makes a loud sound when struck. One side is adorned with a green, white, and purple swirl for aesthetics. The top and sides of the disk are attached to a larger figure, which suspends it in the air. This figure is made from wood and has a blue top."
    },
    {
      "body": "Horn — A golden ${link_0} that generates a clamorous noise when played though the use of airbending. One must blow through the smaller of the two holes on either side of the horn to play it adequately. The instrument is tiered and somewhat crooked on one side.",
      "links": [
        {
          "body": "musical instrument",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Music_in_the_World_of_Avatar",
            "page": "Music_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Mountain cave",
        "Air Nomad relics"
      ],
      "text": "Horn — A golden musical instrument that generates a clamorous noise when played though the use of airbending. One must blow through the smaller of the two holes on either side of the horn to play it adequately. The instrument is tiered and somewhat crooked on one side."
    },
    {
      "body": "Pendant — A necklace worn exclusively on special occasions. It resembles a bead, but has a brown choker with the emblem of the Air Nomads attached to it. The insignia is three white swirls of equal size etched onto the wood of the choker.",
      "links": [],
      "section": [
        "Mountain cave",
        "Air Nomad relics"
      ],
      "text": "Pendant — A necklace worn exclusively on special occasions. It resembles a bead, but has a brown choker with the emblem of the Air Nomads attached to it. The insignia is three white swirls of equal size etched onto the wood of the choker."
    },
    {
      "body": "Pottery — Pots, vessels, and vases are the among most common types of Air Nomad artifacts found. They come in various different sizes and colors and each have their own unique pattern of designs. A common pattern in pottery is the use of dark lines that are parallel to the edges of the ornament.",
      "links": [],
      "section": [
        "Mountain cave",
        "Air Nomad relics"
      ],
      "text": "Pottery — Pots, vessels, and vases are the among most common types of Air Nomad artifacts found. They come in various different sizes and colors and each have their own unique pattern of designs. A common pattern in pottery is the use of dark lines that are parallel to the edges of the ornament."
    },
    {
      "body": "Statue of a monk — A large brown sculpture that depicts the head and torso of a male airbender. The monk is shown in traditional Air Nomad attire, and is wearing a necklace as a decorative add-on. As indicated by his ${link_0}, the person being portrayed had mastered airbending.",
      "links": [
        {
          "body": "arrow tattoos",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Body_markings_in_the_World_of_Avatar#Airbending_masters",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Mountain cave",
        "Air Nomad relics"
      ],
      "text": "Statue of a monk — A large brown sculpture that depicts the head and torso of a male airbender. The monk is shown in traditional Air Nomad attire, and is wearing a necklace as a decorative add-on. As indicated by his arrow tattoos, the person being portrayed had mastered airbending."
    },
    {
      "body": "${link_0} — An enormous mound-like structure that has blue eyes and tattoos painted onto its side. It is brown, circular, and has tiers of varying size. A round chip bearing the Air Nomad emblem is attached to the tip of the stupa.",
      "links": [
        {
          "body": "Stupa",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Stupa",
            "page": "Stupa"
          }
        }
      ],
      "section": [
        "Mountain cave",
        "Air Nomad relics"
      ],
      "text": "Stupa — An enormous mound-like structure that has blue eyes and tattoos painted onto its side. It is brown, circular, and has tiers of varying size. A round chip bearing the Air Nomad emblem is attached to the tip of the stupa."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Mountain_cave",
    "file": "avatar.wikia.com/wiki/Mountain_cave.html",
    "page": "Mountain_cave",
    "title": "Mountain cave"
  }
}