{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}.",
      "links": [
        {
          "body": "Naga",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Naga",
            "page": "Naga"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "Naga's relationships"
      ],
      "text": "This page is comprised of Naga's relationships with other characters in the World of Avatar."
    },
    {
      "body": "Naga first met ${link_0} when she, ${link_1}, and ${link_2} were heading toward the ${link_3}'s headquarters. When she saw the ${link_4}, she chased him up a lamp post. However, she backed down on Korra's command, and after sniffing the animal, Naga allowed Pabu to jump on her head, letting him run to Mako. Apart from their first misunderstanding, Naga and Pabu seemed immediately comfortable with each other to the point where Naga did not protest when Pabu stood on her head to drink from the same water source as she did.",
      "links": [
        {
          "body": "Pabu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pabu",
            "page": "Pabu"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Triple Threat Triad",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "fire ferret",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_ferret",
            "page": "Fire_ferret"
          }
        }
      ],
      "section": [
        "Naga's relationships",
        "Animals",
        "Pabu"
      ],
      "text": "Naga first met Pabu when she, Korra, and Mako were heading toward the Triple Threat Triad's headquarters. When she saw the fire ferret, she chased him up a lamp post. However, she backed down on Korra's command, and after sniffing the animal, Naga allowed Pabu to jump on her head, letting him run to Mako. Apart from their first misunderstanding, Naga and Pabu seemed immediately comfortable with each other to the point where Naga did not protest when Pabu stood on her head to drink from the same water source as she did."
    },
    {
      "body": "Later, when Pabu arrived on ${link_0} with Mako, ${link_1}, and ${link_2}, he immediately ran toward Naga and sniffed her nose. Afterward, Naga playfully chased the fire ferret around the island. The two animals remained good friends for the years to come.",
      "links": [
        {
          "body": "Air Temple Island",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "section": [
        "Naga's relationships",
        "Animals",
        "Pabu"
      ],
      "text": "Later, when Pabu arrived on Air Temple Island with Mako, Bolin, and Asami, he immediately ran toward Naga and sniffed her nose. Afterward, Naga playfully chased the fire ferret around the island. The two animals remained good friends for the years to come."
    },
    {
      "body": "Korra was the first person to ever manage to tame a ${link_0}. Since that moment on, the two became the best of friends. Despite her intimidating appearance, Korra described Naga as a sweetheart and her best friend. In return, Naga is loyal and very protective of Korra and has learned to use her tremendous strength and intimidating stature to help her out of various situations. The two share a bond of trust with each other and care deeply for one another. When Korra passed her ${link_1} test, she immediately ran toward Naga to tell her of the good news even before telling her parents. Also, when she traveled to ${link_2}, she did not hesitate to bring the large animal with her.",
      "links": [
        {
          "body": "polar bear dog",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Polar_bear_dog",
            "page": "Polar_bear_dog"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "section": [
        "Naga's relationships",
        "Humans",
        "Korra"
      ],
      "text": "Korra was the first person to ever manage to tame a polar bear dog. Since that moment on, the two became the best of friends. Despite her intimidating appearance, Korra described Naga as a sweetheart and her best friend. In return, Naga is loyal and very protective of Korra and has learned to use her tremendous strength and intimidating stature to help her out of various situations. The two share a bond of trust with each other and care deeply for one another. When Korra passed her firebending test, she immediately ran toward Naga to tell her of the good news even before telling her parents. Also, when she traveled to Republic City, she did not hesitate to bring the large animal with her."
    },
    {
      "body": "While staying at Air Temple Island, Naga slept in Korra's room where she would always be able to comfort her master if needed. Naga showed concern for Korra when she awoke screaming after a nightmare and licked her hand to set her at ease again. Korra trained Naga well, as the polar bear dog reacts on the slightest commands given by her master, even if it goes against her own wishes at that time. Korra trusted Naga enough to attempt to use her as a means of transport for her and the newly formed ${link_0}, as Aang had done with his ${link_1}. However, she was unable to hold their combined weight on her back.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "sky bison",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Flying_bison",
            "page": "Flying_bison"
          }
        }
      ],
      "section": [
        "Naga's relationships",
        "Humans",
        "Korra"
      ],
      "text": "While staying at Air Temple Island, Naga slept in Korra's room where she would always be able to comfort her master if needed. Naga showed concern for Korra when she awoke screaming after a nightmare and licked her hand to set her at ease again. Korra trained Naga well, as the polar bear dog reacts on the slightest commands given by her master, even if it goes against her own wishes at that time. Korra trusted Naga enough to attempt to use her as a means of transport for her and the newly formed Team Avatar, as Aang had done with his sky bison. However, she was unable to hold their combined weight on her back."
    },
    {
      "body": "Much of her loyalty was proven when Korra vanished from Republic City. After being kidnapped by ${link_0}, she was brought to a ${link_1}. Naga went searching for Korra and eventually found her cold and hurt; she subsequently brought Korra back to Republic City safely.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "place outside of Republic City",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tarrlok%27s_hideout",
            "page": "Tarrlok%27s_hideout"
          }
        }
      ],
      "section": [
        "Naga's relationships",
        "Humans",
        "Korra"
      ],
      "text": "Much of her loyalty was proven when Korra vanished from Republic City. After being kidnapped by Tarrlok, she was brought to a place outside of Republic City. Naga went searching for Korra and eventually found her cold and hurt; she subsequently brought Korra back to Republic City safely."
    },
    {
      "body": "During the ${link_0} ${link_1}, Naga helped Team Avatar by attacking Equalists, therefore defending her owner. After Air Temple Island was captured by Equalists, Korra brought Naga with her to hide out with the vagabond ${link_2}. The two shared a bond so strong to the point where Korra chose to sleep on Naga's back instead of sleeping in a normal bed. While Korra and Mako went to go face ${link_3}, Korra trusted Naga to keep Bolin, Asami, and ${link_4} safe. When Korra wanted to find out the truth about ${link_5}'s nature through ${link_6}, Naga quickly assisted in the interrogation by opening her mouth wide to let have the judge's head placed between it.",
      "links": [
        {
          "body": "Equalist",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "attack on Republic City",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Battle_for_Republic_City",
            "page": "Battle_for_Republic_City"
          }
        },
        {
          "body": "Gommu",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Gommu",
            "page": "Gommu"
          }
        },
        {
          "body": "Amon",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh_(United_Forces_general)",
            "page": "Iroh_(United_Forces_general)"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Hotah",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Hotah",
            "page": "Hotah"
          }
        }
      ],
      "section": [
        "Naga's relationships",
        "Humans",
        "Korra"
      ],
      "text": "During the Equalist attack on Republic City, Naga helped Team Avatar by attacking Equalists, therefore defending her owner. After Air Temple Island was captured by Equalists, Korra brought Naga with her to hide out with the vagabond Gommu. The two shared a bond so strong to the point where Korra chose to sleep on Naga's back instead of sleeping in a normal bed. While Korra and Mako went to go face Amon, Korra trusted Naga to keep Bolin, Asami, and Iroh safe. When Korra wanted to find out the truth about Unalaq's nature through Hotah, Naga quickly assisted in the interrogation by opening her mouth wide to let have the judge's head placed between it."
    },
    {
      "body": "At times when Korra failed to give Naga treats, Naga tends to sass back at Korra, mildly whipping her tail in displeasure.",
      "links": [],
      "section": [
        "Naga's relationships",
        "Humans",
        "Korra"
      ],
      "text": "At times when Korra failed to give Naga treats, Naga tends to sass back at Korra, mildly whipping her tail in displeasure."
    },
    {
      "body": "Despite Lin's indifference toward her, Naga has taken a noticeable liking to the ${link_0}. At one point, Naga tried to get ${link_1} to play fetch with her, only for an irritated Lin to pop her ball. Later, at least learning to bear with the polar bear dog, Lin began carrying treats to keep Naga occupied.",
      "links": [
        {
          "body": "Chief of Police",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Chief_of_Police",
            "page": "Chief_of_Police"
          }
        },
        {
          "body": "Lin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        }
      ],
      "section": [
        "Naga's relationships",
        "Humans",
        "Lin Beifong"
      ],
      "text": "Despite Lin's indifference toward her, Naga has taken a noticeable liking to the Chief of Police. At one point, Naga tried to get Lin to play fetch with her, only for an irritated Lin to pop her ball. Later, at least learning to bear with the polar bear dog, Lin began carrying treats to keep Naga occupied."
    },
    {
      "body": "As Naga was Korra's usual method of ${link_0}, Korra tried to use her to patrol Republic City with the other three members of Team Avatar. However, carrying all four teenagers on her back was not to the polar bear dog's liking, and when the group climbed onto her, she proceeded to bend forward, effectively throwing everyone off her back.",
      "links": [
        {
          "body": "transportation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Transportation_in_the_World_of_Avatar",
            "page": "Transportation_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Naga's relationships",
        "Humans",
        "Team Avatar"
      ],
      "text": "As Naga was Korra's usual method of transportation, Korra tried to use her to patrol Republic City with the other three members of Team Avatar. However, carrying all four teenagers on her back was not to the polar bear dog's liking, and when the group climbed onto her, she proceeded to bend forward, effectively throwing everyone off her back."
    },
    {
      "body": "After the attack on Republic City began, Korra took Naga and the rest of Team Avatar to go into hiding with her. They found refuge in a settlement that the vagabond, Gommu, and many others were hiding in. Here, Korra decided that she had to defeat Amon and liberate Republic City. Korra showed that she believed her pet to be capable of protecting her friends from danger when she went with Mako to take down Amon, and entrusted Naga to take care of Bolin, Asami, and Iroh during their trip to the ${link_0}, where they would take down Hiroshi Sato and his ${link_1}. However, the group was quickly caught in a trap and placed in an Equalist prison. Naga searched for them and was able to find their cell. She tore open the bars using her incredible strength, showing that she had truly begun to care for the rest of Team Avatar in her time knowing them.",
      "links": [
        {
          "body": "Equalist airfield",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi%27s_secret_airfield",
            "page": "Hiroshi%27s_secret_airfield"
          }
        },
        {
          "body": "biplanes",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Biplane",
            "page": "Biplane"
          }
        }
      ],
      "section": [
        "Naga's relationships",
        "Humans",
        "Team Avatar"
      ],
      "text": "After the attack on Republic City began, Korra took Naga and the rest of Team Avatar to go into hiding with her. They found refuge in a settlement that the vagabond, Gommu, and many others were hiding in. Here, Korra decided that she had to defeat Amon and liberate Republic City. Korra showed that she believed her pet to be capable of protecting her friends from danger when she went with Mako to take down Amon, and entrusted Naga to take care of Bolin, Asami, and Iroh during their trip to the Equalist airfield, where they would take down Hiroshi Sato and his biplanes. However, the group was quickly caught in a trap and placed in an Equalist prison. Naga searched for them and was able to find their cell. She tore open the bars using her incredible strength, showing that she had truly begun to care for the rest of Team Avatar in her time knowing them."
    },
    {
      "body": "Naga aided Bolin, Iroh, and Asami in their attack against the planes. She helped Bolin take down several Equalist tanks, showing her determination to aid the team. When Asami was destroying the last of the Equalist planes and her father attacked her, Bolin, riding on Naga's back, returned and saved Asami from harm.",
      "links": [],
      "section": [
        "Naga's relationships",
        "Humans",
        "Team Avatar"
      ],
      "text": "Naga aided Bolin, Iroh, and Asami in their attack against the planes. She helped Bolin take down several Equalist tanks, showing her determination to aid the team. When Asami was destroying the last of the Equalist planes and her father attacked her, Bolin, riding on Naga's back, returned and saved Asami from harm."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Naga%27s_relationships",
    "file": "avatar.wikia.com/wiki/Naga's_relationships.html",
    "page": "Naga's_relationships",
    "title": "Naga's relationships"
  }
}