{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Real world",
      "target": {
        "href": "Category_Real_world",
        "page": "Category_Real_world"
      }
    },
    {
      "body": "Video games",
      "target": {
        "href": "Category_Video_games",
        "page": "Category_Video_games"
      }
    },
    {
      "body": "Online games",
      "target": {
        "href": "Category_Online_games",
        "page": "Category_Online_games"
      }
    }
  ],
  "facts": [
    {
      "key": "Publishers",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Nickelodeon",
              "key": "${link_0}",
              "target": {
                "href": "Nickelodeon",
                "page": "Nickelodeon"
              }
            }
          ],
          "text": "Nickelodeon",
          "value": "${link_0}",
          "value_text": "Nickelodeon"
        }
      ]
    },
    {
      "key": "Genre(s)",
      "value": [
        {
          "body": "Brawl",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Brawl",
          "value": "Brawl",
          "value_text": "Brawl"
        }
      ]
    },
    {
      "key": "Company",
      "value": [
        {
          "body": "Nickelodeon",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Nickelodeon",
          "value": "Nickelodeon",
          "value_text": "Nickelodeon"
        }
      ]
    },
    {
      "key": "Platform(s)",
      "value": [
        {
          "body": "Internet",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Internet",
          "value": "Internet",
          "value_text": "Internet"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Nicktoons: Dance Off, Clash On! is a game hosted by Nick.com.",
      "links": [],
      "text": "Nicktoons: Dance Off, Clash On! is a game hosted by Nick.com."
    },
    {
      "body": "Antagonists from numerous ${link_0} series invade the dance of their enemy Nicktoons, and it is the task of three young protagonists to save the day and ensure the party continues.",
      "links": [
        {
          "body": "Nickelodeon",
          "key": "${link_0}",
          "target": {
            "href": "Nickelodeon",
            "page": "Nickelodeon"
          }
        }
      ],
      "text": "Antagonists from numerous Nickelodeon series invade the dance of their enemy Nicktoons, and it is the task of three young protagonists to save the day and ensure the party continues."
    },
    {
      "body": "${link_0} faces four ${link_1} party-crashers.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Aang faces four firebending party-crashers."
    },
    {
      "body": "The game begins by prompting the player to choose a character. There are three playable characters to choose from: ${link_0} from ${link_1}, Timmy Turner from The Fairly OddParents, and GIR from Invader Zim. Once this has been done the player goes through a tutorial of the basic controls, and the enemies appear immediately afterward.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_1}",
          "target": {
            "href": "Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        }
      ],
      "text": "The game begins by prompting the player to choose a character. There are three playable characters to choose from: Aang from Avatar: The Last Airbender, Timmy Turner from The Fairly OddParents, and GIR from Invader Zim. Once this has been done the player goes through a tutorial of the basic controls, and the enemies appear immediately afterward."
    },
    {
      "body": "The first wave of antagonists to oppose the player's character is from the Invader Zim universe. All enemies must be knocked over a certain number of times to be defeated, with that number depending on what enemy is considered. After falling over twice, they will disappear from the game, and from where they had lain a barrage of balls spins across the dance floor. These balls should be collected for two reasons: one, that doing so raises the score counter by 100 points per ball, unless otherwise noted; and two, that doing so fills up the Party Meter a slight amount per ball. The Party Meter is a gauge of how many balls are necessary for collection until the player can employ his or her character's dance move. This dance move is a special attack that knocks every enemy on the floor to the ground.",
      "links": [],
      "text": "The first wave of antagonists to oppose the player's character is from the Invader Zim universe. All enemies must be knocked over a certain number of times to be defeated, with that number depending on what enemy is considered. After falling over twice, they will disappear from the game, and from where they had lain a barrage of balls spins across the dance floor. These balls should be collected for two reasons: one, that doing so raises the score counter by 100 points per ball, unless otherwise noted; and two, that doing so fills up the Party Meter a slight amount per ball. The Party Meter is a gauge of how many balls are necessary for collection until the player can employ his or her character's dance move. This dance move is a special attack that knocks every enemy on the floor to the ground."
    },
    {
      "body": "The game progresses in levels as more enemy waves are defeated. ${link_0} soldiers must be knocked over three times as opposed to the two required for the aliens from Invader Zim, and Mark Chang from The Fairly OddParents takes a few hits more. A full list of antagonists and their statistics includes:",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "The game progresses in levels as more enemy waves are defeated. Fire Nation soldiers must be knocked over three times as opposed to the two required for the aliens from Invader Zim, and Mark Chang from The Fairly OddParents takes a few hits more. A full list of antagonists and their statistics includes:"
    },
    {
      "body": "GIR is in the ${link_0} at the beginning of the game.",
      "links": [
        {
          "body": "Avatar State",
          "key": "${link_0}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "GIR is in the Avatar State at the beginning of the game."
    },
    {
      "body": "On the character selection screen, there are only three options displayed: GIR, Aang, and Timmy Turner. When the player hovers the mouse over GIR's character option and clicks, GIR will be chosen for play in the game just as would occur with the other two characters. However, if the player holds down the left mouse click for a moment, he or she will notice a white light begin to envelop GIR's image. If the player lets go of the mouse before the light entirely covers GIR, the game will begin as it normally would when GIR was clicked; but if the mouse is held until the light covers him, the game will begin with a twist: GIR will have a white glow about him and an arrow tattoo adorning his forehead that also shines with white light, an overt tribute to Aang's ${link_0} appearance. He will also come into play equipped with an array of new moves, including backward kicks, energy balls that act as long-range weaponry, and more. The use of this enhanced GIR is capable of making Dance Off easier and more point efficient, as defeating enemies becomes slightly less difficult with the new attacks.",
      "links": [
        {
          "body": "Avatar State",
          "key": "${link_0}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "On the character selection screen, there are only three options displayed: GIR, Aang, and Timmy Turner. When the player hovers the mouse over GIR's character option and clicks, GIR will be chosen for play in the game just as would occur with the other two characters. However, if the player holds down the left mouse click for a moment, he or she will notice a white light begin to envelop GIR's image. If the player lets go of the mouse before the light entirely covers GIR, the game will begin as it normally would when GIR was clicked; but if the mouse is held until the light covers him, the game will begin with a twist: GIR will have a white glow about him and an arrow tattoo adorning his forehead that also shines with white light, an overt tribute to Aang's Avatar State appearance. He will also come into play equipped with an array of new moves, including backward kicks, energy balls that act as long-range weaponry, and more. The use of this enhanced GIR is capable of making Dance Off easier and more point efficient, as defeating enemies becomes slightly less difficult with the new attacks."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Nicktoons:_Dance_Off,_Clash_On!",
    "file": "avatar.wikia.com/wiki/Nicktoons__Dance_Off,_Clash_On!.html",
    "page": "Nicktoons__Dance_Off,_Clash_On!",
    "title": "Nicktoons: Dance Off, Clash On!"
  }
}