{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Comics",
      "target": {
        "external": false,
        "href": "/wiki/Category_Comics",
        "page": "Category_Comics"
      }
    },
    {
      "body": "Graphic novels",
      "target": {
        "external": false,
        "href": "/wiki/Category_Graphic_novels",
        "page": "Category_Graphic_novels"
      }
    },
    {
      "body": "North and South",
      "target": {
        "external": false,
        "href": "/wiki/Category_North_and_South",
        "page": "Category_North_and_South"
      }
    },
    {
      "body": "Real world",
      "target": {
        "external": false,
        "href": "/wiki/Category_Real_world",
        "page": "Category_Real_world"
      }
    }
  ],
  "facts": [
    {
      "key": "Story by",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Gene Luen Yang",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Gene_Luen_Yang",
                "page": "Gene_Luen_Yang"
              }
            }
          ],
          "text": "Gene Luen Yang",
          "value": "${link_0}",
          "value_text": "Gene Luen Yang"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Bryan Konietzko",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Bryan_Konietzko",
                "page": "Bryan_Konietzko"
              }
            }
          ],
          "text": "Bryan Konietzko",
          "value": "${link_0}",
          "value_text": "Bryan Konietzko"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Michael Dante DiMartino",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Michael_Dante_DiMartino",
                "page": "Michael_Dante_DiMartino"
              }
            }
          ],
          "text": "Michael Dante DiMartino",
          "value": "${link_0}",
          "value_text": "Michael Dante DiMartino"
        }
      ]
    },
    {
      "key": "Art by",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Gurihiru",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Gurihiru",
                "page": "Gurihiru"
              }
            }
          ],
          "text": "Gurihiru",
          "value": "${link_0}",
          "value_text": "Gurihiru"
        }
      ]
    },
    {
      "key": "Coloring by",
      "value": [
        {
          "body": "Gurihiru",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Gurihiru",
          "value": "Gurihiru",
          "value_text": "Gurihiru"
        }
      ]
    },
    {
      "key": "Issue",
      "value": [
        {
          "body": "45",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "45",
          "value": "45",
          "value_text": "45"
        }
      ]
    },
    {
      "key": "Publisher",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Dark Horse Comics",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Dark_Horse_Comics",
                "page": "Dark_Horse_Comics"
              }
            }
          ],
          "text": "Dark Horse Comics",
          "value": "${link_0}",
          "value_text": "Dark Horse Comics"
        }
      ]
    },
    {
      "key": "Date of publication",
      "value": [
        {
          "body": "September 14, 2016",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "September 14, 2016",
          "value": "September 14, 2016",
          "value_text": "September 14, 2016"
        }
      ]
    },
    {
      "key": "Last comic",
      "value": [
        {
          "body": "\"${link_0}\" (issue order)",
          "extra": "(issue order)",
          "extra_text": "(issue order)",
          "links": [
            {
              "body": "Friends for Life",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Friends_for_Life",
                "page": "Friends_for_Life"
              }
            }
          ],
          "text": "\"Friends for Life\" (issue order)",
          "value": "\"${link_0}\"",
          "value_text": "\"Friends for Life\""
        },
        {
          "body": "${link_0} (trilogy order)",
          "extra": "(trilogy order)",
          "extra_text": "(trilogy order)",
          "links": [
            {
              "body": "Smoke and Shadow Part Three",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Smoke_and_Shadow_Part_Three",
                "page": "Smoke_and_Shadow_Part_Three"
              }
            }
          ],
          "text": "Smoke and Shadow Part Three (trilogy order)",
          "value": "${link_0}",
          "value_text": "Smoke and Shadow Part Three"
        }
      ]
    },
    {
      "key": "Next comic",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "North and South Part Two",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/North_and_South_Part_Two",
                "page": "North_and_South_Part_Two"
              }
            }
          ],
          "text": "North and South Part Two",
          "value": "${link_0}",
          "value_text": "North and South Part Two"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "North and South Part One is the first installment of the ${link_0} trilogy. It was released in comic book stores on September 14, 2016, and in mass market retailers on September 27, 2016.",
      "links": [
        {
          "body": "North and South",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/North_and_South",
            "page": "North_and_South"
          }
        }
      ],
      "section": [
        "North and South Part One"
      ],
      "text": "North and South Part One is the first installment of the North and South trilogy. It was released in comic book stores on September 14, 2016, and in mass market retailers on September 27, 2016."
    },
    {
      "body": "When Aang leaves to aid Zuko with the Kemurikage, Katara and Sokka return to the Southern Water Tribe by themselves. Katara is shocked to find that her beloved village has become a bustling city, with none other than their father, Hakoda, in charge! A Northerner named Malina seems to be behind this change, pushing the North and South to be more unified ... but what are her true goals?",
      "links": [],
      "section": [
        "North and South Part One",
        "Overview"
      ],
      "text": "When Aang leaves to aid Zuko with the Kemurikage, Katara and Sokka return to the Southern Water Tribe by themselves. Katara is shocked to find that her beloved village has become a bustling city, with none other than their father, Hakoda, in charge! A Northerner named Malina seems to be behind this change, pushing the North and South to be more unified ... but what are her true goals?"
    },
    {
      "body": "${link_0} dreams of being a small child, being woken up by her mother. ${link_1} calls her to see the ${link_2} with the sun out, after the snow has stopped. She asks Katara if it is not beautiful, and Katara agrees. Kya keeps asking her to wake up, and Katara notices Kya does not sound like herself. Katara is wakes up on a ship, ${link_3} asking her to wake up, telling her they have arrived. Katara sleepily asks Sokka if it is him, and when he asks if she is ok, Katara tells him she had a dream that was happy and sad, though mostly happy.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Kya",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        },
        {
          "body": "village",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "Katara dreams of being a small child, being woken up by her mother. Kya calls her to see the village with the sun out, after the snow has stopped. She asks Katara if it is not beautiful, and Katara agrees. Kya keeps asking her to wake up, and Katara notices Kya does not sound like herself. Katara is wakes up on a ship, Sokka asking her to wake up, telling her they have arrived. Katara sleepily asks Sokka if it is him, and when he asks if she is ok, Katara tells him she had a dream that was happy and sad, though mostly happy."
    },
    {
      "body": "The two disembark from the ship, Katara noting nothing looks familiar, and Sokka following that their map says, pointing out her past admission no one reads a map like him. Katara corrects him, pointing out she only said that once. Katara notices ${link_0} at the top of a hill. She asks Sokka if it reminds him of anything, but Sokka draws a blank. Katara explains it reminds her of the day they met ${link_1}. Sokka agrees but mistakenly remembers Katara being the one suspicious of Aang being a ${link_2} spy at the time. The two penguin sled down the hill, and Sokka hits a wooden beam.",
      "links": [
        {
          "body": "penguin sledders",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Penguin_sledding",
            "page": "Penguin_sledding"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "The two disembark from the ship, Katara noting nothing looks familiar, and Sokka following that their map says, pointing out her past admission no one reads a map like him. Katara corrects him, pointing out she only said that once. Katara notices penguin sledders at the top of a hill. She asks Sokka if it reminds him of anything, but Sokka draws a blank. Katara explains it reminds her of the day they met Aang. Sokka agrees but mistakenly remembers Katara being the one suspicious of Aang being a Fire Nation spy at the time. The two penguin sled down the hill, and Sokka hits a wooden beam."
    },
    {
      "body": "The two notice the construction project at place and wonder what it is. Sokka asks a child playing nearby what the construction is, but the child refuses to talk to him, saying his mother told him not to speak with strangers. Sokka introduces himself as a fellow southerner. The child throws a snowball at his face. Sokka catches up to the child, and members of the construction crew approach them, telling they are trespassing. One of the playing children had use the no-trespassing sign to build a snowman. Katara concedes the point, telling them she and Sokka will make sure the children leave. One of the crew members, annoyed this is the third that week children have trespassed, ${link_0} at them. Katara blocks the attack and admonishes him for attacking little children. Katara tells the children to leave, but Sokka tells them to stay, assuring them the fight will be awesome, though painful for the crew members. Two of the crew members block Katara's several snowballs, merging them into a bigger snowball, and throw it back at her. Katara takes control of it, and adds spikes to it. The construction crew members give up. One of the children is in awe of the fight, as Sokka said they would be. The construction crew members say they were only going to scare the children, not actually hurt them. Katara tells them to build a fence if they want to keep people out of the construction site. Katara tells the children that even if the crew members were jerks, they were right, and that they should not be playing there. Sokka says they will talk them home and asks where they live. The boy points at the city and is confused when Sokka asks if he is from the village.",
      "links": [
        {
          "body": "waterbends",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "The two notice the construction project at place and wonder what it is. Sokka asks a child playing nearby what the construction is, but the child refuses to talk to him, saying his mother told him not to speak with strangers. Sokka introduces himself as a fellow southerner. The child throws a snowball at his face. Sokka catches up to the child, and members of the construction crew approach them, telling they are trespassing. One of the playing children had use the no-trespassing sign to build a snowman. Katara concedes the point, telling them she and Sokka will make sure the children leave. One of the crew members, annoyed this is the third that week children have trespassed, waterbends at them. Katara blocks the attack and admonishes him for attacking little children. Katara tells the children to leave, but Sokka tells them to stay, assuring them the fight will be awesome, though painful for the crew members. Two of the crew members block Katara's several snowballs, merging them into a bigger snowball, and throw it back at her. Katara takes control of it, and adds spikes to it. The construction crew members give up. One of the children is in awe of the fight, as Sokka said they would be. The construction crew members say they were only going to scare the children, not actually hurt them. Katara tells them to build a fence if they want to keep people out of the construction site. Katara tells the children that even if the crew members were jerks, they were right, and that they should not be playing there. Sokka says they will talk them home and asks where they live. The boy points at the city and is confused when Sokka asks if he is from the village."
    },
    {
      "body": "Sokka and Katara arrive at the city, much more urbanized than when they left. Katara thinks their village is gone, Sokka is excited that it is better and spots Auntie ${link_0}. The three greet each other, and Katara asks how is business. Ashuna says it has been steady, and when Katara asks why she has a cart instead of her hut, Ashuna explains it got torn down, and that she lives in a building now. She offers them her ${link_1}, noting they have not had it in years, and Sokka mentions it is as sturdy as he remembers. Ashuna calls out to the crowd, telling them of Sokka and Katara's arrival. The crowd welcomes them, asking questions about their adventures. ${link_2} wonders what the commotion is about and reunites with her grandchildren, having missed them dearly. Katara tells Kanna she has not changed a bit, and Kanna points out Sokka got taller. Sokka claims to have gotten muscular, but an approaching ${link_3} doubts him. Pakku also notes he is their grandfather now, having married Kanna three weeks prior, much to Sokka's shock. Katara is disappointed they have missed the ceremony, musing they should have returned sooner. Pakku and Kanna explain there was no ceremony, having eloped to the ${link_4}. Pakku notes it did not live up to its name, and Kanna points out that was not important, as they had a wonderful time. Pakku asks Katara to visit his waterbending school, as he could use her help. Katara wonders where he got students, Pakku only telling her it is interesting, reiterating her to drop by. Sokka offers his help as well. Pakku points out Sokka is not a bender, but Sokka says he is a bender of motivation. Kanna tells them how ${link_5} told them how accomplished they have become. Pakku notes Hakoda does that too often. Sokka asks where their father is, and Pakku tells him Hakoda is in his office in the town hall, much to Sokka's astonishment. Kanna tells them Hakoda is not just a local ${link_6} anymore, and that he has been elected head chieftain of the entire Southern Water Tribe.",
      "links": [
        {
          "body": "Ashuna",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ashuna",
            "page": "Ashuna"
          }
        },
        {
          "body": "seal jerky",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Cuisine_in_the_World_of_Avatar",
            "page": "Cuisine_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Kanna",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Kanna",
            "page": "Kanna"
          }
        },
        {
          "body": "Pakku",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "Misty Palms Oasis",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Misty_Palms_Oasis",
            "page": "Misty_Palms_Oasis"
          }
        },
        {
          "body": "Hakoda",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "chieftain",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_chief",
            "page": "Tribal_chief"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "Sokka and Katara arrive at the city, much more urbanized than when they left. Katara thinks their village is gone, Sokka is excited that it is better and spots Auntie Ashuna. The three greet each other, and Katara asks how is business. Ashuna says it has been steady, and when Katara asks why she has a cart instead of her hut, Ashuna explains it got torn down, and that she lives in a building now. She offers them her seal jerky, noting they have not had it in years, and Sokka mentions it is as sturdy as he remembers. Ashuna calls out to the crowd, telling them of Sokka and Katara's arrival. The crowd welcomes them, asking questions about their adventures. Kanna wonders what the commotion is about and reunites with her grandchildren, having missed them dearly. Katara tells Kanna she has not changed a bit, and Kanna points out Sokka got taller. Sokka claims to have gotten muscular, but an approaching Pakku doubts him. Pakku also notes he is their grandfather now, having married Kanna three weeks prior, much to Sokka's shock. Katara is disappointed they have missed the ceremony, musing they should have returned sooner. Pakku and Kanna explain there was no ceremony, having eloped to the Misty Palms Oasis. Pakku notes it did not live up to its name, and Kanna points out that was not important, as they had a wonderful time. Pakku asks Katara to visit his waterbending school, as he could use her help. Katara wonders where he got students, Pakku only telling her it is interesting, reiterating her to drop by. Sokka offers his help as well. Pakku points out Sokka is not a bender, but Sokka says he is a bender of motivation. Kanna tells them how Hakoda told them how accomplished they have become. Pakku notes Hakoda does that too often. Sokka asks where their father is, and Pakku tells him Hakoda is in his office in the town hall, much to Sokka's astonishment. Kanna tells them Hakoda is not just a local chieftain anymore, and that he has been elected head chieftain of the entire Southern Water Tribe."
    },
    {
      "body": "Katara and Sokka arrive at the town hall, Sokka impressed by it, while Katara finds it very unlike their father. The two knock on Hakoda's door, who answers he will be done in a second, not looking at the door. Katara announces herself, and Hakoda goes to hug his children. Sokka asks what they are building, and Hakoda explains it is a new office, as the building they are in is a temporary situation, as it is meant for local government. Katara is relieved to hear this, not seeing her father as a fancy guy. Hakoda agrees with Katara, but before he can continue, he is interrupted by a woman in the office, who excitedly explains the new building will be the most magnificent in the south's history, fit for a head of state, much to Katara's unease. She shows them the blueprints for a ${link_0}, astonishing Katara and impressing Sokka. Katara questions Hakoda, who explains that while he never would have thought to build it, the palace being ${link_1}'s idea, he has come to embrace it. Malina believes that a palace will command respect from the other nations, showing them they are a people to be reckoned with, something she believes the south needs more than ever. Katara questions her statement. Hakoda further explains Malina's point that the Southern Water Tribe will take a more active role in collaborating with other nations, and it needs to do so as an equal partner. Sokka suggests adding a slide in the middle of the palace, which Malina believes to be a joke, Sokka being serious about it. Changing her mind, Malina invites Sokka to be a consultant on the construction, much to his excitement. Katara tells Sokka he does not want to be a consultant, Sokka points out that being a consultant just involves telling people what to do, and Katara concedes the point. Katara apologizes to Hakoda for taking them so long to return home, though Hakoda understands they were helping the Avatar rebuild. Someone points out that rebuilding takes time.",
      "links": [
        {
          "body": "palace",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_Royal_Palace",
            "page": "Southern_Water_Tribe_Royal_Palace"
          }
        },
        {
          "body": "Malina",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Malina",
            "page": "Malina"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "Katara and Sokka arrive at the town hall, Sokka impressed by it, while Katara finds it very unlike their father. The two knock on Hakoda's door, who answers he will be done in a second, not looking at the door. Katara announces herself, and Hakoda goes to hug his children. Sokka asks what they are building, and Hakoda explains it is a new office, as the building they are in is a temporary situation, as it is meant for local government. Katara is relieved to hear this, not seeing her father as a fancy guy. Hakoda agrees with Katara, but before he can continue, he is interrupted by a woman in the office, who excitedly explains the new building will be the most magnificent in the south's history, fit for a head of state, much to Katara's unease. She shows them the blueprints for a palace, astonishing Katara and impressing Sokka. Katara questions Hakoda, who explains that while he never would have thought to build it, the palace being Malina's idea, he has come to embrace it. Malina believes that a palace will command respect from the other nations, showing them they are a people to be reckoned with, something she believes the south needs more than ever. Katara questions her statement. Hakoda further explains Malina's point that the Southern Water Tribe will take a more active role in collaborating with other nations, and it needs to do so as an equal partner. Sokka suggests adding a slide in the middle of the palace, which Malina believes to be a joke, Sokka being serious about it. Changing her mind, Malina invites Sokka to be a consultant on the construction, much to his excitement. Katara tells Sokka he does not want to be a consultant, Sokka points out that being a consultant just involves telling people what to do, and Katara concedes the point. Katara apologizes to Hakoda for taking them so long to return home, though Hakoda understands they were helping the Avatar rebuild. Someone points out that rebuilding takes time."
    },
    {
      "body": "Hakoda properly introduces Malina and ${link_0}, from the ${link_1}, their construction crew aiding the ${link_2}. Malina explains that though they are northerners, they spent most of their lives in the Earth Kingdom. Sokka and Katara welcome them to the south, and Maliq tells them they have kept up with news about them ever since learning they saved ${link_3} and ${link_4}. Malina can hardly believe they are meeting celebrities. Sokka denies being celebrities, just heroes.",
      "links": [
        {
          "body": "Maliq",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Maliq",
            "page": "Maliq"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Southern Reconstruction Project",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Reconstruction_Project",
            "page": "Southern_Reconstruction_Project"
          }
        },
        {
          "body": "Tui",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Tui",
            "page": "Tui"
          }
        },
        {
          "body": "La",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/La",
            "page": "La"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "Hakoda properly introduces Malina and Maliq, from the Northern Water Tribe, their construction crew aiding the Southern Reconstruction Project. Malina explains that though they are northerners, they spent most of their lives in the Earth Kingdom. Sokka and Katara welcome them to the south, and Maliq tells them they have kept up with news about them ever since learning they saved Tui and La. Malina can hardly believe they are meeting celebrities. Sokka denies being celebrities, just heroes."
    },
    {
      "body": "Three men arrive, asking Malina if she is done with a plan. They are the men Katara fought with earlier that day, and the two groups recognize each other. Hakoda introduces them ${link_0} and ${link_1}, waterbenders, and ${link_2}, an earthbender, as the finest in the ${link_3}. Sokka is skeptical of their reputation and begins telling how Katara defeated them. Before he can continue, Noa points out they specialize in construction bending, not combat, that they are artists, not fighters. Sokka adds they are the burliest artists he has ever seen. Malina takes it they have met, which Katara and Noa confirm, Noa adding they resolved some issues they had earlier. Katara adds they have thoughtfully decided to build a fence, something she thinks they should have done from the beginning. Maliq tells them he wanted them to do that from the beginning, per regulations. Malina tells them they are done for the day, and that she will hand them blueprints first thing in the morning. Maliq and Malina offer to take them for dinner to celebrate. Katara begins to politely turn down the invitation, since they are tired, but Sokka readily accepts it. Maliq goes to grab his briefcase, preferring to keep it on his person, despite Malina thinking it is fine to leave in the office.",
      "links": [
        {
          "body": "Noa",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Noa",
            "page": "Noa"
          }
        },
        {
          "body": "Kam",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kam",
            "page": "Kam"
          }
        },
        {
          "body": "Soonjei",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Soonjei",
            "page": "Soonjei"
          }
        },
        {
          "body": "world",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "Three men arrive, asking Malina if she is done with a plan. They are the men Katara fought with earlier that day, and the two groups recognize each other. Hakoda introduces them Noa and Kam, waterbenders, and Soonjei, an earthbender, as the finest in the world. Sokka is skeptical of their reputation and begins telling how Katara defeated them. Before he can continue, Noa points out they specialize in construction bending, not combat, that they are artists, not fighters. Sokka adds they are the burliest artists he has ever seen. Malina takes it they have met, which Katara and Noa confirm, Noa adding they resolved some issues they had earlier. Katara adds they have thoughtfully decided to build a fence, something she thinks they should have done from the beginning. Maliq tells them he wanted them to do that from the beginning, per regulations. Malina tells them they are done for the day, and that she will hand them blueprints first thing in the morning. Maliq and Malina offer to take them for dinner to celebrate. Katara begins to politely turn down the invitation, since they are tired, but Sokka readily accepts it. Maliq goes to grab his briefcase, preferring to keep it on his person, despite Malina thinking it is fine to leave in the office."
    },
    {
      "body": "While eating dinner at the Two Fishes Northern Cuisine, Malina points out how she was having a hard time with Southern cooking, due to the fact that Southern food is so close to Northern food that it simply tastes \"off\" to her, consequentially offending Katara. Sokka remarks that the presence of meat in the dish is the determining factor for him to enjoy food. As the conversation continues, a boy and a girl arrive at the restaurant. They sneak up on the group and while the boy apologizes for spilling soup all over the table, being forgiven by Malina, the girl steals Maliq's briefcase. The girl starts running in the direction of the exit, only to be stopped by Malina's waterbending. The boy hurls the empty soup bowl at Malina, rendering her unconscious and allowing the two youngsters to escape with the briefcase. Katara asks Hakoda to make sure Malina is all right while she and Sokka pursue the thieves.",
      "links": [],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "While eating dinner at the Two Fishes Northern Cuisine, Malina points out how she was having a hard time with Southern cooking, due to the fact that Southern food is so close to Northern food that it simply tastes \"off\" to her, consequentially offending Katara. Sokka remarks that the presence of meat in the dish is the determining factor for him to enjoy food. As the conversation continues, a boy and a girl arrive at the restaurant. They sneak up on the group and while the boy apologizes for spilling soup all over the table, being forgiven by Malina, the girl steals Maliq's briefcase. The girl starts running in the direction of the exit, only to be stopped by Malina's waterbending. The boy hurls the empty soup bowl at Malina, rendering her unconscious and allowing the two youngsters to escape with the briefcase. Katara asks Hakoda to make sure Malina is all right while she and Sokka pursue the thieves."
    },
    {
      "body": "Running outside, they find the boy and girl have commandeered a snowmobile; as the girl starts the engine, the boy yells at her to hurry, and Sokka gives chase on foot. He is able to grab the boy's arm, but the boy swings the briefcase at him, hitting him in the head and throwing him off. Katara and Sokka chase them to the outskirts of the city, but they fail to catch them. Unwilling to let the fugitives escape so easily, Katara waterbends a sled out of ice. With Sokka sitting in the front and her standing in the back, she uses waterbending to propel them forward, and in moments, they have caught up with the snowmobile. The fugitives attempt to use the terrain to lose their pursuers, even driving off a cliff at one point, but when the fall shatters Katara's sled, she simply makes a new one and continues the chase. Eventually, the fugitives brake hard and veer away, vanishing into the trees. Following the trail of the snowmobile, Katara and Sokka find it abandoned in the snow a short distance away. Climbing a short hill, which Katara makes easier by bending steps into its slope, the two find that the boy and girl's footprints lead into the abandoned ${link_0} of a Fire Nation ship.",
      "links": [
        {
          "body": "shipwreck",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Shipwreck",
            "page": "Shipwreck"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "Running outside, they find the boy and girl have commandeered a snowmobile; as the girl starts the engine, the boy yells at her to hurry, and Sokka gives chase on foot. He is able to grab the boy's arm, but the boy swings the briefcase at him, hitting him in the head and throwing him off. Katara and Sokka chase them to the outskirts of the city, but they fail to catch them. Unwilling to let the fugitives escape so easily, Katara waterbends a sled out of ice. With Sokka sitting in the front and her standing in the back, she uses waterbending to propel them forward, and in moments, they have caught up with the snowmobile. The fugitives attempt to use the terrain to lose their pursuers, even driving off a cliff at one point, but when the fall shatters Katara's sled, she simply makes a new one and continues the chase. Eventually, the fugitives brake hard and veer away, vanishing into the trees. Following the trail of the snowmobile, Katara and Sokka find it abandoned in the snow a short distance away. Climbing a short hill, which Katara makes easier by bending steps into its slope, the two find that the boy and girl's footprints lead into the abandoned shipwreck of a Fire Nation ship."
    },
    {
      "body": "Mere moments after warning Katara about the ship's booby traps, Sokka accidentally triggers a tripwire; the floor opens beneath him, and he falls out of sight into the hole, yelling and grunting all the way to the bottom. When he yells up nervously that he is not alone at the bottom of the hole, Katara follows him down and, reaching Sokka, finds herself face-to-face with a man named ${link_0}. He calls them by name and tells them he fought in the ${link_1} with Hakoda. Katara and Sokka inform him of the two children they chased, as well as the stolen briefcase, and ask that he return the briefcase and turn the fugitives over to them, but he does not, asking them to follow him instead.",
      "links": [
        {
          "body": "Gilak",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Gilak",
            "page": "Gilak"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "Mere moments after warning Katara about the ship's booby traps, Sokka accidentally triggers a tripwire; the floor opens beneath him, and he falls out of sight into the hole, yelling and grunting all the way to the bottom. When he yells up nervously that he is not alone at the bottom of the hole, Katara follows him down and, reaching Sokka, finds herself face-to-face with a man named Gilak. He calls them by name and tells them he fought in the Hundred Year War with Hakoda. Katara and Sokka inform him of the two children they chased, as well as the stolen briefcase, and ask that he return the briefcase and turn the fugitives over to them, but he does not, asking them to follow him instead."
    },
    {
      "body": "He leads them into a large cavern chamber, where a large number of people sit listening to an elderly man named ${link_0}, whom Gilak identifies as his second-in-command. Gilak explains to Katara and Sokka the reason for his and his peoples' seclusion: they believe that their egalitarian way of life has made them weak compared to the other nations of the world and that Hakoda, by refusing to behave as the world's other rulers do, has made the South vulnerable to outsiders who wish to meddle in their affairs. He cites the Northern Water Tribe as a key example of this, claiming that, during the war, they hid from the battle in their sheltered capital, refusing to fight and behaving as \"cowards\". Because of this, Gilak claims the only way to save the South is to forcibly remove the outsiders from the tribe. Knowing it is an action that will start a war, he led those who shared his views to the wreck, where they have been preparing for the coming battle. He bristles with fury when Sokka mentions Malina and Maliq to him and accuses them of being the hands of the North, attempting to infiltrate their society and weaken them. He also infers that he believes their treachery goes far deeper than that, which, as Sokka realizes, has led him to steal Maliq's briefcase in order to search for evidence.",
      "links": [
        {
          "body": "Thod",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Thod",
            "page": "Thod"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "He leads them into a large cavern chamber, where a large number of people sit listening to an elderly man named Thod, whom Gilak identifies as his second-in-command. Gilak explains to Katara and Sokka the reason for his and his peoples' seclusion: they believe that their egalitarian way of life has made them weak compared to the other nations of the world and that Hakoda, by refusing to behave as the world's other rulers do, has made the South vulnerable to outsiders who wish to meddle in their affairs. He cites the Northern Water Tribe as a key example of this, claiming that, during the war, they hid from the battle in their sheltered capital, refusing to fight and behaving as \"cowards\". Because of this, Gilak claims the only way to save the South is to forcibly remove the outsiders from the tribe. Knowing it is an action that will start a war, he led those who shared his views to the wreck, where they have been preparing for the coming battle. He bristles with fury when Sokka mentions Malina and Maliq to him and accuses them of being the hands of the North, attempting to infiltrate their society and weaken them. He also infers that he believes their treachery goes far deeper than that, which, as Sokka realizes, has led him to steal Maliq's briefcase in order to search for evidence."
    },
    {
      "body": "When Sokka and Katara refuse to join his forces, Gilak attempts to hold Sokka hostage as collateral, but the siblings attack him simultaneously and attempt to escape, prompting Gilak to order his forces to attack them. A battle ensues, with Katara and Sokka both trying to find the way they entered the caverns. They eventually pick a random tunnel and head down the passage, where Katara seals it off behind them with waterbending. They unexpectedly find themselves confronted by Thod, who stands in the narrow passage, blocking their escape. As the soldiers behind them begin breaking down the wall of ice, Thod stalls by telling them a metaphorical story about a snow rat.",
      "links": [],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "When Sokka and Katara refuse to join his forces, Gilak attempts to hold Sokka hostage as collateral, but the siblings attack him simultaneously and attempt to escape, prompting Gilak to order his forces to attack them. A battle ensues, with Katara and Sokka both trying to find the way they entered the caverns. They eventually pick a random tunnel and head down the passage, where Katara seals it off behind them with waterbending. They unexpectedly find themselves confronted by Thod, who stands in the narrow passage, blocking their escape. As the soldiers behind them begin breaking down the wall of ice, Thod stalls by telling them a metaphorical story about a snow rat."
    },
    {
      "body": "The rat, he says, learned to walk and talk as humans do, leading the humans, who were entertained by his antics, to give him a place at their campfire. Soon, forgetting that he was a rat, he asked for more luxuries from the humans. The humans, however, who had not forgotten what he really was, were offended by this, and they forced him into solitude again, never again to be counted as one of them.",
      "links": [],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "The rat, he says, learned to walk and talk as humans do, leading the humans, who were entertained by his antics, to give him a place at their campfire. Soon, forgetting that he was a rat, he asked for more luxuries from the humans. The humans, however, who had not forgotten what he really was, were offended by this, and they forced him into solitude again, never again to be counted as one of them."
    },
    {
      "body": "Katara and Sokka, having been unnerved by the tale, sweep him aside as the soldiers break through the ice behind them. Reaching the chimney through which they fell, Katara waterbends them upward, and they run from the wreck on foot, stopping a short distance away and looking back to see two of Gilak's men pursuing them on ${link_0}. Katara waterbends another ice sled, but even with their quickened pace, the animals are right behind them. Sokka pulls out a few pieces of Ashuna's seal jerky and throws it away from them; the animals immediately veer off course in pursuit of the snacks, allowing them to finally lose Gilak's men and escape.",
      "links": [
        {
          "body": "snow leopard caribou",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Snow_leopard_caribou",
            "page": "Snow_leopard_caribou"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "Katara and Sokka, having been unnerved by the tale, sweep him aside as the soldiers break through the ice behind them. Reaching the chimney through which they fell, Katara waterbends them upward, and they run from the wreck on foot, stopping a short distance away and looking back to see two of Gilak's men pursuing them on snow leopard caribou. Katara waterbends another ice sled, but even with their quickened pace, the animals are right behind them. Sokka pulls out a few pieces of Ashuna's seal jerky and throws it away from them; the animals immediately veer off course in pursuit of the snacks, allowing them to finally lose Gilak's men and escape."
    },
    {
      "body": "Returning to the town, Katara and Sokka head toward Kanna's hut, where Maliq is standing watch at the door. Sokka, despite knowing that Maliq will be upset to learn they failed to recover his briefcase, is relieved not to be captured or worse and tells Katara that Gilak's \"army of crazies\" needs to be captured and imprisoned. Katara, with much trepidation, counters that, while Gilak and his forces may be full-blown radicals, their argument has a touch of merit to it: The South is more like the North than it has ever been, retaining almost none of its former, small buildings in favor of much taller, more modern structures. When Sokka labels that as \"progress\", Katara has a brief flashback to their time at the Earthen Fire Refinery, an incident sparked by a conflict between the new and the old. She does not share her thoughts, however, and they walk the rest of the way to Kanna's hut, both of them wishing ${link_0} was with them.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "Returning to the town, Katara and Sokka head toward Kanna's hut, where Maliq is standing watch at the door. Sokka, despite knowing that Maliq will be upset to learn they failed to recover his briefcase, is relieved not to be captured or worse and tells Katara that Gilak's \"army of crazies\" needs to be captured and imprisoned. Katara, with much trepidation, counters that, while Gilak and his forces may be full-blown radicals, their argument has a touch of merit to it: The South is more like the North than it has ever been, retaining almost none of its former, small buildings in favor of much taller, more modern structures. When Sokka labels that as \"progress\", Katara has a brief flashback to their time at the Earthen Fire Refinery, an incident sparked by a conflict between the new and the old. She does not share her thoughts, however, and they walk the rest of the way to Kanna's hut, both of them wishing Aang was with them."
    },
    {
      "body": "Maliq, overjoyed to see them again, tells them Malina is awake and immediately asks about his briefcase. He is infuriated to learn of its loss and, against Sokka's assurances that they will find his briefcase, goes on a short tirade about the lack of law enforcement in the South compared with that of the North. He expresses doubt that Gilak and his forces will ever be punished for their actions and stresses the importance of what he and Malina are doing for the South. Katara asks him what they are really doing, leading Sokka to interject that Katara is being disrespectful to Maliq and Malina, saying, \"He and his wife are building our future, Katara!\" Maliq is deeply embarrassed by the assumed relation and quickly clarifies that Malina is his sister. Sokka takes his words back, saying he thought \"the most important person in the world\" would be their wife or husband. While Maliq is curious as to why he thought that, Sokka's newest inference draws umbrage from Katara, who seems mildly offended that she is not the most important person to Sokka.",
      "links": [],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "Maliq, overjoyed to see them again, tells them Malina is awake and immediately asks about his briefcase. He is infuriated to learn of its loss and, against Sokka's assurances that they will find his briefcase, goes on a short tirade about the lack of law enforcement in the South compared with that of the North. He expresses doubt that Gilak and his forces will ever be punished for their actions and stresses the importance of what he and Malina are doing for the South. Katara asks him what they are really doing, leading Sokka to interject that Katara is being disrespectful to Maliq and Malina, saying, \"He and his wife are building our future, Katara!\" Maliq is deeply embarrassed by the assumed relation and quickly clarifies that Malina is his sister. Sokka takes his words back, saying he thought \"the most important person in the world\" would be their wife or husband. While Maliq is curious as to why he thought that, Sokka's newest inference draws umbrage from Katara, who seems mildly offended that she is not the most important person to Sokka."
    },
    {
      "body": "Leaving the teetering conversation where it lies, Sokka changes the subject without answering the question and asks where Hakoda is, to which Maliq replies that he is in the hut with Malina. Sokka enthusiastically enters the hut without knocking, and Katara begins to scold him for his lack of manners. They both stop cold in their tracks, however, upon finding Hakoda and Malina locked in a kiss.",
      "links": [],
      "section": [
        "North and South Part One",
        "Synopsis"
      ],
      "text": "Leaving the teetering conversation where it lies, Sokka changes the subject without answering the question and asks where Hakoda is, to which Maliq replies that he is in the hut with Malina. Sokka enthusiastically enters the hut without knocking, and Katara begins to scold him for his lack of manners. They both stop cold in their tracks, however, upon finding Hakoda and Malina locked in a kiss."
    },
    {
      "body": "The North and South Library Edition compiles all three parts of the North and South trilogy as well as interjects trivia- and production-based notes in the sidebar of many pages. These notes were written by Gene Yang and the Gurihiru team. The following are notable points from the Library Edition that pertain to North and South Part One's early production phase and trivialities as attested by the aforementioned crew members.",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "The North and South Library Edition compiles all three parts of the North and South trilogy as well as interjects trivia- and production-based notes in the sidebar of many pages. These notes were written by Gene Yang and the Gurihiru team. The following are notable points from the Library Edition that pertain to North and South Part One's early production phase and trivialities as attested by the aforementioned crew members."
    },
    {
      "body": "Gene Yang (author-perspective, storytelling trivia):\n Yang wanted the fifth volume he wrote to focus on Katara and Sokka, given that it was \"time to give the two siblings from the South Pole their due\" (p. 11).\n The choice to include an earthbender in the Southern Reconstruction Project's construction crew was Yang's way to show the beginnings of partnerships between different nations that feature prominently in The Legend of Korra (p. 16).\n This trilogy thematically explores the positive and negative aspects of modernization. Since modernization in the real world often equates to the proliferation of Western ideals, Yang wanted to hint at those same dynamics, despite there being no real equivalent to the West in the Avatar World (p. 22).\n Malina's character was written as \"more gruff\" in the trilogy's initial drafts, but was rewritten by Yang to walk the line \"between likeable and unlikeable\", per DiMartino's notes (p. 34).\n Yang used the shipwreck from \"The Boy in the Iceberg\" to serve as the entrance to Gilak's hideout given that it represented colonialism, which is the very idea which he was fighting against (p. 55).\n In the trilogy's initial draft, Gilak's army resembled more of a religious cult, which focused more on bringing about a Water Tribe Avatar as soon as possible given their belief that this would be the only way to ensure the South's cultural survival. During the revision process, the religious aspect was dropped in favor of a political element, which Yang found more appropriate given Hakoda's role (p. 60).\n Thod's parable initially featured a wolf but was rewritten to feature a snow rat, given that the former is held sacred in Water Tribe culture (p. 67).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "Gene Yang (author-perspective, storytelling trivia):\n Yang wanted the fifth volume he wrote to focus on Katara and Sokka, given that it was \"time to give the two siblings from the South Pole their due\" (p. 11).\n The choice to include an earthbender in the Southern Reconstruction Project's construction crew was Yang's way to show the beginnings of partnerships between different nations that feature prominently in The Legend of Korra (p. 16).\n This trilogy thematically explores the positive and negative aspects of modernization. Since modernization in the real world often equates to the proliferation of Western ideals, Yang wanted to hint at those same dynamics, despite there being no real equivalent to the West in the Avatar World (p. 22).\n Malina's character was written as \"more gruff\" in the trilogy's initial drafts, but was rewritten by Yang to walk the line \"between likeable and unlikeable\", per DiMartino's notes (p. 34).\n Yang used the shipwreck from \"The Boy in the Iceberg\" to serve as the entrance to Gilak's hideout given that it represented colonialism, which is the very idea which he was fighting against (p. 55).\n In the trilogy's initial draft, Gilak's army resembled more of a religious cult, which focused more on bringing about a Water Tribe Avatar as soon as possible given their belief that this would be the only way to ensure the South's cultural survival. During the revision process, the religious aspect was dropped in favor of a political element, which Yang found more appropriate given Hakoda's role (p. 60).\n Thod's parable initially featured a wolf but was rewritten to feature a snow rat, given that the former is held sacred in Water Tribe culture (p. 67)."
    },
    {
      "body": "Yang wanted the fifth volume he wrote to focus on Katara and Sokka, given that it was \"time to give the two siblings from the South Pole their due\" (p. 11).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "Yang wanted the fifth volume he wrote to focus on Katara and Sokka, given that it was \"time to give the two siblings from the South Pole their due\" (p. 11)."
    },
    {
      "body": "The choice to include an earthbender in the Southern Reconstruction Project's construction crew was Yang's way to show the beginnings of partnerships between different nations that feature prominently in The Legend of Korra (p. 16).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "The choice to include an earthbender in the Southern Reconstruction Project's construction crew was Yang's way to show the beginnings of partnerships between different nations that feature prominently in The Legend of Korra (p. 16)."
    },
    {
      "body": "This trilogy thematically explores the positive and negative aspects of modernization. Since modernization in the real world often equates to the proliferation of Western ideals, Yang wanted to hint at those same dynamics, despite there being no real equivalent to the West in the Avatar World (p. 22).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "This trilogy thematically explores the positive and negative aspects of modernization. Since modernization in the real world often equates to the proliferation of Western ideals, Yang wanted to hint at those same dynamics, despite there being no real equivalent to the West in the Avatar World (p. 22)."
    },
    {
      "body": "Malina's character was written as \"more gruff\" in the trilogy's initial drafts, but was rewritten by Yang to walk the line \"between likeable and unlikeable\", per DiMartino's notes (p. 34).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "Malina's character was written as \"more gruff\" in the trilogy's initial drafts, but was rewritten by Yang to walk the line \"between likeable and unlikeable\", per DiMartino's notes (p. 34)."
    },
    {
      "body": "Yang used the shipwreck from \"The Boy in the Iceberg\" to serve as the entrance to Gilak's hideout given that it represented colonialism, which is the very idea which he was fighting against (p. 55).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "Yang used the shipwreck from \"The Boy in the Iceberg\" to serve as the entrance to Gilak's hideout given that it represented colonialism, which is the very idea which he was fighting against (p. 55)."
    },
    {
      "body": "In the trilogy's initial draft, Gilak's army resembled more of a religious cult, which focused more on bringing about a Water Tribe Avatar as soon as possible given their belief that this would be the only way to ensure the South's cultural survival. During the revision process, the religious aspect was dropped in favor of a political element, which Yang found more appropriate given Hakoda's role (p. 60).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "In the trilogy's initial draft, Gilak's army resembled more of a religious cult, which focused more on bringing about a Water Tribe Avatar as soon as possible given their belief that this would be the only way to ensure the South's cultural survival. During the revision process, the religious aspect was dropped in favor of a political element, which Yang found more appropriate given Hakoda's role (p. 60)."
    },
    {
      "body": "Thod's parable initially featured a wolf but was rewritten to feature a snow rat, given that the former is held sacred in Water Tribe culture (p. 67).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "Thod's parable initially featured a wolf but was rewritten to feature a snow rat, given that the former is held sacred in Water Tribe culture (p. 67)."
    },
    {
      "body": "Gurihiru (stylistic and artistic trivia):\n The Gurihiru team chose to portray Katara with the traditional ${link_0} attributed to Water Tribe citizens for this trilogy (p. 11).\n To demonstrate the modernization of the Southern Water Tribe, the Gurihiru team made the original village visibly larger in size and also incorporated technology from both the Northern Water Tribe and the Earth Kingdom (p. 22).\n To differentiate between the two polar Water Tribes, the Gurihiru team depicted Northern tribesmen with more simplistic and urban costumes, and Southern tribesmen with more traditional costumes lined with more furs (p. 30).\n Malina's short hairstyle was meant to make her appear more stylish and stand out against the rest of the Southern Water Tribe. The Gurihiru team designed her this way per Yang's request (p. 34).\n The Gurihiru team created a Southern Water Tribe menu centered on meat dishes, based heavily on Inuit dishes and other cuisine from cold regions (p. 38).\n Given that several pages depict a continuous chase through the snow, the Gurihiru team used creative panel layouts to maintain interest (p. 49).\n Thod's men were initially meant to mount ${link_1} like ${link_2}, but the Gurihiru team decided to create snow leopard caribou instead (p. 70).",
      "links": [
        {
          "body": "hair loopies",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hair_loopies",
            "page": "Hair_loopies"
          }
        },
        {
          "body": "polar bear dogs",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Polar_bear_dog",
            "page": "Polar_bear_dog"
          }
        },
        {
          "body": "Naga",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Naga",
            "page": "Naga"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "Gurihiru (stylistic and artistic trivia):\n The Gurihiru team chose to portray Katara with the traditional hair loopies attributed to Water Tribe citizens for this trilogy (p. 11).\n To demonstrate the modernization of the Southern Water Tribe, the Gurihiru team made the original village visibly larger in size and also incorporated technology from both the Northern Water Tribe and the Earth Kingdom (p. 22).\n To differentiate between the two polar Water Tribes, the Gurihiru team depicted Northern tribesmen with more simplistic and urban costumes, and Southern tribesmen with more traditional costumes lined with more furs (p. 30).\n Malina's short hairstyle was meant to make her appear more stylish and stand out against the rest of the Southern Water Tribe. The Gurihiru team designed her this way per Yang's request (p. 34).\n The Gurihiru team created a Southern Water Tribe menu centered on meat dishes, based heavily on Inuit dishes and other cuisine from cold regions (p. 38).\n Given that several pages depict a continuous chase through the snow, the Gurihiru team used creative panel layouts to maintain interest (p. 49).\n Thod's men were initially meant to mount polar bear dogs like Naga, but the Gurihiru team decided to create snow leopard caribou instead (p. 70)."
    },
    {
      "body": "The Gurihiru team chose to portray Katara with the traditional ${link_0} attributed to Water Tribe citizens for this trilogy (p. 11).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "The Gurihiru team chose to portray Katara with the traditional ${link_0} attributed to Water Tribe citizens for this trilogy (p. 11)."
    },
    {
      "body": "To demonstrate the modernization of the Southern Water Tribe, the Gurihiru team made the original village visibly larger in size and also incorporated technology from both the Northern Water Tribe and the Earth Kingdom (p. 22).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "To demonstrate the modernization of the Southern Water Tribe, the Gurihiru team made the original village visibly larger in size and also incorporated technology from both the Northern Water Tribe and the Earth Kingdom (p. 22)."
    },
    {
      "body": "To differentiate between the two polar Water Tribes, the Gurihiru team depicted Northern tribesmen with more simplistic and urban costumes, and Southern tribesmen with more traditional costumes lined with more furs (p. 30).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "To differentiate between the two polar Water Tribes, the Gurihiru team depicted Northern tribesmen with more simplistic and urban costumes, and Southern tribesmen with more traditional costumes lined with more furs (p. 30)."
    },
    {
      "body": "Malina's short hairstyle was meant to make her appear more stylish and stand out against the rest of the Southern Water Tribe. The Gurihiru team designed her this way per Yang's request (p. 34).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "Malina's short hairstyle was meant to make her appear more stylish and stand out against the rest of the Southern Water Tribe. The Gurihiru team designed her this way per Yang's request (p. 34)."
    },
    {
      "body": "The Gurihiru team created a Southern Water Tribe menu centered on meat dishes, based heavily on Inuit dishes and other cuisine from cold regions (p. 38).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "The Gurihiru team created a Southern Water Tribe menu centered on meat dishes, based heavily on Inuit dishes and other cuisine from cold regions (p. 38)."
    },
    {
      "body": "Given that several pages depict a continuous chase through the snow, the Gurihiru team used creative panel layouts to maintain interest (p. 49).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "Given that several pages depict a continuous chase through the snow, the Gurihiru team used creative panel layouts to maintain interest (p. 49)."
    },
    {
      "body": "Thod's men were initially meant to mount ${link_1} like ${link_2}, but the Gurihiru team decided to create snow leopard caribou instead (p. 70).",
      "links": [],
      "section": [
        "North and South Part One",
        "Trivia",
        "Library Edition reveals"
      ],
      "text": "Thod's men were initially meant to mount ${link_1} like ${link_2}, but the Gurihiru team decided to create snow leopard caribou instead (p. 70)."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "List of Avatar comics",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/List_of_Avatar__The_Last_Airbender_comics",
            "page": "List_of_Avatar__The_Last_Airbender_comics"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "See also"
      ],
      "text": "List of Avatar comics"
    },
    {
      "body": "${link_0} trilogy",
      "links": [
        {
          "body": "North and South",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/North_and_South",
            "page": "North_and_South"
          }
        }
      ],
      "section": [
        "North and South Part One",
        "See also"
      ],
      "text": "North and South trilogy"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/North_and_South_Part_One",
    "file": "avatar.wikia.com/wiki/North_and_South_Part_One.html",
    "page": "North_and_South_Part_One",
    "title": "North and South Part One"
  }
}