{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Characters",
      "target": {
        "external": false,
        "href": "/wiki/Category_Characters",
        "page": "Category_Characters"
      }
    },
    {
      "body": "Graphic novel characters",
      "target": {
        "external": false,
        "href": "/wiki/Category_Graphic_novel_characters",
        "page": "Category_Graphic_novel_characters"
      }
    },
    {
      "body": "Minor graphic novel characters",
      "target": {
        "external": false,
        "href": "/wiki/Category_Minor_graphic_novel_characters",
        "page": "Category_Minor_graphic_novel_characters"
      }
    },
    {
      "body": "Spirit World",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirit_World",
        "page": "Category_Spirit_World"
      }
    },
    {
      "body": "Spirits",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirits",
        "page": "Category_Spirits"
      }
    },
    {
      "body": "The Rift characters",
      "target": {
        "external": false,
        "href": "/wiki/Category_The_Rift_characters",
        "page": "Category_The_Rift_characters"
      }
    }
  ],
  "facts": [
    {
      "key": "Gender",
      "value": [
        {
          "body": "Male",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Male",
          "value": "Male",
          "value_text": "Male"
        }
      ]
    },
    {
      "key": "Hair color",
      "value": [
        {
          "body": "Brown",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Brown",
          "value": "Brown",
          "value_text": "Brown"
        }
      ]
    },
    {
      "key": "Allies",
      "value": [
        {
          "body": "Lady ${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Tienhai",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Tienhai",
                "page": "Tienhai"
              }
            }
          ],
          "text": "Lady Tienhai",
          "value": "Lady ${link_0}",
          "value_text": "Lady Tienhai"
        }
      ]
    },
    {
      "key": "Enemies",
      "value": [
        {
          "body": "Humans",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Humans",
          "value": "Humans",
          "value_text": "Humans"
        }
      ]
    },
    {
      "key": "Affiliation",
      "value": [
        {
          "body": "${link_0}, physical world",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Spirit World",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Spirit_World",
                "page": "Spirit_World"
              }
            }
          ],
          "text": "Spirit World, physical world",
          "value": "${link_0}, physical world",
          "value_text": "Spirit World, physical world"
        }
      ]
    },
    {
      "key": "First Appearance",
      "value": [
        {
          "body": "${link_0} (vision only)",
          "extra": "(vision only)",
          "extra_text": "(vision only)",
          "links": [
            {
              "body": "The Rift Part One",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/The_Rift_Part_One",
                "page": "The_Rift_Part_One"
              }
            }
          ],
          "text": "The Rift Part One (vision only)",
          "value": "${link_0}",
          "value_text": "The Rift Part One"
        }
      ]
    },
    {
      "key": "Last Appearance",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "The Rift Part Three",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/The_Rift_Part_Three",
                "page": "The_Rift_Part_Three"
              }
            }
          ],
          "text": "The Rift Part Three",
          "value": "${link_0}",
          "value_text": "The Rift Part Three"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "General Old Iron is a giant humanoid spirit who protected Lady ${link_0} during the ${link_1}, while she tended to the seashore of what would later become ${link_2} territory. After his friend passed away centuries later, General Old Iron went on a rampage against the people that caused Tienhai's death, though relented after having struck a deal with ${link_3} ${link_4}. However, in 102 ${link_5}, with the land having been defiled by humans and his old armor being stolen, he rose again and threatened destruction of the city. After being vanquished by Avatar ${link_6}, Old Iron, frustrated with the idea that humans only sought to dominate, permanently left the shore surrounding the Earth Kingdom city.",
      "links": [
        {
          "body": "Tienhai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tienhai",
            "page": "Tienhai"
          }
        },
        {
          "body": "era of Raava",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Era_of_Raava",
            "page": "Era_of_Raava"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Yangchen",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Yangchen",
            "page": "Yangchen"
          }
        },
        {
          "body": "AG",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        }
      ],
      "section": [
        "Old Iron"
      ],
      "text": "General Old Iron is a giant humanoid spirit who protected Lady Tienhai during the era of Raava, while she tended to the seashore of what would later become Earth Kingdom territory. After his friend passed away centuries later, General Old Iron went on a rampage against the people that caused Tienhai's death, though relented after having struck a deal with Avatar Yangchen. However, in 102 AG, with the land having been defiled by humans and his old armor being stolen, he rose again and threatened destruction of the city. After being vanquished by Avatar Aang, Old Iron, frustrated with the idea that humans only sought to dominate, permanently left the shore surrounding the Earth Kingdom city."
    },
    {
      "body": "When the spirits still roamed the ${link_0} freely, General Old Iron resided on the seashore, near where centuries later the city of ${link_1} would be erected. He protected his friend, Lady Tienhai, while she tended to their surroundings. However, when a tribe of humans made their home on the cliff near the shore without asking permission, General Old Iron intended on eradicating them before they could grow prosperous, as he had heard of humans wiping out the spirits in other places around the world. Before he could execute his plan, he was stopped by Lady Tienhai, who forsook their friendship to save the humans. As a result, General Old Iron left.",
      "links": [
        {
          "body": "earth",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Yu Dao",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Yu_Dao",
            "page": "Yu_Dao"
          }
        }
      ],
      "section": [
        "Old Iron",
        "History"
      ],
      "text": "When the spirits still roamed the earth freely, General Old Iron resided on the seashore, near where centuries later the city of Yu Dao would be erected. He protected his friend, Lady Tienhai, while she tended to their surroundings. However, when a tribe of humans made their home on the cliff near the shore without asking permission, General Old Iron intended on eradicating them before they could grow prosperous, as he had heard of humans wiping out the spirits in other places around the world. Before he could execute his plan, he was stopped by Lady Tienhai, who forsook their friendship to save the humans. As a result, General Old Iron left."
    },
    {
      "body": "Centuries later, General Old Iron felt Lady Tienhai exhale her last breath. He assumed that she was killed by the humans, unaware that Tienhai had fallen in love with the settlers' ${link_0} and thus gave up her immortality to be with him, resulting in her dying of natural causes and taking on a new form. Devastated, he returned to that place, intent on wiping out the entire populace, though he was met by Avatar Yangchen. When she addressed him, he easily swatted her aside and made his way toward the city. The Avatar returned, however, and they fought through the night, destroying the city in the progress. By the break of dawn, he communicated his story with Yangchen, letting her know who he was and why he was so vengeful toward the people living there. When the local king corroborated his story, General Old Iron started to attack the people directly, though was persuaded to cease his assault and come to an arrangement with Yangchen, the upkeep of which she vowed to ensure. Old Iron vowed to never take up his armor again so long as the land remained free of human civilization. In return, Yangchen constructed a memorial in Tienhai's image and lead her ${link_1} on yearly pilgrimages to the site to pay respect to Tienhai, the land being declared sacred so no one would think to develop the area, to prove that humans could protect and preserve nature.",
      "links": [
        {
          "body": "prince",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tienhai%27s_husband",
            "page": "Tienhai%27s_husband"
          }
        },
        {
          "body": "people",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "section": [
        "Old Iron",
        "History"
      ],
      "text": "Centuries later, General Old Iron felt Lady Tienhai exhale her last breath. He assumed that she was killed by the humans, unaware that Tienhai had fallen in love with the settlers' prince and thus gave up her immortality to be with him, resulting in her dying of natural causes and taking on a new form. Devastated, he returned to that place, intent on wiping out the entire populace, though he was met by Avatar Yangchen. When she addressed him, he easily swatted her aside and made his way toward the city. The Avatar returned, however, and they fought through the night, destroying the city in the progress. By the break of dawn, he communicated his story with Yangchen, letting her know who he was and why he was so vengeful toward the people living there. When the local king corroborated his story, General Old Iron started to attack the people directly, though was persuaded to cease his assault and come to an arrangement with Yangchen, the upkeep of which she vowed to ensure. Old Iron vowed to never take up his armor again so long as the land remained free of human civilization. In return, Yangchen constructed a memorial in Tienhai's image and lead her people on yearly pilgrimages to the site to pay respect to Tienhai, the land being declared sacred so no one would think to develop the area, to prove that humans could protect and preserve nature."
    },
    {
      "body": "In 102 AG, after ${link_0} and the ${link_1} began to pull Old Iron's armor from the city, the spirit emerged from the sea and took it back, dragging Loban, ${link_2}, and ${link_3} with him as he stormed into the city. Seeing the deal he had made with Yangchen being broken, he began to attack, threatening to wipe humans from existence. He was quickly challenged by Aang, who had constructed an earthen shield to match Old Iron's form and activated the ${link_4} to enhance his power. The general matched with the Avatar blow-for-blow, but his iron armor was soon ${link_5} off of him by ${link_6} and her ${link_7}. He demanded to know why the metalbenders were tearing his shielding apart and set to attack them, but Aang ripped a hole in his chest with a blast of all four ${link_8}. Old Iron, tears appearing in his eyes, realized there was no place for his kind in the world, seeing he was significantly weaker than the humans. Unconvinced by Aang's pleas that he could maintain balance between the physical and ${link_9}, the spirit told him that he was only fooling himself and the Avatar would always side with the humans in a rift between them and the spirits. He added that humans, even Aang, had a will to dominate and the worlds could never be balanced. Acknowledging his defeat, Old Iron retreated under the sea for good.",
      "links": [
        {
          "body": "Loban",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Loban",
            "page": "Loban"
          }
        },
        {
          "body": "Rough Rhinos",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Rough_Rhinos",
            "page": "Rough_Rhinos"
          }
        },
        {
          "body": "Satoru",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Satoru",
            "page": "Satoru"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "metalbent",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "Toph",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "students",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Beifong",
            "page": "Team_Beifong"
          }
        },
        {
          "body": "elements",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Spirit Worlds",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "section": [
        "Old Iron",
        "History"
      ],
      "text": "In 102 AG, after Loban and the Rough Rhinos began to pull Old Iron's armor from the city, the spirit emerged from the sea and took it back, dragging Loban, Satoru, and Sokka with him as he stormed into the city. Seeing the deal he had made with Yangchen being broken, he began to attack, threatening to wipe humans from existence. He was quickly challenged by Aang, who had constructed an earthen shield to match Old Iron's form and activated the Avatar State to enhance his power. The general matched with the Avatar blow-for-blow, but his iron armor was soon metalbent off of him by Toph and her students. He demanded to know why the metalbenders were tearing his shielding apart and set to attack them, but Aang ripped a hole in his chest with a blast of all four elements. Old Iron, tears appearing in his eyes, realized there was no place for his kind in the world, seeing he was significantly weaker than the humans. Unconvinced by Aang's pleas that he could maintain balance between the physical and Spirit Worlds, the spirit told him that he was only fooling himself and the Avatar would always side with the humans in a rift between them and the spirits. He added that humans, even Aang, had a will to dominate and the worlds could never be balanced. Acknowledging his defeat, Old Iron retreated under the sea for good."
    },
    {
      "body": "General Old Iron is a powerful spirit who can coat himself in a sturdy armor of iron to increase his resilience in battle. His enormous size enables him to easily crush his opponents and surroundings.",
      "links": [],
      "section": [
        "Old Iron",
        "Abilities"
      ],
      "text": "General Old Iron is a powerful spirit who can coat himself in a sturdy armor of iron to increase his resilience in battle. His enormous size enables him to easily crush his opponents and surroundings."
    },
    {
      "body": "${link_0} trilogy",
      "links": [
        {
          "body": "The Rift",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/The_Rift",
            "page": "The_Rift"
          }
        }
      ],
      "section": [
        "Old Iron",
        "Appearances",
        "Graphic novel trilogies"
      ],
      "text": "The Rift trilogy"
    },
    {
      "body": "General Old Iron was inspired by General Thousand-Miles Eye and General With-Wind Ear, two guardians who accompany Mazu, the patron goddess of seafarers.",
      "links": [],
      "section": [
        "Old Iron",
        "Trivia"
      ],
      "text": "General Old Iron was inspired by General Thousand-Miles Eye and General With-Wind Ear, two guardians who accompany Mazu, the patron goddess of seafarers."
    },
    {
      "body": "After his defeat, General Old Iron transformed into serpent lobster spirits, which were the precursors of his character during the development of ${link_0}.",
      "links": [
        {
          "body": "The Rift",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/The_Rift",
            "page": "The_Rift"
          }
        }
      ],
      "section": [
        "Old Iron",
        "Trivia"
      ],
      "text": "After his defeat, General Old Iron transformed into serpent lobster spirits, which were the precursors of his character during the development of The Rift."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Old_Iron",
    "file": "avatar.wikia.com/wiki/Old_Iron.html",
    "page": "Old_Iron",
    "title": "Old Iron"
  }
}