{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Earthbending",
      "target": {
        "href": "Category_Earthbending",
        "page": "Category_Earthbending"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The ${link_0} delivery system spans vertically through the entire city.",
      "links": [
        {
          "body": "Omashu",
          "key": "${link_0}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        }
      ],
      "text": "The Omashu delivery system spans vertically through the entire city."
    },
    {
      "body": "The Omashu delivery system is a complex system of chutes that are used to transport mail and packages throughout the ${link_0} city of ${link_1}. The system consists of a series of slides and chutes through which various parcels travel in order to arrive at a certain destination. It is powered by ${link_2} and gravity; earthbending sends the packages up the slides, while gravity moves them down. The slides are outfitted with numerous loading points, which also operate through earthbending.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_1}",
          "target": {
            "href": "Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "The Omashu delivery system is a complex system of chutes that are used to transport mail and packages throughout the Earth Kingdom city of Omashu. The system consists of a series of slides and chutes through which various parcels travel in order to arrive at a certain destination. It is powered by earthbending and gravity; earthbending sends the packages up the slides, while gravity moves them down. The slides are outfitted with numerous loading points, which also operate through earthbending."
    },
    {
      "body": "A younger ${link_0} and ${link_1} used this system for what Bumi called \"the world's greatest super slide\" by placing themselves in a cart at the top of a steep incline, which gave the cart a huge amount of speed and provided a great thrill to the riders.",
      "links": [
        {
          "body": "Bumi",
          "key": "${link_0}",
          "target": {
            "href": "Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "A younger Bumi and Aang used this system for what Bumi called \"the world's greatest super slide\" by placing themselves in a cart at the top of a steep incline, which gave the cart a huge amount of speed and provided a great thrill to the riders."
    },
    {
      "body": "In 99 ${link_0}, Aang took ${link_1} and ${link_2} to Omashu, where he urged them to ride the chutes. After almost being impaled by a rack of spears, Aang managed to get off the chute with them still in their cart, sliding through a building, down rooftops, and destroying various objects along the way. Their journey ended when they crashed into the ${link_3}'s stand, which got them arrested. Later, after completing all the challenges that Bumi assigned, Aang and the former slid down the delivery system to relive old times.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_2}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "cabbage merchant",
          "key": "${link_3}",
          "target": {
            "href": "Cabbage_merchant",
            "page": "Cabbage_merchant"
          }
        }
      ],
      "text": "In 99 AG, Aang took Katara and Sokka to Omashu, where he urged them to ride the chutes. After almost being impaled by a rack of spears, Aang managed to get off the chute with them still in their cart, sliding through a building, down rooftops, and destroying various objects along the way. Their journey ended when they crashed into the cabbage merchant's stand, which got them arrested. Later, after completing all the challenges that Bumi assigned, Aang and the former slid down the delivery system to relive old times."
    },
    {
      "body": "After Omashu was ${link_0} by the ${link_1}, they began covering the chutes with metal to prevent earthbenders from bending them. Eventually, Aang came into the city looking for Bumi but to his surprise discovered his old friend had been imprisoned. He fought with ${link_2} ${link_3} as she tried to chase the two friends during their escape down the delivery chutes. However, Azula failed to capture them, as Bumi used his earthbending to save himself and Aang.",
      "links": [
        {
          "body": "conquered",
          "key": "${link_0}",
          "target": {
            "href": "Surrender_of_Omashu",
            "page": "Surrender_of_Omashu"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Princess",
          "key": "${link_2}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Azula",
          "key": "${link_3}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "After Omashu was conquered by the Fire Nation, they began covering the chutes with metal to prevent earthbenders from bending them. Eventually, Aang came into the city looking for Bumi but to his surprise discovered his old friend had been imprisoned. He fought with Princess Azula as she tried to chase the two friends during their escape down the delivery chutes. However, Azula failed to capture them, as Bumi used his earthbending to save himself and Aang."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Omashu_delivery_system",
    "file": "avatar.wikia.com/wiki/Omashu_delivery_system.html",
    "page": "Omashu_delivery_system",
    "title": "Omashu delivery system"
  }
}