{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "external": false,
        "href": "/wiki/Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page comprises ${link_0}'s relationships with other characters in the ${link_1}. Ozai's egocentric and megalomaniacal personality led to him having many enemies, even within his own ${link_2}.",
      "links": [
        {
          "body": "Ozai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "family",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_Royal_Family",
            "page": "Fire_Nation_Royal_Family"
          }
        }
      ],
      "section": [
        "Ozai's relationships"
      ],
      "text": "This page comprises Ozai's relationships with other characters in the World of Avatar. Ozai's egocentric and megalomaniacal personality led to him having many enemies, even within his own family."
    },
    {
      "body": "To Ozai, family seemed to be nothing in comparison to his goal of world domination. It had been hinted that, at one point in time, he seemed to care about his family more. While he may have had some respect for his talented daughter, ${link_0}, Ozai used his children solely to his advantage. By the end of the ${link_1} it was possible that Ozai had lost all love for his family because of their defeats, betrayals and his cruel treatment of them.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        },
        {
          "body": "War",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Relatives"
      ],
      "text": "To Ozai, family seemed to be nothing in comparison to his goal of world domination. It had been hinted that, at one point in time, he seemed to care about his family more. While he may have had some respect for his talented daughter, Azula, Ozai used his children solely to his advantage. By the end of the War it was possible that Ozai had lost all love for his family because of their defeats, betrayals and his cruel treatment of them."
    },
    {
      "body": "Unlike ${link_0}, Azula was Ozai's pride, sharing her father's disposition toward cruelty and violence. Ozai always favored Azula, saying she was born lucky. Ozai was always impressed by and proud of Azula's ${link_1} abilities and intelligence. As Ozai's dislike of Zuko grew over the years, so did his favoritism of Azula. Without a maternal figure, Azula and Zuko had to live up to their father's expectations, and even though Azula succeeded, she was pressured into becoming a perfectionist, settling for nothing less than what would make Ozai proud. At most, Ozai also trusted Azula, believing her lie that Zuko slayed the ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Azula"
      ],
      "text": "Unlike Zuko, Azula was Ozai's pride, sharing her father's disposition toward cruelty and violence. Ozai always favored Azula, saying she was born lucky. Ozai was always impressed by and proud of Azula's firebending abilities and intelligence. As Ozai's dislike of Zuko grew over the years, so did his favoritism of Azula. Without a maternal figure, Azula and Zuko had to live up to their father's expectations, and even though Azula succeeded, she was pressured into becoming a perfectionist, settling for nothing less than what would make Ozai proud. At most, Ozai also trusted Azula, believing her lie that Zuko slayed the Avatar."
    },
    {
      "body": "During the ${link_0}, Zuko revealed to Ozai that Azula had killed the Avatar and lied to protect herself. Even though Ozai seemed furious with Zuko, he seemingly did not punish Azula, since she was as calm and focused as ever during her trip to the ${link_1}. However, the betrayal of her friends caused Azula's mind to detoriate, which permanently affected her relationship with her father. On the day of Ozai's coronation as ${link_2}, Ozai informed Azula that he would not be taking her with him on his mission to burn down the ${link_3}. At first, Azula was extremely upset, feeling her father did not want her and was treating her like Zuko. Ozai harshly silenced her, but calmly and more kindly told her that he had decided to make her ${link_4}. This made her happy, however, the damage was already done. Azula still felt hurt and betrayed, resulting in her complete descent into madness.",
      "links": [
        {
          "body": "solar eclipse",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "Phoenix King",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Phoenix_King",
            "page": "Phoenix_King"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Azula"
      ],
      "text": "During the solar eclipse, Zuko revealed to Ozai that Azula had killed the Avatar and lied to protect herself. Even though Ozai seemed furious with Zuko, he seemingly did not punish Azula, since she was as calm and focused as ever during her trip to the Boiling Rock. However, the betrayal of her friends caused Azula's mind to detoriate, which permanently affected her relationship with her father. On the day of Ozai's coronation as Phoenix King, Ozai informed Azula that he would not be taking her with him on his mission to burn down the Earth Kingdom. At first, Azula was extremely upset, feeling her father did not want her and was treating her like Zuko. Ozai harshly silenced her, but calmly and more kindly told her that he had decided to make her Fire Lord. This made her happy, however, the damage was already done. Azula still felt hurt and betrayed, resulting in her complete descent into madness."
    },
    {
      "body": "Despite his apparent pride in Azula's prodigious firebending skills and sheer prowess, it was clear that Ozai held little true, unconditional love for Azula. Like Zuko, she was largely a tool to further his own efforts of conquering the world. Azula was apparently aware of this, because after ${link_0} and ${link_1}'s betrayal, she was unable to handle a hallucination of Ursa's expression of pure, motherly love, and became completely insane.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Azula"
      ],
      "text": "Despite his apparent pride in Azula's prodigious firebending skills and sheer prowess, it was clear that Ozai held little true, unconditional love for Azula. Like Zuko, she was largely a tool to further his own efforts of conquering the world. Azula was apparently aware of this, because after Mai and Ty Lee's betrayal, she was unable to handle a hallucination of Ursa's expression of pure, motherly love, and became completely insane."
    },
    {
      "body": "Little is known about Ozai and his father's relationship. However, it seemed that ${link_0} favored ${link_1}, as he strongly defended his firstborn son's birthright. It was revealed that Azulon ordered Ozai to kill his own son, Zuko, as punishment for trying to usurp Iroh's birthright after the death of ${link_2}, a task Ozai would have accomplished if it were not for Ursa's intervention. Ozai did not appear very upset over his father's death. Ozai named Azula after his father and demonstrated her military knowledge and firebending talent to Azulon as a way to earn his father's respect and recognition.",
      "links": [
        {
          "body": "Azulon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Azulon",
            "page": "Azulon"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Lu Ten",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Lu_Ten",
            "page": "Lu_Ten"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Azulon"
      ],
      "text": "Little is known about Ozai and his father's relationship. However, it seemed that Azulon favored Iroh, as he strongly defended his firstborn son's birthright. It was revealed that Azulon ordered Ozai to kill his own son, Zuko, as punishment for trying to usurp Iroh's birthright after the death of Lu Ten, a task Ozai would have accomplished if it were not for Ursa's intervention. Ozai did not appear very upset over his father's death. Ozai named Azula after his father and demonstrated her military knowledge and firebending talent to Azulon as a way to earn his father's respect and recognition."
    },
    {
      "body": "Though not much was explicitly stated about the relationship between Ozai and his brother, it seems that one could compare it to the relationship between Azula and Zuko. While Ozai was an amoral, merciless egoist, his brother was a wise, compassionate cosmopolitan. The relation between the two of them evolved to a mutual distrust of one another. Iroh knew of Ozai's power-hungry personality, but feared his great power and placed his hope in the Avatar. Ozai, who derived satisfaction from the adoration of others, despised Iroh with simple disdain. However, Ozai gave Iroh some respect as a member of the Royal Family and as an accomplished military ${link_0}. Iroh is present during Ozai's war council just prior to Zuko's banishment.",
      "links": [
        {
          "body": "general",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#General_2",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Iroh"
      ],
      "text": "Though not much was explicitly stated about the relationship between Ozai and his brother, it seems that one could compare it to the relationship between Azula and Zuko. While Ozai was an amoral, merciless egoist, his brother was a wise, compassionate cosmopolitan. The relation between the two of them evolved to a mutual distrust of one another. Iroh knew of Ozai's power-hungry personality, but feared his great power and placed his hope in the Avatar. Ozai, who derived satisfaction from the adoration of others, despised Iroh with simple disdain. However, Ozai gave Iroh some respect as a member of the Royal Family and as an accomplished military general. Iroh is present during Ozai's war council just prior to Zuko's banishment."
    },
    {
      "body": "Because Iroh was Ozai's older brother, he was to be next in line to succeed Azulon as Fire Lord. By the time that Azulon had died, it was evident that Ozai developed a deep hatred for his brother. After Iroh's son died in the ${link_0}, Ozai was quick to take advantage of Iroh's vulnerability and informed Azulon that with Lu Ten gone, Iroh had no heirs, so it would be more fitting for himself to be Fire Lord. Azulon denied this request, intending to punish Ozai for seeking to usurp Iroh's birthright. In the aftermath of this fallout, Ozai ultimately stole the throne from Iroh after Azulon's mysterious death. Iroh did not resist this course of action.",
      "links": [
        {
          "body": "Siege of Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Siege_of_Ba_Sing_Se",
            "page": "Siege_of_Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Iroh"
      ],
      "text": "Because Iroh was Ozai's older brother, he was to be next in line to succeed Azulon as Fire Lord. By the time that Azulon had died, it was evident that Ozai developed a deep hatred for his brother. After Iroh's son died in the Siege of Ba Sing Se, Ozai was quick to take advantage of Iroh's vulnerability and informed Azulon that with Lu Ten gone, Iroh had no heirs, so it would be more fitting for himself to be Fire Lord. Azulon denied this request, intending to punish Ozai for seeking to usurp Iroh's birthright. In the aftermath of this fallout, Ozai ultimately stole the throne from Iroh after Azulon's mysterious death. Iroh did not resist this course of action."
    },
    {
      "body": "Their relationship did not improve during Ozai's reign. Iroh was horrified by Ozai's decision to burn Zuko's face after their ${link_0}, and never forgave him for his cruelty toward the young prince. Iroh further distanced himself from Ozai by accompanying Zuko on his quest, and tried to sway the prince away from the path Ozai had chosen for his son. After Iroh betrayed the Fire Nation upon defending the ${link_1} and ${link_2} Spirits from ${link_3} ${link_4} at the ${link_5}, Ozai deemed Iroh a traitor  and ordered Azula to bring him back in chains. He did not regret leaving his brother to rot in ${link_6} after his capture at ${link_7}.",
      "links": [
        {
          "body": "Agni Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Agni_Kai",
            "page": "Agni_Kai"
          }
        },
        {
          "body": "Moon",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Ocean",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/La",
            "page": "La"
          }
        },
        {
          "body": "Admiral",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "prison",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Capital_City_Prison",
            "page": "Capital_City_Prison"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Iroh"
      ],
      "text": "Their relationship did not improve during Ozai's reign. Iroh was horrified by Ozai's decision to burn Zuko's face after their Agni Kai, and never forgave him for his cruelty toward the young prince. Iroh further distanced himself from Ozai by accompanying Zuko on his quest, and tried to sway the prince away from the path Ozai had chosen for his son. After Iroh betrayed the Fire Nation upon defending the Moon and Ocean Spirits from Admiral Zhao at the Northern Water Tribe, Ozai deemed Iroh a traitor  and ordered Azula to bring him back in chains. He did not regret leaving his brother to rot in prison after his capture at Ba Sing Se."
    },
    {
      "body": "Barely anything is known about the relationship between Ozai and his nephew, however, it was shown that Ozai was very unsympathetic to Lu Ten's death as he tried to gain the throne by telling Azulon that with Lu Ten dead, Iroh's bloodline had ended.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Lu Ten"
      ],
      "text": "Barely anything is known about the relationship between Ozai and his nephew, however, it was shown that Ozai was very unsympathetic to Lu Ten's death as he tried to gain the throne by telling Azulon that with Lu Ten dead, Iroh's bloodline had ended."
    },
    {
      "body": "Ozai and Zuko always had a complicated relationship. Though Zuko always wished to please Ozai, Ozai was never pleased with Zuko, saying he was lucky to be born while Azula was born lucky. While Ozai initially tried to have a good relationship with his son, his attitude changed completely after a heated argument with Ursa during which she had outed her desire for Zuko to have been the son of her true love, Ikem, and for him to turn out nothing like Ozai. Granting her wish, Ozai vowed to treat Zuko from then on \"as if he were the son of a treacherous dog\". What little tolerance Ozai had kept for Zuko eventually vanished when Zuko \"disrespected\" him by speaking against one of his ${link_0}'s plans. This resulted in Ozai burning Zuko's eye, permanently scarring his son in an Agni Kai in which Zuko refused to participate. Zuko was banished after the pathetic display he had shown during the Agni Kai and could only return home if he captured the Avatar. However, he finally won back Ozai's love when he helped his sister ${link_1} Ba Sing Se, betrayed his uncle, and killed the Avatar, which Azula lied about to protect herself in the case that the Avatar was still alive. Though Zuko was never a favorite of his, Ozai allowed Zuko to speak on the War Room meetings afterward, using his son's experience in the Earth Kingdom as a valuable asset for his final conquest.",
      "links": [
        {
          "body": "general",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bujing",
            "page": "Bujing"
          }
        },
        {
          "body": "conquer",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Zuko"
      ],
      "text": "Ozai and Zuko always had a complicated relationship. Though Zuko always wished to please Ozai, Ozai was never pleased with Zuko, saying he was lucky to be born while Azula was born lucky. While Ozai initially tried to have a good relationship with his son, his attitude changed completely after a heated argument with Ursa during which she had outed her desire for Zuko to have been the son of her true love, Ikem, and for him to turn out nothing like Ozai. Granting her wish, Ozai vowed to treat Zuko from then on \"as if he were the son of a treacherous dog\". What little tolerance Ozai had kept for Zuko eventually vanished when Zuko \"disrespected\" him by speaking against one of his general's plans. This resulted in Ozai burning Zuko's eye, permanently scarring his son in an Agni Kai in which Zuko refused to participate. Zuko was banished after the pathetic display he had shown during the Agni Kai and could only return home if he captured the Avatar. However, he finally won back Ozai's love when he helped his sister conquer Ba Sing Se, betrayed his uncle, and killed the Avatar, which Azula lied about to protect herself in the case that the Avatar was still alive. Though Zuko was never a favorite of his, Ozai allowed Zuko to speak on the War Room meetings afterward, using his son's experience in the Earth Kingdom as a valuable asset for his final conquest."
    },
    {
      "body": "During the Day of Black Sun, Zuko came to the conclusion to join ${link_0} in their quest to defeat Ozai and bring balance to the world. Zuko confronted Ozai in his underground bunker during the eclipse and stated he was going to tell him the truth. Ozai, amused by this, let him speak. Zuko revealed that it was Azula who killed the Avatar, not him, and that Aang was alive and was likely leading the invasion. Zuko disowned his father and stated that he no longer wanted Ozai's love. He subsequently announced his decision to join the Avatar and to free his uncle from prison. While leaving, Ozai deemed him a coward and baited his son to stay until the eclipse ended by revealing what happened to his long-lost mother. According to Ozai, Azulon did order him to kill Zuko, something he would have done had Ursa not found out. To protect Zuko, she proposed a plan where Ozai would become Fire Lord and Zuko would live. By doing this she committed vicious acts of treason, resulting in her banishment. Zuko was nearly moved to tears by this news, though realized his mother might still be alive. Although Ozai acknowledged that possibility, he deemed a mere banishment as a too merciful a penalty for treason and vowed that Zuko's punishment would be far worse. As the eclipse ended, Ozai fired a bolt of ${link_1} at Zuko, who ${link_2} it and escaped before Ozai could retaliate, leaving his father to seethe in rage.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "lightning",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "redirected",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Zuko"
      ],
      "text": "During the Day of Black Sun, Zuko came to the conclusion to join Team Avatar in their quest to defeat Ozai and bring balance to the world. Zuko confronted Ozai in his underground bunker during the eclipse and stated he was going to tell him the truth. Ozai, amused by this, let him speak. Zuko revealed that it was Azula who killed the Avatar, not him, and that Aang was alive and was likely leading the invasion. Zuko disowned his father and stated that he no longer wanted Ozai's love. He subsequently announced his decision to join the Avatar and to free his uncle from prison. While leaving, Ozai deemed him a coward and baited his son to stay until the eclipse ended by revealing what happened to his long-lost mother. According to Ozai, Azulon did order him to kill Zuko, something he would have done had Ursa not found out. To protect Zuko, she proposed a plan where Ozai would become Fire Lord and Zuko would live. By doing this she committed vicious acts of treason, resulting in her banishment. Zuko was nearly moved to tears by this news, though realized his mother might still be alive. Although Ozai acknowledged that possibility, he deemed a mere banishment as a too merciful a penalty for treason and vowed that Zuko's punishment would be far worse. As the eclipse ended, Ozai fired a bolt of lightning at Zuko, who redirected it and escaped before Ozai could retaliate, leaving his father to seethe in rage."
    },
    {
      "body": "Zuko openly showed his hatred toward his father with the rest of Team Avatar as he openly stated that Ozai was the worst father ever. He insisted that, as the Avatar, ${link_0} had to kill Ozai, a task in which Aang did not want to partake. Aang defeated Ozai by ${link_1} his ${link_2} away.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "taking",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Energybending",
            "page": "Energybending"
          }
        },
        {
          "body": "bending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Zuko"
      ],
      "text": "Zuko openly showed his hatred toward his father with the rest of Team Avatar as he openly stated that Ozai was the worst father ever. He insisted that, as the Avatar, Aang had to kill Ozai, a task in which Aang did not want to partake. Aang defeated Ozai by taking his bending away."
    },
    {
      "body": "Zuko visited his father in prison and was evidently satisfied with Ozai's loss of bending. As Ozai sarcastically thanked the new Fire Lord to grace him with his presence, Zuko answered that he should be glad Aang let him live and hoped that after some time in prison, Ozai would be put on the right path. Zuko went on to praise his father for banishing him, saying it was the best thing he could have ever done for him. When Ozai questioned Zuko as to his reasons for visiting him in prison, Zuko demanded to know the whereabouts of his mother.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Zuko"
      ],
      "text": "Zuko visited his father in prison and was evidently satisfied with Ozai's loss of bending. As Ozai sarcastically thanked the new Fire Lord to grace him with his presence, Zuko answered that he should be glad Aang let him live and hoped that after some time in prison, Ozai would be put on the right path. Zuko went on to praise his father for banishing him, saying it was the best thing he could have ever done for him. When Ozai questioned Zuko as to his reasons for visiting him in prison, Zuko demanded to know the whereabouts of his mother."
    },
    {
      "body": "Ozai did not reveal Ursa's location to Zuko, instead, he offered his son advice on how to be a good Fire Lord, given that he had the \"wisdom of experience.\" Even as a prisoner, Ozai was not above manipulating and goading his son. When Zuko began to walk away, Ozai warned him that the throne came with many pressures that would change him, but if Zuko endured them, he would become great. Ozai predicted that Zuko would return later, a return which he awaited.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Zuko"
      ],
      "text": "Ozai did not reveal Ursa's location to Zuko, instead, he offered his son advice on how to be a good Fire Lord, given that he had the \"wisdom of experience.\" Even as a prisoner, Ozai was not above manipulating and goading his son. When Zuko began to walk away, Ozai warned him that the throne came with many pressures that would change him, but if Zuko endured them, he would become great. Ozai predicted that Zuko would return later, a return which he awaited."
    },
    {
      "body": "His prediction held true, as a year after the Hundred Year War, with a developing crisis in ${link_0}, Zuko returned to Ozai's cell for advice. After two sessions, Ozai had tried to persuade Zuko that it was his choice, as Fire Lord, that mattered. As the ${link_1} failed, Zuko listened to his father.",
      "links": [
        {
          "body": "Yu Dao",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Yu_Dao",
            "page": "Yu_Dao"
          }
        },
        {
          "body": "Harmony Restoration Movement",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Harmony_Restoration_Movement",
            "page": "Harmony_Restoration_Movement"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Relatives",
        "Zuko"
      ],
      "text": "His prediction held true, as a year after the Hundred Year War, with a developing crisis in Yu Dao, Zuko returned to Ozai's cell for advice. After two sessions, Ozai had tried to persuade Zuko that it was his choice, as Fire Lord, that mattered. As the Harmony Restoration Movement failed, Zuko listened to his father."
    },
    {
      "body": "Ozai has only had one known love interest: his wife, Ursa, who was later banished.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Love interest"
      ],
      "text": "Ozai has only had one known love interest: his wife, Ursa, who was later banished."
    },
    {
      "body": "Ozai was arranged to be married to Ursa on the wish of Azulon, in order to fulfill a prophecy that their bloodlines would provide a strong and powerful heir to the Fire Nation throne. However, in order for Ursa to marry the Fire Nation prince, she had to break up with ${link_0}, a relationship she never got over. On their wedding day, Ozai informed Ursa that she could never have any more contact with the people of her old life. However, the new Fire Nation princess did not heed this order and she attempted to send letters in secrecy to her parents and Ikem. These were intercepted on Ozai's order, however, and due to the content of one of them, detailing the possibility that Zuko was Ikem's son as opposed to Ozai's, the couple grew even further apart. Consumed by jealous rage, Ozai ordered the death of Ikem, which he joyfully announced to Ursa, breaking her heart.",
      "links": [
        {
          "body": "Ikem",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Noren#Life_as_Ikem",
            "page": "Noren"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Love interest",
        "Ursa"
      ],
      "text": "Ozai was arranged to be married to Ursa on the wish of Azulon, in order to fulfill a prophecy that their bloodlines would provide a strong and powerful heir to the Fire Nation throne. However, in order for Ursa to marry the Fire Nation prince, she had to break up with Ikem, a relationship she never got over. On their wedding day, Ozai informed Ursa that she could never have any more contact with the people of her old life. However, the new Fire Nation princess did not heed this order and she attempted to send letters in secrecy to her parents and Ikem. These were intercepted on Ozai's order, however, and due to the content of one of them, detailing the possibility that Zuko was Ikem's son as opposed to Ozai's, the couple grew even further apart. Consumed by jealous rage, Ozai ordered the death of Ikem, which he joyfully announced to Ursa, breaking her heart."
    },
    {
      "body": "Their marriage finally came to an end the day before Ozai would be crowned Fire Lord. As punishment for his audacity to be named crown prince as opposed to Iroh, Ozai was ordered to kill Zuko, which he intended to do. However, in order to save her son's life, Ursa struck a deal with her husband. She would fabricate an untraceable ${link_0}, which Ozai could use as he pleased, if he would reconsider taking the boy's life. Ozai accepted the offer, albeit on the extra condition that Ursa was to leave the Fire Nation palace without her children and never return. As such, Ursa left the Fire Nation palace.",
      "links": [
        {
          "body": "poison",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ursa%27s_poison",
            "page": "Ursa%27s_poison"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Love interest",
        "Ursa"
      ],
      "text": "Their marriage finally came to an end the day before Ozai would be crowned Fire Lord. As punishment for his audacity to be named crown prince as opposed to Iroh, Ozai was ordered to kill Zuko, which he intended to do. However, in order to save her son's life, Ursa struck a deal with her husband. She would fabricate an untraceable poison, which Ozai could use as he pleased, if he would reconsider taking the boy's life. Ozai accepted the offer, albeit on the extra condition that Ursa was to leave the Fire Nation palace without her children and never return. As such, Ursa left the Fire Nation palace."
    },
    {
      "body": "Like family, friendship seemed to be irrelevant to Ozai in comparison to world domination. In the Fire Nation, his cruelty, disregard for others, political power, and superior bending prowess usually catalyzed respect and obedience. While he may have some respect for the ${link_0} that served him and his forefathers, Ozai used his soldiers solely to his advantage.",
      "links": [
        {
          "body": "Fire Nation military",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies"
      ],
      "text": "Like family, friendship seemed to be irrelevant to Ozai in comparison to world domination. In the Fire Nation, his cruelty, disregard for others, political power, and superior bending prowess usually catalyzed respect and obedience. While he may have some respect for the Fire Nation military that served him and his forefathers, Ozai used his soldiers solely to his advantage."
    },
    {
      "body": "General Bujing was a High General of the Fire Nation military. Although he was in Ozai's presence twice, he never met or spoke with Ozai nor is it known if there was a difference highly unlikely though it is between Bujing's relationship with Azulon and with Ozai. Bujing was renowned for his ruthless but effective battlefield strategies and shared Ozai's disposition toward cruelty and violence. Known for his calculating manner, sadism, and ruthless attitude, General Bujing had an obsession with victory even if it meant sacrificing inexperienced troops to gain a battlefield advantage but was largely a tool to further Ozai's own efforts at conquering the world.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Bujing"
      ],
      "text": "General Bujing was a High General of the Fire Nation military. Although he was in Ozai's presence twice, he never met or spoke with Ozai nor is it known if there was a difference highly unlikely though it is between Bujing's relationship with Azulon and with Ozai. Bujing was renowned for his ruthless but effective battlefield strategies and shared Ozai's disposition toward cruelty and violence. Known for his calculating manner, sadism, and ruthless attitude, General Bujing had an obsession with victory even if it meant sacrificing inexperienced troops to gain a battlefield advantage but was largely a tool to further Ozai's own efforts at conquering the world."
    },
    {
      "body": "During a war meeting, Bujing's military plan was to move a rookie troop of Fire Nation recruits to fight an experienced battalion of earthbenders. This would make the latter concentrate its efforts and resources on the former, leaving the way open for more capable Fire Nation soldiers to encircle and defeat them. In his words, the new recruits were the best bait available: \"fresh meat\".\nWhen ${link_0} Zuko attended his first war meeting and spoke out against Bujing's cruel plan, he and the other attendees were greatly offended. Ozai told his son that it was an act of disrespect and could only be settled by an Agni Kai, and Zuko accepted, not being afraid of the elderly Bujing.",
      "links": [
        {
          "body": "Prince",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Bujing"
      ],
      "text": "During a war meeting, Bujing's military plan was to move a rookie troop of Fire Nation recruits to fight an experienced battalion of earthbenders. This would make the latter concentrate its efforts and resources on the former, leaving the way open for more capable Fire Nation soldiers to encircle and defeat them. In his words, the new recruits were the best bait available: \"fresh meat\".\nWhen Prince Zuko attended his first war meeting and spoke out against Bujing's cruel plan, he and the other attendees were greatly offended. Ozai told his son that it was an act of disrespect and could only be settled by an Agni Kai, and Zuko accepted, not being afraid of the elderly Bujing."
    },
    {
      "body": "However, Zuko unexpectedly ended up facing Ozai instead. Bujing attended the Agni Kai as a member of the audience smirking upon seeing \"justice\" served to Zuko, showing Bujing's fanatical loyalty to Ozai and how cruel Bujing was. Bujing attended the war meeting the day before the eclipse and was seen exchanging an uneasy glance with General ${link_0} when Prince Zuko entered the room. He applauded Ozai's plan to destroy the Earth Kingdom with the power of ${link_1}. Bujing's relish at hearing the Earth Kingdom's destructive fate showed how cruel Bujing was and how faithful he was to Ozai.",
      "links": [
        {
          "body": "Shinu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Shinu",
            "page": "Shinu"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Bujing"
      ],
      "text": "However, Zuko unexpectedly ended up facing Ozai instead. Bujing attended the Agni Kai as a member of the audience smirking upon seeing \"justice\" served to Zuko, showing Bujing's fanatical loyalty to Ozai and how cruel Bujing was. Bujing attended the war meeting the day before the eclipse and was seen exchanging an uneasy glance with General Shinu when Prince Zuko entered the room. He applauded Ozai's plan to destroy the Earth Kingdom with the power of Sozin's Comet. Bujing's relish at hearing the Earth Kingdom's destructive fate showed how cruel Bujing was and how faithful he was to Ozai."
    },
    {
      "body": "After the Fire Nation's Coup of Ba Sing Se, the position of Supreme Bureaucratic Administrator to the city was created, as which an Earth Kingdom woman named ${link_0} served.",
      "links": [
        {
          "body": "Joo Dee",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Joo_Dee",
            "page": "Joo_Dee"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Joo Dee"
      ],
      "text": "After the Fire Nation's Coup of Ba Sing Se, the position of Supreme Bureaucratic Administrator to the city was created, as which an Earth Kingdom woman named Joo Dee served."
    },
    {
      "body": "Azula placed Joo Dee in charge of Ba Sing Se as Supreme Bureaucratic Administrator following the fall of the capital. According to Azula, she was the \"perfect\" person for the job. Due to affiliation with the Fire Nation and Azula, Joo Dee was an ally of Ozai though she did not sympathize with his cause.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Joo Dee"
      ],
      "text": "Azula placed Joo Dee in charge of Ba Sing Se as Supreme Bureaucratic Administrator following the fall of the capital. According to Azula, she was the \"perfect\" person for the job. Due to affiliation with the Fire Nation and Azula, Joo Dee was an ally of Ozai though she did not sympathize with his cause."
    },
    {
      "body": "After the War's end, Ozai's defeat and the ${link_0}, Joo Dee was likely removed from her position, and was allowed to return to her previous life peacefully. The office of Supreme Bureaucratic Administrator was most likely abolished.",
      "links": [
        {
          "body": "liberation of Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Liberation_of_Ba_Sing_Se",
            "page": "Liberation_of_Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Joo Dee"
      ],
      "text": "After the War's end, Ozai's defeat and the liberation of Ba Sing Se, Joo Dee was likely removed from her position, and was allowed to return to her previous life peacefully. The office of Supreme Bureaucratic Administrator was most likely abolished."
    },
    {
      "body": "${link_0} was the cunning and inventive ${link_1} and overseer of the creation of all the Fire Nation's war machines and had been a Fire Nation emissary for years. He never met with, spoke with, or was mentioned by Ozai nor is it known if there was a difference highly unlikely though it is between Qin's relationship with Azulon and with Ozai. It is certain whatsoever that Qin shared Ozai's disposition toward cruelty and violence and Qin was largely a tool to further Ozai's own efforts at conquering the world.",
      "links": [
        {
          "body": "Qin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Qin",
            "page": "Qin"
          }
        },
        {
          "body": "War Minister",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/War_Minister",
            "page": "War_Minister"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Qin"
      ],
      "text": "Qin was the cunning and inventive War Minister and overseer of the creation of all the Fire Nation's war machines and had been a Fire Nation emissary for years. He never met with, spoke with, or was mentioned by Ozai nor is it known if there was a difference highly unlikely though it is between Qin's relationship with Azulon and with Ozai. It is certain whatsoever that Qin shared Ozai's disposition toward cruelty and violence and Qin was largely a tool to further Ozai's own efforts at conquering the world."
    },
    {
      "body": "What is known at the earliest is that out of devotion to Ozai, Qin came back to check in the mechanist's inventions regularly, which pleased Ozai because it consisted of destructive tanks and warships. When the time came, Qin made it so that the Fire Nation attempted to burn the ${link_0} to rubble after the ${link_1}'s defection. The mechanist and his fellow refugees that lived in the temple pushed the invaders back completely.",
      "links": [
        {
          "body": "Northern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        },
        {
          "body": "mechanist",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mechanist",
            "page": "Mechanist"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Qin"
      ],
      "text": "What is known at the earliest is that out of devotion to Ozai, Qin came back to check in the mechanist's inventions regularly, which pleased Ozai because it consisted of destructive tanks and warships. When the time came, Qin made it so that the Fire Nation attempted to burn the Northern Air Temple to rubble after the mechanist's defection. The mechanist and his fellow refugees that lived in the temple pushed the invaders back completely."
    },
    {
      "body": "However, the mechanist's latest invention was a ${link_0} with which the ${link_1} was won against the Fire Nation. During the battle, the balloon crashed into the nearby valley, right in time to be discovered by Ozai's loyal War Minister. Qin decreed with a sadistic smile that the defeat at the battle of the Northern Air Temple \"would be the gateway to many victories\" for the Fire Nation in Ozai's name at battles of the War in the future. Under Qin's supervision, the hot air balloon turned into a frequently used war balloon that enabled Ozai's military to control the skies.",
      "links": [
        {
          "body": "hot air balloon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hot_air_balloon",
            "page": "Hot_air_balloon"
          }
        },
        {
          "body": "battle for the Northern Air Temple",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Battle_for_the_Northern_Air_Temple",
            "page": "Battle_for_the_Northern_Air_Temple"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Qin"
      ],
      "text": "However, the mechanist's latest invention was a hot air balloon with which the battle for the Northern Air Temple was won against the Fire Nation. During the battle, the balloon crashed into the nearby valley, right in time to be discovered by Ozai's loyal War Minister. Qin decreed with a sadistic smile that the defeat at the battle of the Northern Air Temple \"would be the gateway to many victories\" for the Fire Nation in Ozai's name at battles of the War in the future. Under Qin's supervision, the hot air balloon turned into a frequently used war balloon that enabled Ozai's military to control the skies."
    },
    {
      "body": "The masterpiece of technology worked on under Qin's direction for many years was revealed before the walls of Ba Sing Se – a massive ${link_0} with enough power to tunnel through the wall once which he intended for his troops to storm the city from within. At the ${link_1}, Princess Azula oversaw Qin's expedition to penetrate the great walls of the impenetrable city. This was the first time Ozai was mentioned by Qin when he said that the Earth Kingdom would finally fall and that Azula could claim Ba Sing Se for the Fire Nation in Ozai's name.",
      "links": [
        {
          "body": "drill",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        },
        {
          "body": "battle of the drill",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Battle_of_the_drill",
            "page": "Battle_of_the_drill"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Qin"
      ],
      "text": "The masterpiece of technology worked on under Qin's direction for many years was revealed before the walls of Ba Sing Se – a massive drill with enough power to tunnel through the wall once which he intended for his troops to storm the city from within. At the battle of the drill, Princess Azula oversaw Qin's expedition to penetrate the great walls of the impenetrable city. This was the first time Ozai was mentioned by Qin when he said that the Earth Kingdom would finally fall and that Azula could claim Ba Sing Se for the Fire Nation in Ozai's name."
    },
    {
      "body": "What is known at the latest is that when the Drill fell into disrepair thanks to the invention of Avatar Aang and his friends, Ozai seemingly did not punish Qin, as Qin was next seen strolling down the halls of Ozai's secret bunker, where he came across Aang and his friends. When threatened by them, he quickly gave them directions to Ozai's chambers, where not Ozai, but Princess Azula awaited them.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Qin"
      ],
      "text": "What is known at the latest is that when the Drill fell into disrepair thanks to the invention of Avatar Aang and his friends, Ozai seemingly did not punish Qin, as Qin was next seen strolling down the halls of Ozai's secret bunker, where he came across Aang and his friends. When threatened by them, he quickly gave them directions to Ozai's chambers, where not Ozai, but Princess Azula awaited them."
    },
    {
      "body": "The ${link_0} were an elite group of Fire Nation ${link_1} cavalry. They did not seem to be under the direct control of the military, but instead worked on a freelance basis for the Fire Nation. There were five members of the group, each of whom specialized in a different type of ${link_2}/fighting style; though each of their preferred weapons were not well adapted for close-combat.",
      "links": [
        {
          "body": "Rough Rhinos",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Rough_Rhinos",
            "page": "Rough_Rhinos"
          }
        },
        {
          "body": "komodo rhino",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Komodo_rhino",
            "page": "Komodo_rhino"
          }
        },
        {
          "body": "weapon",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Weaponry_in_the_World_of_Avatar",
            "page": "Weaponry_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "The Rough Rhinos"
      ],
      "text": "The Rough Rhinos were an elite group of Fire Nation komodo rhino cavalry. They did not seem to be under the direct control of the military, but instead worked on a freelance basis for the Fire Nation. There were five members of the group, each of whom specialized in a different type of weapon/fighting style; though each of their preferred weapons were not well adapted for close-combat."
    },
    {
      "body": "During Azulon's reign, the Rough Rhinos were responsible for the destruction of ${link_0}'s village and the murder of his parents. During Ozai's reign, the group invaded ${link_1} during Aang's trial for the murder of the village's great leader, ${link_2} the Great. They claimed it in name of Ozai and started to destroy part of the village until Aang, Katara, and Sokka stopped them.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jet",
            "page": "Jet"
          }
        },
        {
          "body": "Chin Village",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Chin_Village",
            "page": "Chin_Village"
          }
        },
        {
          "body": "Chin",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Chin",
            "page": "Chin"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "The Rough Rhinos"
      ],
      "text": "During Azulon's reign, the Rough Rhinos were responsible for the destruction of Jet's village and the murder of his parents. During Ozai's reign, the group invaded Chin Village during Aang's trial for the murder of the village's great leader, Chin the Great. They claimed it in name of Ozai and started to destroy part of the village until Aang, Katara, and Sokka stopped them."
    },
    {
      "body": "Sometime later, the team of soldiers surrounded Iroh and Zuko by means to capture them for Ozai when the two fugitives of the Fire Nation were traveling through the Earth Kingdom, near the great ${link_0}. After a brief battle, the warriors were bested by the two firebenders, who were able to escape in the chaos ensuing an explosion.",
      "links": [
        {
          "body": "Si Wong Desert",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "The Rough Rhinos"
      ],
      "text": "Sometime later, the team of soldiers surrounded Iroh and Zuko by means to capture them for Ozai when the two fugitives of the Fire Nation were traveling through the Earth Kingdom, near the great Si Wong Desert. After a brief battle, the warriors were bested by the two firebenders, who were able to escape in the chaos ensuing an explosion."
    },
    {
      "body": "The ${link_0}, also known as the Imperial Firebenders, was a unit of elite firebenders who served the Fire Lord therefore, Ozai and the Royal Family as personal soldiers and guards and remained silent while on duty. Therefore, they served Ozai and Azula as personal soldiers and guards and prior to Zuko's banishment, him and Iroh as well. The Royal Procession were only loyal to the Fire Lord.",
      "links": [
        {
          "body": "Royal Procession",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Royal_Procession",
            "page": "Royal_Procession"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "The Royal Procession"
      ],
      "text": "The Royal Procession, also known as the Imperial Firebenders, was a unit of elite firebenders who served the Fire Lord therefore, Ozai and the Royal Family as personal soldiers and guards and remained silent while on duty. Therefore, they served Ozai and Azula as personal soldiers and guards and prior to Zuko's banishment, him and Iroh as well. The Royal Procession were only loyal to the Fire Lord."
    },
    {
      "body": "While out to capture her brother and uncle, Azula was accompanied by at least thirty of these soldiers to carry out in her ${link_0}. Both the princess and thirty bodyguards had intentions of carrying out Ozai's will. During the Day of Black Sun the Imperial Firebenders were seen in Fire Lord Ozai's secret bunker to serve as protection during the eclipse in the event that an enemy managed to breach the underground facility. As they were deprived of their bending, they were carrying spears, showing their faithfulness to Ozai.",
      "links": [
        {
          "body": "ship",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Royal_barge",
            "page": "Royal_barge"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "The Royal Procession"
      ],
      "text": "While out to capture her brother and uncle, Azula was accompanied by at least thirty of these soldiers to carry out in her ship. Both the princess and thirty bodyguards had intentions of carrying out Ozai's will. During the Day of Black Sun the Imperial Firebenders were seen in Fire Lord Ozai's secret bunker to serve as protection during the eclipse in the event that an enemy managed to breach the underground facility. As they were deprived of their bending, they were carrying spears, showing their faithfulness to Ozai."
    },
    {
      "body": "The Royal Procession was briefly seen at the coronation of Phoenix King Ozai. Imperial Firebenders held up the banners of the Phoenix King, emphasizing their strong loyalty to him. Imperial Firebenders were seen as part of the crew of the ${link_0} ${link_1}, burning a large section of the ${link_2} and defending the ships from intruders.",
      "links": [
        {
          "body": "airship",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        },
        {
          "body": "fleet",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai%27s_airship_base",
            "page": "Ozai%27s_airship_base"
          }
        },
        {
          "body": "Wulong Forest",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Wulong_Forest",
            "page": "Wulong_Forest"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "The Royal Procession"
      ],
      "text": "The Royal Procession was briefly seen at the coronation of Phoenix King Ozai. Imperial Firebenders held up the banners of the Phoenix King, emphasizing their strong loyalty to him. Imperial Firebenders were seen as part of the crew of the airship fleet, burning a large section of the Wulong Forest and defending the ships from intruders."
    },
    {
      "body": "During the time when Ozai declared himself the Phoenix King the uniforms of the members of the Royal Procession were a black inverted version of the original, i.e. whatever was black was red and vice versa. After Ozai was defeated and imprisoned, the Royal Procession bent their loyalty to Zuko.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Allies",
        "The Royal Procession"
      ],
      "text": "During the time when Ozai declared himself the Phoenix King the uniforms of the members of the Royal Procession were a black inverted version of the original, i.e. whatever was black was red and vice versa. After Ozai was defeated and imprisoned, the Royal Procession bent their loyalty to Zuko."
    },
    {
      "body": "As a reward for his role in the ${link_0}, ${link_1} was appointed governor of the newly subjected ${link_2}. He was chosen by Fire Lord Ozai to govern Omashu, later renamed New Ozai by Princess Azula in honor of her father. He moved there with ${link_3}, Mai, and ${link_4}. Though the governor cared greatly for his family, he was a weak ruler whose faulty assumptions often led to poor decisions.",
      "links": [
        {
          "body": "siege of Omashu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Surrender_of_Omashu",
            "page": "Surrender_of_Omashu"
          }
        },
        {
          "body": "Ukano",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ukano",
            "page": "Ukano"
          }
        },
        {
          "body": "city",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "his wife",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Michi",
            "page": "Michi"
          }
        },
        {
          "body": "Tom-Tom",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Tom-Tom",
            "page": "Tom-Tom"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Ukano"
      ],
      "text": "As a reward for his role in the siege of Omashu, Ukano was appointed governor of the newly subjected city. He was chosen by Fire Lord Ozai to govern Omashu, later renamed New Ozai by Princess Azula in honor of her father. He moved there with his wife, Mai, and Tom-Tom. Though the governor cared greatly for his family, he was a weak ruler whose faulty assumptions often led to poor decisions."
    },
    {
      "body": "To resist the governor's rule, the citizens of Omashu devised a plan involving the ${link_0}. The next morning, all the citizens showed up with marks on their skin from the pentapuses' suction cups, making them look diseased. The governor ordered the citizens to be driven out of the city, thinking there was a plague. He later sent a ${link_1} bearing a message to the resistance.",
      "links": [
        {
          "body": "purple pentapuses",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Purple_pentapus",
            "page": "Purple_pentapus"
          }
        },
        {
          "body": "messenger hawk",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Messenger_hawk",
            "page": "Messenger_hawk"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Ukano"
      ],
      "text": "To resist the governor's rule, the citizens of Omashu devised a plan involving the purple pentapuses. The next morning, all the citizens showed up with marks on their skin from the pentapuses' suction cups, making them look diseased. The governor ordered the citizens to be driven out of the city, thinking there was a plague. He later sent a messenger hawk bearing a message to the resistance."
    },
    {
      "body": "His concern for his family also clearly came before his allegiance to the Fire Lord, as was demonstrated by his spontaneous offer to trade one of the Fire Nation's most valuable and powerful prisoners for his missing son. The governor thought that the earthbenders kidnapped his son and used the disease as a cover. He offered to trade ${link_0} ${link_1} for his son. The governor never met with, spoke with, was mentioned by, or was in the presence of Ozai.",
      "links": [
        {
          "body": "King",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/King_of_Omashu",
            "page": "King_of_Omashu"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Ukano"
      ],
      "text": "His concern for his family also clearly came before his allegiance to the Fire Lord, as was demonstrated by his spontaneous offer to trade one of the Fire Nation's most valuable and powerful prisoners for his missing son. The governor thought that the earthbenders kidnapped his son and used the disease as a cover. He offered to trade King Bumi for his son. The governor never met with, spoke with, was mentioned by, or was in the presence of Ozai."
    },
    {
      "body": "However, Azula mentioned Ozai in the governor's presence, saying how Ozai had entrusted the governor with Omashu and how the governor was nevertheless making a mess of things. When the Day of Black Sun arrived, King Bumi liberated Omashu and destroyed the Fire Nation Palace in the city. Even though this was a defeat against the Fire Nation, Ozai seemingly did not punish the governor, as Mai and the Warden seemed at total ease in the events after this.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Ukano"
      ],
      "text": "However, Azula mentioned Ozai in the governor's presence, saying how Ozai had entrusted the governor with Omashu and how the governor was nevertheless making a mess of things. When the Day of Black Sun arrived, King Bumi liberated Omashu and destroyed the Fire Nation Palace in the city. Even though this was a defeat against the Fire Nation, Ozai seemingly did not punish the governor, as Mai and the Warden seemed at total ease in the events after this."
    },
    {
      "body": "Zhao was a high-ranking and ambitious officer, originally a ${link_0}, followed by ${link_1}, later ${link_2}, and finally an admiral, in the Fire Navy and Zuko's major rival in his attempts to capture Avatar Aang. Zhao never met with or spoke with Ozai, but Zhao among others was in Ozai's presence smirking while Zuko was burned.",
      "links": [
        {
          "body": "lieutenant",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Lieutenant_2",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "captain",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Captain_3",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "commander",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Commander",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Zhao"
      ],
      "text": "Zhao was a high-ranking and ambitious officer, originally a lieutenant, followed by captain, later commander, and finally an admiral, in the Fire Navy and Zuko's major rival in his attempts to capture Avatar Aang. Zhao never met with or spoke with Ozai, but Zhao among others was in Ozai's presence smirking while Zuko was burned."
    },
    {
      "body": "Zuko attempted to withhold the information that the Avatar had returned from Zhao, but Zhao discovered the information that the Avatar had returned and decided to detain Zuko so that he would be unable to capture the Avatar first. This infuriated Zuko and in their subsequent argument Zhao mocked Zuko's plight, telling him that his father does not really want him back at all. This showed that Zhao had great respect and admiration for Ozai. All the same, Zhao's mockery of Zuko regarding his relationship with his father may not mean Zhao thinks highly of Ozai because Azulon treated Ozai almost exactly as Ozai now treated Zuko and the chance that Zhao would side with Azulon against Ozai is not impossible.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Zhao"
      ],
      "text": "Zuko attempted to withhold the information that the Avatar had returned from Zhao, but Zhao discovered the information that the Avatar had returned and decided to detain Zuko so that he would be unable to capture the Avatar first. This infuriated Zuko and in their subsequent argument Zhao mocked Zuko's plight, telling him that his father does not really want him back at all. This showed that Zhao had great respect and admiration for Ozai. All the same, Zhao's mockery of Zuko regarding his relationship with his father may not mean Zhao thinks highly of Ozai because Azulon treated Ozai almost exactly as Ozai now treated Zuko and the chance that Zhao would side with Azulon against Ozai is not impossible."
    },
    {
      "body": "Zuko entered into Fire Nation waters in pursuit of the Avatar, thus violating the terms of his exile. After Zhao arrested the ${link_0} of ${link_1} – four for helping Zuko at this point in time and the other one named ${link_2} for helping Aang – the Great Sage reminded him that only the sage named Shyu had helped the Avatar. Zhao once more showed his fanatical loyalty to Ozai by claiming the five traitors save their stories for Ozai.",
      "links": [
        {
          "body": "Fire Sages",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Crescent Island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Crescent_Island",
            "page": "Crescent_Island"
          }
        },
        {
          "body": "Shyu",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Shyu",
            "page": "Shyu"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Zhao"
      ],
      "text": "Zuko entered into Fire Nation waters in pursuit of the Avatar, thus violating the terms of his exile. After Zhao arrested the Fire Sages of Crescent Island – four for helping Zuko at this point in time and the other one named Shyu for helping Aang – the Great Sage reminded him that only the sage named Shyu had helped the Avatar. Zhao once more showed his fanatical loyalty to Ozai by claiming the five traitors save their stories for Ozai."
    },
    {
      "body": "When Zhao wanted the ${link_0} to be used for his quest to capture Aang, Zhao was a commander therefore; his superior General Shinu denied his request. At that moment, a messenger hawk arrived from Ozai addressed to Shinu. The message was that Zhao was promoted from Commander to Admiral, rendering Zhao's previous request as an order. This showed Ozai had a large amount of trust and faith in Zhao. Once Zhao had captured the Avatar, he made an illuminating speech enjoyed by all soldiers in the stronghold. He wanted a copy of his speech sent to Ozai, which did not happen because a disguised Zuko helped Aang escape. Zhao did not know Zuko was the thief and after knocking out the masked vigilante, proposed to deliver him to Ozai along with Aang.",
      "links": [
        {
          "body": "Yuyan Archers",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Yuyan_Archers",
            "page": "Yuyan_Archers"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Zhao"
      ],
      "text": "When Zhao wanted the Yuyan Archers to be used for his quest to capture Aang, Zhao was a commander therefore; his superior General Shinu denied his request. At that moment, a messenger hawk arrived from Ozai addressed to Shinu. The message was that Zhao was promoted from Commander to Admiral, rendering Zhao's previous request as an order. This showed Ozai had a large amount of trust and faith in Zhao. Once Zhao had captured the Avatar, he made an illuminating speech enjoyed by all soldiers in the stronghold. He wanted a copy of his speech sent to Ozai, which did not happen because a disguised Zuko helped Aang escape. Zhao did not know Zuko was the thief and after knocking out the masked vigilante, proposed to deliver him to Ozai along with Aang."
    },
    {
      "body": "Knowing that Aang was heading for the North Pole to find a waterbending master, Zhao mustered a massive invasion force to besiege and defeat the Northern Water Tribe. Despite the powerful number of Zhao's fleet, the Moon blessed the Northern waterbenders with the power to stand – power that intensified at night and that reached its peak when the Moon was full. Zhao had chosen his destiny many years earlier during his days as a lieutenant that it was his destiny to kill Tui, the Moon Spirit by means to destroy the Moon and the Water Tribe. Knowing the location of the Moon and Ocean Spirits, he used the naval battle he had led as a diversion for him to make his way to the Spirit Oasis of the besieged city. There, in a bid to defeat the Water Tribe forever, he relentlessly killed Tui and destroyed the Moon.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Zhao"
      ],
      "text": "Knowing that Aang was heading for the North Pole to find a waterbending master, Zhao mustered a massive invasion force to besiege and defeat the Northern Water Tribe. Despite the powerful number of Zhao's fleet, the Moon blessed the Northern waterbenders with the power to stand – power that intensified at night and that reached its peak when the Moon was full. Zhao had chosen his destiny many years earlier during his days as a lieutenant that it was his destiny to kill Tui, the Moon Spirit by means to destroy the Moon and the Water Tribe. Knowing the location of the Moon and Ocean Spirits, he used the naval battle he had led as a diversion for him to make his way to the Spirit Oasis of the besieged city. There, in a bid to defeat the Water Tribe forever, he relentlessly killed Tui and destroyed the Moon."
    },
    {
      "body": "With Iroh's help, Tui was restored to life by Princess Yue's sacrifice, bringing the Moon back into existence. Shortly after this event, La, the Ocean Spirit sought revenge on Zhao for killing his wife, which sadly caused the evil admiral to die. Zuko tried to save him but Zhao just would not accept the help of such an enemy and no longer wanted to live after the Moon's revival. Ozai only wanted for the Water Tribe to be crushed and was behind Zhao as long as this happened, even if it meant the destroying the Moon which was said would hurt everyone including its destroyer. All in all, Ozai did not care if Tui was killed or not, but because this was the only way to defeat the Water Tribe, Ozai was pleased when Zhao slew Tui. It is obvious that Ozai understood the absence of the Moon on the night Tui died as evidence that Zhao had killed the Moon Spirit, but when the Moon was resurrected, Ozai knew immediately for his brother Iroh to be in Zhao's company and aware of Iroh's spiritual connections, that the only way for the Moon to have been renewed was with Iroh's treacherous interference.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Zhao"
      ],
      "text": "With Iroh's help, Tui was restored to life by Princess Yue's sacrifice, bringing the Moon back into existence. Shortly after this event, La, the Ocean Spirit sought revenge on Zhao for killing his wife, which sadly caused the evil admiral to die. Zuko tried to save him but Zhao just would not accept the help of such an enemy and no longer wanted to live after the Moon's revival. Ozai only wanted for the Water Tribe to be crushed and was behind Zhao as long as this happened, even if it meant the destroying the Moon which was said would hurt everyone including its destroyer. All in all, Ozai did not care if Tui was killed or not, but because this was the only way to defeat the Water Tribe, Ozai was pleased when Zhao slew Tui. It is obvious that Ozai understood the absence of the Moon on the night Tui died as evidence that Zhao had killed the Moon Spirit, but when the Moon was resurrected, Ozai knew immediately for his brother Iroh to be in Zhao's company and aware of Iroh's spiritual connections, that the only way for the Moon to have been renewed was with Iroh's treacherous interference."
    },
    {
      "body": "Meanwhile, Zhao's forces were almost, if not completely, eradicated by Aang and La. Ozai was furious at this turn of events, not to mention at his brother's treason. When Zhao did not come back with his navy from the North Pole, Ozai knew immediately that Zhao had been killed in the Siege of the North and was outraged by his faithful Admiral's death. After Zhao's death, Ozai blamed Iroh for the loss of the North Pole and considered Iroh as a traitor whom he vowed to have imprisoned.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Allies",
        "Zhao"
      ],
      "text": "Meanwhile, Zhao's forces were almost, if not completely, eradicated by Aang and La. Ozai was furious at this turn of events, not to mention at his brother's treason. When Zhao did not come back with his navy from the North Pole, Ozai knew immediately that Zhao had been killed in the Siege of the North and was outraged by his faithful Admiral's death. After Zhao's death, Ozai blamed Iroh for the loss of the North Pole and considered Iroh as a traitor whom he vowed to have imprisoned."
    },
    {
      "body": "Ozai has a vast list of enemies. He was hated by people from both the other surviving nations and the Fire Nation.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Enemies"
      ],
      "text": "Ozai has a vast list of enemies. He was hated by people from both the other surviving nations and the Fire Nation."
    },
    {
      "body": "Ozai never formally met the Avatar until the end of the War. When he found out Aang was alive, he took immediate action, promoting Zhao to Admiral to increase his chances of capturing the Avatar. Ozai ordered wanted posters to be hung all over the Earth Kingdom to increase his chances of capturing Aang. Even though he felt capturing the Avatar would be a great triumph, he never ordered a significant force to actively search for the last airbender, and after he was told by his children that the Avatar was dead, he believed them. Ozai finally faced Aang on the day of Sozin's Comet. The two were initially evenly matched until Aang's hesitation to kill Ozai gave the Phoenix King the advantage. Ozai nearly defeated Aang and openly mocked him until he knocked him in to a rock, accidentally triggering the Avatar State. Aang easily overwhelmed Ozai while in the Avatar State, but instead of killing him, he stripped him of his firebending abilities using energybending. This resulted in Ozai's defeat and life imprisonment.",
      "links": [],
      "section": [
        "Ozai's relationships",
        "Enemies",
        "Aang"
      ],
      "text": "Ozai never formally met the Avatar until the end of the War. When he found out Aang was alive, he took immediate action, promoting Zhao to Admiral to increase his chances of capturing the Avatar. Ozai ordered wanted posters to be hung all over the Earth Kingdom to increase his chances of capturing Aang. Even though he felt capturing the Avatar would be a great triumph, he never ordered a significant force to actively search for the last airbender, and after he was told by his children that the Avatar was dead, he believed them. Ozai finally faced Aang on the day of Sozin's Comet. The two were initially evenly matched until Aang's hesitation to kill Ozai gave the Phoenix King the advantage. Ozai nearly defeated Aang and openly mocked him until he knocked him in to a rock, accidentally triggering the Avatar State. Aang easily overwhelmed Ozai while in the Avatar State, but instead of killing him, he stripped him of his firebending abilities using energybending. This resulted in Ozai's defeat and life imprisonment."
    },
    {
      "body": "With the exception of Zuko and Aang, Ozai never formally confronted the rest of Team Avatar. However, he briefly encountered ${link_0}, ${link_1}, and ${link_2} right after Aang defeated him. Seeing he was powerless, the three of them devised nicknames like \"The Loser Lord\", \"Phoenix King of getting his butt whooped\", and \"king of the guys who ... don't win\". Ozai could only lie down and drool while hearing those insults.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Suki",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Suki",
            "page": "Suki"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Enemies",
        "Team Avatar"
      ],
      "text": "With the exception of Zuko and Aang, Ozai never formally confronted the rest of Team Avatar. However, he briefly encountered Sokka, Toph, and Suki right after Aang defeated him. Seeing he was powerless, the three of them devised nicknames like \"The Loser Lord\", \"Phoenix King of getting his butt whooped\", and \"king of the guys who ... don't win\". Ozai could only lie down and drool while hearing those insults."
    },
    {
      "body": "It is interesting to note that ${link_0} was the only full-time member of Team Avatar who never met Ozai even though she was likely the most influential member to him, aside from Zuko and Aang, as she defeated Azula.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        }
      ],
      "section": [
        "Ozai's relationships",
        "Enemies",
        "Team Avatar"
      ],
      "text": "It is interesting to note that Katara was the only full-time member of Team Avatar who never met Ozai even though she was likely the most influential member to him, aside from Zuko and Aang, as she defeated Azula."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Ozai%27s_relationships",
    "file": "avatar.wikia.com/wiki/Ozai's_relationships.html",
    "page": "Ozai's_relationships",
    "title": "Ozai's relationships"
  }
}