{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "href": "Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}.",
      "links": [
        {
          "body": "Pabu",
          "key": "${link_0}",
          "target": {
            "href": "Pabu",
            "page": "Pabu"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "This page is comprised of Pabu's relationships with other characters in the World of Avatar."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Naga",
          "key": "${link_0}",
          "target": {
            "href": "Naga",
            "page": "Naga"
          }
        },
        {
          "body": "Pabu",
          "key": "${link_1}",
          "target": {
            "href": "Pabu",
            "page": "Pabu"
          }
        }
      ],
      "text": "Naga and Pabu."
    },
    {
      "body": "${link_0} first met Pabu when ${link_1} and ${link_2} brought Naga to the ${link_3}'s headquarters. Naga initially tried to eat him, but she was stopped by Korra, who warned her to be kind to Pabu. Apart from their first misunderstanding, Naga and Pabu seemed immediately comfortable with each other to the point where Naga did not protest when Pabu stood on her head to drink from the same water source as she did. Later, when Pabu arrived on ${link_4} with Mako, ${link_5}, and ${link_6}, he immediately ran toward Naga and sniffed her nose. Afterward, Naga playfully chased the fire ferret around the island.",
      "links": [
        {
          "body": "Naga",
          "key": "${link_0}",
          "target": {
            "href": "Naga",
            "page": "Naga"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Mako",
          "key": "${link_2}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Triple Threat Triad",
          "key": "${link_3}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "Air Temple Island",
          "key": "${link_4}",
          "target": {
            "href": "Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_5}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Asami",
          "key": "${link_6}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "text": "Naga first met Pabu when Korra and Mako brought Naga to the Triple Threat Triad's headquarters. Naga initially tried to eat him, but she was stopped by Korra, who warned her to be kind to Pabu. Apart from their first misunderstanding, Naga and Pabu seemed immediately comfortable with each other to the point where Naga did not protest when Pabu stood on her head to drink from the same water source as she did. Later, when Pabu arrived on Air Temple Island with Mako, Bolin, and Asami, he immediately ran toward Naga and sniffed her nose. Afterward, Naga playfully chased the fire ferret around the island."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Pabu",
          "key": "${link_1}",
          "target": {
            "href": "Pabu",
            "page": "Pabu"
          }
        }
      ],
      "text": "Bolin and Pabu."
    },
    {
      "body": "Bolin first met Pabu in ${link_0}, where he rescued him and made him his pet. Later, he joined Bolin in playing a series of pranks on Mako. When the team needed to raise money for the entry fee into the ${link_1}, Bolin and Pabu made an attempt at being street performers, with Pabu doing minor circus tricks. However, they earned a total of only one yuan. During Bolin's emotional breakdown, Pabu joined him in overindulging on noodles. Pabu understands Bolin's instructions very well, as demonstrated by his performances and when the team was tied up following the ${link_2}' attack on the Pro-bending Arena. Bolin gestured for Pabu to bite through the rope, which the fire ferret quickly understood, freeing them from their trap.",
      "links": [
        {
          "body": "Republic City",
          "key": "${link_0}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Pro-bending Tournament",
          "key": "${link_1}",
          "target": {
            "href": "Pro-bending#Pro-bending_Tournament",
            "page": "Pro-bending"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_2}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        }
      ],
      "text": "Bolin first met Pabu in Republic City, where he rescued him and made him his pet. Later, he joined Bolin in playing a series of pranks on Mako. When the team needed to raise money for the entry fee into the Pro-bending Tournament, Bolin and Pabu made an attempt at being street performers, with Pabu doing minor circus tricks. However, they earned a total of only one yuan. During Bolin's emotional breakdown, Pabu joined him in overindulging on noodles. Pabu understands Bolin's instructions very well, as demonstrated by his performances and when the team was tied up following the Equalists' attack on the Pro-bending Arena. Bolin gestured for Pabu to bite through the rope, which the fire ferret quickly understood, freeing them from their trap."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Pabu",
          "key": "${link_0}",
          "target": {
            "href": "Pabu",
            "page": "Pabu"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Pabu and Korra."
    },
    {
      "body": "After meeting the ${link_0}, Pabu quickly warmed up to her. He sometimes went along with Korra, when she felt under pressure. Bolin once used Pabu to convince Korra to come to the ${link_1} with them, leading her to cheerfully agree. When Korra cried over her ${link_2} failures on Air Temple Island, Pabu attempted to comfort her by licking the tears from her cheek.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Sato estate",
          "key": "${link_1}",
          "target": {
            "href": "Sato_estate",
            "page": "Sato_estate"
          }
        },
        {
          "body": "airbending",
          "key": "${link_2}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "After meeting the Avatar, Pabu quickly warmed up to her. He sometimes went along with Korra, when she felt under pressure. Bolin once used Pabu to convince Korra to come to the Sato estate with them, leading her to cheerfully agree. When Korra cried over her airbending failures on Air Temple Island, Pabu attempted to comfort her by licking the tears from her cheek."
    },
    {
      "body": "Pabu and Mako do not have much known interaction, but being that Mako was Bolin's older brother, it appeared Pabu felt close to Mako. The fire ferret was, however, Bolin's accomplice in performing a series of pranks on the ${link_0}. When Mako and Korra found Pabu while searching for Bolin, Mako smiled and pet Pabu as the animal jumped to his shoulders.",
      "links": [
        {
          "body": "firebender",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Pabu and Mako do not have much known interaction, but being that Mako was Bolin's older brother, it appeared Pabu felt close to Mako. The fire ferret was, however, Bolin's accomplice in performing a series of pranks on the firebender. When Mako and Korra found Pabu while searching for Bolin, Mako smiled and pet Pabu as the animal jumped to his shoulders."
    },
    {
      "body": "Arriving on Air Temple Island, ${link_0}'s children greeted Mako, Asami, Bolin, and Pabu, the latter of whom immediately went to greet Naga. Meelo inquired as to what species the creature was, a question which Jinora easily answered, describing the fire ferret itself. Ikki mentioned that he was cute and began to playfully chase after him around Naga, frightening the small animal.",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        }
      ],
      "text": "Arriving on Air Temple Island, Tenzin's children greeted Mako, Asami, Bolin, and Pabu, the latter of whom immediately went to greet Naga. Meelo inquired as to what species the creature was, a question which Jinora easily answered, describing the fire ferret itself. Ikki mentioned that he was cute and began to playfully chase after him around Naga, frightening the small animal."
    },
    {
      "body": "When Bolin left to serve for three years in ${link_0}'s ${link_1} from 171 to 174 AG, Pabu stayed on Air Temple Island, where he was frequently entertained and fed by one of Tenzin's children.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "army",
          "key": "${link_1}",
          "target": {
            "href": "Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        }
      ],
      "text": "When Bolin left to serve for three years in Kuvira's army from 171 to 174 AG, Pabu stayed on Air Temple Island, where he was frequently entertained and fed by one of Tenzin's children."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Pabu%27s_relationships",
    "file": "avatar.wikia.com/wiki/Pabu's_relationships.html",
    "page": "Pabu's_relationships",
    "title": "Pabu's relationships"
  }
}