{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Characters",
      "target": {
        "href": "Category_Characters",
        "page": "Category_Characters"
      }
    },
    {
      "body": "Major characters",
      "target": {
        "href": "Category_Major_characters",
        "page": "Category_Major_characters"
      }
    },
    {
      "body": "Neutral characters",
      "target": {
        "href": "Category_Neutral_characters",
        "page": "Category_Neutral_characters"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "href": "Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [
    {
      "key": "Age",
      "value": [
        {
          "body": "150",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "150",
          "value": "150",
          "value_text": "150"
        }
      ]
    },
    {
      "key": "Born",
      "value": [
        {
          "body": "50 ${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "BG",
              "key": "${link_0}",
              "target": {
                "href": "History_of_the_World_of_Avatar#Dates",
                "page": "History_of_the_World_of_Avatar"
              }
            }
          ],
          "text": "50 BG",
          "value": "50 ${link_0}",
          "value_text": "50 BG"
        }
      ]
    },
    {
      "key": "Gender",
      "value": [
        {
          "body": "Male",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Male",
          "value": "Male",
          "value_text": "Male"
        }
      ]
    },
    {
      "key": "Eye color",
      "value": [
        {
          "body": "Green",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Green",
          "value": "Green",
          "value_text": "Green"
        }
      ]
    },
    {
      "key": "Hair color",
      "value": [
        {
          "body": "White (bald)",
          "extra": "(bald)",
          "extra_text": "(bald)",
          "links": [],
          "text": "White (bald)",
          "value": "White",
          "value_text": "White"
        }
      ]
    },
    {
      "key": "Skin color",
      "value": [
        {
          "body": "Brown",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Brown",
          "value": "Brown",
          "value_text": "Brown"
        }
      ]
    },
    {
      "key": "Allies",
      "value": [
        {
          "body": "${link_0}, ${link_1}, ${link_2}, ${link_3}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Aang",
              "key": "${link_0}",
              "target": {
                "href": "Aang",
                "page": "Aang"
              }
            },
            {
              "body": "Appa",
              "key": "${link_1}",
              "target": {
                "href": "Appa",
                "page": "Appa"
              }
            },
            {
              "body": "Gyatso",
              "key": "${link_2}",
              "target": {
                "href": "Gyatso",
                "page": "Gyatso"
              }
            },
            {
              "body": "Air Nomads",
              "key": "${link_3}",
              "target": {
                "href": "Air_Nomads",
                "page": "Air_Nomads"
              }
            }
          ],
          "text": "Aang, Appa, Gyatso, Air Nomads",
          "value": "${link_0}, ${link_1}, ${link_2}, ${link_3}",
          "value_text": "Aang, Appa, Gyatso, Air Nomads"
        }
      ]
    },
    {
      "key": "Profession",
      "value": [
        {
          "body": "Guru",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Guru",
          "value": "Guru",
          "value_text": "Guru"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "${link_0} Aang's spiritual mentor",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Avatar",
              "key": "${link_0}",
              "target": {
                "href": "Avatar",
                "page": "Avatar"
              }
            }
          ],
          "text": "Avatar Aang's spiritual mentor",
          "value": "${link_0} Aang's spiritual mentor",
          "value_text": "Avatar Aang's spiritual mentor"
        },
        {
          "body": "Spiritual expert",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Spiritual expert",
          "value": "Spiritual expert",
          "value_text": "Spiritual expert"
        }
      ]
    },
    {
      "key": "First Appearance",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Appa's Lost Days",
              "key": "${link_0}",
              "target": {
                "href": "Appa%27s_Lost_Days",
                "page": "Appa%27s_Lost_Days"
              }
            }
          ],
          "text": "\"Appa's Lost Days\"",
          "value": "\"${link_0}\"",
          "value_text": "\"Appa's Lost Days\""
        }
      ]
    },
    {
      "key": "Last Appearance",
      "value": [
        {
          "body": "\"${link_0}\" (hallucination)",
          "extra": "(hallucination)",
          "extra_text": "(hallucination)",
          "links": [
            {
              "body": "Nightmares and Daydreams",
              "key": "${link_0}",
              "target": {
                "href": "Nightmares_and_Daydreams",
                "page": "Nightmares_and_Daydreams"
              }
            }
          ],
          "text": "\"Nightmares and Daydreams\" (hallucination)",
          "value": "\"${link_0}\"",
          "value_text": "\"Nightmares and Daydreams\""
        }
      ]
    },
    {
      "key": "Voiced by",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Brian George",
              "key": "${link_0}",
              "target": {
                "href": "Brian_George",
                "page": "Brian_George"
              }
            }
          ],
          "text": "Brian George",
          "value": "${link_0}",
          "value_text": "Brian George"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Guru Pathik was a nomadic supercentenarian who possessed great knowledge of the ${link_0} and its effects on normal humans, as well as the nature of the ${link_1} and the ${link_2}. He was spiritually enlightened and had assisted numerous people, as well as animals like ${link_3}, attain their full potential and cleanse themselves of pain and suffering. Pathik was willing to teach everybody who wished to learn from him, and his nationality was unclear, as he did not seem to hold an allegiance to any one nation and preferred to operate outside of borders.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_2}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Appa",
          "key": "${link_3}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Guru Pathik was a nomadic supercentenarian who possessed great knowledge of the Spirit World and its effects on normal humans, as well as the nature of the Avatar and the Avatar State. He was spiritually enlightened and had assisted numerous people, as well as animals like Appa, attain their full potential and cleanse themselves of pain and suffering. Pathik was willing to teach everybody who wished to learn from him, and his nationality was unclear, as he did not seem to hold an allegiance to any one nation and preferred to operate outside of borders."
    },
    {
      "body": "Born in 50 ${link_0}, Pathik was a spiritual brother of the ${link_1} and a personal friend of Monk ${link_2}. When the Air Nomads were ${link_3}, Pathik took up residence in the ${link_4}. Many years prior to ${link_5}'s liberation from the iceberg, he experienced a vision of one day helping the Avatar.",
      "links": [
        {
          "body": "BG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_1}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Gyatso",
          "key": "${link_2}",
          "target": {
            "href": "Gyatso",
            "page": "Gyatso"
          }
        },
        {
          "body": "wiped out",
          "key": "${link_3}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "Eastern Air Temple",
          "key": "${link_4}",
          "target": {
            "href": "Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        },
        {
          "body": "Aang",
          "key": "${link_5}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Born in 50 BG, Pathik was a spiritual brother of the Air Nomads and a personal friend of Monk Gyatso. When the Air Nomads were wiped out, Pathik took up residence in the Eastern Air Temple. Many years prior to Aang's liberation from the iceberg, he experienced a vision of one day helping the Avatar."
    },
    {
      "body": "Guru Pathik was surrounded by ${link_0} when ${link_1} found him.",
      "links": [
        {
          "body": "animals",
          "key": "${link_0}",
          "target": {
            "href": "Fauna_in_the_World_of_Avatar",
            "page": "Fauna_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Guru Pathik was surrounded by animals when Appa found him."
    },
    {
      "body": "At the Eastern Air Temple, Pathik met Appa and understood that he was not the person Appa expected. He simply lied back, looked at the creature every so often, and received a growl in return. Eventually, the night settled in, and Appa fell asleep. The guru read Appa's spiritual energy and remarked on how Appa was so full of love and trust, but that at the same time fear was moving in where trust should have been. He also told Appa about the vision of Aang and Appa he had had years earlier, which prompted his decision to travel to the Eastern Air Temple and wait for the two. He left the sky bison to rest, stating that the bison must let the clouds in his mind part and be at peace.",
      "links": [],
      "text": "At the Eastern Air Temple, Pathik met Appa and understood that he was not the person Appa expected. He simply lied back, looked at the creature every so often, and received a growl in return. Eventually, the night settled in, and Appa fell asleep. The guru read Appa's spiritual energy and remarked on how Appa was so full of love and trust, but that at the same time fear was moving in where trust should have been. He also told Appa about the vision of Aang and Appa he had had years earlier, which prompted his decision to travel to the Eastern Air Temple and wait for the two. He left the sky bison to rest, stating that the bison must let the clouds in his mind part and be at peace."
    },
    {
      "body": "Come morning, Appa followed a trail of fruit made by the guru, which eventually led Appa to the guru meditating with a group of animals surrounding him. Appa decided to leave the man alone, and, after flying around a bit, he came to rest next to the guru at the top of the temple. The guru gave Appa a note, which he tied to his horn, and proceeded to tell Appa about how much his energy and Aang's were intertwined. As he told Appa this, he placed his hand on Appa's forehead, and told Appa where to find Aang. Appa flew off, heading to ${link_0}. However, the guru's note was intercepted by ${link_1}, but was later returned to Aang.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_1}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        }
      ],
      "text": "Come morning, Appa followed a trail of fruit made by the guru, which eventually led Appa to the guru meditating with a group of animals surrounding him. Appa decided to leave the man alone, and, after flying around a bit, he came to rest next to the guru at the top of the temple. The guru gave Appa a note, which he tied to his horn, and proceeded to tell Appa about how much his energy and Aang's were intertwined. As he told Appa this, he placed his hand on Appa's forehead, and told Appa where to find Aang. Appa flew off, heading to Ba Sing Se. However, the guru's note was intercepted by Long Feng, but was later returned to Aang."
    },
    {
      "body": "Aang eventually arrived at the Eastern Air Temple and discovered Guru Pathik meditating atop the same pillar he was on before Appa's departure. Guru Pathik introduced himself as a spiritual brother to the monks and a close friend of Monk Gyatso. Aang asked the guru how he planned to teach him to open and control the Avatar State, to which the guru replied that he must first bring balance to himself before he can bring balance to the world. He first asked Aang to drink a strange liquid. Aang did so without any qualms before he spat it out, surprised by the disgusting ${link_0} concoction.",
      "links": [
        {
          "body": "onion and banana",
          "key": "${link_0}",
          "target": {
            "href": "Onion-banana_juice",
            "page": "Onion-banana_juice"
          }
        }
      ],
      "text": "Aang eventually arrived at the Eastern Air Temple and discovered Guru Pathik meditating atop the same pillar he was on before Appa's departure. Guru Pathik introduced himself as a spiritual brother to the monks and a close friend of Monk Gyatso. Aang asked the guru how he planned to teach him to open and control the Avatar State, to which the guru replied that he must first bring balance to himself before he can bring balance to the world. He first asked Aang to drink a strange liquid. Aang did so without any qualms before he spat it out, surprised by the disgusting onion and banana concoction."
    },
    {
      "body": "Pathik explained the concept and importance of ${link_0} to ${link_1}.",
      "links": [
        {
          "body": "chakras",
          "key": "${link_0}",
          "target": {
            "href": "Chakras",
            "page": "Chakras"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Pathik explained the concept and importance of chakras to Aang."
    },
    {
      "body": "At the Eastern Air Temple, he began Aang's instruction of the ${link_0}, educating the young Avatar of the nexuses of metaphysical and biophysical energy in the human body. In order to master the Avatar State, Pathik told Aang that he must first open all seven chakras of the body. After he determined that Aang had absolutely no knowledge of the nature of chakras, Pathik proceeded with a visual representation. Using a pond clogged with algae, he successfully explained to Aang the concept of chakras. He stated that by removing the clogs between pools, the water was allowed to flow, just as energy was allowed to flow through the body when the seven chakras were opened. There were in total seven chakras within the body, each with a different purpose and type of blockage; an intense sensation resulted from the opening of them all. Pathik warned that the process of opening the chakras could not be halted once it had begun - it had to be completed in order to succeed. Aang accepted this risk and they began the process.",
      "links": [
        {
          "body": "chakras",
          "key": "${link_0}",
          "target": {
            "href": "Chakras",
            "page": "Chakras"
          }
        }
      ],
      "text": "At the Eastern Air Temple, he began Aang's instruction of the chakras, educating the young Avatar of the nexuses of metaphysical and biophysical energy in the human body. In order to master the Avatar State, Pathik told Aang that he must first open all seven chakras of the body. After he determined that Aang had absolutely no knowledge of the nature of chakras, Pathik proceeded with a visual representation. Using a pond clogged with algae, he successfully explained to Aang the concept of chakras. He stated that by removing the clogs between pools, the water was allowed to flow, just as energy was allowed to flow through the body when the seven chakras were opened. There were in total seven chakras within the body, each with a different purpose and type of blockage; an intense sensation resulted from the opening of them all. Pathik warned that the process of opening the chakras could not be halted once it had begun - it had to be completed in order to succeed. Aang accepted this risk and they began the process."
    },
    {
      "body": "Guru Pathik successfully guided Aang through the opening of the first six chakras. However, once Aang learned that to open the seventh and final chakra he would have to let go of his feelings of attachment for ${link_0}, he refused. Guru Pathik attempted to convince him otherwise, but when Aang had a vision of Katara in trouble, he left the Eastern Air Temple to rescue her. Pathik's final words before Aang's departure was a warning that Aang risked locking the final chakra and that he would not be able to enter the Avatar State at all. By 171 AG, Guru Pathik no longer resided at the Eastern Air Temple.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Guru Pathik successfully guided Aang through the opening of the first six chakras. However, once Aang learned that to open the seventh and final chakra he would have to let go of his feelings of attachment for Katara, he refused. Guru Pathik attempted to convince him otherwise, but when Aang had a vision of Katara in trouble, he left the Eastern Air Temple to rescue her. Pathik's final words before Aang's departure was a warning that Aang risked locking the final chakra and that he would not be able to enter the Avatar State at all. By 171 AG, Guru Pathik no longer resided at the Eastern Air Temple."
    },
    {
      "body": "Pathik was an enlightened man, regularly using meditation to center himself.",
      "links": [],
      "text": "Pathik was an enlightened man, regularly using meditation to center himself."
    },
    {
      "body": "Pathik was a master of Yôga and meditation, and these skills allowed him to live for at least 150 years. He had a vast knowledge of chakras, and the ability to read a person's emotions and feelings by examining their ${link_0}, as he demonstrated when he read Appa's.",
      "links": [
        {
          "body": "chi",
          "key": "${link_0}",
          "target": {
            "href": "Chi",
            "page": "Chi"
          }
        }
      ],
      "text": "Pathik was a master of Yôga and meditation, and these skills allowed him to live for at least 150 years. He had a vast knowledge of chakras, and the ability to read a person's emotions and feelings by examining their chi, as he demonstrated when he read Appa's."
    },
    {
      "body": "In addition, he could sense the energy connections between two individuals and enable them to find each other over great distances, such as when he revealed to Appa that Aang was in Ba Sing Se; this appears to be a more powerful version of an ability Aang used while in the ${link_0}, in order to find Appa and ${link_1}.",
      "links": [
        {
          "body": "Foggy Swamp",
          "key": "${link_0}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "Momo",
          "key": "${link_1}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "In addition, he could sense the energy connections between two individuals and enable them to find each other over great distances, such as when he revealed to Appa that Aang was in Ba Sing Se; this appears to be a more powerful version of an ability Aang used while in the Foggy Swamp, in order to find Appa and Momo."
    },
    {
      "body": "Pathik ${link_0} about ${link_1} in ${link_2}'s daydream.",
      "links": [
        {
          "body": "sang",
          "key": "${link_0}",
          "target": {
            "href": "Songs_in_the_World_of_Avatar",
            "page": "Songs_in_the_World_of_Avatar"
          }
        },
        {
          "body": "chakras",
          "key": "${link_1}",
          "target": {
            "href": "Chakras",
            "page": "Chakras"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Pathik sang about chakras in Aang's daydream."
    },
    {
      "body": "",
      "links": [],
      "text": ""
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Pathik",
    "file": "avatar.wikia.com/wiki/Pathik.html",
    "page": "Pathik",
    "title": "Pathik"
  }
}