{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "href": "Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Titles",
      "target": {
        "href": "Category_Titles",
        "page": "Category_Titles"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} crowned himself Phoenix King just prior to the arrival of ${link_1}.",
      "links": [
        {
          "body": "Ozai",
          "key": "${link_0}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_1}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "text": "Ozai crowned himself Phoenix King just prior to the arrival of Sozin's Comet."
    },
    {
      "body": "Phoenix King was a title created by ${link_0} ${link_1}, who intended it to signify his supreme rule over the entire ${link_2} once the ${link_3} had won the ${link_4}. The title would also allow ${link_5} to become Fire Lord and help lead the Fire Nation in his absence. It was only held by Ozai for two days, and after his defeat, the position of Phoenix King was abolished.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_1}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "world",
          "key": "${link_2}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_4}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Azula",
          "key": "${link_5}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Phoenix King was a title created by Fire Lord Ozai, who intended it to signify his supreme rule over the entire world once the Fire Nation had won the Hundred Year War. The title would also allow Azula to become Fire Lord and help lead the Fire Nation in his absence. It was only held by Ozai for two days, and after his defeat, the position of Phoenix King was abolished."
    },
    {
      "body": "The ${link_0} crafted a large platform with a depiction of a phoenix for ${link_1}'s coronation as Phoenix King.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_1}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "The Fire Nation crafted a large platform with a depiction of a phoenix for Ozai's coronation as Phoenix King."
    },
    {
      "body": "The phoenix, or benu, is a mythical sacred firebird which originated in many ancient mythologies, including Egyptian, Phoenician, Greek, Indian, Persian, Roman, and Chinese, among others. It is a radiant bird with a tail of gold and red plumage, or purple and blue, by some sources, and has a 500 to 1,000 year life cycle, near the end of which it builds itself a nest of myrrh twigs that it eventually ignites. Both nest and bird burn and are reduced to ashes, from which a new, young phoenix or phoenix egg arises, reborn anew to live again.",
      "links": [],
      "text": "The phoenix, or benu, is a mythical sacred firebird which originated in many ancient mythologies, including Egyptian, Phoenician, Greek, Indian, Persian, Roman, and Chinese, among others. It is a radiant bird with a tail of gold and red plumage, or purple and blue, by some sources, and has a 500 to 1,000 year life cycle, near the end of which it builds itself a nest of myrrh twigs that it eventually ignites. Both nest and bird burn and are reduced to ashes, from which a new, young phoenix or phoenix egg arises, reborn anew to live again."
    },
    {
      "body": "In Chinese mythology, the phoenix, also known as fenghuang, is one of the four Sacred Creatures, the other three being the dragon, the qilin, and the turtle. An androgynous creature, it was also associated with Yin; femininity, the moon, and the earth, as opposed to the dragon, which represented Yang; masculinity, the sun, and the sky. The new phoenix is destined to live as long as its old self. It is also associated with fire, justice, obedience, and fidelity.",
      "links": [],
      "text": "In Chinese mythology, the phoenix, also known as fenghuang, is one of the four Sacred Creatures, the other three being the dragon, the qilin, and the turtle. An androgynous creature, it was also associated with Yin; femininity, the moon, and the earth, as opposed to the dragon, which represented Yang; masculinity, the sun, and the sky. The new phoenix is destined to live as long as its old self. It is also associated with fire, justice, obedience, and fidelity."
    },
    {
      "body": "In some legends, the new phoenix embalms the ashes of its old self in an egg made of myrrh and deposits it in the Egyptian city of Heliopolis, known as the sun city in Greek mythology. The bird was also said to regenerate when wounded, essentially making it immortal and invincible. Similarly, it is asserted that a phoenix can heal a person with its tears, and even temporarily make them immune to death. The phoenix is a symbol of fire and divinity. Ozai stated himself that he would no longer be the Fire Lord, and instead be reborn as the Phoenix King, the Supreme Ruler of the world, through the fires he would set in the ${link_0}.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "In some legends, the new phoenix embalms the ashes of its old self in an egg made of myrrh and deposits it in the Egyptian city of Heliopolis, known as the sun city in Greek mythology. The bird was also said to regenerate when wounded, essentially making it immortal and invincible. Similarly, it is asserted that a phoenix can heal a person with its tears, and even temporarily make them immune to death. The phoenix is a symbol of fire and divinity. Ozai stated himself that he would no longer be the Fire Lord, and instead be reborn as the Phoenix King, the Supreme Ruler of the world, through the fires he would set in the Earth Kingdom."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Phoenix_King",
    "file": "avatar.wikia.com/wiki/Phoenix_King.html",
    "page": "Phoenix_King",
    "title": "Phoenix King"
  }
}