{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earthbending",
      "target": {
        "href": "Category_Earthbending",
        "page": "Category_Earthbending"
      }
    },
    {
      "body": "Firebending",
      "target": {
        "href": "Category_Firebending",
        "page": "Category_Firebending"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Pro-bending",
      "target": {
        "href": "Category_Pro-bending",
        "page": "Category_Pro-bending"
      }
    },
    {
      "body": "Recreation",
      "target": {
        "href": "Category_Recreation",
        "page": "Category_Recreation"
      }
    },
    {
      "body": "Republic City",
      "target": {
        "href": "Category_Republic_City",
        "page": "Category_Republic_City"
      }
    },
    {
      "body": "Waterbending",
      "target": {
        "href": "Category_Waterbending",
        "page": "Category_Waterbending"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Two teams prepare to fight in a pro-bending match.",
      "links": [],
      "text": "Two teams prepare to fight in a pro-bending match."
    },
    {
      "body": "Pro-bending is a popular ${link_0} originating in ${link_1} that involves two teams of three ${link_2}, one from each of the three main bending arts. The objective of the sport is to gain as much territory within the ring as possible within three minutes, or, alternatively, to drive the members of the opposing team over the edge of the ring.",
      "links": [
        {
          "body": "sport",
          "key": "${link_0}",
          "target": {
            "href": "Recreation_in_the_World_of_Avatar",
            "page": "Recreation_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "benders",
          "key": "${link_2}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "Pro-bending is a popular sport originating in Republic City that involves two teams of three benders, one from each of the three main bending arts. The objective of the sport is to gain as much territory within the ring as possible within three minutes, or, alternatively, to drive the members of the opposing team over the edge of the ring."
    },
    {
      "body": "The interior of the arena includes a playing field, water pit, and an intricate glass-domed ceiling.",
      "links": [],
      "text": "The interior of the arena includes a playing field, water pit, and an intricate glass-domed ceiling."
    },
    {
      "body": "The playing field is hexagonal, split into two sides, one red and one blue, with each side split into three zones. On each side of the playing field are twenty-one holes that dispense miniature rock discs, similar to ${link_0}, for the ${link_1} competitors. Grates run along the lines between the zones, allowing ${link_2} to access water from troughs under the ring. The grates also mark a zone in the arena and can light up green to signal a team can move forward or red to indicate a penalty. There are flexible, bouncy ropes on the peripheral sides of the ring, but the two opposing ends of the ring are open to a long drop to the water below. ${link_3} look over the ring from raised stands by its sides.",
      "links": [
        {
          "body": "earth coins",
          "key": "${link_0}",
          "target": {
            "href": "Large_earth_coins",
            "page": "Large_earth_coins"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "waterbenders",
          "key": "${link_2}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Referees",
          "key": "${link_3}",
          "target": {
            "href": "Pro-bending_referees",
            "page": "Pro-bending_referees"
          }
        }
      ],
      "text": "The playing field is hexagonal, split into two sides, one red and one blue, with each side split into three zones. On each side of the playing field are twenty-one holes that dispense miniature rock discs, similar to earth coins, for the earthbending competitors. Grates run along the lines between the zones, allowing waterbenders to access water from troughs under the ring. The grates also mark a zone in the arena and can light up green to signal a team can move forward or red to indicate a penalty. There are flexible, bouncy ropes on the peripheral sides of the ring, but the two opposing ends of the ring are open to a long drop to the water below. Referees look over the ring from raised stands by its sides."
    },
    {
      "body": "The rock discs dispensed from the arena are circular, and slightly larger than half a foot in diameter. They are made of hard clay that, while not being particularly soft, will still break if the disc hits a player hard enough. Under each disc is a second that will rise up to become flush with the ground when the first is dispensed. These discs are mainly used as weapons in the match but can effectively be used as a shield. When broken, the discs leave a cloud of dust which could be used for cover to strike the opponent without being seen.",
      "links": [],
      "text": "The rock discs dispensed from the arena are circular, and slightly larger than half a foot in diameter. They are made of hard clay that, while not being particularly soft, will still break if the disc hits a player hard enough. Under each disc is a second that will rise up to become flush with the ground when the first is dispensed. These discs are mainly used as weapons in the match but can effectively be used as a shield. When broken, the discs leave a cloud of dust which could be used for cover to strike the opponent without being seen."
    },
    {
      "body": "At the start of the match, each team must remain within the first zone nearest to the center of the arena. Once a competitor is knocked into zone two by someone from the opposing team, he or she must stay there and cannot return to zone one. The same rules apply if he or she crosses over to zone three. If a player is completely knocked off the back of the ring, they cannot return to the field in that round, but can return for the next round if there is one.",
      "links": [],
      "text": "At the start of the match, each team must remain within the first zone nearest to the center of the arena. Once a competitor is knocked into zone two by someone from the opposing team, he or she must stay there and cannot return to zone one. The same rules apply if he or she crosses over to zone three. If a player is completely knocked off the back of the ring, they cannot return to the field in that round, but can return for the next round if there is one."
    },
    {
      "body": "If all three members from one team are knocked back into zone two, a green light appears in the center line and the opposing team can advance into zone one on the other side; if they do this, they cannot move backward into their own zone. If they manage to knock all of the opposing team members into zone three, another green light appears between zones one and two, and they can advance again into zone two. However, if a team that has been pushed back manages to push the other team back a zone, they can advance forward one zone. The main objective for both teams is to push the other team back, thereby gaining territory.",
      "links": [],
      "text": "If all three members from one team are knocked back into zone two, a green light appears in the center line and the opposing team can advance into zone one on the other side; if they do this, they cannot move backward into their own zone. If they manage to knock all of the opposing team members into zone three, another green light appears between zones one and two, and they can advance again into zone two. However, if a team that has been pushed back manages to push the other team back a zone, they can advance forward one zone. The main objective for both teams is to push the other team back, thereby gaining territory."
    },
    {
      "body": "A green light signals that the members of a team can advance one zone toward their opponents.",
      "links": [],
      "text": "A green light signals that the members of a team can advance one zone toward their opponents."
    },
    {
      "body": "Each match consists of three rounds of three minutes each. The team that has managed to gain the most territory within the time frame wins the round. This means that even if two players from one team have been knocked out, that team can still win if the remaining player manages to gain the most territory by the end of the round. If both sides have not gained any territory, the team with the most players left wins. Otherwise, the round is a draw, resulting in a tie-breaker.",
      "links": [],
      "text": "Each match consists of three rounds of three minutes each. The team that has managed to gain the most territory within the time frame wins the round. This means that even if two players from one team have been knocked out, that team can still win if the remaining player manages to gain the most territory by the end of the round. If both sides have not gained any territory, the team with the most players left wins. Otherwise, the round is a draw, resulting in a tie-breaker."
    },
    {
      "body": "At the beginning of the tie-breaker, the referee flips a coin, with each side of the coin corresponding to one team, either blue or red. The team that wins the coin toss decides the element that is challenged. If the winning team chooses \"fire\" for instance, the ${link_0} fight it out; the winner of the one-on-one wins the round. The tie-breaker is conducted on a raised platform positioned at the very center of the ring.",
      "links": [
        {
          "body": "firebenders",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "At the beginning of the tie-breaker, the referee flips a coin, with each side of the coin corresponding to one team, either blue or red. The team that wins the coin toss decides the element that is challenged. If the winning team chooses \"fire\" for instance, the firebenders fight it out; the winner of the one-on-one wins the round. The tie-breaker is conducted on a raised platform positioned at the very center of the ring."
    },
    {
      "body": "An alternative method to win is to complete a knockout, where all three players of the opposing team are knocked out of the ring during the same round. A knockout results in an automatic win of the match, regardless of whether or not the opponents won more rounds. Game play only continues if any given player manages to return to the playing field before contacting the water pit, either by hanging onto the edge of the arena and returning to the surface or by helping another team member return to the arena.",
      "links": [],
      "text": "An alternative method to win is to complete a knockout, where all three players of the opposing team are knocked out of the ring during the same round. A knockout results in an automatic win of the match, regardless of whether or not the opponents won more rounds. Game play only continues if any given player manages to return to the playing field before contacting the water pit, either by hanging onto the edge of the arena and returning to the surface or by helping another team member return to the arena."
    },
    {
      "body": "Each water blast cannot exceed one second in duration, meaning that waterbenders may not use any form of a constant hose-like stream of water against their opponents. Water must be used in its liquid state, not as a gas or a solid, meaning that steam, fog, and ice are prohibited in game play; it cannot be filled with anything, such as earth. Water is the only element for which head strikes are allowed.",
      "links": [],
      "text": "Each water blast cannot exceed one second in duration, meaning that waterbenders may not use any form of a constant hose-like stream of water against their opponents. Water must be used in its liquid state, not as a gas or a solid, meaning that steam, fog, and ice are prohibited in game play; it cannot be filled with anything, such as earth. Water is the only element for which head strikes are allowed."
    },
    {
      "body": "Waterbenders can only access water within their zone, specifically from the metal grates directly in front and behind the zone that the player is currently occupying. Water may only be pulled up from the zone lines, and not from any outside sources, such as the water below the ring.",
      "links": [],
      "text": "Waterbenders can only access water within their zone, specifically from the metal grates directly in front and behind the zone that the player is currently occupying. Water may only be pulled up from the zone lines, and not from any outside sources, such as the water below the ring."
    },
    {
      "body": "Unlike waterbending, no direct earth strikes can be aimed toward an opponent's head. Though the ring is comprised mostly of canvas-covered metal, no ${link_0} is permitted. Earthbenders may only bend earth in its raw form, and not as sand or dust.",
      "links": [
        {
          "body": "metalbending",
          "key": "${link_0}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        }
      ],
      "text": "Unlike waterbending, no direct earth strikes can be aimed toward an opponent's head. Though the ring is comprised mostly of canvas-covered metal, no metalbending is permitted. Earthbenders may only bend earth in its raw form, and not as sand or dust."
    },
    {
      "body": "Earthbenders are restricted to bending regulation rock discs supplied through the floor of the ring, and may only bend discs from their own zone. Rock discs may not be broken down intentionally into smaller pieces, though the bending of several discs at one time is allowed. Players may ricochet or deflect discs off the side ropes, like air hockey.",
      "links": [],
      "text": "Earthbenders are restricted to bending regulation rock discs supplied through the floor of the ring, and may only bend discs from their own zone. Rock discs may not be broken down intentionally into smaller pieces, though the bending of several discs at one time is allowed. Players may ricochet or deflect discs off the side ropes, like air hockey."
    },
    {
      "body": "Each fire blast must not exceed one second in duration, meaning that firebenders may not use constant flamethrower-like streams of fire against their opponents. No direct fire strikes toward an opponent's head are permitted. Unlike water and earthbenders, firebending pro-benders are not restricted with how they produce their own flames, but are prohibited from using ${link_0} during game play.",
      "links": [
        {
          "body": "lightning generation",
          "key": "${link_0}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        }
      ],
      "text": "Each fire blast must not exceed one second in duration, meaning that firebenders may not use constant flamethrower-like streams of fire against their opponents. No direct fire strikes toward an opponent's head are permitted. Unlike water and earthbenders, firebending pro-benders are not restricted with how they produce their own flames, but are prohibited from using lightning generation during game play."
    },
    {
      "body": "If a player sustains an injury during a match, play is halted and the player is removed from the ring; however, injured participants may be permitted to continue if they are still capable. Players who are injured while being knocked off the ring will be rescued by gaming officials.",
      "links": [],
      "text": "If a player sustains an injury during a match, play is halted and the player is removed from the ring; however, injured participants may be permitted to continue if they are still capable. Players who are injured while being knocked off the ring will be rescued by gaming officials."
    },
    {
      "body": "In both cases, the team must continue the match without a replacement.",
      "links": [],
      "text": "In both cases, the team must continue the match without a replacement."
    },
    {
      "body": "No member of any team in the running for the championship may get into a physical confrontation with another player of an opposing team outside of a pro-bending match. If this occurs, the team that instigated the fight will be ejected from the tournament, and the team they were to battle against will move forward. In addition, a competitor may only compete on one team. In the event the Avatar participates in a pro-bending match, he or she may only bend one element.",
      "links": [],
      "text": "No member of any team in the running for the championship may get into a physical confrontation with another player of an opposing team outside of a pro-bending match. If this occurs, the team that instigated the fight will be ejected from the tournament, and the team they were to battle against will move forward. In addition, a competitor may only compete on one team. In the event the Avatar participates in a pro-bending match, he or she may only bend one element."
    },
    {
      "body": "The ${link_0} issue yellow or red fans to indicate a player has received a warning.",
      "links": [
        {
          "body": "pro-bending referees",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending_referees",
            "page": "Pro-bending_referees"
          }
        }
      ],
      "text": "The pro-bending referees issue yellow or red fans to indicate a player has received a warning."
    },
    {
      "body": "There are several rule violations that will result in a penalty. Stepping over a line when the proper conditions have not been met, knocking a player off the arena from the sides, and the use of \"unnecessary roughness\", such as holding a continuous blast of an element against a fighter, will cost the offender a one-zone penalty. In the case of the Avatar, a penalty may be issued if he or she bends anything other than his or her designated element.",
      "links": [],
      "text": "There are several rule violations that will result in a penalty. Stepping over a line when the proper conditions have not been met, knocking a player off the arena from the sides, and the use of \"unnecessary roughness\", such as holding a continuous blast of an element against a fighter, will cost the offender a one-zone penalty. In the case of the Avatar, a penalty may be issued if he or she bends anything other than his or her designated element."
    },
    {
      "body": "In addition, intentionally hitting the referee, the referee stand, or the audience stands with an element is considered a violation. Though they are unlikely to do so, pro-benders are not permitted to hit the roof of the arena with bending.",
      "links": [],
      "text": "In addition, intentionally hitting the referee, the referee stand, or the audience stands with an element is considered a violation. Though they are unlikely to do so, pro-benders are not permitted to hit the roof of the arena with bending."
    },
    {
      "body": "Players who intentionally break a rule may be shown a yellow fan as a warning. Repeat offenders may receive a red fan after receiving a yellow fan, resulting in their removal from the game. The team that has lost a player must continue without a replacement.",
      "links": [],
      "text": "Players who intentionally break a rule may be shown a yellow fan as a warning. Repeat offenders may receive a red fan after receiving a yellow fan, resulting in their removal from the game. The team that has lost a player must continue without a replacement."
    },
    {
      "body": "A round is won by gaining territory before time runs out. If no team has secured opposing territory by the end of the round, the team with the most number of players remaining wins the round. However, if the team with fewer players has gained more territory by the end of the round, they are declared as the winners of that round.",
      "links": [],
      "text": "A round is won by gaining territory before time runs out. If no team has secured opposing territory by the end of the round, the team with the most number of players remaining wins the round. However, if the team with fewer players has gained more territory by the end of the round, they are declared as the winners of that round."
    },
    {
      "body": "Matches are won by either winning the most rounds or by executing \"knockouts\". Knockouts are accomplished when all members of an opposing team are knocked off the back of the ring within one round.",
      "links": [],
      "text": "Matches are won by either winning the most rounds or by executing \"knockouts\". Knockouts are accomplished when all members of an opposing team are knocked off the back of the ring within one round."
    },
    {
      "body": "Even if a team has won two rounds, they must still play a third round, as a match can end in a knockout at any point.",
      "links": [],
      "text": "Even if a team has won two rounds, they must still play a third round, as a match can end in a knockout at any point."
    },
    {
      "body": "Tiebreakers are fought when a round ends in deadlock.",
      "links": [],
      "text": "Tiebreakers are fought when a round ends in deadlock."
    },
    {
      "body": "If a round ends in a deadlock, with neither team gaining territory and having an equal number of players on the field and in each zone, the winner is decided in a tiebreaker \"face-off\". In a face-off, the referee tosses a coin, and the team that wins the coin toss can decide which player and which element will go into the face-off. Players always face their same element.",
      "links": [],
      "text": "If a round ends in a deadlock, with neither team gaining territory and having an equal number of players on the field and in each zone, the winner is decided in a tiebreaker \"face-off\". In a face-off, the referee tosses a coin, and the team that wins the coin toss can decide which player and which element will go into the face-off. Players always face their same element."
    },
    {
      "body": "The face-off takes place on a raised circular platform in the center of the ring. The tiebreaker platform includes a total of four earth dispensers placed on both sides. In the case of water-based tiebreaker, water grates that run along the perimeter as well as the center are raised along with the platform. Players may use their respective elements, along with grappling, so long as there are no \"empty hand strikes\", particularly punches to the face or kicks to the stomach. The objective is to knock the opposing pro-bender off the circle. The player who falls off first loses the tiebreaker, and the opposing team wins that given round. If both players fall off the circle simultaneously, the player who lands first (hitting either the ring, ropes or the rink) loses the tiebreaker.",
      "links": [],
      "text": "The face-off takes place on a raised circular platform in the center of the ring. The tiebreaker platform includes a total of four earth dispensers placed on both sides. In the case of water-based tiebreaker, water grates that run along the perimeter as well as the center are raised along with the platform. Players may use their respective elements, along with grappling, so long as there are no \"empty hand strikes\", particularly punches to the face or kicks to the stomach. The objective is to knock the opposing pro-bender off the circle. The player who falls off first loses the tiebreaker, and the opposing team wins that given round. If both players fall off the circle simultaneously, the player who lands first (hitting either the ring, ropes or the rink) loses the tiebreaker."
    },
    {
      "body": "If the referee cannot determine who landed first in the above scenario, a second tiebreaker is held between two other members, using a different element. When each team has won a round and the third ends in a deadlock, a tiebreaker face-off is used to determine which team wins the match.",
      "links": [],
      "text": "If the referee cannot determine who landed first in the above scenario, a second tiebreaker is held between two other members, using a different element. When each team has won a round and the third ends in a deadlock, a tiebreaker face-off is used to determine which team wins the match."
    },
    {
      "body": "Tubes indicate the score during a match; here, the blue team won the first round, before the red won the second, got a knockout, and won the match.",
      "links": [],
      "text": "Tubes indicate the score during a match; here, the blue team won the first round, before the red won the second, got a knockout, and won the match."
    },
    {
      "body": "The scoreboard is a set of four nixie tubes. From right to left, they read:",
      "links": [],
      "text": "The scoreboard is a set of four nixie tubes. From right to left, they read:"
    },
    {
      "body": "If both teams should win one of the first two rounds each, and did not knock out their opponents in the third round, the third scoreboard reads:",
      "links": [],
      "text": "If both teams should win one of the first two rounds each, and did not knock out their opponents in the third round, the third scoreboard reads:"
    },
    {
      "body": "The tubes light up either red or blue to indicate which team won a round, got a knockout, or won the match. The red team is the one that starts on the red half of the field.",
      "links": [],
      "text": "The tubes light up either red or blue to indicate which team won a round, got a knockout, or won the match. The red team is the one that starts on the red half of the field."
    },
    {
      "body": "Each contestant must wear a uniform to identify his or her team. Known uniform colors include red, white, and gold; blue, black, and orange; and green, brown, and orange. In addition, combatants have belts and patches on their helmets that are either red, blue, or green in coloration to identify them as firebenders, waterbenders, or earthbenders, respectively.",
      "links": [],
      "text": "Each contestant must wear a uniform to identify his or her team. Known uniform colors include red, white, and gold; blue, black, and orange; and green, brown, and orange. In addition, combatants have belts and patches on their helmets that are either red, blue, or green in coloration to identify them as firebenders, waterbenders, or earthbenders, respectively."
    },
    {
      "body": "The ${link_0} is located in ${link_1}.",
      "links": [
        {
          "body": "Pro-bending Arena",
          "key": "${link_0}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "Yue Bay",
          "key": "${link_1}",
          "target": {
            "href": "Yue_Bay",
            "page": "Yue_Bay"
          }
        }
      ],
      "text": "The Pro-bending Arena is located in Yue Bay."
    },
    {
      "body": "Official pro-bending matches are held in Republic City's Pro-bending Arena, a large glass-domed building located at the end of a pier extending into Yue Bay. As a testament to the sport's popularity, this building's exterior has a golden appearance and is lit at night, making it a prominent city landmark. The arena is spacious enough to hold the pro-bending ring on which the combatants compete, a large pool of water far below the ring, and great numbers of spectators. Somewhere in the building, ${link_0}'s gym is located as well. The attic of the arena is home to the brothers ${link_1} and ${link_2}, who pay their rent by doing odd jobs. The Pro-bending Arena is considered as one of the Avatar World's jewels, and was the first ever established to host pro-bending matches. However, following an ${link_3} attack, the arena was partially destroyed, and later shut down by the authorities.",
      "links": [
        {
          "body": "Toza",
          "key": "${link_0}",
          "target": {
            "href": "Toza",
            "page": "Toza"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_2}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_3}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        }
      ],
      "text": "Official pro-bending matches are held in Republic City's Pro-bending Arena, a large glass-domed building located at the end of a pier extending into Yue Bay. As a testament to the sport's popularity, this building's exterior has a golden appearance and is lit at night, making it a prominent city landmark. The arena is spacious enough to hold the pro-bending ring on which the combatants compete, a large pool of water far below the ring, and great numbers of spectators. Somewhere in the building, Toza's gym is located as well. The attic of the arena is home to the brothers Mako and Bolin, who pay their rent by doing odd jobs. The Pro-bending Arena is considered as one of the Avatar World's jewels, and was the first ever established to host pro-bending matches. However, following an Equalist attack, the arena was partially destroyed, and later shut down by the authorities."
    },
    {
      "body": "The Pro-bending Championship Tournament is an annual sporting event that features the sixteen best teams in the entire league. Played during a week in the last month of the year, the teams compete in elimination-style matches, with the winning team receiving the jackpot prize following the championship tournament. Each tournament team must ante up thirty thousand ${link_0} for the championship pot in order to participate, making the total pot worth four hundred eighty thousand yuans.",
      "links": [
        {
          "body": "yuans",
          "key": "${link_0}",
          "target": {
            "href": "Currency#United_Republic_of_Nations",
            "page": "Currency"
          }
        }
      ],
      "text": "The Pro-bending Championship Tournament is an annual sporting event that features the sixteen best teams in the entire league. Played during a week in the last month of the year, the teams compete in elimination-style matches, with the winning team receiving the jackpot prize following the championship tournament. Each tournament team must ante up thirty thousand yuans for the championship pot in order to participate, making the total pot worth four hundred eighty thousand yuans."
    },
    {
      "body": "The tournament follows an eight-match elimination round consisting of the sixteen best teams. A quarterfinal made up of four rounds is conducted, consisting of the eight winning teams from the previous leg of the tournament. The four teams that win their respective matches advance to battle each other in a semifinal round, consisting of two different matches. Finally, in the finals, the two winning teams at the end of the tournament face off in the championship match. The winners receive the jackpot and the title of being that year's pro-bending champions.",
      "links": [],
      "text": "The tournament follows an eight-match elimination round consisting of the sixteen best teams. A quarterfinal made up of four rounds is conducted, consisting of the eight winning teams from the previous leg of the tournament. The four teams that win their respective matches advance to battle each other in a semifinal round, consisting of two different matches. Finally, in the finals, the two winning teams at the end of the tournament face off in the championship match. The winners receive the jackpot and the title of being that year's pro-bending champions."
    },
    {
      "body": "Pro-bending has its own logo.",
      "links": [],
      "text": "Pro-bending has its own logo."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Pro-bending",
    "file": "avatar.wikia.com/wiki/Pro-bending.html",
    "page": "Pro-bending",
    "title": "Pro-bending"
  }
}