{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Characters",
      "target": {
        "href": "Category_Characters",
        "page": "Category_Characters"
      }
    },
    {
      "body": "Graphic novel characters",
      "target": {
        "href": "Category_Graphic_novel_characters",
        "page": "Category_Graphic_novel_characters"
      }
    },
    {
      "body": "Minor graphic novel characters",
      "target": {
        "href": "Category_Minor_graphic_novel_characters",
        "page": "Category_Minor_graphic_novel_characters"
      }
    },
    {
      "body": "Northern Water Tribe characters",
      "target": {
        "href": "Category_Northern_Water_Tribe_characters",
        "page": "Category_Northern_Water_Tribe_characters"
      }
    },
    {
      "body": "The Search characters",
      "target": {
        "href": "Category_The_Search_characters",
        "page": "Category_The_Search_characters"
      }
    },
    {
      "body": "Water Tribe characters",
      "target": {
        "href": "Category_Water_Tribe_characters",
        "page": "Category_Water_Tribe_characters"
      }
    }
  ],
  "facts": [
    {
      "key": "Nationality",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Northern Water Tribe",
              "key": "${link_0}",
              "target": {
                "href": "Northern_Water_Tribe",
                "page": "Northern_Water_Tribe"
              }
            }
          ],
          "text": "Northern Water Tribe",
          "value": "${link_0}",
          "value_text": "Northern Water Tribe"
        }
      ]
    },
    {
      "key": "Ethnicity",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Water Tribe",
              "key": "${link_0}",
              "target": {
                "href": "Water_Tribe",
                "page": "Water_Tribe"
              }
            }
          ],
          "text": "Water Tribe",
          "value": "${link_0}",
          "value_text": "Water Tribe"
        }
      ]
    },
    {
      "key": "Allies",
      "value": [
        {
          "body": "${link_0}, ${link_1}, ${link_2}, ${link_3}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Aang",
              "key": "${link_0}",
              "target": {
                "href": "Aang",
                "page": "Aang"
              }
            },
            {
              "body": "Katara",
              "key": "${link_1}",
              "target": {
                "href": "Katara",
                "page": "Katara"
              }
            },
            {
              "body": "Sokka",
              "key": "${link_2}",
              "target": {
                "href": "Sokka",
                "page": "Sokka"
              }
            },
            {
              "body": "Zuko",
              "key": "${link_3}",
              "target": {
                "href": "Zuko",
                "page": "Zuko"
              }
            }
          ],
          "text": "Aang, Katara, Sokka, Zuko",
          "value": "${link_0}, ${link_1}, ${link_2}, ${link_3}",
          "value_text": "Aang, Katara, Sokka, Zuko"
        }
      ]
    },
    {
      "key": "Enemies",
      "value": [
        {
          "body": "${link_0}, ${link_1}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Koh",
              "key": "${link_0}",
              "target": {
                "href": "Koh",
                "page": "Koh"
              }
            },
            {
              "body": "Azula",
              "key": "${link_1}",
              "target": {
                "href": "Azula",
                "page": "Azula"
              }
            }
          ],
          "text": "Koh, Azula",
          "value": "${link_0}, ${link_1}",
          "value_text": "Koh, Azula"
        }
      ]
    },
    {
      "key": "Weapon of choice",
      "value": [
        {
          "body": "Water (Misu)",
          "extra": "(Misu)",
          "extra_text": "(Misu)",
          "links": [],
          "text": "Water (Misu)",
          "value": "Water",
          "value_text": "Water"
        }
      ]
    },
    {
      "key": "Fighting style",
      "value": [
        {
          "body": "${link_0} (Misu)",
          "extra": "(Misu)",
          "extra_text": "(Misu)",
          "links": [
            {
              "body": "Waterbending",
              "key": "${link_0}",
              "target": {
                "href": "Waterbending",
                "page": "Waterbending"
              }
            }
          ],
          "text": "Waterbending (Misu)",
          "value": "${link_0}",
          "value_text": "Waterbending"
        }
      ]
    },
    {
      "key": "First Appearance",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "The Search Part Two",
              "key": "${link_0}",
              "target": {
                "href": "The_Search_Part_Two",
                "page": "The_Search_Part_Two"
              }
            }
          ],
          "text": "The Search Part Two",
          "value": "${link_0}",
          "value_text": "The Search Part Two"
        }
      ]
    },
    {
      "key": "Last Appearance",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "The Search Part Three",
              "key": "${link_0}",
              "target": {
                "href": "The_Search_Part_Three",
                "page": "The_Search_Part_Three"
              }
            }
          ],
          "text": "The Search Part Three",
          "value": "${link_0}",
          "value_text": "The Search Part Three"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Rafa and Misu were two siblings, originally from the ${link_0}, who journeyed to the ${link_1} located in the ${link_2}, in search of the ${link_3}. The two hoped that the spirit would be able to restore Rafa's face, which had been stolen by ${link_4} following one of his antics in the Northern Water Tribe.",
      "links": [
        {
          "body": "Northern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Forgetful Valley",
          "key": "${link_1}",
          "target": {
            "href": "Forgetful_Valley",
            "page": "Forgetful_Valley"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Mother of Faces",
          "key": "${link_3}",
          "target": {
            "href": "Mother_of_Faces",
            "page": "Mother_of_Faces"
          }
        },
        {
          "body": "Koh",
          "key": "${link_4}",
          "target": {
            "href": "Koh",
            "page": "Koh"
          }
        }
      ],
      "text": "Rafa and Misu were two siblings, originally from the Northern Water Tribe, who journeyed to the Forgetful Valley located in the Fire Nation, in search of the Mother of Faces. The two hoped that the spirit would be able to restore Rafa's face, which had been stolen by Koh following one of his antics in the Northern Water Tribe."
    },
    {
      "body": "After finding that Rafa's face had gone missing, Misu restlessly searched for a way to help her brother.",
      "links": [],
      "text": "After finding that Rafa's face had gone missing, Misu restlessly searched for a way to help her brother."
    },
    {
      "body": "While the two were growing up, Misu was usually quiet and studious, while Rafa was bold and brash. Rafa enjoyed stealing items from the tribe's most powerful people, not because he needed the items, but to prove that he could. However, he was ordered by his sister to return his plunder each time, something with which he always complied. The people from whom he stole were usually so embarrassed that he never got into any real trouble. However, one day this backfired on him, when Koh, the Face Stealer, punished him for his misdemeanor by removing his face and debilitating him. Misu took him to their tribe's most experienced ${link_0}, but there was nothing that could be done. Refusing to give up, Misu began researching ways to help her brother. While reading an ancient scroll, she discovered that a powerful spirit with the ability to heal Rafa, the Mother of Faces, visited the Fire Nation from time to time. She learned ${link_1} in secret, and took her brother and herself to the Forgetful Valley in hopes of meeting the face-giving spirit.",
      "links": [
        {
          "body": "healers",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "While the two were growing up, Misu was usually quiet and studious, while Rafa was bold and brash. Rafa enjoyed stealing items from the tribe's most powerful people, not because he needed the items, but to prove that he could. However, he was ordered by his sister to return his plunder each time, something with which he always complied. The people from whom he stole were usually so embarrassed that he never got into any real trouble. However, one day this backfired on him, when Koh, the Face Stealer, punished him for his misdemeanor by removing his face and debilitating him. Misu took him to their tribe's most experienced healers, but there was nothing that could be done. Refusing to give up, Misu began researching ways to help her brother. While reading an ancient scroll, she discovered that a powerful spirit with the ability to heal Rafa, the Mother of Faces, visited the Fire Nation from time to time. She learned waterbending in secret, and took her brother and herself to the Forgetful Valley in hopes of meeting the face-giving spirit."
    },
    {
      "body": "In 102 ${link_0}, after hearing ${link_1} scrounging around the forest, Misu initially attacked them using plantbending. When ${link_2} countered the attacks and called the waterbender out, Misu, with Rafa at her side, emerged from the brush. The team later befriended the brother and sister, and ${link_3} entered the ${link_4} in hopes of locating the Mother of Faces for them. However, ${link_5}, under the paranoid impression that the elderly Water Tribe siblings were sent by her mother to impede her progress, aimed a ${link_6} at them.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_4}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Azula",
          "key": "${link_5}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "bolt of lightning",
          "key": "${link_6}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        }
      ],
      "text": "In 102 AG, after hearing Team Avatar scrounging around the forest, Misu initially attacked them using plantbending. When Katara countered the attacks and called the waterbender out, Misu, with Rafa at her side, emerged from the brush. The team later befriended the brother and sister, and Aang entered the Spirit World in hopes of locating the Mother of Faces for them. However, Azula, under the paranoid impression that the elderly Water Tribe siblings were sent by her mother to impede her progress, aimed a bolt of lightning at them."
    },
    {
      "body": "${link_0} successfully stopped Azula's attack and called on ${link_1} and Katara to attack her despite Misu's warnings to not cause a disturbance. In the meanwhile, Aang was able to summon the Mother of Faces, who would grant them only one request. Zuko gave up his chance to find information on Ursa so Misu could request a new face for Rafa. Before the waterbender could complete her request, Azula interrupted and used the favor to get information on Ursa, much to Misu's chagrin. After seeing that Ursa was ${link_2}, whom Team Avatar had met in ${link_3} the day prior, Azula fled toward the town to confront her, while Misu guided Zuko and Sokka to a shortcut back to the village. She proceeded to waterbend at the Mother of Faces, who chastised her for bending the water of her sacred pool, and dove back underwater.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Noriko",
          "key": "${link_2}",
          "target": {
            "href": "Ursa#Reunion_with_Ikem_and_life_as_Noriko",
            "page": "Ursa"
          }
        },
        {
          "body": "Hira'a",
          "key": "${link_3}",
          "target": {
            "href": "Hira%27a",
            "page": "Hira%27a"
          }
        }
      ],
      "text": "Zuko successfully stopped Azula's attack and called on Sokka and Katara to attack her despite Misu's warnings to not cause a disturbance. In the meanwhile, Aang was able to summon the Mother of Faces, who would grant them only one request. Zuko gave up his chance to find information on Ursa so Misu could request a new face for Rafa. Before the waterbender could complete her request, Azula interrupted and used the favor to get information on Ursa, much to Misu's chagrin. After seeing that Ursa was Noriko, whom Team Avatar had met in Hira'a the day prior, Azula fled toward the town to confront her, while Misu guided Zuko and Sokka to a shortcut back to the village. She proceeded to waterbend at the Mother of Faces, who chastised her for bending the water of her sacred pool, and dove back underwater."
    },
    {
      "body": "After the ${link_0} restored Rafa's face, an overjoyed Misu embraced her brother tightly.",
      "links": [
        {
          "body": "Mother of Faces",
          "key": "${link_0}",
          "target": {
            "href": "Mother_of_Faces",
            "page": "Mother_of_Faces"
          }
        }
      ],
      "text": "After the Mother of Faces restored Rafa's face, an overjoyed Misu embraced her brother tightly."
    },
    {
      "body": "Misu and Katara waited while Aang tried to pursue the spirit, though he was ejected from the pool by the Mother of Faces. Unhappy at Aang's demands, she ordered the group to leave the forest, sending her animals to attack them. Katara defended Misu against a spirit, saying \"waterbenders have to look out for each other\". Aang suggested that they leave, but Misu refused, holding out hope to gain a face for Rafa. The ${link_0} inadvertently blew Rafa's mask away, exposing his blank face, which he recognized as the work of Koh, the Face Stealer, and prompting the Mother of Faces to stop her animals upon hearing this. After Aang explained his knowledge of Koh, the Mother of Faces revealed to the group that he was her son and could feel his work on Rafa's face. She promptly restored his face, causing an overjoyed Misu to embrace him tightly. The two left Forgetful Valley in a boat the next morning.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Misu and Katara waited while Aang tried to pursue the spirit, though he was ejected from the pool by the Mother of Faces. Unhappy at Aang's demands, she ordered the group to leave the forest, sending her animals to attack them. Katara defended Misu against a spirit, saying \"waterbenders have to look out for each other\". Aang suggested that they leave, but Misu refused, holding out hope to gain a face for Rafa. The Avatar inadvertently blew Rafa's mask away, exposing his blank face, which he recognized as the work of Koh, the Face Stealer, and prompting the Mother of Faces to stop her animals upon hearing this. After Aang explained his knowledge of Koh, the Mother of Faces revealed to the group that he was her son and could feel his work on Rafa's face. She promptly restored his face, causing an overjoyed Misu to embrace him tightly. The two left Forgetful Valley in a boat the next morning."
    },
    {
      "body": "Misu never received formal training in waterbending, save for ${link_0} lessons, due to the Northern Water Tribe's staunch gender-related customs. As such, she taught herself combative waterbending, eventually becoming skilled enough to manipulate the plant life in the Forgetful Valley. Misu preferred to use sharp frozen flowers as projectiles.",
      "links": [
        {
          "body": "healing",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "Misu never received formal training in waterbending, save for healing lessons, due to the Northern Water Tribe's staunch gender-related customs. As such, she taught herself combative waterbending, eventually becoming skilled enough to manipulate the plant life in the Forgetful Valley. Misu preferred to use sharp frozen flowers as projectiles."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Rafa_and_Misu",
    "file": "avatar.wikia.com/wiki/Rafa_and_Misu.html",
    "page": "Rafa_and_Misu",
    "title": "Rafa and Misu"
  }
}