{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Dai Li",
      "target": {
        "href": "Category_Dai_Li",
        "page": "Category_Dai_Li"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Earthbending",
      "target": {
        "href": "Category_Earthbending",
        "page": "Category_Earthbending"
      }
    },
    {
      "body": "Equipment",
      "target": {
        "href": "Category_Equipment",
        "page": "Category_Equipment"
      }
    },
    {
      "body": "Fashion",
      "target": {
        "href": "Category_Fashion",
        "page": "Category_Fashion"
      }
    },
    {
      "body": "Objects",
      "target": {
        "href": "Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Weapons",
      "target": {
        "href": "Category_Weapons",
        "page": "Category_Weapons"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Rock gloves are the favored weapons of the ${link_0} as they offer the agents a wide range of possibilities, ranging from aiding their stealth to making an arrest.",
      "links": [
        {
          "body": "Dai Li",
          "key": "${link_0}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "Rock gloves are the favored weapons of the Dai Li as they offer the agents a wide range of possibilities, ranging from aiding their stealth to making an arrest."
    },
    {
      "body": "Rock gloves are the favored weapons of ${link_0}'s secret police force, known as the ${link_1}. The Dai Li agents all wear gloves, each made from individual stone tiles covering their hands. Via ${link_2}, they provide long-range attacks, enabling agents to throw stone punches at an opponents from across a room. Agents can also use their bending to bond the gloves with stone walls or other earthen material, allowing them to scale terrain with ease.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_1}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Rock gloves are the favored weapons of Ba Sing Se's secret police force, known as the Dai Li. The Dai Li agents all wear gloves, each made from individual stone tiles covering their hands. Via earthbending, they provide long-range attacks, enabling agents to throw stone punches at an opponents from across a room. Agents can also use their bending to bond the gloves with stone walls or other earthen material, allowing them to scale terrain with ease."
    },
    {
      "body": "Besides assault purposes, the gloves can be used for stealth or capture purposes, either snatching an enemy from a distance without risking detection, or locking into cuffs around an arrested victim's wrists or ankles. A glove's individual tiles can be shot like darts, with enough force for each to embed itself into walls. The strength of the glove also proves effective for defense against sharp weapons, as seen when a Dai Li agent caught the blade of one of ${link_0}'s ${link_1} in his palm. The tiled parts of the gloves do not appear to have definite shapes, as a modified form was used to capture ${link_2} as he attempted to fly away, forming a solid mold around his body.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        },
        {
          "body": "hook swords",
          "key": "${link_1}",
          "target": {
            "href": "Hook_swords",
            "page": "Hook_swords"
          }
        },
        {
          "body": "Momo",
          "key": "${link_2}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "Besides assault purposes, the gloves can be used for stealth or capture purposes, either snatching an enemy from a distance without risking detection, or locking into cuffs around an arrested victim's wrists or ankles. A glove's individual tiles can be shot like darts, with enough force for each to embed itself into walls. The strength of the glove also proves effective for defense against sharp weapons, as seen when a Dai Li agent caught the blade of one of Jet's hook swords in his palm. The tiled parts of the gloves do not appear to have definite shapes, as a modified form was used to capture Momo as he attempted to fly away, forming a solid mold around his body."
    },
    {
      "body": "The rock gloves could be morphed into handcuffs.",
      "links": [],
      "text": "The rock gloves could be morphed into handcuffs."
    },
    {
      "body": "The rock gloves have been a favored technique of the Dai Li since the founding of the agents by ${link_0} ${link_1}, as some of the first agents were seen training with them and exerting enough force to even crack a wall while ascending it.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        }
      ],
      "text": "The rock gloves have been a favored technique of the Dai Li since the founding of the agents by Avatar Kyoshi, as some of the first agents were seen training with them and exerting enough force to even crack a wall while ascending it."
    },
    {
      "body": "When Jet was determined to expose ${link_0} and ${link_1} for the ${link_2} they were, he started a fight against the banished ${link_3}. However, the fight was broken up when two Dai Li agents arrived and arrested Jet. The latter tried to fight them off, but the agent caught the blade of his sword on his rock glove, and proceeded to bind Jet's hands behind his back with the gloves. They brought him to their base underneath ${link_4}, where they reshaped their gloves to bind Jet to a chair and gag him, while another agent started the ${link_5} procedure.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebenders",
          "key": "${link_2}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "prince",
          "key": "${link_3}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Lake Laogai",
          "key": "${link_4}",
          "target": {
            "href": "Lake_Laogai",
            "page": "Lake_Laogai"
          }
        },
        {
          "body": "brainwashing",
          "key": "${link_5}",
          "target": {
            "href": "Brainwashing",
            "page": "Brainwashing"
          }
        }
      ],
      "text": "When Jet was determined to expose Iroh and Zuko for the firebenders they were, he started a fight against the banished prince. However, the fight was broken up when two Dai Li agents arrived and arrested Jet. The latter tried to fight them off, but the agent caught the blade of his sword on his rock glove, and proceeded to bind Jet's hands behind his back with the gloves. They brought him to their base underneath Lake Laogai, where they reshaped their gloves to bind Jet to a chair and gag him, while another agent started the brainwashing procedure."
    },
    {
      "body": "After Aang and ${link_0} infiltrated ${link_1} ${link_2}'s party for ${link_3}, the Dai Li apprehended the children by using their rock gloves. This was accomplished by cuffing ${link_4}'s hands behind his back, while two other agents shot their gloves at ${link_5} and ${link_6}, simultaneously gagging and dragging them out of the room.",
      "links": [
        {
          "body": "his friends",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_1}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Kuei",
          "key": "${link_2}",
          "target": {
            "href": "Kuei",
            "page": "Kuei"
          }
        },
        {
          "body": "his pet",
          "key": "${link_3}",
          "target": {
            "href": "Bosco",
            "page": "Bosco"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_4}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Toph",
          "key": "${link_5}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Katara",
          "key": "${link_6}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "After Aang and his friends infiltrated Earth King Kuei's party for his pet, the Dai Li apprehended the children by using their rock gloves. This was accomplished by cuffing Sokka's hands behind his back, while two other agents shot their gloves at Toph and Katara, simultaneously gagging and dragging them out of the room."
    },
    {
      "body": "In order to find ${link_0} before the Avatar could, Zuko, disguised as the ${link_1}, provoked a Dai Li agent by running into him. The agent promptly gave chase, and when he turned into an alley, he shot one of his gloves at a hay-filled puppet he thought was the Blue Spirit. While the glove was airborne, the agent could still alter its shape from a stretched out hand to a closed fist just by the same motions with his hand.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Blue Spirit",
          "key": "${link_1}",
          "target": {
            "href": "Zuko#Other_skills",
            "page": "Zuko"
          }
        }
      ],
      "text": "In order to find Appa before the Avatar could, Zuko, disguised as the Blue Spirit, provoked a Dai Li agent by running into him. The agent promptly gave chase, and when he turned into an alley, he shot one of his gloves at a hay-filled puppet he thought was the Blue Spirit. While the glove was airborne, the agent could still alter its shape from a stretched out hand to a closed fist just by the same motions with his hand."
    },
    {
      "body": "With Jet's help, Team Avatar and the reformed ${link_0}, ${link_1} and ${link_2}, were able to track down the Dai Li's secret base. However, as they entered a large room, several Dai Li agents were hanging on the ceiling by using their rock gloves and shoes. During the ensuing battle, the Dai Li heavily favored this technique again; however, the gloves often ended up being destroyed by various counterattack before they could do some actual damage.",
      "links": [
        {
          "body": "Freedom Fighters",
          "key": "${link_0}",
          "target": {
            "href": "Freedom_Fighters",
            "page": "Freedom_Fighters"
          }
        },
        {
          "body": "Smellerbee",
          "key": "${link_1}",
          "target": {
            "href": "Smellerbee",
            "page": "Smellerbee"
          }
        },
        {
          "body": "Longshot",
          "key": "${link_2}",
          "target": {
            "href": "Longshot",
            "page": "Longshot"
          }
        }
      ],
      "text": "With Jet's help, Team Avatar and the reformed Freedom Fighters, Smellerbee and Longshot, were able to track down the Dai Li's secret base. However, as they entered a large room, several Dai Li agents were hanging on the ceiling by using their rock gloves and shoes. During the ensuing battle, the Dai Li heavily favored this technique again; however, the gloves often ended up being destroyed by various counterattack before they could do some actual damage."
    },
    {
      "body": "The ${link_0} prepared to fire their gloves to arrest ${link_1}.",
      "links": [
        {
          "body": "Dai Li",
          "key": "${link_0}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "The Dai Li prepared to fire their gloves to arrest Team Avatar."
    },
    {
      "body": "Determined to tell Earth King Kuei the truth about ${link_0}, the Dai Li, and the ${link_1}, Team Avatar stormed the ${link_2}. Inside, the Dai Li formed a last line of defense, and after Team Avatar surrendered, they used their gloves to bound their wrists. However, Aang was able to still move his hand by bending the rock tiles himself.",
      "links": [
        {
          "body": "Long Feng",
          "key": "${link_0}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_1}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Earth Kingdom Royal Palace",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        }
      ],
      "text": "Determined to tell Earth King Kuei the truth about Long Feng, the Dai Li, and the Hundred Year War, Team Avatar stormed the Earth Kingdom Royal Palace. Inside, the Dai Li formed a last line of defense, and after Team Avatar surrendered, they used their gloves to bound their wrists. However, Aang was able to still move his hand by bending the rock tiles himself."
    },
    {
      "body": "When ${link_0} took over control of the Dai Li, she had the agents apprehend her brother and uncle. While they attempted to escape, the agents attacked them by shooting the individual tiles of their rock gloves at them at high speed. The tiles missed, but severely damaged the wall they embedded themselves in. After Iroh jumped out a window to escape, Zuko remained behind and tried to challenge his sister to an ${link_1}. However, she declined and the Dai Li swiftly bound Zuko's hand and feet to the ground using the rock gloves.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_1}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        }
      ],
      "text": "When Azula took over control of the Dai Li, she had the agents apprehend her brother and uncle. While they attempted to escape, the agents attacked them by shooting the individual tiles of their rock gloves at them at high speed. The tiles missed, but severely damaged the wall they embedded themselves in. After Iroh jumped out a window to escape, Zuko remained behind and tried to challenge his sister to an Agni Kai. However, she declined and the Dai Li swiftly bound Zuko's hand and feet to the ground using the rock gloves."
    },
    {
      "body": "After the ${link_0} of Ba Sing Se, the Dai Li used their rock gloves to slide off the Great Walls of the city to weaken them in order to bring them down.",
      "links": [
        {
          "body": "fall",
          "key": "${link_0}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        }
      ],
      "text": "After the fall of Ba Sing Se, the Dai Li used their rock gloves to slide off the Great Walls of the city to weaken them in order to bring them down."
    },
    {
      "body": "After returning to Ba Sing Se under the command of Earth Queen ${link_0}, the Dai Li continued to use rock gloves as part of their weaponry. In 171 ${link_1}, agents used the gloves to capture the ${link_2} ${link_3} for the queen's army, and later attempted to apprehend the ${link_4} with rock gloves upon her orders, only for their attacks to be thrown back at them by ${link_5}.",
      "links": [
        {
          "body": "Hou-Ting",
          "key": "${link_0}",
          "target": {
            "href": "Hou-Ting",
            "page": "Hou-Ting"
          }
        },
        {
          "body": "AG",
          "key": "${link_1}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "airbender",
          "key": "${link_2}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Kai",
          "key": "${link_3}",
          "target": {
            "href": "Kai",
            "page": "Kai"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_4}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "Ghazan",
          "key": "${link_5}",
          "target": {
            "href": "Ghazan",
            "page": "Ghazan"
          }
        }
      ],
      "text": "After returning to Ba Sing Se under the command of Earth Queen Hou-Ting, the Dai Li continued to use rock gloves as part of their weaponry. In 171 AG, agents used the gloves to capture the airbender Kai for the queen's army, and later attempted to apprehend the Red Lotus with rock gloves upon her orders, only for their attacks to be thrown back at them by Ghazan."
    },
    {
      "body": "Being made of rock, the gloves were obsolete as a weapon against another earthbender, as they could easily destroy the gloves while coursing through the air and render them ineffective as handcuffs, as Aang easily disassembled them to wave at the Earth King before reforming them. The Dai Li were aware of this weakness, however, as they utilized metal cuffs and chains to secure their targets when they arrested known earthbenders, such as Long Feng or the members of the ${link_0}.",
      "links": [
        {
          "body": "Council of Five",
          "key": "${link_0}",
          "target": {
            "href": "Council_of_Five",
            "page": "Council_of_Five"
          }
        }
      ],
      "text": "Being made of rock, the gloves were obsolete as a weapon against another earthbender, as they could easily destroy the gloves while coursing through the air and render them ineffective as handcuffs, as Aang easily disassembled them to wave at the Earth King before reforming them. The Dai Li were aware of this weakness, however, as they utilized metal cuffs and chains to secure their targets when they arrested known earthbenders, such as Long Feng or the members of the Council of Five."
    },
    {
      "body": "Additionally, once an agent has shot away his glove, he needs to regather some earth to form a new one. Although this does not take long, it does render the bender without a glove at his disposal for offensive or defensive actions.",
      "links": [],
      "text": "Additionally, once an agent has shot away his glove, he needs to regather some earth to form a new one. Although this does not take long, it does render the bender without a glove at his disposal for offensive or defensive actions."
    },
    {
      "body": "The ${link_0} could also use rock shoes to glide across the ground.",
      "links": [
        {
          "body": "Dai Li",
          "key": "${link_0}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "The Dai Li could also use rock shoes to glide across the ground."
    },
    {
      "body": "A variation of the rock glove technique is the usage of rock shoes. Dai Li agents utilize these shoes to slide down and cling to walls, and they can also suspend themselves from ceilings. Using both their rock-covered hands and feet, they can stick to any plane made of earth from virtually any angle.",
      "links": [],
      "text": "A variation of the rock glove technique is the usage of rock shoes. Dai Li agents utilize these shoes to slide down and cling to walls, and they can also suspend themselves from ceilings. Using both their rock-covered hands and feet, they can stick to any plane made of earth from virtually any angle."
    },
    {
      "body": "A variety of these techniques were used during the battle underneath Lake Laogai, in which the Dai Li attempted to arrest Team Avatar and the reformed Freedom Fighters. In this battle, two agents swiftly ascended the walls on either side of Toph for an attack, while another agent was seen using his shoe as he would a rock glove when he kicked it toward Longshot. They later used this technique again to rapidly slide over the ground to detain the members of Team Avatar who had invaded the Royal Palace, as well as to cut off Aang's charge at Azula back in the ${link_0} during the ${link_1}.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Day of Black Sun",
          "key": "${link_1}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        }
      ],
      "text": "A variety of these techniques were used during the battle underneath Lake Laogai, in which the Dai Li attempted to arrest Team Avatar and the reformed Freedom Fighters. In this battle, two agents swiftly ascended the walls on either side of Toph for an attack, while another agent was seen using his shoe as he would a rock glove when he kicked it toward Longshot. They later used this technique again to rapidly slide over the ground to detain the members of Team Avatar who had invaded the Royal Palace, as well as to cut off Aang's charge at Azula back in the Fire Nation during the Day of Black Sun."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Rock_gloves",
    "file": "avatar.wikia.com/wiki/Rock_gloves.html",
    "page": "Rock_gloves",
    "title": "Rock gloves"
  }
}