{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Fauna",
      "target": {
        "href": "Category_Fauna",
        "page": "Category_Fauna"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Hybridized creatures",
      "target": {
        "href": "Category_Hybridized_creatures",
        "page": "Category_Hybridized_creatures"
      }
    }
  ],
  "facts": [
    {
      "key": "Habitat",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Si Wong Desert",
              "key": "${link_0}",
              "target": {
                "href": "Si_Wong_Desert",
                "page": "Si_Wong_Desert"
              }
            }
          ],
          "text": "Si Wong Desert",
          "value": "${link_0}",
          "value_text": "Si Wong Desert"
        }
      ]
    },
    {
      "key": "First Appearance",
      "value": [
        {
          "body": "\"${link_0}\" (only appearance)",
          "extra": "(only appearance)",
          "extra_text": "(only appearance)",
          "links": [
            {
              "body": "Long Live the Queen",
              "key": "${link_0}",
              "target": {
                "href": "Long_Live_the_Queen",
                "page": "Long_Live_the_Queen"
              }
            }
          ],
          "text": "\"Long Live the Queen\" (only appearance)",
          "value": "\"${link_0}\"",
          "value_text": "\"Long Live the Queen\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The sand shark is a large carnivorous ${link_0} that lurks underneath the surface of the ${link_1}, searching through the sand for mobile prey.",
      "links": [
        {
          "body": "predator",
          "key": "${link_0}",
          "target": {
            "href": "Fauna_in_the_World_of_Avatar",
            "page": "Fauna_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_1}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        }
      ],
      "text": "The sand shark is a large carnivorous predator that lurks underneath the surface of the Si Wong Desert, searching through the sand for mobile prey."
    },
    {
      "body": "A sand shark nearly succeeded in swallowing ${link_0}, ${link_1}, and the stranded ${link_2} crew when they were making their way out of the ${link_3} on a makeshift ${link_4}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Ba Sing Se airship",
          "key": "${link_2}",
          "target": {
            "href": "Ba_Sing_Se_airship",
            "page": "Ba_Sing_Se_airship"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_3}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        },
        {
          "body": "sand-sailer",
          "key": "${link_4}",
          "target": {
            "href": "Sand-sailer",
            "page": "Sand-sailer"
          }
        }
      ],
      "text": "A sand shark nearly succeeded in swallowing Korra, Asami, and the stranded Ba Sing Se airship crew when they were making their way out of the Si Wong Desert on a makeshift sand-sailer."
    },
    {
      "body": "Moving underneath the surface in the fourth quadrant of the Si Wong Desert, a sand shark encountered the crashed airship heading toward ${link_0} with ${link_1} ${link_2} and ${link_3} but remained inconspicuous. Shortly after Asami Sato spearheaded the repair of the vehicle, the creature burst out of the sand and lifted the vessel into the air before snapping it in half and dragging it back to the ground. The sand shark returned later to pursue the airship crew, Asami, and Korra after they manufactured a makeshift ${link_4}. After two failed attempts to swallow the sand-sailer and its passengers, the sand shark vanished underneath the sand only to reemerge moments later underneath the vessel, tossing it up into the air. Although it nearly swallowed the craft, the sand shark was deterred by Korra's ${link_5} and forced to return underneath the sands.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Asami Sato",
          "key": "${link_3}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "sand-sailer",
          "key": "${link_4}",
          "target": {
            "href": "Sand-sailer",
            "page": "Sand-sailer"
          }
        },
        {
          "body": "firebending",
          "key": "${link_5}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Moving underneath the surface in the fourth quadrant of the Si Wong Desert, a sand shark encountered the crashed airship heading toward Ba Sing Se with Avatar Korra and Asami Sato but remained inconspicuous. Shortly after Asami Sato spearheaded the repair of the vehicle, the creature burst out of the sand and lifted the vessel into the air before snapping it in half and dragging it back to the ground. The sand shark returned later to pursue the airship crew, Asami, and Korra after they manufactured a makeshift sand-sailer. After two failed attempts to swallow the sand-sailer and its passengers, the sand shark vanished underneath the sand only to reemerge moments later underneath the vessel, tossing it up into the air. Although it nearly swallowed the craft, the sand shark was deterred by Korra's firebending and forced to return underneath the sands."
    },
    {
      "body": "The sand shark's fins are adapted for maneuverability and speed through the sands of the ${link_0}.",
      "links": [
        {
          "body": "Si Wong Desert",
          "key": "${link_0}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        }
      ],
      "text": "The sand shark's fins are adapted for maneuverability and speed through the sands of the Si Wong Desert."
    },
    {
      "body": "The sand shark is an enormous creature that surpasses a ${link_0} in size. It is primarily brown dorsally while cream in coloration ventrally, allowing the creature to remain largely inconspicuous in its preferred environment. The sand shark possesses a pair of long pectoral fins and pairs of short, terminally-located pelvic and anal fins that work together to maintain speed and stabilize movement in the sand. It is easily identifiable by a large central dorsal fin adjoined both anteriorly and posteriorly by spiny keels, which further aid in maneuverability.",
      "links": [
        {
          "body": "Ba Sing Se airship",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se_airship",
            "page": "Ba_Sing_Se_airship"
          }
        }
      ],
      "text": "The sand shark is an enormous creature that surpasses a Ba Sing Se airship in size. It is primarily brown dorsally while cream in coloration ventrally, allowing the creature to remain largely inconspicuous in its preferred environment. The sand shark possesses a pair of long pectoral fins and pairs of short, terminally-located pelvic and anal fins that work together to maintain speed and stabilize movement in the sand. It is easily identifiable by a large central dorsal fin adjoined both anteriorly and posteriorly by spiny keels, which further aid in maneuverability."
    },
    {
      "body": "In addition to its locomotory adaptations, the sand shark possesses an enlarged gape extending to nearly half of its body length and containing eight rows of tooth whorls: a row for each side of the upper mouth flap, two rows for each of the jaws, and a row for each of the cheeks. The tooth whorls are embedded within numerous sets of brightly-colored musculature that allow the sand shark to collapse the mouth against the side of the face during movement. Interestingly, the sand shark has three gill slits atypical of other sharks and also largely unnecessary for terrestrial life.",
      "links": [],
      "text": "In addition to its locomotory adaptations, the sand shark possesses an enlarged gape extending to nearly half of its body length and containing eight rows of tooth whorls: a row for each side of the upper mouth flap, two rows for each of the jaws, and a row for each of the cheeks. The tooth whorls are embedded within numerous sets of brightly-colored musculature that allow the sand shark to collapse the mouth against the side of the face during movement. Interestingly, the sand shark has three gill slits atypical of other sharks and also largely unnecessary for terrestrial life."
    },
    {
      "body": "The sand shark is a solitary ambush predator that constantly moves underground in search of prey. It remains largely inconspicuous apart from the distinct dorsal fin that appears when it nears the surface and the movement of nearby dunes when it navigates through the sand. It prefers to leap out of the sand and launch any terrestrial organisms on the surface into the air while it extends its mouth, largely preventing prey from escaping its reach. The sand shark's body shape allows it to move through the sand with relative ease and reach speeds that surpass that of ${link_0}-powered sand-sailers.",
      "links": [
        {
          "body": "airbending",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "The sand shark is a solitary ambush predator that constantly moves underground in search of prey. It remains largely inconspicuous apart from the distinct dorsal fin that appears when it nears the surface and the movement of nearby dunes when it navigates through the sand. It prefers to leap out of the sand and launch any terrestrial organisms on the surface into the air while it extends its mouth, largely preventing prey from escaping its reach. The sand shark's body shape allows it to move through the sand with relative ease and reach speeds that surpass that of airbending-powered sand-sailers."
    },
    {
      "body": "The sand shark mostly resembles members of the order Lamniformes, otherwise known as mackerel sharks, which includes some of the most recognizable species like the great white and mako sharks. Its jaws and predatory behavior bear similarities to that of the sarcastic fringehead, a ray-finned fish endemic to the Pacific Ocean.",
      "links": [],
      "text": "The sand shark mostly resembles members of the order Lamniformes, otherwise known as mackerel sharks, which includes some of the most recognizable species like the great white and mako sharks. Its jaws and predatory behavior bear similarities to that of the sarcastic fringehead, a ray-finned fish endemic to the Pacific Ocean."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Sand_shark",
    "file": "avatar.wikia.com/wiki/Sand_shark.html",
    "page": "Sand_shark",
    "title": "Sand shark"
  }
}