{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Objects",
      "target": {
        "external": false,
        "href": "/wiki/Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Republic City",
      "target": {
        "external": false,
        "href": "/wiki/Category_Republic_City",
        "page": "Category_Republic_City"
      }
    },
    {
      "body": "Vehicles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Vehicles",
        "page": "Category_Vehicles"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The Satomobile is an ${link_0} developed and manufactured by ${link_1}. As ${link_2}'s leading auto-manufacturer, Future Industries features state-of-the-art technology and assembly lines capable of producing over one hundred luxury Satomobiles every day. The automobiles are capable of transporting a driver and several passengers in a carriage over long distances in a manner affordable to the average customer.",
      "links": [
        {
          "body": "automobile",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Motor_vehicle",
            "page": "Motor_vehicle"
          }
        },
        {
          "body": "Future Industries",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries",
            "page": "Future_Industries"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "section": [
        "Satomobile"
      ],
      "text": "The Satomobile is an automobile developed and manufactured by Future Industries. As Republic City's leading auto-manufacturer, Future Industries features state-of-the-art technology and assembly lines capable of producing over one hundred luxury Satomobiles every day. The automobiles are capable of transporting a driver and several passengers in a carriage over long distances in a manner affordable to the average customer."
    },
    {
      "body": "While working as a poor shoe shiner, ${link_0} had the idea to create an automobile company that would mass-produce vehicles and provide transportation for the common man. A wealthy businessman believed in the promises of his enterprise and invested in his idea, thus forming Future Industries. Hiroshi Sato became the first person to popularize a gasoline-powered engine, replacing the steam engines that were unsuitable for small-scale use. His factory produced these cars in great quantity and, in a short time, he had earned his first million ${link_1} in the business.",
      "links": [
        {
          "body": "Hiroshi Sato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "yuans",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Currency#United_Republic_of_Nations",
            "page": "Currency"
          }
        }
      ],
      "section": [
        "Satomobile",
        "Conception and commisioning"
      ],
      "text": "While working as a poor shoe shiner, Hiroshi Sato had the idea to create an automobile company that would mass-produce vehicles and provide transportation for the common man. A wealthy businessman believed in the promises of his enterprise and invested in his idea, thus forming Future Industries. Hiroshi Sato became the first person to popularize a gasoline-powered engine, replacing the steam engines that were unsuitable for small-scale use. His factory produced these cars in great quantity and, in a short time, he had earned his first million yuans in the business."
    },
    {
      "body": "Car — Small form of automobile widely used in Republic City.",
      "links": [],
      "section": [
        "Satomobile",
        "Types"
      ],
      "text": "Car — Small form of automobile widely used in Republic City."
    },
    {
      "body": "Jeep — A doorless utility vehicle for offroad use, typically painted in olive drab color.",
      "links": [],
      "section": [
        "Satomobile",
        "Types"
      ],
      "text": "Jeep — A doorless utility vehicle for offroad use, typically painted in olive drab color."
    },
    {
      "body": "Moped — A type of motorcycle that has a sleek and feminine design. The driver's feet are placed at the front.",
      "links": [],
      "section": [
        "Satomobile",
        "Types"
      ],
      "text": "Moped — A type of motorcycle that has a sleek and feminine design. The driver's feet are placed at the front."
    },
    {
      "body": "Police car — Utilized by the ${link_0}. It bears strong resemblance to regular cars, but has a police insignia, police radio, sirens, as well as a caged back used for transporting criminals. The driver and passenger seats are open to the air and do not have doors. On the back wall of the seating area, there is a barred window that provides a view of the vehicle's interior. Directly above the seats are two sirens which flash red and blue during police operations.",
      "links": [
        {
          "body": "Metalbending Police Force",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        }
      ],
      "section": [
        "Satomobile",
        "Types"
      ],
      "text": "Police car — Utilized by the Metalbending Police Force. It bears strong resemblance to regular cars, but has a police insignia, police radio, sirens, as well as a caged back used for transporting criminals. The driver and passenger seats are open to the air and do not have doors. On the back wall of the seating area, there is a barred window that provides a view of the vehicle's interior. Directly above the seats are two sirens which flash red and blue during police operations."
    },
    {
      "body": "Police carrier — A more bulky police car model made for use in special operations. It is larger in size than its counterpart, black in coloration, and has a round, tiered roof. The caged rear is long and does not have any windows at its entryway. Like police cars, carriers have sirens, but do not have an open-air seating area.",
      "links": [],
      "section": [
        "Satomobile",
        "Types"
      ],
      "text": "Police carrier — A more bulky police car model made for use in special operations. It is larger in size than its counterpart, black in coloration, and has a round, tiered roof. The caged rear is long and does not have any windows at its entryway. Like police cars, carriers have sirens, but do not have an open-air seating area."
    },
    {
      "body": "Race car — Type of car built for thrill seekers. They come in yellow and red and exhibit a sleek design, along with a high-powered engine that allows for faster speeds but can nonetheless help maneuver it smoothly around a race track. Race cars have two black wheels located at the front and back of the vehicle.",
      "links": [],
      "section": [
        "Satomobile",
        "Types"
      ],
      "text": "Race car — Type of car built for thrill seekers. They come in yellow and red and exhibit a sleek design, along with a high-powered engine that allows for faster speeds but can nonetheless help maneuver it smoothly around a race track. Race cars have two black wheels located at the front and back of the vehicle."
    },
    {
      "body": "Roadster — Type of open-air luxury car. They are pink in coloration, with black borders and white patterns or designs. Roadsters have a white, collapsible roof that is attached to the rear of the vehicle. A spare wheel can be found on the automobile's exterior side, near the left-hand side door.",
      "links": [],
      "section": [
        "Satomobile",
        "Types"
      ],
      "text": "Roadster — Type of open-air luxury car. They are pink in coloration, with black borders and white patterns or designs. Roadsters have a white, collapsible roof that is attached to the rear of the vehicle. A spare wheel can be found on the automobile's exterior side, near the left-hand side door."
    },
    {
      "body": "Sports car — Type of luxury car owned primarily by upper-class citizens. It is a black open-air automobile with white trimmings, borders, and designs. The car is sleeker and longer in structure than most other Satomobiles, giving it a unique aristocratic design. Furthermore, sports cars have a bumper, four circular headlights of varying size, and four red passenger seats equipped with a radio, including those utilized by the police. White pipes can be found on the exterior bottom of the left-hand doors.",
      "links": [],
      "section": [
        "Satomobile",
        "Types"
      ],
      "text": "Sports car — Type of luxury car owned primarily by upper-class citizens. It is a black open-air automobile with white trimmings, borders, and designs. The car is sleeker and longer in structure than most other Satomobiles, giving it a unique aristocratic design. Furthermore, sports cars have a bumper, four circular headlights of varying size, and four red passenger seats equipped with a radio, including those utilized by the police. White pipes can be found on the exterior bottom of the left-hand doors."
    },
    {
      "body": "Taxi cab — Provides transportation to citizens who cannot afford cars and offers romantic rides in ${link_0}. With an elevated rectangular design and small wheels, taxi cabs better resemble buses, though the passenger compartments are open to the air and the driver's seat is at the vehicle's upper rear. They are generally green and brown in coloration with yellow or red trimmings for the roof.",
      "links": [
        {
          "body": "Avatar Korra Park",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar_Korra_Park",
            "page": "Avatar_Korra_Park"
          }
        }
      ],
      "section": [
        "Satomobile",
        "Types"
      ],
      "text": "Taxi cab — Provides transportation to citizens who cannot afford cars and offers romantic rides in Avatar Korra Park. With an elevated rectangular design and small wheels, taxi cabs better resemble buses, though the passenger compartments are open to the air and the driver's seat is at the vehicle's upper rear. They are generally green and brown in coloration with yellow or red trimmings for the roof."
    },
    {
      "body": "Triad car — Type of car that is not designed for racing, but can reach a high speed. An expensive and luxurious display of colorful and intricate artistic designs, triad cars are utilized by gang members to exemplify their wealth and territorial dominance. The ${link_0} exclusively uses red cars; these cars have a sleek design and a bright, golden lion turtle insignia at the front grill. The gold-painted engine is located behind this plate, and two headlights are off to the sides. Overall, the vehicle's design is sleek and streamlined, although the seating area, which is at the center, is rather limited in capacity.",
      "links": [
        {
          "body": "Triple Threat Triad",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        }
      ],
      "section": [
        "Satomobile",
        "Types"
      ],
      "text": "Triad car — Type of car that is not designed for racing, but can reach a high speed. An expensive and luxurious display of colorful and intricate artistic designs, triad cars are utilized by gang members to exemplify their wealth and territorial dominance. The Triple Threat Triad exclusively uses red cars; these cars have a sleek design and a bright, golden lion turtle insignia at the front grill. The gold-painted engine is located behind this plate, and two headlights are off to the sides. Overall, the vehicle's design is sleek and streamlined, although the seating area, which is at the center, is rather limited in capacity."
    },
    {
      "body": "${link_0} made use of ${link_1}'s Satomobile as a mode of transportation.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "section": [
        "Satomobile",
        "Trivia"
      ],
      "text": "Team Avatar made use of Asami's Satomobile as a mode of transportation."
    },
    {
      "body": "The Satomobiles quickly became the must-have vehicle and were in high demand. As a result, ${link_0} created the Cabbage Car, a lower-cost compact car, to counter the Satomobiles' success.",
      "links": [
        {
          "body": "Cabbage Corp",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Cabbage_Corp",
            "page": "Cabbage_Corp"
          }
        }
      ],
      "section": [
        "Satomobile",
        "Trivia"
      ],
      "text": "The Satomobiles quickly became the must-have vehicle and were in high demand. As a result, Cabbage Corp created the Cabbage Car, a lower-cost compact car, to counter the Satomobiles' success."
    },
    {
      "body": "A Satomobile could be seen in the cargo hold of the ${link_0} that ${link_1} and ${link_2} stowed away on while traveling to Republic City.",
      "links": [
        {
          "body": "steamship",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Steamship",
            "page": "Steamship"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Naga",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Naga",
            "page": "Naga"
          }
        }
      ],
      "section": [
        "Satomobile",
        "Trivia"
      ],
      "text": "A Satomobile could be seen in the cargo hold of the steamship that Korra and Naga stowed away on while traveling to Republic City."
    },
    {
      "body": "Satomobiles bear strong resemblance to the ${link_0}, one of the first mass-produced automobiles. The roadsters in particular look similar to the ${link_1}, a sports car from the 1930s.",
      "links": [
        {
          "body": "Ford Model T",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Ford_Model_T",
            "page": "http://en.wikipedia.org/wiki/Ford_Model_T"
          }
        },
        {
          "body": "Duesenberg J Murphy convertible",
          "key": "${link_1}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Duesenberg#Model_J_.281928.E2.80.931937.29",
            "page": "http://en.wikipedia.org/wiki/Duesenberg"
          }
        }
      ],
      "section": [
        "Satomobile",
        "Trivia"
      ],
      "text": "Satomobiles bear strong resemblance to the Ford Model T, one of the first mass-produced automobiles. The roadsters in particular look similar to the Duesenberg J Murphy convertible, a sports car from the 1930s."
    },
    {
      "body": "The jeep bears a resemblance to the real-world World War II-era ${link_0}.",
      "links": [
        {
          "body": "Willys MB",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Willys_MB",
            "page": "http://en.wikipedia.org/wiki/Willys_MB"
          }
        }
      ],
      "section": [
        "Satomobile",
        "Trivia"
      ],
      "text": "The jeep bears a resemblance to the real-world World War II-era Willys MB."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Hiroshi Sato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        }
      ],
      "section": [
        "Satomobile",
        "See also"
      ],
      "text": "Hiroshi Sato"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Motor vehicles",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Motor_vehicle",
            "page": "Motor_vehicle"
          }
        }
      ],
      "section": [
        "Satomobile",
        "See also"
      ],
      "text": "Motor vehicles"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Satomobile",
    "file": "avatar.wikia.com/wiki/Satomobile.html",
    "page": "Satomobile",
    "title": "Satomobile"
  }
}