{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "World of Avatar",
      "target": {
        "href": "Category_World_of_Avatar",
        "page": "Category_World_of_Avatar"
      }
    }
  ],
  "facts": [
    {
      "key": "Type",
      "value": [
        {
          "body": "Scientific knowledge",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Scientific knowledge",
          "value": "Scientific knowledge",
          "value_text": "Scientific knowledge"
        }
      ]
    },
    {
      "key": "Examples",
      "value": [
        {
          "body": "Anthropology",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Anthropology",
          "value": "Anthropology",
          "value_text": "Anthropology"
        },
        {
          "body": "Astronomy",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Astronomy",
          "value": "Astronomy",
          "value_text": "Astronomy"
        },
        {
          "body": "Chemistry",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Chemistry",
          "value": "Chemistry",
          "value_text": "Chemistry"
        },
        {
          "body": "Construction",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Construction",
          "value": "Construction",
          "value_text": "Construction"
        },
        {
          "body": "Medicine",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Medicine",
          "value": "Medicine",
          "value_text": "Medicine"
        },
        {
          "body": "Technology",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Technology",
          "value": "Technology",
          "value_text": "Technology"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Knowledge of science among the majority of the people of the ${link_0} was rather limited before the ${link_1}; in the years following the conflict, however, the prevalence of science and technology increased greatly. Despite this development, some areas of science are still somewhat limited and there is much room for advancement and improvement. Some prominent people in the field include the ${link_2}, ${link_3} and ${link_4}, ${link_5}, ${link_6} ${link_7}, ${link_8}, and ${link_9}.",
      "links": [
        {
          "body": "Avatar World",
          "key": "${link_0}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_1}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "mechanist",
          "key": "${link_2}",
          "target": {
            "href": "Mechanist",
            "page": "Mechanist"
          }
        },
        {
          "body": "Hiroshi",
          "key": "${link_3}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Asami Sato",
          "key": "${link_4}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_5}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "War Minister",
          "key": "${link_6}",
          "target": {
            "href": "War_Minister",
            "page": "War_Minister"
          }
        },
        {
          "body": "Qin",
          "key": "${link_7}",
          "target": {
            "href": "Qin",
            "page": "Qin"
          }
        },
        {
          "body": "Baatar Jr.",
          "key": "${link_8}",
          "target": {
            "href": "Baatar_Jr",
            "page": "Baatar_Jr"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_9}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Knowledge of science among the majority of the people of the Avatar World was rather limited before the Hundred Year War; in the years following the conflict, however, the prevalence of science and technology increased greatly. Despite this development, some areas of science are still somewhat limited and there is much room for advancement and improvement. Some prominent people in the field include the mechanist, Hiroshi and Asami Sato, Varrick, War Minister Qin, Baatar Jr., and Sokka."
    },
    {
      "body": "The door to the ${link_0} sanctuary is an example of the ${link_1}' scientific knowledge.",
      "links": [
        {
          "body": "Southern Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Air_Temple",
            "page": "Southern_Air_Temple"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_1}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "text": "The door to the Southern Air Temple sanctuary is an example of the Air Nomads' scientific knowledge."
    },
    {
      "body": "The Air Nomads did not have many known scientific breakthroughs or technological advancements, and the pieces of technology they were known to possess relied heavily on their bending abilities to operate.",
      "links": [],
      "text": "The Air Nomads did not have many known scientific breakthroughs or technological advancements, and the pieces of technology they were known to possess relied heavily on their bending abilities to operate."
    },
    {
      "body": "All of the cultures have outstanding examples of building construction, but it is not clear how the Air Nomads' distinctive temples were built. Most curious of all is the ${link_0}, which is anchored from an overhanging cliff and appears upside down to casual observers.",
      "links": [
        {
          "body": "Western Air Temple",
          "key": "${link_0}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "text": "All of the cultures have outstanding examples of building construction, but it is not clear how the Air Nomads' distinctive temples were built. Most curious of all is the Western Air Temple, which is anchored from an overhanging cliff and appears upside down to casual observers."
    },
    {
      "body": "The Air Nomads' scientific knowledge is principally based on the air and its use in bending. They also have a great understanding of the science of ecology, since they try to cause the least amount of environmental damage possible. The Air Nomads have enough technical expertise to produce their ${link_0}, which cause no pollution due to being operated by airbending and natural currents and are thus environmentally friendly.",
      "links": [
        {
          "body": "gliders",
          "key": "${link_0}",
          "target": {
            "href": "Airbender_staff",
            "page": "Airbender_staff"
          }
        }
      ],
      "text": "The Air Nomads' scientific knowledge is principally based on the air and its use in bending. They also have a great understanding of the science of ecology, since they try to cause the least amount of environmental damage possible. The Air Nomads have enough technical expertise to produce their gliders, which cause no pollution due to being operated by airbending and natural currents and are thus environmentally friendly."
    },
    {
      "body": "While not truly science, the Air Nomads practice and develop philosophy persistently, particularly among the ${link_0}. The ${link_1} show stronger spiritual beliefs than the rest of the world, thus drawing them away from science more so than the other nations.",
      "links": [
        {
          "body": "Council of Elders",
          "key": "${link_0}",
          "target": {
            "href": "Council_of_Elders",
            "page": "Council_of_Elders"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "While not truly science, the Air Nomads practice and develop philosophy persistently, particularly among the Council of Elders. The airbenders show stronger spiritual beliefs than the rest of the world, thus drawing them away from science more so than the other nations."
    },
    {
      "body": "The ${link_0}, who continue the Air Nomads' culture, are also drawn away from science in this way, despite the fact that they live in an age of developing science and technology. Nonetheless, they are allowed to study the workings of the material world, as evidenced by Jinora's understanding of the inner workings of a radio.",
      "links": [
        {
          "body": "Air Acolytes",
          "key": "${link_0}",
          "target": {
            "href": "Air_Acolytes",
            "page": "Air_Acolytes"
          }
        }
      ],
      "text": "The Air Acolytes, who continue the Air Nomads' culture, are also drawn away from science in this way, despite the fact that they live in an age of developing science and technology. Nonetheless, they are allowed to study the workings of the material world, as evidenced by Jinora's understanding of the inner workings of a radio."
    },
    {
      "body": "Due to the Fire Nation's frequent raids during the war, the Southern Water Tribe had a limited amount of scientific knowledge and technology. By comparison, the ${link_0} had a far greater level of advancement in such areas, with the most having occurred in ${link_1}. By ${link_2} ${link_3}'s time, both tribes advanced significantly in science and technology.",
      "links": [
        {
          "body": "Northern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "architecture",
          "key": "${link_1}",
          "target": {
            "href": "Architecture_in_the_World_of_Avatar",
            "page": "Architecture_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_3}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Due to the Fire Nation's frequent raids during the war, the Southern Water Tribe had a limited amount of scientific knowledge and technology. By comparison, the Northern Water Tribe had a far greater level of advancement in such areas, with the most having occurred in architecture. By Avatar Korra's time, both tribes advanced significantly in science and technology."
    },
    {
      "body": "The Water Tribes have knowledge of the phases of the moon and the limitations and enhancements they bring to waterbending. They have a vast knowledge of the moon and how it reacts with the ocean's tides. Because most of their power relies on celestial positioning, they know of certain laws of the universe because it has an effect on their ${link_0} abilities.",
      "links": [
        {
          "body": "bending",
          "key": "${link_0}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "The Water Tribes have knowledge of the phases of the moon and the limitations and enhancements they bring to waterbending. They have a vast knowledge of the moon and how it reacts with the ocean's tides. Because most of their power relies on celestial positioning, they know of certain laws of the universe because it has an effect on their bending abilities."
    },
    {
      "body": "The Water Tribe also has moderate geographic knowledge. Their warriors study maps of the world, making themselves familiar with the physical forms of the continents and territories.",
      "links": [],
      "text": "The Water Tribe also has moderate geographic knowledge. Their warriors study maps of the world, making themselves familiar with the physical forms of the continents and territories."
    },
    {
      "body": "${link_0} is an example of the scientific knowledge of the ${link_1}.",
      "links": [
        {
          "body": "Healing",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        }
      ],
      "text": "Healing is an example of the scientific knowledge of the Water Tribe."
    },
    {
      "body": "Some ${link_0} have a special ability known as ${link_1}, which has allowed their nation to develop a strong base in medical science, as anatomical knowledge and an understanding of ${link_2} paths is necessary for healing. Their sophisticated healing techniques allow them to heal wounds and lacerations, diseases brought on by pollution, mental illness, and burns. The Water Tribe also boasts numerous schools which serve to train aspiring healers.",
      "links": [
        {
          "body": "waterbenders",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "healing",
          "key": "${link_1}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        },
        {
          "body": "chi",
          "key": "${link_2}",
          "target": {
            "href": "Chi",
            "page": "Chi"
          }
        }
      ],
      "text": "Some waterbenders have a special ability known as healing, which has allowed their nation to develop a strong base in medical science, as anatomical knowledge and an understanding of chi paths is necessary for healing. Their sophisticated healing techniques allow them to heal wounds and lacerations, diseases brought on by pollution, mental illness, and burns. The Water Tribe also boasts numerous schools which serve to train aspiring healers."
    },
    {
      "body": "${link_0} ${link_1} have either developed a primitive understand of metallurgy or they have traded in order to gain such weapons and other metal tools that they utilize daily, such as Sokka's boomerang. They are also talented at wood and bone working, as many of their weapons and boats consist of those materials. The male members of the Tribes use these crafting talents to create ${link_2} which are used to propose marriage.",
      "links": [
        {
          "body": "Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "citizens",
          "key": "${link_1}",
          "target": {
            "href": "Society_in_the_World_of_Avatar",
            "page": "Society_in_the_World_of_Avatar"
          }
        },
        {
          "body": "betrothal necklaces",
          "key": "${link_2}",
          "target": {
            "href": "Betrothal_necklace",
            "page": "Betrothal_necklace"
          }
        }
      ],
      "text": "Water Tribe citizens have either developed a primitive understand of metallurgy or they have traded in order to gain such weapons and other metal tools that they utilize daily, such as Sokka's boomerang. They are also talented at wood and bone working, as many of their weapons and boats consist of those materials. The male members of the Tribes use these crafting talents to create betrothal necklaces which are used to propose marriage."
    },
    {
      "body": "During the final year of the Hundred Year War, Sokka designed a unique ${link_0}. Though his work did not parallel the Fire Nation's skill in designing war technologies, the idea proved workable with the help of an Earth Kingdom mechanist.",
      "links": [
        {
          "body": "waterbending-powered submarine",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending-powered_submarine",
            "page": "Waterbending-powered_submarine"
          }
        }
      ],
      "text": "During the final year of the Hundred Year War, Sokka designed a unique waterbending-powered submarine. Though his work did not parallel the Fire Nation's skill in designing war technologies, the idea proved workable with the help of an Earth Kingdom mechanist."
    },
    {
      "body": "The ${link_0} is one of the many scientific studies of the ${link_1}.",
      "links": [
        {
          "body": "planetary calendar room",
          "key": "${link_0}",
          "target": {
            "href": "Planetary_calendar_room",
            "page": "Planetary_calendar_room"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "The planetary calendar room is one of the many scientific studies of the Earth Kingdom."
    },
    {
      "body": "The Earth Kingdom is one of the most scientifically advanced nations in the World of Avatar, second only to the Fire Nation prior to United Republic of Nations' foundation.",
      "links": [],
      "text": "The Earth Kingdom is one of the most scientifically advanced nations in the World of Avatar, second only to the Fire Nation prior to United Republic of Nations' foundation."
    },
    {
      "body": "Ba Sing Se University has an anthropology department, where Professor ${link_0} has an important charge. Some people have journeyed into the ${link_1} to better understand desert culture by studying the ${link_2}.",
      "links": [
        {
          "body": "Zei",
          "key": "${link_0}",
          "target": {
            "href": "Zei",
            "page": "Zei"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_1}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        },
        {
          "body": "Sandbender Tribes",
          "key": "${link_2}",
          "target": {
            "href": "Sandbender_Tribes",
            "page": "Sandbender_Tribes"
          }
        }
      ],
      "text": "Ba Sing Se University has an anthropology department, where Professor Zei has an important charge. Some people have journeyed into the Si Wong Desert to better understand desert culture by studying the Sandbender Tribes."
    },
    {
      "body": "The people of the Earth Kingdom have knowledge of the cause of eclipses and can predict them through a ${link_0}, located in ${link_1}'s ${link_2}. Astronomy is one of the many classes taught at ${link_3}.",
      "links": [
        {
          "body": "planetary calendar room",
          "key": "${link_0}",
          "target": {
            "href": "Planetary_calendar_room",
            "page": "Planetary_calendar_room"
          }
        },
        {
          "body": "Wan Shi Tong",
          "key": "${link_1}",
          "target": {
            "href": "Wan_Shi_Tong",
            "page": "Wan_Shi_Tong"
          }
        },
        {
          "body": "Library",
          "key": "${link_2}",
          "target": {
            "href": "Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "Ba Sing Se University",
          "key": "${link_3}",
          "target": {
            "href": "Ba_Sing_Se_University",
            "page": "Ba_Sing_Se_University"
          }
        }
      ],
      "text": "The people of the Earth Kingdom have knowledge of the cause of eclipses and can predict them through a planetary calendar room, located in Wan Shi Tong's Library. Astronomy is one of the many classes taught at Ba Sing Se University."
    },
    {
      "body": "${link_0} are used for medicinal purposes.",
      "links": [
        {
          "body": "Wood frogs",
          "key": "${link_0}",
          "target": {
            "href": "Wood_frog",
            "page": "Wood_frog"
          }
        }
      ],
      "text": "Wood frogs are used for medicinal purposes."
    },
    {
      "body": "The Earth Kingdom has a considerable degree of medical knowledge. Medicinal plants are widely used to treat disease, often being made into herbal ${link_0}, and massage therapy is utilized due to its beneficial qualities. Salves and ointments are used as well to cure rashes, such as when ${link_1} was poisoned by the ${link_2}. Some practices aim to improve the patient's chi flow, and are used to treat a wide variety of diseases. Two such practices are acupuncture, which involves inserting fine needles into specific points to relieve pain, and fire cupping, which relieves stagnant chi by placing heated glass bowls over the acupuncture points to draw out malignant energy.",
      "links": [
        {
          "body": "tea",
          "key": "${link_0}",
          "target": {
            "href": "Tea",
            "page": "Tea"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "white jade bush",
          "key": "${link_2}",
          "target": {
            "href": "White_jade_bush",
            "page": "White_jade_bush"
          }
        }
      ],
      "text": "The Earth Kingdom has a considerable degree of medical knowledge. Medicinal plants are widely used to treat disease, often being made into herbal tea, and massage therapy is utilized due to its beneficial qualities. Salves and ointments are used as well to cure rashes, such as when Iroh was poisoned by the white jade bush. Some practices aim to improve the patient's chi flow, and are used to treat a wide variety of diseases. Two such practices are acupuncture, which involves inserting fine needles into specific points to relieve pain, and fire cupping, which relieves stagnant chi by placing heated glass bowls over the acupuncture points to draw out malignant energy."
    },
    {
      "body": "Surgery is practiced in the Earth Kingdom, and doctors can be found in all larger cities, as well as in many smaller towns, and with military units. The Earth Kingdom has many physicians, who study and treat many physical ailments, as well as ${link_0}, who devote themselves to the study and cultivation of medicinal plants such as sandalwood, banana leaf, and ginger root. Animal products such as frozen ${link_1} are sometimes used in traditional Earth Kingdom medicine.",
      "links": [
        {
          "body": "herbalists",
          "key": "${link_0}",
          "target": {
            "href": "Herbalist",
            "page": "Herbalist"
          }
        },
        {
          "body": "wood frogs",
          "key": "${link_1}",
          "target": {
            "href": "Wood_frog",
            "page": "Wood_frog"
          }
        }
      ],
      "text": "Surgery is practiced in the Earth Kingdom, and doctors can be found in all larger cities, as well as in many smaller towns, and with military units. The Earth Kingdom has many physicians, who study and treat many physical ailments, as well as herbalists, who devote themselves to the study and cultivation of medicinal plants such as sandalwood, banana leaf, and ginger root. Animal products such as frozen wood frogs are sometimes used in traditional Earth Kingdom medicine."
    },
    {
      "body": "In the field of engineering and technology, the mechanist has made many useful and important inventions. The mechanist uses scientific knowledge, such as physics, in his inventions. He has a vast knowledge of mechanical science, making him a great advantage to the Earth Kingdom forces during the Hundred Year War.",
      "links": [],
      "text": "In the field of engineering and technology, the mechanist has made many useful and important inventions. The mechanist uses scientific knowledge, such as physics, in his inventions. He has a vast knowledge of mechanical science, making him a great advantage to the Earth Kingdom forces during the Hundred Year War."
    },
    {
      "body": "The ${link_0} is a feat of scientific ingenuity.",
      "links": [
        {
          "body": "Fire Nation drill",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        }
      ],
      "text": "The Fire Nation drill is a feat of scientific ingenuity."
    },
    {
      "body": "The Fire Nation was the most scientifically advanced nation during the Hundred Year War.",
      "links": [],
      "text": "The Fire Nation was the most scientifically advanced nation during the Hundred Year War."
    },
    {
      "body": "The Fire Nation has a reasonable knowledge of astronomy, predicting the arrival of ${link_0}. They use this knowledge to tap into the power that can be gained when a comet passes close enough to the planet.",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "text": "The Fire Nation has a reasonable knowledge of astronomy, predicting the arrival of Sozin's Comet. They use this knowledge to tap into the power that can be gained when a comet passes close enough to the planet."
    },
    {
      "body": "The Fire Nation also has some knowledge in chemistry, having the ability to manufacture explosive weapons, which are used in ${link_0}. They also have some knowledge about mineralogy and fossil fuels, due to the fact that the Fire Nation Navy operates ships powered by coal, a burnable mineral.",
      "links": [
        {
          "body": "fireworks",
          "key": "${link_0}",
          "target": {
            "href": "Firework",
            "page": "Firework"
          }
        }
      ],
      "text": "The Fire Nation also has some knowledge in chemistry, having the ability to manufacture explosive weapons, which are used in fireworks. They also have some knowledge about mineralogy and fossil fuels, due to the fact that the Fire Nation Navy operates ships powered by coal, a burnable mineral."
    },
    {
      "body": "The Fire Nation also has moderate geographic knowledge. In ${link_0}'s harbor, a painted map of the World of Avatar is placed, which indicates the study and knowledge of the physical forms of the continents and territories. The Fire Nation also understands the geographical areas of the other nations beside their nation, such as the Earth Kingdom, and possibly the Water Tribes due to their fighting in the War.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        }
      ],
      "text": "The Fire Nation also has moderate geographic knowledge. In Zhao's harbor, a painted map of the World of Avatar is placed, which indicates the study and knowledge of the physical forms of the continents and territories. The Fire Nation also understands the geographical areas of the other nations beside their nation, such as the Earth Kingdom, and possibly the Water Tribes due to their fighting in the War."
    },
    {
      "body": "The Fire Nation has considerable medical knowledge. Places that treat mental health patients, such as the one ${link_0} was taken to after the ${link_1}, are examples of medical housing. As in the Earth Kingdom, people also know the health benefits of tea, and relaxing yoga in hot springs.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Comet-Enhanced Agni Kai",
          "key": "${link_1}",
          "target": {
            "href": "Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        }
      ],
      "text": "The Fire Nation has considerable medical knowledge. Places that treat mental health patients, such as the one Azula was taken to after the Comet-Enhanced Agni Kai, are examples of medical housing. As in the Earth Kingdom, people also know the health benefits of tea, and relaxing yoga in hot springs."
    },
    {
      "body": "Metallurgy is the most advanced science in the Fire Nation, due to the fact that they have many weapons, modes of transportation, and devices made of metal, such as the ${link_0}. This gave the Fire Nation a strategic advantage over the other nations, in particular the Earth Kingdom, as ${link_1} were unable to ${link_2}. However, this advantage was lost when ${link_3} discovered the art of metalbending and passed it on to other earthbenders who showed potential, eventually making the skill widespread. The war effort increased the turnout of metal producing sciences tenfold. Factories, such as the one by ${link_4} village, specialized in the creation of metal weaponry.",
      "links": [
        {
          "body": "drill",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        },
        {
          "body": "earthbenders",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "bend metal",
          "key": "${link_2}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "Toph Beifong",
          "key": "${link_3}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Jang Hui",
          "key": "${link_4}",
          "target": {
            "href": "Jang_Hui",
            "page": "Jang_Hui"
          }
        }
      ],
      "text": "Metallurgy is the most advanced science in the Fire Nation, due to the fact that they have many weapons, modes of transportation, and devices made of metal, such as the drill. This gave the Fire Nation a strategic advantage over the other nations, in particular the Earth Kingdom, as earthbenders were unable to bend metal. However, this advantage was lost when Toph Beifong discovered the art of metalbending and passed it on to other earthbenders who showed potential, eventually making the skill widespread. The war effort increased the turnout of metal producing sciences tenfold. Factories, such as the one by Jang Hui village, specialized in the creation of metal weaponry."
    },
    {
      "body": "The United Republic of Nations has shown various inclinations toward science.",
      "links": [],
      "text": "The United Republic of Nations has shown various inclinations toward science."
    },
    {
      "body": "As a result of their unique architecture and advanced knowledge in metal working, the United Republic has made great strides in building construction. The country's wealth of resources has allowed them to develop the skyscraper, a structure that extends vertically instead of the more conventional horizontal style. These towers are quite tall, and rise high above the remainder of the city's buildings. Much unlike the region's traditional styles, skyscrapers have a spire-like design, bearing a pointed peak at the top. This tower has radically changed the layout of the metropolis and even revolutionized the economy, as businesses and facilities now consume less ground space, which has allowed more room for the continued construction of economic industries.",
      "links": [],
      "text": "As a result of their unique architecture and advanced knowledge in metal working, the United Republic has made great strides in building construction. The country's wealth of resources has allowed them to develop the skyscraper, a structure that extends vertically instead of the more conventional horizontal style. These towers are quite tall, and rise high above the remainder of the city's buildings. Much unlike the region's traditional styles, skyscrapers have a spire-like design, bearing a pointed peak at the top. This tower has radically changed the layout of the metropolis and even revolutionized the economy, as businesses and facilities now consume less ground space, which has allowed more room for the continued construction of economic industries."
    },
    {
      "body": "A typical underground ${link_0} facility within the ${link_1} showcases advancements in underground construction.",
      "links": [
        {
          "body": "Equalist",
          "key": "${link_0}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "tunnel network",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City_tunnel_network",
            "page": "Republic_City_tunnel_network"
          }
        }
      ],
      "text": "A typical underground Equalist facility within the tunnel network showcases advancements in underground construction."
    },
    {
      "body": "In accordance to the region's geography, the United Republic has also developed the suspension bridge. These structures are found over waterways all throughout Republic City, and allow for a greater ease of transportation when using vehicles. All bridges have a characteristic arch, an architectural feat which represents the tremendous scientific development Republic City has undergone.",
      "links": [],
      "text": "In accordance to the region's geography, the United Republic has also developed the suspension bridge. These structures are found over waterways all throughout Republic City, and allow for a greater ease of transportation when using vehicles. All bridges have a characteristic arch, an architectural feat which represents the tremendous scientific development Republic City has undergone."
    },
    {
      "body": "Another scientific landmark is the expansive tunnel network that snakes underneath Republic City. The city's advanced construction technology allowed for such a system to be created, and it even has transportation facilities such as a tram network as well as a garage for trucks and motorcycles.",
      "links": [],
      "text": "Another scientific landmark is the expansive tunnel network that snakes underneath Republic City. The city's advanced construction technology allowed for such a system to be created, and it even has transportation facilities such as a tram network as well as a garage for trucks and motorcycles."
    },
    {
      "body": "By 128 AG, medical science has improved greatly. In order to create a new identity after escaping prison, Yakone underwent plastic surgery to alter his appearance, suggesting several medical breakthroughs and discoveries had been made since the end of the War.",
      "links": [],
      "text": "By 128 AG, medical science has improved greatly. In order to create a new identity after escaping prison, Yakone underwent plastic surgery to alter his appearance, suggesting several medical breakthroughs and discoveries had been made since the end of the War."
    },
    {
      "body": "In years prior to 128 AG, metal working was advanced enough to create uniforms and wires for the ${link_0}. Using this metal, the group used cables attached to their armor to move around the capital of the United Republic, ${link_1}, and arrest criminals.",
      "links": [
        {
          "body": "Republic City Police",
          "key": "${link_0}",
          "target": {
            "href": "Republic_City_Police",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "text": "In years prior to 128 AG, metal working was advanced enough to create uniforms and wires for the Republic City Police. Using this metal, the group used cables attached to their armor to move around the capital of the United Republic, Republic City, and arrest criminals."
    },
    {
      "body": "${link_0} were developed by ${link_1} in 170 ${link_2}.",
      "links": [
        {
          "body": "Mecha tanks",
          "key": "${link_0}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_1}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "AG",
          "key": "${link_2}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "Mecha tanks were developed by Hiroshi Sato in 170 AG."
    },
    {
      "body": "By 138 AG, metal working was advanced enough to allow automobiles to be made from metal. These automobiles were soon put into processing and were available for the common citizen.",
      "links": [],
      "text": "By 138 AG, metal working was advanced enough to allow automobiles to be made from metal. These automobiles were soon put into processing and were available for the common citizen."
    },
    {
      "body": "By 170 AG, metal working had advanced to the point where ${link_0} could be made from platinum and was able to be infused with the necessary electronics that would allow one to control it from the inside.",
      "links": [
        {
          "body": "mecha tanks",
          "key": "${link_0}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        }
      ],
      "text": "By 170 AG, metal working had advanced to the point where mecha tanks could be made from platinum and was able to be infused with the necessary electronics that would allow one to control it from the inside."
    },
    {
      "body": "The general knowledge of physics has developed greatly to the point where radiation and sound waves were no longer a mystery.",
      "links": [],
      "text": "The general knowledge of physics has developed greatly to the point where radiation and sound waves were no longer a mystery."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Science_in_the_World_of_Avatar",
    "file": "avatar.wikia.com/wiki/Science_in_the_World_of_Avatar.html",
    "page": "Science_in_the_World_of_Avatar",
    "title": "Science in the World of Avatar"
  }
}