{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "href": "Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Objects",
      "target": {
        "href": "Category_Objects",
        "page": "Category_Objects"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} accidentally discovered the hidden message on the scroll by throwing the parchment atop a lamp.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Zuko accidentally discovered the hidden message on the scroll by throwing the parchment atop a lamp."
    },
    {
      "body": "The scroll was a message delivered to ${link_0}'s bedroom by a mysterious, cloaked figure.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "The scroll was a message delivered to Zuko's bedroom by a mysterious, cloaked figure."
    },
    {
      "body": "When this scroll was left for Zuko, the ${link_0} began to chase the mysterious figure until he discovered that it was left at his doorstep. The message on the piece of parchment read: \"You need to know the story of your great-grandfather's demise. It will reveal your own destiny.\"",
      "links": [
        {
          "body": "prince",
          "key": "${link_0}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "text": "When this scroll was left for Zuko, the prince began to chase the mysterious figure until he discovered that it was left at his doorstep. The message on the piece of parchment read: \"You need to know the story of your great-grandfather's demise. It will reveal your own destiny.\""
    },
    {
      "body": "Unable to make sense of the meaning of the message, an annoyed Zuko threw the scroll away. As it landed on a nearby lamp, the light revealed a hidden message in the center of the scroll: \"The ${link_0} keep the secret history in the ${link_1}.\" Now knowing where to go, Zuko decided to investigate his great-grandfather's death, and ventured down the Dragonbone Catacombs.",
      "links": [
        {
          "body": "Fire Sages",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Dragonbone Catacombs",
          "key": "${link_1}",
          "target": {
            "href": "Dragonbone_Catacombs",
            "page": "Dragonbone_Catacombs"
          }
        }
      ],
      "text": "Unable to make sense of the meaning of the message, an annoyed Zuko threw the scroll away. As it landed on a nearby lamp, the light revealed a hidden message in the center of the scroll: \"The Fire Sages keep the secret history in the Dragonbone Catacombs.\" Now knowing where to go, Zuko decided to investigate his great-grandfather's death, and ventured down the Dragonbone Catacombs."
    },
    {
      "body": "He found and read the final testament of ${link_0} ${link_1}, which details about his youth, errors, and regrets. In particular, he wrote about his friend, ${link_2} ${link_3}; he expanded upon their childhood friendship, their separation, later quarrels, and eventually Roku's death. Sozin continued with how he started the ${link_4} by ${link_5} the ${link_6} in search for the new Avatar. However, at the end of his memoirs, Sozin was still alive. Confused again, Zuko visited his ${link_7} in the ${link_8}, accusing him of sending the scroll, but Iroh denied doing so.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_1}",
          "target": {
            "href": "Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Roku",
          "key": "${link_3}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_4}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "attacking",
          "key": "${link_5}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_6}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "uncle",
          "key": "${link_7}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Capital City Prison",
          "key": "${link_8}",
          "target": {
            "href": "Capital_City_Prison",
            "page": "Capital_City_Prison"
          }
        }
      ],
      "text": "He found and read the final testament of Fire Lord Sozin, which details about his youth, errors, and regrets. In particular, he wrote about his friend, Avatar Roku; he expanded upon their childhood friendship, their separation, later quarrels, and eventually Roku's death. Sozin continued with how he started the Hundred Year War by attacking the Air Nomads in search for the new Avatar. However, at the end of his memoirs, Sozin was still alive. Confused again, Zuko visited his uncle in the Capital City Prison, accusing him of sending the scroll, but Iroh denied doing so."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Scroll",
    "file": "avatar.wikia.com/wiki/Scroll.html",
    "page": "Scroll",
    "title": "Scroll"
  }
}