{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Featured articles",
      "target": {
        "href": "Category_Featured_articles",
        "page": "Category_Featured_articles"
      }
    },
    {
      "body": "A-class articles",
      "target": {
        "href": "Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earthbending",
      "target": {
        "href": "Category_Earthbending",
        "page": "Category_Earthbending"
      }
    },
    {
      "body": "Specialized bending techniques",
      "target": {
        "href": "Category_Specialized_bending_techniques",
        "page": "Category_Specialized_bending_techniques"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The term \"Seismic sense\" has not been confirmed by official sources.",
      "links": [],
      "text": "The term \"Seismic sense\" has not been confirmed by official sources."
    },
    {
      "body": "${link_0} was able to detect people's movements through seismic sense.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Toph was able to detect people's movements through seismic sense."
    },
    {
      "body": "Seismic sense is a ${link_0} of ${link_1} that constitutes for physical sense. This skill enables earthbenders to detect vibrations in the ground to perceive objects, people, and other aspects of their environment, essentially acting as sonar, but through earth and metal.",
      "links": [
        {
          "body": "sub-skill",
          "key": "${link_0}",
          "target": {
            "href": "Specialized_bending_techniques",
            "page": "Specialized_bending_techniques"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Seismic sense is a sub-skill of earthbending that constitutes for physical sense. This skill enables earthbenders to detect vibrations in the ground to perceive objects, people, and other aspects of their environment, essentially acting as sonar, but through earth and metal."
    },
    {
      "body": "As the ${link_0} were the original earthbenders, they were also the first users of seismic sense. Naturally blind, these creatures used this ability to navigate their dark world with ease.",
      "links": [
        {
          "body": "badgermoles",
          "key": "${link_0}",
          "target": {
            "href": "Badgermole",
            "page": "Badgermole"
          }
        }
      ],
      "text": "As the badgermoles were the original earthbenders, they were also the first users of seismic sense. Naturally blind, these creatures used this ability to navigate their dark world with ease."
    },
    {
      "body": "The blind ${link_0} was the first known human practitioner of this technique, developing the sense at a young age by learning from the badgermoles and using it to establish her own untraditional style of earthbending. Later, she perfected her seismic sense to such an advanced degree that she could detect the slightest movements, using the skill as her method to explore the world, and developing a technique that serves as a way of lie detection. Toph's seismic sense was accurate enough that her friends often had difficulty remembering that she was blind. This heightened sense of awareness is at the foundation of ${link_1}, as Toph's sense allowed her to feel the unpurified earth materials that were still present in the metal.",
      "links": [
        {
          "body": "Toph Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "metalbending",
          "key": "${link_1}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        }
      ],
      "text": "The blind Toph Beifong was the first known human practitioner of this technique, developing the sense at a young age by learning from the badgermoles and using it to establish her own untraditional style of earthbending. Later, she perfected her seismic sense to such an advanced degree that she could detect the slightest movements, using the skill as her method to explore the world, and developing a technique that serves as a way of lie detection. Toph's seismic sense was accurate enough that her friends often had difficulty remembering that she was blind. This heightened sense of awareness is at the foundation of metalbending, as Toph's sense allowed her to feel the unpurified earth materials that were still present in the metal."
    },
    {
      "body": "The second known human practitioner of seismic sense was ${link_0} ${link_1}. Taught by Toph, he was fully capable of using the sense to perceive objects and movement out of his line of vision or while blindfolded. Due to this skill, Aang was able to detect ${link_2}'s attempt to strike him in the back during the ${link_3}.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_2}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "battle at Wulong Forest",
          "key": "${link_3}",
          "target": {
            "href": "Battle_at_Wulong_Forest",
            "page": "Battle_at_Wulong_Forest"
          }
        }
      ],
      "text": "The second known human practitioner of seismic sense was Avatar Aang. Taught by Toph, he was fully capable of using the sense to perceive objects and movement out of his line of vision or while blindfolded. Due to this skill, Aang was able to detect Ozai's attempt to strike him in the back during the battle at Wulong Forest."
    },
    {
      "body": "${link_0} used seismic sense to discover a hidden ${link_1}.",
      "links": [
        {
          "body": "Lin Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Equalist factory",
          "key": "${link_1}",
          "target": {
            "href": "Equalist_factory",
            "page": "Equalist_factory"
          }
        }
      ],
      "text": "Lin Beifong used seismic sense to discover a hidden Equalist factory."
    },
    {
      "body": "Toph later passed this skill on to her daughters, ${link_0} and ${link_1}. Lin used the technique in her job as ${link_2} to find hidden locations, such as an ${link_3} operating underneath the ${link_4} and a cavern underneath ${link_5}, as well as navigate her way through the ${link_6} underneath Republic City. Suyin used seismic sense during her attempted assassination of Kuvira.",
      "links": [
        {
          "body": "Lin",
          "key": "${link_0}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Suyin",
          "key": "${link_1}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "Chief of Police",
          "key": "${link_2}",
          "target": {
            "href": "Chief_of_Police",
            "page": "Chief_of_Police"
          }
        },
        {
          "body": "Equalist factory",
          "key": "${link_3}",
          "target": {
            "href": "Equalist_factory",
            "page": "Equalist_factory"
          }
        },
        {
          "body": "Sato estate",
          "key": "${link_4}",
          "target": {
            "href": "Sato_estate",
            "page": "Sato_estate"
          }
        },
        {
          "body": "Kuvira's factory",
          "key": "${link_5}",
          "target": {
            "href": "Earth_Empire_factory",
            "page": "Earth_Empire_factory"
          }
        },
        {
          "body": "tunnels",
          "key": "${link_6}",
          "target": {
            "href": "Republic_City_tunnel_network",
            "page": "Republic_City_tunnel_network"
          }
        }
      ],
      "text": "Toph later passed this skill on to her daughters, Lin and Suyin. Lin used the technique in her job as Chief of Police to find hidden locations, such as an Equalist factory operating underneath the Sato estate and a cavern underneath Kuvira's factory, as well as navigate her way through the tunnels underneath Republic City. Suyin used seismic sense during her attempted assassination of Kuvira."
    },
    {
      "body": "While residing at the ${link_0}, Toph used her seismic sense to connect to the rest of the world via the roots of the ${link_1}.",
      "links": [
        {
          "body": "Foggy Swamp",
          "key": "${link_0}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "banyan-grove tree",
          "key": "${link_1}",
          "target": {
            "href": "Banyan-grove_tree",
            "page": "Banyan-grove_tree"
          }
        }
      ],
      "text": "While residing at the Foggy Swamp, Toph used her seismic sense to connect to the rest of the world via the roots of the banyan-grove tree."
    },
    {
      "body": "The first and foremost of seismic sense's applications is the ability to perceive surroundings. By sensing vibrations in the ground, earthbenders can perceive their surroundings as precisely as normal sight, and in some cases with even greater clarity. The advantage of the sense over normal sight is that practitioners are able to pick up things that are barely visible or even imperceptible to the naked eye as well as things out of their line of sight. Obstacles that would normally obstruct regular vision, such as walls and thick dust clouds, are rendered ineffective against seismic sense. Seismic sense does not only provide surface vision, as the vibrations also travel underground, enabling the user to effectively detect caverns and other deep subterranean cavities.",
      "links": [],
      "text": "The first and foremost of seismic sense's applications is the ability to perceive surroundings. By sensing vibrations in the ground, earthbenders can perceive their surroundings as precisely as normal sight, and in some cases with even greater clarity. The advantage of the sense over normal sight is that practitioners are able to pick up things that are barely visible or even imperceptible to the naked eye as well as things out of their line of sight. Obstacles that would normally obstruct regular vision, such as walls and thick dust clouds, are rendered ineffective against seismic sense. Seismic sense does not only provide surface vision, as the vibrations also travel underground, enabling the user to effectively detect caverns and other deep subterranean cavities."
    },
    {
      "body": "${link_0} used seismic sense to detect the earth particles in metal.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Toph used seismic sense to detect the earth particles in metal."
    },
    {
      "body": "Notably, seismic sense allowed for the discovery of the art of metalbending. The ability allows an earthbender to pick up on the minute pieces of unpurified earth still present in the metal. Locking on to those pieces, an earthbender can bend the earth and thus the metal by proxy.",
      "links": [],
      "text": "Notably, seismic sense allowed for the discovery of the art of metalbending. The ability allows an earthbender to pick up on the minute pieces of unpurified earth still present in the metal. Locking on to those pieces, an earthbender can bend the earth and thus the metal by proxy."
    },
    {
      "body": "Since humans have a physical reaction when they lie, such as a heightened heart rate, earthbenders who have perfected this skill can lock on to those physiological changes and tell whether or not a person is lying. However, these reactions can be suppressed by individuals with great control over their emotions, such as ${link_0}, rendering even the most skilled seismic sense practitioner unable to tell if a statement is a lie. If one is ${link_1} what they say is true, false claims will not trigger any physical reaction. An earthbender must also be actively on the look for reactions for it to be noticed. This ability has been referred to as \"truth-seeing\".",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "made to believe",
          "key": "${link_1}",
          "target": {
            "href": "Brainwashing",
            "page": "Brainwashing"
          }
        }
      ],
      "text": "Since humans have a physical reaction when they lie, such as a heightened heart rate, earthbenders who have perfected this skill can lock on to those physiological changes and tell whether or not a person is lying. However, these reactions can be suppressed by individuals with great control over their emotions, such as Azula, rendering even the most skilled seismic sense practitioner unable to tell if a statement is a lie. If one is made to believe what they say is true, false claims will not trigger any physical reaction. An earthbender must also be actively on the look for reactions for it to be noticed. This ability has been referred to as \"truth-seeing\"."
    },
    {
      "body": "Seismic sense is not without its limitations. The practitioner must always be in direct contact with an earthen surface, through which vibrations can pass, in order to detect their surroundings, which must also be in contact with the same mass of earth. As such, a seismic sense user can detect airborne objects, regardless of their alloy, by estimating their flight path based on the stance the person who launched them had on an earthen surface, although there are known cases where earthen objects launched from an airborne position were also detected. If the user is in the air or water, or even standing on a non-earth solid such as ice or wood, the bender will be unable to sense anything through that substance. Although allowing the user to detect their surroundings in detail, the sub-skill does not allow for perception of facial features or written characters, due to the fact that they are not made of or in contact with earth.",
      "links": [],
      "text": "Seismic sense is not without its limitations. The practitioner must always be in direct contact with an earthen surface, through which vibrations can pass, in order to detect their surroundings, which must also be in contact with the same mass of earth. As such, a seismic sense user can detect airborne objects, regardless of their alloy, by estimating their flight path based on the stance the person who launched them had on an earthen surface, although there are known cases where earthen objects launched from an airborne position were also detected. If the user is in the air or water, or even standing on a non-earth solid such as ice or wood, the bender will be unable to sense anything through that substance. Although allowing the user to detect their surroundings in detail, the sub-skill does not allow for perception of facial features or written characters, due to the fact that they are not made of or in contact with earth."
    },
    {
      "body": "Sand, although an earthen substance, is not firm like normal earth and renders seismic sense \"fuzzy\" and imprecise for earthbenders who are not used to bending it. Uninterrupted contact with the ground is preferred for the user - an object such as a shoe sole interferes with the sense. Lie detection is not possible on a sandy surface, as Toph could not detect if ${link_0} was lying about stealing ${link_1}.",
      "links": [
        {
          "body": "Ghashiun",
          "key": "${link_0}",
          "target": {
            "href": "Ghashiun",
            "page": "Ghashiun"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Sand, although an earthen substance, is not firm like normal earth and renders seismic sense \"fuzzy\" and imprecise for earthbenders who are not used to bending it. Uninterrupted contact with the ground is preferred for the user - an object such as a shoe sole interferes with the sense. Lie detection is not possible on a sandy surface, as Toph could not detect if Ghashiun was lying about stealing Appa."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Seismic_sense",
    "file": "avatar.wikia.com/wiki/Seismic_sense.html",
    "page": "Seismic_sense",
    "title": "Seismic sense"
  }
}