{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "external": false,
        "href": "/wiki/Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    },
    {
      "body": "Real world",
      "target": {
        "external": false,
        "href": "/wiki/Category_Real_world",
        "page": "Category_Real_world"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Shipping, derived from an abbreviation of \"relationship\", is the term given to the fan-created pairing of two or more characters in ${link_0} and/or ${link_1}. It has become an important part of Avatar for a large number of fans.",
      "links": [
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        },
        {
          "body": "The Legend of Korra",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/The_Legend_of_Korra",
            "page": "The_Legend_of_Korra"
          }
        }
      ],
      "section": [
        "Shipping"
      ],
      "text": "Shipping, derived from an abbreviation of \"relationship\", is the term given to the fan-created pairing of two or more characters in Avatar: The Last Airbender and/or The Legend of Korra. It has become an important part of Avatar for a large number of fans."
    },
    {
      "body": "\"Ships\" are commonly designated with portmanteau couple names, usually derived by combining the names of the characters or words that accurately describe them. Common reasons for fan-created pairings include extensive companionship, obvious \"movements\" by either character, subtle actions by either character, or even the fact that they look \"cute together\".",
      "links": [],
      "section": [
        "Shipping"
      ],
      "text": "\"Ships\" are commonly designated with portmanteau couple names, usually derived by combining the names of the characters or words that accurately describe them. Common reasons for fan-created pairings include extensive companionship, obvious \"movements\" by either character, subtle actions by either character, or even the fact that they look \"cute together\"."
    },
    {
      "body": "Many Avatar fans are devoted to their preferred \"ships\" and write ${link_0} to detail and expand upon their theories. Subsequently, some fans conflicted over the validity of each other's supporter \"ships\", which resulted in an amused reaction from the creators.",
      "links": [
        {
          "body": "fanon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar_fanon",
            "page": "Avatar_fanon"
          }
        }
      ],
      "section": [
        "Shipping"
      ],
      "text": "Many Avatar fans are devoted to their preferred \"ships\" and write fanon to detail and expand upon their theories. Subsequently, some fans conflicted over the validity of each other's supporter \"ships\", which resulted in an amused reaction from the creators."
    },
    {
      "body": "\"Ships\" between characters of the same gender are often called slash (or femslash if between women) from the diagonal slash \"/\" placed between the names of the two characters; a convention first standardized in the early 1970s by Star Trek fan fiction featuring Kirk/Spock (read: Kirk \"slash\" Spock) romance.",
      "links": [],
      "section": [
        "Shipping"
      ],
      "text": "\"Ships\" between characters of the same gender are often called slash (or femslash if between women) from the diagonal slash \"/\" placed between the names of the two characters; a convention first standardized in the early 1970s by Star Trek fan fiction featuring Kirk/Spock (read: Kirk \"slash\" Spock) romance."
    },
    {
      "body": "Jet and Katara – known as \"Jetara\" – This ship arose after it was shown that Katara and ${link_0} had a romantic attraction to each other. However, when ${link_1} tricked ${link_2} into harming innocent people, she abandoned all loyalty to him and remained bitter toward him from that point onward. However, Katara seemed uncomfortable and defensive when questioned about her relationship with him in ${link_3}, and apparently considered Jet her ex-boyfriend. Any remaining chance of them becoming a couple was eliminated when Jet died under ${link_4} after being struck down by ${link_5}. Interestingly, Jetara was commonly supported as a prelude to Zutara, as it was claimed to be proof that Katara liked \"bad boys\". It was also stated on ${link_6} that Jet was Katara's first kiss, though it was never seen on screen.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jet",
            "page": "Jet"
          }
        },
        {
          "body": "Jet",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jet",
            "page": "Jet"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Lake Laogai",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Lake_Laogai",
            "page": "Lake_Laogai"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Long_Feng",
            "page": "Long_Feng"
          }
        },
        {
          "body": "Avatar Extras",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar_Extras_(Book_Two__Earth)#.22Lake_Laogai.22",
            "page": "Avatar_Extras_(Book_Two__Earth)"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "Avatar: The Last Airbender"
      ],
      "text": "Jet and Katara – known as \"Jetara\" – This ship arose after it was shown that Katara and Jet had a romantic attraction to each other. However, when Jet tricked Katara into harming innocent people, she abandoned all loyalty to him and remained bitter toward him from that point onward. However, Katara seemed uncomfortable and defensive when questioned about her relationship with him in Ba Sing Se, and apparently considered Jet her ex-boyfriend. Any remaining chance of them becoming a couple was eliminated when Jet died under Lake Laogai after being struck down by Long Feng. Interestingly, Jetara was commonly supported as a prelude to Zutara, as it was claimed to be proof that Katara liked \"bad boys\". It was also stated on Avatar Extras that Jet was Katara's first kiss, though it was never seen on screen."
    },
    {
      "body": "Jin and Zuko – known as \"Jinko\" – This fairly-popular ship was inspired after ${link_0}, a young girl in Ba Sing Se, displayed an open attraction to ${link_1} and eventually earned a date with him at ${link_2}'s insistence. Zuko denied that Jin was his girlfriend, but he enjoyed his date more than he wanted anyone to know. Zuko and Jin even shared a kiss before Zuko realized that their relationship would never work out, leaving her somewhat saddened. Zuko later admitted to Iroh that his date was \"nice\". Jin and Zuko met again, but by this point, Zuko was back with his childhood sweetheart, Mai.",
      "links": [
        {
          "body": "Jin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jin",
            "page": "Jin"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "Avatar: The Last Airbender"
      ],
      "text": "Jin and Zuko – known as \"Jinko\" – This fairly-popular ship was inspired after Jin, a young girl in Ba Sing Se, displayed an open attraction to Zuko and eventually earned a date with him at Iroh's insistence. Zuko denied that Jin was his girlfriend, but he enjoyed his date more than he wanted anyone to know. Zuko and Jin even shared a kiss before Zuko realized that their relationship would never work out, leaving her somewhat saddened. Zuko later admitted to Iroh that his date was \"nice\". Jin and Zuko met again, but by this point, Zuko was back with his childhood sweetheart, Mai."
    },
    {
      "body": "Aang and Katara – known as \"Kataang\", fans known as \"Kataangers\" – One of the two most popular ships, \"Kataang\" was based on the fact that ${link_0} and ${link_1} became friends at the beginning of the series, and Aang immediately developed an obvious crush on her, which later grew into a true love for her. Katara frequently gave him friendly kisses on the cheek. Aang's crush on her was made explicit, while Katara was told she will marry a powerful ${link_2} and had the appearance of an epiphany when ${link_3} casually described Aang as a powerful bender. During the battle in the ${link_4}, his earthly attachment to Katara prevented him from triggering the ${link_5}. After being shot down by ${link_6} and being revived by Katara's ${link_7}, Aang looked up at Katara and smiled at her weakly, indicating that he had not actually given her up. During the ${link_8}, Aang kissed Katara on the lips before leaving to find and battle ${link_9} ${link_10}. Despite this, the two were not a couple; Katara even refused Aang's romantic advances during an intermission of the ${link_11} they were watching on ${link_12}. However, they kissed passionately at the end of the series, beginning a romantic relationship. The continuation of the series marked by the release of the comic trilogy \"${link_13}\" saw Aang and Katara call each other \"sweetie\", demonstrating the growth of their relationship. Aang and Katara married in their later lives and had three children, ${link_14}, ${link_15}, and ${link_16}, finally confirming the continuation of their romance. The creators themselves have commented in an interview that they had always favored the idea of a relationship between Aang and Katara, even going as far as giving their romance its own short theme song titled \"Kataang\" by the Track Team, which is the song that played during the story of ${link_17} and ${link_18}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "bender",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Crystal Catacombs",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Azula",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        },
        {
          "body": "spirit water",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_water",
            "page": "Spirit_water"
          }
        },
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "play",
          "key": "${link_11}",
          "target": {
            "external": false,
            "href": "/wiki/The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        },
        {
          "body": "Ember Island",
          "key": "${link_12}",
          "target": {
            "external": false,
            "href": "/wiki/Ember_Island",
            "page": "Ember_Island"
          }
        },
        {
          "body": "The Promise",
          "key": "${link_13}",
          "target": {
            "external": false,
            "href": "/wiki/The_Promise",
            "page": "The_Promise"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_14}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Kya",
          "key": "${link_15}",
          "target": {
            "external": false,
            "href": "/wiki/Kya",
            "page": "Kya"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_16}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Oma",
          "key": "${link_17}",
          "target": {
            "external": false,
            "href": "/wiki/Oma",
            "page": "Oma"
          }
        },
        {
          "body": "Shu",
          "key": "${link_18}",
          "target": {
            "external": false,
            "href": "/wiki/Shu",
            "page": "Shu"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "Avatar: The Last Airbender"
      ],
      "text": "Aang and Katara – known as \"Kataang\", fans known as \"Kataangers\" – One of the two most popular ships, \"Kataang\" was based on the fact that Katara and Aang became friends at the beginning of the series, and Aang immediately developed an obvious crush on her, which later grew into a true love for her. Katara frequently gave him friendly kisses on the cheek. Aang's crush on her was made explicit, while Katara was told she will marry a powerful bender and had the appearance of an epiphany when Sokka casually described Aang as a powerful bender. During the battle in the Crystal Catacombs, his earthly attachment to Katara prevented him from triggering the Avatar State. After being shot down by Azula and being revived by Katara's spirit water, Aang looked up at Katara and smiled at her weakly, indicating that he had not actually given her up. During the invasion of the Fire Nation, Aang kissed Katara on the lips before leaving to find and battle Fire Lord Ozai. Despite this, the two were not a couple; Katara even refused Aang's romantic advances during an intermission of the play they were watching on Ember Island. However, they kissed passionately at the end of the series, beginning a romantic relationship. The continuation of the series marked by the release of the comic trilogy \"The Promise\" saw Aang and Katara call each other \"sweetie\", demonstrating the growth of their relationship. Aang and Katara married in their later lives and had three children, Bumi, Kya, and Tenzin, finally confirming the continuation of their romance. The creators themselves have commented in an interview that they had always favored the idea of a relationship between Aang and Katara, even going as far as giving their romance its own short theme song titled \"Kataang\" by the Track Team, which is the song that played during the story of Oma and Shu."
    },
    {
      "body": "Zuko and Mai – known as \"Maiko\" – Set up ever since ${link_0}'s smile at the thought of seeing Zuko again, Maiko was one of the primary ships of the show. The two were childhood sweethearts, but drifted apart when Zuko began pursuing the Avatar. They did, however, reunite later on. They shared several kisses, although it was during their visit to Ember Island that Mai and Zuko had trouble with one another's anger or apathy and split up. Later, however, they were much more affectionate toward each another. During the Invasion of the ${link_1}, Zuko wrote Mai a letter detailing how he had to leave her and join ${link_2}. Mai interpreted this as him breaking up with her and, in a later confrontation, stated he had broken her heart. Despite this, she betrayed Azula to save him, saying, \"I love Zuko more than I fear you.\" Moments before Zuko's coronation, they reaffirmed their relationship with a hug and a kiss. Maiko fans commonly worked together with, or were, Kataangers, trying to show Zutarians that if Zuko liked Mai and Katara liked Aang, Zutara would therefore never happen. The Maiko ship is endangered due to a breakup over Zuko's secret meetings with Ozai, and Mai's subsequent relationship with ${link_3}.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Kei Lo",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Kei_Lo",
            "page": "Kei_Lo"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "Avatar: The Last Airbender"
      ],
      "text": "Zuko and Mai – known as \"Maiko\" – Set up ever since Mai's smile at the thought of seeing Zuko again, Maiko was one of the primary ships of the show. The two were childhood sweethearts, but drifted apart when Zuko began pursuing the Avatar. They did, however, reunite later on. They shared several kisses, although it was during their visit to Ember Island that Mai and Zuko had trouble with one another's anger or apathy and split up. Later, however, they were much more affectionate toward each another. During the Invasion of the Fire Nation, Zuko wrote Mai a letter detailing how he had to leave her and join Team Avatar. Mai interpreted this as him breaking up with her and, in a later confrontation, stated he had broken her heart. Despite this, she betrayed Azula to save him, saying, \"I love Zuko more than I fear you.\" Moments before Zuko's coronation, they reaffirmed their relationship with a hug and a kiss. Maiko fans commonly worked together with, or were, Kataangers, trying to show Zutarians that if Zuko liked Mai and Katara liked Aang, Zutara would therefore never happen. The Maiko ship is endangered due to a breakup over Zuko's secret meetings with Ozai, and Mai's subsequent relationship with Kei Lo."
    },
    {
      "body": "Sokka and Suki – known as \"'Sukka\", fans known as \"Sukkans\" – ${link_0} and Sokka's relationship began when they first met each other on ${link_1}. Sokka displayed a sexist attitude toward the ${link_2}, however, Suki showed him the error of his ways. She later kissed him on the cheek before he left Kyoshi Island. They affectionately reunited in ${link_3}, although there were some awkward moments for them. However, they parted again after sharing a passionate kiss. Suki was captured by Mai, Azula and ${link_4} shortly after, so they did not meet again until Sokka ventured the ${link_5} to free ${link_6}. Later on, the two planned a romantic rendezvous in Sokka's tent; however, it was interrupted when Zuko approached Sokka for advice on dealing with Katara. Their relationship was also highlighted during a play on Ember Island and their time spent on the beach before the arrival of ${link_7}. As of the end of the series, they had entered a romantic relationship.",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Full Moon Bay",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Full_Moon_Bay",
            "page": "Full_Moon_Bay"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "his father",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "Avatar: The Last Airbender"
      ],
      "text": "Sokka and Suki – known as \"'Sukka\", fans known as \"Sukkans\" – Suki and Sokka's relationship began when they first met each other on Kyoshi Island. Sokka displayed a sexist attitude toward the Kyoshi Warriors, however, Suki showed him the error of his ways. She later kissed him on the cheek before he left Kyoshi Island. They affectionately reunited in Full Moon Bay, although there were some awkward moments for them. However, they parted again after sharing a passionate kiss. Suki was captured by Mai, Azula and Ty Lee shortly after, so they did not meet again until Sokka ventured the Boiling Rock to free his father. Later on, the two planned a romantic rendezvous in Sokka's tent; however, it was interrupted when Zuko approached Sokka for advice on dealing with Katara. Their relationship was also highlighted during a play on Ember Island and their time spent on the beach before the arrival of Sozin's Comet. As of the end of the series, they had entered a romantic relationship."
    },
    {
      "body": "Aang and Toph – known as \"Taang\", fans known as \"Taangers\" – ${link_0} and Aang had a close friendship throughout the series, although as Actor Sokka said, they had a \"rocky relationship\". Aang had a vision of her in the ${link_1}, but did not meet Toph until he, Katara and Sokka bought tickets to attend the ${link_2} tournament. Toph initially refused to join their group, but agreed when her ${link_3} expressed his desire to hide and protect her even more. Proponents of the ship liked their nature as opposites. Taang was commonly shipped in tandem with Zutara, as it conveniently solved the problem of Aang's romantic interest in Katara. Once Aang mastered ${link_4}, there was little plot-related reason for him to interact with Toph and their friendship faded into the background. However, they remained best friends.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "swamp",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "Earth Rumble VI",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Rumble_VI",
            "page": "Earth_Rumble_VI"
          }
        },
        {
          "body": "father",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Lao_Beifong",
            "page": "Lao_Beifong"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "Avatar: The Last Airbender"
      ],
      "text": "Aang and Toph – known as \"Taang\", fans known as \"Taangers\" – Toph and Aang had a close friendship throughout the series, although as Actor Sokka said, they had a \"rocky relationship\". Aang had a vision of her in the swamp, but did not meet Toph until he, Katara and Sokka bought tickets to attend the Earth Rumble VI tournament. Toph initially refused to join their group, but agreed when her father expressed his desire to hide and protect her even more. Proponents of the ship liked their nature as opposites. Taang was commonly shipped in tandem with Zutara, as it conveniently solved the problem of Aang's romantic interest in Katara. Once Aang mastered earthbending, there was little plot-related reason for him to interact with Toph and their friendship faded into the background. However, they remained best friends."
    },
    {
      "body": "Sokka and Toph – known as \"Tokka\", fans known as \"Tokkans\" or, more commonly, \"Tokkaneers\" – This ship was mostly based on the pair's deep friendship and, later on, Toph's clear crush on Sokka. Explicit hints about her feelings for him began when Toph was bitter about how he ran straight to Suki instead of thanking her for saving his life. Later on, when Toph was drowning, Sokka announced his intention to save her, only for Suki to reach her first. Toph, believing Sokka rescued her, kissed Suki on the cheek. Their friendship was later emphasized even more when Toph blushed upon Sokka's return from training with ${link_0} and Sokka gave her a ${link_1} of meteorite stone that she wore as a bracelet. Later, they had a tender conversation when she had a falling out with Katara. During the final battle, Sokka and Toph worked together, at first with Suki and later without her, to bring down an entire fleet of ${link_2}, the two of them nearly dying in the process. After Suki saved both of their lives, Sokka remained in his relationship with Suki. Tokka was commonly shipped in tandem with Kataang, as it provided romantic partners for all four members of Team Avatar. Many theories have been created to maintain Tokka's possible canonicity in regards to the romantic relationship between ${link_3}, Toph's daughter, and Tenzin, Sokka's nephew. These were vast and varied, such as having Lin be another man's daughter, or not Toph's biological child, although a minority of Tokkaneers simply \"abandoned ship\". It has since been revealed that Toph had two daughters with two different men.",
      "links": [
        {
          "body": "Piandao",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Piandao",
            "page": "Piandao"
          }
        },
        {
          "body": "gift",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Toph%27s_bracelet",
            "page": "Toph%27s_bracelet"
          }
        },
        {
          "body": "Fire Nation airships",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "Avatar: The Last Airbender"
      ],
      "text": "Sokka and Toph – known as \"Tokka\", fans known as \"Tokkans\" or, more commonly, \"Tokkaneers\" – This ship was mostly based on the pair's deep friendship and, later on, Toph's clear crush on Sokka. Explicit hints about her feelings for him began when Toph was bitter about how he ran straight to Suki instead of thanking her for saving his life. Later on, when Toph was drowning, Sokka announced his intention to save her, only for Suki to reach her first. Toph, believing Sokka rescued her, kissed Suki on the cheek. Their friendship was later emphasized even more when Toph blushed upon Sokka's return from training with Piandao and Sokka gave her a gift of meteorite stone that she wore as a bracelet. Later, they had a tender conversation when she had a falling out with Katara. During the final battle, Sokka and Toph worked together, at first with Suki and later without her, to bring down an entire fleet of Fire Nation airships, the two of them nearly dying in the process. After Suki saved both of their lives, Sokka remained in his relationship with Suki. Tokka was commonly shipped in tandem with Kataang, as it provided romantic partners for all four members of Team Avatar. Many theories have been created to maintain Tokka's possible canonicity in regards to the romantic relationship between Lin Beifong, Toph's daughter, and Tenzin, Sokka's nephew. These were vast and varied, such as having Lin be another man's daughter, or not Toph's biological child, although a minority of Tokkaneers simply \"abandoned ship\". It has since been revealed that Toph had two daughters with two different men."
    },
    {
      "body": "Toph and Zuko – known as \"Toko\" – Toph was the first member of the group to accept Zuko, encouraging the others to let him join Team Avatar. They had a tender conversation, where Zuko expressed concern about his actions toward his uncle and Toph assured him, based on her conversation with Iroh, that the ${link_0} had probably already forgiven his nephew. When the team temporarily separated in an attempt to track down Aang, Toph immediately chose to accompany Zuko, claiming that everyone else had gone on a \"life-changing field trip with [him]\", and it was therefore her turn. She clung to Zuko's arm, causing him to blush. Their friendship made for a convenient fanon ship, as the complete Team Avatar (Aang, Katara, Sokka, Toph, Zuko, Suki) can be paired off among themselves as Kataang, Sukka, and Toko. It should also be noted that Toph stopped blushing about Sokka around the same time Zuko showed up, and hit his arm constantly, her way of showing affection. Any problems between the two were usually resolved quickly, including the time Zuko burned her feet. They were also Aang's toughest teachers, and both had issues with their parents, causing them to run away. She was the one who advised Zuko about finding a new way to learn ${link_1} while everyone else mocked him. They also both had alter egos: Zuko's being the ${link_2} and Toph's being the Blind Bandit.",
      "links": [
        {
          "body": "General",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#General",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Blue Spirit",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko#Other_skills",
            "page": "Zuko"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "Avatar: The Last Airbender"
      ],
      "text": "Toph and Zuko – known as \"Toko\" – Toph was the first member of the group to accept Zuko, encouraging the others to let him join Team Avatar. They had a tender conversation, where Zuko expressed concern about his actions toward his uncle and Toph assured him, based on her conversation with Iroh, that the General had probably already forgiven his nephew. When the team temporarily separated in an attempt to track down Aang, Toph immediately chose to accompany Zuko, claiming that everyone else had gone on a \"life-changing field trip with [him]\", and it was therefore her turn. She clung to Zuko's arm, causing him to blush. Their friendship made for a convenient fanon ship, as the complete Team Avatar (Aang, Katara, Sokka, Toph, Zuko, Suki) can be paired off among themselves as Kataang, Sukka, and Toko. It should also be noted that Toph stopped blushing about Sokka around the same time Zuko showed up, and hit his arm constantly, her way of showing affection. Any problems between the two were usually resolved quickly, including the time Zuko burned her feet. They were also Aang's toughest teachers, and both had issues with their parents, causing them to run away. She was the one who advised Zuko about finding a new way to learn firebending while everyone else mocked him. They also both had alter egos: Zuko's being the Blue Spirit and Toph's being the Blind Bandit."
    },
    {
      "body": "Sokka and Ty Lee – known as \"Ty Lokka\" – Ty Lee demonstrated a crush on Sokka at several times. When she first met him, she commented to Mai that he was \"kind of cute\". When she met him a second time, she happily exclaimed, \"It is the Avatar ... and friends!\" with a special emphasis on Sokka. When Sokka discovered that Ty Lee and Mai were impersonating Kyoshi Warriors, Ty Lee fought Sokka in a fashion that prompted her to say, \"It's like we're dancing together!\" Sokka pointed out that he was \"kind of involved with Suki\". The two had little interaction after that.",
      "links": [],
      "section": [
        "Shipping",
        "Popular ships",
        "Avatar: The Last Airbender"
      ],
      "text": "Sokka and Ty Lee – known as \"Ty Lokka\" – Ty Lee demonstrated a crush on Sokka at several times. When she first met him, she commented to Mai that he was \"kind of cute\". When she met him a second time, she happily exclaimed, \"It is the Avatar ... and friends!\" with a special emphasis on Sokka. When Sokka discovered that Ty Lee and Mai were impersonating Kyoshi Warriors, Ty Lee fought Sokka in a fashion that prompted her to say, \"It's like we're dancing together!\" Sokka pointed out that he was \"kind of involved with Suki\". The two had little interaction after that."
    },
    {
      "body": "Azula and Ty Lee – known as \"Tyzula\" – This ship gained popularity when Ty Lee and Azula's past as childhood friends was revealed and their interaction began, which many considered to be reminiscent of a possessive, romantic relationship. When a softer side to their friendship was shown, the pairing was quickly shot to a well-known ship, even among people who have never watched Avatar: The Last Airbender. Ty Lee frequently complimented Azula, and many fans felt that Azula had a soft spot for Ty Lee, particularly when the duo stayed at Ember Island with Mai and Zuko, and Azula gives what is arguably the only genuine apology that has been seen from her after hurting Ty Lee's feelings. The fans also state that Ty Lee's betrayal was what sent Azula over the edge, and despite it, this ship remains more popular than any other ship involving either girl in Avatar: The Last Airbender. This ship has long been considered the most popular femslash ship in the Avatar: The Last Airbender fandom. ${link_0}, who voiced Azula, is known to ship Tyzula, as she once stated that \"Everybody knows Azula loves Ty Lee ...\"",
      "links": [
        {
          "body": "Grey DeLisle",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Grey_DeLisle",
            "page": "Grey_DeLisle"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "Avatar: The Last Airbender"
      ],
      "text": "Azula and Ty Lee – known as \"Tyzula\" – This ship gained popularity when Ty Lee and Azula's past as childhood friends was revealed and their interaction began, which many considered to be reminiscent of a possessive, romantic relationship. When a softer side to their friendship was shown, the pairing was quickly shot to a well-known ship, even among people who have never watched Avatar: The Last Airbender. Ty Lee frequently complimented Azula, and many fans felt that Azula had a soft spot for Ty Lee, particularly when the duo stayed at Ember Island with Mai and Zuko, and Azula gives what is arguably the only genuine apology that has been seen from her after hurting Ty Lee's feelings. The fans also state that Ty Lee's betrayal was what sent Azula over the edge, and despite it, this ship remains more popular than any other ship involving either girl in Avatar: The Last Airbender. This ship has long been considered the most popular femslash ship in the Avatar: The Last Airbender fandom. Grey DeLisle, who voiced Azula, is known to ship Tyzula, as she once stated that \"Everybody knows Azula loves Ty Lee ...\""
    },
    {
      "body": "Yue and Sokka – known as \"Yukka\" – Sokka developed a strong romantic interest in ${link_0} ${link_1} of the ${link_2}. She came to love him, too, but the two were kept apart due to Yue's engagement to another warrior, ${link_3}. When the Fire Nation attacked the tribe, Sokka swore to defend Yue, bringing them ever closer. Yue ultimately died when she gave up her life force to save the Moon Spirit ${link_4}, and was thus reincarnated as Tui's successor. Yue kissed Sokka goodbye, promising she would always be with him. Sokka remained upset about Yue's sacrifice, believing he failed to protect her. Although he had since fallen in love with Suki, Sokka's strong love for Yue was made evident by his refusal to kiss Suki under a full moon.",
      "links": [
        {
          "body": "Princess",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Hahn",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Hahn",
            "page": "Hahn"
          }
        },
        {
          "body": "Tui",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Tui",
            "page": "Tui"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "Avatar: The Last Airbender"
      ],
      "text": "Yue and Sokka – known as \"Yukka\" – Sokka developed a strong romantic interest in Princess Yue of the Northern Water Tribe. She came to love him, too, but the two were kept apart due to Yue's engagement to another warrior, Hahn. When the Fire Nation attacked the tribe, Sokka swore to defend Yue, bringing them ever closer. Yue ultimately died when she gave up her life force to save the Moon Spirit Tui, and was thus reincarnated as Tui's successor. Yue kissed Sokka goodbye, promising she would always be with him. Sokka remained upset about Yue's sacrifice, believing he failed to protect her. Although he had since fallen in love with Suki, Sokka's strong love for Yue was made evident by his refusal to kiss Suki under a full moon."
    },
    {
      "body": "Katara and Zuko – known as \"Zutara\", fans known as \"Zutarians\" – The counterpart to Kataang and the other most popular ship, Zutara cited evidence that was less overt. The ship's first real \"moment\" took place when Zuko tried to capture Katara. Also, when Azula attacked Iroh during the ${link_0}, Katara offered to help Zuko heal his uncle's wound. Zuko and Katara later happened to both be imprisoned in the same ${link_1}; although at first Katara acted antagonistic to him, Zuko revealed he had also lost his ${link_2} to the Fire Nation, which caused her to grow sympathetic toward him, due to her being able to relate to the pain of losing a parent, and offered to heal his scar. After betraying her and joining Azula, Katara vowed never to trust Zuko again. Later on, when Zuko joined Team Avatar and helped Katara find ${link_3}, the man who killed ${link_4}, she was able to forgive and start trusting him. Soon after, they slowly became friends. When it was time for everyone to choose their own destiny, Zuko enlisted Katara's aid in facing Azula. During the ${link_5}, they fought together against Azula, where Zuko actually saved Katara's life by jumping in the way of Azula's lighting bolt that was targeted for her. While their relationship never turned romantic, there were some nods in the series to them being a couple, such as June always saying that Katara was Zuko's girlfriend and the ${link_6} portrayed Zuko and Katara to be in love during their rendition of ${link_7}.",
      "links": [
        {
          "body": "confrontation at Tu Zin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Confrontation_at_Tu_Zin",
            "page": "Confrontation_at_Tu_Zin"
          }
        },
        {
          "body": "catacomb",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        },
        {
          "body": "mother",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ursa",
            "page": "Ursa"
          }
        },
        {
          "body": "Yon Rha",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Yon_Rha",
            "page": "Yon_Rha"
          }
        },
        {
          "body": "her mother",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        },
        {
          "body": "Comet-Enhanced Agni Kai",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        },
        {
          "body": "Ember Island Players",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Ember_Island_Players",
            "page": "Ember_Island_Players"
          }
        },
        {
          "body": "The Boy in the Iceberg",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "Avatar: The Last Airbender"
      ],
      "text": "Katara and Zuko – known as \"Zutara\", fans known as \"Zutarians\" – The counterpart to Kataang and the other most popular ship, Zutara cited evidence that was less overt. The ship's first real \"moment\" took place when Zuko tried to capture Katara. Also, when Azula attacked Iroh during the confrontation at Tu Zin, Katara offered to help Zuko heal his uncle's wound. Zuko and Katara later happened to both be imprisoned in the same catacomb; although at first Katara acted antagonistic to him, Zuko revealed he had also lost his mother to the Fire Nation, which caused her to grow sympathetic toward him, due to her being able to relate to the pain of losing a parent, and offered to heal his scar. After betraying her and joining Azula, Katara vowed never to trust Zuko again. Later on, when Zuko joined Team Avatar and helped Katara find Yon Rha, the man who killed her mother, she was able to forgive and start trusting him. Soon after, they slowly became friends. When it was time for everyone to choose their own destiny, Zuko enlisted Katara's aid in facing Azula. During the Comet-Enhanced Agni Kai, they fought together against Azula, where Zuko actually saved Katara's life by jumping in the way of Azula's lighting bolt that was targeted for her. While their relationship never turned romantic, there were some nods in the series to them being a couple, such as June always saying that Katara was Zuko's girlfriend and the Ember Island Players portrayed Zuko and Katara to be in love during their rendition of The Boy in the Iceberg."
    },
    {
      "body": "Bolin and Eska – known as \"Boleska\" or \"Beska\", fans known as \"Beskites\" – This pairing was anticipated before its airing in ${link_0}, and was supported as both ${link_1} and ${link_2} showed attraction toward each other. The two seemed to hit it off, but Eska proved to be a bit much for Bolin as she would not let him even hug Korra, and later made him act as a horse and ride her and Desna around through the ${link_3}. Bolin attempted to break off the relationship, but Eska would not let him, and later forced him into marriage. Bolin fled from his now ex-girlfriend and fiancé. Regardless of the relationship's ultimate split up, fans still enjoy shipping the two of them and imagining scenarios in which the two reunite as a couple. This wish became a reality when Bolin confessed that he had always loved her and had merely been overwhelmed and frightened when he had left her at the altar. Eska rekindled their love with a kiss, and they later fought side by side, facing the \"end of the world together\". However, after Vaatu was defeated, they split up again, though this time on good grounds.",
      "links": [
        {
          "body": "Book Two: Spirits",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Book_Two__Spirits",
            "page": "Book_Two__Spirits"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Eska",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Bolin and Eska – known as \"Boleska\" or \"Beska\", fans known as \"Beskites\" – This pairing was anticipated before its airing in Book Two: Spirits, and was supported as both Bolin and Eska showed attraction toward each other. The two seemed to hit it off, but Eska proved to be a bit much for Bolin as she would not let him even hug Korra, and later made him act as a horse and ride her and Desna around through the Southern Water Tribe. Bolin attempted to break off the relationship, but Eska would not let him, and later forced him into marriage. Bolin fled from his now ex-girlfriend and fiancé. Regardless of the relationship's ultimate split up, fans still enjoy shipping the two of them and imagining scenarios in which the two reunite as a couple. This wish became a reality when Bolin confessed that he had always loved her and had merely been overwhelmed and frightened when he had left her at the altar. Eska rekindled their love with a kiss, and they later fought side by side, facing the \"end of the world together\". However, after Vaatu was defeated, they split up again, though this time on good grounds."
    },
    {
      "body": "Bolin and Opal – known as \"Bopal\", fans known as \"Bopalians\" – This ship became popular when Bolin and ${link_0} first met in ${link_1}, where Opal blushed during her first encounter with Bolin. The two rapidly developed a trusting connection with each, opening up to each other about their wants and fears. Although they initially only spend a short time together, their relationship soon hit off after the ${link_2}. By 174 ${link_3}, the two were in a romantic relationship, though due to their respective jobs, the distance placed a strain on their involvement. After Bolin deserted ${link_4}'s ${link_5}, Opal continued to refuse his advances given his support of her actions beforehand. After he helped her ${link_6} her ${link_7}, Opal forgave him and the two resumed their relationship. They later shared a dance during the reception following ${link_8} and ${link_9}'s wedding.",
      "links": [
        {
          "body": "Opal",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Opal",
            "page": "Opal"
          }
        },
        {
          "body": "Zaofu",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zaofu",
            "page": "Zaofu"
          }
        },
        {
          "body": "insurrection of the Red Lotus",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Insurrection_of_the_Red_Lotus",
            "page": "Insurrection_of_the_Red_Lotus"
          }
        },
        {
          "body": "AG",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "army",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        },
        {
          "body": "save",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Liberation_of_the_Beifong_family",
            "page": "Liberation_of_the_Beifong_family"
          }
        },
        {
          "body": "family",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Beifong_family",
            "page": "Beifong_family"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "Zhu Li",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Bolin and Opal – known as \"Bopal\", fans known as \"Bopalians\" – This ship became popular when Bolin and Opal first met in Zaofu, where Opal blushed during her first encounter with Bolin. The two rapidly developed a trusting connection with each, opening up to each other about their wants and fears. Although they initially only spend a short time together, their relationship soon hit off after the insurrection of the Red Lotus. By 174 AG, the two were in a romantic relationship, though due to their respective jobs, the distance placed a strain on their involvement. After Bolin deserted Kuvira's army, Opal continued to refuse his advances given his support of her actions beforehand. After he helped her save her family, Opal forgave him and the two resumed their relationship. They later shared a dance during the reception following Varrick and Zhu Li's wedding."
    },
    {
      "body": "Bolin and Korra – known as \"Borra\", fans known as \"Borriors\" – This ship has a lot of fans that would like to see Korra and Bolin have a non-platonic relationship. Bolin convinced ${link_0} to let Korra pass by after she sneaked into the ${link_1}, and invited her back to the teams' locker room to watch the match. The two soon became friends; he willingly showed her some pro-bending tricks and was quick to accept her on the ${link_2} pro-bending team. After Korra helped to rescue Bolin out of the clutches of Amon, Bolin thanked her by giving her a cupcake and a rose. His little gesture of kindness was overshadowed by the large gift basket the ${link_3} brought in name of ${link_4} ${link_5}. Bolin immediately inquired whether or not that \"Tarrlok guy\" was bothering Korra, as he was willing to have a word with him. When Korra laughed it off, saying that Tarrlok was just \"some old guy\", Bolin expressed joy upon hearing this, stating, \"That sounds better, I like that better.\" Soon after, Bolin talked to ${link_6} about Korra being his future girlfriend, saying that he and Korra would be perfect for each other. Although Mako was against it, Bolin asked Korra out and took her to ${link_7} for their date. They ate dinner, had fun, and took a trip to ${link_8}'s ${link_9} to gaze out over the city's skyline. Bolin bought Korra a bouquet of flowers the next day, but witnessed her kissing Mako, which reduced him to tears. Bolin's considerate, affectionate, and sweet treatment of Korra has strongly increased fan support for the ship. Though Korra ultimately entered a romantic relationship with Mako, the couple later split up, keeping hopes for Borra alive.",
      "links": [
        {
          "body": "Toza",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Toza",
            "page": "Toza"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "Fire Ferrets",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries_Fire_Ferrets",
            "page": "Future_Industries_Fire_Ferrets"
          }
        },
        {
          "body": "council page",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Council_page",
            "page": "Council_page"
          }
        },
        {
          "body": "Councilman",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Mako",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Narook's Seaweed Noodlery",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Narook%27s_Seaweed_Noodlery",
            "page": "Narook%27s_Seaweed_Noodlery"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Harmony Tower",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Harmony_Tower",
            "page": "Harmony_Tower"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Bolin and Korra – known as \"Borra\", fans known as \"Borriors\" – This ship has a lot of fans that would like to see Korra and Bolin have a non-platonic relationship. Bolin convinced Toza to let Korra pass by after she sneaked into the Pro-bending Arena, and invited her back to the teams' locker room to watch the match. The two soon became friends; he willingly showed her some pro-bending tricks and was quick to accept her on the Fire Ferrets pro-bending team. After Korra helped to rescue Bolin out of the clutches of Amon, Bolin thanked her by giving her a cupcake and a rose. His little gesture of kindness was overshadowed by the large gift basket the council page brought in name of Councilman Tarrlok. Bolin immediately inquired whether or not that \"Tarrlok guy\" was bothering Korra, as he was willing to have a word with him. When Korra laughed it off, saying that Tarrlok was just \"some old guy\", Bolin expressed joy upon hearing this, stating, \"That sounds better, I like that better.\" Soon after, Bolin talked to Mako about Korra being his future girlfriend, saying that he and Korra would be perfect for each other. Although Mako was against it, Bolin asked Korra out and took her to Narook's Seaweed Noodlery for their date. They ate dinner, had fun, and took a trip to Republic City's Harmony Tower to gaze out over the city's skyline. Bolin bought Korra a bouquet of flowers the next day, but witnessed her kissing Mako, which reduced him to tears. Bolin's considerate, affectionate, and sweet treatment of Korra has strongly increased fan support for the ship. Though Korra ultimately entered a romantic relationship with Mako, the couple later split up, keeping hopes for Borra alive."
    },
    {
      "body": "Bolin and Asami – known as \"Bosami\", fans known as \"Bosamites\" – This undeveloped ship is occasionally promoted by Makorra advocates, conveniently pairing Asami with Bolin to solve ${link_0}'s love interest in Mako and Bolin's love interest in Korra. Makorra advocates also use it to ship the new ${link_1} as Makorra and Bosami. The two have interacted infrequently, but Bolin enjoyed living in Asami's mansion after the closing of the Pro-bending Arena. He also seems to trust Asami with ${link_2}, as she was seen holding Pabu when Mako and Bolin are preparing to move out of the arena. In search of Korra, Bolin told Asami about Mako's true love, revealing Korra and Mako's first kiss. Days later, Bolin aided Asami in defeating ${link_3} by launching earth boulders at Sato's ${link_4}, saving Asami's life. As the two developed a much stronger relationship throughout the second season, the support for \"Bosami\" had grown greatly throughout the fandom. The ship was particularly supported by people who were not fond of Mako or Korra's behaviors, as a way to ship the two other members of Team Avatar.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Pabu",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Pabu",
            "page": "Pabu"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "mecha tank",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_tank",
            "page": "Mecha_tank"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Bolin and Asami – known as \"Bosami\", fans known as \"Bosamites\" – This undeveloped ship is occasionally promoted by Makorra advocates, conveniently pairing Asami with Bolin to solve Asami's love interest in Mako and Bolin's love interest in Korra. Makorra advocates also use it to ship the new Team Avatar as Makorra and Bosami. The two have interacted infrequently, but Bolin enjoyed living in Asami's mansion after the closing of the Pro-bending Arena. He also seems to trust Asami with Pabu, as she was seen holding Pabu when Mako and Bolin are preparing to move out of the arena. In search of Korra, Bolin told Asami about Mako's true love, revealing Korra and Mako's first kiss. Days later, Bolin aided Asami in defeating Hiroshi Sato by launching earth boulders at Sato's mecha tank, saving Asami's life. As the two developed a much stronger relationship throughout the second season, the support for \"Bosami\" had grown greatly throughout the fandom. The ship was particularly supported by people who were not fond of Mako or Korra's behaviors, as a way to ship the two other members of Team Avatar."
    },
    {
      "body": "Kai and Jinora – known as \"Kainora\" or \"Jinkai\", fans known as \"Kainorians\" – This ship began when ${link_0} and ${link_1} first met in a small village in the ${link_2}. Quite quickly, Kai and Jinora started to notice each other, and their bond began to strengthen during Kai's training on the airship. Their relationship got even stronger when Jinora used her spiritual abilities to find Kai, who was being held capture in the ${link_3}'s secret airbender training facility under the Upper ring of ${link_4}. After being freed, Kai and the other airbenders, accompanied by ${link_5} and Jinora, traveled to the ${link_6}, where they pursued their training. During his breaks from training sessions, Kai spent much time with Jinora as they went to look for young sky bison. Later, the duo was captured by ${link_7}, who were transporting young sky bison to Ba Sing Se. With the help of the other airbending students and Tenzin, Kai managed to free Jinora from her captors. By 174 AG, they had started dating.",
      "links": [
        {
          "body": "Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kai",
            "page": "Kai"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Northern Air Temple",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        },
        {
          "body": "bison rustlers",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Bison_rustlers",
            "page": "Bison_rustlers"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Kai and Jinora – known as \"Kainora\" or \"Jinkai\", fans known as \"Kainorians\" – This ship began when Kai and Jinora first met in a small village in the Earth Kingdom. Quite quickly, Kai and Jinora started to notice each other, and their bond began to strengthen during Kai's training on the airship. Their relationship got even stronger when Jinora used her spiritual abilities to find Kai, who was being held capture in the Dai Li's secret airbender training facility under the Upper ring of Ba Sing Se. After being freed, Kai and the other airbenders, accompanied by Tenzin and Jinora, traveled to the Northern Air Temple, where they pursued their training. During his breaks from training sessions, Kai spent much time with Jinora as they went to look for young sky bison. Later, the duo was captured by bison rustlers, who were transporting young sky bison to Ba Sing Se. With the help of the other airbending students and Tenzin, Kai managed to free Jinora from her captors. By 174 AG, they had started dating."
    },
    {
      "body": "Korra and Asami – known as \"Korrasami\", fans known as \"Korrasamians\" or the \"Korrasarmy\" – This ship became immediately popular after Asami's debut, and after ${link_0}, won a fandom poll on Tumblr as the most popular ship. The ship, initially intended by the creators to become only a close friendship, became more hinted at during the last season to be developing into a romance. During the first season, Asami showed persistent goodwill toward Korra, which overcame the ${link_1}'s initial hostility, and refused to blame Korra for the difficulties she was having in her relationship with Mako. Korra, in turn, seemed impressed by Asami after she demonstrated her racing skills, to the point of apologizing for misjudging her. Further, in Book Three, the two girls expressed a strong friendship in which they both apologized for hurting each other in Book One. Asami became Korra's driving instructor and Korra even referred to Asami as a platonic \"girlfriend\", while expressing that Asami was the only good female friend she had ever had besides Naga. The two also engaged in friendly humor poking fun at Mako, as after he and Korra broke up he began behaving awkwardly whenever he was around either of them. Throughout Team Avatar's journey in search of new airbenders, and later during their interactions with the Red Lotus, Korra and Asami frequently teamed up together. While attempting to escape from the Red Lotus, Asami carried an unconscious Korra on Naga, and the two also worked together to escape a ${link_2} after being stranded in the ${link_3}. On the day of Jinora's anointment as an airbending master, Asami tended to Korra, who had been left weak and wheelchair-bound from ${link_4} poisoning, and offered to be there for her in case she needed to talk, \"or anything\", subsequently spending the rest of the ceremony at Korra's side. This showed the deep bond that the two girls shared, and also how much Asami cared for Korra. After defeating the ${link_5}, their relationship strengthened, with Asami helping Korra get around after the young Avatar was bound to her wheelchair. Despite Korra's return to the ${link_6}, they remained in contact via letters and although Mako and Bolin also sent letters, Korra only replied to Asami, stating that she felt that she could only confide in Asami about the hardships and fears she faced. The two reunited during lunch following Korra's return to Republic City. After sharing a quick hug, Asami complimented Korra on her new hair, prompting the latter to blush and remark that the engineer looked \"snazzy\" as always. After defeating Kuvira, they both attended Varrick and Zhu Li's wedding, where they took a moment for themselves. Asami said she could not have handled losing both her father and Korra in the same day. After Korra comforted her with a hug, Asami expressed her desire to take a vacation. Korra supported this and they decided to go into the Spirit World together, just the two of them. As they approached the newly created spirit portal in the middle of Republic City, they held hands and, once at the portal itself, they turned to face each other as they crossed into the Spirit World. Many fans, even those who do not ship Korrasami, see this as the signs of the beginning of a romantic relationship. In addition, Mike DiMartino shared the link to an article that had a section talking about the romantic implications of the scene and several people who have worked on The Legend of Korra admitted to shipping Korrasami, including ${link_7}, ${link_8}, ${link_9}, and ${link_10}. ${link_11} later confirmed through his Tumblr that the ship was canon. There relationship was later further explored in the graphic novel trilogy ${link_12}.",
      "links": [
        {
          "body": "Book One",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Book_One__Air",
            "page": "Book_One__Air"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "sand shark",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Sand_shark",
            "page": "Sand_shark"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        },
        {
          "body": "mercury",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Mercury",
            "page": "Mercury"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Jeremy Zuckerman",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Jeremy_Zuckerman",
            "page": "Jeremy_Zuckerman"
          }
        },
        {
          "body": "Dante Basco",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Dante_Basco",
            "page": "Dante_Basco"
          }
        },
        {
          "body": "Janet Varney",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Janet_Varney",
            "page": "Janet_Varney"
          }
        },
        {
          "body": "Seychelle Gabriel",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/Seychelle_Gabriel",
            "page": "Seychelle_Gabriel"
          }
        },
        {
          "body": "Bryan Konietzko",
          "key": "${link_11}",
          "target": {
            "external": false,
            "href": "/wiki/Bryan_Konietzko",
            "page": "Bryan_Konietzko"
          }
        },
        {
          "body": "Turf Wars",
          "key": "${link_12}",
          "target": {
            "external": false,
            "href": "/wiki/Turf_Wars",
            "page": "Turf_Wars"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Korra and Asami – known as \"Korrasami\", fans known as \"Korrasamians\" or the \"Korrasarmy\" – This ship became immediately popular after Asami's debut, and after Book One, won a fandom poll on Tumblr as the most popular ship. The ship, initially intended by the creators to become only a close friendship, became more hinted at during the last season to be developing into a romance. During the first season, Asami showed persistent goodwill toward Korra, which overcame the Avatar's initial hostility, and refused to blame Korra for the difficulties she was having in her relationship with Mako. Korra, in turn, seemed impressed by Asami after she demonstrated her racing skills, to the point of apologizing for misjudging her. Further, in Book Three, the two girls expressed a strong friendship in which they both apologized for hurting each other in Book One. Asami became Korra's driving instructor and Korra even referred to Asami as a platonic \"girlfriend\", while expressing that Asami was the only good female friend she had ever had besides Naga. The two also engaged in friendly humor poking fun at Mako, as after he and Korra broke up he began behaving awkwardly whenever he was around either of them. Throughout Team Avatar's journey in search of new airbenders, and later during their interactions with the Red Lotus, Korra and Asami frequently teamed up together. While attempting to escape from the Red Lotus, Asami carried an unconscious Korra on Naga, and the two also worked together to escape a sand shark after being stranded in the Si Wong Desert. On the day of Jinora's anointment as an airbending master, Asami tended to Korra, who had been left weak and wheelchair-bound from mercury poisoning, and offered to be there for her in case she needed to talk, \"or anything\", subsequently spending the rest of the ceremony at Korra's side. This showed the deep bond that the two girls shared, and also how much Asami cared for Korra. After defeating the Red Lotus, their relationship strengthened, with Asami helping Korra get around after the young Avatar was bound to her wheelchair. Despite Korra's return to the Southern Water Tribe, they remained in contact via letters and although Mako and Bolin also sent letters, Korra only replied to Asami, stating that she felt that she could only confide in Asami about the hardships and fears she faced. The two reunited during lunch following Korra's return to Republic City. After sharing a quick hug, Asami complimented Korra on her new hair, prompting the latter to blush and remark that the engineer looked \"snazzy\" as always. After defeating Kuvira, they both attended Varrick and Zhu Li's wedding, where they took a moment for themselves. Asami said she could not have handled losing both her father and Korra in the same day. After Korra comforted her with a hug, Asami expressed her desire to take a vacation. Korra supported this and they decided to go into the Spirit World together, just the two of them. As they approached the newly created spirit portal in the middle of Republic City, they held hands and, once at the portal itself, they turned to face each other as they crossed into the Spirit World. Many fans, even those who do not ship Korrasami, see this as the signs of the beginning of a romantic relationship. In addition, Mike DiMartino shared the link to an article that had a section talking about the romantic implications of the scene and several people who have worked on The Legend of Korra admitted to shipping Korrasami, including Jeremy Zuckerman, Dante Basco, Janet Varney, and Seychelle Gabriel. Bryan Konietzko later confirmed through his Tumblr that the ship was canon. There relationship was later further explored in the graphic novel trilogy Turf Wars."
    },
    {
      "body": "Amon and Lieutenant – known as \"Lieumon\" – The pairing between ${link_0} and Amon is perhaps one of the most popular manslash pairings that exists in the Avatar universe. The pairing was inspired by the close professional relationship they have, as well as the Lieutenant's strong admiration for Amon. Additionally, upon the revelation that the ${link_1} leader was in fact a ${link_2}, the Lieutenant appeared heartbroken, yelling that he had dedicated his life to Amon – this moment, coupled with the death of Amon, has led to an explosion of fan interest in this ship online.",
      "links": [
        {
          "body": "Lieutenant",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lieutenant",
            "page": "Lieutenant"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "bloodbender",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Bloodbending",
            "page": "Bloodbending"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Amon and Lieutenant – known as \"Lieumon\" – The pairing between Lieutenant and Amon is perhaps one of the most popular manslash pairings that exists in the Avatar universe. The pairing was inspired by the close professional relationship they have, as well as the Lieutenant's strong admiration for Amon. Additionally, upon the revelation that the Equalist leader was in fact a bloodbender, the Lieutenant appeared heartbroken, yelling that he had dedicated his life to Amon – this moment, coupled with the death of Amon, has led to an explosion of fan interest in this ship online."
    },
    {
      "body": "Tenzin and Lin Beifong – known as \"Linzin\" or \"Tenlin\" – As the son of the Avatar and the daughter of one of his good friends, they have known each other since childhood. They were once romantically involved, but began to drift apart due to \"different goals in life\"; one of the different goals was later confirmed to be that Tenzin wanted children whereas Lin did not. ${link_0} told Korra that she could not watch Tenzin spend his life with \"the wrong woman\". Tenzin broke up with Lin after Pema confessed her love for him. However, there is still friction between the ${link_1} and the ${link_2}. Korra even suggested that Lin has still not gotten over what happened. Lin agreed to Tenzin's request to be lenient with Korra when she destroyed public property in Republic City, and promised to act with more decorum during the ${link_3} when he asked her. Furthermore, Lin was willing to help out her old boyfriend by protecting his family while he went to an urgent council meeting, and even put her life and bending abilities on the line in order to buy Tenzin and his family time from the pursuing Equalists.",
      "links": [
        {
          "body": "Pema",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pema",
            "page": "Pema"
          }
        },
        {
          "body": "chief",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Chief_of_Police",
            "page": "Chief_of_Police"
          }
        },
        {
          "body": "airbender",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Pro-bending Championship Tournament",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending#Pro-bending_Tournament",
            "page": "Pro-bending"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Tenzin and Lin Beifong – known as \"Linzin\" or \"Tenlin\" – As the son of the Avatar and the daughter of one of his good friends, they have known each other since childhood. They were once romantically involved, but began to drift apart due to \"different goals in life\"; one of the different goals was later confirmed to be that Tenzin wanted children whereas Lin did not. Pema told Korra that she could not watch Tenzin spend his life with \"the wrong woman\". Tenzin broke up with Lin after Pema confessed her love for him. However, there is still friction between the chief and the airbender. Korra even suggested that Lin has still not gotten over what happened. Lin agreed to Tenzin's request to be lenient with Korra when she destroyed public property in Republic City, and promised to act with more decorum during the Pro-bending Championship Tournament when he asked her. Furthermore, Lin was willing to help out her old boyfriend by protecting his family while he went to an urgent council meeting, and even put her life and bending abilities on the line in order to buy Tenzin and his family time from the pursuing Equalists."
    },
    {
      "body": "Mako and Korra – known as \"Makorra\", fans known as \"Makorrians\" – This wildly popular ship was inspired well before the series debuted due to hints that Mako would be Korra's love interest, and is currently the second most popular ship in the series. When Korra and Mako first encountered, Makorra hints were present, causing the shipping to peak. The ship went viral once a promotional trailer showed a shot of Korra kissing Mako. ${link_0} and ${link_1} explicitly stated the fact that Korra has a crush on Mako, the two involuntarily fell asleep on each other at ${link_2}, and when the two posed as a couple to infiltrate Amon's rally to save Bolin, Korra was seen wearing Mako's beloved scarf. In fact, Mako's scarf has been a center argument for many fans, claiming it is similar to the \"${link_3}\", an idea in Eastern mythology that the gods might tie two lover's fates together with a red string so that they will meet and never separate. Furthermore, Korra is revealed to be jealous of Asami and Mako's budding relationship. When Korra admitted her feelings to Mako, he initially shot her down, but after witnessing her going on a date with Bolin, Mako expressed feelings of jealousy. When Korra later kissed him by surprise, he willingly kissed her back, complicating his relationship with Asami and his brother. Mako continued having an interest in Korra's welfare, as he was the first to hug her after she faced off against some Equalists and he was the one who attempted to carry Korra out of the ${link_4} when he could have carried Lin or Tenzin as well, but left them for his brother. After Korra was retrieved by ${link_5} after Tarrlok imprisoned her, he ordered the others to give her some space, picking her up and carrying her to ${link_6}. He proceeded to brush her hair out of her face tenderly, telling her she was safe. When Korra was recovering from her imprisonment, Mako was at her bedside and even held her hand. He even comforted Korra when she was upset about ${link_7} being taken over by Equalists. After Korra had lost her bending, Mako came to her and told her how he felt, telling Korra that he loved her. After Korra went into the Avatar State, Korra told him that she loved him as well. Mako and Korra subsequently kissed for the second time, this time mutually. Throughout Book Two, the two seemed to have a struggling relationship at certain points, but hit it off at others. However, once the pairing split due to the conflicted interests of Mako and Korra, some of the shippers abandoned the pairing. However, this was nowhere near the majority of the ship's fanbase, and many people imagine scenarios in which the two would reunite. The couple solidified their break-up after ${link_8}, kissing one last time and promising that they would always love each other. In later seasons, Makorra moments still appeared, but they were more subtle, mainly hugs and meaningful looks between the two characters rather than the previous kisses and outright love confessions. It remains very possible that Mako is still in love with Korra long after their breakup. When Wu asks Mako if he has a lady in his life, Mako looks down, almost regretfully, and replies \"No, not since Korra and I broke up.\" He also passionately talks about how much Korra means to him, and how she changed him for the better and continues to inspire him with her loyalty and bravery, even if they are no longer in a romantic relationship.",
      "links": [
        {
          "body": "Ikki",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ikki",
            "page": "Ikki"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Republic City Park",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar_Korra_Park",
            "page": "Avatar_Korra_Park"
          }
        },
        {
          "body": "red string of fate",
          "key": "${link_3}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Red_string_of_fate",
            "page": "http://en.wikipedia.org/wiki/Red_string_of_fate"
          }
        },
        {
          "body": "Equalist factory",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Equalist_factory",
            "page": "Equalist_factory"
          }
        },
        {
          "body": "Naga",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Naga",
            "page": "Naga"
          }
        },
        {
          "body": "Oogi",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Oogi",
            "page": "Oogi"
          }
        },
        {
          "body": "Air Temple Island",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Mako and Korra – known as \"Makorra\", fans known as \"Makorrians\" – This wildly popular ship was inspired well before the series debuted due to hints that Mako would be Korra's love interest, and is currently the second most popular ship in the series. When Korra and Mako first encountered, Makorra hints were present, causing the shipping to peak. The ship went viral once a promotional trailer showed a shot of Korra kissing Mako. Ikki and Jinora explicitly stated the fact that Korra has a crush on Mako, the two involuntarily fell asleep on each other at Republic City Park, and when the two posed as a couple to infiltrate Amon's rally to save Bolin, Korra was seen wearing Mako's beloved scarf. In fact, Mako's scarf has been a center argument for many fans, claiming it is similar to the \"red string of fate\", an idea in Eastern mythology that the gods might tie two lover's fates together with a red string so that they will meet and never separate. Furthermore, Korra is revealed to be jealous of Asami and Mako's budding relationship. When Korra admitted her feelings to Mako, he initially shot her down, but after witnessing her going on a date with Bolin, Mako expressed feelings of jealousy. When Korra later kissed him by surprise, he willingly kissed her back, complicating his relationship with Asami and his brother. Mako continued having an interest in Korra's welfare, as he was the first to hug her after she faced off against some Equalists and he was the one who attempted to carry Korra out of the Equalist factory when he could have carried Lin or Tenzin as well, but left them for his brother. After Korra was retrieved by Naga after Tarrlok imprisoned her, he ordered the others to give her some space, picking her up and carrying her to Oogi. He proceeded to brush her hair out of her face tenderly, telling her she was safe. When Korra was recovering from her imprisonment, Mako was at her bedside and even held her hand. He even comforted Korra when she was upset about Air Temple Island being taken over by Equalists. After Korra had lost her bending, Mako came to her and told her how he felt, telling Korra that he loved her. After Korra went into the Avatar State, Korra told him that she loved him as well. Mako and Korra subsequently kissed for the second time, this time mutually. Throughout Book Two, the two seemed to have a struggling relationship at certain points, but hit it off at others. However, once the pairing split due to the conflicted interests of Mako and Korra, some of the shippers abandoned the pairing. However, this was nowhere near the majority of the ship's fanbase, and many people imagine scenarios in which the two would reunite. The couple solidified their break-up after Harmonic Convergence, kissing one last time and promising that they would always love each other. In later seasons, Makorra moments still appeared, but they were more subtle, mainly hugs and meaningful looks between the two characters rather than the previous kisses and outright love confessions. It remains very possible that Mako is still in love with Korra long after their breakup. When Wu asks Mako if he has a lady in his life, Mako looks down, almost regretfully, and replies \"No, not since Korra and I broke up.\" He also passionately talks about how much Korra means to him, and how she changed him for the better and continues to inspire him with her loyalty and bravery, even if they are no longer in a romantic relationship."
    },
    {
      "body": "Asami and Mako – known as \"Masami\", fans known as \"Masamites\" – This ship began when Asami accidentally hit Mako with her moped, introducing the two. Upon laying eyes on her, Mako was smitten by Asami's beauty. To make up for the accident, Asami asked him on a date to ${link_0}, at which Asami held Mako's hand. At Tarrlok's ${link_1}, the two went as a couple and Asami was seen consistently holding Mako's arm. Later on, the two went on a carriage ride through Republic City Park where they expressed their emotions, eventually leading to the two cuddling. Mako was willing to threaten his friendship with Korra when she insisted on going after Asami's father, immediately choosing Asami over Korra. He also cares deeply for Asami's safety and is protective over her, venturing down a possibly dangerous road in her ${link_2} to uncover information for her. However, Asami expressed hurt and confusion upon Bolin's revelation of Mako and Korra's kiss. Before the team separated to defeat the Equalists, Mako and Asami broke up, but she reaffirmed her trust in him. After Mako broke up with Korra, Asami and Mako went out on a boat ride around Republic City. Asami learned of Mako's break-up with Korra, and shortly thereafter kissed him. A short amount of time later, they had reunited, much to Bolin's surprise, as Mako had only been broken up with Korra for a week. However, they continued a relationship, until Mako was arrested, though he blamed ${link_3} for his problems. Mako declared that he would never do anything to hurt Asami as he was arrested by the ${link_4}.",
      "links": [
        {
          "body": "Kwong's Cuisine",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kwong%27s_Cuisine",
            "page": "Kwong%27s_Cuisine"
          }
        },
        {
          "body": "gala",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/City_Hall",
            "page": "City_Hall"
          }
        },
        {
          "body": "mansion",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Sato_estate",
            "page": "Sato_estate"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "police",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Lu_and_Gang",
            "page": "Lu_and_Gang"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Asami and Mako – known as \"Masami\", fans known as \"Masamites\" – This ship began when Asami accidentally hit Mako with her moped, introducing the two. Upon laying eyes on her, Mako was smitten by Asami's beauty. To make up for the accident, Asami asked him on a date to Kwong's Cuisine, at which Asami held Mako's hand. At Tarrlok's gala, the two went as a couple and Asami was seen consistently holding Mako's arm. Later on, the two went on a carriage ride through Republic City Park where they expressed their emotions, eventually leading to the two cuddling. Mako was willing to threaten his friendship with Korra when she insisted on going after Asami's father, immediately choosing Asami over Korra. He also cares deeply for Asami's safety and is protective over her, venturing down a possibly dangerous road in her mansion to uncover information for her. However, Asami expressed hurt and confusion upon Bolin's revelation of Mako and Korra's kiss. Before the team separated to defeat the Equalists, Mako and Asami broke up, but she reaffirmed her trust in him. After Mako broke up with Korra, Asami and Mako went out on a boat ride around Republic City. Asami learned of Mako's break-up with Korra, and shortly thereafter kissed him. A short amount of time later, they had reunited, much to Bolin's surprise, as Mako had only been broken up with Korra for a week. However, they continued a relationship, until Mako was arrested, though he blamed Varrick for his problems. Mako declared that he would never do anything to hurt Asami as he was arrested by the police."
    },
    {
      "body": "Pema and Tenzin – known as \"Pemzin\" – Pema fell in love with Tenzin while he was still in a relationship with Lin Beifong, but was afraid Tenzin would spend his life with the wrong woman. She confessed her love to him, and he broke up with Lin as their relationship was already drifting apart. During The Legend of Korra, Pema and Tenzin are happily married with three kids, with their ${link_0} being born during the series. Fans have expressed shock over the sixteen year age difference between them, but that has not stopped people from enjoying and celebrating their relationship.",
      "links": [
        {
          "body": "fourth child",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Rohan",
            "page": "Rohan"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Pema and Tenzin – known as \"Pemzin\" – Pema fell in love with Tenzin while he was still in a relationship with Lin Beifong, but was afraid Tenzin would spend his life with the wrong woman. She confessed her love to him, and he broke up with Lin as their relationship was already drifting apart. During The Legend of Korra, Pema and Tenzin are happily married with three kids, with their fourth child being born during the series. Fans have expressed shock over the sixteen year age difference between them, but that has not stopped people from enjoying and celebrating their relationship."
    },
    {
      "body": "Tahno and Korra – known as \"Tahnorra\", fans known as \"Tahnorrians\" or \"Tahnorrites\" – This ship began when a promo was released revealing ${link_0} and Korra standing in close quarters. During this interaction, Korra challenged him to a fight, calling him \"pretty boy\", before the ${link_1} ${link_2} uttered: \"Go for it.\" This first interaction occurred while the Avatar was on a date with Bolin, when Korra saw that Tahno was staring at them. Tahno walked over to her and offered her pro-bending \"private lessons\". This single scene resulted in a constantly expanding fandom. Korra and Tahno also interacted when Tahno was at the ${link_3} after he lost his ${link_4}. He wanted Korra to get Amon on his behalf, to which she nodded in acceptance. Their conversation ended with Tahno saying, \"See you around, Uh-vatar,\" with a smile.",
      "links": [
        {
          "body": "Tahno",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tahno",
            "page": "Tahno"
          }
        },
        {
          "body": "Wolfbats'",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/White_Falls_Wolfbats",
            "page": "White_Falls_Wolfbats"
          }
        },
        {
          "body": "waterbender",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "police headquarters",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Police_headquarters",
            "page": "Police_headquarters"
          }
        },
        {
          "body": "bending",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Bloodbending#Bending_severing",
            "page": "Bloodbending"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Tahno and Korra – known as \"Tahnorra\", fans known as \"Tahnorrians\" or \"Tahnorrites\" – This ship began when a promo was released revealing Tahno and Korra standing in close quarters. During this interaction, Korra challenged him to a fight, calling him \"pretty boy\", before the Wolfbats' waterbender uttered: \"Go for it.\" This first interaction occurred while the Avatar was on a date with Bolin, when Korra saw that Tahno was staring at them. Tahno walked over to her and offered her pro-bending \"private lessons\". This single scene resulted in a constantly expanding fandom. Korra and Tahno also interacted when Tahno was at the police headquarters after he lost his bending. He wanted Korra to get Amon on his behalf, to which she nodded in acceptance. Their conversation ended with Tahno saying, \"See you around, Uh-vatar,\" with a smile."
    },
    {
      "body": "Wu and Mako - known as \"Wuko\" - This ship became popular soon after Wu's introduction. Wu and Mako were regularly seen with one another as a result of Mako being assigned as Wu's bodyguard, with the firebender at one point forced to carry Wu on his back. Wu was also unable to go anywhere or do anything without Mako present for the majority of ${link_0}. With every core member of Team Avatar canonically romantically involved with someone at the end of the series except for Mako, this ship is often used to make everyone be in a relationship.",
      "links": [
        {
          "body": "Book Four",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Book_Four__Balance",
            "page": "Book_Four__Balance"
          }
        }
      ],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Wu and Mako - known as \"Wuko\" - This ship became popular soon after Wu's introduction. Wu and Mako were regularly seen with one another as a result of Mako being assigned as Wu's bodyguard, with the firebender at one point forced to carry Wu on his back. Wu was also unable to go anywhere or do anything without Mako present for the majority of Book Four. With every core member of Team Avatar canonically romantically involved with someone at the end of the series except for Mako, this ship is often used to make everyone be in a relationship."
    },
    {
      "body": "Zhu Li and Varrick  - known as \"Zhurrick\" - Zhu Li always was very devoted to Varrick, although he did not acknowledge her as anything more than his assistant who did everything for him. When her life was in danger due to nearly falling out of Kuvira's train, Zhu Li was impressed that he had saved her, addressing him in a romantic fashion, though Varrick broke her mood after pointing out that he only did so as he needed help cleaning up the mess left by an explosion. Although Zhu Li later turned on Varrick and proclaimed her loyalty to Kuvira, she only did so in order to sabotage Kuvira's operations. Bolin later returned Zhu Li to Varrick after Kuvira exposed her for her sabotage and attempted to eliminate her the spirit vine weapon. She revealed to Varrick that he \"[meant] the world\" to her and apologized for hurting him, showing the strong bond that she shared with Varrick, even after working for Kuvira. After this, Varrick once again broke the mood by addressing her as his assistant and sending her back to work immediately, to which she angrily demanded that he treat her as an equal if he wanted her to continue working with him.",
      "links": [],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "Zhu Li and Varrick  - known as \"Zhurrick\" - Zhu Li always was very devoted to Varrick, although he did not acknowledge her as anything more than his assistant who did everything for him. When her life was in danger due to nearly falling out of Kuvira's train, Zhu Li was impressed that he had saved her, addressing him in a romantic fashion, though Varrick broke her mood after pointing out that he only did so as he needed help cleaning up the mess left by an explosion. Although Zhu Li later turned on Varrick and proclaimed her loyalty to Kuvira, she only did so in order to sabotage Kuvira's operations. Bolin later returned Zhu Li to Varrick after Kuvira exposed her for her sabotage and attempted to eliminate her the spirit vine weapon. She revealed to Varrick that he \"[meant] the world\" to her and apologized for hurting him, showing the strong bond that she shared with Varrick, even after working for Kuvira. After this, Varrick once again broke the mood by addressing her as his assistant and sending her back to work immediately, to which she angrily demanded that he treat her as an equal if he wanted her to continue working with him."
    },
    {
      "body": "During Kuvira's attack on Republic City, Varrick displayed his affection for Zhu Li by telling a story from his childhood, only to be cut off by the impending attack. Later in the attack, Varrick and Zhu Li piloted a hummingbird prototype created by Varrick and Asami. Aware of the impending danger, before taking off, Varrick proposed to Zhu Li, to which she happily accepted, followed by the two sharing a loving kiss before launching the attack. Shortly after Kuvira's defeat, Zhu Li and Varrick married, cementing their romantic relationship.",
      "links": [],
      "section": [
        "Shipping",
        "Popular ships",
        "The Legend of Korra"
      ],
      "text": "During Kuvira's attack on Republic City, Varrick displayed his affection for Zhu Li by telling a story from his childhood, only to be cut off by the impending attack. Later in the attack, Varrick and Zhu Li piloted a hummingbird prototype created by Varrick and Asami. Aware of the impending danger, before taking off, Varrick proposed to Zhu Li, to which she happily accepted, followed by the two sharing a loving kiss before launching the attack. Shortly after Kuvira's defeat, Zhu Li and Varrick married, cementing their romantic relationship."
    },
    {
      "body": "Fans often had a \"fan preferred couple\" which they attempted to find reasons to substantiate as well as reasons to disregard other possible matches with these characters. Some fans even designated a pairing which they defended fervently. ${link_0} was written extensively; forums were filled with \"shipping\" theories and rumors. This often resulted in conflicts between conflicting \"shippings\", the most well-known example being between \"Kataang\" and \"Zutara\".",
      "links": [
        {
          "body": "Fanon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar_fanon",
            "page": "Avatar_fanon"
          }
        }
      ],
      "section": [
        "Shipping",
        "\"Shipping wars\""
      ],
      "text": "Fans often had a \"fan preferred couple\" which they attempted to find reasons to substantiate as well as reasons to disregard other possible matches with these characters. Some fans even designated a pairing which they defended fervently. Fanon was written extensively; forums were filled with \"shipping\" theories and rumors. This often resulted in conflicts between conflicting \"shippings\", the most well-known example being between \"Kataang\" and \"Zutara\"."
    },
    {
      "body": "Supporters on both sides became increasingly antagonistic to the other \"ship\" and theories extended beyond how their \"ship\" was correct to how the other \"ship\" was incorrect. Often, shippers would cite how one member of the opposing ship was or should be romantically attracted to a different person.",
      "links": [],
      "section": [
        "Shipping",
        "\"Shipping wars\""
      ],
      "text": "Supporters on both sides became increasingly antagonistic to the other \"ship\" and theories extended beyond how their \"ship\" was correct to how the other \"ship\" was incorrect. Often, shippers would cite how one member of the opposing ship was or should be romantically attracted to a different person."
    },
    {
      "body": "Because the canonical \"ships\" remained unrevealed throughout most of the show, fans constantly debated their preferred \"ships\". At one point, the creators, ${link_0} and ${link_1}, said they were inclined to \"Kataang\", but did not say outright that it was correct, noting \"Zutara\" as an interesting concept. They also expressed surprise about the concept of \"shipping\".",
      "links": [
        {
          "body": "Michael Dante DiMartino",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Michael_Dante_DiMartino",
            "page": "Michael_Dante_DiMartino"
          }
        },
        {
          "body": "Bryan Konietzko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bryan_Konietzko",
            "page": "Bryan_Konietzko"
          }
        }
      ],
      "section": [
        "Shipping",
        "\"Shipping wars\""
      ],
      "text": "Because the canonical \"ships\" remained unrevealed throughout most of the show, fans constantly debated their preferred \"ships\". At one point, the creators, Michael Dante DiMartino and Bryan Konietzko, said they were inclined to \"Kataang\", but did not say outright that it was correct, noting \"Zutara\" as an interesting concept. They also expressed surprise about the concept of \"shipping\"."
    },
    {
      "body": "The \"shipping wars\" had a generally negative impact on the Avatar fan community. Although some of the canonical \"ships\" have now been revealed, there is still an antagonistic feeling among a number of Avatar fans. With the release of The Legend of Korra, the \"shipping wars\" now concern the conflicting ships of this series, particularly \"Makorra\", \"Masami\", and \"Korrasami\".",
      "links": [],
      "section": [
        "Shipping",
        "\"Shipping wars\""
      ],
      "text": "The \"shipping wars\" had a generally negative impact on the Avatar fan community. Although some of the canonical \"ships\" have now been revealed, there is still an antagonistic feeling among a number of Avatar fans. With the release of The Legend of Korra, the \"shipping wars\" now concern the conflicting ships of this series, particularly \"Makorra\", \"Masami\", and \"Korrasami\"."
    },
    {
      "body": "Shipping War I – This shipping war took place primarily during Avatar: The Last Airbender, but continued after its end. It mainly revolved around the Kataang, Zutara, and Maiko ships.",
      "links": [],
      "section": [
        "Shipping",
        "\"Shipping wars\""
      ],
      "text": "Shipping War I – This shipping war took place primarily during Avatar: The Last Airbender, but continued after its end. It mainly revolved around the Kataang, Zutara, and Maiko ships."
    },
    {
      "body": "Shipping War II – This shipping war takes place during the series of The Legend of Korra and has continued after the shows end. It mainly revolves around the Makorra, Masami, and Korrasami ships.",
      "links": [],
      "section": [
        "Shipping",
        "\"Shipping wars\""
      ],
      "text": "Shipping War II – This shipping war takes place during the series of The Legend of Korra and has continued after the shows end. It mainly revolves around the Makorra, Masami, and Korrasami ships."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Avatar fanon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar_fanon",
            "page": "Avatar_fanon"
          }
        }
      ],
      "section": [
        "Shipping",
        "See also"
      ],
      "text": "Avatar fanon"
    },
    {
      "body": "${link_0}, on which this article was based, contains a more extensive list of \"ships\", including crack \"ships\"",
      "links": [
        {
          "body": "Fanon article",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fanon:Shippings",
            "page": "Fanon:Shippings"
          }
        }
      ],
      "section": [
        "Shipping",
        "See also"
      ],
      "text": "Fanon article, on which this article was based, contains a more extensive list of \"ships\", including crack \"ships\""
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Romance",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Romance",
            "page": "Romance"
          }
        }
      ],
      "section": [
        "Shipping",
        "See also"
      ],
      "text": "Romance"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Shipping",
    "file": "avatar.wikia.com/wiki/Shipping.html",
    "page": "Shipping",
    "title": "Shipping"
  }
}