{
  "categories": [
    {
      "body": "Featured articles",
      "target": {
        "href": "Category_Featured_articles",
        "page": "Category_Featured_articles"
      }
    },
    {
      "body": "A-class articles",
      "target": {
        "href": "Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "World of Avatar",
      "target": {
        "href": "Category_World_of_Avatar",
        "page": "Category_World_of_Avatar"
      }
    }
  ],
  "facts": [
    {
      "key": "Type",
      "value": [
        {
          "body": "Average citizens",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Average citizens",
          "value": "Average citizens",
          "value_text": "Average citizens"
        },
        {
          "body": "Nobles",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Nobles",
          "value": "Nobles",
          "value_text": "Nobles"
        },
        {
          "body": "Rulers",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Rulers",
          "value": "Rulers",
          "value_text": "Rulers"
        }
      ]
    },
    {
      "key": "Examples",
      "value": [
        {
          "body": "Chief's advisers",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Chief's advisers",
          "value": "Chief's advisers",
          "value_text": "Chief's advisers"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Council of Elders",
              "key": "${link_0}",
              "target": {
                "href": "Council_of_Elders",
                "page": "Council_of_Elders"
              }
            }
          ],
          "text": "Council of Elders",
          "value": "${link_0}",
          "value_text": "Council of Elders"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Earth monarch",
              "key": "${link_0}",
              "target": {
                "href": "Earth_monarch",
                "page": "Earth_monarch"
              }
            }
          ],
          "text": "Earth monarch",
          "value": "${link_0}",
          "value_text": "Earth monarch"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Fire Lord",
              "key": "${link_0}",
              "target": {
                "href": "Fire_Lord",
                "page": "Fire_Lord"
              }
            }
          ],
          "text": "Fire Lord",
          "value": "${link_0}",
          "value_text": "Fire Lord"
        },
        {
          "body": "Peasants",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Peasants",
          "value": "Peasants",
          "value_text": "Peasants"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Tribal chief",
              "key": "${link_0}",
              "target": {
                "href": "Tribal_chief",
                "page": "Tribal_chief"
              }
            }
          ],
          "text": "Tribal chief",
          "value": "${link_0}",
          "value_text": "Tribal chief"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Society is well-developed in the ${link_0}. Each of the ${link_1} possesses a distinct social structure, ranging from the ecclesiocracy of the Air Nomads to the absolutism of the Fire Nation.",
      "links": [
        {
          "body": "World of Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "nations",
          "key": "${link_1}",
          "target": {
            "href": "Four_nations",
            "page": "Four_nations"
          }
        }
      ],
      "text": "Society is well-developed in the World of Avatar. Each of the nations possesses a distinct social structure, ranging from the ecclesiocracy of the Air Nomads to the absolutism of the Fire Nation."
    },
    {
      "body": "Social classes are usually based upon titles, wealth, and power. Although people are mostly born into their social rank, there are some exceptions in which people can gain a higher position through service, as seen with ${link_0}.",
      "links": [
        {
          "body": "Long Feng",
          "key": "${link_0}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        }
      ],
      "text": "Social classes are usually based upon titles, wealth, and power. Although people are mostly born into their social rank, there are some exceptions in which people can gain a higher position through service, as seen with Long Feng."
    },
    {
      "body": "In more recent years, with the founding of the ${link_0}, it is seen that a person's wealth and accomplishments could act as a substitute for the condition of their birth.",
      "links": [
        {
          "body": "United Republic of Nations",
          "key": "${link_0}",
          "target": {
            "href": "United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        }
      ],
      "text": "In more recent years, with the founding of the United Republic of Nations, it is seen that a person's wealth and accomplishments could act as a substitute for the condition of their birth."
    },
    {
      "body": "Before their ${link_0}, the Air Nomads were an ecclesiocratic and monastic society that lacked social strata. The highest Air Nomad political body was the ${link_1}.",
      "links": [
        {
          "body": "genocide",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "Council of Elders",
          "key": "${link_1}",
          "target": {
            "href": "Council_of_Elders",
            "page": "Council_of_Elders"
          }
        }
      ],
      "text": "Before their genocide, the Air Nomads were an ecclesiocratic and monastic society that lacked social strata. The highest Air Nomad political body was the Council of Elders."
    },
    {
      "body": "The ${link_0} seemed to have been the highest rank in the ${link_1} society.",
      "links": [
        {
          "body": "Council of Elders",
          "key": "${link_0}",
          "target": {
            "href": "Council_of_Elders",
            "page": "Council_of_Elders"
          }
        },
        {
          "body": "Air Nomad",
          "key": "${link_1}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "text": "The Council of Elders seemed to have been the highest rank in the Air Nomad society."
    },
    {
      "body": "The authority of the Council of Elders is not well known. However, it has been shown that they were not considered royalty. As the wisest members of their society, they were trusted with making decisions for the nation. Like the ${link_0} of the Fire Nation, the councils had one Head Monk or Head Nun, who seemed to have more authority than the other sitting members.",
      "links": [
        {
          "body": "Fire Sages",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Sages",
            "page": "Fire_Sages"
          }
        }
      ],
      "text": "The authority of the Council of Elders is not well known. However, it has been shown that they were not considered royalty. As the wisest members of their society, they were trusted with making decisions for the nation. Like the Fire Sages of the Fire Nation, the councils had one Head Monk or Head Nun, who seemed to have more authority than the other sitting members."
    },
    {
      "body": "It seems that all nomads were considered equal in rights and in social rank, a belief they incorporated in their teachings about how to live life. This is natural because all Air Nomad citizens were ${link_0}. Thus, there were few differences between the abilities of various nomads.",
      "links": [
        {
          "body": "benders",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "It seems that all nomads were considered equal in rights and in social rank, a belief they incorporated in their teachings about how to live life. This is natural because all Air Nomad citizens were benders. Thus, there were few differences between the abilities of various nomads."
    },
    {
      "body": "In the air temples, the Air Nomads did not hide whom they loved. They were accepting of differences and embraced everyone, regardless of their sexual orientation.",
      "links": [],
      "text": "In the air temples, the Air Nomads did not hide whom they loved. They were accepting of differences and embraced everyone, regardless of their sexual orientation."
    },
    {
      "body": "${link_0} society differs between the ${link_1} and ${link_2}. While the smaller Southern Tribe seems to consider almost all members as equals, the Northern Tribe appears to have more social divisions.",
      "links": [
        {
          "body": "Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "text": "Water Tribe society differs between the Southern Water Tribe and Northern Water Tribe. While the smaller Southern Tribe seems to consider almost all members as equals, the Northern Tribe appears to have more social divisions."
    },
    {
      "body": "The ${link_0} and his advisers seem to have the highest status in the ${link_1}.",
      "links": [
        {
          "body": "chief",
          "key": "${link_0}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Water Tribes",
          "key": "${link_1}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        }
      ],
      "text": "The chief and his advisers seem to have the highest status in the Water Tribes."
    },
    {
      "body": "The Northern Water Tribe differs from the Southern Water Tribe through its more complex social hierarchy, based on long-standing traditions. This was pointed out by ${link_0} while he was berating ${link_1}'s surprise and displeasure on the subject of ${link_2}'s arranged marriage.",
      "links": [
        {
          "body": "Hahn",
          "key": "${link_0}",
          "target": {
            "href": "Hahn",
            "page": "Hahn"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Yue",
          "key": "${link_2}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        }
      ],
      "text": "The Northern Water Tribe differs from the Southern Water Tribe through its more complex social hierarchy, based on long-standing traditions. This was pointed out by Hahn while he was berating Sokka's surprise and displeasure on the subject of Yue's arranged marriage."
    },
    {
      "body": "In the Northern Water Tribe, the ${link_0} is considered royalty to some extent, as his daughter carries the title of ${link_1}, a position of great cultural prominence. The chief makes decisions for the tribe and can probably create and abolish certain laws and customs. Arranged marriage, however, does not seem to be one of them, meaning that the power of the chief does have limits. For example, Chief ${link_2} stated that he could not force Master ${link_3} to take back pupils if he did not want them, even if that pupil is the Avatar.",
      "links": [
        {
          "body": "chief",
          "key": "${link_0}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Tribal Princess",
          "key": "${link_1}",
          "target": {
            "href": "Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Arnook",
          "key": "${link_2}",
          "target": {
            "href": "Arnook",
            "page": "Arnook"
          }
        },
        {
          "body": "Pakku",
          "key": "${link_3}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        }
      ],
      "text": "In the Northern Water Tribe, the chief is considered royalty to some extent, as his daughter carries the title of Tribal Princess, a position of great cultural prominence. The chief makes decisions for the tribe and can probably create and abolish certain laws and customs. Arranged marriage, however, does not seem to be one of them, meaning that the power of the chief does have limits. For example, Chief Arnook stated that he could not force Master Pakku to take back pupils if he did not want them, even if that pupil is the Avatar."
    },
    {
      "body": "In the Southern Water Tribe, chiefdom seems to be less complicated. The chief has the ability to lead his people and make decisions. Unlike Arnook's daughter, Chief ${link_0}'s children did not hold the titles of \"Prince\" or \"Princess\", as Hakoda was not royalty. The chief can also personally lead his warriors in battle. At ${link_1} inside of a large tent, Hakoda was seen with a group of about seven individuals planning the next battle.",
      "links": [
        {
          "body": "Hakoda",
          "key": "${link_0}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Chameleon Bay",
          "key": "${link_1}",
          "target": {
            "href": "Chameleon_Bay",
            "page": "Chameleon_Bay"
          }
        }
      ],
      "text": "In the Southern Water Tribe, chiefdom seems to be less complicated. The chief has the ability to lead his people and make decisions. Unlike Arnook's daughter, Chief Hakoda's children did not hold the titles of \"Prince\" or \"Princess\", as Hakoda was not royalty. The chief can also personally lead his warriors in battle. At Chameleon Bay inside of a large tent, Hakoda was seen with a group of about seven individuals planning the next battle."
    },
    {
      "body": "In the Northern Water Tribe, the chief has advisers to help him make decisions. They seem to be in position of high authority, as they sit beside the chief during meetings and other events. Even though the chief has more power than these advisers, they are still important members of the Northern Water Tribe society. Known advisers are the tribe's ${link_0} master, Pakku, and the chief's daughter, Princess Yue.",
      "links": [
        {
          "body": "waterbending",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "In the Northern Water Tribe, the chief has advisers to help him make decisions. They seem to be in position of high authority, as they sit beside the chief during meetings and other events. Even though the chief has more power than these advisers, they are still important members of the Northern Water Tribe society. Known advisers are the tribe's waterbending master, Pakku, and the chief's daughter, Princess Yue."
    },
    {
      "body": "The citizens of the Northern Water Tribe are bound by a cultural code that dictates social expectations for each gender. In practice, female benders were expected to learn the ${link_0} aspect of waterbending, whereas male benders were expected to learn the combative aspect.",
      "links": [
        {
          "body": "healing",
          "key": "${link_0}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "The citizens of the Northern Water Tribe are bound by a cultural code that dictates social expectations for each gender. In practice, female benders were expected to learn the healing aspect of waterbending, whereas male benders were expected to learn the combative aspect."
    },
    {
      "body": "Late in the ${link_0}, most ${link_1} citizens were peasants.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "Late in the Hundred Year War, most Southern Water Tribe citizens were peasants."
    },
    {
      "body": "In the Southern Water Tribe, all of the tribe's members, even the chief's children, are considered average citizens and have also been referred to as peasants. The tribe does not appear to have a well-developed society.",
      "links": [],
      "text": "In the Southern Water Tribe, all of the tribe's members, even the chief's children, are considered average citizens and have also been referred to as peasants. The tribe does not appear to have a well-developed society."
    },
    {
      "body": "Before the ${link_0}, a substantial proportion of the citizens were waterbenders and there were no clear social differences for warriors, as both male and female warriors were defending the city. However, the raids later left the tribe with only one bender, ${link_1}.",
      "links": [
        {
          "body": "Southern Water Tribe raids",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Before the Southern Water Tribe raids, a substantial proportion of the citizens were waterbenders and there were no clear social differences for warriors, as both male and female warriors were defending the city. However, the raids later left the tribe with only one bender, Katara."
    },
    {
      "body": "In ${link_0}'s era, the tribe has advanced. Cultural festivals and larger living areas suggest that population has grown significantly in the last seventy years.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "In Korra's era, the tribe has advanced. Cultural festivals and larger living areas suggest that population has grown significantly in the last seventy years."
    },
    {
      "body": "The Water Tribes are generally accepting of different sexual orientations, and it is atypical for families to disown children for coming out. However, it is Water Tribe tradition to keep personal matters private, and Water Tribe culture encourages people to keep their sexuality to themselves.",
      "links": [],
      "text": "The Water Tribes are generally accepting of different sexual orientations, and it is atypical for families to disown children for coming out. However, it is Water Tribe tradition to keep personal matters private, and Water Tribe culture encourages people to keep their sexuality to themselves."
    },
    {
      "body": "The Earth Kingdom is the largest of the Four Nations in terms of geographical area. Because of its vastness, the Earth Kingdom has a diverse range of people, with a correspondingly more stratified social hierarchy. Their economy is pre-industrial, with rampant poverty and inequality.",
      "links": [],
      "text": "The Earth Kingdom is the largest of the Four Nations in terms of geographical area. Because of its vastness, the Earth Kingdom has a diverse range of people, with a correspondingly more stratified social hierarchy. Their economy is pre-industrial, with rampant poverty and inequality."
    },
    {
      "body": "The ${link_0} and his advisers occupy high social positions.",
      "links": [
        {
          "body": "Earth King",
          "key": "${link_0}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "The Earth King and his advisers occupy high social positions."
    },
    {
      "body": "The ${link_0} or Earth Queen is the ruler of the Earth Kingdom. He or she occupies the highest social position in the entire kingdom, and his or her ${link_1} and seat of government are located in the Upper Ring of the kingdom's capital, ${link_2}",
      "links": [
        {
          "body": "Earth King",
          "key": "${link_0}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "palace",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_2}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "The Earth King or Earth Queen is the ruler of the Earth Kingdom. He or she occupies the highest social position in the entire kingdom, and his or her palace and seat of government are located in the Upper Ring of the kingdom's capital, Ba Sing Se"
    },
    {
      "body": "Previous Earth Kings exercised tremendous authority over the whole kingdom. Recently, a ${link_0} led to the decline of this position from a true leader to a mere figurehead, as was the circumstance of the 52nd Earth King, ${link_1}; the Earth King was treated as if he were a god to the citizens. When Kuei returned to power at the end of the Hundred Year War, with the conspiracy broken, he took the Earth King's original role in society. His daughter, however, reasserted the god-like position of the monarch and demanded absolute loyalty from the citizens. Furthermore, she treated any level of disrespect toward her and her position as a severe crime punishable by imprisonment or even death.",
      "links": [
        {
          "body": "conspiracy",
          "key": "${link_0}",
          "target": {
            "href": "Conspiracy_of_Ba_Sing_Se",
            "page": "Conspiracy_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Kuei",
          "key": "${link_1}",
          "target": {
            "href": "Kuei",
            "page": "Kuei"
          }
        }
      ],
      "text": "Previous Earth Kings exercised tremendous authority over the whole kingdom. Recently, a conspiracy led to the decline of this position from a true leader to a mere figurehead, as was the circumstance of the 52nd Earth King, Kuei; the Earth King was treated as if he were a god to the citizens. When Kuei returned to power at the end of the Hundred Year War, with the conspiracy broken, he took the Earth King's original role in society. His daughter, however, reasserted the god-like position of the monarch and demanded absolute loyalty from the citizens. Furthermore, she treated any level of disrespect toward her and her position as a severe crime punishable by imprisonment or even death."
    },
    {
      "body": "As a decentralized monarchy, the Earth Kingdom has a number of leaders who exercise power over individual parts of the Earth Kingdom. While the Earth King has final authority over such leaders, these leaders do have considerable power over their lands.",
      "links": [],
      "text": "As a decentralized monarchy, the Earth Kingdom has a number of leaders who exercise power over individual parts of the Earth Kingdom. While the Earth King has final authority over such leaders, these leaders do have considerable power over their lands."
    },
    {
      "body": "The ${link_0} is a group of the five most powerful generals of the Earth Kingdom. They are held in high respect. The Council of Five have very high authority and an extremely high social status, as they control the entire ${link_1}.",
      "links": [
        {
          "body": "Council of Five",
          "key": "${link_0}",
          "target": {
            "href": "Council_of_Five",
            "page": "Council_of_Five"
          }
        },
        {
          "body": "military",
          "key": "${link_1}",
          "target": {
            "href": "Military_of_the_Earth_Kingdom",
            "page": "Military_of_the_Earth_Kingdom"
          }
        }
      ],
      "text": "The Council of Five is a group of the five most powerful generals of the Earth Kingdom. They are held in high respect. The Council of Five have very high authority and an extremely high social status, as they control the entire military."
    },
    {
      "body": "The ${link_0} is a position held by the Leader of the Government of Ba Sing Se. It is their job to maintain ${link_1} in the bustling city. This position is considered a high social status, due to it serving as one of the prime advisers for the Earth King. However, during ${link_2}'s rule, the Grand Secretariat served solely at the pleasure of the monarch.",
      "links": [
        {
          "body": "Grand Secretariat",
          "key": "${link_0}",
          "target": {
            "href": "Grand_Secretariat_of_Ba_Sing_Se",
            "page": "Grand_Secretariat_of_Ba_Sing_Se"
          }
        },
        {
          "body": "law and order",
          "key": "${link_1}",
          "target": {
            "href": "Law_and_order_in_the_World_of_Avatar",
            "page": "Law_and_order_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_2}",
          "target": {
            "href": "Hou-Ting",
            "page": "Hou-Ting"
          }
        }
      ],
      "text": "The Grand Secretariat is a position held by the Leader of the Government of Ba Sing Se. It is their job to maintain law and order in the bustling city. This position is considered a high social status, due to it serving as one of the prime advisers for the Earth King. However, during Hou-Ting's rule, the Grand Secretariat served solely at the pleasure of the monarch."
    },
    {
      "body": "The nobles lead lives of wealth and luxury. Many of them live within the walls of Ba Sing Se, in the Upper Ring. There are presumably other nobles scattered throughout the Earth Kingdom, though the only known example is the ${link_0} in ${link_1}, one of the wealthiest families of the Earth Kingdom, who have respect and many privileges throughout the kingdom.",
      "links": [
        {
          "body": "Beifong family",
          "key": "${link_0}",
          "target": {
            "href": "Beifong_family",
            "page": "Beifong_family"
          }
        },
        {
          "body": "Gaoling",
          "key": "${link_1}",
          "target": {
            "href": "Gaoling",
            "page": "Gaoling"
          }
        }
      ],
      "text": "The nobles lead lives of wealth and luxury. Many of them live within the walls of Ba Sing Se, in the Upper Ring. There are presumably other nobles scattered throughout the Earth Kingdom, though the only known example is the Beifong family in Gaoling, one of the wealthiest families of the Earth Kingdom, who have respect and many privileges throughout the kingdom."
    },
    {
      "body": "Not much has been revealed about the middle class populace of the Earth Kingdom. It has been shown, however, that they do retain many rights and opportunities, as Long Feng was born as a middle class citizen and he eventually was able to secure a position as the Grand Secretariat of Ba Sing Se. Middle class citizens are also able to afford an education, as ${link_0} is located in Ba Sing Se's Middle Ring.",
      "links": [
        {
          "body": "Ba Sing Se University",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se_University",
            "page": "Ba_Sing_Se_University"
          }
        }
      ],
      "text": "Not much has been revealed about the middle class populace of the Earth Kingdom. It has been shown, however, that they do retain many rights and opportunities, as Long Feng was born as a middle class citizen and he eventually was able to secure a position as the Grand Secretariat of Ba Sing Se. Middle class citizens are also able to afford an education, as Ba Sing Se University is located in Ba Sing Se's Middle Ring."
    },
    {
      "body": "Peasants are of the lowest social class in the ${link_0}.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Peasants are of the lowest social class in the Earth Kingdom."
    },
    {
      "body": "The vast majority of the Earth Kingdom consists of lower-class citizens, and in Ba Sing Se, these people are sequestered in the Lower Ring, rendering it densely populated, poverty stricken, and crime-ridden. During the ${link_0}, the amount of people in this class rose, as people from all around the kingdom were forced to leave their properties, turning to a refugee's life, or were otherwise affected by the war.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "The vast majority of the Earth Kingdom consists of lower-class citizens, and in Ba Sing Se, these people are sequestered in the Lower Ring, rendering it densely populated, poverty stricken, and crime-ridden. During the Hundred Year War, the amount of people in this class rose, as people from all around the kingdom were forced to leave their properties, turning to a refugee's life, or were otherwise affected by the war."
    },
    {
      "body": "However, despite their poverty and political disenfranchisement, the peasants have proven throughout history that they are not completely helpless, as they rose up in ${link_0} against the ${link_1}'s tyranny. Deciding that the king did not represent their interests, the peasants of Ba Sing Se seized control of the capital until Avatar Kyoshi forced the king to accept a new constitution and to hear the peasants' grievances. To the dismay of the peasants, this new constitution made it possible for corruption to spread, as the state police force established by Kyoshi, the ${link_2}, were eventually able to reduce the king to a mere figurehead and assume power for themselves. Consequently, the situation of the peasants did not improve.",
      "links": [
        {
          "body": "revolt",
          "key": "${link_0}",
          "target": {
            "href": "Peasant_Uprising_in_Ba_Sing_Se",
            "page": "Peasant_Uprising_in_Ba_Sing_Se"
          }
        },
        {
          "body": "46th Earth King",
          "key": "${link_1}",
          "target": {
            "href": "46th_Earth_King",
            "page": "46th_Earth_King"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_2}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "However, despite their poverty and political disenfranchisement, the peasants have proven throughout history that they are not completely helpless, as they rose up in revolt against the 46th Earth King's tyranny. Deciding that the king did not represent their interests, the peasants of Ba Sing Se seized control of the capital until Avatar Kyoshi forced the king to accept a new constitution and to hear the peasants' grievances. To the dismay of the peasants, this new constitution made it possible for corruption to spread, as the state police force established by Kyoshi, the Dai Li, were eventually able to reduce the king to a mere figurehead and assume power for themselves. Consequently, the situation of the peasants did not improve."
    },
    {
      "body": "The Earth Kingdom has been slow in accepting people who are not heterosexual, even going as far as being militaristically repressive. Even Avatar Kyoshi, who openly loved both men and women, was unable to effect any kind of real progress.",
      "links": [],
      "text": "The Earth Kingdom has been slow in accepting people who are not heterosexual, even going as far as being militaristically repressive. Even Avatar Kyoshi, who openly loved both men and women, was unable to effect any kind of real progress."
    },
    {
      "body": "The Fire Nation is the preeminent society among the Four Nations, dominant in economic, political, and military power. It is an authoritarian state headed by its traditional monarch, the Fire Lord. Unlike the other nations, the Fire Nation is industrialized, socially progressive, and united around a nationalist identity that is indoctrinated into its youth. The majority of its citizenry lives in relative prosperity and education is available to all; however, poverty is still rampant in outlying island villages such as ${link_0}.",
      "links": [
        {
          "body": "Jang Hui",
          "key": "${link_0}",
          "target": {
            "href": "Jang_Hui",
            "page": "Jang_Hui"
          }
        }
      ],
      "text": "The Fire Nation is the preeminent society among the Four Nations, dominant in economic, political, and military power. It is an authoritarian state headed by its traditional monarch, the Fire Lord. Unlike the other nations, the Fire Nation is industrialized, socially progressive, and united around a nationalist identity that is indoctrinated into its youth. The majority of its citizenry lives in relative prosperity and education is available to all; however, poverty is still rampant in outlying island villages such as Jang Hui."
    },
    {
      "body": "The ${link_0} has the highest social status in the ${link_1}.",
      "links": [
        {
          "body": "Royal Family",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_Royal_Family",
            "page": "Fire_Nation_Royal_Family"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "The Royal Family has the highest social status in the Fire Nation."
    },
    {
      "body": "The ${link_0} is the supreme ruler of the entire Fire Nation and wields absolute power; anything he or she proclaims becomes law. The Fire Lord has the highest social rank in the Fire Nation.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "text": "The Fire Lord is the supreme ruler of the entire Fire Nation and wields absolute power; anything he or she proclaims becomes law. The Fire Lord has the highest social rank in the Fire Nation."
    },
    {
      "body": "\"Fire Lord\" is a title and is not gender bound, as Ozai appointed ${link_0} as the new Fire Lord after his coronation as Phoenix King, and ${link_1} eventually relinquished the throne to his daughter, ${link_2}, making her Fire Lord. However, Izumi is the first woman to ascend the throne in generations.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Izumi",
          "key": "${link_2}",
          "target": {
            "href": "Izumi",
            "page": "Izumi"
          }
        }
      ],
      "text": "\"Fire Lord\" is a title and is not gender bound, as Ozai appointed Azula as the new Fire Lord after his coronation as Phoenix King, and Zuko eventually relinquished the throne to his daughter, Izumi, making her Fire Lord. However, Izumi is the first woman to ascend the throne in generations."
    },
    {
      "body": "The Fire Lord's power increased during the Hundred Year War, not only globally as a result of the Fire Nation's subjugation of the other nations, but also within the nation itself. Fire Lord ${link_0} used his position to seize land for state projects and placed emphasis on absolute loyalty of all citizens, including the Fire Sages. Furthermore, Sozin and other wartime Fire Lords tightened their hold over the Fire Nation citizenry by rewriting history and indoctrinating their youth.",
      "links": [
        {
          "body": "Sozin",
          "key": "${link_0}",
          "target": {
            "href": "Sozin",
            "page": "Sozin"
          }
        }
      ],
      "text": "The Fire Lord's power increased during the Hundred Year War, not only globally as a result of the Fire Nation's subjugation of the other nations, but also within the nation itself. Fire Lord Sozin used his position to seize land for state projects and placed emphasis on absolute loyalty of all citizens, including the Fire Sages. Furthermore, Sozin and other wartime Fire Lords tightened their hold over the Fire Nation citizenry by rewriting history and indoctrinating their youth."
    },
    {
      "body": "The children of the Fire Lord possess a social status second only to the Fire Lord. The eldest child of the Fire Lord is considered the next ${link_0} to the throne. Citizens of all ranks are expected to show them deference.",
      "links": [
        {
          "body": "heir",
          "key": "${link_0}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "text": "The children of the Fire Lord possess a social status second only to the Fire Lord. The eldest child of the Fire Lord is considered the next heir to the throne. Citizens of all ranks are expected to show them deference."
    },
    {
      "body": "Nobles are ranked highly in ${link_0} society.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "Nobles are ranked highly in Fire Nation society."
    },
    {
      "body": "Nobles form the upper crust in Fire Nation society and have the possibility to befriend, marry and work with the Royal Family. Nobles include ${link_0}, Princess ${link_1}, ${link_2}'s family, and ${link_3}'s. The children of Fire Nation nobility often attend prestigious schools, such as the ${link_4}.",
      "links": [
        {
          "body": "Ta Min",
          "key": "${link_0}",
          "target": {
            "href": "Ta_Min",
            "page": "Ta_Min"
          }
        },
        {
          "body": "Ursa",
          "key": "${link_1}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        },
        {
          "body": "Mai",
          "key": "${link_2}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_3}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Royal Fire Academy for Girls",
          "key": "${link_4}",
          "target": {
            "href": "Royal_Fire_Academy_for_Girls",
            "page": "Royal_Fire_Academy_for_Girls"
          }
        }
      ],
      "text": "Nobles form the upper crust in Fire Nation society and have the possibility to befriend, marry and work with the Royal Family. Nobles include Ta Min, Princess Ursa, Mai's family, and Ty Lee's. The children of Fire Nation nobility often attend prestigious schools, such as the Royal Fire Academy for Girls."
    },
    {
      "body": "The Fire Sages are the religious authority of the Fire Nation, and they once led the Fire Nation. However, when the title of Fire Lord was created, they slowly lost their power. When Sozin became Fire Lord, he forced the Fire Sages to pledge allegiance to him. This resulted in their disloyalty to the Avatar during the Hundred Year War.",
      "links": [],
      "text": "The Fire Sages are the religious authority of the Fire Nation, and they once led the Fire Nation. However, when the title of Fire Lord was created, they slowly lost their power. When Sozin became Fire Lord, he forced the Fire Sages to pledge allegiance to him. This resulted in their disloyalty to the Avatar during the Hundred Year War."
    },
    {
      "body": "Though the Fire Sages lost their power, they maintained their status and influence. They maintained their own archives and crowned new Fire Lords, being present at Ozai, Azula, and Zuko's coronations; this job is performed by the ${link_0}.",
      "links": [
        {
          "body": "High Sage",
          "key": "${link_0}",
          "target": {
            "href": "High_Sage",
            "page": "High_Sage"
          }
        }
      ],
      "text": "Though the Fire Sages lost their power, they maintained their status and influence. They maintained their own archives and crowned new Fire Lords, being present at Ozai, Azula, and Zuko's coronations; this job is performed by the High Sage."
    },
    {
      "body": "During the Fire Nation's one hundred year-long war for world domination, ${link_0} officials became of great importance. High military officials are very respected in the Fire Nation society. High Admirals and High Generals fall under this position. They seem to act as the Fire Lord's advisers and are usually present during war meetings.",
      "links": [
        {
          "body": "military",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        }
      ],
      "text": "During the Fire Nation's one hundred year-long war for world domination, military officials became of great importance. High military officials are very respected in the Fire Nation society. High Admirals and High Generals fall under this position. They seem to act as the Fire Lord's advisers and are usually present during war meetings."
    },
    {
      "body": "The Fire Nation possesses an industrialized economy, fueled by raw resources extracted from oversea ${link_0}. They possess a robust middle class, with a large degree of disposable income and liberal social protocols, especially among its youth. Education is widespread, though its primary purpose seems to be for indoctrination.",
      "links": [
        {
          "body": "colonies",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_colonies",
            "page": "Fire_Nation_colonies"
          }
        }
      ],
      "text": "The Fire Nation possesses an industrialized economy, fueled by raw resources extracted from oversea colonies. They possess a robust middle class, with a large degree of disposable income and liberal social protocols, especially among its youth. Education is widespread, though its primary purpose seems to be for indoctrination."
    },
    {
      "body": "During the Hundred Year War, the Fire Lord expanded the territory of the Fire Nation to access the resources of the Earth Kingdom, populating oversea colonies with forcibly relocated peasants. Over time, these grievances were forgotten, and the colonies themselves became prosperous, so much so that the citizens resisted ${link_0}. Still, mainland citizens looked down upon those from the colonies, regarding them to be uncultured.",
      "links": [
        {
          "body": "efforts to return them to the Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Harmony_Restoration_Movement",
            "page": "Harmony_Restoration_Movement"
          }
        }
      ],
      "text": "During the Hundred Year War, the Fire Lord expanded the territory of the Fire Nation to access the resources of the Earth Kingdom, populating oversea colonies with forcibly relocated peasants. Over time, these grievances were forgotten, and the colonies themselves became prosperous, so much so that the citizens resisted efforts to return them to the Fire Nation. Still, mainland citizens looked down upon those from the colonies, regarding them to be uncultured."
    },
    {
      "body": "Peasants living in outlying islands are of the lowest social rank in the ${link_0}.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "Peasants living in outlying islands are of the lowest social rank in the Fire Nation."
    },
    {
      "body": "Although the majority of the Fire Nation is wealthy compared to the other nations, many living in the outlying islands still reside in poverty. An example would be the villagers of ${link_0}. Like in the Earth Kingdom, these peasants have little to no political rights, and they are often subject to oppression and forced relocation.",
      "links": [
        {
          "body": "Jang Hui",
          "key": "${link_0}",
          "target": {
            "href": "Jang_Hui",
            "page": "Jang_Hui"
          }
        }
      ],
      "text": "Although the majority of the Fire Nation is wealthy compared to the other nations, many living in the outlying islands still reside in poverty. An example would be the villagers of Jang Hui. Like in the Earth Kingdom, these peasants have little to no political rights, and they are often subject to oppression and forced relocation."
    },
    {
      "body": "For most of its history, the Fire Nation was tolerant of people with diverse sexual orientations. However, when Sozin came into power, he made same-gender relationships a criminal offense.",
      "links": [],
      "text": "For most of its history, the Fire Nation was tolerant of people with diverse sexual orientations. However, when Sozin came into power, he made same-gender relationships a criminal offense."
    },
    {
      "body": "The United Republic was founded by ${link_0} ${link_1} and Fire Lord Zuko upon the notion that benders and nonbenders would be able to \"live and thrive together in peace and harmony,\" and people from all over the ${link_2} immigrated there from their own native lands to attain this equality themselves. Judging by the country's former governmental bench that held no nonbenders and heightened poverty rates in the ghettos of nonbenders, coupled with bending-based ${link_3} that exercise their abilities to extort the nonbending population, this utopian goal is far from established in the main city. However, the goal seems more established in an underground community of vagabonds, where benders and nonbenders live in harmony.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "world",
          "key": "${link_2}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "crime triads",
          "key": "${link_3}",
          "target": {
            "href": "Bending_triads_(disambiguation)",
            "page": "Bending_triads_(disambiguation)"
          }
        }
      ],
      "text": "The United Republic was founded by Avatar Aang and Fire Lord Zuko upon the notion that benders and nonbenders would be able to \"live and thrive together in peace and harmony,\" and people from all over the world immigrated there from their own native lands to attain this equality themselves. Judging by the country's former governmental bench that held no nonbenders and heightened poverty rates in the ghettos of nonbenders, coupled with bending-based crime triads that exercise their abilities to extort the nonbending population, this utopian goal is far from established in the main city. However, the goal seems more established in an underground community of vagabonds, where benders and nonbenders live in harmony."
    },
    {
      "body": "The ${link_0} convened in this large room to make important decisions for ${link_1}.",
      "links": [
        {
          "body": "United Republic Council",
          "key": "${link_0}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "the nation",
          "key": "${link_1}",
          "target": {
            "href": "United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        }
      ],
      "text": "The United Republic Council convened in this large room to make important decisions for the nation."
    },
    {
      "body": "The ${link_0} was the governmental body of the United Republic of Nations composed of representatives from the Air Nation, Northern and Southern Water Tribes, Earth Kingdom, and Fire Nation. The members of the Council convened for regular meetings in ${link_1} to discuss political affairs, like passing new laws, and were also tasked with weighing the good against the bad in certain situations and deciding whether or not to act on threats against the people's well-being. This system was more focused on the government taking its citizens' needs into consideration as opposed to the autocracy of the Fire Nation or the Earth Kingdom's monarchy. However, the Anti-bending Revolution proved that the Council was unable to represent the interests of the majority and could not handle the challenges of new political movements. Subsequently, in early 171 AG, the council was abolished and a ${link_2} of the United Republic was elected the nation's first ${link_3}.",
      "links": [
        {
          "body": "United Republic Council",
          "key": "${link_0}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "City Hall",
          "key": "${link_1}",
          "target": {
            "href": "City_Hall",
            "page": "City_Hall"
          }
        },
        {
          "body": "native citizen",
          "key": "${link_2}",
          "target": {
            "href": "Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "president",
          "key": "${link_3}",
          "target": {
            "href": "President",
            "page": "President"
          }
        }
      ],
      "text": "The United Republic Council was the governmental body of the United Republic of Nations composed of representatives from the Air Nation, Northern and Southern Water Tribes, Earth Kingdom, and Fire Nation. The members of the Council convened for regular meetings in City Hall to discuss political affairs, like passing new laws, and were also tasked with weighing the good against the bad in certain situations and deciding whether or not to act on threats against the people's well-being. This system was more focused on the government taking its citizens' needs into consideration as opposed to the autocracy of the Fire Nation or the Earth Kingdom's monarchy. However, the Anti-bending Revolution proved that the Council was unable to represent the interests of the majority and could not handle the challenges of new political movements. Subsequently, in early 171 AG, the council was abolished and a native citizen of the United Republic was elected the nation's first president."
    },
    {
      "body": "The ${link_0}, manufactured by ${link_1}, led ${link_2} to great wealth.",
      "links": [
        {
          "body": "Satomobile",
          "key": "${link_0}",
          "target": {
            "href": "Satomobile",
            "page": "Satomobile"
          }
        },
        {
          "body": "Future Industries",
          "key": "${link_1}",
          "target": {
            "href": "Future_Industries",
            "page": "Future_Industries"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_2}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        }
      ],
      "text": "The Satomobile, manufactured by Future Industries, led Hiroshi Sato to great wealth."
    },
    {
      "body": "Nobles are not a class in the United Republic because of the nation's break from the traditional governing systems of the world. This makes wealth in the United Republic something that must be striven for, not something that one is simply born into. ${link_0} like ${link_1} have given way to high-paying jobs for proprietors of such businesses. The ${link_2} industry has also proven to be an undertaking of great profit. With ${link_3} being the capital of both the nation and its commerce, it can be logically assumed that most citizens with this status reside there. Some such examples are ${link_4} and ${link_5}.",
      "links": [
        {
          "body": "Sports",
          "key": "${link_0}",
          "target": {
            "href": "Recreation_in_the_World_of_Avatar",
            "page": "Recreation_in_the_World_of_Avatar"
          }
        },
        {
          "body": "pro-bending",
          "key": "${link_1}",
          "target": {
            "href": "Pro-bending",
            "page": "Pro-bending"
          }
        },
        {
          "body": "automobile",
          "key": "${link_2}",
          "target": {
            "href": "Motor_vehicle",
            "page": "Motor_vehicle"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_3}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_4}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Butakha",
          "key": "${link_5}",
          "target": {
            "href": "Butakha",
            "page": "Butakha"
          }
        }
      ],
      "text": "Nobles are not a class in the United Republic because of the nation's break from the traditional governing systems of the world. This makes wealth in the United Republic something that must be striven for, not something that one is simply born into. Sports like pro-bending have given way to high-paying jobs for proprietors of such businesses. The automobile industry has also proven to be an undertaking of great profit. With Republic City being the capital of both the nation and its commerce, it can be logically assumed that most citizens with this status reside there. Some such examples are Hiroshi Sato and Butakha."
    },
    {
      "body": "The middle and lower classes of the United Republic can be described by the unintentional bias that the nation holds toward its bending population in terms of power and status.",
      "links": [],
      "text": "The middle and lower classes of the United Republic can be described by the unintentional bias that the nation holds toward its bending population in terms of power and status."
    },
    {
      "body": "Innocent nonbenders were arrested in the ${link_0}.",
      "links": [
        {
          "body": "Dragon Flats borough",
          "key": "${link_0}",
          "target": {
            "href": "Dragon_Flats_borough",
            "page": "Dragon_Flats_borough"
          }
        }
      ],
      "text": "Innocent nonbenders were arrested in the Dragon Flats borough."
    },
    {
      "body": "The United Republic Council was made up solely of benders in 170 AG. While the inclusion of representatives from each continent should in theory have created an equal balance in power, this power was distributed among benders only. This was not always the case in the council, but the truth of bias among government officials was made an undeniable fact when four of the five councilmen incited a curfew for nonbenders because the council suspected they were all ${link_0} who would attempt to overthrow the council, a decision brought on by prejudice and mass hysteria. Most lower-class citizens appear to be nonbenders, as evidenced by the whole of the ${link_1}, a place resembling a ghetto for nonbenders, being put under the curfew, suggesting everyone there was a nonbender.",
      "links": [
        {
          "body": "Equalists",
          "key": "${link_0}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Dragon Flats borough",
          "key": "${link_1}",
          "target": {
            "href": "Dragon_Flats_borough",
            "page": "Dragon_Flats_borough"
          }
        }
      ],
      "text": "The United Republic Council was made up solely of benders in 170 AG. While the inclusion of representatives from each continent should in theory have created an equal balance in power, this power was distributed among benders only. This was not always the case in the council, but the truth of bias among government officials was made an undeniable fact when four of the five councilmen incited a curfew for nonbenders because the council suspected they were all Equalists who would attempt to overthrow the council, a decision brought on by prejudice and mass hysteria. Most lower-class citizens appear to be nonbenders, as evidenced by the whole of the Dragon Flats borough, a place resembling a ghetto for nonbenders, being put under the curfew, suggesting everyone there was a nonbender."
    },
    {
      "body": "${link_0} members abused their power over a ${link_1}.",
      "links": [
        {
          "body": "Triple Threat Triad",
          "key": "${link_0}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "nonbender",
          "key": "${link_1}",
          "target": {
            "href": "Chung",
            "page": "Chung"
          }
        }
      ],
      "text": "Triple Threat Triad members abused their power over a nonbender."
    },
    {
      "body": "Oftentimes bending triads take advantage of theirs and the nonbenders' positions in society for their own personal gain, as seen when the ${link_0} attempted to extort an ${link_1}.",
      "links": [
        {
          "body": "Triple Threats",
          "key": "${link_0}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "innocent nonbending citizen",
          "key": "${link_1}",
          "target": {
            "href": "Chung",
            "page": "Chung"
          }
        }
      ],
      "text": "Oftentimes bending triads take advantage of theirs and the nonbenders' positions in society for their own personal gain, as seen when the Triple Threats attempted to extort an innocent nonbending citizen."
    },
    {
      "body": "People in the United Republic, particularly Republic City, are generally accepting of those in same-gender relationships.",
      "links": [],
      "text": "People in the United Republic, particularly Republic City, are generally accepting of those in same-gender relationships."
    },
    {
      "body": "The ${link_0} has the power to stand up to royalty.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "The Avatar has the power to stand up to royalty."
    },
    {
      "body": "The Avatar is in a social class of their own, being unique in the world and wielding vast bending powers. Before the Hundred Year War, the Avatar was considered to be without equal in the entire world, a sacred being representing the principle of balance. All of the Fire Sages, the assembled Fire Nation nobility, and the Crown Prince Sozin all bowed to ${link_0} when he was revealed as the new Avatar, at the time sharing power with the Fire Lord in the Fire Nation, giving their allegiance to the Avatar. Some kings, as well as upstarts like ${link_1} the Great, have stood up to past Avatars, but were quickly put back in their place. Even when Sozin was already the Fire Lord, Roku had enough authority to openly defy and forbid him from pursuing his dreams of invading other nations, as if the Fire Lord himself were a subordinate.",
      "links": [
        {
          "body": "Roku",
          "key": "${link_0}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Chin",
          "key": "${link_1}",
          "target": {
            "href": "Chin",
            "page": "Chin"
          }
        }
      ],
      "text": "The Avatar is in a social class of their own, being unique in the world and wielding vast bending powers. Before the Hundred Year War, the Avatar was considered to be without equal in the entire world, a sacred being representing the principle of balance. All of the Fire Sages, the assembled Fire Nation nobility, and the Crown Prince Sozin all bowed to Roku when he was revealed as the new Avatar, at the time sharing power with the Fire Lord in the Fire Nation, giving their allegiance to the Avatar. Some kings, as well as upstarts like Chin the Great, have stood up to past Avatars, but were quickly put back in their place. Even when Sozin was already the Fire Lord, Roku had enough authority to openly defy and forbid him from pursuing his dreams of invading other nations, as if the Fire Lord himself were a subordinate."
    },
    {
      "body": "The Avatar is required to do what it takes to bring balance to the world and thus is not able to claim allegiance or conform only to his or her native country. Examples of this include Avatar ${link_0}, who was willing to resort to lethal methods, although that is against Air Nomad beliefs, Avatar ${link_1} who defied the Earth King, and Avatar Roku, who, despite being born in the Fire Nation, threatened to end Fire Lord Sozin's life if he were to continue Fire Nation colonization of the Earth Kingdom. At the same time however, the Avatar cannot act as if they are completely above the law of any established government. Statutes of a given nation still apply to the Avatar, at least in recent times, as evidenced when Avatar Korra first came to Republic City. Nonetheless, detention of the Avatar by a nation could trigger an international incident.",
      "links": [
        {
          "body": "Yangchen",
          "key": "${link_0}",
          "target": {
            "href": "Yangchen",
            "page": "Yangchen"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        }
      ],
      "text": "The Avatar is required to do what it takes to bring balance to the world and thus is not able to claim allegiance or conform only to his or her native country. Examples of this include Avatar Yangchen, who was willing to resort to lethal methods, although that is against Air Nomad beliefs, Avatar Kyoshi who defied the Earth King, and Avatar Roku, who, despite being born in the Fire Nation, threatened to end Fire Lord Sozin's life if he were to continue Fire Nation colonization of the Earth Kingdom. At the same time however, the Avatar cannot act as if they are completely above the law of any established government. Statutes of a given nation still apply to the Avatar, at least in recent times, as evidenced when Avatar Korra first came to Republic City. Nonetheless, detention of the Avatar by a nation could trigger an international incident."
    },
    {
      "body": "Also, the Avatar is revered and loved by the general populace, with shrines and temples across the four nations dedicated to him or her and spiritual groups tending to places connected to him. The people of the four nations viewed the Avatar as the supreme arbiter of any injustice done upon them or the world in general, vested with the power and authority of the great spirit of the World.",
      "links": [],
      "text": "Also, the Avatar is revered and loved by the general populace, with shrines and temples across the four nations dedicated to him or her and spiritual groups tending to places connected to him. The people of the four nations viewed the Avatar as the supreme arbiter of any injustice done upon them or the world in general, vested with the power and authority of the great spirit of the World."
    },
    {
      "body": "The Avatar may have a family and own property just as normal people do, as Roku settled with Ta Min on a remote island, and Kyoshi created what became known as ${link_0} when ousting Chin the Great. The Avatar is also not prohibited from taking up a side job, as Aang stated he saw no reason he could not be in the position of a jewelry maker and the Avatar at the same time. However, their main duty is to the world, something from which they should not be distracted by attempting to accumulate wealth and belongings.",
      "links": [
        {
          "body": "Kyoshi Island",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        }
      ],
      "text": "The Avatar may have a family and own property just as normal people do, as Roku settled with Ta Min on a remote island, and Kyoshi created what became known as Kyoshi Island when ousting Chin the Great. The Avatar is also not prohibited from taking up a side job, as Aang stated he saw no reason he could not be in the position of a jewelry maker and the Avatar at the same time. However, their main duty is to the world, something from which they should not be distracted by attempting to accumulate wealth and belongings."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Society_in_the_World_of_Avatar",
    "file": "avatar.wikia.com/wiki/Society_in_the_World_of_Avatar.html",
    "page": "Society_in_the_World_of_Avatar",
    "title": "Society in the World of Avatar"
  }
}