{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "external": false,
        "href": "/wiki/Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Sokka",
      "target": {
        "external": false,
        "href": "/wiki/Category_Sokka",
        "page": "Category_Sokka"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Sokka's skeptical nature often conflicted with others, but his protectiveness toward his friends and loyal personality allowed him to gain many friends and allies.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "Sokka's relationships"
      ],
      "text": "This page is comprised of Sokka's relationships with other characters in the World of Avatar. Sokka's skeptical nature often conflicted with others, but his protectiveness toward his friends and loyal personality allowed him to gain many friends and allies."
    },
    {
      "body": "Initially, Sokka did not embrace ${link_0} as quickly as his ${link_1} did. He seemed skeptical of Aang's ${link_2}, and occasionally frustrated with Aang's cavalier attitude. He showed fierce anger when Aang's carelessness got Katara hurt, and when Aang purposely deceived them, though he forgave him fully afterward. Later, Sokka began to show more marvel at Aang's strength. He eventually openly admitted that Aang was \"part of the family\". Sokka became very protective of Aang; when the villagers sent him out to face ${link_3} alone, Sokka got himself captured while trying to protect the young ${link_4}. The two could also be seen goofing around. Even though Sokka and Aang had their differences, they reached much better terms with one another; they were able to talk to each other easily and became great friends.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "sister",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "powers",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Hei Bai",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Hei_Bai",
            "page": "Hei_Bai"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Relatives",
        "Aang"
      ],
      "text": "Initially, Sokka did not embrace Aang as quickly as his sister did. He seemed skeptical of Aang's powers, and occasionally frustrated with Aang's cavalier attitude. He showed fierce anger when Aang's carelessness got Katara hurt, and when Aang purposely deceived them, though he forgave him fully afterward. Later, Sokka began to show more marvel at Aang's strength. He eventually openly admitted that Aang was \"part of the family\". Sokka became very protective of Aang; when the villagers sent him out to face Hei Bai alone, Sokka got himself captured while trying to protect the young Avatar. The two could also be seen goofing around. Even though Sokka and Aang had their differences, they reached much better terms with one another; they were able to talk to each other easily and became great friends."
    },
    {
      "body": "Sokka lamented that he failed being a public speaker to inspire the invasion force like his ${link_0} did. Aang assured him that Sokka's moment of glory would be witnessed in the actual fight. This established that both Sokka and Aang finally considered each other as brothers-in-arms. When ${link_1} offered to join the group to teach Aang ${link_2}, Sokka bluntly refused largely out of concern for Aang's well-being. When Aang eventually did welcome Zuko after he saved the group from an attack, Sokka gave his consent, knowing that Aang knew what was best.",
      "links": [
        {
          "body": "father",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Relatives",
        "Aang"
      ],
      "text": "Sokka lamented that he failed being a public speaker to inspire the invasion force like his father did. Aang assured him that Sokka's moment of glory would be witnessed in the actual fight. This established that both Sokka and Aang finally considered each other as brothers-in-arms. When Zuko offered to join the group to teach Aang firebending, Sokka bluntly refused largely out of concern for Aang's well-being. When Aang eventually did welcome Zuko after he saved the group from an attack, Sokka gave his consent, knowing that Aang knew what was best."
    },
    {
      "body": "During the final fight between Aang and ${link_0} ${link_1}, Sokka cheered him on. After Aang won, Sokka praised him, in his typical goofy fashion, on his skills shown in the fight. They were shown to be brotherly later on. The two later became brothers-in-law as a result of Aang's marriage to Katara.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Relatives",
        "Aang"
      ],
      "text": "During the final fight between Aang and Fire Lord Ozai, Sokka cheered him on. After Aang won, Sokka praised him, in his typical goofy fashion, on his skills shown in the fight. They were shown to be brotherly later on. The two later became brothers-in-law as a result of Aang's marriage to Katara."
    },
    {
      "body": "Sokka idolized his father, Hakoda, hoping to become a valiant warrior who would battle the ${link_0}. Deeply saddened by his father's departure, Sokka eagerly awaited the day he could reunite with him. He once seriously considered leaving Aang behind in order to meet him at a military rendezvous point, briefly acting on this desire during an argument with him. Sokka's primary weapon and most prized possession was his metal ${link_1}, given to him by his father before going off to war. Sokka reunited with his father at ${link_2}, where Hakoda recognized his son as a man. Sadly, the reunion was cut short when Aang came with news of Katara's capture in ${link_3}. After leaving Ba Sing Se, while Aang was unconscious, ${link_4} flew to Chameleon Bay to reunite with Hakoda. The ${link_5} and Team Avatar, excluding Aang, forced ${link_6} to abandon one of their ${link_7}, leaving the others to claim ownership of it. When Aang flew off, Team Avatar separated from the Water Tribe warriors again and were not seen together again until the ${link_8} was about to begin. After the Invasion plan failed, Sokka promised his father they would reunite after the two were forced to separate.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "boomerang",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka%27s_weapons#Boomerang",
            "page": "Sokka%27s_weapons"
          }
        },
        {
          "body": "Chameleon Bay",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Chameleon_Bay",
            "page": "Chameleon_Bay"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Water Tribe warriors",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        },
        {
          "body": "Fire Nation soldiers",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "ships",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_cruiser",
            "page": "Fire_Nation_cruiser"
          }
        },
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Relatives",
        "Hakoda"
      ],
      "text": "Sokka idolized his father, Hakoda, hoping to become a valiant warrior who would battle the Fire Nation. Deeply saddened by his father's departure, Sokka eagerly awaited the day he could reunite with him. He once seriously considered leaving Aang behind in order to meet him at a military rendezvous point, briefly acting on this desire during an argument with him. Sokka's primary weapon and most prized possession was his metal boomerang, given to him by his father before going off to war. Sokka reunited with his father at Chameleon Bay, where Hakoda recognized his son as a man. Sadly, the reunion was cut short when Aang came with news of Katara's capture in Ba Sing Se. After leaving Ba Sing Se, while Aang was unconscious, Team Avatar flew to Chameleon Bay to reunite with Hakoda. The Water Tribe warriors and Team Avatar, excluding Aang, forced Fire Nation soldiers to abandon one of their ships, leaving the others to claim ownership of it. When Aang flew off, Team Avatar separated from the Water Tribe warriors again and were not seen together again until the invasion of the Fire Nation was about to begin. After the Invasion plan failed, Sokka promised his father they would reunite after the two were forced to separate."
    },
    {
      "body": "Sokka risked imprisonment in the Fire Nation's highest security prison in the hopes of rescuing his father. With Zuko's aid, he was able to successfully free Hakoda from the ${link_0} Prison. However, this reunion was short-lived; when ${link_1} attacked their campsite at the ${link_2}, the group made a crucial decision to separate once more.",
      "links": [
        {
          "body": "Boiling Rock",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Relatives",
        "Hakoda"
      ],
      "text": "Sokka risked imprisonment in the Fire Nation's highest security prison in the hopes of rescuing his father. With Zuko's aid, he was able to successfully free Hakoda from the Boiling Rock Prison. However, this reunion was short-lived; when Azula attacked their campsite at the Western Air Temple, the group made a crucial decision to separate once more."
    },
    {
      "body": "Sokka and his father finally reunited together at Zuko's coronation after their spectacular victory over the Fire Nation in the ${link_0}.",
      "links": [
        {
          "body": "War",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Relatives",
        "Hakoda"
      ],
      "text": "Sokka and his father finally reunited together at Zuko's coronation after their spectacular victory over the Fire Nation in the War."
    },
    {
      "body": "Sokka strove to be like his father and shared many personality traits with Hakoda; such as brilliant planning, leadership, bravery, inventive ingenuity, and sense of humor. ${link_0} remarked upon this, saying, \"You're definitely your father's son\", after Sokka laughed at Hakoda's attempt at wit in naming his ${link_1} the \"stink and sink\", albeit in an unamused tone.",
      "links": [
        {
          "body": "Bato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bato",
            "page": "Bato"
          }
        },
        {
          "body": "bomb",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tangle_mine",
            "page": "Tangle_mine"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Relatives",
        "Hakoda"
      ],
      "text": "Sokka strove to be like his father and shared many personality traits with Hakoda; such as brilliant planning, leadership, bravery, inventive ingenuity, and sense of humor. Bato remarked upon this, saying, \"You're definitely your father's son\", after Sokka laughed at Hakoda's attempt at wit in naming his bomb the \"stink and sink\", albeit in an unamused tone."
    },
    {
      "body": "Sokka's grandmother, ${link_0}, was the oldest survivor of the ${link_1} of the ${link_2}. Being such, she looked after the tribe. When Hakoda left his children to fight in the Hundred Year War, Sokka was placed under Kanna's care. Like Sokka, she was cautious, wary of change, and tended to be cynical. When she believed Aang's actions to have endangered the village, she took Sokka's side in the argument. However, she came to see that it was her grandchildren's destiny to journey with the Avatar and saw them off, telling her grandson to take care of his sister and not to tease her. Sokka and Katara developed a habit of calling her \"Gran-Gran\".",
      "links": [
        {
          "body": "Kanna",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kanna",
            "page": "Kanna"
          }
        },
        {
          "body": "Fire Nation raids",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Relatives",
        "Kanna"
      ],
      "text": "Sokka's grandmother, Kanna, was the oldest survivor of the Fire Nation raids of the Southern Water Tribe. Being such, she looked after the tribe. When Hakoda left his children to fight in the Hundred Year War, Sokka was placed under Kanna's care. Like Sokka, she was cautious, wary of change, and tended to be cynical. When she believed Aang's actions to have endangered the village, she took Sokka's side in the argument. However, she came to see that it was her grandchildren's destiny to journey with the Avatar and saw them off, telling her grandson to take care of his sister and not to tease her. Sokka and Katara developed a habit of calling her \"Gran-Gran\"."
    },
    {
      "body": "Sokka and Katara had a typical sibling rivalry, and despite constant bickering in the course of their travels, the siblings loved each other dearly. Sokka felt obligated to protect his younger sister as urged by his father before his departure to the ${link_0}. Sokka took this task very seriously and became somewhat overprotective at times. He proved to be very loyal to her; when Katara decided to defend the fishing village of ${link_1} against the Fire Nation Army, he put his anger aside in order to help her. Later, Sokka confessed to ${link_2} that Katara had always been the one looking out for him. She took on such an important role in Sokka's life to the extent where whenever he tried to picture what his ${link_3} had looked like, Katara's was the only face that came to mind.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Jang Hui",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jang_Hui",
            "page": "Jang_Hui"
          }
        },
        {
          "body": "Toph",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "mother",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Relatives",
        "Katara"
      ],
      "text": "Sokka and Katara had a typical sibling rivalry, and despite constant bickering in the course of their travels, the siblings loved each other dearly. Sokka felt obligated to protect his younger sister as urged by his father before his departure to the Earth Kingdom. Sokka took this task very seriously and became somewhat overprotective at times. He proved to be very loyal to her; when Katara decided to defend the fishing village of Jang Hui against the Fire Nation Army, he put his anger aside in order to help her. Later, Sokka confessed to Toph that Katara had always been the one looking out for him. She took on such an important role in Sokka's life to the extent where whenever he tried to picture what his mother had looked like, Katara's was the only face that came to mind."
    },
    {
      "body": "Their different personalities often clashed, with Sokka's goofiness and pessimism and Katara's temper and optimism leading to frequent fights. However, because of the history they shared and the struggles they had to overcome as children when their mother died and their father went off to fight in the Hundred Year War, the two identified with each other and were very close.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Relatives",
        "Katara"
      ],
      "text": "Their different personalities often clashed, with Sokka's goofiness and pessimism and Katara's temper and optimism leading to frequent fights. However, because of the history they shared and the struggles they had to overcome as children when their mother died and their father went off to fight in the Hundred Year War, the two identified with each other and were very close."
    },
    {
      "body": "Sokka always had great concern for his sister. When her hands were accidentally burned by Aang, he yelled at him and knocked him down, and even though Katara often teased him, he would always take care of her, even commenting proudly that when it came to her, he did not mind receiving the shorter end of the deal.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Relatives",
        "Katara"
      ],
      "text": "Sokka always had great concern for his sister. When her hands were accidentally burned by Aang, he yelled at him and knocked him down, and even though Katara often teased him, he would always take care of her, even commenting proudly that when it came to her, he did not mind receiving the shorter end of the deal."
    },
    {
      "body": "The death of Sokka's mother, Kya, in a Fire Nation raid was the primary fuel for Sokka's deep grudge against the Fire Nation forces. Though his anger had faded somewhat, her loss remained a very sore point. Sokka even admitted that despite the fact his caring, loving mother was important to him, he could not remember her face very well due to the fact that she died when he was at a young age. Whenever Sokka thought of his mother, he saw instead the face of his sister, who seemed to have always been the maternal figure in his life.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Relatives",
        "Kya"
      ],
      "text": "The death of Sokka's mother, Kya, in a Fire Nation raid was the primary fuel for Sokka's deep grudge against the Fire Nation forces. Though his anger had faded somewhat, her loss remained a very sore point. Sokka even admitted that despite the fact his caring, loving mother was important to him, he could not remember her face very well due to the fact that she died when he was at a young age. Whenever Sokka thought of his mother, he saw instead the face of his sister, who seemed to have always been the maternal figure in his life."
    },
    {
      "body": "The ${link_0} master of the ${link_1}, ${link_2}, migrated to the Southern tribe to help rebuild the city. There, he reunited with his lost love, Kanna, and gave her a new ${link_3}, thus becoming Sokka's step-grandfather. Like Katara, Sokka was thrilled with this news. Sokka even went as far as to suggest calling Pakku \"Grandpa-ku\", although Pakku was not amused and rejected it.",
      "links": [
        {
          "body": "waterbending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Pakku",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "betrothal necklace",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Betrothal_necklace",
            "page": "Betrothal_necklace"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Relatives",
        "Pakku"
      ],
      "text": "The waterbending master of the Northern Water Tribe, Pakku, migrated to the Southern tribe to help rebuild the city. There, he reunited with his lost love, Kanna, and gave her a new betrothal necklace, thus becoming Sokka's step-grandfather. Like Katara, Sokka was thrilled with this news. Sokka even went as far as to suggest calling Pakku \"Grandpa-ku\", although Pakku was not amused and rejected it."
    },
    {
      "body": "Team Avatar once stopped at an Earth Kingdom village, and tried fake fur pelts. ${link_0}, a young passerby, mistakenly took for her a compliment made by Sokka about the pelts. However, when Sokka tried to set a date between them, Kaya became upset and left the scene. After one of Sokka's lapses, Kaya came to believe he was the Avatar, a belief that was further supported by Aang who provided Sokka's airbending prowess. Kaya quickly accepted Sokka as her boyfriend, and soon presented him to her entire family. She briefly enjoyed her status as the \"Avatar's\" girlfriend before the ${link_1} invaded her village. Of course, as Sokka could not bend at all, Aang, Toph and Katara stopped the attack on the village. Kaya, however, came to believe Sokka had let his \"servants\" enjoy a hero's day of their own.",
      "links": [
        {
          "body": "Kaya",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kaya_(village_girl)",
            "page": "Kaya_(village_girl)"
          }
        },
        {
          "body": "Rough Rhinos",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Rough_Rhinos",
            "page": "Rough_Rhinos"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Love interests",
        "Kaya"
      ],
      "text": "Team Avatar once stopped at an Earth Kingdom village, and tried fake fur pelts. Kaya, a young passerby, mistakenly took for her a compliment made by Sokka about the pelts. However, when Sokka tried to set a date between them, Kaya became upset and left the scene. After one of Sokka's lapses, Kaya came to believe he was the Avatar, a belief that was further supported by Aang who provided Sokka's airbending prowess. Kaya quickly accepted Sokka as her boyfriend, and soon presented him to her entire family. She briefly enjoyed her status as the \"Avatar's\" girlfriend before the Rough Rhinos invaded her village. Of course, as Sokka could not bend at all, Aang, Toph and Katara stopped the attack on the village. Kaya, however, came to believe Sokka had let his \"servants\" enjoy a hero's day of their own."
    },
    {
      "body": "Love found Sokka when he became smitten with ${link_0} ${link_1} of the Northern Water Tribe. Sokka's attempts to court Yue were first reciprocated; however, Yue eventually said she could not see him anymore because she was already engaged to a young man named ${link_2}, though in reality it was a political union and she did not love him. She explained that she had feelings for Sokka, but could not abandon her people and their customs. The relationship came to a tragic end when Yue sacrificed her mortal form to give the waterbenders' patron ${link_3} new life after ${link_4} ${link_5} killed the mortal form of the Moon Spirit. Sokka's former love now exists as a reincarnation of Tui, the Moon Spirit.",
      "links": [
        {
          "body": "Princess",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Hahn",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Hahn",
            "page": "Hahn"
          }
        },
        {
          "body": "Moon Spirit",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Admiral",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Zhao",
            "page": "Zhao"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Love interests",
        "Princess Yue"
      ],
      "text": "Love found Sokka when he became smitten with Princess Yue of the Northern Water Tribe. Sokka's attempts to court Yue were first reciprocated; however, Yue eventually said she could not see him anymore because she was already engaged to a young man named Hahn, though in reality it was a political union and she did not love him. She explained that she had feelings for Sokka, but could not abandon her people and their customs. The relationship came to a tragic end when Yue sacrificed her mortal form to give the waterbenders' patron Moon Spirit new life after Admiral Zhao killed the mortal form of the Moon Spirit. Sokka's former love now exists as a reincarnation of Tui, the Moon Spirit."
    },
    {
      "body": "While Yue promised to remain with him always in spirit, and parted with one last kiss, her loss still deeply affected Sokka. Sokka envisioned her confronting him and asking why he was unable to protect her, a task that her father ${link_0} ${link_1} had asked him to do. On several occasions, Sokka was illustrated to contemplate Yue when the moon was referenced, as exhibited when ${link_2} came across Sokka sitting in seclusion, gazing at the moon. When she commented how beautiful the moon was that night, Sokka agreed in all literal how it truly was. Sokka subsequently expressed reluctance toward kissing Suki under the moon. Later, when Toph suggested the disappearances in ${link_3} were due to the Moon Spirit having turned mean, Sokka angrily defended Yue, saying she was a gentle, loving lady who ruled the sky with \"lunar goodness\".",
      "links": [
        {
          "body": "Chief",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Arnook",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Arnook",
            "page": "Arnook"
          }
        },
        {
          "body": "Suki",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Hama's village",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Hama%27s_village",
            "page": "Hama%27s_village"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Love interests",
        "Princess Yue"
      ],
      "text": "While Yue promised to remain with him always in spirit, and parted with one last kiss, her loss still deeply affected Sokka. Sokka envisioned her confronting him and asking why he was unable to protect her, a task that her father Chief Arnook had asked him to do. On several occasions, Sokka was illustrated to contemplate Yue when the moon was referenced, as exhibited when Suki came across Sokka sitting in seclusion, gazing at the moon. When she commented how beautiful the moon was that night, Sokka agreed in all literal how it truly was. Sokka subsequently expressed reluctance toward kissing Suki under the moon. Later, when Toph suggested the disappearances in Hama's village were due to the Moon Spirit having turned mean, Sokka angrily defended Yue, saying she was a gentle, loving lady who ruled the sky with \"lunar goodness\"."
    },
    {
      "body": "When Sokka and the gang saw a ${link_0} about them, a scene depicted a retelling of how Sokka and Yue were separated upon the latter's death. Suki teased Sokka about this, and an emotional Sokka shushed her as he watched the scene intently. Suki expressed notable jealousy at this.",
      "links": [
        {
          "body": "play",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Love interests",
        "Princess Yue"
      ],
      "text": "When Sokka and the gang saw a play about them, a scene depicted a retelling of how Sokka and Yue were separated upon the latter's death. Suki teased Sokka about this, and an emotional Sokka shushed her as he watched the scene intently. Suki expressed notable jealousy at this."
    },
    {
      "body": "Sokka once nursed a sexist streak, but his associations with two particular young women drastically changed his views. His presumption that women were incompetent fighters was tested when he met Suki, a young female warrior, on ${link_0}. Humbled by her skill, he turned to her for instruction. The two bonded over sparring matches and, before parting, she kissed him on the cheek, causing Sokka to blush.",
      "links": [
        {
          "body": "Kyoshi Island",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Love interests",
        "Suki"
      ],
      "text": "Sokka once nursed a sexist streak, but his associations with two particular young women drastically changed his views. His presumption that women were incompetent fighters was tested when he met Suki, a young female warrior, on Kyoshi Island. Humbled by her skill, he turned to her for instruction. The two bonded over sparring matches and, before parting, she kissed him on the cheek, causing Sokka to blush."
    },
    {
      "body": "When Sokka and the others journeyed to Ba Sing Se, the two reunited at ${link_0} where she and her ${link_1} operated as sentries for the ${link_2}. She decided to accompany Team Avatar on their journey across the ${link_3}, much to Sokka's worry. He was extremely overprotective of Suki during the trip, and continued to be overbearingly cautious even after she confronted him about it. During the night, Sokka and Suki talked where he explained to her how he did not want to lose anyone he cared about after his tragic experience with Princess Yue. As they talked, the moon was visible behind them, implying the presence of Princess Yue, the first girl he ever fell in love with, and whose death he blamed himself for causing. Suki expressed how important Sokka was to her and the two almost kissed, but Sokka drew back reluctantly because of his painful memories of Yue. However, the next day when she bade him good-bye and apologized about the night before, he kissed her twice to confirm that he loves her before departing.",
      "links": [
        {
          "body": "Full Moon Bay",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Full_Moon_Bay",
            "page": "Full_Moon_Bay"
          }
        },
        {
          "body": "warriors",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Ba Sing Se ferry",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom_ferry",
            "page": "Earth_Kingdom_ferry"
          }
        },
        {
          "body": "Serpent's Pass",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Serpent%27s_Pass",
            "page": "Serpent%27s_Pass"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Love interests",
        "Suki"
      ],
      "text": "When Sokka and the others journeyed to Ba Sing Se, the two reunited at Full Moon Bay where she and her warriors operated as sentries for the Ba Sing Se ferry. She decided to accompany Team Avatar on their journey across the Serpent's Pass, much to Sokka's worry. He was extremely overprotective of Suki during the trip, and continued to be overbearingly cautious even after she confronted him about it. During the night, Sokka and Suki talked where he explained to her how he did not want to lose anyone he cared about after his tragic experience with Princess Yue. As they talked, the moon was visible behind them, implying the presence of Princess Yue, the first girl he ever fell in love with, and whose death he blamed himself for causing. Suki expressed how important Sokka was to her and the two almost kissed, but Sokka drew back reluctantly because of his painful memories of Yue. However, the next day when she bade him good-bye and apologized about the night before, he kissed her twice to confirm that he loves her before departing."
    },
    {
      "body": "In the middle of the ${link_0}, Azula used her knowledge of Suki's whereabouts to successfully stall Sokka, Aang, and Toph. Azula revealed that her favorite prisoner used to mention Sokka all the time, convinced that he would rescue her. However, he never came and she gave up on him. Sokka responded to Azula's taunts by shedding a single tear and rashly charging toward her. He demanded that Azula reveal where Suki was being held captive; however, the Fire Nation ${link_1} revealed nothing, and was eventually able to escape once the eclipse had passed.",
      "links": [
        {
          "body": "solar eclipse",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "Princess",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Love interests",
        "Suki"
      ],
      "text": "In the middle of the solar eclipse, Azula used her knowledge of Suki's whereabouts to successfully stall Sokka, Aang, and Toph. Azula revealed that her favorite prisoner used to mention Sokka all the time, convinced that he would rescue her. However, he never came and she gave up on him. Sokka responded to Azula's taunts by shedding a single tear and rashly charging toward her. He demanded that Azula reveal where Suki was being held captive; however, the Fire Nation Princess revealed nothing, and was eventually able to escape once the eclipse had passed."
    },
    {
      "body": "Sokka and Zuko traveled to the Boiling Rock Prison in an attempt to save Sokka's father. While there, Sokka finally found Suki and took the opportunity to free her. When Sokka came to her cell she could not recognize him due to his guard outfit and pushed him backward when he tried to kiss her. When Suki found out who he was, she was overwhelmed with happiness, to the point that she started to cry tears of joy, and embraced him. She revealed that she never lost faith in Sokka's return, and the two shared a kiss. She assisted Sokka in freeing his father and escaping the prison. She impressed him with her agility in her capture of the prison ${link_0}, who they planned to use as a captive for the escape. Sokka was eventually able to free Suki and his father, and Suki joined the group after they reached the Western Air Temple.",
      "links": [
        {
          "body": "warden",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Warden_(Boiling_Rock)",
            "page": "Warden_(Boiling_Rock)"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Love interests",
        "Suki"
      ],
      "text": "Sokka and Zuko traveled to the Boiling Rock Prison in an attempt to save Sokka's father. While there, Sokka finally found Suki and took the opportunity to free her. When Sokka came to her cell she could not recognize him due to his guard outfit and pushed him backward when he tried to kiss her. When Suki found out who he was, she was overwhelmed with happiness, to the point that she started to cry tears of joy, and embraced him. She revealed that she never lost faith in Sokka's return, and the two shared a kiss. She assisted Sokka in freeing his father and escaping the prison. She impressed him with her agility in her capture of the prison warden, who they planned to use as a captive for the escape. Sokka was eventually able to free Suki and his father, and Suki joined the group after they reached the Western Air Temple."
    },
    {
      "body": "After the gang was forced to relocate following an attack on the Western Air Temple, Sokka and Suki apparently arranged for a romantic evening together. Sokka decorated his tent with candles and roses and was put in an awkward situation when Zuko arrived instead of Suki.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Love interests",
        "Suki"
      ],
      "text": "After the gang was forced to relocate following an attack on the Western Air Temple, Sokka and Suki apparently arranged for a romantic evening together. Sokka decorated his tent with candles and roses and was put in an awkward situation when Zuko arrived instead of Suki."
    },
    {
      "body": "During a ${link_0} on ${link_1}, Suki teased Sokka about his relationship with Princess Yue during a scene where Sokka and Yue kiss. When Sokka shushed her during this scene, she expressed jealousy, but quickly recovered. She later helped Sokka go backstage to give ${link_2} advice.",
      "links": [
        {
          "body": "play",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        },
        {
          "body": "Ember Island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ember_Island",
            "page": "Ember_Island"
          }
        },
        {
          "body": "Sokka's actor",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ember_Island_Players#Actor_Sokka",
            "page": "Ember_Island_Players"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Love interests",
        "Suki"
      ],
      "text": "During a play on Ember Island, Suki teased Sokka about his relationship with Princess Yue during a scene where Sokka and Yue kiss. When Sokka shushed her during this scene, she expressed jealousy, but quickly recovered. She later helped Sokka go backstage to give Sokka's actor advice."
    },
    {
      "body": "Prior to the arrival of ${link_0}, Sokka and Suki hung out on the beach where Sokka created a hilariously crude sand statue of Suki's face. Despite its obvious ridiculousness, Suki was deeply touched and he kissed her on the cheek.",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Love interests",
        "Suki"
      ],
      "text": "Prior to the arrival of Sozin's Comet, Sokka and Suki hung out on the beach where Sokka created a hilariously crude sand statue of Suki's face. Despite its obvious ridiculousness, Suki was deeply touched and he kissed her on the cheek."
    },
    {
      "body": "During the battle upon the comet's arrival, Suki and Sokka teamed up with Toph to destroy Ozai's ${link_0}. While abandoning an airship, the team used to ram the other vessels; Suki became trapped on the falling vessel and was separated from Sokka. She insisted she was safe and told Sokka to continue their mission. Sokka was distraught at this, but was ultimately forced to continue the attack. When Sokka and Toph nearly fell to their deaths from one airship, Suki reappeared completely unharmed and saved them by piloting another airship.",
      "links": [
        {
          "body": "airship fleet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Love interests",
        "Suki"
      ],
      "text": "During the battle upon the comet's arrival, Suki and Sokka teamed up with Toph to destroy Ozai's airship fleet. While abandoning an airship, the team used to ram the other vessels; Suki became trapped on the falling vessel and was separated from Sokka. She insisted she was safe and told Sokka to continue their mission. Sokka was distraught at this, but was ultimately forced to continue the attack. When Sokka and Toph nearly fell to their deaths from one airship, Suki reappeared completely unharmed and saved them by piloting another airship."
    },
    {
      "body": "Suki and Sokka celebrated their victory over the Fire Nation with the gang at Ba Sing Se. She, along with the others, criticized Sokka's mediocre drawing of the team, having drawn her firebending.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Love interests",
        "Suki"
      ],
      "text": "Suki and Sokka celebrated their victory over the Fire Nation with the gang at Ba Sing Se. She, along with the others, criticized Sokka's mediocre drawing of the team, having drawn her firebending."
    },
    {
      "body": "Sokka and ${link_0} had a rather unique relationship. When the two first met, Sokka had doubts that Appa could fly and was sneezed on by the latter, which did not really improve their relationship. After Sokka saw that he really could fly, though, he became more friendly toward him. After Sokka became a member of Team Avatar, the two eventually became close friends. Sokka even used Appa to impress Princess Yue, and made him armor to keep him safe on the Day of Black Sun. Although sometimes critical of the bison's flying capabilities, the two enjoyed a close bond. Like the other team members, Sokka was overjoyed when reuniting with the previously-lost Appa.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Appa",
            "page": "Appa"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Appa"
      ],
      "text": "Sokka and Appa had a rather unique relationship. When the two first met, Sokka had doubts that Appa could fly and was sneezed on by the latter, which did not really improve their relationship. After Sokka saw that he really could fly, though, he became more friendly toward him. After Sokka became a member of Team Avatar, the two eventually became close friends. Sokka even used Appa to impress Princess Yue, and made him armor to keep him safe on the Day of Black Sun. Although sometimes critical of the bison's flying capabilities, the two enjoyed a close bond. Like the other team members, Sokka was overjoyed when reuniting with the previously-lost Appa."
    },
    {
      "body": "Bato was a good friend of Sokka's father; the gang encountered him while he recuperated from wounds that he sustained during an ambush against the Fire Nation soldiers. As Hakoda's proxy, Bato oversaw Sokka's traditional Water Tribe coming of age ritual of ${link_0}. Sokka solely controlled and commanded Bato's ship as he maneuvered the vessel in an ocean full of pointed rocks. Sokka passed the challenge and in turn Bato awarded him the ceremonial ${link_1}, the same mark Hakoda earned.",
      "links": [
        {
          "body": "ice dodging",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ice_dodging",
            "page": "Ice_dodging"
          }
        },
        {
          "body": "Mark of the Wise",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Body_markings_in_the_World_of_Avatar#Mark_of_the_Wise",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Bato"
      ],
      "text": "Bato was a good friend of Sokka's father; the gang encountered him while he recuperated from wounds that he sustained during an ambush against the Fire Nation soldiers. As Hakoda's proxy, Bato oversaw Sokka's traditional Water Tribe coming of age ritual of ice dodging. Sokka solely controlled and commanded Bato's ship as he maneuvered the vessel in an ocean full of pointed rocks. Sokka passed the challenge and in turn Bato awarded him the ceremonial Mark of the Wise, the same mark Hakoda earned."
    },
    {
      "body": "When Aang showed Katara and Sokka the map leading to their father's whereabouts, Sokka became angry and decided to separate from Aang and follow Bato to see Hakoda. However, after hearing a wolf howl and Bato explaining it was separated from its pack, Sokka decided to go back, for he had realized the error of his actions earlier. The two were seen together again later when Sokka reunited with Hakoda, but they had very limited interaction, although Bato noted that Sokka was very much like his father.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Bato"
      ],
      "text": "When Aang showed Katara and Sokka the map leading to their father's whereabouts, Sokka became angry and decided to separate from Aang and follow Bato to see Hakoda. However, after hearing a wolf howl and Bato explaining it was separated from its pack, Sokka decided to go back, for he had realized the error of his actions earlier. The two were seen together again later when Sokka reunited with Hakoda, but they had very limited interaction, although Bato noted that Sokka was very much like his father."
    },
    {
      "body": "Sokka bought a pet messenger hawk that he fondly named ${link_0}. Hawky had something of a rivalry with ${link_1} and the two frequently got into fights. Though a new addition to the group, he seemed quite loyal to Sokka and apparently understood his speech. Sokka even tried getting Toph and Katara to become friends again by sending each of them a letter delivered by Hawky, though the plan failed. After Toph had Hawky send a letter to her parents, Sokka and Hawky were never seen together again.",
      "links": [
        {
          "body": "Hawky",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hawky",
            "page": "Hawky"
          }
        },
        {
          "body": "Momo",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Momo",
            "page": "Momo"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Hawky"
      ],
      "text": "Sokka bought a pet messenger hawk that he fondly named Hawky. Hawky had something of a rivalry with Momo and the two frequently got into fights. Though a new addition to the group, he seemed quite loyal to Sokka and apparently understood his speech. Sokka even tried getting Toph and Katara to become friends again by sending each of them a letter delivered by Hawky, though the plan failed. After Toph had Hawky send a letter to her parents, Sokka and Hawky were never seen together again."
    },
    {
      "body": "Unlike Katara and Aang, Sokka did not trust ${link_0} when they first met. He initially saw Jet as a rival and a threat as Jet had stolen his thunder in a fight against a group of Fire Nation soldiers. He stood with his instinctive views even when his two companions opposed them. Although not friendly to each other, the two were very similar in nature and both had loved ones killed by the Fire Nation. However, Jet took more extreme measures in his revenge, planning to wipe out an entire ${link_1} in an attempt to eliminate the Fire Nation soldiers stationed there, without remorse for the innocent villagers living there. Sokka was the first to learn this and, despite Jet and his ${link_2} capturing him, he managed to escape and evacuate all the people in the village. Jet called him a traitor, but Sokka replied, saying that Jet became the traitor when he stopped protecting innocent people.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jet",
            "page": "Jet"
          }
        },
        {
          "body": "Earth Kingdom village",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Gaipan",
            "page": "Gaipan"
          }
        },
        {
          "body": "group",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Freedom_Fighters",
            "page": "Freedom_Fighters"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Jet"
      ],
      "text": "Unlike Katara and Aang, Sokka did not trust Jet when they first met. He initially saw Jet as a rival and a threat as Jet had stolen his thunder in a fight against a group of Fire Nation soldiers. He stood with his instinctive views even when his two companions opposed them. Although not friendly to each other, the two were very similar in nature and both had loved ones killed by the Fire Nation. However, Jet took more extreme measures in his revenge, planning to wipe out an entire Earth Kingdom village in an attempt to eliminate the Fire Nation soldiers stationed there, without remorse for the innocent villagers living there. Sokka was the first to learn this and, despite Jet and his group capturing him, he managed to escape and evacuate all the people in the village. Jet called him a traitor, but Sokka replied, saying that Jet became the traitor when he stopped protecting innocent people."
    },
    {
      "body": "Unlike his sister, he was willing to accept Jet's help to find Appa in Ba Sing Se. He was the first to surmise that Jet was ${link_0} and unsuccessfully tried to help Jet regain his memory by sticking his trademark chewing straw in his mouth.",
      "links": [
        {
          "body": "brainwashed",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Brainwashing",
            "page": "Brainwashing"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Jet"
      ],
      "text": "Unlike his sister, he was willing to accept Jet's help to find Appa in Ba Sing Se. He was the first to surmise that Jet was brainwashed and unsuccessfully tried to help Jet regain his memory by sticking his trademark chewing straw in his mouth."
    },
    {
      "body": "Sokka's relationship with Momo was similar to his relationship with Appa. When the two first met, Sokka, who was starving at the time, saw him as a source of food and attempted to eat him. After Momo joined Team Avatar as a pet, Sokka befriended Momo and the two became close companions.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Momo"
      ],
      "text": "Sokka's relationship with Momo was similar to his relationship with Appa. When the two first met, Sokka, who was starving at the time, saw him as a source of food and attempted to eat him. After Momo joined Team Avatar as a pet, Sokka befriended Momo and the two became close companions."
    },
    {
      "body": "Throughout their journey, Momo was often the brunt of Sokka's jokes and sarcastic remarks. Often Sokka would argue with Momo, having a seemingly one sided rivalry with him. Sokka attempted to scare Aang into the ${link_0} by placing Momo over his head. During their time in the desert, both Sokka and Momo drank ${link_1}, causing them to hallucinate and become crazy.",
      "links": [
        {
          "body": "Avatar State",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "cactus juice",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Cactus_juice",
            "page": "Cactus_juice"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Momo"
      ],
      "text": "Throughout their journey, Momo was often the brunt of Sokka's jokes and sarcastic remarks. Often Sokka would argue with Momo, having a seemingly one sided rivalry with him. Sokka attempted to scare Aang into the Avatar State by placing Momo over his head. During their time in the desert, both Sokka and Momo drank cactus juice, causing them to hallucinate and become crazy."
    },
    {
      "body": "When Aang and Momo went missing, Sokka appeared more concerned for Momo's disappearance than Aang's. He initially accused Appa of eating Momo, even going so far as climbing into the sky bison's mouth to save him. When Sokka drew a picture of the gang at the ${link_0}, Momo chittered at Sokka, as if criticizing his work, and Sokka replied, \"Oh, you think you can do a better job, Momo?\"",
      "links": [
        {
          "body": "Jasmine Dragon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Momo"
      ],
      "text": "When Aang and Momo went missing, Sokka appeared more concerned for Momo's disappearance than Aang's. He initially accused Appa of eating Momo, even going so far as climbing into the sky bison's mouth to save him. When Sokka drew a picture of the gang at the Jasmine Dragon, Momo chittered at Sokka, as if criticizing his work, and Sokka replied, \"Oh, you think you can do a better job, Momo?\""
    },
    {
      "body": "${link_0} was originally one of Sokka's enemies, as he assisted Prince Zuko in his attempts to capture the Avatar and restore his honor, actually attacking Team Avatar early in their journey. However, after the failed ${link_1} on the North Pole, the two groups parted ways as they both journeyed through the Earth Kingdom.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "attack",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Iroh"
      ],
      "text": "Iroh was originally one of Sokka's enemies, as he assisted Prince Zuko in his attempts to capture the Avatar and restore his honor, actually attacking Team Avatar early in their journey. However, after the failed attack on the North Pole, the two groups parted ways as they both journeyed through the Earth Kingdom."
    },
    {
      "body": "Sokka and the rest of Team Avatar met up with Iroh again some weeks later during the ${link_0} and together they attempted to assist Aang during his duel with Zuko and Princess Azula. However, even against the combined efforts of Team Avatar, Prince Zuko, and the Dragon of the West, Azula was able to escape.",
      "links": [
        {
          "body": "Confrontation at Tu Zin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Confrontation_at_Tu_Zin",
            "page": "Confrontation_at_Tu_Zin"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Iroh"
      ],
      "text": "Sokka and the rest of Team Avatar met up with Iroh again some weeks later during the Confrontation at Tu Zin and together they attempted to assist Aang during his duel with Zuko and Princess Azula. However, even against the combined efforts of Team Avatar, Prince Zuko, and the Dragon of the West, Azula was able to escape."
    },
    {
      "body": "After Katara was taken hostage in Ba Sing Se, Sokka and the rest of Team Avatar were sought out by Iroh to help him save his nephew from captivity, forming an alliance between them. Despite their past disagreements, Sokka bore no real grudge toward Iroh and, in turn, Iroh did not take issue with the young warrior. However, Sokka was somewhat reluctant to save Zuko; Iroh understood how Sokka felt about Zuko, but urged Sokka to believe him when he said there was good inside Zuko. Sokka's mind did not change about saving Zuko until Aang affirmed working together with Iroh and Zuko was the best chance to save Katara and all of Ba Sing Se. When Toph discovered the location of the ${link_0}, Sokka told Aang to go with Iroh to save Katara and Zuko, whom he called an \"angry jerk\", adding to Iroh that he meant no offense, though the firebender took none anyway.",
      "links": [
        {
          "body": "Crystal Catacombs",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Iroh"
      ],
      "text": "After Katara was taken hostage in Ba Sing Se, Sokka and the rest of Team Avatar were sought out by Iroh to help him save his nephew from captivity, forming an alliance between them. Despite their past disagreements, Sokka bore no real grudge toward Iroh and, in turn, Iroh did not take issue with the young warrior. However, Sokka was somewhat reluctant to save Zuko; Iroh understood how Sokka felt about Zuko, but urged Sokka to believe him when he said there was good inside Zuko. Sokka's mind did not change about saving Zuko until Aang affirmed working together with Iroh and Zuko was the best chance to save Katara and all of Ba Sing Se. When Toph discovered the location of the Crystal Catacombs, Sokka told Aang to go with Iroh to save Katara and Zuko, whom he called an \"angry jerk\", adding to Iroh that he meant no offense, though the firebender took none anyway."
    },
    {
      "body": "Sokka and Iroh met again when Team Avatar, which now included a much changed Zuko, sought his help in defeating Ozai, as Aang has mysteriously gone missing. Iroh later helped the team to determine how they should assist in Ozai's final defeat when Sozin's Comet arrived, showing great respect for all of their abilities including Sokka, as he did not argue when the latter chose to take out Ozai's airship fleet, only offering encouragement.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Iroh"
      ],
      "text": "Sokka and Iroh met again when Team Avatar, which now included a much changed Zuko, sought his help in defeating Ozai, as Aang has mysteriously gone missing. Iroh later helped the team to determine how they should assist in Ozai's final defeat when Sozin's Comet arrived, showing great respect for all of their abilities including Sokka, as he did not argue when the latter chose to take out Ozai's airship fleet, only offering encouragement."
    },
    {
      "body": "Sokka went to master ${link_0} in order to be ${link_1} in the ways of the sword, for he felt that he was not contributing enough to the group, especially after being unable to do anything to help extinguish a fire, even Momo outdoing him. During his stay at ${link_2}, he said that he was not sure whether he was worthy of being trained by him. After a day's worth of training, Piandao instructed Sokka to make his own ${link_3}, for which he used the meteorite that had caused the fire the night before. Piandao stated that while his technique did not impress him at all, his intelligence, creativity and versatility did, even saying that those traits would allow him to become a greater master than he was. Sokka subsequently revealed his Water Tribe origin, causing Piandao to attack him. During the fight, Sokka was able to apply the concepts of his training, but was eventually defeated by Piandao, who revealed that he knew of Sokka's ancestry before even training him. When asked by Katara why he would train someone who was not native to the Fire Nation, he said that the way of the sword belonged to all nations. As a farewell gift, Piandao gave him a White Lotus ${link_4} tile.",
      "links": [
        {
          "body": "Piandao",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Piandao",
            "page": "Piandao"
          }
        },
        {
          "body": "instructed",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Swordsmanship_training",
            "page": "Swordsmanship_training"
          }
        },
        {
          "body": "Piandao's castle",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Piandao%27s_castle",
            "page": "Piandao%27s_castle"
          }
        },
        {
          "body": "sword",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka%27s_sword",
            "page": "Sokka%27s_sword"
          }
        },
        {
          "body": "Pai Sho",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Pai_Sho",
            "page": "Pai_Sho"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Piandao"
      ],
      "text": "Sokka went to master Piandao in order to be instructed in the ways of the sword, for he felt that he was not contributing enough to the group, especially after being unable to do anything to help extinguish a fire, even Momo outdoing him. During his stay at Piandao's castle, he said that he was not sure whether he was worthy of being trained by him. After a day's worth of training, Piandao instructed Sokka to make his own sword, for which he used the meteorite that had caused the fire the night before. Piandao stated that while his technique did not impress him at all, his intelligence, creativity and versatility did, even saying that those traits would allow him to become a greater master than he was. Sokka subsequently revealed his Water Tribe origin, causing Piandao to attack him. During the fight, Sokka was able to apply the concepts of his training, but was eventually defeated by Piandao, who revealed that he knew of Sokka's ancestry before even training him. When asked by Katara why he would train someone who was not native to the Fire Nation, he said that the way of the sword belonged to all nations. As a farewell gift, Piandao gave him a White Lotus Pai Sho tile."
    },
    {
      "body": "Piandao and Sokka reunited before the ${link_0}, and before departing to destroy Ozai's airships. Sokka hugged Piandao, showing that they had become good friends.",
      "links": [
        {
          "body": "liberation of Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Liberation_of_Ba_Sing_Se",
            "page": "Liberation_of_Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Piandao"
      ],
      "text": "Piandao and Sokka reunited before the liberation of Ba Sing Se, and before departing to destroy Ozai's airships. Sokka hugged Piandao, showing that they had become good friends."
    },
    {
      "body": "With their shared admiration of science and technology, Sokka immediately formed a friendship with the ${link_0}, the leader of a group of Earth Kingdom refugees who had established the ${link_1} as their new home. Working together, the two were able to complete the mechanist's experimental ${link_2}, which was later used to drive off the Fire Nation forces attempting to invade the temple.",
      "links": [
        {
          "body": "mechanist",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mechanist",
            "page": "Mechanist"
          }
        },
        {
          "body": "Northern Air Temple",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        },
        {
          "body": "hot air balloon",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Hot_air_balloon",
            "page": "Hot_air_balloon"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "The mechanist"
      ],
      "text": "With their shared admiration of science and technology, Sokka immediately formed a friendship with the mechanist, the leader of a group of Earth Kingdom refugees who had established the Northern Air Temple as their new home. Working together, the two were able to complete the mechanist's experimental hot air balloon, which was later used to drive off the Fire Nation forces attempting to invade the temple."
    },
    {
      "body": "Sokka apparently kept in touch with the mechanist, providing him with the idea and designs for ${link_0} to be used as a form of transportation for the Fire Nation invasion. Sokka also told Zuko that \"a friend of his\" designed the war balloons.",
      "links": [
        {
          "body": "waterbending-powered submarines",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending-powered_submarine",
            "page": "Waterbending-powered_submarine"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "The mechanist"
      ],
      "text": "Sokka apparently kept in touch with the mechanist, providing him with the idea and designs for waterbending-powered submarines to be used as a form of transportation for the Fire Nation invasion. Sokka also told Zuko that \"a friend of his\" designed the war balloons."
    },
    {
      "body": "Because of Toph's young age and blindness, Sokka was at first skeptical of her ${link_0} prowess. Upon witnessing her skills, however, he was astonished to the point of fainting. Like Katara and Aang, Sokka gladly welcomed Toph when she joined their group. However, they were somewhat antagonistic toward each other at first over the matter of one another's abilities, with Sokka making light of Toph's inability to use her seismic sense to precisely figure out what was following them, and with Toph discounting Sokka's abilities simply because he could not bend an element when everyone was preparing to fight the approaching ${link_1}. Despite these small antagonisms, Sokka was the only member of the group to not deride Toph's apparently selfish attitude, even commenting at one point that Katara and Aang were \"pretty much jerks\" to her.",
      "links": [
        {
          "body": "earthbending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "tank",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tank_train",
            "page": "Tank_train"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Toph"
      ],
      "text": "Because of Toph's young age and blindness, Sokka was at first skeptical of her earthbending prowess. Upon witnessing her skills, however, he was astonished to the point of fainting. Like Katara and Aang, Sokka gladly welcomed Toph when she joined their group. However, they were somewhat antagonistic toward each other at first over the matter of one another's abilities, with Sokka making light of Toph's inability to use her seismic sense to precisely figure out what was following them, and with Toph discounting Sokka's abilities simply because he could not bend an element when everyone was preparing to fight the approaching tank. Despite these small antagonisms, Sokka was the only member of the group to not deride Toph's apparently selfish attitude, even commenting at one point that Katara and Aang were \"pretty much jerks\" to her."
    },
    {
      "body": "Sokka occasionally forgot that Toph was blind; in turn, she often used this to her advantage to annoy him by making jokes. For example, Toph commented that she liked Sokka's drawing, which brought on feelings of apparent joy until he remembered she could not actually see it.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Toph"
      ],
      "text": "Sokka occasionally forgot that Toph was blind; in turn, she often used this to her advantage to annoy him by making jokes. For example, Toph commented that she liked Sokka's drawing, which brought on feelings of apparent joy until he remembered she could not actually see it."
    },
    {
      "body": "After Toph saved Sokka's life while they traveled on the Serpent's Pass, he was intently focused on whether or not Suki was okay and forgot to thank Toph, which seemed to cause her a small amount of annoyance. Soon after, Suki saved Toph from drowning and Toph, thinking Suki to be Sokka, gave her a kiss on the cheek. Upon realizing her mistake, she became embarrassed, jokingly telling Suki that she could \"go ahead and let [her] drown.\"",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Toph"
      ],
      "text": "After Toph saved Sokka's life while they traveled on the Serpent's Pass, he was intently focused on whether or not Suki was okay and forgot to thank Toph, which seemed to cause her a small amount of annoyance. Soon after, Suki saved Toph from drowning and Toph, thinking Suki to be Sokka, gave her a kiss on the cheek. Upon realizing her mistake, she became embarrassed, jokingly telling Suki that she could \"go ahead and let [her] drown.\""
    },
    {
      "body": "While Sokka was away from the team developing his swordsmanship, Toph expressed as much dismay as the rest of the group to his absence. Later when he returned, while both Aang and Katara enthusiastically welcomed Sokka back and proclaimed how much they had missed him, Toph somberly stated that she did not really care, turning away to hide her blushing.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Toph"
      ],
      "text": "While Sokka was away from the team developing his swordsmanship, Toph expressed as much dismay as the rest of the group to his absence. Later when he returned, while both Aang and Katara enthusiastically welcomed Sokka back and proclaimed how much they had missed him, Toph somberly stated that she did not really care, turning away to hide her blushing."
    },
    {
      "body": "Toph was quite excited when Sokka gave her a piece of the meteorite with which he used to make his sword, which she promptly began bending into a spiral, a star, and a splatter (the old Nickelodeon logo) and subsequently transformed into a ${link_0} that she came to treasure.",
      "links": [
        {
          "body": "bracelet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Toph%27s_bracelet",
            "page": "Toph%27s_bracelet"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Toph"
      ],
      "text": "Toph was quite excited when Sokka gave her a piece of the meteorite with which he used to make his sword, which she promptly began bending into a spiral, a star, and a splatter (the old Nickelodeon logo) and subsequently transformed into a bracelet that she came to treasure."
    },
    {
      "body": "Sokka showed his strong bond of friendship with Toph numerous times, such as conspiring various scams together to obtain money for the invasion and having a heart to heart talk regarding Katara's motherly attitude. He even admitted to her that he saw Katara as his mother figure, something that he never told to anyone else.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Toph"
      ],
      "text": "Sokka showed his strong bond of friendship with Toph numerous times, such as conspiring various scams together to obtain money for the invasion and having a heart to heart talk regarding Katara's motherly attitude. He even admitted to her that he saw Katara as his mother figure, something that he never told to anyone else."
    },
    {
      "body": "Similar to his interactions with Aang, Sokka came to appreciate Toph's powers over the course of their journey together. During the invasion of the Fire Nation on the Day of Black Sun, Sokka and Toph teamed up with Aang to fight the Fire Lord. Sokka consistently complimented Toph on her astounding earthbending prowess. During their face off with Azula, Toph saved Sokka's life when she prevented Azula from either stabbing or burning Sokka, and Toph comforted him when the invasion failed. He often praised her for her ability to ${link_0}.",
      "links": [
        {
          "body": "bend metal",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Metalbending",
            "page": "Metalbending"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Toph"
      ],
      "text": "Similar to his interactions with Aang, Sokka came to appreciate Toph's powers over the course of their journey together. During the invasion of the Fire Nation on the Day of Black Sun, Sokka and Toph teamed up with Aang to fight the Fire Lord. Sokka consistently complimented Toph on her astounding earthbending prowess. During their face off with Azula, Toph saved Sokka's life when she prevented Azula from either stabbing or burning Sokka, and Toph comforted him when the invasion failed. He often praised her for her ability to bend metal."
    },
    {
      "body": "During the arrival of Sozin's Comet, Toph and Sokka teamed up with Suki to destroy the Fire Nation airship fleet. When the time came for them to exit from the airship, Sokka chose to grab Toph's hand rather than Suki's, which proved that Sokka did not forget Toph's blindness in such a critical time; he also protected her from the debris when their airship broke in two. Toph and Sokka pressed on with their attacks after they were separated from Suki, but eventually found themselves dangerously close to falling off the airships to their deaths. Sokka fought valiantly to defend himself and Toph from the firebenders, Toph hanging helplessly from his hand, but was rendered defenseless when he lost his weapons. He apologized to Toph for his failure and she cried as she accepted her fate. Thankfully, Suki saved their lives just in time. After Ozai's defeat, Sokka, Toph, and Suki humorously insulted the Fire Lord over his loss of power.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Toph"
      ],
      "text": "During the arrival of Sozin's Comet, Toph and Sokka teamed up with Suki to destroy the Fire Nation airship fleet. When the time came for them to exit from the airship, Sokka chose to grab Toph's hand rather than Suki's, which proved that Sokka did not forget Toph's blindness in such a critical time; he also protected her from the debris when their airship broke in two. Toph and Sokka pressed on with their attacks after they were separated from Suki, but eventually found themselves dangerously close to falling off the airships to their deaths. Sokka fought valiantly to defend himself and Toph from the firebenders, Toph hanging helplessly from his hand, but was rendered defenseless when he lost his weapons. He apologized to Toph for his failure and she cried as she accepted her fate. Thankfully, Suki saved their lives just in time. After Ozai's defeat, Sokka, Toph, and Suki humorously insulted the Fire Lord over his loss of power."
    },
    {
      "body": "While Toph's romantic interest in Sokka is best understood on the basis of him being her first crush, Sokka seemed oblivious of her emotions but was noted to show more sympathy and understanding to her than did Aang or Katara. Sokka seemed to warm to Toph as a person; he seemed to respect her as a person, while also feeling protective of her as his closest friend in the group. In spite of this, there was no indication that he thought of her romantically in any way.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Toph"
      ],
      "text": "While Toph's romantic interest in Sokka is best understood on the basis of him being her first crush, Sokka seemed oblivious of her emotions but was noted to show more sympathy and understanding to her than did Aang or Katara. Sokka seemed to warm to Toph as a person; he seemed to respect her as a person, while also feeling protective of her as his closest friend in the group. In spite of this, there was no indication that he thought of her romantically in any way."
    },
    {
      "body": "One year after the Hundred Year War's end, Sokka partnered up with Toph once again to help her prepare her students to defend her metalbending school against a rival class of firebenders.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Toph"
      ],
      "text": "One year after the Hundred Year War's end, Sokka partnered up with Toph once again to help her prepare her students to defend her metalbending school against a rival class of firebenders."
    },
    {
      "body": "Although natural enemies, ${link_0} took a liking to Sokka. After she and ${link_1} were defeated after combating Katara and Sokka, Ty Lee mentioned that Sokka was \"kinda cute\". Later, she addressed him and gave him a flirtatious look when they encountered one another within the ${link_2}, to which Sokka replied with a bashful \"hey\" and a small wave. They came face to face yet again where she called him a \"cutie\". As they battled in the Earth King's throne room, she flirted with him, remarking that \"It's like [they were] dancing together\". However, in this battle, Sokka expressed less interest with her than he did in their previous encounter, explaining that he was already involved with Suki.",
      "links": [
        {
          "body": "Ty Lee",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Mai",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Mai",
            "page": "Mai"
          }
        },
        {
          "body": "drill",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Ty Lee"
      ],
      "text": "Although natural enemies, Ty Lee took a liking to Sokka. After she and Mai were defeated after combating Katara and Sokka, Ty Lee mentioned that Sokka was \"kinda cute\". Later, she addressed him and gave him a flirtatious look when they encountered one another within the drill, to which Sokka replied with a bashful \"hey\" and a small wave. They came face to face yet again where she called him a \"cutie\". As they battled in the Earth King's throne room, she flirted with him, remarking that \"It's like [they were] dancing together\". However, in this battle, Sokka expressed less interest with her than he did in their previous encounter, explaining that he was already involved with Suki."
    },
    {
      "body": "Ty Lee and Sokka finally met again when Sokka attempted to escape the Boiling Rock Prison, but they never actually came face-to-face as Ty Lee was too busy fighting Suki. Ironically, Ty Lee did not even acknowledge her crush on Sokka as she did in her past appearances. She did, however, express notable concern upon seeing the gondola Sokka was riding was about to be disabled.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Ty Lee"
      ],
      "text": "Ty Lee and Sokka finally met again when Sokka attempted to escape the Boiling Rock Prison, but they never actually came face-to-face as Ty Lee was too busy fighting Suki. Ironically, Ty Lee did not even acknowledge her crush on Sokka as she did in her past appearances. She did, however, express notable concern upon seeing the gondola Sokka was riding was about to be disabled."
    },
    {
      "body": "Ty Lee was imprisoned later for betraying Azula out of defense for her friend Mai, who helped Sokka and Zuko escape the prison. However, she was released after the Hundred Year War ended with Ozai and Azula's defeat. Ty Lee met Sokka again dressed as a Kyoshi Warrior, which Sokka assumed was part of a sneak attack. However, Ty Lee announced that she had joined the warriors.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Ty Lee"
      ],
      "text": "Ty Lee was imprisoned later for betraying Azula out of defense for her friend Mai, who helped Sokka and Zuko escape the prison. However, she was released after the Hundred Year War ended with Ozai and Azula's defeat. Ty Lee met Sokka again dressed as a Kyoshi Warrior, which Sokka assumed was part of a sneak attack. However, Ty Lee announced that she had joined the warriors."
    },
    {
      "body": "Sokka and Zuko never had much social interaction with each other at first. Their first encounter was a brief face-off against each other during which Zuko attacked the Southern Water Tribe while Sokka zealously defended it. Zuko was the clear winner, despite Sokka's persistence. They met in other battles after that, mostly as foes, with one exception being when Zuko teamed up with Sokka and the rest of the group against Azula at a ${link_0}. Other than that, Sokka had constantly been opposed to assisting Zuko whenever Aang suggested it, clearly indicating how little Sokka trusted him. While speaking with his father, Sokka stated that while he was distrusting of Zuko at first, he had proven himself on multiple occasions and was very trustworthy.",
      "links": [
        {
          "body": "ghost town",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tu_Zin",
            "page": "Tu_Zin"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "Sokka and Zuko never had much social interaction with each other at first. Their first encounter was a brief face-off against each other during which Zuko attacked the Southern Water Tribe while Sokka zealously defended it. Zuko was the clear winner, despite Sokka's persistence. They met in other battles after that, mostly as foes, with one exception being when Zuko teamed up with Sokka and the rest of the group against Azula at a ghost town. Other than that, Sokka had constantly been opposed to assisting Zuko whenever Aang suggested it, clearly indicating how little Sokka trusted him. While speaking with his father, Sokka stated that while he was distrusting of Zuko at first, he had proven himself on multiple occasions and was very trustworthy."
    },
    {
      "body": "The two were properly introduced at the Western Air Temple. Sokka still did not trust Zuko after their history, and he even went so far as to theorize that Zuko had covered himself in honey to get Appa to lick him, a sign of affection from the bison. Despite his distrust of Zuko, Sokka did trust Aang and conceded to let Zuko join the group when Aang felt it was the best course of action. Sokka was seen showing Zuko to his room. He was nervous and uncomfortable, but Zuko smiled at him, implying he had no hostility toward Sokka. Sokka remarked that escorting his former enemy was \"really weird\". Unlike his sister, it seemed that he held few hostilities against Zuko at the time. However, Sokka jokingly commented on Zuko and Aang's \"jerkbending\", annoying Zuko.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "The two were properly introduced at the Western Air Temple. Sokka still did not trust Zuko after their history, and he even went so far as to theorize that Zuko had covered himself in honey to get Appa to lick him, a sign of affection from the bison. Despite his distrust of Zuko, Sokka did trust Aang and conceded to let Zuko join the group when Aang felt it was the best course of action. Sokka was seen showing Zuko to his room. He was nervous and uncomfortable, but Zuko smiled at him, implying he had no hostility toward Sokka. Sokka remarked that escorting his former enemy was \"really weird\". Unlike his sister, it seemed that he held few hostilities against Zuko at the time. However, Sokka jokingly commented on Zuko and Aang's \"jerkbending\", annoying Zuko."
    },
    {
      "body": "Sokka's opinion toward Zuko changed for the better, as he asked him for information on where the invasion troops might be imprisoned. Zuko revealed their most likely location and assisted him in breaking into the Boiling Rock. There, he helped Sokka break out Suki and Hakoda. During the journey, Sokka stated that he believed Iroh was proud of Zuko and commended him for making the decision to leave everything behind to help Aang. The two also had a sympathetic conversation about their past girlfriends on the journey.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "Sokka's opinion toward Zuko changed for the better, as he asked him for information on where the invasion troops might be imprisoned. Zuko revealed their most likely location and assisted him in breaking into the Boiling Rock. There, he helped Sokka break out Suki and Hakoda. During the journey, Sokka stated that he believed Iroh was proud of Zuko and commended him for making the decision to leave everything behind to help Aang. The two also had a sympathetic conversation about their past girlfriends on the journey."
    },
    {
      "body": "While at the Boiling Rock, despite occasional arguments over each other's methodology, Sokka and Zuko quickly grew accustomed to each other's personality and combat style and formed a strong partnership. Zuko was the superior fighter of the two, but his hot-headedness and lack of foresight got him in trouble, such as when he attacked a suspicious guard while Sokka was visiting Suki and got himself imprisoned. Sokka, on the other hand, was an excellent and resourceful strategist who kept a clear head under duress and Zuko quickly deferred to Sokka's leadership. During their time at the Boiling Rock, Sokka most often created the plans and Zuko executed them, such as when Zuko started a fight with ${link_0} and disabled the cooler. Later, the two teamed up against Azula; Zuko defended Sokka and deflected Azula's fire blasts while Sokka struck at her with his sword.",
      "links": [
        {
          "body": "Chit Sang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Chit_Sang",
            "page": "Chit_Sang"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "While at the Boiling Rock, despite occasional arguments over each other's methodology, Sokka and Zuko quickly grew accustomed to each other's personality and combat style and formed a strong partnership. Zuko was the superior fighter of the two, but his hot-headedness and lack of foresight got him in trouble, such as when he attacked a suspicious guard while Sokka was visiting Suki and got himself imprisoned. Sokka, on the other hand, was an excellent and resourceful strategist who kept a clear head under duress and Zuko quickly deferred to Sokka's leadership. During their time at the Boiling Rock, Sokka most often created the plans and Zuko executed them, such as when Zuko started a fight with Chit Sang and disabled the cooler. Later, the two teamed up against Azula; Zuko defended Sokka and deflected Azula's fire blasts while Sokka struck at her with his sword."
    },
    {
      "body": "After the events at the Boiling Rock, their relationship was in much better shape than it had ever been, with Sokka even toasting Zuko as the group's hero for helping hold off the Fire Nation airships and Azula, which were attacking the Western Air Temple. Zuko also asked Sokka about his mother's death. Despite Sokka's obvious discomfort with the subject, he trusted Zuko enough to tell him the story.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "After the events at the Boiling Rock, their relationship was in much better shape than it had ever been, with Sokka even toasting Zuko as the group's hero for helping hold off the Fire Nation airships and Azula, which were attacking the Western Air Temple. Zuko also asked Sokka about his mother's death. Despite Sokka's obvious discomfort with the subject, he trusted Zuko enough to tell him the story."
    },
    {
      "body": "Sokka remained Zuko's friend and ally many years after the War and helped him, along with ${link_0} and ${link_1}, defeat and imprison ${link_2}, ${link_3}, ${link_4}, and ${link_5}.",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Ghazan",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ghazan",
            "page": "Ghazan"
          }
        },
        {
          "body": "Ming-Hua",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Ming-Hua",
            "page": "Ming-Hua"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/P%27Li",
            "page": "P%27Li"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "Sokka remained Zuko's friend and ally many years after the War and helped him, along with Tenzin and Tonraq, defeat and imprison Zaheer, Ghazan, Ming-Hua, and P'Li."
    },
    {
      "body": "Zuko and Sokka shared some similarities: both had also lost their mothers and both were skilled at using some form of bladed weaponry. They were also two of the closest in age of the main group besides Aang and Toph.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "Zuko and Sokka shared some similarities: both had also lost their mothers and both were skilled at using some form of bladed weaponry. They were also two of the closest in age of the main group besides Aang and Toph."
    },
    {
      "body": "Sokka first encountered ${link_0} when they were sleeping near a ${link_1}. Toph, Katara and even Aang's inability to defeat the Combustion Man left Sokka in fear. Sokka later met Combustion Man in a ${link_2}. He nicknamed the Fire Nation assassin \"Sparky Sparky Boom Man\", but later reasoned that the name did not quite fit and decided to formally call the assassin \"${link_3}\". Sokka singlehandedly defeated the assassin by striking Combustion Man in the third eye with his boomerang and blocking the assassin's ${link_4}. Combustion Man tried to ${link_5} once more at the Western Air Temple, which backfired and caused a large explosion, killing the assassin.",
      "links": [
        {
          "body": "Combustion Man",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Combustion_Man",
            "page": "Combustion_Man"
          }
        },
        {
          "body": "hot spring",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Secluded_hot_springs",
            "page": "Secluded_hot_springs"
          }
        },
        {
          "body": "Fire Fountain City",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Fountain_City",
            "page": "Fire_Fountain_City"
          }
        },
        {
          "body": "Combustion Man",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Combustion_Man",
            "page": "Combustion_Man"
          }
        },
        {
          "body": "Chi",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Chi",
            "page": "Chi"
          }
        },
        {
          "body": "attack",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Combustion_Man#Powers_and_abilities",
            "page": "Combustion_Man"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Enemies",
        "Combustion Man"
      ],
      "text": "Sokka first encountered Combustion Man when they were sleeping near a hot spring. Toph, Katara and even Aang's inability to defeat the Combustion Man left Sokka in fear. Sokka later met Combustion Man in a Fire Fountain City. He nicknamed the Fire Nation assassin \"Sparky Sparky Boom Man\", but later reasoned that the name did not quite fit and decided to formally call the assassin \"Combustion Man\". Sokka singlehandedly defeated the assassin by striking Combustion Man in the third eye with his boomerang and blocking the assassin's Chi. Combustion Man tried to attack once more at the Western Air Temple, which backfired and caused a large explosion, killing the assassin."
    },
    {
      "body": "Twenty-eight years later, during ${link_0}, Sokka mentioned Combustion Man to support his verdict against ${link_1}, also mentioning how he easily bested the assassin with his \"trusty boomerang\".",
      "links": [
        {
          "body": "Yakone's trial",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Yakone%27s_trial",
            "page": "Yakone%27s_trial"
          }
        },
        {
          "body": "Yakone",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Yakone",
            "page": "Yakone"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Enemies",
        "Combustion Man"
      ],
      "text": "Twenty-eight years later, during Yakone's trial, Sokka mentioned Combustion Man to support his verdict against Yakone, also mentioning how he easily bested the assassin with his \"trusty boomerang\"."
    },
    {
      "body": "Sokka was the one who vowed to take down Ozai's Airship Fleet to stop the air force from burning down the Earth Kingdom. Sokka, along with Toph and Suki, infiltrated and stowed aboard one airship by means of using it as a decoy to demolish the rest of the airships in mid-air. The three friends observed the early stages of the battle between Aang and Ozai from their distant airship. When Suki asked whether they should be helping, Sokka decreed that Ozai was Aang's fight alone and that halting the airship fleet was their responsibility.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Enemies",
        "Fire Lord Ozai"
      ],
      "text": "Sokka was the one who vowed to take down Ozai's Airship Fleet to stop the air force from burning down the Earth Kingdom. Sokka, along with Toph and Suki, infiltrated and stowed aboard one airship by means of using it as a decoy to demolish the rest of the airships in mid-air. The three friends observed the early stages of the battle between Aang and Ozai from their distant airship. When Suki asked whether they should be helping, Sokka decreed that Ozai was Aang's fight alone and that halting the airship fleet was their responsibility."
    },
    {
      "body": "In the aftermath of the battle, Sokka briefly met Ozai directly after Aang defeated him. Sokka consistently imitated Aang's and Ozai's stances during the past duel, praising Aang and taunting Ozai as he did. After learning that the former tyrant had lost his bending, Sokka immediately seized his chance to mock Ozai, who stood up in futile anger and called himself \"the ${link_0}\", but merely fell back to the ground exhausted and semi-conscious.",
      "links": [
        {
          "body": "Phoenix King",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Phoenix_King",
            "page": "Phoenix_King"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Enemies",
        "Fire Lord Ozai"
      ],
      "text": "In the aftermath of the battle, Sokka briefly met Ozai directly after Aang defeated him. Sokka consistently imitated Aang's and Ozai's stances during the past duel, praising Aang and taunting Ozai as he did. After learning that the former tyrant had lost his bending, Sokka immediately seized his chance to mock Ozai, who stood up in futile anger and called himself \"the Phoenix King\", but merely fell back to the ground exhausted and semi-conscious."
    },
    {
      "body": "Though Sokka never had official confrontations with him, ${link_0} was still an enemy. They first met each other in a library where Long Feng told the team that the Hundred Year War must not be mentioned inside the walls of Ba Sing Se; Sokka was upset at this.",
      "links": [
        {
          "body": "Long Feng",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Long_Feng",
            "page": "Long_Feng"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Enemies",
        "Long Feng"
      ],
      "text": "Though Sokka never had official confrontations with him, Long Feng was still an enemy. They first met each other in a library where Long Feng told the team that the Hundred Year War must not be mentioned inside the walls of Ba Sing Se; Sokka was upset at this."
    },
    {
      "body": "The two briefly encountered each other again in the ${link_0}'s secret underground headquarters where Team Avatar and select members of the Freedom Fighters, including Jet, battled Long Feng and his agents. They later had a transitory confrontation on the shores of ${link_1}.",
      "links": [
        {
          "body": "Dai Li",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Lake Laogai",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Lake_Laogai",
            "page": "Lake_Laogai"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Enemies",
        "Long Feng"
      ],
      "text": "The two briefly encountered each other again in the Dai Li's secret underground headquarters where Team Avatar and select members of the Freedom Fighters, including Jet, battled Long Feng and his agents. They later had a transitory confrontation on the shores of Lake Laogai."
    },
    {
      "body": "Sokka and the rest of Team Avatar did their best to deliver information about the future solar eclipse to the ${link_0}, ${link_1}. At first, Earth King Kuei did not believe them, as he was unaware of the War. Additionally, Long Feng was present, telling Kuei lies, like \"[he has] never even seen a sky bison\", which proved to be false. Team Avatar journeyed to Lake Laogai to show the king the secret headquarters beneath the lake only to discover it had been destroyed. They proceeded to show him the Fire Nation drill with Long Feng lying, saying it was merely \"a construction project\". He was proven wrong, however, and therefore arrested. Neither Sokka, nor the rest of Team Avatar, saw Long Feng again.",
      "links": [
        {
          "body": "Earth King",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Kuei",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kuei",
            "page": "Kuei"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Enemies",
        "Long Feng"
      ],
      "text": "Sokka and the rest of Team Avatar did their best to deliver information about the future solar eclipse to the Earth King, Kuei. At first, Earth King Kuei did not believe them, as he was unaware of the War. Additionally, Long Feng was present, telling Kuei lies, like \"[he has] never even seen a sky bison\", which proved to be false. Team Avatar journeyed to Lake Laogai to show the king the secret headquarters beneath the lake only to discover it had been destroyed. They proceeded to show him the Fire Nation drill with Long Feng lying, saying it was merely \"a construction project\". He was proven wrong, however, and therefore arrested. Neither Sokka, nor the rest of Team Avatar, saw Long Feng again."
    },
    {
      "body": "Sokka's relationship with Azula was restricted mainly to antagonism. Sokka first encountered Azula while aiding his friends in the conflict at Tu Zin. His first real one-on-one confrontation with her was during the events of the Day of Black Sun. Sokka, who had warned Toph and Aang not to be distracted from their mission by Azula's clever tactics, was caught off guard when the Fire Princess mentioned that her favorite prisoner used to mention him all the time, but gave up hope when he never came to rescue her. Sokka immediately and rightly determined that Azula was talking about Suki and charged at the princess, too enraged to remember his mission or notice the blade in Azula's hand. Toph noticed this and pinned Azula's hand to the wall; even so, Sokka continued toward the now trapped princess and fiercely demanded to know where Suki was. Azula seemed unconcerned with this and eventually succeeded in wasting the remainder of the team's time to find the Fire Lord during the eclipse.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Enemies",
        "Princess Azula"
      ],
      "text": "Sokka's relationship with Azula was restricted mainly to antagonism. Sokka first encountered Azula while aiding his friends in the conflict at Tu Zin. His first real one-on-one confrontation with her was during the events of the Day of Black Sun. Sokka, who had warned Toph and Aang not to be distracted from their mission by Azula's clever tactics, was caught off guard when the Fire Princess mentioned that her favorite prisoner used to mention him all the time, but gave up hope when he never came to rescue her. Sokka immediately and rightly determined that Azula was talking about Suki and charged at the princess, too enraged to remember his mission or notice the blade in Azula's hand. Toph noticed this and pinned Azula's hand to the wall; even so, Sokka continued toward the now trapped princess and fiercely demanded to know where Suki was. Azula seemed unconcerned with this and eventually succeeded in wasting the remainder of the team's time to find the Fire Lord during the eclipse."
    },
    {
      "body": "Sokka and Azula met face-to-face again when she tried to stop him and Zuko from fleeing the Boiling Rock Prison. Sokka and Zuko teamed up to ward her off with Sokka nearly sending her falling to her death by almost landing a hit on her face. Sokka eventually escaped, this time with Chit Sang, Zuko, his father and Azula's former prisoner, Suki.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Enemies",
        "Princess Azula"
      ],
      "text": "Sokka and Azula met face-to-face again when she tried to stop him and Zuko from fleeing the Boiling Rock Prison. Sokka and Zuko teamed up to ward her off with Sokka nearly sending her falling to her death by almost landing a hit on her face. Sokka eventually escaped, this time with Chit Sang, Zuko, his father and Azula's former prisoner, Suki."
    },
    {
      "body": "The two encountered each other once more following Azula's assault on the Western Air Temple. The Fire Nation princess' prime focus, however, lay in eliminating Zuko, thus she did not have time to confront Sokka directly.",
      "links": [],
      "section": [
        "Sokka's relationships",
        "Enemies",
        "Princess Azula"
      ],
      "text": "The two encountered each other once more following Azula's assault on the Western Air Temple. The Fire Nation princess' prime focus, however, lay in eliminating Zuko, thus she did not have time to confront Sokka directly."
    },
    {
      "body": "The two met again after the ${link_0} and the ${link_1}, when Zuko had sought out Azula's help in his quest to find their mother. In exchange for information, Azula was to travel with them, unbound and with dignity. She was brash and condescending toward Team Avatar, making their distrust in her more apparent, and thus Sokka volunteered to take first watch on the Fire Nation princess after she insulted him directly. However, when he approached her, his boomerang at the ready, she casually zapped the weapon with lighting, knocking him over.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Crisis at Yu Dao",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Harmony_Restoration_Movement",
            "page": "Harmony_Restoration_Movement"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Enemies",
        "Princess Azula"
      ],
      "text": "The two met again after the Hundred Year War and the Crisis at Yu Dao, when Zuko had sought out Azula's help in his quest to find their mother. In exchange for information, Azula was to travel with them, unbound and with dignity. She was brash and condescending toward Team Avatar, making their distrust in her more apparent, and thus Sokka volunteered to take first watch on the Fire Nation princess after she insulted him directly. However, when he approached her, his boomerang at the ready, she casually zapped the weapon with lighting, knocking him over."
    },
    {
      "body": "In 128 AG, Yakone was brought in front of the ${link_0} in response to charges of being a ${link_1}. Sokka and the rest of the council found him guilty, seeing as there were so many witnesses to his crimes. As soon as he was sentenced, Yakone bloodbent everyone in the room, and brought Toph forward and unlocked himself. He subsequently knocked everyone in the room out, including Sokka.",
      "links": [
        {
          "body": "United Republic Council",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "bloodbender",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bloodbending",
            "page": "Bloodbending"
          }
        }
      ],
      "section": [
        "Sokka's relationships",
        "Enemies",
        "Yakone"
      ],
      "text": "In 128 AG, Yakone was brought in front of the United Republic Council in response to charges of being a bloodbender. Sokka and the rest of the council found him guilty, seeing as there were so many witnesses to his crimes. As soon as he was sentenced, Yakone bloodbent everyone in the room, and brought Toph forward and unlocked himself. He subsequently knocked everyone in the room out, including Sokka."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Sokka%27s_relationships",
    "file": "avatar.wikia.com/wiki/Sokka's_relationships.html",
    "page": "Sokka's_relationships",
    "title": "Sokka's relationships"
  }
}