{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Equipment",
      "target": {
        "external": false,
        "href": "/wiki/Category_Equipment",
        "page": "Category_Equipment"
      }
    },
    {
      "body": "Objects",
      "target": {
        "external": false,
        "href": "/wiki/Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Sokka",
      "target": {
        "external": false,
        "href": "/wiki/Category_Sokka",
        "page": "Category_Sokka"
      }
    },
    {
      "body": "Weapons",
      "target": {
        "external": false,
        "href": "/wiki/Category_Weapons",
        "page": "Category_Weapons"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Sokka's sword was a ${link_0} crafted by the young ${link_1} warrior during his ${link_2} with ${link_3}. It was forged using ore from a recently fallen ${link_4}, and Sokka later referred to it as his \"space sword\" due to the origin of its material. The weapon is able to cut through various metals with little to moderate effort and has a distinctive dark hue that can be attributed to the material from which it was forged. Sokka bonded with it in a similar fashion as had taken place with his ${link_5}.",
      "links": [
        {
          "body": "weapon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Weaponry_in_the_World_of_Avatar",
            "page": "Weaponry_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "swordsmanship training",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Swordsmanship_training",
            "page": "Swordsmanship_training"
          }
        },
        {
          "body": "Piandao",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Piandao",
            "page": "Piandao"
          }
        },
        {
          "body": "meteorite",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Meteor",
            "page": "Meteor"
          }
        },
        {
          "body": "boomerang",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka%27s_weapons#Boomerang",
            "page": "Sokka%27s_weapons"
          }
        }
      ],
      "section": [
        "Sokka's sword"
      ],
      "text": "Sokka's sword was a weapon crafted by the young Water Tribe warrior during his swordsmanship training with Piandao. It was forged using ore from a recently fallen meteorite, and Sokka later referred to it as his \"space sword\" due to the origin of its material. The weapon is able to cut through various metals with little to moderate effort and has a distinctive dark hue that can be attributed to the material from which it was forged. Sokka bonded with it in a similar fashion as had taken place with his boomerang."
    },
    {
      "body": "At the start of his training under Piandao, Sokka hardly knew the proper way to hold a sword. However, he had a great natural talent and progressed quickly, being able to beat the butler, ${link_0}, after a single day. Three days into his apprenticeship, Sokka and Piandao began working on making his sword. Sokka decided to make it out of a meteorite he and his friends had encountered earlier, and spent days forging the sword. After receiving this, he blew his ${link_1} cover deliberately, prompting Piandao to instigate a ${link_2} to the death, albeit fake, as a final test to make sure that Sokka had learned the necessary skills. During this fight, Sokka showed how much he had learned about the way of the sword in just a few days, showing great resourcefulness and the ability to recognize and exploit every advantage. Piandao eventually beat him, but was greatly impressed by his progress and said that Sokka had the potential to one day be an even greater master than him.",
      "links": [
        {
          "body": "Fat",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fat",
            "page": "Fat"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "duel",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Duels_(Summer_100_AG)#Duel_between_Piandao_and_Sokka",
            "page": "Duels_(Summer_100_AG)"
          }
        }
      ],
      "section": [
        "Sokka's sword",
        "History"
      ],
      "text": "At the start of his training under Piandao, Sokka hardly knew the proper way to hold a sword. However, he had a great natural talent and progressed quickly, being able to beat the butler, Fat, after a single day. Three days into his apprenticeship, Sokka and Piandao began working on making his sword. Sokka decided to make it out of a meteorite he and his friends had encountered earlier, and spent days forging the sword. After receiving this, he blew his Fire Nation cover deliberately, prompting Piandao to instigate a duel to the death, albeit fake, as a final test to make sure that Sokka had learned the necessary skills. During this fight, Sokka showed how much he had learned about the way of the sword in just a few days, showing great resourcefulness and the ability to recognize and exploit every advantage. Piandao eventually beat him, but was greatly impressed by his progress and said that Sokka had the potential to one day be an even greater master than him."
    },
    {
      "body": "Sokka left Piandao's tutelage to help ${link_0} on his quest to save ${link_1} from ${link_2} and started putting his new skills to use shortly thereafter. Sokka had no qualms about using his sword in untraditional ways, such as to haul supplies on the end of it, or poke people with the scabbard. However, he prized the sword very much, second probably only to his boomerang, his oldest weapon, given to him by his father ${link_3}. He grew fearful when ${link_4} used it as collateral in one of her scams without his permission. The warrior later used the sword in combat during the ${link_5}, as well as in a friendly \"swordbending\" duel against ${link_6} ${link_7}, which he lost.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "the world",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Hakoda",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Toph",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        },
        {
          "body": "Prince",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        }
      ],
      "section": [
        "Sokka's sword",
        "History"
      ],
      "text": "Sokka left Piandao's tutelage to help Aang on his quest to save the world from Ozai and started putting his new skills to use shortly thereafter. Sokka had no qualms about using his sword in untraditional ways, such as to haul supplies on the end of it, or poke people with the scabbard. However, he prized the sword very much, second probably only to his boomerang, his oldest weapon, given to him by his father Hakoda. He grew fearful when Toph used it as collateral in one of her scams without his permission. The warrior later used the sword in combat during the invasion of the Fire Nation, as well as in a friendly \"swordbending\" duel against Prince Zuko, which he lost."
    },
    {
      "body": "When ${link_0} arrived, Sokka, along with Toph and ${link_1}, went to stop the ${link_2} fleet from burning the ${link_3} to the ground. After commandeering and crashing one of the airships into the rest of the fleet, Sokka and Toph were thrown off during their attempted escape, but the former managed to halt their fall by burying his sword into the airship's outer hull as a grapple hook. Stranded and about to be attacked by ${link_4}, Sokka sacrificed both his boomerang and his sword, throwing them at the planks supporting their opponents. This prevented their deaths just long enough for Suki to rescue them with the last airship, but neither the sword nor the boomerang came back, plummeting to the ground of the ${link_5}.",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Suki",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Fire Nation airship",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "firebenders",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Wulong Forest",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Wulong_Forest",
            "page": "Wulong_Forest"
          }
        }
      ],
      "section": [
        "Sokka's sword",
        "History"
      ],
      "text": "When Sozin's Comet arrived, Sokka, along with Toph and Suki, went to stop the Fire Nation airship fleet from burning the Earth Kingdom to the ground. After commandeering and crashing one of the airships into the rest of the fleet, Sokka and Toph were thrown off during their attempted escape, but the former managed to halt their fall by burying his sword into the airship's outer hull as a grapple hook. Stranded and about to be attacked by firebenders, Sokka sacrificed both his boomerang and his sword, throwing them at the planks supporting their opponents. This prevented their deaths just long enough for Suki to rescue them with the last airship, but neither the sword nor the boomerang came back, plummeting to the ground of the Wulong Forest."
    },
    {
      "body": "Sokka's sword is a jian, or straight sword. The blades of such swords are approximately seventy centimeters long and four centimeters wide, with the grip measuring about twenty centimeters long. The black blade of the weapon originated with the sword's composition of meteoric iron, while the sheath is simple, dark brown and straight, adorned with a gold-plate inlay about midway down its length. The sheath's tip is rectangular and adorned with a stylized ${link_0} symbol made of gold filigree, while another is etched into the end of the grip; these marks identify the sword as the work of a member of the ${link_1}.",
      "links": [
        {
          "body": "white lotus",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/White_lotus",
            "page": "White_lotus"
          }
        },
        {
          "body": "Order of the White Lotus",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        }
      ],
      "section": [
        "Sokka's sword",
        "Design"
      ],
      "text": "Sokka's sword is a jian, or straight sword. The blades of such swords are approximately seventy centimeters long and four centimeters wide, with the grip measuring about twenty centimeters long. The black blade of the weapon originated with the sword's composition of meteoric iron, while the sheath is simple, dark brown and straight, adorned with a gold-plate inlay about midway down its length. The sheath's tip is rectangular and adorned with a stylized white lotus symbol made of gold filigree, while another is etched into the end of the grip; these marks identify the sword as the work of a member of the Order of the White Lotus."
    },
    {
      "body": "Since the sword was made specifically for Sokka, who also took part in its construction, the sword is \"attuned\" to him, suggesting a affinity between the two rather than any kind of mystical connection. Finally, the unusual material, according to Piandao, gives the sword unique properties, namely its exceptional durability and keenness; it is able to cut through thick layers of steel and other materials.",
      "links": [],
      "section": [
        "Sokka's sword",
        "Design"
      ],
      "text": "Since the sword was made specifically for Sokka, who also took part in its construction, the sword is \"attuned\" to him, suggesting a affinity between the two rather than any kind of mystical connection. Finally, the unusual material, according to Piandao, gives the sword unique properties, namely its exceptional durability and keenness; it is able to cut through thick layers of steel and other materials."
    },
    {
      "body": "Swords and other tools forged from meteorite iron have a long history, both in the real world and in fiction. It is believed that meteorite iron was the first iron ore used by humans, before the development of mining to retrieve terrestrial iron. King Tutankhamun was entombed with a meteorite-iron dagger on his breast, and fragments from the Cape York meteorite were used by the Greenland Inuit people to fashion knife blades and harpoon heads. In more contemporary times, Japanese master swordsmith Yoshindo Yoshiwara made a katana called tentetsutou or \"Sword of Heaven\", the blade of which was forged from a fragment of the massive Gibeon iron meteorite that landed in Namibia in prehistoric times.",
      "links": [],
      "section": [
        "Sokka's sword",
        "Real life connections"
      ],
      "text": "Swords and other tools forged from meteorite iron have a long history, both in the real world and in fiction. It is believed that meteorite iron was the first iron ore used by humans, before the development of mining to retrieve terrestrial iron. King Tutankhamun was entombed with a meteorite-iron dagger on his breast, and fragments from the Cape York meteorite were used by the Greenland Inuit people to fashion knife blades and harpoon heads. In more contemporary times, Japanese master swordsmith Yoshindo Yoshiwara made a katana called tentetsutou or \"Sword of Heaven\", the blade of which was forged from a fragment of the massive Gibeon iron meteorite that landed in Namibia in prehistoric times."
    },
    {
      "body": "Sokka's sword and sheath, as well as Piandao's sword and sheath, are designed based upon real swords owned by Sifu ${link_0}. Kisu is the martial arts consultant for the show's creators and was also the character reference for Piandao.",
      "links": [
        {
          "body": "Kisu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kisu",
            "page": "Kisu"
          }
        }
      ],
      "section": [
        "Sokka's sword",
        "Trivia"
      ],
      "text": "Sokka's sword and sheath, as well as Piandao's sword and sheath, are designed based upon real swords owned by Sifu Kisu. Kisu is the martial arts consultant for the show's creators and was also the character reference for Piandao."
    },
    {
      "body": "Sokka's sword is made of the same material as ${link_0}.",
      "links": [
        {
          "body": "Toph's bracelet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Toph%27s_bracelet",
            "page": "Toph%27s_bracelet"
          }
        }
      ],
      "section": [
        "Sokka's sword",
        "Trivia"
      ],
      "text": "Sokka's sword is made of the same material as Toph's bracelet."
    },
    {
      "body": "Sokka's sword was seen cutting through over a foot of solid steel.",
      "links": [],
      "section": [
        "Sokka's sword",
        "Trivia"
      ],
      "text": "Sokka's sword was seen cutting through over a foot of solid steel."
    },
    {
      "body": "The concept of a sword being made out of a meteorite was derived from the ancient Mongolian legend of ${link_0}.",
      "links": [
        {
          "body": "Timur",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Timur",
            "page": "http://en.wikipedia.org/wiki/Timur"
          }
        }
      ],
      "section": [
        "Sokka's sword",
        "Trivia"
      ],
      "text": "The concept of a sword being made out of a meteorite was derived from the ancient Mongolian legend of Timur."
    },
    {
      "body": "A real life replica of Sokka's sword, made from real meteorite, was created by Tony Swatton of Man At Arms on the AWE Me YouTube channel.",
      "links": [],
      "section": [
        "Sokka's sword",
        "Trivia"
      ],
      "text": "A real life replica of Sokka's sword, made from real meteorite, was created by Tony Swatton of Man At Arms on the AWE Me YouTube channel."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Sokka's weapons",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka%27s_weapons",
            "page": "Sokka%27s_weapons"
          }
        }
      ],
      "section": [
        "Sokka's sword",
        "See also"
      ],
      "text": "Sokka's weapons"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Weaponry in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Weaponry_in_the_World_of_Avatar",
            "page": "Weaponry_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Sokka's sword",
        "See also"
      ],
      "text": "Weaponry in the World of Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Forging a real-life version of Sokka's sword",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://www.youtube.com/watch?v=DITY1WzbLj8",
            "page": "http://www.youtube.com/watch?v=DITY1WzbLj8"
          }
        }
      ],
      "section": [
        "Sokka's sword",
        "External links"
      ],
      "text": "Forging a real-life version of Sokka's sword"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Sokka%27s_sword",
    "file": "avatar.wikia.com/wiki/Sokka's_sword.html",
    "page": "Sokka's_sword",
    "title": "Sokka's sword"
  }
}