{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Featured articles",
      "target": {
        "href": "Category_Featured_articles",
        "page": "Category_Featured_articles"
      }
    },
    {
      "body": "A-class articles",
      "target": {
        "href": "Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Settlements",
      "target": {
        "href": "Category_Settlements",
        "page": "Category_Settlements"
      }
    },
    {
      "body": "Water Tribes",
      "target": {
        "href": "Category_Water_Tribes",
        "page": "Category_Water_Tribes"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "South Pole",
              "key": "${link_0}",
              "target": {
                "href": "South_Pole",
                "page": "South_Pole"
              }
            }
          ],
          "text": "South Pole",
          "value": "${link_0}",
          "value_text": "South Pole"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "Largely inhabited",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Largely inhabited",
          "value": "Largely inhabited",
          "value_text": "Largely inhabited"
        }
      ]
    },
    {
      "key": "Capital",
      "value": [
        {
          "body": "Harbor city",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Harbor city",
          "value": "Harbor city",
          "value_text": "Harbor city"
        }
      ]
    },
    {
      "key": "Form of government",
      "value": [
        {
          "body": "Federal parliamentary elected chiefdom",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Federal parliamentary elected chiefdom",
          "value": "Federal parliamentary elected chiefdom",
          "value_text": "Federal parliamentary elected chiefdom"
        }
      ]
    },
    {
      "key": "Head of State",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Tribal chief",
              "key": "${link_0}",
              "target": {
                "href": "Tribal_chief",
                "page": "Tribal_chief"
              }
            }
          ],
          "text": "Tribal chief",
          "value": "${link_0}",
          "value_text": "Tribal chief"
        }
      ]
    },
    {
      "key": "Currency",
      "value": [
        {
          "body": "${link_0}, ${link_1}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Water Tribe money",
              "key": "${link_0}",
              "target": {
                "href": "Currency#Water_Tribe",
                "page": "Currency"
              }
            },
            {
              "body": "yuan",
              "key": "${link_1}",
              "target": {
                "href": "Currency#United_Republic_of_Nations",
                "page": "Currency"
              }
            }
          ],
          "text": "Water Tribe money, yuan",
          "value": "${link_0}, ${link_1}",
          "value_text": "Water Tribe money, yuan"
        }
      ]
    },
    {
      "key": "Leader",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Tonraq",
              "key": "${link_0}",
              "target": {
                "href": "Tonraq",
                "page": "Tonraq"
              }
            }
          ],
          "text": "Tonraq",
          "value": "${link_0}",
          "value_text": "Tonraq"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "The Boy in the Iceberg",
              "key": "${link_0}",
              "target": {
                "href": "The_Boy_in_the_Iceberg",
                "page": "The_Boy_in_the_Iceberg"
              }
            }
          ],
          "text": "\"The Boy in the Iceberg\"",
          "value": "\"${link_0}\"",
          "value_text": "\"The Boy in the Iceberg\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The Southern Water Tribe is an independent state at the ${link_0} and the southern division of the ${link_1}. A federation of several smaller tribes, the South is ruled by a Council of Elders, who also elect the tribe's chief. The Southern Water Tribe achieved its independence only after the ${link_2} in 171 ${link_3}; before, the tribe had been an autonomous tribal confederation under the ${link_4}'s jurisdiction. The South is a major economical power, with its people mostly living in its coastal capital and several villages nearby. The people of the Southern Water Tribe are modern, progressive, and focused on commerce and trade, but lack in spirituality.",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Water Tribes",
          "key": "${link_1}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Water Tribe Civil War",
          "key": "${link_2}",
          "target": {
            "href": "Water_Tribe_Civil_War",
            "page": "Water_Tribe_Civil_War"
          }
        },
        {
          "body": "AG",
          "key": "${link_3}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_4}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "text": "The Southern Water Tribe is an independent state at the South Pole and the southern division of the Water Tribes. A federation of several smaller tribes, the South is ruled by a Council of Elders, who also elect the tribe's chief. The Southern Water Tribe achieved its independence only after the Water Tribe Civil War in 171 AG; before, the tribe had been an autonomous tribal confederation under the Northern Water Tribe's jurisdiction. The South is a major economical power, with its people mostly living in its coastal capital and several villages nearby. The people of the Southern Water Tribe are modern, progressive, and focused on commerce and trade, but lack in spirituality."
    },
    {
      "body": "The Southern Water Tribe had an eventful history and saw times of prosperity and freedom as well as decline and genocide. Before the ${link_0}, the South was thriving and had a unique culture and ${link_1} style. After a series of brutal ${link_2} ${link_3}, however, the South Pole was left devastated and almost without any waterbenders. By 99 AG, the Southern Water Tribe was on the brink of extinction, with its culture shattered, its main city largely abandoned, and its unique waterbending style effectively erased. This changed when ${link_4} and ${link_5} discovered ${link_6} ${link_7} in 99 AG and began to travel together with him in order to end the war and save the world.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "raids",
          "key": "${link_3}",
          "target": {
            "href": "Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        },
        {
          "body": "Katara",
          "key": "${link_4}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_5}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_6}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_7}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "The Southern Water Tribe had an eventful history and saw times of prosperity and freedom as well as decline and genocide. Before the Hundred Year War, the South was thriving and had a unique culture and waterbending style. After a series of brutal Fire Nation raids, however, the South Pole was left devastated and almost without any waterbenders. By 99 AG, the Southern Water Tribe was on the brink of extinction, with its culture shattered, its main city largely abandoned, and its unique waterbending style effectively erased. This changed when Katara and Sokka discovered Avatar Aang in 99 AG and began to travel together with him in order to end the war and save the world."
    },
    {
      "body": "After ${link_0}'s involvement in the ${link_1}, the Northern Water Tribe administrated a relief effort led by Master ${link_2}, who brought along a number of ${link_3}, waterbenders, and ${link_4} to aid in the Southern tribe's redevelopment. This mission proved to be successful, resulting in political rapprochement between the two tribes. Nevertheless, after the North began to undermine the South's traditional autonomy, resentment grew among Southern tribesmen that eventually escalated into a civil war that Avatar ${link_5} ended with the South's independence.",
      "links": [
        {
          "body": "this group",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Siege of the North",
          "key": "${link_1}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        },
        {
          "body": "Pakku",
          "key": "${link_2}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "warriors",
          "key": "${link_3}",
          "target": {
            "href": "Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        },
        {
          "body": "healers",
          "key": "${link_4}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        },
        {
          "body": "Korra",
          "key": "${link_5}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "After this group's involvement in the Siege of the North, the Northern Water Tribe administrated a relief effort led by Master Pakku, who brought along a number of warriors, waterbenders, and healers to aid in the Southern tribe's redevelopment. This mission proved to be successful, resulting in political rapprochement between the two tribes. Nevertheless, after the North began to undermine the South's traditional autonomy, resentment grew among Southern tribesmen that eventually escalated into a civil war that Avatar Korra ended with the South's independence."
    },
    {
      "body": "Originally, the Water Tribe existed as one nation, solely based in the North Pole. However, following civil unrest, a large group of warriors, waterbenders, and healers journeyed to the South Pole to engender a new tribal confederation of several autonomous chiefdoms. The Southern Tribesmen eventually agreed to reaccept the Northern ${link_0} as their ruler, as long they were granted autonomy and their own government for internal affairs. As such, the chiefdoms of the South were governed by a supreme Council of Elders that in turn answered to the Chief of the Water Tribes. Over time, Southerners married into the ruling family of the North, strengthening the tribal ties.",
      "links": [
        {
          "body": "chief",
          "key": "${link_0}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        }
      ],
      "text": "Originally, the Water Tribe existed as one nation, solely based in the North Pole. However, following civil unrest, a large group of warriors, waterbenders, and healers journeyed to the South Pole to engender a new tribal confederation of several autonomous chiefdoms. The Southern Tribesmen eventually agreed to reaccept the Northern chief as their ruler, as long they were granted autonomy and their own government for internal affairs. As such, the chiefdoms of the South were governed by a supreme Council of Elders that in turn answered to the Chief of the Water Tribes. Over time, Southerners married into the ruling family of the North, strengthening the tribal ties."
    },
    {
      "body": "Despite this political rapprochement, the enormous geographical distance between the two sects caused them to evolve differently. Even though their cultures were still similar—as they maintained common customs and celebrations until 40 AG—the people of the North and South developed completely differently in regard of society and politics. The Southern Water Tribe was far less hierarchical than the North, enjoying a high degree of gender equality. The Southern tribesmen eventually built a massive inland city as their political and cultural center and the tribe began to prosper, even though it never reached the size and importance of the North. During these years, a tradition of celebrating the ${link_0} began, during which the people would fast and meditate, and the tribal elders would commune with the spirits as they danced in the sky to create the southern lights; it ended on the day of the ${link_1}.",
      "links": [
        {
          "body": "Glacier Spirits Festival",
          "key": "${link_0}",
          "target": {
            "href": "Glacier_Spirits_Festival",
            "page": "Glacier_Spirits_Festival"
          }
        },
        {
          "body": "winter solstice",
          "key": "${link_1}",
          "target": {
            "href": "Winter_solstice",
            "page": "Winter_solstice"
          }
        }
      ],
      "text": "Despite this political rapprochement, the enormous geographical distance between the two sects caused them to evolve differently. Even though their cultures were still similar—as they maintained common customs and celebrations until 40 AG—the people of the North and South developed completely differently in regard of society and politics. The Southern Water Tribe was far less hierarchical than the North, enjoying a high degree of gender equality. The Southern tribesmen eventually built a massive inland city as their political and cultural center and the tribe began to prosper, even though it never reached the size and importance of the North. During these years, a tradition of celebrating the Glacier Spirits Festival began, during which the people would fast and meditate, and the tribal elders would commune with the spirits as they danced in the sky to create the southern lights; it ended on the day of the winter solstice."
    },
    {
      "body": "The Southern tribesmen also began to travel around the world. One group of Southern waterbenders discovered the ${link_0} in the ${link_1} thousands of years before the Hundred Year War. They decided to stay because of the abundant amounts of water there, engendering the ${link_2} in the process. However, as the Foggy Swamp tribesmen maintained isolation, the people of the South Pole never learned of these events. By the beginning of the Great War, the Southern Water Tribe had grown into a strong nation, with its capital filled with hundreds and hundreds of capable waterbenders of both men and women.",
      "links": [
        {
          "body": "Foggy Swamp",
          "key": "${link_0}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Foggy Swamp Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Foggy_Swamp_Tribe",
            "page": "Foggy_Swamp_Tribe"
          }
        }
      ],
      "text": "The Southern tribesmen also began to travel around the world. One group of Southern waterbenders discovered the Foggy Swamp in the Earth Kingdom thousands of years before the Hundred Year War. They decided to stay because of the abundant amounts of water there, engendering the Foggy Swamp Tribe in the process. However, as the Foggy Swamp tribesmen maintained isolation, the people of the South Pole never learned of these events. By the beginning of the Great War, the Southern Water Tribe had grown into a strong nation, with its capital filled with hundreds and hundreds of capable waterbenders of both men and women."
    },
    {
      "body": "The ${link_0}'s first ${link_1} destroyed the tribe's capital city.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "attacks",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe_raids#First_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        }
      ],
      "text": "The Fire Nation's first attacks destroyed the tribe's capital city."
    },
    {
      "body": "With the outbreak of the Hundred Year War, the Southern Water Tribe took up arms against the Fire Nation, though the tribe itself remained rather unscathed until around 40 AG. By then, ${link_0} ${link_1} began to perceive the South as a threat for his expansion and ordered his ${link_2} to annihilate the tribe's military strength. Consequently, the Fire Navy employed raiding forces of ${link_3} and ${link_4} in order to capture or kill as many Southern waterbenders as they could. By doing so, the Fire Nation hoped to destroy all resistance in the South. Despite being outnumbered, the waterbenders and nonbending warriors were able to defend themselves against the raids through fierce resistance, boasting minor victories such as successfully trapping a Fire Nation ship which eventually developed into the ${link_5}. However, their determination was not enough and a systematic set of attacks eventually left ${link_6} as the only waterbender left, prior to her eventual surrender. Following the widespread destruction and loss of life that the raids had caused, tribal unity declined and the capital city was largely abandoned. The small chiefdoms and tribes that formed the Southern confederation divided and scattered throughout the South Pole and all contact to the Northern Water Tribe was lost.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Azulon",
          "key": "${link_1}",
          "target": {
            "href": "Azulon",
            "page": "Azulon"
          }
        },
        {
          "body": "navy",
          "key": "${link_2}",
          "target": {
            "href": "Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "firebenders",
          "key": "${link_3}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "cruisers",
          "key": "${link_4}",
          "target": {
            "href": "Fire_Nation_cruiser",
            "page": "Fire_Nation_cruiser"
          }
        },
        {
          "body": "shipwreck",
          "key": "${link_5}",
          "target": {
            "href": "Shipwreck",
            "page": "Shipwreck"
          }
        },
        {
          "body": "Hama",
          "key": "${link_6}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        }
      ],
      "text": "With the outbreak of the Hundred Year War, the Southern Water Tribe took up arms against the Fire Nation, though the tribe itself remained rather unscathed until around 40 AG. By then, Fire Lord Azulon began to perceive the South as a threat for his expansion and ordered his navy to annihilate the tribe's military strength. Consequently, the Fire Navy employed raiding forces of firebenders and cruisers in order to capture or kill as many Southern waterbenders as they could. By doing so, the Fire Nation hoped to destroy all resistance in the South. Despite being outnumbered, the waterbenders and nonbending warriors were able to defend themselves against the raids through fierce resistance, boasting minor victories such as successfully trapping a Fire Nation ship which eventually developed into the shipwreck. However, their determination was not enough and a systematic set of attacks eventually left Hama as the only waterbender left, prior to her eventual surrender. Following the widespread destruction and loss of life that the raids had caused, tribal unity declined and the capital city was largely abandoned. The small chiefdoms and tribes that formed the Southern confederation divided and scattered throughout the South Pole and all contact to the Northern Water Tribe was lost."
    },
    {
      "body": "Even though the South was virtually defeated, the raids continued by the ${link_0}, who attacked the minor tribe of Chieftain ${link_1} in 94 AG; they had been informed that one waterbender remained in the Southern Water Tribe and were subsequently assigned to eliminate that person. Knowing that the remaining waterbender was her eight-year-old daughter, Katara, ${link_2} gave her life by confessing to Captain ${link_3} that she was the person they were after. Her death provided the Fire Nation with the impression that the Southern waterbending lineage had been completely eradicated, which left Katara as the sole survivor.",
      "links": [
        {
          "body": "Southern Raiders",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Raiders",
            "page": "Southern_Raiders"
          }
        },
        {
          "body": "Hakoda",
          "key": "${link_1}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Kya",
          "key": "${link_2}",
          "target": {
            "href": "Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        },
        {
          "body": "Yon Rha",
          "key": "${link_3}",
          "target": {
            "href": "Yon_Rha",
            "page": "Yon_Rha"
          }
        }
      ],
      "text": "Even though the South was virtually defeated, the raids continued by the Southern Raiders, who attacked the minor tribe of Chieftain Hakoda in 94 AG; they had been informed that one waterbender remained in the Southern Water Tribe and were subsequently assigned to eliminate that person. Knowing that the remaining waterbender was her eight-year-old daughter, Katara, Kya gave her life by confessing to Captain Yon Rha that she was the person they were after. Her death provided the Fire Nation with the impression that the Southern waterbending lineage had been completely eradicated, which left Katara as the sole survivor."
    },
    {
      "body": "By 99 ${link_0}, the Southern Water Tribe's unity was broken, its people spread over a collection of small villages.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "By 99 AG, the Southern Water Tribe's unity was broken, its people spread over a collection of small villages."
    },
    {
      "body": "In the final years of the Hundred Year War, the Southern Water Tribe was in dire straits and teetering on the brink of extinction. As its population struggled to survive, many old traditions to appease the spirits were abandoned or forgotten, rendering the land spiritually unbalanced as well. As a result, angry spirits turned ${link_0} and formed the ${link_1}.",
      "links": [
        {
          "body": "dark",
          "key": "${link_0}",
          "target": {
            "href": "Dark_spirits",
            "page": "Dark_spirits"
          }
        },
        {
          "body": "Everstorm",
          "key": "${link_1}",
          "target": {
            "href": "Everstorm",
            "page": "Everstorm"
          }
        }
      ],
      "text": "In the final years of the Hundred Year War, the Southern Water Tribe was in dire straits and teetering on the brink of extinction. As its population struggled to survive, many old traditions to appease the spirits were abandoned or forgotten, rendering the land spiritually unbalanced as well. As a result, angry spirits turned dark and formed the Everstorm."
    },
    {
      "body": "Many remaining male warriors left their chiefdoms for the ${link_0} to aid them against the Fire Nation, leaving the population of the tribe to be consisted mostly of elderly, middle-aged women, mothers, and very young children.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Many remaining male warriors left their chiefdoms for the Earth Kingdom to aid them against the Fire Nation, leaving the population of the tribe to be consisted mostly of elderly, middle-aged women, mothers, and very young children."
    },
    {
      "body": "In 99 AG, Katara and Sokka discovered Avatar Aang, which resulted in Fire ${link_0} ${link_1} raiding their village and capturing Aang. Sokka and Katara subsequently left the village as well in an attempt to save the Avatar and began to travel together with him to end the war.",
      "links": [
        {
          "body": "Prince",
          "key": "${link_0}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "In 99 AG, Katara and Sokka discovered Avatar Aang, which resulted in Fire Prince Zuko raiding their village and capturing Aang. Sokka and Katara subsequently left the village as well in an attempt to save the Avatar and began to travel together with him to end the war."
    },
    {
      "body": "After the Siege of the North, a group of waterbenders and healers from the Northern Water Tribe were sent to the South to help rebuild it, one of whom was the waterbending master ${link_0}.",
      "links": [
        {
          "body": "Pakku",
          "key": "${link_0}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        }
      ],
      "text": "After the Siege of the North, a group of waterbenders and healers from the Northern Water Tribe were sent to the South to help rebuild it, one of whom was the waterbending master Pakku."
    },
    {
      "body": "Even though the initial Northern relief expedition aided the Southern Water Tribe greatly in the slow process of rebuilding, the living conditions and economic situation of the South remained dire, forcing several Southerners to seek work abroad. Over time, the North restored its rule over the Southern Water Tribe and sent many more waterbenders and resources to aid its sister tribe. Eventually, the South grew prosperous again, prompting the North to demand taxes in return for their help.",
      "links": [],
      "text": "Even though the initial Northern relief expedition aided the Southern Water Tribe greatly in the slow process of rebuilding, the living conditions and economic situation of the South remained dire, forcing several Southerners to seek work abroad. Over time, the North restored its rule over the Southern Water Tribe and sent many more waterbenders and resources to aid its sister tribe. Eventually, the South grew prosperous again, prompting the North to demand taxes in return for their help."
    },
    {
      "body": "The Southern Water Tribe returned to former glory.",
      "links": [],
      "text": "The Southern Water Tribe returned to former glory."
    },
    {
      "body": "With the South's economic and social resurgence, its tribal unity was also restored and the old Council of Elders resumed their rule over the South Pole, maintaining the tribe's autonomy under jurisdiction of the Northern chief. Following the creation of the United Republic, the South was given a seat on the United Republic Council, charging one of its residents with helping to oversee the sovereign state. Some of the Southern Tribe's citizens also emigrated to the United Republic over the years, where a ${link_0} was built for them in the capital itself.",
      "links": [
        {
          "body": "cultural center",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe_Cultural_Center",
            "page": "Southern_Water_Tribe_Cultural_Center"
          }
        }
      ],
      "text": "With the South's economic and social resurgence, its tribal unity was also restored and the old Council of Elders resumed their rule over the South Pole, maintaining the tribe's autonomy under jurisdiction of the Northern chief. Following the creation of the United Republic, the South was given a seat on the United Republic Council, charging one of its residents with helping to oversee the sovereign state. Some of the Southern Tribe's citizens also emigrated to the United Republic over the years, where a cultural center was built for them in the capital itself."
    },
    {
      "body": "In 153 AG, the next Avatar in the cycle, Korra, was born in the Southern Water Tribe. A large compound was built for her to train under the ${link_0} in waterbending, ${link_1}, and ${link_2}. By this time, the tribe's villages had grown into cities and the formerly uninhabited tundra became colonized. With its growing economic power, the Southern tribesmen became more independent and discontent with the North's rule and its taxes. Support for independence became widespread and the Northern chief was seen as little more than a figurehead, as opposed to the Council of Elders and the local chieftains, who were more readily accepted as rightful rulers of the Southern Water Tribe. In 170 AG, Avatar Korra left the compound and the Southern Water Tribe to help the world.",
      "links": [
        {
          "body": "Order of the White Lotus",
          "key": "${link_0}",
          "target": {
            "href": "Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "firebending",
          "key": "${link_2}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "In 153 AG, the next Avatar in the cycle, Korra, was born in the Southern Water Tribe. A large compound was built for her to train under the Order of the White Lotus in waterbending, earthbending, and firebending. By this time, the tribe's villages had grown into cities and the formerly uninhabited tundra became colonized. With its growing economic power, the Southern tribesmen became more independent and discontent with the North's rule and its taxes. Support for independence became widespread and the Northern chief was seen as little more than a figurehead, as opposed to the Council of Elders and the local chieftains, who were more readily accepted as rightful rulers of the Southern Water Tribe. In 170 AG, Avatar Korra left the compound and the Southern Water Tribe to help the world."
    },
    {
      "body": "${link_0} ${link_1} reopened the Southern Water Tribe ${link_2} in 171 ${link_3}.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "AG",
          "key": "${link_3}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "Avatar Korra reopened the Southern Water Tribe spirit portal in 171 AG."
    },
    {
      "body": "By early 171 AG, dark spirits began to attack tribesmen at the South Pole and ships in the Southern Tribe's waters. Consequently, ${link_0}, chief of the Water Tribes at the time, traveled to the South in order to restore local spirituality and end the attacks. Taking Korra as his spiritual disciple, the chief traveled with her to the center of the South Pole in order for her to open the spirit portal and allowing the ${link_1} to return, thus lighting up the Southern sky with dancing spirits once more.",
      "links": [
        {
          "body": "Unalaq",
          "key": "${link_0}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "spirit lights",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_lights",
            "page": "Spirit_lights"
          }
        }
      ],
      "text": "By early 171 AG, dark spirits began to attack tribesmen at the South Pole and ships in the Southern Tribe's waters. Consequently, Unalaq, chief of the Water Tribes at the time, traveled to the South in order to restore local spirituality and end the attacks. Taking Korra as his spiritual disciple, the chief traveled with her to the center of the South Pole in order for her to open the spirit portal and allowing the spirit lights to return, thus lighting up the Southern sky with dancing spirits once more."
    },
    {
      "body": "After the spirit portal was opened, Chief Unalaq summoned his forces to the tribe in an abrasive attempt to unite the North and the South. Most Southerners felt that the Northern military presence was threatening their autonomy and unrest soon ensued, resulting in talks of a rebellion. Avatar Korra attempted to defuse the tension by reminding her people that they were all part of the same tribe, though her mediation was seen by the Southerners as her siding with the Northern regime.",
      "links": [],
      "text": "After the spirit portal was opened, Chief Unalaq summoned his forces to the tribe in an abrasive attempt to unite the North and the South. Most Southerners felt that the Northern military presence was threatening their autonomy and unrest soon ensued, resulting in talks of a rebellion. Avatar Korra attempted to defuse the tension by reminding her people that they were all part of the same tribe, though her mediation was seen by the Southerners as her siding with the Northern regime."
    },
    {
      "body": "As tensions grew, Southern Water Tribe civilians threatened to attack ${link_0} soldiers.",
      "links": [
        {
          "body": "Northern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "text": "As tensions grew, Southern Water Tribe civilians threatened to attack Northern Water Tribe soldiers."
    },
    {
      "body": "Eventually, a group of rebels, supported by ${link_0}, made an attempt to kidnap Unalaq, though Korra thwarted the plot as it was being carried out. The chief commanded that the rebels be thrown in prison forever, but Korra successfully convinced him to allow them to stand trial, as she thought it would appease the South. However, Unalaq suspected Korra's parents, ${link_1} and ${link_2}, of being part of the attempted assassination and ordered them arrested. The accused were brought before Judge ${link_3}, who acquitted Senna but sentenced the others to life imprisonment. Korra later confronted Hotah and learned that the entire trial was a sham orchestrated by Unalaq. Thus, she and her friends busted her father and the rebels out of prison, officially igniting a civil war between the Water Tribes.",
      "links": [
        {
          "body": "Varrick Global Industries",
          "key": "${link_0}",
          "target": {
            "href": "Varrick_Global_Industries",
            "page": "Varrick_Global_Industries"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_1}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Senna",
          "key": "${link_2}",
          "target": {
            "href": "Senna",
            "page": "Senna"
          }
        },
        {
          "body": "Hotah",
          "key": "${link_3}",
          "target": {
            "href": "Hotah",
            "page": "Hotah"
          }
        }
      ],
      "text": "Eventually, a group of rebels, supported by Varrick Global Industries, made an attempt to kidnap Unalaq, though Korra thwarted the plot as it was being carried out. The chief commanded that the rebels be thrown in prison forever, but Korra successfully convinced him to allow them to stand trial, as she thought it would appease the South. However, Unalaq suspected Korra's parents, Tonraq and Senna, of being part of the attempted assassination and ordered them arrested. The accused were brought before Judge Hotah, who acquitted Senna but sentenced the others to life imprisonment. Korra later confronted Hotah and learned that the entire trial was a sham orchestrated by Unalaq. Thus, she and her friends busted her father and the rebels out of prison, officially igniting a civil war between the Water Tribes."
    },
    {
      "body": "Now led by Tonraq, the rebels subsequently retreated to the hills outside of Harbor City. Unalaq decided not to confront them, however, opting to increase the protection of the spirit portal, as it was vital to his plans. With ${link_0} nearing, Tonraq went ${link_1}, though his forces were completely defeated by the Northern troops, who received help from dark spirits.",
      "links": [
        {
          "body": "Harmonic Convergence",
          "key": "${link_0}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "on the offensive",
          "key": "${link_1}",
          "target": {
            "href": "Battle_of_the_Southern_Water_Tribe",
            "page": "Battle_of_the_Southern_Water_Tribe"
          }
        }
      ],
      "text": "Now led by Tonraq, the rebels subsequently retreated to the hills outside of Harbor City. Unalaq decided not to confront them, however, opting to increase the protection of the spirit portal, as it was vital to his plans. With Harmonic Convergence nearing, Tonraq went on the offensive, though his forces were completely defeated by the Northern troops, who received help from dark spirits."
    },
    {
      "body": "Despite this defeat, Avatar Korra ${link_0} UnaVaatu, the merger between Unalaq and ${link_1}. Soon after, she declared the Water Tribe Civil War to be over and announced the Southern Water Tribe's independence with the reinstated Council of Elders having elected Tonraq as the new chief.",
      "links": [
        {
          "body": "defeated",
          "key": "${link_0}",
          "target": {
            "href": "Unalaq_Crisis",
            "page": "Unalaq_Crisis"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_1}",
          "target": {
            "href": "Vaatu",
            "page": "Vaatu"
          }
        }
      ],
      "text": "Despite this defeat, Avatar Korra defeated UnaVaatu, the merger between Unalaq and Vaatu. Soon after, she declared the Water Tribe Civil War to be over and announced the Southern Water Tribe's independence with the reinstated Council of Elders having elected Tonraq as the new chief."
    },
    {
      "body": "Just a week after gaining its independence, the South was infiltrated by ${link_0}'s dark spirits and ${link_1}. They occupied large parts of the South Pole's hinterland and the local spirit portal, though were eventually driven out by Avatar Korra.",
      "links": [
        {
          "body": "Hundun",
          "key": "${link_0}",
          "target": {
            "href": "Hundun",
            "page": "Hundun"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_1}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        }
      ],
      "text": "Just a week after gaining its independence, the South was infiltrated by Hundun's dark spirits and Equalists. They occupied large parts of the South Pole's hinterland and the local spirit portal, though were eventually driven out by Avatar Korra."
    },
    {
      "body": "Months later, Korra spent two years at the Southern Water Tribe, recovering physically from her ${link_0} poisoning suffered at the hands of the ${link_1}, until her departure to the Earth Kingdom in 173 AG.",
      "links": [
        {
          "body": "mercury",
          "key": "${link_0}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_1}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        }
      ],
      "text": "Months later, Korra spent two years at the Southern Water Tribe, recovering physically from her mercury poisoning suffered at the hands of the Red Lotus, until her departure to the Earth Kingdom in 173 AG."
    },
    {
      "body": "Government system: Federal parliamentary elected chiefdom (formerly confederate chiefdom)",
      "links": [],
      "text": "Government system: Federal parliamentary elected chiefdom (formerly confederate chiefdom)"
    },
    {
      "body": "Head of State: Tribal chief",
      "links": [],
      "text": "Head of State: Tribal chief"
    },
    {
      "body": "Head of Government: Chairman of the Council of Chieftains and Elders",
      "links": [],
      "text": "Head of Government: Chairman of the Council of Chieftains and Elders"
    },
    {
      "body": "Originally, the individual villages of the Southern Water Tribe were each led by a single leader, or chief. By 100 AG, these roles were restricted to male warriors; Hakoda led the southernmost tribe in 100 AG, for instance. During this time, the Southern Water Tribe was a much smaller and less stratified society, unlike its Northern counterpart.",
      "links": [],
      "text": "Originally, the individual villages of the Southern Water Tribe were each led by a single leader, or chief. By 100 AG, these roles were restricted to male warriors; Hakoda led the southernmost tribe in 100 AG, for instance. During this time, the Southern Water Tribe was a much smaller and less stratified society, unlike its Northern counterpart."
    },
    {
      "body": "The ${link_0} is the seat of the South's government.",
      "links": [
        {
          "body": "Southern Water Tribe Royal Palace",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe_Royal_Palace",
            "page": "Southern_Water_Tribe_Royal_Palace"
          }
        }
      ],
      "text": "The Southern Water Tribe Royal Palace is the seat of the South's government."
    },
    {
      "body": "Years later, the Southern Water Tribe accepted the authority of the Northern Water Tribe Chiefdom, but retained autonomy. A Council of Chieftains and Elders officially govern the Southern Water Tribe, consisting of male and female representatives of the different cities, villages, tribes, and social classes within the settlements. The council assembles in the ${link_0}, which serves as the formal seat of government in the South Pole. Traditionally residing in the North, the tribal chief does not hold much more than a figurehead position to the Southerners; his primary duties involve ceremonial and representative tasks.",
      "links": [
        {
          "body": "Southern Water Tribe Royal Palace",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe_Royal_Palace",
            "page": "Southern_Water_Tribe_Royal_Palace"
          }
        }
      ],
      "text": "Years later, the Southern Water Tribe accepted the authority of the Northern Water Tribe Chiefdom, but retained autonomy. A Council of Chieftains and Elders officially govern the Southern Water Tribe, consisting of male and female representatives of the different cities, villages, tribes, and social classes within the settlements. The council assembles in the Southern Water Tribe Royal Palace, which serves as the formal seat of government in the South Pole. Traditionally residing in the North, the tribal chief does not hold much more than a figurehead position to the Southerners; his primary duties involve ceremonial and representative tasks."
    },
    {
      "body": "In times of crisis, nevertheless, the Chief of the Northern Water Tribe can take a much stronger hold on the Southern Water Tribe's functions. Northern intervention, however, is not well received in the South, as was evident when a ${link_0} prompted Chief Unalaq to intervene in the Southern Water Tribe's affairs. Many tribesmen saw Unalaq and his forces as oppressors, demonstrating the strong spirit of independence in the South.",
      "links": [
        {
          "body": "blight involving dark spirits",
          "key": "${link_0}",
          "target": {
            "href": "Dark_spirit_incidents",
            "page": "Dark_spirit_incidents"
          }
        }
      ],
      "text": "In times of crisis, nevertheless, the Chief of the Northern Water Tribe can take a much stronger hold on the Southern Water Tribe's functions. Northern intervention, however, is not well received in the South, as was evident when a blight involving dark spirits prompted Chief Unalaq to intervene in the Southern Water Tribe's affairs. Many tribesmen saw Unalaq and his forces as oppressors, demonstrating the strong spirit of independence in the South."
    },
    {
      "body": "Citizens of the Southern Water Tribe who commit a crime have the right to a trial prior to being incarcerated. The following tribunals are held in a courtroom located inside the royal palace, where a single jurist oversees the court proceedings.",
      "links": [],
      "text": "Citizens of the Southern Water Tribe who commit a crime have the right to a trial prior to being incarcerated. The following tribunals are held in a courtroom located inside the royal palace, where a single jurist oversees the court proceedings."
    },
    {
      "body": "After the ${link_0}, Avatar Korra declared the war over, and the Southern Water Tribe an independent state. The chieftains elected the Avatar's father, Tonraq, to be their next chief.",
      "links": [
        {
          "body": "Water Tribe Civil War",
          "key": "${link_0}",
          "target": {
            "href": "Water_Tribe_Civil_War",
            "page": "Water_Tribe_Civil_War"
          }
        }
      ],
      "text": "After the Water Tribe Civil War, Avatar Korra declared the war over, and the Southern Water Tribe an independent state. The chieftains elected the Avatar's father, Tonraq, to be their next chief."
    },
    {
      "body": "The old inland capital was prosperous prior to the ${link_0} in 40 AG. After being almost destroyed during the ${link_1}, it was later rebuilt and evolved into the harbor city.",
      "links": [
        {
          "body": "raids",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_1}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "The old inland capital was prosperous prior to the raids in 40 AG. After being almost destroyed during the Hundred Year War, it was later rebuilt and evolved into the harbor city."
    },
    {
      "body": "The old capital of the Southern Water Tribe, positioned on a northern shoreline, was a large inland city by 40 AG, and consisted of dozens of tents and igloos surrounded by a very large ice wall. A central igloo lay in the center of the village, which was circular in design. However, the capital shrunk in size due to constant raids by the Fire Nation and the departure of the Water Tribe warriors.",
      "links": [],
      "text": "The old capital of the Southern Water Tribe, positioned on a northern shoreline, was a large inland city by 40 AG, and consisted of dozens of tents and igloos surrounded by a very large ice wall. A central igloo lay in the center of the village, which was circular in design. However, the capital shrunk in size due to constant raids by the Fire Nation and the departure of the Water Tribe warriors."
    },
    {
      "body": "Toward the end of the Hundred Year War, the capital had been reduced to a tiny village, was surrounded by a low, roughly circular snow wall, broken up by a snow watchtower, which was built by Sokka, to the north and a non-gated entrance to the south. Inside were eight residential tents, arranged semi circularly around a communal fire pit. A giant igloo hugged the east wall, while a handful of smaller units clustered the north wall. Outside, to the right of the entrance, was a small igloo structure that served as the village outhouse. The remaining population stood at less than two dozen, with ten older women, ten young children and one domesticated ${link_0}.",
      "links": [
        {
          "body": "polar dog",
          "key": "${link_0}",
          "target": {
            "href": "Polar_dog",
            "page": "Polar_dog"
          }
        }
      ],
      "text": "Toward the end of the Hundred Year War, the capital had been reduced to a tiny village, was surrounded by a low, roughly circular snow wall, broken up by a snow watchtower, which was built by Sokka, to the north and a non-gated entrance to the south. Inside were eight residential tents, arranged semi circularly around a communal fire pit. A giant igloo hugged the east wall, while a handful of smaller units clustered the north wall. Outside, to the right of the entrance, was a small igloo structure that served as the village outhouse. The remaining population stood at less than two dozen, with ten older women, ten young children and one domesticated polar dog."
    },
    {
      "body": "In the years after the end of the Hundred Year War, the capital grew considerably, showing the success of the Northern Water Tribe volunteers who helped rebuild the Southern Water Tribe during the time of Avatar Aang. By 171 AG, the once small capital had grown into a large, modern city, and a harbor had been built at the edge of the city for ships to dock.",
      "links": [],
      "text": "In the years after the end of the Hundred Year War, the capital grew considerably, showing the success of the Northern Water Tribe volunteers who helped rebuild the Southern Water Tribe during the time of Avatar Aang. By 171 AG, the once small capital had grown into a large, modern city, and a harbor had been built at the edge of the city for ships to dock."
    },
    {
      "body": "West of the village lies a ${link_0} ship, torn open by jutting ice shelves. Though the shipwreck is a relic of the Fire Nation's historic first strike, its ${link_1} are still in working order. Aang accidentally set off a flare that was meant to signal the Fire Nation. It is later revealed that Hama and the Southern waterbenders were responsible for the wrecking of the vessel, as a brief scene shows them raising the ship up with ice and grounding it. The location appears to be the same seen when Aang and Katara explored it.",
      "links": [
        {
          "body": "Fire Navy",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "booby traps",
          "key": "${link_1}",
          "target": {
            "href": "Booby_trap",
            "page": "Booby_trap"
          }
        }
      ],
      "text": "West of the village lies a Fire Navy ship, torn open by jutting ice shelves. Though the shipwreck is a relic of the Fire Nation's historic first strike, its booby traps are still in working order. Aang accidentally set off a flare that was meant to signal the Fire Nation. It is later revealed that Hama and the Southern waterbenders were responsible for the wrecking of the vessel, as a brief scene shows them raising the ship up with ice and grounding it. The location appears to be the same seen when Aang and Katara explored it."
    },
    {
      "body": "The ${link_0} was where ${link_1} ${link_2}'s training took place.",
      "links": [
        {
          "body": "Southern Water Tribe compound",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe_compound",
            "page": "Southern_Water_Tribe_compound"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "The Southern Water Tribe compound was where Avatar Korra's training took place."
    },
    {
      "body": "The Southern Water Tribe compound lies deep within the South Pole. It is a small, isolated encampment secured by thick ice walls and a large gate. The enclosure features several watchtowers, large buildings for shelter, an obstacle course and sub-level pens lined with hay for fauna, such as ${link_0}. A large raised platform made of ice is located in the center of the camp, both for Korra's bending training and combat practice. Members of the Order stand on a wooden pavilion overlooking the platform, where they monitor Korra's progress. Sentries from the White Lotus also man the watchtowers and clear any individual wishing to enter or exit the encampment.",
      "links": [
        {
          "body": "Naga",
          "key": "${link_0}",
          "target": {
            "href": "Naga",
            "page": "Naga"
          }
        }
      ],
      "text": "The Southern Water Tribe compound lies deep within the South Pole. It is a small, isolated encampment secured by thick ice walls and a large gate. The enclosure features several watchtowers, large buildings for shelter, an obstacle course and sub-level pens lined with hay for fauna, such as Naga. A large raised platform made of ice is located in the center of the camp, both for Korra's bending training and combat practice. Members of the Order stand on a wooden pavilion overlooking the platform, where they monitor Korra's progress. Sentries from the White Lotus also man the watchtowers and clear any individual wishing to enter or exit the encampment."
    },
    {
      "body": "The South Pole has a significant stretch of frozen tundra.",
      "links": [],
      "text": "The South Pole has a significant stretch of frozen tundra."
    },
    {
      "body": "A significant stretch of tundra covers most of the South Pole. In contrast to the mountainous landscape of the North Pole, the frozen plains of the South are broken only occasionally by mountains. The harsh terrain was made all the more dangerous by a brutal, unending storm that had battered the South for decades. Known as the Everstorm, this spiritually-charged blizzard rendered the land uninhabitable. Dark spirits were known to haunt the tundra's ice caves.",
      "links": [],
      "text": "A significant stretch of tundra covers most of the South Pole. In contrast to the mountainous landscape of the North Pole, the frozen plains of the South are broken only occasionally by mountains. The harsh terrain was made all the more dangerous by a brutal, unending storm that had battered the South for decades. Known as the Everstorm, this spiritually-charged blizzard rendered the land uninhabitable. Dark spirits were known to haunt the tundra's ice caves."
    },
    {
      "body": "Within the tundra lies a great frozen forest where many dark spirits reside. In the center of this sacred forest is a portal to the ${link_0}, which is only accessible by the Avatar on a solstice. It is also the source of the southern lights.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Within the tundra lies a great frozen forest where many dark spirits reside. In the center of this sacred forest is a portal to the Spirit World, which is only accessible by the Avatar on a solstice. It is also the source of the southern lights."
    },
    {
      "body": "In the mountains of the Southern Water Tribe lies the Bridge of No Return. The rope ${link_0} was said to have once served as a form of punishment for criminals of the South, who would be forced to walk across it and never return. The terrain on the other side of it was the most treacherous in the entire ${link_1}, making it impossible to survive there.",
      "links": [
        {
          "body": "bridge",
          "key": "${link_0}",
          "target": {
            "href": "Architecture_in_the_World_of_Avatar",
            "page": "Architecture_in_the_World_of_Avatar"
          }
        },
        {
          "body": "South Pole",
          "key": "${link_1}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        }
      ],
      "text": "In the mountains of the Southern Water Tribe lies the Bridge of No Return. The rope bridge was said to have once served as a form of punishment for criminals of the South, who would be forced to walk across it and never return. The terrain on the other side of it was the most treacherous in the entire South Pole, making it impossible to survive there."
    },
    {
      "body": "${link_0} can be performed in ${link_1} waters.",
      "links": [
        {
          "body": "Ice dodging",
          "key": "${link_0}",
          "target": {
            "href": "Ice_dodging",
            "page": "Ice_dodging"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Ice dodging can be performed in Earth Kingdom waters."
    },
    {
      "body": "The tribe has a unique rite of passage called ${link_0}. This is a coming-of-age ritual that serves as a young boy's first step toward being realized as a true warrior. The rite is described as a ceremonial test of wisdom, bravery and trust.",
      "links": [
        {
          "body": "ice dodging",
          "key": "${link_0}",
          "target": {
            "href": "Ice_dodging",
            "page": "Ice_dodging"
          }
        }
      ],
      "text": "The tribe has a unique rite of passage called ice dodging. This is a coming-of-age ritual that serves as a young boy's first step toward being realized as a true warrior. The rite is described as a ceremonial test of wisdom, bravery and trust."
    },
    {
      "body": "When a boy reaches the age of fourteen, his father takes him out to sea and challenges him to guide the ${link_0} through iceberg-studded waters. The father watches but does not interfere. If the boy succeeds, his father places a ceremonial mark on his forehead symbolizing the virtue he demonstrated most prominently during the test. The ${link_1} is awarded to those who show leadership and decisiveness, the ${link_2} is given for inspirational displays of courage, and the ${link_3} is bestowed upon those who prove themselves to be exceptionally steady and dependable.",
      "links": [
        {
          "body": "boat",
          "key": "${link_0}",
          "target": {
            "href": "Cutter_sailing_ship",
            "page": "Cutter_sailing_ship"
          }
        },
        {
          "body": "Mark of the Wise",
          "key": "${link_1}",
          "target": {
            "href": "Body_markings_in_the_World_of_Avatar#Mark_of_the_Wise",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Mark of the Brave",
          "key": "${link_2}",
          "target": {
            "href": "Body_markings_in_the_World_of_Avatar#Mark_of_the_Brave",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Mark of the Trusted",
          "key": "${link_3}",
          "target": {
            "href": "Body_markings_in_the_World_of_Avatar#Mark_of_the_Trusted",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "When a boy reaches the age of fourteen, his father takes him out to sea and challenges him to guide the boat through iceberg-studded waters. The father watches but does not interfere. If the boy succeeds, his father places a ceremonial mark on his forehead symbolizing the virtue he demonstrated most prominently during the test. The Mark of the Wise is awarded to those who show leadership and decisiveness, the Mark of the Brave is given for inspirational displays of courage, and the Mark of the Trusted is bestowed upon those who prove themselves to be exceptionally steady and dependable."
    },
    {
      "body": "The Southern Water Tribe is willing to adapt traditions such as ice dodging when circumstances warrant it. When ${link_0} realized that Sokka had never undergone the ritual due to Hakoda's departure, he took Sokka, Katara, and Aang on an ice dodging expedition in rocky ${link_1} waters. When they succeeded, he marked all three and declared Aang an honorary member of the Water Tribe.",
      "links": [
        {
          "body": "Bato",
          "key": "${link_0}",
          "target": {
            "href": "Bato",
            "page": "Bato"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "The Southern Water Tribe is willing to adapt traditions such as ice dodging when circumstances warrant it. When Bato realized that Sokka had never undergone the ritual due to Hakoda's departure, he took Sokka, Katara, and Aang on an ice dodging expedition in rocky Earth Kingdom waters. When they succeeded, he marked all three and declared Aang an honorary member of the Water Tribe."
    },
    {
      "body": "Children of the Tribe play a game called ${link_0}, which consists of catching an ${link_1} and riding its back as a makeshift sled. One typically lures in the otter penguin with a fish to make catching it easier.",
      "links": [
        {
          "body": "penguin sledding",
          "key": "${link_0}",
          "target": {
            "href": "Penguin_sledding",
            "page": "Penguin_sledding"
          }
        },
        {
          "body": "otter penguin",
          "key": "${link_1}",
          "target": {
            "href": "Otter_penguin",
            "page": "Otter_penguin"
          }
        }
      ],
      "text": "Children of the Tribe play a game called penguin sledding, which consists of catching an otter penguin and riding its back as a makeshift sled. One typically lures in the otter penguin with a fish to make catching it easier."
    },
    {
      "body": "Both men and women can participate in tasks like spear fishing.",
      "links": [],
      "text": "Both men and women can participate in tasks like spear fishing."
    },
    {
      "body": "While the Northern Water Tribe is an exceptionally strict patriarchal culture, gender roles in the Southern Water Tribe are far less rigid. Katara was shocked to learn that the Northern Tribe forbade women from learning waterbending apart for healing purposes, seeing how her father, Hakoda, recognized her bending abilities early on and unsuccessfully sought a master to teach her. Female waterbenders took an active part in battle, and are never forced into arranged marriages, but are instead free to marry whomever they see fit.",
      "links": [],
      "text": "While the Northern Water Tribe is an exceptionally strict patriarchal culture, gender roles in the Southern Water Tribe are far less rigid. Katara was shocked to learn that the Northern Tribe forbade women from learning waterbending apart for healing purposes, seeing how her father, Hakoda, recognized her bending abilities early on and unsuccessfully sought a master to teach her. Female waterbenders took an active part in battle, and are never forced into arranged marriages, but are instead free to marry whomever they see fit."
    },
    {
      "body": "Nevertheless, the Southern Tribe does not seem to be entirely free of gender roles. During the first few episodes of the series, up until his encounter with the ${link_0}, Sokka displayed a sexist attitude, claiming on numerous occasions that men are naturally better than women at tasks like hunting, fishing, and combat. In addition, during the siblings' childhood, Katara was responsible for \"women's work\" like midwifery and washing and mending clothes, including Sokka's; in contrast, Sokka was allowed to spend his time building fortifications and training younger boys to defend the village against the Fire Nation, despite the fact that his preparations were inadequate to deal with any real attack. However, notably, even Sokka was shocked and confused to learn of the Northern Water Tribe's patriarchal customs. In general, the Southern Water Tribe seems to have a simpler, less hierarchical culture and a more open-minded and flexible mindset.",
      "links": [
        {
          "body": "Kyoshi Warriors",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        }
      ],
      "text": "Nevertheless, the Southern Tribe does not seem to be entirely free of gender roles. During the first few episodes of the series, up until his encounter with the Kyoshi Warriors, Sokka displayed a sexist attitude, claiming on numerous occasions that men are naturally better than women at tasks like hunting, fishing, and combat. In addition, during the siblings' childhood, Katara was responsible for \"women's work\" like midwifery and washing and mending clothes, including Sokka's; in contrast, Sokka was allowed to spend his time building fortifications and training younger boys to defend the village against the Fire Nation, despite the fact that his preparations were inadequate to deal with any real attack. However, notably, even Sokka was shocked and confused to learn of the Northern Water Tribe's patriarchal customs. In general, the Southern Water Tribe seems to have a simpler, less hierarchical culture and a more open-minded and flexible mindset."
    },
    {
      "body": "The post-war ${link_0} of the Southern Water Tribe is much more grandiose in design than earlier styles.",
      "links": [
        {
          "body": "architecture",
          "key": "${link_0}",
          "target": {
            "href": "Architecture_in_the_World_of_Avatar#Water_Tribe",
            "page": "Architecture_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "The post-war architecture of the Southern Water Tribe is much more grandiose in design than earlier styles."
    },
    {
      "body": "In 99 AG, most of the residents in Sokka and Katara's village slept in tents made of sealskin. However, prior to the destruction inflicted during the Fire Nation attacks, residents of the Southern Water Tribe lived in igloo-like structures.",
      "links": [],
      "text": "In 99 AG, most of the residents in Sokka and Katara's village slept in tents made of sealskin. However, prior to the destruction inflicted during the Fire Nation attacks, residents of the Southern Water Tribe lived in igloo-like structures."
    },
    {
      "body": "The inside of a typical Southern Water Tribe hut contained a number of animal pelts that were placed on bamboo floors. At one end of the hut, a sealskin tent would be set up for use as a sleeping chamber. Ceremonial animal headdresses, spears, and animal skins were usually displayed on the walls of the hut.",
      "links": [],
      "text": "The inside of a typical Southern Water Tribe hut contained a number of animal pelts that were placed on bamboo floors. At one end of the hut, a sealskin tent would be set up for use as a sleeping chamber. Ceremonial animal headdresses, spears, and animal skins were usually displayed on the walls of the hut."
    },
    {
      "body": "In the center of the hut would be a square fire pit, surrounded by a single line of bricks. The fire provided heat for the hut, and was also used to prepare ${link_0}. There were mats for sitting on all four sides of the fire pit. A stew post, used for cooking, would hang suspended from the ceiling, hovering above the fire.",
      "links": [
        {
          "body": "food",
          "key": "${link_0}",
          "target": {
            "href": "Cuisine_in_the_World_of_Avatar#Water_Tribe",
            "page": "Cuisine_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "In the center of the hut would be a square fire pit, surrounded by a single line of bricks. The fire provided heat for the hut, and was also used to prepare food. There were mats for sitting on all four sides of the fire pit. A stew post, used for cooking, would hang suspended from the ceiling, hovering above the fire."
    },
    {
      "body": "Warriors of the Southern Water Tribe wield weaponry that includes clubs, scimitars, bone spears used in spear fishing, bladed boomerangs, machetes with whale teeth on the dull side of the blade, and shields. Black and white warpaint in a pattern reminiscent of a wolf is traditionally applied to the face before entering a battle. During the ${link_0}, all the warriors wore wolf-headed helmets and ${link_1}.",
      "links": [
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        },
        {
          "body": "suits of armor",
          "key": "${link_1}",
          "target": {
            "href": "Water_Tribe_wolf_armor",
            "page": "Water_Tribe_wolf_armor"
          }
        }
      ],
      "text": "Warriors of the Southern Water Tribe wield weaponry that includes clubs, scimitars, bone spears used in spear fishing, bladed boomerangs, machetes with whale teeth on the dull side of the blade, and shields. Black and white warpaint in a pattern reminiscent of a wolf is traditionally applied to the face before entering a battle. During the invasion of the Fire Nation, all the warriors wore wolf-headed helmets and suits of armor."
    },
    {
      "body": "${link_0} of the Southern Water Tribe participated in the ${link_1}.",
      "links": [
        {
          "body": "Warriors",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        },
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "text": "Warriors of the Southern Water Tribe participated in the invasion of the Fire Nation."
    },
    {
      "body": "It seems as though all adult men of the tribe are expected to be fully trained warriors. Two years prior to ${link_0} Aang's reawakening, all the tribe's men sailed to the Earth Kingdom to join the war effort. It is unclear whether women without waterbending abilities are ever allowed to train as warriors; however, there are very few women left behind, so the lack of women in the war party may simply reflect the tribe's overall population decline as a result of Fire Nation attacks. It is clear, however, that women who are waterbenders are accepted as fighters in the Southern Water Tribe; the northern faction's custom of restricting female waterbenders from combat takes Katara completely by surprise, and a flashback shows Hama and other women using their waterbending abilities to defend the tribe against the first Fire Nation raid.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "It seems as though all adult men of the tribe are expected to be fully trained warriors. Two years prior to Avatar Aang's reawakening, all the tribe's men sailed to the Earth Kingdom to join the war effort. It is unclear whether women without waterbending abilities are ever allowed to train as warriors; however, there are very few women left behind, so the lack of women in the war party may simply reflect the tribe's overall population decline as a result of Fire Nation attacks. It is clear, however, that women who are waterbenders are accepted as fighters in the Southern Water Tribe; the northern faction's custom of restricting female waterbenders from combat takes Katara completely by surprise, and a flashback shows Hama and other women using their waterbending abilities to defend the tribe against the first Fire Nation raid."
    },
    {
      "body": "Although the tribe had grown significantly in size after the end of the Hundred Year War, by 171 AG, it still lacked manpower and organization when compared to the Northern forces.",
      "links": [],
      "text": "Although the tribe had grown significantly in size after the end of the Hundred Year War, by 171 AG, it still lacked manpower and organization when compared to the Northern forces."
    },
    {
      "body": "Inhabiting frozen poles near the seas, the Water Tribes inherently are dependent on the oceans for a majority of their natural resources and well as the bounty of the frozen tundra. ${link_0} are a particular favorite. Squid and seaweed can be used to make a wide variety of dishes, including soup, seasoning, and even bread and cookies.",
      "links": [
        {
          "body": "Sea prunes",
          "key": "${link_0}",
          "target": {
            "href": "Sea_prune",
            "page": "Sea_prune"
          }
        }
      ],
      "text": "Inhabiting frozen poles near the seas, the Water Tribes inherently are dependent on the oceans for a majority of their natural resources and well as the bounty of the frozen tundra. Sea prunes are a particular favorite. Squid and seaweed can be used to make a wide variety of dishes, including soup, seasoning, and even bread and cookies."
    },
    {
      "body": "Skins from seals are used to create tents, while pelts from polar bears and other furry animals are used for clothing and as covering for barren surfaces. Naturally, hunters and fishermen of the Water Tribes are some of the best in the world in their field.",
      "links": [],
      "text": "Skins from seals are used to create tents, while pelts from polar bears and other furry animals are used for clothing and as covering for barren surfaces. Naturally, hunters and fishermen of the Water Tribes are some of the best in the world in their field."
    },
    {
      "body": "In Republic City, authentic Southern Water Tribe cuisine can be found at the renowned restaurant, ${link_0}.",
      "links": [
        {
          "body": "Narook's Seaweed Noodlery",
          "key": "${link_0}",
          "target": {
            "href": "Narook%27s_Seaweed_Noodlery",
            "page": "Narook%27s_Seaweed_Noodlery"
          }
        }
      ],
      "text": "In Republic City, authentic Southern Water Tribe cuisine can be found at the renowned restaurant, Narook's Seaweed Noodlery."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Southern_Water_Tribe",
    "file": "avatar.wikia.com/wiki/Southern_Water_Tribe.html",
    "page": "Southern_Water_Tribe",
    "title": "Southern Water Tribe"
  }
}