{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Books",
      "target": {
        "external": false,
        "href": "/wiki/Category_Books",
        "page": "Category_Books"
      }
    },
    {
      "body": "Print publications",
      "target": {
        "external": false,
        "href": "/wiki/Category_Print_publications",
        "page": "Category_Print_publications"
      }
    },
    {
      "body": "Real world",
      "target": {
        "external": false,
        "href": "/wiki/Category_Real_world",
        "page": "Category_Real_world"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Sozin's Comet: The Final Battle (${link_0}) is a book adaptation of the end of ${link_1} that was released on May 20, 2008. The novel covers whether or not ${link_2} ${link_3} can really save the ${link_4} from ${link_5} ${link_6}.",
      "links": [
        {
          "body": "ISBN 978-1-4169-5827-7",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Special:BookSources/9781416958277",
            "page": "Special:BookSources/9781416958277"
          }
        },
        {
          "body": "Book Three: Fire",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Book_Three__Fire",
            "page": "Book_Three__Fire"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "world",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle"
      ],
      "text": "Sozin's Comet: The Final Battle (ISBN 978-1-4169-5827-7) is a book adaptation of the end of Book Three: Fire that was released on May 20, 2008. The novel covers whether or not Avatar Aang can really save the world from Fire Lord Ozai."
    },
    {
      "body": "It is narrated in first person by the characters, which serves the reader in helping to know what goes through their minds while helping Aang against the latest enemy.",
      "links": [],
      "section": [
        "Sozin's Comet: The Final Battle"
      ],
      "text": "It is narrated in first person by the characters, which serves the reader in helping to know what goes through their minds while helping Aang against the latest enemy."
    },
    {
      "body": "The creators of Avatar originally planned to release the final episodes a few months before the actual release (actual release date: July 19, 2008), but production was delayed. However, a book titled Sozin's Comet was already printed and ready, and it was impossible for the people in charge to hold it in. Thus, it was released according to the original schedule: which was to release it along with or after the final episodes had been released. The book contained the story of the last four episodes of Avatar.",
      "links": [],
      "section": [
        "Sozin's Comet: The Final Battle"
      ],
      "text": "The creators of Avatar originally planned to release the final episodes a few months before the actual release (actual release date: July 19, 2008), but production was delayed. However, a book titled Sozin's Comet was already printed and ready, and it was impossible for the people in charge to hold it in. Thus, it was released according to the original schedule: which was to release it along with or after the final episodes had been released. The book contained the story of the last four episodes of Avatar."
    },
    {
      "body": "Three days before ${link_0} arrives, ${link_1} and Aang continue their ${link_2} training at ${link_3} in a duel. Irritated at Aang's peaceful nature inhibiting his firebending, Zuko attacks him harshly to get Aang angry enough to produce better flames. ${link_4} gets angry at Zuko for nearly harming Aang and Zuko vents his frustration at the group for being so ill-prepared to defeat Fire Lord Ozai before the comet's arrival. Aang and Katara reason that since ${link_5} has already fallen, the War is already over, and that Aang can just defeat the Fire Lord after the comet comes and goes. However, Zuko reveals that during a war meeting he attended, Ozai had announced to use the comet's power to reduce the entire ${link_6} to mere ashes instead of just using it to end the War. Shocked, Aang does not know what to do, but Katara and ${link_7} comfort him by saying they will help him to defeat the Fire Lord before the comet's arrival. The three of them have a group hug and Katara calls out to Zuko that \"being part of the group also means being part of group hugs\", so he joins them.",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Ember Island",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ember_Island",
            "page": "Ember_Island"
          }
        },
        {
          "body": "Katara",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Toph",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "While on Ember Island"
      ],
      "text": "Three days before Sozin's Comet arrives, Zuko and Aang continue their firebending training at Ember Island in a duel. Irritated at Aang's peaceful nature inhibiting his firebending, Zuko attacks him harshly to get Aang angry enough to produce better flames. Katara gets angry at Zuko for nearly harming Aang and Zuko vents his frustration at the group for being so ill-prepared to defeat Fire Lord Ozai before the comet's arrival. Aang and Katara reason that since Ba Sing Se has already fallen, the War is already over, and that Aang can just defeat the Fire Lord after the comet comes and goes. However, Zuko reveals that during a war meeting he attended, Ozai had announced to use the comet's power to reduce the entire Earth Kingdom to mere ashes instead of just using it to end the War. Shocked, Aang does not know what to do, but Katara and Toph comfort him by saying they will help him to defeat the Fire Lord before the comet's arrival. The three of them have a group hug and Katara calls out to Zuko that \"being part of the group also means being part of group hugs\", so he joins them."
    },
    {
      "body": "They continue their training and Zuko teaches Aang how to ${link_0}. During the training, Zuko stressing that when Aang battles someone as merciless as Ozai, Aang will have no choice but to take the Fire Lord's life. To help prepare for the final battle, ${link_1} creates a puppet of the Fire Lord for Aang to train against, nicknamed the \"Melon Lord\" since it has a melon for a head. However, when it was time for Aang to destroy the puppet, he could not do it. Aang remembers the ${link_2} teaching him that all life is precious and should be protected, and he becomes frustrated when everyone begins telling him he has no choice but to kill the Fire Lord to end the War.",
      "links": [
        {
          "body": "redirect lightning",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lightning_redirection",
            "page": "Lightning_redirection"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "While on Ember Island"
      ],
      "text": "They continue their training and Zuko teaches Aang how to redirect lightning. During the training, Zuko stressing that when Aang battles someone as merciless as Ozai, Aang will have no choice but to take the Fire Lord's life. To help prepare for the final battle, Sokka creates a puppet of the Fire Lord for Aang to train against, nicknamed the \"Melon Lord\" since it has a melon for a head. However, when it was time for Aang to destroy the puppet, he could not do it. Aang remembers the Air Nomads teaching him that all life is precious and should be protected, and he becomes frustrated when everyone begins telling him he has no choice but to kill the Fire Lord to end the War."
    },
    {
      "body": "The next day, when everyone is preparing to leave Ember Island to face the Fire Lord, they discover that Aang is missing as well as ${link_0}, but he did not take his staff or ${link_1}. Everyone becomes worried, and Katara asks Zuko to track him down since he is \"kind of an expert at tracking Aang\". He takes them to the Earth Kingdom to find ${link_2} the bounty hunter and her ${link_3}, ${link_4}. To their disappointment, Nyla cannot find Aang. Zuko resorts to finding the only other person who could stand up to Ozai: his uncle, ${link_5}. June leads them to the walls of Ba Sing Se, where they encounter members of the ${link_6}, including Master ${link_7}, Master ${link_8}, Master ${link_9} and ${link_10} ${link_11}. Pakku leads them to the White Lotus camp site, revealing that Iroh is the grandmaster, the Grand Lotus, the leader of the order.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Momo",
            "page": "Momo"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Appa",
            "page": "Appa"
          }
        },
        {
          "body": "June",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/June",
            "page": "June"
          }
        },
        {
          "body": "shirshu",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Shirshu",
            "page": "Shirshu"
          }
        },
        {
          "body": "Nyla",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Nyla",
            "page": "Nyla"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Order of the White Lotus",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        },
        {
          "body": "Pakku",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "Jeong Jeong",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        },
        {
          "body": "Piandao",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Piandao",
            "page": "Piandao"
          }
        },
        {
          "body": "King",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/King_of_Omashu",
            "page": "King_of_Omashu"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_11}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi_(King_of_Omashu)",
            "page": "Bumi_(King_of_Omashu)"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "Aang's disappearance"
      ],
      "text": "The next day, when everyone is preparing to leave Ember Island to face the Fire Lord, they discover that Aang is missing as well as Momo, but he did not take his staff or Appa. Everyone becomes worried, and Katara asks Zuko to track him down since he is \"kind of an expert at tracking Aang\". He takes them to the Earth Kingdom to find June the bounty hunter and her shirshu, Nyla. To their disappointment, Nyla cannot find Aang. Zuko resorts to finding the only other person who could stand up to Ozai: his uncle, Iroh. June leads them to the walls of Ba Sing Se, where they encounter members of the Order of the White Lotus, including Master Pakku, Master Jeong Jeong, Master Piandao and King Bumi. Pakku leads them to the White Lotus camp site, revealing that Iroh is the grandmaster, the Grand Lotus, the leader of the order."
    },
    {
      "body": "Aang wakes up, and finds that he and Momo are on a strange island in the middle of nowhere. At first he thinks he is in the ${link_0}, but sees this is not true since he can still bend on the unknown island. Aang meditates and contacts Avatar ${link_1}, even though he does not know where Aang is. Aang seeks comfort with Roku over his choice that he should not have to kill the Fire Lord to end the War. Roku instead tells Aang that during his own time as the Avatar, had he not spared the life of Fire Lord ${link_2}, the Hundred Year War would likely never have happened. Roku warns Aang that as the Avatar, he needs to be decisive. Aang becomes worried and contacts Avatar ${link_3} and Avatar ${link_4} hoping they will support his choice, but both tell Aang that he must do anything it takes to bring balance back to the world. Hoping a fellow ${link_5} would understand his choice, he contacts Avatar ${link_6}. She tells him that as the Avatar, an airbender is unable to achieve spiritual enlightenment since their duty is to the world first before themselves. Aang concludes he has no choice but to kill Fire Lord Ozai.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Roku",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi",
            "page": "Kyoshi"
          }
        },
        {
          "body": "Kuruk",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Kuruk",
            "page": "Kuruk"
          }
        },
        {
          "body": "airbender",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Yangchen",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Yangchen",
            "page": "Yangchen"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "Aang's disappearance"
      ],
      "text": "Aang wakes up, and finds that he and Momo are on a strange island in the middle of nowhere. At first he thinks he is in the Spirit World, but sees this is not true since he can still bend on the unknown island. Aang meditates and contacts Avatar Roku, even though he does not know where Aang is. Aang seeks comfort with Roku over his choice that he should not have to kill the Fire Lord to end the War. Roku instead tells Aang that during his own time as the Avatar, had he not spared the life of Fire Lord Sozin, the Hundred Year War would likely never have happened. Roku warns Aang that as the Avatar, he needs to be decisive. Aang becomes worried and contacts Avatar Kyoshi and Avatar Kuruk hoping they will support his choice, but both tell Aang that he must do anything it takes to bring balance back to the world. Hoping a fellow airbender would understand his choice, he contacts Avatar Yangchen. She tells him that as the Avatar, an airbender is unable to achieve spiritual enlightenment since their duty is to the world first before themselves. Aang concludes he has no choice but to kill Fire Lord Ozai."
    },
    {
      "body": "Back in the ${link_0}, ${link_1} ${link_2} is summoned by her father, expecting to join him on his invasion of the Earth Kingdom. However, Ozai instead orders her to remain in the Fire Nation. She becomes enraged, but Ozai quickly silences her by telling her she is to be appointed as the new Fire Lord in his absence. He appoints himself ${link_3}, the ruler of the world and departs with a fleet of airships to destroy the Earth Kingdom.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Princess",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Azula",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Phoenix King",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Phoenix_King",
            "page": "Phoenix_King"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "Coronation of the Phoenix King"
      ],
      "text": "Back in the Fire Nation, Princess Azula is summoned by her father, expecting to join him on his invasion of the Earth Kingdom. However, Ozai instead orders her to remain in the Fire Nation. She becomes enraged, but Ozai quickly silences her by telling her she is to be appointed as the new Fire Lord in his absence. He appoints himself Phoenix King, the ruler of the world and departs with a fleet of airships to destroy the Earth Kingdom."
    },
    {
      "body": "Iroh and Zuko reunite, and Zuko asks for his forgiveness. Iroh tells him he was never mad at Zuko for what happened; he was just sad and worried that Zuko had lost his way. Seeing that Zuko finally made friends makes him happy, but Iroh notices that the Avatar is missing from the group, and Zuko asks Iroh to stop Ozai in Aang's stead. He refuses, saying history does not need any more senseless violence, brother killing brother, and that the Avatar must be the one to stop Ozai for the Hundred Year War to end peacefully. Iroh tells Zuko he must return to the Fire Nation and reclaim the throne, but before he can do that he must defeat his sister, Azula. Zuko agrees, but acknowledges he cannot do it alone, and asks Katara if she would like to help him take her down. She gladly agrees.",
      "links": [],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "Reunion of Zuko and Iroh"
      ],
      "text": "Iroh and Zuko reunite, and Zuko asks for his forgiveness. Iroh tells him he was never mad at Zuko for what happened; he was just sad and worried that Zuko had lost his way. Seeing that Zuko finally made friends makes him happy, but Iroh notices that the Avatar is missing from the group, and Zuko asks Iroh to stop Ozai in Aang's stead. He refuses, saying history does not need any more senseless violence, brother killing brother, and that the Avatar must be the one to stop Ozai for the Hundred Year War to end peacefully. Iroh tells Zuko he must return to the Fire Nation and reclaim the throne, but before he can do that he must defeat his sister, Azula. Zuko agrees, but acknowledges he cannot do it alone, and asks Katara if she would like to help him take her down. She gladly agrees."
    },
    {
      "body": "As the mysterious island moves on its own, Aang discovers the island is not really an island at all. He swims around until he discovers to his surprise that the island is an enormous ${link_0}. He asks the creature about having to end someone's life to save the world, but the lion turtle only says: \"The true mind can weather all lies and illusions without being lost. The true heart can touch the poison of hatred without being harmed. From beginning-less time, darkness thrives in the void, but always yields to purifying light.\" Though Aang does not understand what the lion turtle means, he feels comforted. The creature brings Momo and Aang to the shore of the Earth Kingdom and tells him to wait for the arrival of Ozai, before departing back into the sea.",
      "links": [
        {
          "body": "lion turtle",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lion_turtle",
            "page": "Lion_turtle"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "Reunion of Zuko and Iroh"
      ],
      "text": "As the mysterious island moves on its own, Aang discovers the island is not really an island at all. He swims around until he discovers to his surprise that the island is an enormous lion turtle. He asks the creature about having to end someone's life to save the world, but the lion turtle only says: \"The true mind can weather all lies and illusions without being lost. The true heart can touch the poison of hatred without being harmed. From beginning-less time, darkness thrives in the void, but always yields to purifying light.\" Though Aang does not understand what the lion turtle means, he feels comforted. The creature brings Momo and Aang to the shore of the Earth Kingdom and tells him to wait for the arrival of Ozai, before departing back into the sea."
    },
    {
      "body": "Back at the ${link_0}, Azula prepares for her coronation as the new Fire Lord. The ${link_1} tangles her hair as she combs it, and Azula almost chokes on a cherry pit brought by another servant. She banishes ${link_2} for the incident and becomes paranoid of treachery. She orders the ${link_3} to come to her for questioning, but they arrive late and she banishes them. Her delusions cause her to continue banishing people until her advisors, ${link_4}, try to persuade her to stop, though this only angers her. As punishment, she banishes one of the twins, not knowing or caring which one. Azula's hair is still tangled, and she tries to fix it herself in a mirror. As Azula looks into the mirror, she sees her mother ${link_5} reflected behind her, telling her she would not miss her own daughter's coronation as Fire Lord. Ursa says Azula's use of fear to control people has left her confused, but Azula says she had no other choice and even her own mother fears her. Ursa denies this and says she really loves her. Enraged, Azula throws her comb into her mother's reflection and discovers Ursa was never really there at all. Azula's coronation begins, though there are few attendants since she has banished so many people, and her hair is still a mess. Before the ${link_6} can place the crown upon her head and declare her Fire Lord, Zuko arrives with Katara and says he, not her, shall become Fire Lord. Azula challenges Zuko to an ${link_7} for ownership over the crown.",
      "links": [
        {
          "body": "Fire Nation Royal Palace",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_Royal_Palace",
            "page": "Fire_Nation_Royal_Palace"
          }
        },
        {
          "body": "princess' royal servant",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Royal_servants",
            "page": "Royal_servants"
          }
        },
        {
          "body": "the servant",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Banished_servant",
            "page": "Banished_servant"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Lo and Li",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Lo_and_Li",
            "page": "Lo_and_Li"
          }
        },
        {
          "body": "Ursa",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Ursa",
            "page": "Ursa"
          }
        },
        {
          "body": "Fire Sages",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Agni_Kai",
            "page": "Agni_Kai"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "Reunion of Zuko and Iroh"
      ],
      "text": "Back at the Fire Nation Royal Palace, Azula prepares for her coronation as the new Fire Lord. The princess' royal servant tangles her hair as she combs it, and Azula almost chokes on a cherry pit brought by another servant. She banishes the servant for the incident and becomes paranoid of treachery. She orders the Dai Li to come to her for questioning, but they arrive late and she banishes them. Her delusions cause her to continue banishing people until her advisors, Lo and Li, try to persuade her to stop, though this only angers her. As punishment, she banishes one of the twins, not knowing or caring which one. Azula's hair is still tangled, and she tries to fix it herself in a mirror. As Azula looks into the mirror, she sees her mother Ursa reflected behind her, telling her she would not miss her own daughter's coronation as Fire Lord. Ursa says Azula's use of fear to control people has left her confused, but Azula says she had no other choice and even her own mother fears her. Ursa denies this and says she really loves her. Enraged, Azula throws her comb into her mother's reflection and discovers Ursa was never really there at all. Azula's coronation begins, though there are few attendants since she has banished so many people, and her hair is still a mess. Before the Fire Sages can place the crown upon her head and declare her Fire Lord, Zuko arrives with Katara and says he, not her, shall become Fire Lord. Azula challenges Zuko to an Agni Kai for ownership over the crown."
    },
    {
      "body": "Sokka, Toph, and ${link_0} arrive before the fleet of ${link_1} just as Sozin's Comet appears in the sky. Toph ${link_2} them onto the airship closest to them, and uses ${link_3} to disable ${link_4} and crew. They take control of the airship and aim for ${link_5}, but are too late. Ozai uses the comet's power to begin to scorch the Earth Kingdom below with an amazing display of firebending. Aang appears and disables Ozai's flagship with earthbending and Sokka, Suki and Toph go on to take out the rest of the airships in the fleet. Everything goes well until they fall off their airship onto another full of firebenders. Sokka's leg is injured. Sokka rescues Toph as she dangles on the edge of a platform, sacrificing his ${link_6} and ${link_7}, though more firebenders keep coming after them. They are saved at last by Suki, who had commandeered another airship.",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Fire Nation airships",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        },
        {
          "body": "earthbends",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "metalbending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "the captain",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_airship_captain",
            "page": "Fire_Nation_airship_captain"
          }
        },
        {
          "body": "Ozai's flagship",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai%27s_personal_airship",
            "page": "Ozai%27s_personal_airship"
          }
        },
        {
          "body": "boomerang",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka%27s_weapons#Boomerang",
            "page": "Sokka%27s_weapons"
          }
        },
        {
          "body": "space sword",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka%27s_sword",
            "page": "Sokka%27s_sword"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "Reunion of Zuko and Iroh"
      ],
      "text": "Sokka, Toph, and Suki arrive before the fleet of Fire Nation airships just as Sozin's Comet appears in the sky. Toph earthbends them onto the airship closest to them, and uses metalbending to disable the captain and crew. They take control of the airship and aim for Ozai's flagship, but are too late. Ozai uses the comet's power to begin to scorch the Earth Kingdom below with an amazing display of firebending. Aang appears and disables Ozai's flagship with earthbending and Sokka, Suki and Toph go on to take out the rest of the airships in the fleet. Everything goes well until they fall off their airship onto another full of firebenders. Sokka's leg is injured. Sokka rescues Toph as she dangles on the edge of a platform, sacrificing his boomerang and space sword, though more firebenders keep coming after them. They are saved at last by Suki, who had commandeered another airship."
    },
    {
      "body": "Now stripped of his ship, Ozai begins to attack the Avatar with furiously strong and powerful firebending, but Aang pleads for him to stop the war. Ozai merely mocks his efforts and resumes his attacks, which Aang barely manages to avoid. All of Aang's bending proves useless against Ozai's amazingly strengthened and enhanced firebending, and growing tired of Aang evading all his attacks, Ozai unleashes an exceedingly strongly and powerfully enhanced strike of lightning at the Avatar. Aang manages to catch the lightning, to Ozai's surprise, and Aang prepares to send it right back at him. However, still not wanting to kill Ozai, he instead redirects it into the sky. Ozai takes advantage of Aang's mercy and successfully hits him with a blast of firebending.",
      "links": [],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "Final battle"
      ],
      "text": "Now stripped of his ship, Ozai begins to attack the Avatar with furiously strong and powerful firebending, but Aang pleads for him to stop the war. Ozai merely mocks his efforts and resumes his attacks, which Aang barely manages to avoid. All of Aang's bending proves useless against Ozai's amazingly strengthened and enhanced firebending, and growing tired of Aang evading all his attacks, Ozai unleashes an exceedingly strongly and powerfully enhanced strike of lightning at the Avatar. Aang manages to catch the lightning, to Ozai's surprise, and Aang prepares to send it right back at him. However, still not wanting to kill Ozai, he instead redirects it into the sky. Ozai takes advantage of Aang's mercy and successfully hits him with a blast of firebending."
    },
    {
      "body": "Zuko begins his fight with Azula as Katara watches from the sidelines. Azula's attacks are fierce and unrestrained, but Zuko holds his ground. As it begins to appear like Zuko will win the duel, he taunts Azula for not using lightning because she is afraid he will redirect it back at her. Azula says she will show him lightning, and sends a blast at Katara. Zuko shields her from the lightning and is gravely injured, but before Katara can begin healing him, Azula begins to attack her furiously with a combination of greatly strengthened and enhanced firebending and lightning. Katara is hard-pressed for a source of water to bend, as Azula continuously blocks her way. Eventually she discovers water underneath the plaza, and Katara lures Azula into position. She traps Azula inside a large bubble of solid ice and binds her with chains. With Azula defeated, Katara heals Zuko, and as he thanks her, she says she should be thanking him for saving her from certain death.",
      "links": [],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "Final battle"
      ],
      "text": "Zuko begins his fight with Azula as Katara watches from the sidelines. Azula's attacks are fierce and unrestrained, but Zuko holds his ground. As it begins to appear like Zuko will win the duel, he taunts Azula for not using lightning because she is afraid he will redirect it back at her. Azula says she will show him lightning, and sends a blast at Katara. Zuko shields her from the lightning and is gravely injured, but before Katara can begin healing him, Azula begins to attack her furiously with a combination of greatly strengthened and enhanced firebending and lightning. Katara is hard-pressed for a source of water to bend, as Azula continuously blocks her way. Eventually she discovers water underneath the plaza, and Katara lures Azula into position. She traps Azula inside a large bubble of solid ice and binds her with chains. With Azula defeated, Katara heals Zuko, and as he thanks her, she says she should be thanking him for saving her from certain death."
    },
    {
      "body": "Aang manages to recover from the attack and earthbends a solid stone sphere around himself to buy time to think about how to defeat the Fire Lord without taking his life. Ozai's firebending overwhelms his stone sphere, and Aang nearly loses consciousness from the heat, until he hits the scar on his back against a jagged rock. The seventh ${link_0} finally opens and he enters the Avatar State, this time all of its incredible power is under his control. While in the ${link_1}, he easily shrugs off Ozai's attacks and traps him with earthbending. The collective Avatar Spirit prepares to kill Ozai, but Aang resists and gains control again. Ozai taunts him for his weakness and tries to attack Aang again, but he is quickly disabled and imprisoned with earthbending. Aang finally understands what the lion turtle meant and uses ${link_2} to strip Ozai of his innate natural firebending powers and abilities for good.",
      "links": [
        {
          "body": "chakra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Chakras",
            "page": "Chakras"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "energybending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Energybending",
            "page": "Energybending"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "Final battle"
      ],
      "text": "Aang manages to recover from the attack and earthbends a solid stone sphere around himself to buy time to think about how to defeat the Fire Lord without taking his life. Ozai's firebending overwhelms his stone sphere, and Aang nearly loses consciousness from the heat, until he hits the scar on his back against a jagged rock. The seventh chakra finally opens and he enters the Avatar State, this time all of its incredible power is under his control. While in the Avatar State, he easily shrugs off Ozai's attacks and traps him with earthbending. The collective Avatar Spirit prepares to kill Ozai, but Aang resists and gains control again. Ozai taunts him for his weakness and tries to attack Aang again, but he is quickly disabled and imprisoned with earthbending. Aang finally understands what the lion turtle meant and uses energybending to strip Ozai of his innate natural firebending powers and abilities for good."
    },
    {
      "body": "With the fleet immobilized, Aang, Sokka, Toph, and Suki return to the Fire Nation to meet Zuko and Katara. Everyone is freed from prison, Sokka and Katara are reunited with ${link_0}, Toph is reunited with ${link_1} and ${link_2}, and ${link_3} joins the ${link_4}. ${link_5} smiles as she is reunited with Zuko, and his coronation as the new Fire Lord begins. The Earth Kingdom forces, with help from the Order of the White Lotus, liberate the Earth Kingdom, and Fire Lord Zuko announces the end of the war and the start of an era of love and peace.",
      "links": [
        {
          "body": "their father",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "The Hippo",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/The_Big_Bad_Hippo",
            "page": "The_Big_Bad_Hippo"
          }
        },
        {
          "body": "The Boulder",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/The_Boulder",
            "page": "The_Boulder"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Mai",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Mai",
            "page": "Mai"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "Final battle"
      ],
      "text": "With the fleet immobilized, Aang, Sokka, Toph, and Suki return to the Fire Nation to meet Zuko and Katara. Everyone is freed from prison, Sokka and Katara are reunited with their father, Toph is reunited with The Hippo and The Boulder, and Ty Lee joins the Kyoshi Warriors. Mai smiles as she is reunited with Zuko, and his coronation as the new Fire Lord begins. The Earth Kingdom forces, with help from the Order of the White Lotus, liberate the Earth Kingdom, and Fire Lord Zuko announces the end of the war and the start of an era of love and peace."
    },
    {
      "body": "Sometime later, Iroh, Mai, and ${link_0} are at Iroh's teashop, the ${link_1}. Sokka makes a group drawing, although it is not very good. Aang goes out for some fresh air and Katara follows him. They share a tender, loving embrace and in the end, they seal their love with a romantic kiss.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Jasmine Dragon",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "Sozin's Comet Part 1, 2, 3 and 4",
        "Final battle"
      ],
      "text": "Sometime later, Iroh, Mai, and Team Avatar are at Iroh's teashop, the Jasmine Dragon. Sokka makes a group drawing, although it is not very good. Aang goes out for some fresh air and Katara follows him. They share a tender, loving embrace and in the end, they seal their love with a romantic kiss."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "List of Avatar books",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/List_of_Avatar_books",
            "page": "List_of_Avatar_books"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "See also"
      ],
      "text": "List of Avatar books"
    },
    {
      "body": "\"${link_0}\"",
      "links": [
        {
          "body": "Sozin's Comet, Part 1: The Phoenix King",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet%2c_Part_1__The_Phoenix_King",
            "page": "Sozin%27s_Comet%2c_Part_1__The_Phoenix_King"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "See also"
      ],
      "text": "\"Sozin's Comet, Part 1: The Phoenix King\""
    },
    {
      "body": "\"${link_0}\"",
      "links": [
        {
          "body": "Sozin's Comet, Part 2: The Old Masters",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet%2c_Part_2__The_Old_Masters",
            "page": "Sozin%27s_Comet%2c_Part_2__The_Old_Masters"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "See also"
      ],
      "text": "\"Sozin's Comet, Part 2: The Old Masters\""
    },
    {
      "body": "\"${link_0}\"",
      "links": [
        {
          "body": "Sozin's Comet, Part 3: Into the Inferno",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet%2c_Part_3__Into_the_Inferno",
            "page": "Sozin%27s_Comet%2c_Part_3__Into_the_Inferno"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "See also"
      ],
      "text": "\"Sozin's Comet, Part 3: Into the Inferno\""
    },
    {
      "body": "\"${link_0}\"",
      "links": [
        {
          "body": "Sozin's Comet, Part 4: Avatar Aang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet%2c_Part_4__Avatar_Aang",
            "page": "Sozin%27s_Comet%2c_Part_4__Avatar_Aang"
          }
        }
      ],
      "section": [
        "Sozin's Comet: The Final Battle",
        "See also"
      ],
      "text": "\"Sozin's Comet, Part 4: Avatar Aang\""
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Sozin%27s_Comet:_The_Final_Battle",
    "file": "avatar.wikia.com/wiki/Sozin's_Comet__The_Final_Battle.html",
    "page": "Sozin's_Comet__The_Final_Battle",
    "title": "Sozin's Comet: The Final Battle"
  }
}