{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Bending",
      "target": {
        "href": "Category_Bending",
        "page": "Category_Bending"
      }
    },
    {
      "body": "Specialized bending techniques",
      "target": {
        "href": "Category_Specialized_bending_techniques",
        "page": "Category_Specialized_bending_techniques"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} used ${link_1} to manipulate her metal cables.",
      "links": [
        {
          "body": "Lin Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "metalbending",
          "key": "${link_1}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        }
      ],
      "text": "Lin Beifong used metalbending to manipulate her metal cables."
    },
    {
      "body": "Specialized bending techniques are sub-skills that exist within each of the four ${link_0}, of which only skilled benders can take advantage. Each sub-skill requires a different level of mastery over the root element from which it is derived, as its practice often deviates from conventional bending. In some cases, the execution of a technique also requires an understanding of fundamental principles from other bending arts.",
      "links": [
        {
          "body": "bending arts",
          "key": "${link_0}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "Specialized bending techniques are sub-skills that exist within each of the four bending arts, of which only skilled benders can take advantage. Each sub-skill requires a different level of mastery over the root element from which it is derived, as its practice often deviates from conventional bending. In some cases, the execution of a technique also requires an understanding of fundamental principles from other bending arts."
    },
    {
      "body": "${link_0} discovered ${link_1} in ${link_2}.",
      "links": [
        {
          "body": "Hama",
          "key": "${link_0}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "bloodbending",
          "key": "${link_1}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "her prison cell",
          "key": "${link_2}",
          "target": {
            "href": "Waterbender_prison",
            "page": "Waterbender_prison"
          }
        }
      ],
      "text": "Hama discovered bloodbending in her prison cell."
    },
    {
      "body": "${link_0} is a sub-skill within waterbending, recognized as the darkest and deadliest of all specialized techniques. It was discovered by ${link_1} during her imprisonment at a ${link_2} designed to detain waterbenders, who realized that all living organisms contain water. The practice of bloodbending essentially allows a user to manipulate the water inside another body, allowing control over a victim's individual movements.",
      "links": [
        {
          "body": "Bloodbending",
          "key": "${link_0}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "Hama",
          "key": "${link_1}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "facility",
          "key": "${link_2}",
          "target": {
            "href": "Waterbender_prison",
            "page": "Waterbender_prison"
          }
        }
      ],
      "text": "Bloodbending is a sub-skill within waterbending, recognized as the darkest and deadliest of all specialized techniques. It was discovered by Hama during her imprisonment at a facility designed to detain waterbenders, who realized that all living organisms contain water. The practice of bloodbending essentially allows a user to manipulate the water inside another body, allowing control over a victim's individual movements."
    },
    {
      "body": "Given its extreme nature, only a handful of waterbenders have demonstrated the ability to bloodbend. Due to the complex and sophisticated nature of the technique, it can typically be performed only during a full moon, when a waterbender's power is at its absolute peak.",
      "links": [],
      "text": "Given its extreme nature, only a handful of waterbenders have demonstrated the ability to bloodbend. Due to the complex and sophisticated nature of the technique, it can typically be performed only during a full moon, when a waterbender's power is at its absolute peak."
    },
    {
      "body": "${link_0}, ${link_1}, and ${link_2} were the only known waterbenders capable of bloodbending without the aid of the full moon; however, they are also the only ones known to have extensively and rigorously trained in the art. Yakone and Amon were also the only waterbenders known to be capable of ${link_3}, which allows a bloodbender to telepathically control their victim with limited movement. As an extremely powerful and gifted waterbender, Amon was able to use bloodbending to ${link_4} by severing active chi paths.",
      "links": [
        {
          "body": "Yakone",
          "key": "${link_0}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_1}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Amon",
          "key": "${link_2}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "psychic bloodbending",
          "key": "${link_3}",
          "target": {
            "href": "Bloodbending#Psychic_bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "take bending away",
          "key": "${link_4}",
          "target": {
            "href": "Bloodbending#Bending_severing",
            "page": "Bloodbending"
          }
        }
      ],
      "text": "Yakone, Tarrlok, and Amon were the only known waterbenders capable of bloodbending without the aid of the full moon; however, they are also the only ones known to have extensively and rigorously trained in the art. Yakone and Amon were also the only waterbenders known to be capable of psychic bloodbending, which allows a bloodbender to telepathically control their victim with limited movement. As an extremely powerful and gifted waterbender, Amon was able to use bloodbending to take bending away by severing active chi paths."
    },
    {
      "body": "${link_0} discovered her ${link_1} abilities after dipping her burnt hands in a lake.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "healing",
          "key": "${link_1}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "Katara discovered her healing abilities after dipping her burnt hands in a lake."
    },
    {
      "body": "Healing is a special ability possessed by some ${link_0} that enables them to heal those who have been wounded, including themselves. This is accomplished by drawing upon the life-giving properties of water, which are used to heal numerous types of physical wounds and illnesses. Healing can also alleviate certain types of stress caused by mental strain. Though the technique is effective in many contexts, it is limited in scope. For example, healing is ineffective in treating birth defects, such as Toph Beifong's blindness or the complications associated with ${link_1} ${link_2}'s birth. In most instances, healing is also ineffectual when treating scars or fatal injuries; ${link_3} was unable to heal the internal injuries sustained by ${link_4} in his ${link_5} with ${link_6}.",
      "links": [
        {
          "body": "waterbenders",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Princess",
          "key": "${link_1}",
          "target": {
            "href": "Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_2}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Jet",
          "key": "${link_4}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        },
        {
          "body": "duel",
          "key": "${link_5}",
          "target": {
            "href": "Duels_(Spring_100_AG)#Duel_in_the_chamber_of_Lake_Laogai",
            "page": "Duels_(Spring_100_AG)"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_6}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        }
      ],
      "text": "Healing is a special ability possessed by some waterbenders that enables them to heal those who have been wounded, including themselves. This is accomplished by drawing upon the life-giving properties of water, which are used to heal numerous types of physical wounds and illnesses. Healing can also alleviate certain types of stress caused by mental strain. Though the technique is effective in many contexts, it is limited in scope. For example, healing is ineffective in treating birth defects, such as Toph Beifong's blindness or the complications associated with Princess Yue's birth. In most instances, healing is also ineffectual when treating scars or fatal injuries; Katara was unable to heal the internal injuries sustained by Jet in his duel with Long Feng."
    },
    {
      "body": "Healing can also be used to detect areas in the body where ${link_0} flow is blocked, as displayed by Katara when she sensed the energy locked within ${link_1}'s ${link_2} during a healing session. That said, healing cannot undo a ${link_3} to a bender's chi. Moreover, it cannot restore bending after it has been severed through bloodbending, even if the healer is proficient in the technique's practice.",
      "links": [
        {
          "body": "chi",
          "key": "${link_0}",
          "target": {
            "href": "Chi",
            "page": "Chi"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "chakra",
          "key": "${link_2}",
          "target": {
            "href": "Chakras",
            "page": "Chakras"
          }
        },
        {
          "body": "blockage",
          "key": "${link_3}",
          "target": {
            "href": "Chi_blocking",
            "page": "Chi_blocking"
          }
        }
      ],
      "text": "Healing can also be used to detect areas in the body where chi flow is blocked, as displayed by Katara when she sensed the energy locked within Aang's chakra during a healing session. That said, healing cannot undo a blockage to a bender's chi. Moreover, it cannot restore bending after it has been severed through bloodbending, even if the healer is proficient in the technique's practice."
    },
    {
      "body": "The healing abilities of a waterbender can also be affected by the water they use. Water from the ${link_0} has special properties that can heal wounds otherwise unaffected by regular water, such as the fatal wounds Aang sustained at the hands of ${link_1} during their ${link_2}.",
      "links": [
        {
          "body": "Spirit Oasis",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "battle",
          "key": "${link_2}",
          "target": {
            "href": "Duels_(Spring_100_AG)#Battle_in_the_Crystal_Catacombs",
            "page": "Duels_(Spring_100_AG)"
          }
        }
      ],
      "text": "The healing abilities of a waterbender can also be affected by the water they use. Water from the Spirit Oasis has special properties that can heal wounds otherwise unaffected by regular water, such as the fatal wounds Aang sustained at the hands of Azula during their battle."
    },
    {
      "body": "${link_0} used spiritbending to purify ${link_1}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "dark bat spirits",
          "key": "${link_1}",
          "target": {
            "href": "Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "text": "Korra used spiritbending to purify dark bat spirits."
    },
    {
      "body": "Spiritbending is a variation of the healing technique which allows the user to instill a balance or an imbalance within spirits. It was invented by ${link_0}, who successfully taught it to ${link_1}. To perform the technique, a waterbender encircles the spirit with a thin stream of water, which begins to glow when the technique is taking effect. When used to change a spirit's negative energy into positive energy, the water, followed by the spirit, will begin to glow a golden light, at which point the spirit dissipates or assumes a pacified form. When the technique is used to change positive energy into negative energy, the water and spirit emanate a purple light. When used against humans, this variation has the potential to destroy their souls.",
      "links": [
        {
          "body": "Unalaq",
          "key": "${link_0}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Spiritbending is a variation of the healing technique which allows the user to instill a balance or an imbalance within spirits. It was invented by Unalaq, who successfully taught it to Korra. To perform the technique, a waterbender encircles the spirit with a thin stream of water, which begins to glow when the technique is taking effect. When used to change a spirit's negative energy into positive energy, the water, followed by the spirit, will begin to glow a golden light, at which point the spirit dissipates or assumes a pacified form. When the technique is used to change positive energy into negative energy, the water and spirit emanate a purple light. When used against humans, this variation has the potential to destroy their souls."
    },
    {
      "body": "However, this technique has not been proven to be effective against spirit vines: when Korra attempted to use in it on the vines that had infested ${link_0}, it dispersed them only momentarily before they surged back, even stronger than before.",
      "links": [
        {
          "body": "Republic City",
          "key": "${link_0}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "text": "However, this technique has not been proven to be effective against spirit vines: when Korra attempted to use in it on the vines that had infested Republic City, it dispersed them only momentarily before they surged back, even stronger than before."
    },
    {
      "body": "${link_0} used ${link_1} to liquefy the earth around him.",
      "links": [
        {
          "body": "Bolin",
          "key": "${link_0}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "lavabending",
          "key": "${link_1}",
          "target": {
            "href": "Lavabending",
            "page": "Lavabending"
          }
        }
      ],
      "text": "Bolin used lavabending to liquefy the earth around him."
    },
    {
      "body": "Lavabending is a rare technique which involves the manipulation of molten rock. The first known user of lavabending was the ${link_0} who preceded ${link_1}, who used it to cause the simultaneous eruption of four small volcanoes.",
      "links": [
        {
          "body": "Fire Nation Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Yangchen%27s_predecessor",
            "page": "Yangchen%27s_predecessor"
          }
        },
        {
          "body": "Yangchen",
          "key": "${link_1}",
          "target": {
            "href": "Yangchen",
            "page": "Yangchen"
          }
        }
      ],
      "text": "Lavabending is a rare technique which involves the manipulation of molten rock. The first known user of lavabending was the Fire Nation Avatar who preceded Yangchen, who used it to cause the simultaneous eruption of four small volcanoes."
    },
    {
      "body": "Centuries later, ${link_0} utilized the technique to split her ${link_1} from the Earth Kingdom mainland. ${link_2} used lavabending on three different occasions: in 55 BG, he caused a volcano to erupt at the ${link_3} on ${link_4}; in 12 BG, he employed this technique while working with ${link_5} to save his home island; and in 99 AG, he used lavabending to destroy the Fire Temple during the ${link_6}.",
      "links": [
        {
          "body": "Kyoshi",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        },
        {
          "body": "peninsula",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Fire Temple",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Temple",
            "page": "Fire_Temple"
          }
        },
        {
          "body": "Crescent Island",
          "key": "${link_4}",
          "target": {
            "href": "Crescent_Island",
            "page": "Crescent_Island"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_5}",
          "target": {
            "href": "Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "winter solstice",
          "key": "${link_6}",
          "target": {
            "href": "Winter_solstice",
            "page": "Winter_solstice"
          }
        }
      ],
      "text": "Centuries later, Kyoshi utilized the technique to split her peninsula from the Earth Kingdom mainland. Roku used lavabending on three different occasions: in 55 BG, he caused a volcano to erupt at the Fire Temple on Crescent Island; in 12 BG, he employed this technique while working with Sozin to save his home island; and in 99 AG, he used lavabending to destroy the Fire Temple during the winter solstice."
    },
    {
      "body": "Skilled earthbenders such as ${link_0} are also capable of performing the technique. Using lavabending, Ghazan was able to form shuriken-like lava projectiles that are capable of burning through several mediums, create trails of molten rock to attack his opponents, and otherwise manipulate lava with great dexterity. ${link_1} discovered his aptitude for the skill while he, ${link_2}, ${link_3}, and ${link_4} were escaping from the Northern Air Temple.",
      "links": [
        {
          "body": "Ghazan",
          "key": "${link_0}",
          "target": {
            "href": "Ghazan",
            "page": "Ghazan"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_2}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Asami",
          "key": "${link_3}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_4}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        }
      ],
      "text": "Skilled earthbenders such as Ghazan are also capable of performing the technique. Using lavabending, Ghazan was able to form shuriken-like lava projectiles that are capable of burning through several mediums, create trails of molten rock to attack his opponents, and otherwise manipulate lava with great dexterity. Bolin discovered his aptitude for the skill while he, Mako, Asami, and Tenzin were escaping from the Northern Air Temple."
    },
    {
      "body": "${link_0} is achieved by manipulating the particles of unpurified earth within the material.",
      "links": [
        {
          "body": "Metalbending",
          "key": "${link_0}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        }
      ],
      "text": "Metalbending is achieved by manipulating the particles of unpurified earth within the material."
    },
    {
      "body": "${link_0} is a special set of techniques within ${link_1} which allows an earthbender to indirectly bend processed metals by manipulating the trace amounts of regular earth in them, much as they would bend regular earth. The ability was discovered and later perfected by ${link_2}.",
      "links": [
        {
          "body": "Metalbending",
          "key": "${link_0}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_1}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Toph Beifong",
          "key": "${link_2}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Metalbending is a special set of techniques within earthbending which allows an earthbender to indirectly bend processed metals by manipulating the trace amounts of regular earth in them, much as they would bend regular earth. The ability was discovered and later perfected by Toph Beifong."
    },
    {
      "body": "Through the use of seismic sense, Toph was able to perceive, target, and eventually utilize the trace amounts of earth present in refined metal in order to bend the metal itself. As the technique involves the manipulation of impurities within metal, pure metals such as platinum cannot be bent.",
      "links": [],
      "text": "Through the use of seismic sense, Toph was able to perceive, target, and eventually utilize the trace amounts of earth present in refined metal in order to bend the metal itself. As the technique involves the manipulation of impurities within metal, pure metals such as platinum cannot be bent."
    },
    {
      "body": "After the ${link_0}, Toph opened the ${link_1} to share her knowledge of the technique with the rest of the world; her efforts eventually led to the establishment of Republic City's ${link_2}. Later, Toph's youngest daughter, ${link_3}, founded ${link_4}, a city made entirely of metal, and the majority of its inhabitants practice metalbending.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Beifong Metalbending Academy",
          "key": "${link_1}",
          "target": {
            "href": "Beifong_Metalbending_Academy",
            "page": "Beifong_Metalbending_Academy"
          }
        },
        {
          "body": "Metalbending Police Force",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "Suyin Beifong",
          "key": "${link_3}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "Zaofu",
          "key": "${link_4}",
          "target": {
            "href": "Zaofu",
            "page": "Zaofu"
          }
        }
      ],
      "text": "After the Hundred Year War, Toph opened the Beifong Metalbending Academy to share her knowledge of the technique with the rest of the world; her efforts eventually led to the establishment of Republic City's Metalbending Police Force. Later, Toph's youngest daughter, Suyin Beifong, founded Zaofu, a city made entirely of metal, and the majority of its inhabitants practice metalbending."
    },
    {
      "body": "${link_0} used ${link_1} to detect vibrations through the ground.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "seismic sense",
          "key": "${link_1}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        }
      ],
      "text": "Toph used seismic sense to detect vibrations through the ground."
    },
    {
      "body": "${link_0} is the unique ability to perceive an environment by feeling acute vibrations through the ground. Similar to sonar and echolocation, seismic sense enables the practitioner to detect earthen objects and objects in contact with earth when out of sight. The technique provides a specific map of the user's surroundings, detailed enough so a blind person, such as Toph Beifong, can navigate effortlessly. It can also be used to detect when someone is lying by feeling their heart and breathing rates through the earth.",
      "links": [
        {
          "body": "Seismic sense",
          "key": "${link_0}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        }
      ],
      "text": "Seismic sense is the unique ability to perceive an environment by feeling acute vibrations through the ground. Similar to sonar and echolocation, seismic sense enables the practitioner to detect earthen objects and objects in contact with earth when out of sight. The technique provides a specific map of the user's surroundings, detailed enough so a blind person, such as Toph Beifong, can navigate effortlessly. It can also be used to detect when someone is lying by feeling their heart and breathing rates through the earth."
    },
    {
      "body": "${link_0}, the original earthbenders, use seismic sense as an innate substitute for eyesight, and this technique was adopted by Toph after she observed the badgermoles that lived in the mountains surrounding ${link_1}. In combination with metalbending, this technique can also be applied to metallic surfaces.",
      "links": [
        {
          "body": "Badgermoles",
          "key": "${link_0}",
          "target": {
            "href": "Badgermole",
            "page": "Badgermole"
          }
        },
        {
          "body": "Gaoling",
          "key": "${link_1}",
          "target": {
            "href": "Gaoling",
            "page": "Gaoling"
          }
        }
      ],
      "text": "Badgermoles, the original earthbenders, use seismic sense as an innate substitute for eyesight, and this technique was adopted by Toph after she observed the badgermoles that lived in the mountains surrounding Gaoling. In combination with metalbending, this technique can also be applied to metallic surfaces."
    },
    {
      "body": "${link_0} was able to \"shoot fire from his brain\" as ${link_1} put it.",
      "links": [
        {
          "body": "Combustion Man",
          "key": "${link_0}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Combustion Man was able to \"shoot fire from his brain\" as Sokka put it."
    },
    {
      "body": "Combustionbending is a form of telekinetic firebending. It consists of the ability to channel chi through the forehead, often marked by an intricate third-eye tattoo, superheating the surrounding air and producing a beam of explosive energy capable of immense damage, both in short and long range. Unlike conventional ${link_0}, which produces a flame from the body, the technique instead creates a powerful beam that explodes upon contact with a solid surface. Combustionbending can instantaneously evaporate large bodies of water, shatter massive rock formations, and counter fire attacks, as demonstrated by ${link_1} when he stopped ${link_2}'s fire shield during a brief altercation at the ${link_3}. ${link_4} has also demonstrated that it is possible to curve the beams.",
      "links": [
        {
          "body": "firebending",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Combustion Man",
          "key": "${link_1}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_2}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_3}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_4}",
          "target": {
            "href": "P%27Li",
            "page": "P%27Li"
          }
        }
      ],
      "text": "Combustionbending is a form of telekinetic firebending. It consists of the ability to channel chi through the forehead, often marked by an intricate third-eye tattoo, superheating the surrounding air and producing a beam of explosive energy capable of immense damage, both in short and long range. Unlike conventional firebending, which produces a flame from the body, the technique instead creates a powerful beam that explodes upon contact with a solid surface. Combustionbending can instantaneously evaporate large bodies of water, shatter massive rock formations, and counter fire attacks, as demonstrated by Combustion Man when he stopped Zuko's fire shield during a brief altercation at the Western Air Temple. P'Li has also demonstrated that it is possible to curve the beams."
    },
    {
      "body": "Combustionbending requires good chi flow and a properly calibrated focus in order to be effective, as disrupting it can have fatal consequences, as demonstrated when Sokka hit Combustion Man's third eye mark with his ${link_0}. Despite superheating the air directly around the practitioner, the technique does not appear to harm the user unless the explosion occurs in the immediate vicinity. If a combustionbender uses this skill and the fire beam explodes too close to the user of this skill, it could prove fatal, such as when P'Li's combustion beam was contained within a makeshift box made from Suyin Beifong's armor, causing the explosion to occur just centimeters away from her head or when Combustion Man was unable to control his ability and blew his right arm and leg off.",
      "links": [
        {
          "body": "boomerang",
          "key": "${link_0}",
          "target": {
            "href": "Sokka%27s_weapons#Boomerang",
            "page": "Sokka%27s_weapons"
          }
        }
      ],
      "text": "Combustionbending requires good chi flow and a properly calibrated focus in order to be effective, as disrupting it can have fatal consequences, as demonstrated when Sokka hit Combustion Man's third eye mark with his boomerang. Despite superheating the air directly around the practitioner, the technique does not appear to harm the user unless the explosion occurs in the immediate vicinity. If a combustionbender uses this skill and the fire beam explodes too close to the user of this skill, it could prove fatal, such as when P'Li's combustion beam was contained within a makeshift box made from Suyin Beifong's armor, causing the explosion to occur just centimeters away from her head or when Combustion Man was unable to control his ability and blew his right arm and leg off."
    },
    {
      "body": "There have only been two known practitioners of this technique, namely Combustion Man and P'Li.",
      "links": [],
      "text": "There have only been two known practitioners of this technique, namely Combustion Man and P'Li."
    },
    {
      "body": "${link_0} was capable of ${link_1}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "generating lightning",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        }
      ],
      "text": "Azula was capable of generating lightning."
    },
    {
      "body": "${link_0} is a sub-skill of firebending that allows a firebender to produce and guide a bolt of lightning from their fingertips. Physically, generating lightning involves a circular motion with the arms. Mentally, it involves a complete absence of emotion as well as peace of mind, thus allowing an individual to separate the energies of yin and yang, also interpreted as positive and negative electrical potential, respectively. When the forces collide, the bender guides rather than controls the lightning's direction. This process is taxing on a bender's chi reserves, due to its complexity.",
      "links": [
        {
          "body": "Lightning generation",
          "key": "${link_0}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        }
      ],
      "text": "Lightning generation is a sub-skill of firebending that allows a firebender to produce and guide a bolt of lightning from their fingertips. Physically, generating lightning involves a circular motion with the arms. Mentally, it involves a complete absence of emotion as well as peace of mind, thus allowing an individual to separate the energies of yin and yang, also interpreted as positive and negative electrical potential, respectively. When the forces collide, the bender guides rather than controls the lightning's direction. This process is taxing on a bender's chi reserves, due to its complexity."
    },
    {
      "body": "Lightning attacks usually take much longer time to initiate than standard fire attacks. That said, certain firebenders, including ${link_0}, ${link_1}, and Mako, are able to generate lightning at extremely high speeds. The electric arc produced by this technique can be maintained for several seconds, during which time the lightning can be swept about to produce widespread damage. The charge, and thus the damage, of a lightning strike can be regulated, as Mako was capable of firing a blast strong enough to incapacitate Amon, but otherwise leave him unharmed.",
      "links": [
        {
          "body": "Ozai",
          "key": "${link_0}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Lightning Bolt Zolt",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_Bolt_Zolt",
            "page": "Lightning_Bolt_Zolt"
          }
        }
      ],
      "text": "Lightning attacks usually take much longer time to initiate than standard fire attacks. That said, certain firebenders, including Ozai, Lightning Bolt Zolt, and Mako, are able to generate lightning at extremely high speeds. The electric arc produced by this technique can be maintained for several seconds, during which time the lightning can be swept about to produce widespread damage. The charge, and thus the damage, of a lightning strike can be regulated, as Mako was capable of firing a blast strong enough to incapacitate Amon, but otherwise leave him unharmed."
    },
    {
      "body": "Prior to the end of the Hundred Year War, only three firebenders were known to be capable of generating lightning: Azula, Ozai, and ${link_0}. However, the use of the technique had become more common by 170 ${link_1}, particularly in Republic City, where it is used to generate power for the industrial sector, though still not widespread.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "AG",
          "key": "${link_1}",
          "target": {
            "href": "History_of_the_World_of_Avatar",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "Prior to the end of the Hundred Year War, only three firebenders were known to be capable of generating lightning: Azula, Ozai, and Iroh. However, the use of the technique had become more common by 170 AG, particularly in Republic City, where it is used to generate power for the industrial sector, though still not widespread."
    },
    {
      "body": "${link_0} was capable of ${link_1}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "redirecting lightning",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "text": "Iroh was capable of redirecting lightning."
    },
    {
      "body": "${link_0} is a sub-skill of firebending that allows a firebender to absorb lightning into their body as energy and release it in a more desirable direction. The technique was developed by Iroh after he studied master waterbenders redirecting force rather than opposing it head-on. The person redirecting it must create a pathway from their fingertip, up the arm to the stomach, and up and out the other arm. It is essential that the lightning pass through the stomach, because if the lightning passes through the heart, the effects could be fatal. Lightning can be successfully redirected regardless of whether the source is natural or generated.",
      "links": [
        {
          "body": "Lightning redirection",
          "key": "${link_0}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "text": "Lightning redirection is a sub-skill of firebending that allows a firebender to absorb lightning into their body as energy and release it in a more desirable direction. The technique was developed by Iroh after he studied master waterbenders redirecting force rather than opposing it head-on. The person redirecting it must create a pathway from their fingertip, up the arm to the stomach, and up and out the other arm. It is essential that the lightning pass through the stomach, because if the lightning passes through the heart, the effects could be fatal. Lightning can be successfully redirected regardless of whether the source is natural or generated."
    },
    {
      "body": "Prior to the end of the Hundred Year War, only three individuals were known to be capable of redirecting lightning: Iroh, Zuko, and Aang. However, knowledge of the skill had become more widespread throughout Republic City by 170 AG. Mako used lightning redirection while battling a ${link_0} during the ${link_1}, using the technique to redirect an electric charge released by an electric grapple the tank had fired.",
      "links": [
        {
          "body": "mecha tank",
          "key": "${link_0}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "battle for Republic City",
          "key": "${link_1}",
          "target": {
            "href": "Battle_for_Republic_City",
            "page": "Battle_for_Republic_City"
          }
        }
      ],
      "text": "Prior to the end of the Hundred Year War, only three individuals were known to be capable of redirecting lightning: Iroh, Zuko, and Aang. However, knowledge of the skill had become more widespread throughout Republic City by 170 AG. Mako used lightning redirection while battling a mecha tank during the battle for Republic City, using the technique to redirect an electric charge released by an electric grapple the tank had fired."
    },
    {
      "body": "Upon unlocking the secret to weightlessness, ${link_0} was able to become one with the wind and perform true unassisted flight.",
      "links": [
        {
          "body": "Zaheer",
          "key": "${link_0}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        }
      ],
      "text": "Upon unlocking the secret to weightlessness, Zaheer was able to become one with the wind and perform true unassisted flight."
    },
    {
      "body": "Flight is a complex and extremely rare skill that has only ever been demonstrated by two known ${link_0}, Guru ${link_1} and ${link_2}. It was such a unique ability, that it was believed to only exist in legends. It is achievable through a complete denouncement of all earthly desires, which results in true freedom. Zaheer was only able to fly after witnessing P'Li, his girlfriend, die. The principle behind flight is to become one with the wind, mimicking its freedom from limitations and inhibitions, in both the physical and mental sense. Once an airbender has embraced these principles, they can fly and hover. However, the bender is still at the mercy of the surrounding environment, as observed by Zaheer being ensnared in a tornado created by ${link_3} and other airbenders while he tried to escape with Korra.",
      "links": [
        {
          "body": "airbenders",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Laghima",
          "key": "${link_1}",
          "target": {
            "href": "Laghima",
            "page": "Laghima"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_2}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_3}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        }
      ],
      "text": "Flight is a complex and extremely rare skill that has only ever been demonstrated by two known airbenders, Guru Laghima and Zaheer. It was such a unique ability, that it was believed to only exist in legends. It is achievable through a complete denouncement of all earthly desires, which results in true freedom. Zaheer was only able to fly after witnessing P'Li, his girlfriend, die. The principle behind flight is to become one with the wind, mimicking its freedom from limitations and inhibitions, in both the physical and mental sense. Once an airbender has embraced these principles, they can fly and hover. However, the bender is still at the mercy of the surrounding environment, as observed by Zaheer being ensnared in a tornado created by Jinora and other airbenders while he tried to escape with Korra."
    },
    {
      "body": "${link_0} used a ${link_1} to explore ${link_2}.",
      "links": [
        {
          "body": "Jinora",
          "key": "${link_0}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "spiritual projection",
          "key": "${link_1}",
          "target": {
            "href": "Spiritual_projection",
            "page": "Spiritual_projection"
          }
        },
        {
          "body": "Lake Laogai",
          "key": "${link_2}",
          "target": {
            "href": "Lake_Laogai",
            "page": "Lake_Laogai"
          }
        }
      ],
      "text": "Jinora used a spiritual projection to explore Lake Laogai."
    },
    {
      "body": "${link_0} is a complex technique that requires a heightened sense of spirituality, allowing one's spirit to move through the physical realm in an intangible form unbound by a corporeal body. In order to create a projection successfully, a user must be in a silent environment free from distractions, as the use of the technique requires immense focus. Spiritual projections allow users to explore their immediate surroundings, bypassing physical barriers and different mediums to search through walls as well as underwater. In addition, the technique can also be used to locate specific individuals with whom the user has a strong connection, through focusing on the bond between them. Jinora is the only known practitioner of this technique.",
      "links": [
        {
          "body": "Spiritual projection",
          "key": "${link_0}",
          "target": {
            "href": "Spiritual_projection",
            "page": "Spiritual_projection"
          }
        }
      ],
      "text": "Spiritual projection is a complex technique that requires a heightened sense of spirituality, allowing one's spirit to move through the physical realm in an intangible form unbound by a corporeal body. In order to create a projection successfully, a user must be in a silent environment free from distractions, as the use of the technique requires immense focus. Spiritual projections allow users to explore their immediate surroundings, bypassing physical barriers and different mediums to search through walls as well as underwater. In addition, the technique can also be used to locate specific individuals with whom the user has a strong connection, through focusing on the bond between them. Jinora is the only known practitioner of this technique."
    },
    {
      "body": "Spiritual projections are most powerful during times of increased spiritual energy in the atmosphere, such as during ${link_0}. When used during these occasions, spiritual projections can be maintained for longer periods of time and manifest more clearly, resulting in more distinct apparitions.",
      "links": [
        {
          "body": "Harmonic Convergence",
          "key": "${link_0}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        }
      ],
      "text": "Spiritual projections are most powerful during times of increased spiritual energy in the atmosphere, such as during Harmonic Convergence. When used during these occasions, spiritual projections can be maintained for longer periods of time and manifest more clearly, resulting in more distinct apparitions."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Specialized_bending_techniques",
    "file": "avatar.wikia.com/wiki/Specialized_bending_techniques.html",
    "page": "Specialized_bending_techniques",
    "title": "Specialized bending techniques"
  }
}