{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Events",
      "target": {
        "href": "Category_Events",
        "page": "Category_Events"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Spirit World",
      "target": {
        "href": "Category_Spirit_World",
        "page": "Category_Spirit_World"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "href": "Category_Spirituality",
        "page": "Category_Spirituality"
      }
    },
    {
      "body": "Water Tribes",
      "target": {
        "href": "Category_Water_Tribes",
        "page": "Category_Water_Tribes"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The southern lights illuminate the sky above the ${link_0}.",
      "links": [
        {
          "body": "Southern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "The southern lights illuminate the sky above the Southern Water Tribe."
    },
    {
      "body": "The spirit lights refer to the light displays that occur in the sky overhead both the ${link_0} and ${link_1}. They are recognized to be peaceful spirits dancing in the sky that light up the night when the entities are in balance. They serve as a reminder to the people of the ${link_2} of their connection to the spirits. If the physical world becomes out of balance with the ${link_3}, as was the case in the ${link_4} following the ${link_5}, the connection with spirits is lost and the lights will cease to appear until balance is restored.",
      "links": [
        {
          "body": "North",
          "key": "${link_0}",
          "target": {
            "href": "North_Pole",
            "page": "North_Pole"
          }
        },
        {
          "body": "South Poles",
          "key": "${link_1}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Water Tribes",
          "key": "${link_2}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_4}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_5}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "The spirit lights refer to the light displays that occur in the sky overhead both the North and South Poles. They are recognized to be peaceful spirits dancing in the sky that light up the night when the entities are in balance. They serve as a reminder to the people of the Water Tribes of their connection to the spirits. If the physical world becomes out of balance with the Spirit World, as was the case in the Southern Water Tribe following the Hundred Year War, the connection with spirits is lost and the lights will cease to appear until balance is restored."
    },
    {
      "body": "The northern lights illuminate the ${link_0} at night.",
      "links": [
        {
          "body": "North Pole",
          "key": "${link_0}",
          "target": {
            "href": "North_Pole",
            "page": "North_Pole"
          }
        }
      ],
      "text": "The northern lights illuminate the North Pole at night."
    },
    {
      "body": "The northern lights are visible in the North Pole, where spiritual energy is considerably strong, due to the ${link_0}'s adherence to spiritual observances. Shortly after 133 ${link_1}, ${link_2} began to ${link_3} ${link_4} and ${link_5} in the art of ${link_6}, often running exercises at night when the northern lights were visible.",
      "links": [
        {
          "body": "Northern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "AG",
          "key": "${link_1}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Yakone",
          "key": "${link_2}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        },
        {
          "body": "train",
          "key": "${link_3}",
          "target": {
            "href": "Waterbending_training",
            "page": "Waterbending_training"
          }
        },
        {
          "body": "Noatak",
          "key": "${link_4}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_5}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_6}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "The northern lights are visible in the North Pole, where spiritual energy is considerably strong, due to the Northern Water Tribe's adherence to spiritual observances. Shortly after 133 AG, Yakone began to train Noatak and Tarrlok in the art of waterbending, often running exercises at night when the northern lights were visible."
    },
    {
      "body": "During the Hundred Year War, the Southern Water Tribe was devastated by constant ${link_0} instituted by the ${link_1}, leading to the near eradication of its distinct bending culture and the loss of the tribe's spiritual traditions. The tribe was consequently thrown out of balance and the southern lights disappeared.",
      "links": [
        {
          "body": "raids",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe_raids",
            "page": "Southern_Water_Tribe_raids"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "During the Hundred Year War, the Southern Water Tribe was devastated by constant raids instituted by the Fire Nation, leading to the near eradication of its distinct bending culture and the loss of the tribe's spiritual traditions. The tribe was consequently thrown out of balance and the southern lights disappeared."
    },
    {
      "body": "The spirit forest from which the southern lights originated was left frozen as the ${link_0} fell into spiritual imbalance.",
      "links": [
        {
          "body": "Southern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "The spirit forest from which the southern lights originated was left frozen as the Southern Water Tribe fell into spiritual imbalance."
    },
    {
      "body": "After the war ended, the Northern Water Tribe helped rebuild their sister tribe physically but failed to arrest the spiritual imbalance in the South Pole, causing the Southern Water Tribe to continue down a path of spiritual decay, exhibited in the progressive distortion of the hallowed ${link_0}. In the past, tribal elders communed with the spirits during the festival and watched the brilliant displays of light as the spirits danced in the sky. The people of the South have since turned the festival into a secular carnival, unrelated to its spiritual origins.",
      "links": [
        {
          "body": "Glacier Spirits Festival",
          "key": "${link_0}",
          "target": {
            "href": "Glacier_Spirits_Festival",
            "page": "Glacier_Spirits_Festival"
          }
        }
      ],
      "text": "After the war ended, the Northern Water Tribe helped rebuild their sister tribe physically but failed to arrest the spiritual imbalance in the South Pole, causing the Southern Water Tribe to continue down a path of spiritual decay, exhibited in the progressive distortion of the hallowed Glacier Spirits Festival. In the past, tribal elders communed with the spirits during the festival and watched the brilliant displays of light as the spirits danced in the sky. The people of the South have since turned the festival into a secular carnival, unrelated to its spiritual origins."
    },
    {
      "body": "Neglect of spiritual customs in the South caused spirits to cease dancing in the skies, forcing them instead to turn ${link_0}, eventually forming the ${link_1} in which they rampaged. By 171 AG, the imbalance had exacerbated to the point that dark spirits roamed the ${link_2} and attacked several ships, abducting sailors and destroying vessels in the process. These ${link_3} eventually prompted ${link_4} ${link_5} to intervene and journey to the Southern Water Tribe, where he informed ${link_6} ${link_7} of a dormant ${link_8} located at the center of the South Pole. Together with ${link_9}, ${link_10}, ${link_11}, and ${link_12}, they traversed the frozen tundra in hopes of opening the portal prior to end of the ${link_13}, as that was the only time the Southern spirit portal could be opened by the Avatar.",
      "links": [
        {
          "body": "dark",
          "key": "${link_0}",
          "target": {
            "href": "Dark_spirits",
            "page": "Dark_spirits"
          }
        },
        {
          "body": "Everstorm",
          "key": "${link_1}",
          "target": {
            "href": "Everstorm",
            "page": "Everstorm"
          }
        },
        {
          "body": "South Sea",
          "key": "${link_2}",
          "target": {
            "href": "South_Sea",
            "page": "South_Sea"
          }
        },
        {
          "body": "attacks",
          "key": "${link_3}",
          "target": {
            "href": "Dark_spirit_incidents",
            "page": "Dark_spirit_incidents"
          }
        },
        {
          "body": "Chief",
          "key": "${link_4}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_5}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_6}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_7}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_8}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Desna and Eska",
          "key": "${link_9}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_10}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Mako",
          "key": "${link_11}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_12}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "winter solstice",
          "key": "${link_13}",
          "target": {
            "href": "Winter_solstice",
            "page": "Winter_solstice"
          }
        }
      ],
      "text": "Neglect of spiritual customs in the South caused spirits to cease dancing in the skies, forcing them instead to turn dark, eventually forming the Everstorm in which they rampaged. By 171 AG, the imbalance had exacerbated to the point that dark spirits roamed the South Sea and attacked several ships, abducting sailors and destroying vessels in the process. These attacks eventually prompted Chief Unalaq to intervene and journey to the Southern Water Tribe, where he informed Avatar Korra of a dormant spirit portal located at the center of the South Pole. Together with Desna and Eska, Tonraq, Mako, and Bolin, they traversed the frozen tundra in hopes of opening the portal prior to end of the winter solstice, as that was the only time the Southern spirit portal could be opened by the Avatar."
    },
    {
      "body": "${link_0}'s opening of the ${link_1} ${link_2} in 171 ${link_3} allowed the southern lights to return to the sky.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Southern",
          "key": "${link_1}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "AG",
          "key": "${link_3}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "Korra's opening of the Southern spirit portal in 171 AG allowed the southern lights to return to the sky."
    },
    {
      "body": "After the group arrived at the center of the South Pole, Korra ventured inside the frozen forest that circumscribed the portal, where she managed to overcome residing dark spirits and open the portal with a single touch imbued with cosmic energy provided by the ${link_0}. When the portal opened, balance was instantly restored; the Everstorm ceased to rage, and the spirits flew out in a straight beam of light directly above the South Pole until they dispersed in the sky as waving streaks of green, glowing lights.",
      "links": [
        {
          "body": "Avatar State",
          "key": "${link_0}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "After the group arrived at the center of the South Pole, Korra ventured inside the frozen forest that circumscribed the portal, where she managed to overcome residing dark spirits and open the portal with a single touch imbued with cosmic energy provided by the Avatar State. When the portal opened, balance was instantly restored; the Everstorm ceased to rage, and the spirits flew out in a straight beam of light directly above the South Pole until they dispersed in the sky as waving streaks of green, glowing lights."
    },
    {
      "body": "After Korra reconvened with the group outside the frozen forest, Unalaq told her that restoring the southern lights was the first step in bringing balance back to the South.",
      "links": [],
      "text": "After Korra reconvened with the group outside the frozen forest, Unalaq told her that restoring the southern lights was the first step in bringing balance back to the South."
    },
    {
      "body": "Many weeks later, the spirit lights spread throughout the world during ${link_0}. Once Unalaq fused with the dark spirit ${link_1}, the ${link_2} reached toward the southern lights and used them to travel to ${link_3} instantaneously.",
      "links": [
        {
          "body": "Harmonic Convergence",
          "key": "${link_0}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_1}",
          "target": {
            "href": "Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Dark Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Dark_Avatar",
            "page": "Dark_Avatar"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_3}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "text": "Many weeks later, the spirit lights spread throughout the world during Harmonic Convergence. Once Unalaq fused with the dark spirit Vaatu, the Dark Avatar reached toward the southern lights and used them to travel to Republic City instantaneously."
    },
    {
      "body": "After balance was restored following Vaatu's defeat, Korra opted to keep the spirit portals open, and the southern lights were present behind the ${link_0} as she proclaimed the South's autonomy from the North, and a new era for humans and spirits.",
      "links": [
        {
          "body": "Southern Water Tribe Royal Palace",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe_Royal_Palace",
            "page": "Southern_Water_Tribe_Royal_Palace"
          }
        }
      ],
      "text": "After balance was restored following Vaatu's defeat, Korra opted to keep the spirit portals open, and the southern lights were present behind the Southern Water Tribe Royal Palace as she proclaimed the South's autonomy from the North, and a new era for humans and spirits."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Spirit_lights",
    "file": "avatar.wikia.com/wiki/Spirit_lights.html",
    "page": "Spirit_lights",
    "title": "Spirit lights"
  }
}