{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Equipment",
      "target": {
        "external": false,
        "href": "/wiki/Category_Equipment",
        "page": "Category_Equipment"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Military",
      "target": {
        "external": false,
        "href": "/wiki/Category_Military",
        "page": "Category_Military"
      }
    },
    {
      "body": "Objects",
      "target": {
        "external": false,
        "href": "/wiki/Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Vehicles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Vehicles",
        "page": "Category_Vehicles"
      }
    },
    {
      "body": "Weapons",
      "target": {
        "external": false,
        "href": "/wiki/Category_Weapons",
        "page": "Category_Weapons"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The spirit energy cannon was a large ${link_0} developed and used by the ${link_1} to conduct long-range artillery warfare. Firing spirit energy from harvested ${link_2}, it was capable of blasting a hole through a hill and destroying buildings and ships in seconds. Due to its size and weight, the cannon was attached to the right arm of an enormous ${link_3} that stood more than twenty-five stories tall.",
      "links": [
        {
          "body": "weapon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Weaponry_in_the_World_of_Avatar",
            "page": "Weaponry_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Earth Empire",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        },
        {
          "body": "spirit vines",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "mecha suit",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Mecha_suit",
            "page": "Mecha_suit"
          }
        }
      ],
      "section": [
        "Spirit energy cannon"
      ],
      "text": "The spirit energy cannon was a large weapon developed and used by the Earth Empire to conduct long-range artillery warfare. Firing spirit energy from harvested spirit vines, it was capable of blasting a hole through a hill and destroying buildings and ships in seconds. Due to its size and weight, the cannon was attached to the right arm of an enormous mecha suit that stood more than twenty-five stories tall."
    },
    {
      "body": "The technology used to create the cannon was developed by ${link_0} to revolutionize the world's electricity. When he realized ${link_1} intended to use it for military purposes, he wanted to cancel the research, declaring the technology to be too dangerous. Although he defected Kuvira's army and tried to destroy his research, ${link_2} continued the project and manufactured the cannon with the aid of ${link_3}, although she tried to slow down its production by systematically sabotaging it as well.",
      "links": [
        {
          "body": "Varrick",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "Baatar Jr.",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Baatar_Jr",
            "page": "Baatar_Jr"
          }
        },
        {
          "body": "Zhu Li",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "History"
      ],
      "text": "The technology used to create the cannon was developed by Varrick to revolutionize the world's electricity. When he realized Kuvira intended to use it for military purposes, he wanted to cancel the research, declaring the technology to be too dangerous. Although he defected Kuvira's army and tried to destroy his research, Baatar Jr. continued the project and manufactured the cannon with the aid of Zhu Li, although she tried to slow down its production by systematically sabotaging it as well."
    },
    {
      "body": "In 174 ${link_0}, the weapon was assembled at a factory not far from ${link_1}. The day before its official test run in the presence of Kuvira, Baatar Jr. wanted to test the cannon's power core out in private to make sure everything would run smoothly. After Zhu Li initiated phase one, the condenser backed up and he ordered the weapon to be shut down. When the override failed, the cannon was at risk of blowing up, though Baatar Jr. prevented that from happening by manually dismantling part of its circuitry and discovered the malfunction had been caused by a cracked channeling ring. Not taking any chances, he ordered his crew to disassemble the machine in order to check everything for the official test the following day.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Zaofu",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zaofu",
            "page": "Zaofu"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "History"
      ],
      "text": "In 174 AG, the weapon was assembled at a factory not far from Zaofu. The day before its official test run in the presence of Kuvira, Baatar Jr. wanted to test the cannon's power core out in private to make sure everything would run smoothly. After Zhu Li initiated phase one, the condenser backed up and he ordered the weapon to be shut down. When the override failed, the cannon was at risk of blowing up, though Baatar Jr. prevented that from happening by manually dismantling part of its circuitry and discovered the malfunction had been caused by a cracked channeling ring. Not taking any chances, he ordered his crew to disassemble the machine in order to check everything for the official test the following day."
    },
    {
      "body": "The next day, the cannon was presented to all the soldiers and crew present at the factory. When Baatar Jr. fired up the weapon on Kuvira's orders, the machine malfunctioned once more. As he opened up the smoking engine, he quickly deduced that the trouble was caused by a missing distributor pin. After Kuvira discovered Zhu Li had stolen it to sabotage the machine, hoping it would explode, Baatar Jr. put it in place again to resume the test. Just as the cannon was about to fire, ${link_0}, ${link_1}, ${link_2} disrupted its aim by rattling its sides with their ${link_3}, causing it to blast a hole through a hill as opposed to blowing up an abandoned town and Zhu Li, as intended.",
      "links": [
        {
          "body": "Lin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Suyin",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "Wei, and Wing",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Wei_and_Wing",
            "page": "Wei_and_Wing"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "History"
      ],
      "text": "The next day, the cannon was presented to all the soldiers and crew present at the factory. When Baatar Jr. fired up the weapon on Kuvira's orders, the machine malfunctioned once more. As he opened up the smoking engine, he quickly deduced that the trouble was caused by a missing distributor pin. After Kuvira discovered Zhu Li had stolen it to sabotage the machine, hoping it would explode, Baatar Jr. put it in place again to resume the test. Just as the cannon was about to fire, Lin, Suyin, Wei, and Wing disrupted its aim by rattling its sides with their earthbending, causing it to blast a hole through a hill as opposed to blowing up an abandoned town and Zhu Li, as intended."
    },
    {
      "body": "After its successful test, the cannon was attached to the right arm of an enormous mecha suit that stood over twenty-five stories tall, which allowed Kuvira to employ the weapon anywhere she desired. A week after the demonstration, Kuvira piloted the mecha suit and marched it and her army into ${link_0} territory and down to ${link_1}. When reaching a military outpost, she deployed the cannon to destroy the building and the stationed troops there with one shot, preventing them from alerting Republic City of their arrival, which was a week earlier than planned.",
      "links": [
        {
          "body": "United Republic of Nations",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "History"
      ],
      "text": "After its successful test, the cannon was attached to the right arm of an enormous mecha suit that stood over twenty-five stories tall, which allowed Kuvira to employ the weapon anywhere she desired. A week after the demonstration, Kuvira piloted the mecha suit and marched it and her army into United Republic of Nations territory and down to Republic City. When reaching a military outpost, she deployed the cannon to destroy the building and the stationed troops there with one shot, preventing them from alerting Republic City of their arrival, which was a week earlier than planned."
    },
    {
      "body": "When Kuvira and her army were only hours away from Republic City, ${link_0} discovered them. Kuvira tried to take them down, though after two missed shots, she let the team escape, reasoning that with the power of the spirit cannon on her side, nothing and no one could stop them.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "History"
      ],
      "text": "When Kuvira and her army were only hours away from Republic City, Team Avatar discovered them. Kuvira tried to take them down, though after two missed shots, she let the team escape, reasoning that with the power of the spirit cannon on her side, nothing and no one could stop them."
    },
    {
      "body": "Reaching Republic City, Kuvira ignored ${link_0} ${link_1}'s order to retreat, lest the ${link_2} would open fire and used the spirit energy cannon to sink the United Forces' ${link_3}. When Kuvira threatened to kill the infantry with the cannon as well, Raiko surrendered, realizing he could not defend the city against the destructive power of the weapon.",
      "links": [
        {
          "body": "President",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "United Forces",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/United_Forces",
            "page": "United_Forces"
          }
        },
        {
          "body": "battleships",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Battleship",
            "page": "Battleship"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "History"
      ],
      "text": "Reaching Republic City, Kuvira ignored President Raiko's order to retreat, lest the United Forces would open fire and used the spirit energy cannon to sink the United Forces' battleships. When Kuvira threatened to kill the infantry with the cannon as well, Raiko surrendered, realizing he could not defend the city against the destructive power of the weapon."
    },
    {
      "body": "After Korra, ${link_0}, ${link_1}, ${link_2}, and ${link_3} kidnapped Baatar Jr. and successfully forced him to contact Kuvira and try to talk her out out of continuing her conquest of the United Republic, Kuvira traced the ${link_4} signal back to a ${link_5} factory and used the cannon to blow it up, intending to kill all the people present.",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Kai",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Kai",
            "page": "Kai"
          }
        },
        {
          "body": "radio",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Radio",
            "page": "Radio"
          }
        },
        {
          "body": "Future Industries",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries",
            "page": "Future_Industries"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "History"
      ],
      "text": "After Korra, Tenzin, Bumi, Jinora, and Kai kidnapped Baatar Jr. and successfully forced him to contact Kuvira and try to talk her out out of continuing her conquest of the United Republic, Kuvira traced the radio signal back to a Future Industries factory and used the cannon to blow it up, intending to kill all the people present."
    },
    {
      "body": "In an attempt to disable the cannon, ${link_0} was released from prison and helped enhance ${link_1} and ${link_2}'s ${link_3} with special saws that enabled them to cut through platinum. He later sacrificed himself in order to complete cutting a hole into the mecha suit to allow Korra, ${link_4}, ${link_5}, Lin, and Suyin inside. There, the latter two found the cannon mechanism and discover that, while the outside of the mecha suit was platinum, the inner workings of the cannon arm were easily bendable. Kuvira detected their sabotage and detached the cannon arm from the mecha suit after it was rendered useless.",
      "links": [
        {
          "body": "Hiroshi Sato",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "hummingbird mecha suits",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Hummingbird_mecha_suit",
            "page": "Hummingbird_mecha_suit"
          }
        },
        {
          "body": "Mako",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "History"
      ],
      "text": "In an attempt to disable the cannon, Hiroshi Sato was released from prison and helped enhance Asami and Varrick's hummingbird mecha suits with special saws that enabled them to cut through platinum. He later sacrificed himself in order to complete cutting a hole into the mecha suit to allow Korra, Mako, Bolin, Lin, and Suyin inside. There, the latter two found the cannon mechanism and discover that, while the outside of the mecha suit was platinum, the inner workings of the cannon arm were easily bendable. Kuvira detected their sabotage and detached the cannon arm from the mecha suit after it was rendered useless."
    },
    {
      "body": "When the mecha suit was ultimately destroyed, Kuvira fled into the city's Spirit Wilds, where she found her cannon. She attempted to use it in a last ditch attempt to destroy Korra, but as a result of it drawing on all the spirit energy in the city, the weapon began to spin out of control and was unable to be deactivated, throwing Kuvira off. The energy beam was about to hit her when Korra went into the Avatar State and used energybending to block the attack. The resulting reaction caused a massive explosion of spirit energy that devastated the surrounding area and created a new ${link_0}.",
      "links": [
        {
          "body": "spirit portal",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_portal",
            "page": "Spirit_portal"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "History"
      ],
      "text": "When the mecha suit was ultimately destroyed, Kuvira fled into the city's Spirit Wilds, where she found her cannon. She attempted to use it in a last ditch attempt to destroy Korra, but as a result of it drawing on all the spirit energy in the city, the weapon began to spin out of control and was unable to be deactivated, throwing Kuvira off. The energy beam was about to hit her when Korra went into the Avatar State and used energybending to block the attack. The resulting reaction caused a massive explosion of spirit energy that devastated the surrounding area and created a new spirit portal."
    },
    {
      "body": "To fire the cannon, the heavy power core containing a spirit vine sample was mechanically loaded into the barrel and, by running electrical currents through the vines, a focused beam of energy was generated. Although the cannon could contain the immense power of the energy beams, it contained small vital components, like a condenser, channeling ring, and distributor pin, that could cause the entire weapon to overload and explode when they were missing or damaged. To avoid malfunctions, the cannon was equipped with a manual override that can shut it down.",
      "links": [],
      "section": [
        "Spirit energy cannon",
        "Design"
      ],
      "text": "To fire the cannon, the heavy power core containing a spirit vine sample was mechanically loaded into the barrel and, by running electrical currents through the vines, a focused beam of energy was generated. Although the cannon could contain the immense power of the energy beams, it contained small vital components, like a condenser, channeling ring, and distributor pin, that could cause the entire weapon to overload and explode when they were missing or damaged. To avoid malfunctions, the cannon was equipped with a manual override that can shut it down."
    },
    {
      "body": "Due to its immense size and weight, the cannon was attached to the right arm of a mecha suit that stood over twenty-five stories high in order to allow for easy transportation; during the weapon's testing phase, however, it was transported via a rail system. The mecha suit, fashioned out of the metal taken from the domes that previously protected Zaofu, was operated with several levers and turning balls located in its cockpit. The head of the machine also featured scoped sight to facilitate the accuracy when taking aim. Due to the immense power of the spirit energy cannon, the mecha suit stabilized itself by holding its right arm with its left to avoid throwing off the cannon's aim by the weapon's drawback upon being fired.",
      "links": [],
      "section": [
        "Spirit energy cannon",
        "Design"
      ],
      "text": "Due to its immense size and weight, the cannon was attached to the right arm of a mecha suit that stood over twenty-five stories high in order to allow for easy transportation; during the weapon's testing phase, however, it was transported via a rail system. The mecha suit, fashioned out of the metal taken from the domes that previously protected Zaofu, was operated with several levers and turning balls located in its cockpit. The head of the machine also featured scoped sight to facilitate the accuracy when taking aim. Due to the immense power of the spirit energy cannon, the mecha suit stabilized itself by holding its right arm with its left to avoid throwing off the cannon's aim by the weapon's drawback upon being fired."
    },
    {
      "body": "The suit was powered by an immense mass of spirit vines stored within the mobile unit's chest compartment, as opposed to having an electrical core like the smaller mecha suits. As such, the suit was not susceptible to electromagnetic pulse attacks.",
      "links": [],
      "section": [
        "Spirit energy cannon",
        "Design"
      ],
      "text": "The suit was powered by an immense mass of spirit vines stored within the mobile unit's chest compartment, as opposed to having an electrical core like the smaller mecha suits. As such, the suit was not susceptible to electromagnetic pulse attacks."
    },
    {
      "body": "The spirit energy cannon was based on \"${link_0}\", a railway gun used by Nazi Germany in World War II.",
      "links": [
        {
          "body": "Dora",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Schwerer_Gustav#Dora",
            "page": "http://en.wikipedia.org/wiki/Schwerer_Gustav"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "Trivia"
      ],
      "text": "The spirit energy cannon was based on \"Dora\", a railway gun used by Nazi Germany in World War II."
    },
    {
      "body": "The energy beams the cannon fires are similar to ${link_0}'s in color and sound frequency, as well as destructive capability.",
      "links": [
        {
          "body": "Vaatu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Vaatu",
            "page": "Vaatu"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "Trivia"
      ],
      "text": "The energy beams the cannon fires are similar to Vaatu's in color and sound frequency, as well as destructive capability."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Military of the Earth Empire",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "See also"
      ],
      "text": "Military of the Earth Empire"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Technology in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Technology_in_the_World_of_Avatar",
            "page": "Technology_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "See also"
      ],
      "text": "Technology in the World of Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Weaponry in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Weaponry_in_the_World_of_Avatar",
            "page": "Weaponry_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Spirit energy cannon",
        "See also"
      ],
      "text": "Weaponry in the World of Avatar"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Spirit_energy_cannon",
    "file": "avatar.wikia.com/wiki/Spirit_energy_cannon.html",
    "page": "Spirit_energy_cannon",
    "title": "Spirit energy cannon"
  }
}