{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "B-class articles",
      "target": {
        "href": "Category_B-class_articles",
        "page": "Category_B-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Spirit World",
      "target": {
        "href": "Category_Spirit_World",
        "page": "Category_Spirit_World"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "href": "Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "Parallel the ${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "World of Avatar",
              "key": "${link_0}",
              "target": {
                "href": "Earth",
                "page": "Earth"
              }
            }
          ],
          "text": "Parallel the World of Avatar",
          "value": "Parallel the ${link_0}",
          "value_text": "Parallel the World of Avatar"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Winter Solstice, Part 1: The Spirit World",
              "key": "${link_0}",
              "target": {
                "href": "Winter_Solstice%2c_Part_1__The_Spirit_World",
                "page": "Winter_Solstice%2c_Part_1__The_Spirit_World"
              }
            }
          ],
          "text": "\"Winter Solstice, Part 1: The Spirit World\"",
          "value": "\"${link_0}\"",
          "value_text": "\"Winter Solstice, Part 1: The Spirit World\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The Spirit World is a parallel plane of reality that coexists alongside the ${link_0} inhabited by humans. It is home to the spirits, a vast range of immortal, supernatural entities that often embody different aspects of life and nature.",
      "links": [
        {
          "body": "physical world",
          "key": "${link_0}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "The Spirit World is a parallel plane of reality that coexists alongside the physical world inhabited by humans. It is home to the spirits, a vast range of immortal, supernatural entities that often embody different aspects of life and nature."
    },
    {
      "body": "Prior to 171 ${link_0} and the opening of the Northern and Southern ${link_1}, it was extremely difficult and very rare for any human, other than the ${link_2} (who for millennia was known as the \"bridge between the worlds\"), to enter the Spirit World; conversely, only a handful of spirits were capable of assuming physical forms in the mortal world, and doing so required them to give up their immortality.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "spirit portals",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Prior to 171 AG and the opening of the Northern and Southern spirit portals, it was extremely difficult and very rare for any human, other than the Avatar (who for millennia was known as the \"bridge between the worlds\"), to enter the Spirit World; conversely, only a handful of spirits were capable of assuming physical forms in the mortal world, and doing so required them to give up their immortality."
    },
    {
      "body": "The barrier between the Spirit World and the physical world is weakest during the ${link_0} and ${link_1} solstices, which made it possible for spirits to manifest in the physical world and for humans to pass into the Spirit World. There are also certain physical locations in the physical world that can act as bridges to the Spirit World, such as the ${link_2} in the ${link_3}. These locations are often revered by the cultures living near them.",
      "links": [
        {
          "body": "summer",
          "key": "${link_0}",
          "target": {
            "href": "Summer_solstice",
            "page": "Summer_solstice"
          }
        },
        {
          "body": "winter",
          "key": "${link_1}",
          "target": {
            "href": "Winter_solstice",
            "page": "Winter_solstice"
          }
        },
        {
          "body": "Spirit Oasis",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "North Pole",
          "key": "${link_3}",
          "target": {
            "href": "North_Pole",
            "page": "North_Pole"
          }
        }
      ],
      "text": "The barrier between the Spirit World and the physical world is weakest during the summer and winter solstices, which made it possible for spirits to manifest in the physical world and for humans to pass into the Spirit World. There are also certain physical locations in the physical world that can act as bridges to the Spirit World, such as the Spirit Oasis in the North Pole. These locations are often revered by the cultures living near them."
    },
    {
      "body": "In 171 AG, Avatar ${link_0} was tricked and forced into opening the Southern and Northern spirit portals but eventually decided to leave them open, reasoning that humans and spirits were meant to live harmoniously together. In 174 AG, a third spirit portal was accidentally created by an overloaded discharge of energy from the ${link_1}. Its location in the heart of ${link_2} put the already unsteady balance between humans and spirits in danger; some humans feared the spirits, while others wanted to exploit them and the Spirit World by turning the portal into an amusement park from where they could organize tours and excursions into the Spirit World.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "spirit energy cannon",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_energy_cannon",
            "page": "Spirit_energy_cannon"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "text": "In 171 AG, Avatar Korra was tricked and forced into opening the Southern and Northern spirit portals but eventually decided to leave them open, reasoning that humans and spirits were meant to live harmoniously together. In 174 AG, a third spirit portal was accidentally created by an overloaded discharge of energy from the spirit energy cannon. Its location in the heart of Republic City put the already unsteady balance between humans and spirits in danger; some humans feared the spirits, while others wanted to exploit them and the Spirit World by turning the portal into an amusement park from where they could organize tours and excursions into the Spirit World."
    },
    {
      "body": "There are few known ways for humans other than the Avatar to enter into the Spirit World: Sometimes humans are carried there by a spirit as the entity shifts between the worlds. Enlightened individuals can cross over to the Spirit World through meditation, and others can enter physically through one of the three spirit portals. Individuals who cross over to the Spirit World cannot use their ${link_0}, unless they have entered physically through the spirit portals. Despite this, the Avatar is able to use ${link_1} when in the Spirit World, even when they did not enter through a portal, as they are connected to all the spiritual energy when in that world.",
      "links": [
        {
          "body": "bending",
          "key": "${link_0}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "energybending",
          "key": "${link_1}",
          "target": {
            "href": "Energybending",
            "page": "Energybending"
          }
        }
      ],
      "text": "There are few known ways for humans other than the Avatar to enter into the Spirit World: Sometimes humans are carried there by a spirit as the entity shifts between the worlds. Enlightened individuals can cross over to the Spirit World through meditation, and others can enter physically through one of the three spirit portals. Individuals who cross over to the Spirit World cannot use their bending, unless they have entered physically through the spirit portals. Despite this, the Avatar is able to use energybending when in the Spirit World, even when they did not enter through a portal, as they are connected to all the spiritual energy when in that world."
    },
    {
      "body": "During the ${link_0}, the spirit portals at the ${link_1} and ${link_2} were the primary passages between the Spirit and physical worlds, and spirits could migrate freely between the two. After Avatar ${link_3} closed the spirit portals following the ${link_4} of 9,829 BG, travel between the two worlds became extremely restricted, only possible through a few specific locations and methods. As the bridge between the two worlds, the Avatar could cross over in spiritual form in order to converse with the spirits and ask them for guidance. After the opening of the Southern (and later the Northern) spirit portal, humans such as ${link_5} were able to physically enter the Spirit World once again, and brought with them \"darkness and anger\" that threatened to overtake the Spirit World. These negative emotions were amplified during the Harmonic Convergence of 171 AG, when ${link_6} used the increased spiritual energy of the event to break free from his prison inside the ${link_7}. After Vaatu was defeated, Avatar Korra decided to leave the spirit portals open, once again uniting the Spirit and the physical worlds.",
      "links": [
        {
          "body": "Era of Raava",
          "key": "${link_0}",
          "target": {
            "href": "Era_of_Raava",
            "page": "Era_of_Raava"
          }
        },
        {
          "body": "North",
          "key": "${link_1}",
          "target": {
            "href": "North_Pole",
            "page": "North_Pole"
          }
        },
        {
          "body": "South Poles",
          "key": "${link_2}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Wan",
          "key": "${link_3}",
          "target": {
            "href": "Wan",
            "page": "Wan"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_4}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_5}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_6}",
          "target": {
            "href": "Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Tree of Time",
          "key": "${link_7}",
          "target": {
            "href": "Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "text": "During the Era of Raava, the spirit portals at the North and South Poles were the primary passages between the Spirit and physical worlds, and spirits could migrate freely between the two. After Avatar Wan closed the spirit portals following the Harmonic Convergence of 9,829 BG, travel between the two worlds became extremely restricted, only possible through a few specific locations and methods. As the bridge between the two worlds, the Avatar could cross over in spiritual form in order to converse with the spirits and ask them for guidance. After the opening of the Southern (and later the Northern) spirit portal, humans such as Unalaq were able to physically enter the Spirit World once again, and brought with them \"darkness and anger\" that threatened to overtake the Spirit World. These negative emotions were amplified during the Harmonic Convergence of 171 AG, when Vaatu used the increased spiritual energy of the event to break free from his prison inside the Tree of Time. After Vaatu was defeated, Avatar Korra decided to leave the spirit portals open, once again uniting the Spirit and the physical worlds."
    },
    {
      "body": "After accidentally creating a new ${link_0}, ${link_1} and ${link_2} crossed to the Spirit World and landed in a field of flowers.",
      "links": [
        {
          "body": "spirit portal",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_2}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        }
      ],
      "text": "After accidentally creating a new spirit portal, Korra and Kuvira crossed to the Spirit World and landed in a field of flowers."
    },
    {
      "body": "In 174 AG, a third spirit portal was created by accident when the ${link_0}'s spirit energy cannon overloaded and released an enormous discharge of spiritual energy. Korra attempted to control of the force of the explosion with energybending, and this tore open a new portal between the physical and Spirit Worlds. After the conclusion of the ${link_1}, Korra and ${link_2} used this portal to cross over to the Spirit World, where they traveled around for several days as a vacation. When they returned, however, they discovered that ${link_3}, the owner of the land surrounding the spirit portal, intended to turn the area into an amusement park and organize excursions into the Spirit World. Several spirits rebelled against this idea, with the ${link_4} even imploring Korra to close the spirit portals again, as it left the Spirit World vulnerable to be ravaged and exploited by humans.",
      "links": [
        {
          "body": "Earth Empire",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        },
        {
          "body": "invasion of the United Republic of Nations",
          "key": "${link_1}",
          "target": {
            "href": "Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Wonyong Keum",
          "key": "${link_3}",
          "target": {
            "href": "Wonyong_Keum",
            "page": "Wonyong_Keum"
          }
        },
        {
          "body": "dragon eel spirit",
          "key": "${link_4}",
          "target": {
            "href": "Dragon_eel_spirit",
            "page": "Dragon_eel_spirit"
          }
        }
      ],
      "text": "In 174 AG, a third spirit portal was created by accident when the Earth Empire's spirit energy cannon overloaded and released an enormous discharge of spiritual energy. Korra attempted to control of the force of the explosion with energybending, and this tore open a new portal between the physical and Spirit Worlds. After the conclusion of the invasion of the United Republic of Nations, Korra and Asami used this portal to cross over to the Spirit World, where they traveled around for several days as a vacation. When they returned, however, they discovered that Wonyong Keum, the owner of the land surrounding the spirit portal, intended to turn the area into an amusement park and organize excursions into the Spirit World. Several spirits rebelled against this idea, with the dragon eel spirit even imploring Korra to close the spirit portals again, as it left the Spirit World vulnerable to be ravaged and exploited by humans."
    },
    {
      "body": "The spirits destroyed the flower field ${link_0}'s ${link_1} led to as a warning to humans to stay out of the Spirit World.",
      "links": [
        {
          "body": "Republic City",
          "key": "${link_0}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        }
      ],
      "text": "The spirits destroyed the flower field Republic City's spirit portal led to as a warning to humans to stay out of the Spirit World."
    },
    {
      "body": "After the conflict took a violent turn, during which the dragon eel spirit passed through and disfigured ${link_0}, the spirits destroyed the flower field to where Republic City's spirit portal led to as a warning to the humans to not step foot in their realm ever again: although the portal remained open and humans could still enter the Spirit World, thorny vines would shoot out of the ground and attack anyone in their vicinity the moment someone touched one of the scorched flowers.",
      "links": [
        {
          "body": "Tokuga",
          "key": "${link_0}",
          "target": {
            "href": "Tokuga",
            "page": "Tokuga"
          }
        }
      ],
      "text": "After the conflict took a violent turn, during which the dragon eel spirit passed through and disfigured Tokuga, the spirits destroyed the flower field to where Republic City's spirit portal led to as a warning to the humans to not step foot in their realm ever again: although the portal remained open and humans could still enter the Spirit World, thorny vines would shoot out of the ground and attack anyone in their vicinity the moment someone touched one of the scorched flowers."
    },
    {
      "body": "In certain places, the landscape of the Spirit World seems to conform closely to the area of the physical world that functions as its entry point, to the extent that a human crossing over might not immediately notice the difference. In other places, the geography of the Spirit World has no relation to the physical world and the two settings vary considerably.",
      "links": [],
      "text": "In certain places, the landscape of the Spirit World seems to conform closely to the area of the physical world that functions as its entry point, to the extent that a human crossing over might not immediately notice the difference. In other places, the geography of the Spirit World has no relation to the physical world and the two settings vary considerably."
    },
    {
      "body": "The realm of Koh is a dangerous part of the Spirit World.",
      "links": [],
      "text": "The realm of Koh is a dangerous part of the Spirit World."
    },
    {
      "body": "The lair of the spirit ${link_0}, the Face Stealer, lies below a gigantic, twisted tree. The land surrounding his covert is barren, dark, and scarcely inhabited, except for Koh's faceless victims and at least one gargantuan wolf. For anyone who enters his lair it is advisable to remain emotionless, as Koh steals the face of anyone who expresses their emotions in front of him.",
      "links": [
        {
          "body": "Koh",
          "key": "${link_0}",
          "target": {
            "href": "Koh",
            "page": "Koh"
          }
        }
      ],
      "text": "The lair of the spirit Koh, the Face Stealer, lies below a gigantic, twisted tree. The land surrounding his covert is barren, dark, and scarcely inhabited, except for Koh's faceless victims and at least one gargantuan wolf. For anyone who enters his lair it is advisable to remain emotionless, as Koh steals the face of anyone who expresses their emotions in front of him."
    },
    {
      "body": "Hai-Riyo Peak is a large mountain located near ${link_0}'s teashop in the Spirit World. Prior to Korra's arrival in 171 AG, the mountain was enveloped by vicious storm clouds and inhabited by numerous ${link_1}. Its summit is the nesting site for several ${link_2}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "dark spirits",
          "key": "${link_1}",
          "target": {
            "href": "Dark_spirits",
            "page": "Dark_spirits"
          }
        },
        {
          "body": "dragon bird spirits",
          "key": "${link_2}",
          "target": {
            "href": "Dragon_bird_spirit",
            "page": "Dragon_bird_spirit"
          }
        }
      ],
      "text": "Hai-Riyo Peak is a large mountain located near Iroh's teashop in the Spirit World. Prior to Korra's arrival in 171 AG, the mountain was enveloped by vicious storm clouds and inhabited by numerous dark spirits. Its summit is the nesting site for several dragon bird spirits."
    },
    {
      "body": "As a prison for humans in the Spirit World, the ${link_0} has the ability to drive humans insane by imprisoning them in their own darkest memories.",
      "links": [
        {
          "body": "Fog of Lost Souls",
          "key": "${link_0}",
          "target": {
            "href": "Fog_of_Lost_Souls",
            "page": "Fog_of_Lost_Souls"
          }
        }
      ],
      "text": "As a prison for humans in the Spirit World, the Fog of Lost Souls has the ability to drive humans insane by imprisoning them in their own darkest memories."
    },
    {
      "body": "The Fog of Lost Souls is a prison for humans in the Spirit World. The fog spirit that is the prison has the ability to drive humans into madness, trapping them within their own darkest memory and subsequently prohibiting them from escaping. After ${link_0} was pulled to the Spirit World by ${link_1}, his soul became trapped in the fog, where he continued his self-praising monologue about being a conqueror and a ${link_2}-slayer. In 171 AG, ${link_3} trapped ${link_4} in the fog, and ${link_5}, ${link_6}, and ${link_7} also later became imprisoned there after setting out to rescue the young airbender. After Tenzin overcame his insecurity about his identity, the fog momentarily cleared and he was able to rescue his family. Sometime later, ${link_8} also threw ${link_9}'s soul inside the prison, condemning him to wander the fog for eternity.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "La",
          "key": "${link_1}",
          "target": {
            "href": "La",
            "page": "La"
          }
        },
        {
          "body": "moon",
          "key": "${link_2}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_3}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_4}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_5}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Kya",
          "key": "${link_6}",
          "target": {
            "href": "Kya",
            "page": "Kya"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_7}",
          "target": {
            "href": "Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_8}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Aiwei",
          "key": "${link_9}",
          "target": {
            "href": "Aiwei",
            "page": "Aiwei"
          }
        }
      ],
      "text": "The Fog of Lost Souls is a prison for humans in the Spirit World. The fog spirit that is the prison has the ability to drive humans into madness, trapping them within their own darkest memory and subsequently prohibiting them from escaping. After Zhao was pulled to the Spirit World by La, his soul became trapped in the fog, where he continued his self-praising monologue about being a conqueror and a moon-slayer. In 171 AG, Unalaq trapped Jinora in the fog, and Tenzin, Kya, and Bumi also later became imprisoned there after setting out to rescue the young airbender. After Tenzin overcame his insecurity about his identity, the fog momentarily cleared and he was able to rescue his family. Sometime later, Zaheer also threw Aiwei's soul inside the prison, condemning him to wander the fog for eternity."
    },
    {
      "body": "Xai Bau's Grove is located deep in the Spirit World in a canyon densely populated by trees. Grass covers the entirety of the grove and numerous rocks are scattered throughout the area. A single stream with red water runs through the hilly woodland and the sky bears a yellow-orange hue.",
      "links": [],
      "text": "Xai Bau's Grove is located deep in the Spirit World in a canyon densely populated by trees. Grass covers the entirety of the grove and numerous rocks are scattered throughout the area. A single stream with red water runs through the hilly woodland and the sky bears a yellow-orange hue."
    },
    {
      "body": "As the natural bridge between the Spirit World and the physical world, the Avatar can use meditation to enter the Spirit World. Other spiritually enlightened humans, like ${link_0} and ${link_1}, can also meditate into the Spirit World. When doing so, the spirit leaves the physical body, which renders it defenseless. Prolonged separation of spirit and body may also prove to be fatal.",
      "links": [
        {
          "body": "Zaheer",
          "key": "${link_0}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Aiwei",
          "key": "${link_1}",
          "target": {
            "href": "Aiwei",
            "page": "Aiwei"
          }
        }
      ],
      "text": "As the natural bridge between the Spirit World and the physical world, the Avatar can use meditation to enter the Spirit World. Other spiritually enlightened humans, like Zaheer and Aiwei, can also meditate into the Spirit World. When doing so, the spirit leaves the physical body, which renders it defenseless. Prolonged separation of spirit and body may also prove to be fatal."
    },
    {
      "body": "${link_0} is located in the ${link_1} and home to the ${link_2}.",
      "links": [
        {
          "body": "Forgetful Valley",
          "key": "${link_0}",
          "target": {
            "href": "Forgetful_Valley",
            "page": "Forgetful_Valley"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Mother of Faces",
          "key": "${link_2}",
          "target": {
            "href": "Mother_of_Faces",
            "page": "Mother_of_Faces"
          }
        }
      ],
      "text": "Forgetful Valley is located in the Fire Nation and home to the Mother of Faces."
    },
    {
      "body": "Situated in the ${link_0}, the Forgetful Valley is comprised of thick wilderness and four mystical, crystal-clear pools of water. On occasion, usually once a season, a ${link_1} will drink from one of the four pools. The valley is home to the ${link_2}, whose presence can be discerned upon observing the various ${link_3} and ${link_4}; they exhibit face-like markings when the spirit is nearby.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "wolf spirit",
          "key": "${link_1}",
          "target": {
            "href": "Wolf_spirit",
            "page": "Wolf_spirit"
          }
        },
        {
          "body": "Mother of Faces",
          "key": "${link_2}",
          "target": {
            "href": "Mother_of_Faces",
            "page": "Mother_of_Faces"
          }
        },
        {
          "body": "fauna",
          "key": "${link_3}",
          "target": {
            "href": "Fauna_in_the_World_of_Avatar",
            "page": "Fauna_in_the_World_of_Avatar"
          }
        },
        {
          "body": "flora",
          "key": "${link_4}",
          "target": {
            "href": "Flora_in_the_World_of_Avatar",
            "page": "Flora_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Situated in the Fire Nation, the Forgetful Valley is comprised of thick wilderness and four mystical, crystal-clear pools of water. On occasion, usually once a season, a wolf spirit will drink from one of the four pools. The valley is home to the Mother of Faces, whose presence can be discerned upon observing the various fauna and flora; they exhibit face-like markings when the spirit is nearby."
    },
    {
      "body": "A solstice is an astronomical event that occurs twice a year. During these solstices, the Spirit World and the physical world are significantly closer to each other compared to the rest of the year. Therefore, during one of the solstices, it is somewhat easier for one to cross into the Spirit World. ${link_0} took advantage of this during the ${link_1} to talk to Avatar ${link_2} about ${link_3}. Avatar Roku also used the winter solstice sun to aid him in entering the ${link_4}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "winter solstice",
          "key": "${link_1}",
          "target": {
            "href": "Winter_solstice",
            "page": "Winter_solstice"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_3}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_4}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "A solstice is an astronomical event that occurs twice a year. During these solstices, the Spirit World and the physical world are significantly closer to each other compared to the rest of the year. Therefore, during one of the solstices, it is somewhat easier for one to cross into the Spirit World. Aang took advantage of this during the winter solstice to talk to Avatar Roku about Sozin's Comet. Avatar Roku also used the winter solstice sun to aid him in entering the Avatar State."
    },
    {
      "body": "The ${link_0} can be found behind the ${link_1}.",
      "links": [
        {
          "body": "Spirit Oasis",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "Northern Water Tribe Royal Palace",
          "key": "${link_1}",
          "target": {
            "href": "Northern_Water_Tribe_Royal_Palace",
            "page": "Northern_Water_Tribe_Royal_Palace"
          }
        }
      ],
      "text": "The Spirit Oasis can be found behind the Northern Water Tribe Royal Palace."
    },
    {
      "body": "The Spirit Oasis is a verdant oasis located in the Northern Water Tribe at the base of a waterfall behind the ${link_0}'s ${link_1}. It is the center of all the spiritual energy in the entire North Pole and, unlike the rest of the region, has a warmer climate able to facilitate the growth of vegetation. Two koi fish swim in a central pool of the oasis and are the mortal forms of ${link_2} and ${link_3}, the Moon and the Ocean Spirits. Under normal circumstances, if one sets foot in the pool it acts normal. However, sometimes it can open as a portal to the Spirit World, and even be used to drag people nearby it to the Spirit World.",
      "links": [
        {
          "body": "chief",
          "key": "${link_0}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "palace",
          "key": "${link_1}",
          "target": {
            "href": "Northern_Water_Tribe_Royal_Palace",
            "page": "Northern_Water_Tribe_Royal_Palace"
          }
        },
        {
          "body": "Tui",
          "key": "${link_2}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "La",
          "key": "${link_3}",
          "target": {
            "href": "La",
            "page": "La"
          }
        }
      ],
      "text": "The Spirit Oasis is a verdant oasis located in the Northern Water Tribe at the base of a waterfall behind the chief's palace. It is the center of all the spiritual energy in the entire North Pole and, unlike the rest of the region, has a warmer climate able to facilitate the growth of vegetation. Two koi fish swim in a central pool of the oasis and are the mortal forms of Tui and La, the Moon and the Ocean Spirits. Under normal circumstances, if one sets foot in the pool it acts normal. However, sometimes it can open as a portal to the Spirit World, and even be used to drag people nearby it to the Spirit World."
    },
    {
      "body": "Up until 174 AG, the world had two spirit portals, one located at the ${link_0} and one at the North Pole. Both poles once had lush forests that were the home to many spirits. However, in 151 AG, ${link_1} destroyed the forest in the North while pursuing a group of hostile ${link_2}, which angered the spirits, causing them to attack the Northern Water Tribe that night.",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_1}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "barbarians",
          "key": "${link_2}",
          "target": {
            "href": "Barbarians",
            "page": "Barbarians"
          }
        }
      ],
      "text": "Up until 174 AG, the world had two spirit portals, one located at the South Pole and one at the North Pole. Both poles once had lush forests that were the home to many spirits. However, in 151 AG, Tonraq destroyed the forest in the North while pursuing a group of hostile barbarians, which angered the spirits, causing them to attack the Northern Water Tribe that night."
    },
    {
      "body": "There is a spiritual intersection where the ${link_0} world and the Spirit World meet.",
      "links": [
        {
          "body": "mortal",
          "key": "${link_0}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "There is a spiritual intersection where the mortal world and the Spirit World meet."
    },
    {
      "body": "During the ${link_0}, the ${link_1} started raging over the forest at the ${link_2}, covering it and the spirit portal located there within a thick layer of ice. The forest was later restored by Avatar ${link_3} when she reopened the portal, restoring the ${link_4}. This could be done in the South only during the winter solstice. There is also a spirit portal at the North Pole that would not have to be opened during the solstice, due to the North's stronger relationship to the spirits. When both portals are open, spirits and humans can pass from one pole to the other freely. These portals were closed by Wan in order to create and maintain balance between the spirits and humankind, as well as to keep any human from ever physically crossing over to the Spirit World again and risk freeing Vaatu.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Everstorm",
          "key": "${link_1}",
          "target": {
            "href": "Everstorm",
            "page": "Everstorm"
          }
        },
        {
          "body": "South Pole",
          "key": "${link_2}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Korra",
          "key": "${link_3}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "southern lights",
          "key": "${link_4}",
          "target": {
            "href": "Spirit_lights#Southern_lights",
            "page": "Spirit_lights"
          }
        }
      ],
      "text": "During the Hundred Year War, the Everstorm started raging over the forest at the South Pole, covering it and the spirit portal located there within a thick layer of ice. The forest was later restored by Avatar Korra when she reopened the portal, restoring the southern lights. This could be done in the South only during the winter solstice. There is also a spirit portal at the North Pole that would not have to be opened during the solstice, due to the North's stronger relationship to the spirits. When both portals are open, spirits and humans can pass from one pole to the other freely. These portals were closed by Wan in order to create and maintain balance between the spirits and humankind, as well as to keep any human from ever physically crossing over to the Spirit World again and risk freeing Vaatu."
    },
    {
      "body": "Those two portals lead to a field where ${link_0} and Vaatu battled during Harmonic Convergence. The plain consists of streams of water and rocky formations and is enclosed by a chain of mountains. In its center stands the Tree of Time, where Vaatu was imprisoned after his defeat.",
      "links": [
        {
          "body": "Raava",
          "key": "${link_0}",
          "target": {
            "href": "Raava",
            "page": "Raava"
          }
        }
      ],
      "text": "Those two portals lead to a field where Raava and Vaatu battled during Harmonic Convergence. The plain consists of streams of water and rocky formations and is enclosed by a chain of mountains. In its center stands the Tree of Time, where Vaatu was imprisoned after his defeat."
    },
    {
      "body": "After ${link_0} ${link_1} ${link_2} in 174 AG, a third spirit portal was created in the heart of the metropolis. When Kuvira fired her ${link_3} from inside the city's ${link_4}, the spiritual energy overload tore open a new passage between the two worlds. This portal leads to a meadow surrounded by mountains, and the trees that grow there are similar in appearance to the Tree of Time.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "attacked",
          "key": "${link_1}",
          "target": {
            "href": "Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "spirit energy cannon",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_energy_cannon",
            "page": "Spirit_energy_cannon"
          }
        },
        {
          "body": "Spirit Wilds",
          "key": "${link_4}",
          "target": {
            "href": "Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        }
      ],
      "text": "After Kuvira attacked Republic City in 174 AG, a third spirit portal was created in the heart of the metropolis. When Kuvira fired her spirit energy cannon from inside the city's Spirit Wilds, the spiritual energy overload tore open a new passage between the two worlds. This portal leads to a meadow surrounded by mountains, and the trees that grow there are similar in appearance to the Tree of Time."
    },
    {
      "body": "Spirits can take on many forms and sizes.",
      "links": [],
      "text": "Spirits can take on many forms and sizes."
    },
    {
      "body": "The entities of the Spirit World are affiliated with either light or darkness, usually depending on who, Raava or Vaatu respectively, won the last Harmonic Convergence. Most spirits resemble some aspect of nature and occasionally, humans can transcend the mortal realm after death and become spirits. A special relationship exists between the great light and dark spirits, as one cannot exist without the other, and even if one manages to defeat the other, their counterpart will always reemerge again over time.",
      "links": [],
      "text": "The entities of the Spirit World are affiliated with either light or darkness, usually depending on who, Raava or Vaatu respectively, won the last Harmonic Convergence. Most spirits resemble some aspect of nature and occasionally, humans can transcend the mortal realm after death and become spirits. A special relationship exists between the great light and dark spirits, as one cannot exist without the other, and even if one manages to defeat the other, their counterpart will always reemerge again over time."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Spirit_World",
    "file": "avatar.wikia.com/wiki/Spirit_World.html",
    "page": "Spirit_World",
    "title": "Spirit World"
  }
}