{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "href": "Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "All over the ${link_0}; eventually evolved into the ${link_1}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "world",
              "key": "${link_0}",
              "target": {
                "href": "Earth",
                "page": "Earth"
              }
            },
            {
              "body": "four nations",
              "key": "${link_1}",
              "target": {
                "href": "Four_nations",
                "page": "Four_nations"
              }
            }
          ],
          "text": "All over the world; eventually evolved into the four nations",
          "value": "All over the ${link_0}; eventually evolved into the ${link_1}",
          "value_text": "All over the world; eventually evolved into the four nations"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "Largely uninhabited by humans (formerly)",
          "extra": "(formerly)",
          "extra_text": "(formerly)",
          "links": [],
          "text": "Largely uninhabited by humans (formerly)",
          "value": "Largely uninhabited by humans",
          "value_text": "Largely uninhabited by humans"
        },
        {
          "body": "Spiritual center in the mortal realm (formerly)",
          "extra": "(formerly)",
          "extra_text": "(formerly)",
          "links": [],
          "text": "Spiritual center in the mortal realm (formerly)",
          "value": "Spiritual center in the mortal realm",
          "value_text": "Spiritual center in the mortal realm"
        }
      ]
    },
    {
      "key": "Ruler",
      "value": [
        {
          "body": "None; eventually divided into different ${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "government systems",
              "key": "${link_0}",
              "target": {
                "href": "Politics_in_the_World_of_Avatar",
                "page": "Politics_in_the_World_of_Avatar"
              }
            }
          ],
          "text": "None; eventually divided into different government systems",
          "value": "None; eventually divided into different ${link_0}",
          "value_text": "None; eventually divided into different government systems"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Beginnings, Part 1",
              "key": "${link_0}",
              "target": {
                "href": "Beginnings%2c_Part_1",
                "page": "Beginnings%2c_Part_1"
              }
            }
          ],
          "text": "\"Beginnings, Part 1\"",
          "value": "\"${link_0}\"",
          "value_text": "\"Beginnings, Part 1\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The Spirit Wilds encompassed all uninhabited territories on ${link_0} in the ${link_1}. They were considered dangerous to humans, as the wilds were home to spirits in the mortal realm. After ${link_2} ${link_3} separated the ${link_4} from the physical world, humans left the protection of the ${link_5} and settled in the wilds, which eventually developed into the ${link_6}.",
      "links": [
        {
          "body": "Earth",
          "key": "${link_0}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "era of Raava",
          "key": "${link_1}",
          "target": {
            "href": "Era_of_Raava",
            "page": "Era_of_Raava"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Wan",
          "key": "${link_3}",
          "target": {
            "href": "Wan",
            "page": "Wan"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_4}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "lion turtles",
          "key": "${link_5}",
          "target": {
            "href": "Lion_turtle",
            "page": "Lion_turtle"
          }
        },
        {
          "body": "four nations",
          "key": "${link_6}",
          "target": {
            "href": "Four_nations",
            "page": "Four_nations"
          }
        }
      ],
      "text": "The Spirit Wilds encompassed all uninhabited territories on Earth in the era of Raava. They were considered dangerous to humans, as the wilds were home to spirits in the mortal realm. After Avatar Wan separated the Spirit World from the physical world, humans left the protection of the lion turtles and settled in the wilds, which eventually developed into the four nations."
    },
    {
      "body": "The Spirit Wilds partially resurfaced when Avatar ${link_0} chose to keep the ${link_1} open following the ${link_2} of 171 ${link_3}, which resulted in numerous spirits migrating into the desolate areas of ${link_4} that were damaged during the ${link_5}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "spirit portals",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_2}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "AG",
          "key": "${link_3}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_4}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Unalaq Crisis",
          "key": "${link_5}",
          "target": {
            "href": "Unalaq_Crisis",
            "page": "Unalaq_Crisis"
          }
        }
      ],
      "text": "The Spirit Wilds partially resurfaced when Avatar Korra chose to keep the spirit portals open following the Harmonic Convergence of 171 AG, which resulted in numerous spirits migrating into the desolate areas of Republic City that were damaged during the Unalaq Crisis."
    },
    {
      "body": "In the era before the Avatar, the Spirit Wilds encompassed all regions of the world, but remained largely uninhabited by humans due to hostile spirits that lurked in the wilderness. Spirits often disguised themselves as ${link_0} to deceive human trespassers and attacked individuals whom they regarded as threats to their wellbeing. For instance, vine-like entities that resembled grass would lie in wait until they made contact with a group, before ensnaring and pulling the individuals underground. Furthermore, as humans typically only ventured into the Spirit Wilds in search of food, spirit wasps would join together atop trees resembling fruit and attack humans who attempted to eat them.",
      "links": [
        {
          "body": "plant life",
          "key": "${link_0}",
          "target": {
            "href": "Flora_in_the_World_of_Avatar",
            "page": "Flora_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "In the era before the Avatar, the Spirit Wilds encompassed all regions of the world, but remained largely uninhabited by humans due to hostile spirits that lurked in the wilderness. Spirits often disguised themselves as plant life to deceive human trespassers and attacked individuals whom they regarded as threats to their wellbeing. For instance, vine-like entities that resembled grass would lie in wait until they made contact with a group, before ensnaring and pulling the individuals underground. Furthermore, as humans typically only ventured into the Spirit Wilds in search of food, spirit wasps would join together atop trees resembling fruit and attack humans who attempted to eat them."
    },
    {
      "body": "A parade of spirits entered the Spirit Oasis near the city from where ${link_0} was banished, under the watch of the guardian ${link_1}.",
      "links": [
        {
          "body": "Wan",
          "key": "${link_0}",
          "target": {
            "href": "Wan",
            "page": "Wan"
          }
        },
        {
          "body": "aye-aye spirit",
          "key": "${link_1}",
          "target": {
            "href": "Aye-aye_spirit",
            "page": "Aye-aye_spirit"
          }
        }
      ],
      "text": "A parade of spirits entered the Spirit Oasis near the city from where Wan was banished, under the watch of the guardian aye-aye spirit."
    },
    {
      "body": "Due to lack of human occupation, the Spirit Wilds were replete with resources and a variety of ${link_0}, including ${link_1} and ${link_2}. Dozens of lion turtles were also scattered throughout the wilds and served as home to humans, who settled on their backs and depended on protection from the spirits.",
      "links": [
        {
          "body": "fauna",
          "key": "${link_0}",
          "target": {
            "href": "Fauna_in_the_World_of_Avatar",
            "page": "Fauna_in_the_World_of_Avatar"
          }
        },
        {
          "body": "cat deer",
          "key": "${link_1}",
          "target": {
            "href": "Cat_deer",
            "page": "Cat_deer"
          }
        },
        {
          "body": "dragons",
          "key": "${link_2}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        }
      ],
      "text": "Due to lack of human occupation, the Spirit Wilds were replete with resources and a variety of fauna, including cat deer and dragons. Dozens of lion turtles were also scattered throughout the wilds and served as home to humans, who settled on their backs and depended on protection from the spirits."
    },
    {
      "body": "Two spirit portals located at both the ${link_0} and ${link_1} led to the Spirit World, where ${link_2} and ${link_3} battled ${link_4} for the fate of the mortal realm. Before Wan destroyed the link between Raava and Vaatu, the two spirits also fought in the Spirit Wilds, where they caused considerable damage. The sentient capacities that the Spirit Wilds possess allows vegetation to communicate with one another, even when they are growing in different locations.",
      "links": [
        {
          "body": "North",
          "key": "${link_0}",
          "target": {
            "href": "North_Pole",
            "page": "North_Pole"
          }
        },
        {
          "body": "South Poles",
          "key": "${link_1}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Raava",
          "key": "${link_2}",
          "target": {
            "href": "Raava",
            "page": "Raava"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_3}",
          "target": {
            "href": "Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "every ten thousand years",
          "key": "${link_4}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        }
      ],
      "text": "Two spirit portals located at both the North and South Poles led to the Spirit World, where Raava and Vaatu battled every ten thousand years for the fate of the mortal realm. Before Wan destroyed the link between Raava and Vaatu, the two spirits also fought in the Spirit Wilds, where they caused considerable damage. The sentient capacities that the Spirit Wilds possess allows vegetation to communicate with one another, even when they are growing in different locations."
    },
    {
      "body": "The Spirit Wilds overtook ${link_0} after the ${link_1} were left open following the ${link_2} of 171 ${link_3}.",
      "links": [
        {
          "body": "Republic City",
          "key": "${link_0}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "spirit portals",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_2}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "AG",
          "key": "${link_3}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "The Spirit Wilds overtook Republic City after the spirit portals were left open following the Harmonic Convergence of 171 AG."
    },
    {
      "body": "The Spirit Wilds partially reemerged following Avatar Korra's decision to keep the spirit portals open in the aftermath of the Unalaq Crisis during Harmonic Convergence in 171 AG. Specifically, spirit vines began to grow destructively throughout Republic City, prompting citizens to evacuate from boroughs which became virtually uninhabitable. This vegetation became home to spirits that migrated to the physical world. At first, the citizens struggled to cope with these changes, but they eventually learned to coexist; roads were built around the vines and the spirits eventually became a tourist attraction. Varrick took an interest in these plants after witnessing Vaatu's attack and procured a spirit vine for research into new technology. However, he discovered that the vines were made of pure energy that had become unstable by being in the physical world and deemed them too dangerous to be used. Due to ${link_0}'s attack on the spirit vines at the base of the ${link_1}, the Spirit Wilds in Republic City reacted violently to its visitors, imprisoning them in vegetative pods that trapped their souls in the Spirit World.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "banyan-grove tree",
          "key": "${link_1}",
          "target": {
            "href": "Banyan-grove_tree",
            "page": "Banyan-grove_tree"
          }
        }
      ],
      "text": "The Spirit Wilds partially reemerged following Avatar Korra's decision to keep the spirit portals open in the aftermath of the Unalaq Crisis during Harmonic Convergence in 171 AG. Specifically, spirit vines began to grow destructively throughout Republic City, prompting citizens to evacuate from boroughs which became virtually uninhabitable. This vegetation became home to spirits that migrated to the physical world. At first, the citizens struggled to cope with these changes, but they eventually learned to coexist; roads were built around the vines and the spirits eventually became a tourist attraction. Varrick took an interest in these plants after witnessing Vaatu's attack and procured a spirit vine for research into new technology. However, he discovered that the vines were made of pure energy that had become unstable by being in the physical world and deemed them too dangerous to be used. Due to Kuvira's attack on the spirit vines at the base of the banyan-grove tree, the Spirit Wilds in Republic City reacted violently to its visitors, imprisoning them in vegetative pods that trapped their souls in the Spirit World."
    },
    {
      "body": "The roots of the ${link_0} connected the ${link_1} to the rest of the ${link_2}.",
      "links": [
        {
          "body": "banyan-grove tree",
          "key": "${link_0}",
          "target": {
            "href": "Banyan-grove_tree",
            "page": "Banyan-grove_tree"
          }
        },
        {
          "body": "Foggy Swamp",
          "key": "${link_1}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "world",
          "key": "${link_2}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "The roots of the banyan-grove tree connected the Foggy Swamp to the rest of the world."
    },
    {
      "body": "The Foggy Swamp is a vast wetland that spans over a large portion of the southern Earth Kingdom and harbors the ancient banyan-grove tree, of which the roots spread for miles throughout the entire swamp. It possesses a great amount of spiritual activity, such as mysterious weather patterns, sentient flora, and induced visions and hallucinations on those who enter it. The swamp is also abundant in spirit vines containing energy more powerful than those in Republic City. The spirit vines reacted in a hostile manner to Kuvira's ${link_0} that tried to harvest the vines at the base of the banyan-grove tree, though the vegetation was no match for the machines' chainsaws and metal cables.",
      "links": [
        {
          "body": "mecha suits",
          "key": "${link_0}",
          "target": {
            "href": "Mecha_suit",
            "page": "Mecha_suit"
          }
        }
      ],
      "text": "The Foggy Swamp is a vast wetland that spans over a large portion of the southern Earth Kingdom and harbors the ancient banyan-grove tree, of which the roots spread for miles throughout the entire swamp. It possesses a great amount of spiritual activity, such as mysterious weather patterns, sentient flora, and induced visions and hallucinations on those who enter it. The swamp is also abundant in spirit vines containing energy more powerful than those in Republic City. The spirit vines reacted in a hostile manner to Kuvira's mecha suits that tried to harvest the vines at the base of the banyan-grove tree, though the vegetation was no match for the machines' chainsaws and metal cables."
    },
    {
      "body": "The North Pole is the site of one of two spirit portals that allowed entry to the Spirit World. It is also home to a variety of spirits that dwelt within the ancient forest surrounding the portal, who ${link_0} inadvertently disturbed in 151 AG.",
      "links": [
        {
          "body": "Tonraq",
          "key": "${link_0}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        }
      ],
      "text": "The North Pole is the site of one of two spirit portals that allowed entry to the Spirit World. It is also home to a variety of spirits that dwelt within the ancient forest surrounding the portal, who Tonraq inadvertently disturbed in 151 AG."
    },
    {
      "body": "The ${link_0} located in the center of the ${link_1} was originally one of the two passages that allowed entry to the ${link_2}.",
      "links": [
        {
          "body": "spirit portal",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "South Pole",
          "key": "${link_1}",
          "target": {
            "href": "South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "The spirit portal located in the center of the South Pole was originally one of the two passages that allowed entry to the Spirit World."
    },
    {
      "body": "Covered entirely in snow, the South Pole was located at the point where the two corners of the world met through a spirit portal connecting the two realms. After defeating Vaatu in battle, Wan sealed the Southern spirit portal, preventing human access to the Spirit World until its reopening in 171 ${link_0}.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "Covered entirely in snow, the South Pole was located at the point where the two corners of the world met through a spirit portal connecting the two realms. After defeating Vaatu in battle, Wan sealed the Southern spirit portal, preventing human access to the Spirit World until its reopening in 171 AG."
    },
    {
      "body": "This spirit oasis was guarded by the ${link_0}, who only permitted spirits to enter the oasis prior to his encounter with Wan. The Spirit Oasis had waters with replenishing properties along with several trees lush with fruit. Before he departed for his journey, Wan remained in the oasis and protected the grounds alongside the spirit.",
      "links": [
        {
          "body": "aye-aye spirit",
          "key": "${link_0}",
          "target": {
            "href": "Aye-aye_spirit",
            "page": "Aye-aye_spirit"
          }
        }
      ],
      "text": "This spirit oasis was guarded by the aye-aye spirit, who only permitted spirits to enter the oasis prior to his encounter with Wan. The Spirit Oasis had waters with replenishing properties along with several trees lush with fruit. Before he departed for his journey, Wan remained in the oasis and protected the grounds alongside the spirit."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Spirit_Wilds",
    "file": "avatar.wikia.com/wiki/Spirit_Wilds.html",
    "page": "Spirit_Wilds",
    "title": "Spirit Wilds"
  }
}