{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Locations",
      "target": {
        "external": false,
        "href": "/wiki/Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Republic City",
      "target": {
        "external": false,
        "href": "/wiki/Category_Republic_City",
        "page": "Category_Republic_City"
      }
    },
    {
      "body": "Spirit World",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirit_World",
        "page": "Category_Spirit_World"
      }
    },
    {
      "body": "Water Tribes",
      "target": {
        "external": false,
        "href": "/wiki/Category_Water_Tribes",
        "page": "Category_Water_Tribes"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "${link_0}, ${link_1}, ${link_2}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "North Pole",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/North_Pole",
                "page": "North_Pole"
              }
            },
            {
              "body": "Republic City",
              "key": "${link_1}",
              "target": {
                "external": false,
                "href": "/wiki/Republic_City",
                "page": "Republic_City"
              }
            },
            {
              "body": "South Pole",
              "key": "${link_2}",
              "target": {
                "external": false,
                "href": "/wiki/South_Pole",
                "page": "South_Pole"
              }
            }
          ],
          "text": "North Pole, Republic City, South Pole",
          "value": "${link_0}, ${link_1}, ${link_2}",
          "value_text": "North Pole, Republic City, South Pole"
        }
      ]
    },
    {
      "key": "Administrator",
      "value": [
        {
          "body": "${link_0}  (Northern portal)",
          "extra": "(Northern portal)",
          "extra_text": "(Northern portal)",
          "links": [
            {
              "body": "Northern Water Tribe",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Northern_Water_Tribe",
                "page": "Northern_Water_Tribe"
              }
            }
          ],
          "text": "Northern Water Tribe  (Northern portal)",
          "value": "${link_0}",
          "value_text": "Northern Water Tribe"
        },
        {
          "body": "${link_0} (Republic City portal)",
          "extra": "(Republic City portal)",
          "extra_text": "(Republic City portal)",
          "links": [
            {
              "body": "Air Nation",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Air_Nomads#Rebirth_of_a_nation",
                "page": "Air_Nomads"
              }
            }
          ],
          "text": "Air Nation (Republic City portal)",
          "value": "${link_0}",
          "value_text": "Air Nation"
        },
        {
          "body": "${link_0}  (Southern portal)",
          "extra": "(Southern portal)",
          "extra_text": "(Southern portal)",
          "links": [
            {
              "body": "Southern Water Tribe",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Southern_Water_Tribe",
                "page": "Southern_Water_Tribe"
              }
            }
          ],
          "text": "Southern Water Tribe  (Southern portal)",
          "value": "${link_0}",
          "value_text": "Southern Water Tribe"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "The Southern Lights",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/The_Southern_Lights",
                "page": "The_Southern_Lights"
              }
            }
          ],
          "text": "\"The Southern Lights\"",
          "value": "\"${link_0}\"",
          "value_text": "\"The Southern Lights\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "A spirit portal is a gateway that connects the ${link_0} and ${link_1} worlds. Two of these portals were created when ${link_2} and ${link_3} broke through the barriers separating the two realms before the ${link_4} and are located at the ${link_5} and ${link_6}. A third portal was torn open in downtown ${link_7} by a large discharge of spiritual energy from ${link_8}'s ${link_9} in 174 ${link_10}.",
      "links": [
        {
          "body": "mortal",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "spirit",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Raava",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Raava",
            "page": "Raava"
          }
        },
        {
          "body": "era of Raava",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Era_of_Raava",
            "page": "Era_of_Raava"
          }
        },
        {
          "body": "North",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/North_Pole",
            "page": "North_Pole"
          }
        },
        {
          "body": "South Poles",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "spirit energy cannon",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_energy_cannon",
            "page": "Spirit_energy_cannon"
          }
        },
        {
          "body": "AG",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Spirit portal"
      ],
      "text": "A spirit portal is a gateway that connects the mortal and spirit worlds. Two of these portals were created when Vaatu and Raava broke through the barriers separating the two realms before the era of Raava and are located at the North and South Poles. A third portal was torn open in downtown Republic City by a large discharge of spiritual energy from Kuvira's spirit energy cannon in 174 AG."
    },
    {
      "body": "The spirit portals appear as beams of energy extending from the ground upward. A portal can be torn open by a large input of energy, such as amplified spirit energy extracted from spirit vines. Only ${link_0} can close existing portals with a single touch, causing the beams to diminish into orbs. A sealed portal can only be reopened from the physical world by using the same process during one of the solstices, as that is when the divide between the two worlds is the weakest. Sealed portals are impervious to attempts to open them from anyone else but the Avatar, as they cannot be forcibly opened by physical force, such as aggressive feats of ${link_1}.",
      "links": [
        {
          "body": "Avatars",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "bending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "Description"
      ],
      "text": "The spirit portals appear as beams of energy extending from the ground upward. A portal can be torn open by a large input of energy, such as amplified spirit energy extracted from spirit vines. Only Avatars can close existing portals with a single touch, causing the beams to diminish into orbs. A sealed portal can only be reopened from the physical world by using the same process during one of the solstices, as that is when the divide between the two worlds is the weakest. Sealed portals are impervious to attempts to open them from anyone else but the Avatar, as they cannot be forcibly opened by physical force, such as aggressive feats of bending."
    },
    {
      "body": "As physical gateways, spirit portals provide humans with a direct passage into the Spirit World, which is simpler compared to the more sophisticated method of using meditation as a means of entry. In addition, the use of spirit portals allows individuals to retain their bending abilities in the Spirit World, as well as bring material objects that would otherwise remain in the mortal realm after entry through meditation. Conversely, spirit portals give spirits a direct passage into the physical world, providing them the opportunity to remain in the mortal realm without sacrificing their immortality.",
      "links": [],
      "section": [
        "Spirit portal",
        "Description"
      ],
      "text": "As physical gateways, spirit portals provide humans with a direct passage into the Spirit World, which is simpler compared to the more sophisticated method of using meditation as a means of entry. In addition, the use of spirit portals allows individuals to retain their bending abilities in the Spirit World, as well as bring material objects that would otherwise remain in the mortal realm after entry through meditation. Conversely, spirit portals give spirits a direct passage into the physical world, providing them the opportunity to remain in the mortal realm without sacrificing their immortality."
    },
    {
      "body": "During ${link_0}, the Northern and Southern spirit portals will overlap and experience an amplification of spiritual energy, provided that they are both open during the phenomenon. The energetic increase provided by Harmonic Convergence strengthens the two gateways and negates any attempts to close them, while the influx of energy from the overlap can be utilized by nearby spirits in numerous ways, such as to break free from a prison bound by spiritual energy and to permanently fuse with a human host. In the mortal realm, the overlap of the Northern and Southern spirit portals can provide spirits and spiritual projections with a means of traveling anywhere in the physical world instantaneously.",
      "links": [
        {
          "body": "Harmonic Convergence",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "Description"
      ],
      "text": "During Harmonic Convergence, the Northern and Southern spirit portals will overlap and experience an amplification of spiritual energy, provided that they are both open during the phenomenon. The energetic increase provided by Harmonic Convergence strengthens the two gateways and negates any attempts to close them, while the influx of energy from the overlap can be utilized by nearby spirits in numerous ways, such as to break free from a prison bound by spiritual energy and to permanently fuse with a human host. In the mortal realm, the overlap of the Northern and Southern spirit portals can provide spirits and spiritual projections with a means of traveling anywhere in the physical world instantaneously."
    },
    {
      "body": "The Northern spirit portal is one of the two original spirit portals, the result of Vaatu and Raava's breaking through the divide between the two worlds. It glows bright reddish brown and is situated in the center of an ancient forest located at the heart of the North Pole. Although the entirety of the North Pole is composed of harsh tundras, the spirit forest in which the portal is located remains thawed due to strong spiritual energy in the North. It leads to a rocky plain in the Spirit World located near the Southern spirit portal and the ${link_0}.",
      "links": [
        {
          "body": "Tree of Time",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "Locations",
        "North Pole"
      ],
      "text": "The Northern spirit portal is one of the two original spirit portals, the result of Vaatu and Raava's breaking through the divide between the two worlds. It glows bright reddish brown and is situated in the center of an ancient forest located at the heart of the North Pole. Although the entirety of the North Pole is composed of harsh tundras, the spirit forest in which the portal is located remains thawed due to strong spiritual energy in the North. It leads to a rocky plain in the Spirit World located near the Southern spirit portal and the Tree of Time."
    },
    {
      "body": "The portal was sealed by Avatar ${link_0} after his decision to separate humans and spirits in the aftermath of the Harmonic Convergence of 9,829 BG, and reopened by Avatar Korra shortly prior to the Harmonic Convergence of 171 AG.",
      "links": [
        {
          "body": "Wan",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wan",
            "page": "Wan"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "Locations",
        "North Pole"
      ],
      "text": "The portal was sealed by Avatar Wan after his decision to separate humans and spirits in the aftermath of the Harmonic Convergence of 9,829 BG, and reopened by Avatar Korra shortly prior to the Harmonic Convergence of 171 AG."
    },
    {
      "body": "Created by the discharge of spiritual energy from the ${link_0}'s spirit energy cannon, the Republic City spirit portal glows bright green and is situated downtown, surrounded by a mass of spirit vines. Unlike the other two gateways, this spirit portal leads to an aquatic meadow in the Spirit World covered with underwater flowers and surrounded by icebergs.",
      "links": [
        {
          "body": "Earth Empire",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "Locations",
        "Republic City"
      ],
      "text": "Created by the discharge of spiritual energy from the Earth Empire's spirit energy cannon, the Republic City spirit portal glows bright green and is situated downtown, surrounded by a mass of spirit vines. Unlike the other two gateways, this spirit portal leads to an aquatic meadow in the Spirit World covered with underwater flowers and surrounded by icebergs."
    },
    {
      "body": "Having been created by an energy weapon of mass destruction during the ${link_0} of Republic City in 174 AG, this spirit portal is the only one of the three in existence not to have been directly created by a spirit. The spirits were not thrilled about its creation, however, as its location in the middle of a bustling metropolis left their world in danger of being ravaged and plundered by humans trying to exploit the portal; ${link_1}, who owned the land surrounding the portal, intended to turn it into an amusement park from where he would organize tours and excursions into the Spirit World. The ${link_2} urged Avatar Korra to close the portal and, upon her refusal, held her responsible for its protection. When she failed in its eyes, the spirits took care of it themselves and engaged the humans in a turf war over the portal.",
      "links": [
        {
          "body": "invasion",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "Wonyong Keum",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Wonyong_Keum",
            "page": "Wonyong_Keum"
          }
        },
        {
          "body": "dragon eel spirit",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon_eel_spirit",
            "page": "Dragon_eel_spirit"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "Locations",
        "Republic City"
      ],
      "text": "Having been created by an energy weapon of mass destruction during the invasion of Republic City in 174 AG, this spirit portal is the only one of the three in existence not to have been directly created by a spirit. The spirits were not thrilled about its creation, however, as its location in the middle of a bustling metropolis left their world in danger of being ravaged and plundered by humans trying to exploit the portal; Wonyong Keum, who owned the land surrounding the portal, intended to turn it into an amusement park from where he would organize tours and excursions into the Spirit World. The dragon eel spirit urged Avatar Korra to close the portal and, upon her refusal, held her responsible for its protection. When she failed in its eyes, the spirits took care of it themselves and engaged the humans in a turf war over the portal."
    },
    {
      "body": "After a violent conflict between the spirits and the ${link_0}, the spirits destroyed the flower field to which Republic City's portal led to in order to discourage humans from entering their realm; whenever someone would touch one of the scorched flowers, thorny vines would shoot out of the ground and attack.",
      "links": [
        {
          "body": "Triple Threat Triad",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "Locations",
        "Republic City"
      ],
      "text": "After a violent conflict between the spirits and the Triple Threat Triad, the spirits destroyed the flower field to which Republic City's portal led to in order to discourage humans from entering their realm; whenever someone would touch one of the scorched flowers, thorny vines would shoot out of the ground and attack."
    },
    {
      "body": "As a reaction to the conflict, ${link_0} ${link_1} deployed the ${link_2} to erect a perimeter around the portal. After ${link_3} won the ongoing presidential election, however, she called off the military and, following Keum's retracted claim to the land, gave the lands surrounding the portal to the ${link_4}.",
      "links": [
        {
          "body": "President",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/President",
            "page": "President"
          }
        },
        {
          "body": "Raiko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "United Forces",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/United_Forces",
            "page": "United_Forces"
          }
        },
        {
          "body": "Zhu Li Moon",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        },
        {
          "body": "Air Nation",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomads#Rebirth_of_a_nation",
            "page": "Air_Nomads"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "Locations",
        "Republic City"
      ],
      "text": "As a reaction to the conflict, President Raiko deployed the United Forces to erect a perimeter around the portal. After Zhu Li Moon won the ongoing presidential election, however, she called off the military and, following Keum's retracted claim to the land, gave the lands surrounding the portal to the Air Nation."
    },
    {
      "body": "The Southern spirit portal is one of the two original spirit portals, the result of Vaatu and Raava's breaking through the divide between the two worlds. It grows bright blue and is situated in the center of an ancient forest located at the heart of the South Pole. It was sealed by Avatar Wan after his decision to separate humans and spirits in the aftermath of the Harmonic Convergence of 9,829 BG. It leads to a rocky plain in the Spirit World located near the Northern spirit portal and the Tree of Time. Gradual spiritual decay in the South following the ${link_0} caused the dormant spirit portal and the surrounding forest to become encased in ice, while ${link_1} persisted in the South Pole and rampaged in the ${link_2}.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "dark spirits",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_spirits",
            "page": "Dark_spirits"
          }
        },
        {
          "body": "Everstorm",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Everstorm",
            "page": "Everstorm"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "Locations",
        "South Pole"
      ],
      "text": "The Southern spirit portal is one of the two original spirit portals, the result of Vaatu and Raava's breaking through the divide between the two worlds. It grows bright blue and is situated in the center of an ancient forest located at the heart of the South Pole. It was sealed by Avatar Wan after his decision to separate humans and spirits in the aftermath of the Harmonic Convergence of 9,829 BG. It leads to a rocky plain in the Spirit World located near the Northern spirit portal and the Tree of Time. Gradual spiritual decay in the South following the Hundred Year War caused the dormant spirit portal and the surrounding forest to become encased in ice, while dark spirits persisted in the South Pole and rampaged in the Everstorm."
    },
    {
      "body": "The portal was reopened by Avatar Korra in 171 AG during the ${link_0}, which resulted in the dissipation of the Everstorm and the return of the ${link_1}. During the ${link_2}, the ${link_3} ${link_4} barricaded the portal and surrounding forest in an effort to protect the gateway from ${link_5} ${link_6}.",
      "links": [
        {
          "body": "winter solstice",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Winter_solstice",
            "page": "Winter_solstice"
          }
        },
        {
          "body": "southern lights",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_lights",
            "page": "Spirit_lights"
          }
        },
        {
          "body": "Water Tribe Civil War",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Water_Tribe_Civil_War",
            "page": "Water_Tribe_Civil_War"
          }
        },
        {
          "body": "Northern",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "army",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        },
        {
          "body": "Southern",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "rebels",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_rebels",
            "page": "Southern_Water_Tribe_rebels"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "Locations",
        "South Pole"
      ],
      "text": "The portal was reopened by Avatar Korra in 171 AG during the winter solstice, which resulted in the dissipation of the Everstorm and the return of the southern lights. During the Water Tribe Civil War, the Northern army barricaded the portal and surrounding forest in an effort to protect the gateway from Southern rebels."
    },
    {
      "body": "Given the amount of energy necessary to tear open a spirit portal, the landscape surrounding each passage's point of origin is severely distorted: there is a crater covered by spirit vines where the Republic City spirit portal formed, whereas the rocks in the plain where the Northern and Southern spirit portal are located in the Spirit World are warped in various different ways.",
      "links": [],
      "section": [
        "Spirit portal",
        "Trivia"
      ],
      "text": "Given the amount of energy necessary to tear open a spirit portal, the landscape surrounding each passage's point of origin is severely distorted: there is a crater covered by spirit vines where the Republic City spirit portal formed, whereas the rocks in the plain where the Northern and Southern spirit portal are located in the Spirit World are warped in various different ways."
    },
    {
      "body": "During Harmonic Convergence, the overlap of the Northern and Southern spirit portals causes both to turn bright yellow.",
      "links": [],
      "section": [
        "Spirit portal",
        "Trivia"
      ],
      "text": "During Harmonic Convergence, the overlap of the Northern and Southern spirit portals causes both to turn bright yellow."
    },
    {
      "body": "The Northern and Southern portals share the same color as the markings on Vaatu and Raava, respectively. They are also located at opposite ends of the mortal world, reflecting the natural opposition between Vaatu and Raava.\n Similarly, the Republic City portal glows green, which is the same color as the spirit vines from which the energy used to create the portal was extracted.",
      "links": [],
      "section": [
        "Spirit portal",
        "Trivia"
      ],
      "text": "The Northern and Southern portals share the same color as the markings on Vaatu and Raava, respectively. They are also located at opposite ends of the mortal world, reflecting the natural opposition between Vaatu and Raava.\n Similarly, the Republic City portal glows green, which is the same color as the spirit vines from which the energy used to create the portal was extracted."
    },
    {
      "body": "Similarly, the Republic City portal glows green, which is the same color as the spirit vines from which the energy used to create the portal was extracted.",
      "links": [],
      "section": [
        "Spirit portal",
        "Trivia"
      ],
      "text": "Similarly, the Republic City portal glows green, which is the same color as the spirit vines from which the energy used to create the portal was extracted."
    },
    {
      "body": "The creators initially planned to introduce four spirit portals in ${link_0}.",
      "links": [
        {
          "body": "Book Two: Spirits",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Book_Two__Spirits",
            "page": "Book_Two__Spirits"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "Trivia"
      ],
      "text": "The creators initially planned to introduce four spirit portals in Book Two: Spirits."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "North Pole",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/North_Pole",
            "page": "North_Pole"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "See also"
      ],
      "text": "North Pole"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Republic City",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "See also"
      ],
      "text": "Republic City"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        }
      ],
      "section": [
        "Spirit portal",
        "See also"
      ],
      "text": "South Pole"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Spirit_portal",
    "file": "avatar.wikia.com/wiki/Spirit_portal.html",
    "page": "Spirit_portal",
    "title": "Spirit portal"
  }
}