{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "href": "Category_Spirituality",
        "page": "Category_Spirituality"
      }
    },
    {
      "body": "World of Avatar",
      "target": {
        "href": "Category_World_of_Avatar",
        "page": "Category_World_of_Avatar"
      }
    }
  ],
  "facts": [
    {
      "key": "Type",
      "value": [
        {
          "body": "Spiritual beliefs and spirits",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Spiritual beliefs and spirits",
          "value": "Spiritual beliefs and spirits",
          "value_text": "Spiritual beliefs and spirits"
        }
      ]
    },
    {
      "key": "Examples",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Painted Lady",
              "key": "${link_0}",
              "target": {
                "href": "Painted_Lady",
                "page": "Painted_Lady"
              }
            }
          ],
          "text": "Painted Lady",
          "value": "${link_0}",
          "value_text": "Painted Lady"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Spirit World",
              "key": "${link_0}",
              "target": {
                "href": "Spirit_World",
                "page": "Spirit_World"
              }
            }
          ],
          "text": "Spirit World",
          "value": "${link_0}",
          "value_text": "Spirit World"
        },
        {
          "body": "${link_0} and ${link_1}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Tui",
              "key": "${link_0}",
              "target": {
                "href": "Tui",
                "page": "Tui"
              }
            },
            {
              "body": "La",
              "key": "${link_1}",
              "target": {
                "href": "La",
                "page": "La"
              }
            }
          ],
          "text": "Tui and La",
          "value": "${link_0} and ${link_1}",
          "value_text": "Tui and La"
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Spiritual beliefs in the ${link_0} are defined mostly through respecting various ${link_1} affiliated with nature, with the exception of the ${link_2}. Individual ${link_3} have regional variations.",
      "links": [
        {
          "body": "World of Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "spirits",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_World#Known_Spirits",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_2}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "nations",
          "key": "${link_3}",
          "target": {
            "href": "Four_nations",
            "page": "Four_nations"
          }
        }
      ],
      "text": "Spiritual beliefs in the World of Avatar are defined mostly through respecting various spirits affiliated with nature, with the exception of the Air Nomads. Individual nations have regional variations."
    },
    {
      "body": "The Air Nomad society is centered around monumental ${link_0}, governed by monastic orders, causing spiritual traditions to be present in every day life. Spiritual and philosophical tradition teaches that enlightenment can be achieved by detaching oneself from the world, essentially freeing the spirit. To the monks, all life was sacred; therefore, they consciously refrained from harming the Earth or any living being, resulting in a wide vegetarian culture. Before eating dinner with his family, ${link_1} offered grace for their food. Due to this philosophy of peace, the Air Nomads also did not have a formal military. This lack of a formal military in conjunction with the power lent to ${link_2}'s armies by the ${link_3} were contributing factors in the near ${link_4}.",
      "links": [
        {
          "body": "temples",
          "key": "${link_0}",
          "target": {
            "href": "Air_temple",
            "page": "Air_temple"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_1}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_2}",
          "target": {
            "href": "Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "comet",
          "key": "${link_3}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "extinction of the Air Nomads",
          "key": "${link_4}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        }
      ],
      "text": "The Air Nomad society is centered around monumental temples, governed by monastic orders, causing spiritual traditions to be present in every day life. Spiritual and philosophical tradition teaches that enlightenment can be achieved by detaching oneself from the world, essentially freeing the spirit. To the monks, all life was sacred; therefore, they consciously refrained from harming the Earth or any living being, resulting in a wide vegetarian culture. Before eating dinner with his family, Tenzin offered grace for their food. Due to this philosophy of peace, the Air Nomads also did not have a formal military. This lack of a formal military in conjunction with the power lent to Sozin's armies by the comet were contributing factors in the near extinction of the Air Nomads."
    },
    {
      "body": "Being the original airbenders, ${link_0} were profusely represented, both in sculptures and murals, in the temples and they were held sacred as lifelong companions.",
      "links": [
        {
          "body": "flying bison",
          "key": "${link_0}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        }
      ],
      "text": "Being the original airbenders, flying bison were profusely represented, both in sculptures and murals, in the temples and they were held sacred as lifelong companions."
    },
    {
      "body": "To celebrate sacred days, the Air Nomads had festivals, like ${link_0}, during which traditional music, ceremonial meals, ancient stories, and flying kites was common.",
      "links": [
        {
          "body": "Yangchen's Festival",
          "key": "${link_0}",
          "target": {
            "href": "Yangchen%27s_Festival",
            "page": "Yangchen%27s_Festival"
          }
        }
      ],
      "text": "To celebrate sacred days, the Air Nomads had festivals, like Yangchen's Festival, during which traditional music, ceremonial meals, ancient stories, and flying kites was common."
    },
    {
      "body": "The ${link_0} in the ${link_1} is located behind the ${link_2}.",
      "links": [
        {
          "body": "Spirit Oasis",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Royal Palace",
          "key": "${link_2}",
          "target": {
            "href": "Northern_Water_Tribe_Royal_Palace",
            "page": "Northern_Water_Tribe_Royal_Palace"
          }
        }
      ],
      "text": "The Spirit Oasis in the Northern Water Tribe is located behind the Royal Palace."
    },
    {
      "body": "Customs, traditions, and rites of passage are maintained through generations. Due to separation between the tribes, the spiritual beliefs of the ${link_0} are difficult to assess, although certain spiritual aspects are known. There is clear reverence of the ${link_1} and ${link_2} Spirits, since the origins of ${link_3}, according to legend, come from the moon: noticing how the moon pushed and pulled the tides of the ocean, the people of the Water Tribes learned to do it themselves and became the first human waterbenders. In the ${link_4} lies the ${link_5}, a secluded cove located behind the ${link_6}'s ${link_7}. There is a pond in the middle of the oasis, in which two koi fish, Tui and La, swim around each other in a circular course. The oasis is the most spiritual place in the entire North Pole; although it is surrounded by frozen lands, the oasis has unusually warm surroundings with trees and a waterfall.",
      "links": [
        {
          "body": "Water Tribes",
          "key": "${link_0}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Moon",
          "key": "${link_1}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Ocean",
          "key": "${link_2}",
          "target": {
            "href": "La",
            "page": "La"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_3}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_4}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Spirit Oasis",
          "key": "${link_5}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "chief",
          "key": "${link_6}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "palace",
          "key": "${link_7}",
          "target": {
            "href": "Northern_Water_Tribe_Royal_Palace",
            "page": "Northern_Water_Tribe_Royal_Palace"
          }
        }
      ],
      "text": "Customs, traditions, and rites of passage are maintained through generations. Due to separation between the tribes, the spiritual beliefs of the Water Tribes are difficult to assess, although certain spiritual aspects are known. There is clear reverence of the Moon and Ocean Spirits, since the origins of waterbending, according to legend, come from the moon: noticing how the moon pushed and pulled the tides of the ocean, the people of the Water Tribes learned to do it themselves and became the first human waterbenders. In the Northern Water Tribe lies the Spirit Oasis, a secluded cove located behind the chief's palace. There is a pond in the middle of the oasis, in which two koi fish, Tui and La, swim around each other in a circular course. The oasis is the most spiritual place in the entire North Pole; although it is surrounded by frozen lands, the oasis has unusually warm surroundings with trees and a waterfall."
    },
    {
      "body": "Among the most important spiritual celebrations of the Water Tribe was the ${link_0}, held in the Southern Water Tribe with the purpose of strengthening ties between the North and the South, as well as maintaining the nation's connection to the spirits. Considered by the more spiritual tribe members, such as former Chief ${link_1}, to be one of the \"most hallowed times\", the festival originally was a solemn time for fasting and meditation, during which the tribal elders to communed with spirits and watched the brilliant displays of ${link_2} dancing in the sky. However, the strain placed upon the Southern Water Tribe during the Hundred Year War caused many of their spiritual traditions to be abandoned and eventually forgotten. As such, by 171 ${link_3}, the Glacier Spirits Festival had become a carnival and lost its spiritual meaning, the only remnant being that it ends on the day of the ${link_4}.",
      "links": [
        {
          "body": "Glacier Spirits Festival",
          "key": "${link_0}",
          "target": {
            "href": "Glacier_Spirits_Festival",
            "page": "Glacier_Spirits_Festival"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_1}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "light",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_lights",
            "page": "Spirit_lights"
          }
        },
        {
          "body": "AG",
          "key": "${link_3}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "winter solstice",
          "key": "${link_4}",
          "target": {
            "href": "Winter_solstice",
            "page": "Winter_solstice"
          }
        }
      ],
      "text": "Among the most important spiritual celebrations of the Water Tribe was the Glacier Spirits Festival, held in the Southern Water Tribe with the purpose of strengthening ties between the North and the South, as well as maintaining the nation's connection to the spirits. Considered by the more spiritual tribe members, such as former Chief Unalaq, to be one of the \"most hallowed times\", the festival originally was a solemn time for fasting and meditation, during which the tribal elders to communed with spirits and watched the brilliant displays of light dancing in the sky. However, the strain placed upon the Southern Water Tribe during the Hundred Year War caused many of their spiritual traditions to be abandoned and eventually forgotten. As such, by 171 AG, the Glacier Spirits Festival had become a carnival and lost its spiritual meaning, the only remnant being that it ends on the day of the winter solstice."
    },
    {
      "body": "Unlike any other culture, the Northern Water Tribe maintains a special reverence for Tui and La, the spirits of the Moon and the Ocean. They represent their symbols through the entire capital city and are important enough to commend the tribe under their protection in time of war, and the entire tribe bowed to the Ocean Spirit when he showed himself with all his might.",
      "links": [],
      "text": "Unlike any other culture, the Northern Water Tribe maintains a special reverence for Tui and La, the spirits of the Moon and the Ocean. They represent their symbols through the entire capital city and are important enough to commend the tribe under their protection in time of war, and the entire tribe bowed to the Ocean Spirit when he showed himself with all his might."
    },
    {
      "body": "Totemism is part of the tradition of the Water Tribe and diverse totemic animals, full of symbolism, are represented profusely in palaces and the city. Among the more important totemic animals of the tribe are the ${link_0}, the fish, and the bear.",
      "links": [
        {
          "body": "wolf",
          "key": "${link_0}",
          "target": {
            "href": "Wolf",
            "page": "Wolf"
          }
        }
      ],
      "text": "Totemism is part of the tradition of the Water Tribe and diverse totemic animals, full of symbolism, are represented profusely in palaces and the city. Among the more important totemic animals of the tribe are the wolf, the fish, and the bear."
    },
    {
      "body": "Due to years of separation, Northern and Southern cultures have diverged and with the adult population of the ${link_0} either going to war or being captured or killed by the Fire Nation, the culture and tradition had decayed in recent times, with custom and religion being somewhat lost.",
      "links": [
        {
          "body": "Southern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "Due to years of separation, Northern and Southern cultures have diverged and with the adult population of the Southern Water Tribe either going to war or being captured or killed by the Fire Nation, the culture and tradition had decayed in recent times, with custom and religion being somewhat lost."
    },
    {
      "body": "Nonetheless, belief in the spirits is common and sacred objects are kept by the older members of the tribe. The Southern Water Tribe retained more of its tribal ways, such as the traditional rite of passage into adulthood consisting in ${link_0}, which earns a person the ritual marks of the Wise, the Trusted, or the Brave.",
      "links": [
        {
          "body": "ice dodging",
          "key": "${link_0}",
          "target": {
            "href": "Ice_dodging",
            "page": "Ice_dodging"
          }
        }
      ],
      "text": "Nonetheless, belief in the spirits is common and sacred objects are kept by the older members of the tribe. The Southern Water Tribe retained more of its tribal ways, such as the traditional rite of passage into adulthood consisting in ice dodging, which earns a person the ritual marks of the Wise, the Trusted, or the Brave."
    },
    {
      "body": "Living secluded, the people of the ${link_0} feel connected to the ${link_1} they live in, considering it sacred, with the swamp's center, the ${link_2} being considered a place of enlightenment. They consider all living organisms to be connected and reliant on each other.",
      "links": [
        {
          "body": "Foggy Swamp Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Foggy_Swamp_Tribe",
            "page": "Foggy_Swamp_Tribe"
          }
        },
        {
          "body": "swamp",
          "key": "${link_1}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "banyan-grove tree",
          "key": "${link_2}",
          "target": {
            "href": "Banyan-grove_tree",
            "page": "Banyan-grove_tree"
          }
        }
      ],
      "text": "Living secluded, the people of the Foggy Swamp Tribe feel connected to the swamp they live in, considering it sacred, with the swamp's center, the banyan-grove tree being considered a place of enlightenment. They consider all living organisms to be connected and reliant on each other."
    },
    {
      "body": "${link_0} on ${link_1} is dedicated to the Avatar and commemorates the creation of the island.",
      "links": [
        {
          "body": "Kyoshi Shrine",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi_Shrine",
            "page": "Kyoshi_Shrine"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        }
      ],
      "text": "Kyoshi Shrine on Kyoshi Island is dedicated to the Avatar and commemorates the creation of the island."
    },
    {
      "body": "Although the citizens of the Earth Kingdom are not particularly spiritual, small shrines, temples, and ${link_0} dot the landscape, some being dedicated to previous Avatars like ${link_1}, who has a ${link_2} on ${link_3}, where her relics are kept. Sacred objects, rituals, ceremonies, and priesthood are not particularly common, but do exist, holding even enough power over the people to be cause enough to begin a feud, like between the ${link_4} and ${link_5}. Because of their divine connection, the ${link_6} has several ceremonial temples on the ${link_7}, one of which, the Royal Shrine, is forbidden to anyone else.",
      "links": [
        {
          "body": "monasteries",
          "key": "${link_0}",
          "target": {
            "href": "Abbey",
            "page": "Abbey"
          }
        },
        {
          "body": "Kyoshi",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi",
            "page": "Kyoshi"
          }
        },
        {
          "body": "shrine",
          "key": "${link_2}",
          "target": {
            "href": "Kyoshi_Shrine",
            "page": "Kyoshi_Shrine"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_3}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "Gan Jin",
          "key": "${link_4}",
          "target": {
            "href": "Gan_Jin",
            "page": "Gan_Jin"
          }
        },
        {
          "body": "Zhang",
          "key": "${link_5}",
          "target": {
            "href": "Zhang",
            "page": "Zhang"
          }
        },
        {
          "body": "earth monarch",
          "key": "${link_6}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "palace grounds",
          "key": "${link_7}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        }
      ],
      "text": "Although the citizens of the Earth Kingdom are not particularly spiritual, small shrines, temples, and monasteries dot the landscape, some being dedicated to previous Avatars like Kyoshi, who has a shrine on Kyoshi Island, where her relics are kept. Sacred objects, rituals, ceremonies, and priesthood are not particularly common, but do exist, holding even enough power over the people to be cause enough to begin a feud, like between the Gan Jin and Zhang. Because of their divine connection, the earth monarch has several ceremonial temples on the palace grounds, one of which, the Royal Shrine, is forbidden to anyone else."
    },
    {
      "body": "Given the enormous size of the kingdom, there are few symbols that are revered nationwide, though one of these is the ${link_0}, which holds a special standing due to being regarded as the original earthbender. Their effigies are present on multiple locations, ranging from cities like ${link_1} to the ${link_2}, where a statue of the beast guards the royal throne.",
      "links": [
        {
          "body": "badgermole",
          "key": "${link_0}",
          "target": {
            "href": "Badgermole",
            "page": "Badgermole"
          }
        },
        {
          "body": "Taku",
          "key": "${link_1}",
          "target": {
            "href": "Taku",
            "page": "Taku"
          }
        },
        {
          "body": "Earth Kingdom Royal Palace",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        }
      ],
      "text": "Given the enormous size of the kingdom, there are few symbols that are revered nationwide, though one of these is the badgermole, which holds a special standing due to being regarded as the original earthbender. Their effigies are present on multiple locations, ranging from cities like Taku to the Earth Kingdom Royal Palace, where a statue of the beast guards the royal throne."
    },
    {
      "body": "Some villages and even cities rely heavily in the skill of fortunetellers to guide state affairs, as was the case in ${link_0} where Aunt ${link_1} lived as well as the city Lady ${link_2} protected. Fortune was told by aid of ${link_3}, cracks in bones, and palmistry.",
      "links": [
        {
          "body": "Makapu Village",
          "key": "${link_0}",
          "target": {
            "href": "Makapu_Village",
            "page": "Makapu_Village"
          }
        },
        {
          "body": "Wu",
          "key": "${link_1}",
          "target": {
            "href": "Wu_(fortuneteller)",
            "page": "Wu_(fortuneteller)"
          }
        },
        {
          "body": "Tienhai",
          "key": "${link_2}",
          "target": {
            "href": "Tienhai",
            "page": "Tienhai"
          }
        },
        {
          "body": "cloud reading",
          "key": "${link_3}",
          "target": {
            "href": "Book_of_Clouds",
            "page": "Book_of_Clouds"
          }
        }
      ],
      "text": "Some villages and even cities rely heavily in the skill of fortunetellers to guide state affairs, as was the case in Makapu Village where Aunt Wu lived as well as the city Lady Tienhai protected. Fortune was told by aid of cloud reading, cracks in bones, and palmistry."
    },
    {
      "body": "The Earth Kingdom has an active folklore, with the legend of the badgermole and ${link_0} and ${link_1} being passed on through song. In the past, farmers in the region of the ${link_2} used to offer sacrifices to resident earth spirits as they believed those spirits to be responsible for the creation of the canyon. Ancient ${link_3} lore tells that the ${link_4} was dropped from the heavens by the gods as a demonstration of their great power and anger when human inhabitants had stopped abiding by the rules of their priests.",
      "links": [
        {
          "body": "Oma",
          "key": "${link_0}",
          "target": {
            "href": "Oma",
            "page": "Oma"
          }
        },
        {
          "body": "Shu",
          "key": "${link_1}",
          "target": {
            "href": "Shu",
            "page": "Shu"
          }
        },
        {
          "body": "Great Divide",
          "key": "${link_2}",
          "target": {
            "href": "Great_Divide",
            "page": "Great_Divide"
          }
        },
        {
          "body": "sandbender",
          "key": "${link_3}",
          "target": {
            "href": "Sandbender_Tribes",
            "page": "Sandbender_Tribes"
          }
        },
        {
          "body": "Si Wong Rock",
          "key": "${link_4}",
          "target": {
            "href": "Si_Wong_Desert#Si_Wong_Rock",
            "page": "Si_Wong_Desert"
          }
        }
      ],
      "text": "The Earth Kingdom has an active folklore, with the legend of the badgermole and Oma and Shu being passed on through song. In the past, farmers in the region of the Great Divide used to offer sacrifices to resident earth spirits as they believed those spirits to be responsible for the creation of the canyon. Ancient sandbender lore tells that the Si Wong Rock was dropped from the heavens by the gods as a demonstration of their great power and anger when human inhabitants had stopped abiding by the rules of their priests."
    },
    {
      "body": "The ${link_0} is a spirit who inhabits the ${link_1}.",
      "links": [
        {
          "body": "Painted Lady",
          "key": "${link_0}",
          "target": {
            "href": "Painted_Lady",
            "page": "Painted_Lady"
          }
        },
        {
          "body": "Jang Hui River",
          "key": "${link_1}",
          "target": {
            "href": "Jang_Hui_River",
            "page": "Jang_Hui_River"
          }
        }
      ],
      "text": "The Painted Lady is a spirit who inhabits the Jang Hui River."
    },
    {
      "body": "Despite being the only nation with an established ${link_0}, which has an important influence on spiritual and state affairs, as they are tasked with carrying out coronations, royal weddings, and funerals, little is known about the spiritual beliefs of the ${link_1}. During the ${link_2}, most upper-class citizens and government and military officials showed little or no concern for the ${link_3}, as evidenced through ${link_4}'s murder of the Moon Spirit or General ${link_5}'s willingness to drive away the ${link_6} by building a metalworking factory. However, many Fire Nation peasants still carried strong faith in local patron spirits, like the Painted Lady, and often looked to them for guidance and intervention in various problems or situations. Many people also willingly attributed problems to evil spirits or ${link_7}. Reverence for the Avatar was a difficult issue in the Fire Nation; although ${link_8} was still revered, the near-universal belief in Fire Nation cultural and physical superiority and the animosity toward ${link_9} left it for the most part minimal.",
      "links": [
        {
          "body": "clergy",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_2}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_4}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Mung",
          "key": "${link_5}",
          "target": {
            "href": "Mung",
            "page": "Mung"
          }
        },
        {
          "body": "Painted Lady",
          "key": "${link_6}",
          "target": {
            "href": "Painted_Lady",
            "page": "Painted_Lady"
          }
        },
        {
          "body": "witches",
          "key": "${link_7}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "Roku",
          "key": "${link_8}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "his successor",
          "key": "${link_9}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Despite being the only nation with an established clergy, which has an important influence on spiritual and state affairs, as they are tasked with carrying out coronations, royal weddings, and funerals, little is known about the spiritual beliefs of the Fire Nation. During the Hundred Year War, most upper-class citizens and government and military officials showed little or no concern for the Spirit World, as evidenced through Zhao's murder of the Moon Spirit or General Mung's willingness to drive away the Painted Lady by building a metalworking factory. However, many Fire Nation peasants still carried strong faith in local patron spirits, like the Painted Lady, and often looked to them for guidance and intervention in various problems or situations. Many people also willingly attributed problems to evil spirits or witches. Reverence for the Avatar was a difficult issue in the Fire Nation; although Roku was still revered, the near-universal belief in Fire Nation cultural and physical superiority and the animosity toward his successor left it for the most part minimal."
    },
    {
      "body": "Although hunted near extinction by the Fire Nation higher classes, ${link_0} hold some sacred and spiritual meaning, as their images appear in Fire Nation Royal Palace and temple architecture, their skulls are kept in hidden catacombs, and dragons statues guard important relics and places; even the ${link_1} throne is kept under the vigilance of a golden dragon figure. The sun symbology, although mostly relegated and forgotten, is still strongly linked to the figure of the Fire Lord, as many past Fire Lords are painted with a large sun in the background.",
      "links": [
        {
          "body": "dragons",
          "key": "${link_0}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "text": "Although hunted near extinction by the Fire Nation higher classes, dragons hold some sacred and spiritual meaning, as their images appear in Fire Nation Royal Palace and temple architecture, their skulls are kept in hidden catacombs, and dragons statues guard important relics and places; even the Fire Lord throne is kept under the vigilance of a golden dragon figure. The sun symbology, although mostly relegated and forgotten, is still strongly linked to the figure of the Fire Lord, as many past Fire Lords are painted with a large sun in the background."
    },
    {
      "body": "At least during the reign of Fire Lord ${link_0}, a heroic and at time worshipful image of the head of state constituted in an effective cult of personality. Using theater plays, propaganda, festivals, images, and statues being placed in public places all through the territory, the state ensured to keep the image of the Fire Lord exalted and glorified. The Fire Lord, in ancient times, was a religious authority, and it retained some of its sacredness through the ages.",
      "links": [
        {
          "body": "Ozai",
          "key": "${link_0}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "At least during the reign of Fire Lord Ozai, a heroic and at time worshipful image of the head of state constituted in an effective cult of personality. Using theater plays, propaganda, festivals, images, and statues being placed in public places all through the territory, the state ensured to keep the image of the Fire Lord exalted and glorified. The Fire Lord, in ancient times, was a religious authority, and it retained some of its sacredness through the ages."
    },
    {
      "body": "While the Fire Nation as a whole is generally uninterested on spiritual matters, some minor groups, as the ${link_0} and the ${link_1} are highly spiritual.",
      "links": [
        {
          "body": "Sun Warriors",
          "key": "${link_0}",
          "target": {
            "href": "Sun_Warriors",
            "page": "Sun_Warriors"
          }
        },
        {
          "body": "Bhanti Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Bhanti_Tribe",
            "page": "Bhanti_Tribe"
          }
        }
      ],
      "text": "While the Fire Nation as a whole is generally uninterested on spiritual matters, some minor groups, as the Sun Warriors and the Bhanti Tribe are highly spiritual."
    },
    {
      "body": "The ${link_0} practice sacred rituals, focusing on the beauty of fire.",
      "links": [
        {
          "body": "Sun Warriors",
          "key": "${link_0}",
          "target": {
            "href": "Sun_Warriors",
            "page": "Sun_Warriors"
          }
        }
      ],
      "text": "The Sun Warriors practice sacred rituals, focusing on the beauty of fire."
    },
    {
      "body": "The Sun Warriors, being the ancestors of the modern Fire Nation, retain the original traits of firebending, its spirituality, and culture. Their ${link_0} built around a colossal temple, the Sun Warriors show great respect for dragons, the original firebenders, and profusely represent them in art and architecture. The ${link_1}, the \"first fire of all\", received from dragons, has been kept alight for millennia and is offered to the masters ${link_2} after walking a long way to their lair, a procession with deep spiritual meaning. This offering to the dragon masters has special significance, being accompanied with music and ritual firebending and prayers. Seen almost as godlike beings, their judgment is considered sacred and their appearance is met with reverence.",
      "links": [
        {
          "body": "major city",
          "key": "${link_0}",
          "target": {
            "href": "Sun_Warriors%27_ancient_city",
            "page": "Sun_Warriors%27_ancient_city"
          }
        },
        {
          "body": "Eternal Flame",
          "key": "${link_1}",
          "target": {
            "href": "Eternal_Flame",
            "page": "Eternal_Flame"
          }
        },
        {
          "body": "Ran and Shaw",
          "key": "${link_2}",
          "target": {
            "href": "Ran_and_Shaw",
            "page": "Ran_and_Shaw"
          }
        }
      ],
      "text": "The Sun Warriors, being the ancestors of the modern Fire Nation, retain the original traits of firebending, its spirituality, and culture. Their major city built around a colossal temple, the Sun Warriors show great respect for dragons, the original firebenders, and profusely represent them in art and architecture. The Eternal Flame, the \"first fire of all\", received from dragons, has been kept alight for millennia and is offered to the masters Ran and Shaw after walking a long way to their lair, a procession with deep spiritual meaning. This offering to the dragon masters has special significance, being accompanied with music and ritual firebending and prayers. Seen almost as godlike beings, their judgment is considered sacred and their appearance is met with reverence."
    },
    {
      "body": "Unlike the Water Tribe which considers the winter solstice a sacred moment, the Sun Warrior consider the ${link_0} to have special meaning in their celestial calender, as it is the moment in the year when the sun has more power. The Sun Warriors spirituality still seems to put an emphasis on the sun, stressing the life-giving properties of fire.",
      "links": [
        {
          "body": "summer solstice",
          "key": "${link_0}",
          "target": {
            "href": "Summer_solstice",
            "page": "Summer_solstice"
          }
        }
      ],
      "text": "Unlike the Water Tribe which considers the winter solstice a sacred moment, the Sun Warrior consider the summer solstice to have special meaning in their celestial calender, as it is the moment in the year when the sun has more power. The Sun Warriors spirituality still seems to put an emphasis on the sun, stressing the life-giving properties of fire."
    },
    {
      "body": "The Bhanti Tribesmen are the direct ancestors of the Fire Sages and they keep ancient knowledge about firebending and the spiritual world. Their village consists of temples and sanctuaries, where shamans and other member of the tribe reside. Their shamans, who may also be women, are knowledgeable in the use of firebending for spiritual ends and the tribe also has access to a pool of ${link_0}.",
      "links": [
        {
          "body": "spirit water",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_water",
            "page": "Spirit_water"
          }
        }
      ],
      "text": "The Bhanti Tribesmen are the direct ancestors of the Fire Sages and they keep ancient knowledge about firebending and the spiritual world. Their village consists of temples and sanctuaries, where shamans and other member of the tribe reside. Their shamans, who may also be women, are knowledgeable in the use of firebending for spiritual ends and the tribe also has access to a pool of spirit water."
    },
    {
      "body": "The Spirit World is a lush, vast world that lies parallel to the World of Avatar. Here reside the spirits, immortal supernatural entities which often embody different aspects of life and nature. Spirits may enter the physical world, but they become mortal and can be killed if they do so.",
      "links": [],
      "text": "The Spirit World is a lush, vast world that lies parallel to the World of Avatar. Here reside the spirits, immortal supernatural entities which often embody different aspects of life and nature. Spirits may enter the physical world, but they become mortal and can be killed if they do so."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Spiritual_beliefs_in_the_World_of_Avatar",
    "file": "avatar.wikia.com/wiki/Spiritual_beliefs_in_the_World_of_Avatar.html",
    "page": "Spiritual_beliefs_in_the_World_of_Avatar",
    "title": "Spiritual beliefs in the World of Avatar"
  }
}