{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Bodies of water",
      "target": {
        "href": "Category_Bodies_of_water",
        "page": "Category_Bodies_of_water"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Spirit World",
      "target": {
        "href": "Category_Spirit_World",
        "page": "Category_Spirit_World"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "href": "Category_Spirituality",
        "page": "Category_Spirituality"
      }
    },
    {
      "body": "Water Tribes",
      "target": {
        "href": "Category_Water_Tribes",
        "page": "Category_Water_Tribes"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "${link_0}; North Pole",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Northern Water Tribe",
              "key": "${link_0}",
              "target": {
                "href": "Northern_Water_Tribe",
                "page": "Northern_Water_Tribe"
              }
            }
          ],
          "text": "Northern Water Tribe; North Pole",
          "value": "${link_0}; North Pole",
          "value_text": "Northern Water Tribe; North Pole"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "${link_0} gateway",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Spirit World",
              "key": "${link_0}",
              "target": {
                "href": "Spirit_World",
                "page": "Spirit_World"
              }
            }
          ],
          "text": "Spirit World gateway",
          "value": "${link_0} gateway",
          "value_text": "Spirit World gateway"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "The Siege of the North, Part 1",
              "key": "${link_0}",
              "target": {
                "href": "The_Siege_of_the_North%2c_Part_1",
                "page": "The_Siege_of_the_North%2c_Part_1"
              }
            }
          ],
          "text": "\"The Siege of the North, Part 1\"",
          "value": "\"${link_0}\"",
          "value_text": "\"The Siege of the North, Part 1\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The Spirit Oasis is a lush garden and pond located in a cove deep within the ${link_0}'s capital city at the North Pole. It was created by the Moon and Ocean ${link_1}. Although the landscape surrounding the pond is perpetually frozen, the Spirit Oasis itself is warm, verdant, and inviting. It is the most peaceful and spiritual place in all of the Northern Water Tribe.",
      "links": [
        {
          "body": "Northern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Spirits",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_World#Known_spirits",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "The Spirit Oasis is a lush garden and pond located in a cove deep within the Northern Water Tribe's capital city at the North Pole. It was created by the Moon and Ocean Spirits. Although the landscape surrounding the pond is perpetually frozen, the Spirit Oasis itself is warm, verdant, and inviting. It is the most peaceful and spiritual place in all of the Northern Water Tribe."
    },
    {
      "body": "The Spirit Oasis is a pond on an island located within the ${link_0} capital.",
      "links": [
        {
          "body": "Northern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "text": "The Spirit Oasis is a pond on an island located within the Northern Water Tribe capital."
    },
    {
      "body": "Near the beginning of time, ${link_0} and ${link_1}, the Moon and Ocean Spirits, crossed over from the ${link_2} to the mortal world. They created the Spirit Oasis and assumed the form of two koi fish swimming in the pond, circling each other in a continual dance of push and pull.",
      "links": [
        {
          "body": "Tui",
          "key": "${link_0}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "La",
          "key": "${link_1}",
          "target": {
            "href": "La",
            "page": "La"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Near the beginning of time, Tui and La, the Moon and Ocean Spirits, crossed over from the Spirit World to the mortal world. They created the Spirit Oasis and assumed the form of two koi fish swimming in the pond, circling each other in a continual dance of push and pull."
    },
    {
      "body": "Many years after this, ${link_0} ${link_1} intended to marry a ${link_2} woman, ${link_3}, inside the Spirit Oasis. However, on their wedding night, Ummi was traveling across the bridge above the pond of the Spirit Oasis when she was kidnapped and taken to the ${link_4} by the Face Stealer, ${link_5}, to punish Kuruk for neglecting his duties as the Avatar. Kuruk gave chase, but he could not catch Koh and Ummi. Koh subsequently took Ummi's face. For the remaining years of his life, Kuruk journeyed to the Spirit Oasis on the anniversary of the wedding and searched for his lost love.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Kuruk",
          "key": "${link_1}",
          "target": {
            "href": "Kuruk",
            "page": "Kuruk"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Ummi",
          "key": "${link_3}",
          "target": {
            "href": "Ummi",
            "page": "Ummi"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_4}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Koh",
          "key": "${link_5}",
          "target": {
            "href": "Koh",
            "page": "Koh"
          }
        }
      ],
      "text": "Many years after this, Avatar Kuruk intended to marry a Southern Water Tribe woman, Ummi, inside the Spirit Oasis. However, on their wedding night, Ummi was traveling across the bridge above the pond of the Spirit Oasis when she was kidnapped and taken to the Spirit World by the Face Stealer, Koh, to punish Kuruk for neglecting his duties as the Avatar. Kuruk gave chase, but he could not catch Koh and Ummi. Koh subsequently took Ummi's face. For the remaining years of his life, Kuruk journeyed to the Spirit Oasis on the anniversary of the wedding and searched for his lost love."
    },
    {
      "body": "${link_0} ${link_1} and his wife visited the Spirit Oasis soon after their newborn ${link_2} was deemed terminally ill. They placed their infant daughter in the pool and prayed to the Moon and Ocean Spirits, begging them to save her life. When the spirits complied, Yue's hair became white and she began to cry.",
      "links": [
        {
          "body": "Chief",
          "key": "${link_0}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Arnook",
          "key": "${link_1}",
          "target": {
            "href": "Arnook",
            "page": "Arnook"
          }
        },
        {
          "body": "daughter",
          "key": "${link_2}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        }
      ],
      "text": "Chief Arnook and his wife visited the Spirit Oasis soon after their newborn daughter was deemed terminally ill. They placed their infant daughter in the pool and prayed to the Moon and Ocean Spirits, begging them to save her life. When the spirits complied, Yue's hair became white and she began to cry."
    },
    {
      "body": "When the ${link_0} began its ${link_1} on the Northern Water Tribe, ${link_2} Yue brought Avatar ${link_3} and ${link_4} to the Spirit Oasis so that Aang could cross over into the Spirit World. Aang successfully traveled over but as he was meditating, the banished ${link_5}, ${link_6}, sneaked into the oasis and attempted to kidnap him. Katara made an effort to stop Zuko and had the upper hand, but was defeated when the sun rose and Zuko knocked her out. The prince subsequently kidnapped Aang's body and took off across the frozen tundra outside the oasis.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "assault",
          "key": "${link_1}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        },
        {
          "body": "Princess",
          "key": "${link_2}",
          "target": {
            "href": "Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_4}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Prince",
          "key": "${link_5}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_6}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "When the Fire Nation began its assault on the Northern Water Tribe, Princess Yue brought Avatar Aang and Katara to the Spirit Oasis so that Aang could cross over into the Spirit World. Aang successfully traveled over but as he was meditating, the banished Prince, Zuko, sneaked into the oasis and attempted to kidnap him. Katara made an effort to stop Zuko and had the upper hand, but was defeated when the sun rose and Zuko knocked her out. The prince subsequently kidnapped Aang's body and took off across the frozen tundra outside the oasis."
    },
    {
      "body": "Though Aang was taken, he eventually came out of his trance and was discovered near a weakened Zuko. He traveled back to the Northern Water Tribe with the identity of the Moon and Ocean Spirits. Admiral ${link_0} and the former General ${link_1} eventually made their way into the Spirit Oasis with several firebending soldiers. There, Admiral Zhao explained that he had known about the identity of Tui and La for some time, after having found the information in a vast ${link_2}. He revealed that he intended to kill the Moon Spirit, which would strip ${link_3} of their power.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "library",
          "key": "${link_2}",
          "target": {
            "href": "Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "waterbenders",
          "key": "${link_3}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Though Aang was taken, he eventually came out of his trance and was discovered near a weakened Zuko. He traveled back to the Northern Water Tribe with the identity of the Moon and Ocean Spirits. Admiral Zhao and the former General Iroh eventually made their way into the Spirit Oasis with several firebending soldiers. There, Admiral Zhao explained that he had known about the identity of Tui and La for some time, after having found the information in a vast library. He revealed that he intended to kill the Moon Spirit, which would strip waterbenders of their power."
    },
    {
      "body": "${link_0} formed itself in the waters of the Spirit Oasis.",
      "links": [
        {
          "body": "Koizilla",
          "key": "${link_0}",
          "target": {
            "href": "La#Koizilla",
            "page": "La"
          }
        }
      ],
      "text": "Koizilla formed itself in the waters of the Spirit Oasis."
    },
    {
      "body": "Upon learning this, Iroh warned the admiral that his actions would cause great damage, not only to the waterbenders, but to the whole world, and that he would return whatever Zhao did to the fish tenfold. Zhao appeared to have listened and released the fish back into the water; however, he abruptly launched a fire blast at the spirit, killing it. The moon subsequently disappeared and all waterbenders in the city lost the power to bend. Aang, however, had not lost hope. His tattoos began to glow and he walked into the pond. There, he fused with La and they began to devastate the Fire Nation war ships.",
      "links": [],
      "text": "Upon learning this, Iroh warned the admiral that his actions would cause great damage, not only to the waterbenders, but to the whole world, and that he would return whatever Zhao did to the fish tenfold. Zhao appeared to have listened and released the fish back into the water; however, he abruptly launched a fire blast at the spirit, killing it. The moon subsequently disappeared and all waterbenders in the city lost the power to bend. Aang, however, had not lost hope. His tattoos began to glow and he walked into the pond. There, he fused with La and they began to devastate the Fire Nation war ships."
    },
    {
      "body": "Meanwhile, General Iroh identified that Yue had some of the life of the Moon Spirit within her, prompting the princess to suggest she surrender her life to Tui in an attempt to give back the life the spirit had given her. A distraught ${link_0} urged her not to go through with the plan, to which Yue responded that it was her duty. The two kissed and said goodbye as the princess faded away. Tui's life was restored, and after being returned to the pond, she and La began to encircle each other once again in a continuing cycle as the moon reappeared. Admiral Zhao was taken and dragged underwater by La in revenge for his actions in the Spirit Oasis, condemned to spend eternity in the ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Fog of Lost Souls",
          "key": "${link_1}",
          "target": {
            "href": "Fog_of_Lost_Souls",
            "page": "Fog_of_Lost_Souls"
          }
        }
      ],
      "text": "Meanwhile, General Iroh identified that Yue had some of the life of the Moon Spirit within her, prompting the princess to suggest she surrender her life to Tui in an attempt to give back the life the spirit had given her. A distraught Sokka urged her not to go through with the plan, to which Yue responded that it was her duty. The two kissed and said goodbye as the princess faded away. Tui's life was restored, and after being returned to the pond, she and La began to encircle each other once again in a continuing cycle as the moon reappeared. Admiral Zhao was taken and dragged underwater by La in revenge for his actions in the Spirit Oasis, condemned to spend eternity in the Fog of Lost Souls."
    },
    {
      "body": "A few weeks later, ${link_0} presented Katara with a vial of ${link_1}, saying it had \"special properties\". Katara kept this vial throughout the ${link_2}'s adventures in the ${link_3} and would later use the water to revive Aang after being fatally wounded by Princess ${link_4}.",
      "links": [
        {
          "body": "Pakku",
          "key": "${link_0}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "water from the Spirit Oasis",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_water",
            "page": "Spirit_water"
          }
        },
        {
          "body": "team",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_3}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Azula",
          "key": "${link_4}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "A few weeks later, Pakku presented Katara with a vial of water from the Spirit Oasis, saying it had \"special properties\". Katara kept this vial throughout the team's adventures in the Earth Kingdom and would later use the water to revive Aang after being fatally wounded by Princess Azula."
    },
    {
      "body": "${link_0} and ${link_1}, the Moon and Ocean Spirits, circle one another in an eternal dance of push and pull.",
      "links": [
        {
          "body": "Tui",
          "key": "${link_0}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "La",
          "key": "${link_1}",
          "target": {
            "href": "La",
            "page": "La"
          }
        }
      ],
      "text": "Tui and La, the Moon and Ocean Spirits, circle one another in an eternal dance of push and pull."
    },
    {
      "body": "The Spirit Oasis is a secluded cove located at the base of a waterfall behind the chief's temple. This unusual place is a lush, warm, tropical oasis and the center of all spiritual activity in the entire North Pole. The tribe believes that the energy of the Moon and Ocean Spirits keeps the oasis constantly warm and flourishing. There is a small pond and a spirit gate located on the grassy island. During each full moon, the tribe makes an offering to the spirits in thanks for their protection by placing ${link_0} and objects beneath the oasis gate.",
      "links": [
        {
          "body": "food",
          "key": "${link_0}",
          "target": {
            "href": "Cuisine_in_the_World_of_Avatar",
            "page": "Cuisine_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "The Spirit Oasis is a secluded cove located at the base of a waterfall behind the chief's temple. This unusual place is a lush, warm, tropical oasis and the center of all spiritual activity in the entire North Pole. The tribe believes that the energy of the Moon and Ocean Spirits keeps the oasis constantly warm and flourishing. There is a small pond and a spirit gate located on the grassy island. During each full moon, the tribe makes an offering to the spirits in thanks for their protection by placing food and objects beneath the oasis gate."
    },
    {
      "body": "In the pond in middle of the Spirit Oasis swim two koi fish, one black and one white, who appear ordinary but are in reality the Ocean and Moon Spirits, Tui and La.",
      "links": [],
      "text": "In the pond in middle of the Spirit Oasis swim two koi fish, one black and one white, who appear ordinary but are in reality the Ocean and Moon Spirits, Tui and La."
    },
    {
      "body": "The Spirit Oasis is the most spiritual place in the Northern Water Tribe. In fact, the Moon and Ocean Spirits themselves reside in it in the form of two koi fish. The Avatar may enter the Spirit World through this location via meditation. It is strongly implied that the bottom of the pond is an entrance to the Spirit World, as Koh traveled through from the other side to retrieve Ummi.",
      "links": [],
      "text": "The Spirit Oasis is the most spiritual place in the Northern Water Tribe. In fact, the Moon and Ocean Spirits themselves reside in it in the form of two koi fish. The Avatar may enter the Spirit World through this location via meditation. It is strongly implied that the bottom of the pond is an entrance to the Spirit World, as Koh traveled through from the other side to retrieve Ummi."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Spirit_Oasis",
    "file": "avatar.wikia.com/wiki/Spirit_Oasis.html",
    "page": "Spirit_Oasis",
    "title": "Spirit Oasis"
  }
}