{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "external": false,
        "href": "/wiki/Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "B-class articles",
      "target": {
        "external": false,
        "href": "/wiki/Category_B-class_articles",
        "page": "Category_B-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Locations",
      "target": {
        "external": false,
        "href": "/wiki/Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Spirit World",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirit_World",
        "page": "Category_Spirit_World"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "Parallel the ${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "World of Avatar",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Earth",
                "page": "Earth"
              }
            }
          ],
          "text": "Parallel the World of Avatar",
          "value": "Parallel the ${link_0}",
          "value_text": "Parallel the World of Avatar"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Winter Solstice, Part 1: The Spirit World",
              "key": "${link_0}",
              "target": {
                "external": false,
                "href": "/wiki/Winter_Solstice%2c_Part_1__The_Spirit_World",
                "page": "Winter_Solstice%2c_Part_1__The_Spirit_World"
              }
            }
          ],
          "text": "\"Winter Solstice, Part 1: The Spirit World\"",
          "value": "\"${link_0}\"",
          "value_text": "\"Winter Solstice, Part 1: The Spirit World\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The Spirit World is a parallel plane of reality that coexists alongside the ${link_0} inhabited by humans. It is home to the spirits, a vast range of immortal, supernatural entities that often embody different aspects of life and nature.",
      "links": [
        {
          "body": "physical world",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "Spirit World"
      ],
      "text": "The Spirit World is a parallel plane of reality that coexists alongside the physical world inhabited by humans. It is home to the spirits, a vast range of immortal, supernatural entities that often embody different aspects of life and nature."
    },
    {
      "body": "Prior to 171 ${link_0} and the opening of the Northern and Southern ${link_1}, it was extremely difficult and very rare for any human, other than the ${link_2} (who for millennia was known as the \"bridge between the worlds\"), to enter the Spirit World; conversely, only a handful of spirits were capable of assuming physical forms in the mortal world, and doing so required them to give up their immortality.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "spirit portals",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Relation to the physical world"
      ],
      "text": "Prior to 171 AG and the opening of the Northern and Southern spirit portals, it was extremely difficult and very rare for any human, other than the Avatar (who for millennia was known as the \"bridge between the worlds\"), to enter the Spirit World; conversely, only a handful of spirits were capable of assuming physical forms in the mortal world, and doing so required them to give up their immortality."
    },
    {
      "body": "The barrier between the Spirit World and the physical world is weakest during the ${link_0} and ${link_1} solstices, which made it possible for spirits to manifest in the physical world and for humans to pass into the Spirit World. There are also certain physical locations in the physical world that can act as bridges to the Spirit World, such as the ${link_2} in the ${link_3}. These locations are often revered by the cultures living near them.",
      "links": [
        {
          "body": "summer",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Summer_solstice",
            "page": "Summer_solstice"
          }
        },
        {
          "body": "winter",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Winter_solstice",
            "page": "Winter_solstice"
          }
        },
        {
          "body": "Spirit Oasis",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "North Pole",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/North_Pole",
            "page": "North_Pole"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Relation to the physical world"
      ],
      "text": "The barrier between the Spirit World and the physical world is weakest during the summer and winter solstices, which made it possible for spirits to manifest in the physical world and for humans to pass into the Spirit World. There are also certain physical locations in the physical world that can act as bridges to the Spirit World, such as the Spirit Oasis in the North Pole. These locations are often revered by the cultures living near them."
    },
    {
      "body": "In 171 AG, Avatar ${link_0} was tricked and forced into opening the Southern and Northern spirit portals but eventually decided to leave them open, reasoning that humans and spirits were meant to live harmoniously together. In 174 AG, a third spirit portal was accidentally created by an overloaded discharge of energy from the ${link_1}. Its location in the heart of ${link_2} put the already unsteady balance between humans and spirits in danger; some humans feared the spirits, while others wanted to exploit them and the Spirit World by turning the portal into an amusement park from where they could organize tours and excursions into the Spirit World.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "spirit energy cannon",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_energy_cannon",
            "page": "Spirit_energy_cannon"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Relation to the physical world"
      ],
      "text": "In 171 AG, Avatar Korra was tricked and forced into opening the Southern and Northern spirit portals but eventually decided to leave them open, reasoning that humans and spirits were meant to live harmoniously together. In 174 AG, a third spirit portal was accidentally created by an overloaded discharge of energy from the spirit energy cannon. Its location in the heart of Republic City put the already unsteady balance between humans and spirits in danger; some humans feared the spirits, while others wanted to exploit them and the Spirit World by turning the portal into an amusement park from where they could organize tours and excursions into the Spirit World."
    },
    {
      "body": "There are few known ways for humans other than the Avatar to enter into the Spirit World: Sometimes humans are carried there by a spirit as the entity shifts between the worlds. Enlightened individuals can cross over to the Spirit World through meditation, and others can enter physically through one of the three spirit portals. Individuals who cross over to the Spirit World cannot use their ${link_0}, unless they have entered physically through the spirit portals. Despite this, the Avatar is able to use ${link_1} when in the Spirit World, even when they did not enter through a portal, as they are connected to all the spiritual energy when in that world.",
      "links": [
        {
          "body": "bending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "energybending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Energybending",
            "page": "Energybending"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Relation to the physical world"
      ],
      "text": "There are few known ways for humans other than the Avatar to enter into the Spirit World: Sometimes humans are carried there by a spirit as the entity shifts between the worlds. Enlightened individuals can cross over to the Spirit World through meditation, and others can enter physically through one of the three spirit portals. Individuals who cross over to the Spirit World cannot use their bending, unless they have entered physically through the spirit portals. Despite this, the Avatar is able to use energybending when in the Spirit World, even when they did not enter through a portal, as they are connected to all the spiritual energy when in that world."
    },
    {
      "body": "During the ${link_0}, the spirit portals at the ${link_1} and ${link_2} were the primary passages between the Spirit and physical worlds, and spirits could migrate freely between the two. After Avatar ${link_3} closed the spirit portals following the ${link_4} of 9,829 BG, travel between the two worlds became extremely restricted, only possible through a few specific locations and methods. As the bridge between the two worlds, the Avatar could cross over in spiritual form in order to converse with the spirits and ask them for guidance. After the opening of the Southern (and later the Northern) spirit portal, humans such as ${link_5} were able to physically enter the Spirit World once again, and brought with them \"darkness and anger\" that threatened to overtake the Spirit World. These negative emotions were amplified during the Harmonic Convergence of 171 AG, when ${link_6} used the increased spiritual energy of the event to break free from his prison inside the ${link_7}. After Vaatu was defeated, Avatar Korra decided to leave the spirit portals open, once again uniting the Spirit and the physical worlds.",
      "links": [
        {
          "body": "Era of Raava",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Era_of_Raava",
            "page": "Era_of_Raava"
          }
        },
        {
          "body": "North",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/North_Pole",
            "page": "North_Pole"
          }
        },
        {
          "body": "South Poles",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Wan",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Wan",
            "page": "Wan"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Tree of Time",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Tree_of_Time",
            "page": "Tree_of_Time"
          }
        }
      ],
      "section": [
        "Spirit World",
        "History"
      ],
      "text": "During the Era of Raava, the spirit portals at the North and South Poles were the primary passages between the Spirit and physical worlds, and spirits could migrate freely between the two. After Avatar Wan closed the spirit portals following the Harmonic Convergence of 9,829 BG, travel between the two worlds became extremely restricted, only possible through a few specific locations and methods. As the bridge between the two worlds, the Avatar could cross over in spiritual form in order to converse with the spirits and ask them for guidance. After the opening of the Southern (and later the Northern) spirit portal, humans such as Unalaq were able to physically enter the Spirit World once again, and brought with them \"darkness and anger\" that threatened to overtake the Spirit World. These negative emotions were amplified during the Harmonic Convergence of 171 AG, when Vaatu used the increased spiritual energy of the event to break free from his prison inside the Tree of Time. After Vaatu was defeated, Avatar Korra decided to leave the spirit portals open, once again uniting the Spirit and the physical worlds."
    },
    {
      "body": "In 174 AG, a third spirit portal was created by accident when the ${link_0}'s spirit energy cannon overloaded and released an enormous discharge of spiritual energy. Korra attempted to control of the force of the explosion with energybending, and this tore open a new portal between the physical and Spirit Worlds. After the conclusion of the ${link_1}, Korra and ${link_2} used this portal to cross over to the Spirit World, where they traveled around for several days as a vacation. When they returned, however, they discovered that ${link_3}, the owner of the land surrounding the spirit portal, intended to turn the area into an amusement park and organize excursions into the Spirit World. Several spirits rebelled against this idea, with the ${link_4} even imploring Korra to close the spirit portals again, as it left the Spirit World vulnerable to be ravaged and exploited by humans.",
      "links": [
        {
          "body": "Earth Empire",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        },
        {
          "body": "invasion of the United Republic of Nations",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Wonyong Keum",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Wonyong_Keum",
            "page": "Wonyong_Keum"
          }
        },
        {
          "body": "dragon eel spirit",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon_eel_spirit",
            "page": "Dragon_eel_spirit"
          }
        }
      ],
      "section": [
        "Spirit World",
        "History"
      ],
      "text": "In 174 AG, a third spirit portal was created by accident when the Earth Empire's spirit energy cannon overloaded and released an enormous discharge of spiritual energy. Korra attempted to control of the force of the explosion with energybending, and this tore open a new portal between the physical and Spirit Worlds. After the conclusion of the invasion of the United Republic of Nations, Korra and Asami used this portal to cross over to the Spirit World, where they traveled around for several days as a vacation. When they returned, however, they discovered that Wonyong Keum, the owner of the land surrounding the spirit portal, intended to turn the area into an amusement park and organize excursions into the Spirit World. Several spirits rebelled against this idea, with the dragon eel spirit even imploring Korra to close the spirit portals again, as it left the Spirit World vulnerable to be ravaged and exploited by humans."
    },
    {
      "body": "After the conflict took a violent turn, during which the dragon eel spirit passed through and disfigured ${link_0}, the spirits destroyed the flower field to where Republic City's spirit portal led to as a warning to the humans to not step foot in their realm ever again: although the portal remained open and humans could still enter the Spirit World, thorny vines would shoot out of the ground and attack anyone in their vicinity the moment someone touched one of the scorched flowers.",
      "links": [
        {
          "body": "Tokuga",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tokuga",
            "page": "Tokuga"
          }
        }
      ],
      "section": [
        "Spirit World",
        "History"
      ],
      "text": "After the conflict took a violent turn, during which the dragon eel spirit passed through and disfigured Tokuga, the spirits destroyed the flower field to where Republic City's spirit portal led to as a warning to the humans to not step foot in their realm ever again: although the portal remained open and humans could still enter the Spirit World, thorny vines would shoot out of the ground and attack anyone in their vicinity the moment someone touched one of the scorched flowers."
    },
    {
      "body": "In certain places, the landscape of the Spirit World seems to conform closely to the area of the physical world that functions as its entry point, to the extent that a human crossing over might not immediately notice the difference. In other places, the geography of the Spirit World has no relation to the physical world and the two settings vary considerably.",
      "links": [],
      "section": [
        "Spirit World",
        "Overview"
      ],
      "text": "In certain places, the landscape of the Spirit World seems to conform closely to the area of the physical world that functions as its entry point, to the extent that a human crossing over might not immediately notice the difference. In other places, the geography of the Spirit World has no relation to the physical world and the two settings vary considerably."
    },
    {
      "body": "The lair of the spirit ${link_0}, the Face Stealer, lies below a gigantic, twisted tree. The land surrounding his covert is barren, dark, and scarcely inhabited, except for Koh's faceless victims and at least one gargantuan wolf. For anyone who enters his lair it is advisable to remain emotionless, as Koh steals the face of anyone who expresses their emotions in front of him.",
      "links": [
        {
          "body": "Koh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Koh",
            "page": "Koh"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Overview",
        "Realm of Koh"
      ],
      "text": "The lair of the spirit Koh, the Face Stealer, lies below a gigantic, twisted tree. The land surrounding his covert is barren, dark, and scarcely inhabited, except for Koh's faceless victims and at least one gargantuan wolf. For anyone who enters his lair it is advisable to remain emotionless, as Koh steals the face of anyone who expresses their emotions in front of him."
    },
    {
      "body": "Hai-Riyo Peak is a large mountain located near ${link_0}'s teashop in the Spirit World. Prior to Korra's arrival in 171 AG, the mountain was enveloped by vicious storm clouds and inhabited by numerous ${link_1}. Its summit is the nesting site for several ${link_2}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "dark spirits",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_spirits",
            "page": "Dark_spirits"
          }
        },
        {
          "body": "dragon bird spirits",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon_bird_spirit",
            "page": "Dragon_bird_spirit"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Overview",
        "Hai-Riyo Peak"
      ],
      "text": "Hai-Riyo Peak is a large mountain located near Iroh's teashop in the Spirit World. Prior to Korra's arrival in 171 AG, the mountain was enveloped by vicious storm clouds and inhabited by numerous dark spirits. Its summit is the nesting site for several dragon bird spirits."
    },
    {
      "body": "The Fog of Lost Souls is a prison for humans in the Spirit World. The fog spirit that is the prison has the ability to drive humans into madness, trapping them within their own darkest memory and subsequently prohibiting them from escaping. After ${link_0} was pulled to the Spirit World by ${link_1}, his soul became trapped in the fog, where he continued his self-praising monologue about being a conqueror and a ${link_2}-slayer. In 171 AG, ${link_3} trapped ${link_4} in the fog, and ${link_5}, ${link_6}, and ${link_7} also later became imprisoned there after setting out to rescue the young airbender. After Tenzin overcame his insecurity about his identity, the fog momentarily cleared and he was able to rescue his family. Sometime later, ${link_8} also threw ${link_9}'s soul inside the prison, condemning him to wander the fog for eternity.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "La",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/La",
            "page": "La"
          }
        },
        {
          "body": "moon",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Kya",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Kya",
            "page": "Kya"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Aiwei",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Aiwei",
            "page": "Aiwei"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Overview",
        "The Fog of Lost Souls"
      ],
      "text": "The Fog of Lost Souls is a prison for humans in the Spirit World. The fog spirit that is the prison has the ability to drive humans into madness, trapping them within their own darkest memory and subsequently prohibiting them from escaping. After Zhao was pulled to the Spirit World by La, his soul became trapped in the fog, where he continued his self-praising monologue about being a conqueror and a moon-slayer. In 171 AG, Unalaq trapped Jinora in the fog, and Tenzin, Kya, and Bumi also later became imprisoned there after setting out to rescue the young airbender. After Tenzin overcame his insecurity about his identity, the fog momentarily cleared and he was able to rescue his family. Sometime later, Zaheer also threw Aiwei's soul inside the prison, condemning him to wander the fog for eternity."
    },
    {
      "body": "Xai Bau's Grove is located deep in the Spirit World in a canyon densely populated by trees. Grass covers the entirety of the grove and numerous rocks are scattered throughout the area. A single stream with red water runs through the hilly woodland and the sky bears a yellow-orange hue.",
      "links": [],
      "section": [
        "Spirit World",
        "Overview",
        "Xai Bau's Grove"
      ],
      "text": "Xai Bau's Grove is located deep in the Spirit World in a canyon densely populated by trees. Grass covers the entirety of the grove and numerous rocks are scattered throughout the area. A single stream with red water runs through the hilly woodland and the sky bears a yellow-orange hue."
    },
    {
      "body": "As the natural bridge between the Spirit World and the physical world, the Avatar can use meditation to enter the Spirit World. Other spiritually enlightened humans, like ${link_0} and ${link_1}, can also meditate into the Spirit World. When doing so, the spirit leaves the physical body, which renders it defenseless. Prolonged separation of spirit and body may also prove to be fatal.",
      "links": [
        {
          "body": "Zaheer",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Aiwei",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Aiwei",
            "page": "Aiwei"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known passages",
        "Enlightened humans"
      ],
      "text": "As the natural bridge between the Spirit World and the physical world, the Avatar can use meditation to enter the Spirit World. Other spiritually enlightened humans, like Zaheer and Aiwei, can also meditate into the Spirit World. When doing so, the spirit leaves the physical body, which renders it defenseless. Prolonged separation of spirit and body may also prove to be fatal."
    },
    {
      "body": "Situated in the ${link_0}, the Forgetful Valley is comprised of thick wilderness and four mystical, crystal-clear pools of water. On occasion, usually once a season, a ${link_1} will drink from one of the four pools. The valley is home to the ${link_2}, whose presence can be discerned upon observing the various ${link_3} and ${link_4}; they exhibit face-like markings when the spirit is nearby.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "wolf spirit",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Wolf_spirit",
            "page": "Wolf_spirit"
          }
        },
        {
          "body": "Mother of Faces",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Mother_of_Faces",
            "page": "Mother_of_Faces"
          }
        },
        {
          "body": "fauna",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Fauna_in_the_World_of_Avatar",
            "page": "Fauna_in_the_World_of_Avatar"
          }
        },
        {
          "body": "flora",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Flora_in_the_World_of_Avatar",
            "page": "Flora_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known passages",
        "Forgetful Valley"
      ],
      "text": "Situated in the Fire Nation, the Forgetful Valley is comprised of thick wilderness and four mystical, crystal-clear pools of water. On occasion, usually once a season, a wolf spirit will drink from one of the four pools. The valley is home to the Mother of Faces, whose presence can be discerned upon observing the various fauna and flora; they exhibit face-like markings when the spirit is nearby."
    },
    {
      "body": "A solstice is an astronomical event that occurs twice a year. During these solstices, the Spirit World and the physical world are significantly closer to each other compared to the rest of the year. Therefore, during one of the solstices, it is somewhat easier for one to cross into the Spirit World. ${link_0} took advantage of this during the ${link_1} to talk to Avatar ${link_2} about ${link_3}. Avatar Roku also used the winter solstice sun to aid him in entering the ${link_4}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "winter solstice",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Winter_solstice",
            "page": "Winter_solstice"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known passages",
        "Solstices"
      ],
      "text": "A solstice is an astronomical event that occurs twice a year. During these solstices, the Spirit World and the physical world are significantly closer to each other compared to the rest of the year. Therefore, during one of the solstices, it is somewhat easier for one to cross into the Spirit World. Aang took advantage of this during the winter solstice to talk to Avatar Roku about Sozin's Comet. Avatar Roku also used the winter solstice sun to aid him in entering the Avatar State."
    },
    {
      "body": "The Spirit Oasis is a verdant oasis located in the Northern Water Tribe at the base of a waterfall behind the ${link_0}'s ${link_1}. It is the center of all the spiritual energy in the entire North Pole and, unlike the rest of the region, has a warmer climate able to facilitate the growth of vegetation. Two koi fish swim in a central pool of the oasis and are the mortal forms of ${link_2} and ${link_3}, the Moon and the Ocean Spirits. Under normal circumstances, if one sets foot in the pool it acts normal. However, sometimes it can open as a portal to the Spirit World, and even be used to drag people nearby it to the Spirit World.",
      "links": [
        {
          "body": "chief",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "palace",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Water_Tribe_Royal_Palace",
            "page": "Northern_Water_Tribe_Royal_Palace"
          }
        },
        {
          "body": "Tui",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Tui",
            "page": "Tui"
          }
        },
        {
          "body": "La",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/La",
            "page": "La"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known passages",
        "Spirit Oasis"
      ],
      "text": "The Spirit Oasis is a verdant oasis located in the Northern Water Tribe at the base of a waterfall behind the chief's palace. It is the center of all the spiritual energy in the entire North Pole and, unlike the rest of the region, has a warmer climate able to facilitate the growth of vegetation. Two koi fish swim in a central pool of the oasis and are the mortal forms of Tui and La, the Moon and the Ocean Spirits. Under normal circumstances, if one sets foot in the pool it acts normal. However, sometimes it can open as a portal to the Spirit World, and even be used to drag people nearby it to the Spirit World."
    },
    {
      "body": "Up until 174 AG, the world had two spirit portals, one located at the ${link_0} and one at the North Pole. Both poles once had lush forests that were the home to many spirits. However, in 151 AG, ${link_1} destroyed the forest in the North while pursuing a group of hostile ${link_2}, which angered the spirits, causing them to attack the Northern Water Tribe that night.",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "barbarians",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Barbarians",
            "page": "Barbarians"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known passages",
        "Spirit portals"
      ],
      "text": "Up until 174 AG, the world had two spirit portals, one located at the South Pole and one at the North Pole. Both poles once had lush forests that were the home to many spirits. However, in 151 AG, Tonraq destroyed the forest in the North while pursuing a group of hostile barbarians, which angered the spirits, causing them to attack the Northern Water Tribe that night."
    },
    {
      "body": "During the ${link_0}, the ${link_1} started raging over the forest at the ${link_2}, covering it and the spirit portal located there within a thick layer of ice. The forest was later restored by Avatar ${link_3} when she reopened the portal, restoring the ${link_4}. This could be done in the South only during the winter solstice. There is also a spirit portal at the North Pole that would not have to be opened during the solstice, due to the North's stronger relationship to the spirits. When both portals are open, spirits and humans can pass from one pole to the other freely. These portals were closed by Wan in order to create and maintain balance between the spirits and humankind, as well as to keep any human from ever physically crossing over to the Spirit World again and risk freeing Vaatu.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Everstorm",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Everstorm",
            "page": "Everstorm"
          }
        },
        {
          "body": "South Pole",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Korra",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "southern lights",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_lights#Southern_lights",
            "page": "Spirit_lights"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known passages",
        "Spirit portals"
      ],
      "text": "During the Hundred Year War, the Everstorm started raging over the forest at the South Pole, covering it and the spirit portal located there within a thick layer of ice. The forest was later restored by Avatar Korra when she reopened the portal, restoring the southern lights. This could be done in the South only during the winter solstice. There is also a spirit portal at the North Pole that would not have to be opened during the solstice, due to the North's stronger relationship to the spirits. When both portals are open, spirits and humans can pass from one pole to the other freely. These portals were closed by Wan in order to create and maintain balance between the spirits and humankind, as well as to keep any human from ever physically crossing over to the Spirit World again and risk freeing Vaatu."
    },
    {
      "body": "Those two portals lead to a field where ${link_0} and Vaatu battled during Harmonic Convergence. The plain consists of streams of water and rocky formations and is enclosed by a chain of mountains. In its center stands the Tree of Time, where Vaatu was imprisoned after his defeat.",
      "links": [
        {
          "body": "Raava",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Raava",
            "page": "Raava"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known passages",
        "Spirit portals"
      ],
      "text": "Those two portals lead to a field where Raava and Vaatu battled during Harmonic Convergence. The plain consists of streams of water and rocky formations and is enclosed by a chain of mountains. In its center stands the Tree of Time, where Vaatu was imprisoned after his defeat."
    },
    {
      "body": "After ${link_0} ${link_1} ${link_2} in 174 AG, a third spirit portal was created in the heart of the metropolis. When Kuvira fired her ${link_3} from inside the city's ${link_4}, the spiritual energy overload tore open a new passage between the two worlds. This portal leads to a meadow surrounded by mountains, and the trees that grow there are similar in appearance to the Tree of Time.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "attacked",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "spirit energy cannon",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_energy_cannon",
            "page": "Spirit_energy_cannon"
          }
        },
        {
          "body": "Spirit Wilds",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known passages",
        "Spirit portals"
      ],
      "text": "After Kuvira attacked Republic City in 174 AG, a third spirit portal was created in the heart of the metropolis. When Kuvira fired her spirit energy cannon from inside the city's Spirit Wilds, the spiritual energy overload tore open a new passage between the two worlds. This portal leads to a meadow surrounded by mountains, and the trees that grow there are similar in appearance to the Tree of Time."
    },
    {
      "body": "The entities of the Spirit World are affiliated with either light or darkness, usually depending on who, Raava or Vaatu respectively, won the last Harmonic Convergence. Most spirits resemble some aspect of nature and occasionally, humans can transcend the mortal realm after death and become spirits. A special relationship exists between the great light and dark spirits, as one cannot exist without the other, and even if one manages to defeat the other, their counterpart will always reemerge again over time.",
      "links": [],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "The entities of the Spirit World are affiliated with either light or darkness, usually depending on who, Raava or Vaatu respectively, won the last Harmonic Convergence. Most spirits resemble some aspect of nature and occasionally, humans can transcend the mortal realm after death and become spirits. A special relationship exists between the great light and dark spirits, as one cannot exist without the other, and even if one manages to defeat the other, their counterpart will always reemerge again over time."
    },
    {
      "body": "${link_0}: A lemur-like spirit who guarded a Spirit Oasis in the Spirit Wilds and was friends with ${link_1}.",
      "links": [
        {
          "body": "Aye-aye spirit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aye-aye_spirit",
            "page": "Aye-aye_spirit"
          }
        },
        {
          "body": "Wan",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Wan",
            "page": "Wan"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Aye-aye spirit: A lemur-like spirit who guarded a Spirit Oasis in the Spirit Wilds and was friends with Wan."
    },
    {
      "body": "${link_0}: A monkey-like spirit that spends his time meditating.",
      "links": [
        {
          "body": "Baboon spirit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Baboon_spirit",
            "page": "Baboon_spirit"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Baboon spirit: A monkey-like spirit that spends his time meditating."
    },
    {
      "body": "${link_0}: A dragonfly bunny spirit who befriended Bumi at the ${link_1}.",
      "links": [
        {
          "body": "Bum-Ju",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Bum-Ju",
            "page": "Bum-Ju"
          }
        },
        {
          "body": "Eastern Air Temple",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Bum-Ju: A dragonfly bunny spirit who befriended Bumi at the Eastern Air Temple."
    },
    {
      "body": "${link_0}: A primate-like spirit whose face was stolen by Koh, the Face Stealer, prior to Aang's arrival in the Spirit World.",
      "links": [
        {
          "body": "Curly-tailed blue nose",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Curly-tailed_blue_nose",
            "page": "Curly-tailed_blue_nose"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Curly-tailed blue nose: A primate-like spirit whose face was stolen by Koh, the Face Stealer, prior to Aang's arrival in the Spirit World."
    },
    {
      "body": "${link_0}: Unbalanced spirits in whom the darkness has taken over the light.",
      "links": [
        {
          "body": "Dark spirits",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Dark spirits: Unbalanced spirits in whom the darkness has taken over the light."
    },
    {
      "body": "${link_0}: Chimerical creatures often found nesting on top of large mountains.",
      "links": [
        {
          "body": "Dragon bird spirits",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon_bird_spirit",
            "page": "Dragon_bird_spirit"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Dragon bird spirits: Chimerical creatures often found nesting on top of large mountains."
    },
    {
      "body": "${link_0}: A chimerical spirit who, by 174 ${link_1}, came to inhabit the Spirit Wilds of Republic City.",
      "links": [
        {
          "body": "Dragon eel spirit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon_eel_spirit",
            "page": "Dragon_eel_spirit"
          }
        },
        {
          "body": "AG",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Dragon eel spirit: A chimerical spirit who, by 174 AG, came to inhabit the Spirit Wilds of Republic City."
    },
    {
      "body": "${link_0}: Bunny-like spirits capable of flight that inhabit the Eastern Air Temple.",
      "links": [
        {
          "body": "Dragonfly bunny spirits",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dragonfly_bunny_spirit",
            "page": "Dragonfly_bunny_spirit"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Dragonfly bunny spirits: Bunny-like spirits capable of flight that inhabit the Eastern Air Temple."
    },
    {
      "body": "${link_0}: Roku's ${link_1} who died along with Roku during the volcanic eruption that destroyed his ${link_2}. He can now communicate telepathically with people from the mortal world and give them insight on the Spirit World. As a spirit, Fang is intangible and invisible.",
      "links": [
        {
          "body": "Fang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fang",
            "page": "Fang"
          }
        },
        {
          "body": "dragon",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon",
            "page": "Dragon"
          }
        },
        {
          "body": "village",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Roku%27s_island",
            "page": "Roku%27s_island"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Fang: Roku's dragon who died along with Roku during the volcanic eruption that destroyed his village. He can now communicate telepathically with people from the mortal world and give them insight on the Spirit World. As a spirit, Fang is intangible and invisible."
    },
    {
      "body": "${link_0}: A spirit that makes up the Fog of Lost Souls. It possesses the ability to effect the minds of individuals who wander through it, effectively driving them insane by imprisoning them in their own darkest memories.",
      "links": [
        {
          "body": "Fog Spirit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fog_of_Lost_Souls",
            "page": "Fog_of_Lost_Souls"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Fog Spirit: A spirit that makes up the Fog of Lost Souls. It possesses the ability to effect the minds of individuals who wander through it, effectively driving them insane by imprisoning them in their own darkest memories."
    },
    {
      "body": "${link_0}: An amphibian-like spirit who inhabited the Spirit Wilds that increased in size when provoked.",
      "links": [
        {
          "body": "Frog spirit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Frog_spirit",
            "page": "Frog_spirit"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Frog spirit: An amphibian-like spirit who inhabited the Spirit Wilds that increased in size when provoked."
    },
    {
      "body": "General ${link_0}: A giant humanoid spirit who protected Lady ${link_1} during the ${link_2} while she tended to the seashore of what would later become Earth Kingdom territory. He has the ability to cloak himself in an earth armor to enhance his strength and durability.",
      "links": [
        {
          "body": "Old Iron",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Old_Iron",
            "page": "Old_Iron"
          }
        },
        {
          "body": "Tienhai",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tienhai",
            "page": "Tienhai"
          }
        },
        {
          "body": "era of Raava",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Era_of_Raava",
            "page": "Era_of_Raava"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "General Old Iron: A giant humanoid spirit who protected Lady Tienhai during the era of Raava while she tended to the seashore of what would later become Earth Kingdom territory. He has the ability to cloak himself in an earth armor to enhance his strength and durability."
    },
    {
      "body": "${link_0}: Chimerical creatures often found near mountains.",
      "links": [
        {
          "body": "Guardian spirits",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Guardian_spirit",
            "page": "Guardian_spirit"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Guardian spirits: Chimerical creatures often found near mountains."
    },
    {
      "body": "${link_0}: Typically taking the form of a panda bear, he manifests himself as a ferocious monster when provoked. A spirit of a dense ${link_1} near ${link_2}, Hei Bai retaliated when the Fire Nation destroyed his home. Later, he aided Aang during his journey in the Spirit World.",
      "links": [
        {
          "body": "Hei Bai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hei_Bai",
            "page": "Hei_Bai"
          }
        },
        {
          "body": "forest",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Scorched_forest",
            "page": "Scorched_forest"
          }
        },
        {
          "body": "Senlin Village",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Senlin_Village",
            "page": "Senlin_Village"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Hei Bai: Typically taking the form of a panda bear, he manifests himself as a ferocious monster when provoked. A spirit of a dense forest near Senlin Village, Hei Bai retaliated when the Fire Nation destroyed his home. Later, he aided Aang during his journey in the Spirit World."
    },
    {
      "body": "${link_0}: Due to his strong connection with the spirits, Iroh was able to leave his mortal body after death to reside in the Spirit World, where he serves tea to numerous spirits in a teashop similar to the ${link_1} he had in ${link_2}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "one",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Iroh: Due to his strong connection with the spirits, Iroh was able to leave his mortal body after death to reside in the Spirit World, where he serves tea to numerous spirits in a teashop similar to the one he had in Ba Sing Se."
    },
    {
      "body": "${link_0}: The Kemurikage are spirits that haunted warlords in the Fire Islands centuries prior to the formation of the Fire Nation. They became part of Fire Nation legend after they departed from the mortal realm and are feared by children from the ${link_1}, as they supposedly abduct young individuals who misbehave.",
      "links": [
        {
          "body": "Kemurikage",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kemurikage",
            "page": "Kemurikage"
          }
        },
        {
          "body": "Fire Nation Capital",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Kemurikage: The Kemurikage are spirits that haunted warlords in the Fire Islands centuries prior to the formation of the Fire Nation. They became part of Fire Nation legend after they departed from the mortal realm and are feared by children from the Fire Nation Capital, as they supposedly abduct young individuals who misbehave."
    },
    {
      "body": "${link_0}: A couple spirits who frequented the aye-aye spirit's oasis in the Spirit Wilds. They were the first spirits to sympathize with Wan.",
      "links": [
        {
          "body": "Kind spirits",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kind_spirits",
            "page": "Kind_spirits"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Kind spirits: A couple spirits who frequented the aye-aye spirit's oasis in the Spirit Wilds. They were the first spirits to sympathize with Wan."
    },
    {
      "body": "${link_0}: Fox-like spirits that assist Wan Shi Tong by gathering old books and parchments to compile more information.",
      "links": [
        {
          "body": "Knowledge Seekers",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Knowledge_Seekers",
            "page": "Knowledge_Seekers"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Knowledge Seekers: Fox-like spirits that assist Wan Shi Tong by gathering old books and parchments to compile more information."
    },
    {
      "body": "${link_0}, the Face Stealer: An ancient, malicious spirit that steals the face of any creature who shows a sign of emotion in his presence. As one of the oldest spirits in existence, he is extremely knowledgeable and possesses the ability to predict future events. Avatar Kuruk holds a grudge against him and attempted to kill him for capturing his fiancée, ${link_1}.",
      "links": [
        {
          "body": "Koh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Koh",
            "page": "Koh"
          }
        },
        {
          "body": "Ummi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ummi",
            "page": "Ummi"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Koh, the Face Stealer: An ancient, malicious spirit that steals the face of any creature who shows a sign of emotion in his presence. As one of the oldest spirits in existence, he is extremely knowledgeable and possesses the ability to predict future events. Avatar Kuruk holds a grudge against him and attempted to kill him for capturing his fiancée, Ummi."
    },
    {
      "body": "${link_0}: a small yellow spirit with two ears resembling leaves on its head. He was one of the many spirits that migrated to the physical world after the Harmonic Convergence of 171 AG.",
      "links": [
        {
          "body": "Light spirit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Light_spirit",
            "page": "Light_spirit"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Light spirit: a small yellow spirit with two ears resembling leaves on its head. He was one of the many spirits that migrated to the physical world after the Harmonic Convergence of 171 AG."
    },
    {
      "body": "${link_0}: May-Jim is frog spirit with two heads, a female one named May on its left shoulder and a male one named Jim on its right.",
      "links": [
        {
          "body": "May-Jim",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/May-Jim",
            "page": "May-Jim"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "May-Jim: May-Jim is frog spirit with two heads, a female one named May on its left shoulder and a male one named Jim on its right."
    },
    {
      "body": "${link_0}: Moth-like spirits branded by expressive markings that are highly attracted to light.",
      "links": [
        {
          "body": "Moth wasps",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Moth_wasp",
            "page": "Moth_wasp"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Moth wasps: Moth-like spirits branded by expressive markings that are highly attracted to light."
    },
    {
      "body": "${link_0}: A giant woman with various blank faces encircling her head, she has the ability to give someone a new face. She appears in the ${link_1} after her wolf spirit has drank from one of the pools, and it is there she will give her gift of a new face.",
      "links": [
        {
          "body": "Mother of Faces",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mother_of_Faces",
            "page": "Mother_of_Faces"
          }
        },
        {
          "body": "Forgetful Valley",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Forgetful_Valley",
            "page": "Forgetful_Valley"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Mother of Faces: A giant woman with various blank faces encircling her head, she has the ability to give someone a new face. She appears in the Forgetful Valley after her wolf spirit has drank from one of the pools, and it is there she will give her gift of a new face."
    },
    {
      "body": "${link_0}: The spirit of the ${link_1}, located in the Fire Nation, where villagers worship and build statues of her in her honor. She was once a human who had a strong connection to the spirits, and upon death, she transcended the mortal plane and became a spirit. She expressed her gratitude to ${link_2} for fulfilling her duties after she fled ${link_3} because of the surrounding river's pollution. The Painted Lady is known to possess healing and spiritual abilities.",
      "links": [
        {
          "body": "Painted Lady",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Painted_Lady",
            "page": "Painted_Lady"
          }
        },
        {
          "body": "Jang Hui River",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jang_Hui_River",
            "page": "Jang_Hui_River"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Jang Hui",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Jang_Hui",
            "page": "Jang_Hui"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Painted Lady: The spirit of the Jang Hui River, located in the Fire Nation, where villagers worship and build statues of her in her honor. She was once a human who had a strong connection to the spirits, and upon death, she transcended the mortal plane and became a spirit. She expressed her gratitude to Katara for fulfilling her duties after she fled Jang Hui because of the surrounding river's pollution. The Painted Lady is known to possess healing and spiritual abilities."
    },
    {
      "body": "${link_0} ${link_1}: After Tui was killed by ${link_2} ${link_3}, Princess Yue sacrificed her life to revive the Moon Spirit, consequently gaining waterbending abilities. Because of her father's prior exchange with Tui, she has become the new Moon Spirit.",
      "links": [
        {
          "body": "Princess",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Admiral",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Zhao",
            "page": "Zhao"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Princess Yue: After Tui was killed by Admiral Zhao, Princess Yue sacrificed her life to revive the Moon Spirit, consequently gaining waterbending abilities. Because of her father's prior exchange with Tui, she has become the new Moon Spirit."
    },
    {
      "body": "${link_0}: The great spirit of light, peace, and balance in the world. Raava had dueled her counterpart, Vaatu, the spirit of chaos and darkness, since the beginning of time, before ${link_1} was tricked into setting him free.",
      "links": [
        {
          "body": "Raava",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Raava",
            "page": "Raava"
          }
        },
        {
          "body": "Wan",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Wan",
            "page": "Wan"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Raava: The great spirit of light, peace, and balance in the world. Raava had dueled her counterpart, Vaatu, the spirit of chaos and darkness, since the beginning of time, before Wan was tricked into setting him free."
    },
    {
      "body": "${link_0}: An enormous spirit whose body and limbs are made out of solid rock.",
      "links": [
        {
          "body": "Rock spirit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Rock_spirit",
            "page": "Rock_spirit"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Rock spirit: An enormous spirit whose body and limbs are made out of solid rock."
    },
    {
      "body": "Lady ${link_0} : A giant humanoid spirit, she was a close friend to General Old Iron, who was also her guardian. However, while he viewed humans warily due to tales of their hostile interactions with spirits, she was fascinated with them and became their protector. Unfortunately, the humans actions later on eventually led to her death. To appease Old Iron, the humans were required to take part in a festival that commemorated her memory.",
      "links": [
        {
          "body": "Tienhai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tienhai",
            "page": "Tienhai"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Lady Tienhai : A giant humanoid spirit, she was a close friend to General Old Iron, who was also her guardian. However, while he viewed humans warily due to tales of their hostile interactions with spirits, she was fascinated with them and became their protector. Unfortunately, the humans actions later on eventually led to her death. To appease Old Iron, the humans were required to take part in a festival that commemorated her memory."
    },
    {
      "body": "${link_0} and ${link_1}: Near the beginning of the world's creation, the Moon and Ocean Spirits departed for the mortal world and manifested themselves as two koi fish in the sacred Spirit Oasis of the North Pole. Tui and La were the original ${link_2}, with La being the source and Tui being the originator.",
      "links": [
        {
          "body": "Tui",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tui",
            "page": "Tui"
          }
        },
        {
          "body": "La",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/La",
            "page": "La"
          }
        },
        {
          "body": "waterbenders",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Tui and La: Near the beginning of the world's creation, the Moon and Ocean Spirits departed for the mortal world and manifested themselves as two koi fish in the sacred Spirit Oasis of the North Pole. Tui and La were the original waterbenders, with La being the source and Tui being the originator."
    },
    {
      "body": "${link_0}: The great spirit of darkness and chaos in the world and the first to break the barrier that separated the mortal world from the Spirit World. He and Raava had dueled since the beginning of time before he tricked Wan into freeing him from Raava's restraint.",
      "links": [
        {
          "body": "Vaatu",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Vaatu",
            "page": "Vaatu"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Vaatu: The great spirit of darkness and chaos in the world and the first to break the barrier that separated the mortal world from the Spirit World. He and Raava had dueled since the beginning of time before he tricked Wan into freeing him from Raava's restraint."
    },
    {
      "body": "${link_0}: Wan Shi Tong brought his immense ${link_1} of knowledge into the mortal world in the hopes of bettering mankind with wisdom. With the use of fox-like animals known as ${link_2}, he seeks out valuable sources of knowledge, varying from scrolls to ancient tomes. The library, originally located in the ${link_3}, was freely available to anyone who wished to use it until mortals used the knowledge contained therein to further warfare, prompting Wan Shi Tong to bury the library beneath the sand and make it impossible to find. He typically takes the shape of a gigantic black-and-white barn owl, but when angered becomes a wyvern-like creature.",
      "links": [
        {
          "body": "Wan Shi Tong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wan_Shi_Tong",
            "page": "Wan_Shi_Tong"
          }
        },
        {
          "body": "library",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "Knowledge Seekers",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Knowledge_Seekers",
            "page": "Knowledge_Seekers"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Wan Shi Tong: Wan Shi Tong brought his immense library of knowledge into the mortal world in the hopes of bettering mankind with wisdom. With the use of fox-like animals known as Knowledge Seekers, he seeks out valuable sources of knowledge, varying from scrolls to ancient tomes. The library, originally located in the Si Wong Desert, was freely available to anyone who wished to use it until mortals used the knowledge contained therein to further warfare, prompting Wan Shi Tong to bury the library beneath the sand and make it impossible to find. He typically takes the shape of a gigantic black-and-white barn owl, but when angered becomes a wyvern-like creature."
    },
    {
      "body": "${link_0}: A giant, ferocious wolf spirit with a prominent image of a face on its chest, which Aang's face morphed into when feeling its presence. This spirit stopped Team Avatar when they attempted to enter ${link_1}. It can swallow fire and throw up ${link_2}.",
      "links": [
        {
          "body": "Wolf spirit",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wolf_spirit",
            "page": "Wolf_spirit"
          }
        },
        {
          "body": "Hira'a",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hira%27a",
            "page": "Hira%27a"
          }
        },
        {
          "body": "moth wasps",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Moth_wasp",
            "page": "Moth_wasp"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Known spirits"
      ],
      "text": "Wolf spirit: A giant, ferocious wolf spirit with a prominent image of a face on its chest, which Aang's face morphed into when feeling its presence. This spirit stopped Team Avatar when they attempted to enter Hira'a. It can swallow fire and throw up moth wasps."
    },
    {
      "body": "There are no bathrooms in the Spirit World.",
      "links": [],
      "section": [
        "Spirit World",
        "Trivia"
      ],
      "text": "There are no bathrooms in the Spirit World."
    },
    {
      "body": "Spirits have the ability to take over a human's body for short periods of time. When this happens, the human takes on some of the spirit's physical characteristics. However, this possession is not without danger for the host; if a spirit stays in the body for too long, the host will die. During Wan's time, ${link_0} was altered to have tree-like characteristics and another hunter had lemur-like traits after being possessed.",
      "links": [
        {
          "body": "Yao",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Yao",
            "page": "Yao"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Trivia"
      ],
      "text": "Spirits have the ability to take over a human's body for short periods of time. When this happens, the human takes on some of the spirit's physical characteristics. However, this possession is not without danger for the host; if a spirit stays in the body for too long, the host will die. During Wan's time, Yao was altered to have tree-like characteristics and another hunter had lemur-like traits after being possessed."
    },
    {
      "body": "Several spirits are known to have counterparts, including ${link_0} and ${link_1}, ${link_2} and the ${link_3}, and ${link_4} and ${link_5}.",
      "links": [
        {
          "body": "Tui",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tui",
            "page": "Tui"
          }
        },
        {
          "body": "La",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/La",
            "page": "La"
          }
        },
        {
          "body": "Koh",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Koh",
            "page": "Koh"
          }
        },
        {
          "body": "Mother of Faces",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Mother_of_Faces",
            "page": "Mother_of_Faces"
          }
        },
        {
          "body": "Raava",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Raava",
            "page": "Raava"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Vaatu",
            "page": "Vaatu"
          }
        }
      ],
      "section": [
        "Spirit World",
        "Trivia"
      ],
      "text": "Several spirits are known to have counterparts, including Tui and La, Koh and the Mother of Faces, and Raava and Vaatu."
    },
    {
      "body": "A corporeal form is necessary in order to bend in the Spirit World. As such, only humans who enter the Spirit World through the spirit portals will retain their bending abilities.",
      "links": [],
      "section": [
        "Spirit World",
        "Trivia"
      ],
      "text": "A corporeal form is necessary in order to bend in the Spirit World. As such, only humans who enter the Spirit World through the spirit portals will retain their bending abilities."
    },
    {
      "body": "Wan is the first known human to enter the Spirit World.",
      "links": [],
      "section": [
        "Spirit World",
        "Trivia"
      ],
      "text": "Wan is the first known human to enter the Spirit World."
    },
    {
      "body": "Gravity works different in the Spirit World than in the mortal world, as everyone inside Wan Shi Tong's Library could walk normally on the pathways even though the building was oriented upside-down in a tree.",
      "links": [],
      "section": [
        "Spirit World",
        "Trivia"
      ],
      "text": "Gravity works different in the Spirit World than in the mortal world, as everyone inside Wan Shi Tong's Library could walk normally on the pathways even though the building was oriented upside-down in a tree."
    },
    {
      "body": "An incorporeal being can teleport to any location or person they think of within the Spirit World.",
      "links": [],
      "section": [
        "Spirit World",
        "Trivia"
      ],
      "text": "An incorporeal being can teleport to any location or person they think of within the Spirit World."
    },
    {
      "body": "Food in the Spirit World does not affect a person's weight.",
      "links": [],
      "section": [
        "Spirit World",
        "Trivia"
      ],
      "text": "Food in the Spirit World does not affect a person's weight."
    },
    {
      "body": "A person's soul can only remain in the Spirit World for a short period of time. A prolonged absence from the body causes strain that inevitably leads to an individual's death; Katara noted that it was amazing that Jinora managed to survive her imprisonment in the Spirit World for a week.",
      "links": [],
      "section": [
        "Spirit World",
        "Trivia"
      ],
      "text": "A person's soul can only remain in the Spirit World for a short period of time. A prolonged absence from the body causes strain that inevitably leads to an individual's death; Katara noted that it was amazing that Jinora managed to survive her imprisonment in the Spirit World for a week."
    },
    {
      "body": "The creators originally intended for there to be four portals to the Spirit World, but decided that it would be confusing and ultimately reduced the number to two.",
      "links": [],
      "section": [
        "Spirit World",
        "Trivia"
      ],
      "text": "The creators originally intended for there to be four portals to the Spirit World, but decided that it would be confusing and ultimately reduced the number to two."
    },
    {
      "body": "The Spirit World is not primarily an afterlife; however, humans who were naturally imbued with spiritual energy or developed a strong connection to the Spirit World during their lifetimes can transcend the mortal plane following their death and embody some form of energy in the spirit realm. Humans who become spirits through this process become more like an essence with the passage of time, as memories of their corporeal forms become less prominent. This accounts for why the Painted Lady appears ghost-like, whereas Iroh still largely resembles his human form.",
      "links": [],
      "section": [
        "Spirit World",
        "Trivia"
      ],
      "text": "The Spirit World is not primarily an afterlife; however, humans who were naturally imbued with spiritual energy or developed a strong connection to the Spirit World during their lifetimes can transcend the mortal plane following their death and embody some form of energy in the spirit realm. Humans who become spirits through this process become more like an essence with the passage of time, as memories of their corporeal forms become less prominent. This accounts for why the Painted Lady appears ghost-like, whereas Iroh still largely resembles his human form."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Spiritual beliefs in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spiritual_beliefs_in_the_World_of_Avatar",
            "page": "Spiritual_beliefs_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Spirit World",
        "See also"
      ],
      "text": "Spiritual beliefs in the World of Avatar"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Spirit_World",
    "file": "avatar.wikia.com/wiki/Spirit_World.html",
    "page": "Spirit_World",
    "title": "Spirit World"
  }
}