{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "external": false,
        "href": "/wiki/Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Suki's strong, assertive personality was sometimes a hindrance; however, her compassion and loyalty allowed her to make many allies.",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Suki",
            "page": "Suki"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "Suki's relationships"
      ],
      "text": "This page is comprised of Suki's relationships with other characters in the World of Avatar. Suki's strong, assertive personality was sometimes a hindrance; however, her compassion and loyalty allowed her to make many allies."
    },
    {
      "body": "Suki and ${link_0} first met when she and the other ${link_1} ambushed him, ${link_2}, and ${link_3}, who were temporarily visiting her homeland of ${link_4}. At first, the two were not on the best of terms with Sokka's sexist attitude irritating Suki. After Suki humiliated him during a sparring match, however, Sokka was humbled and personally asked Suki to train him. Suki accepted his pleas on the conditions that Sokka follow all of her traditions and rules, which included wearing the warriors' dress. Eventually, after continuous practicing, Sokka was able to successfully block Suki's attack and knock her down. The two continued to train until ${link_5} attacked the island. The two worked together in an attempt to defeat Zuko, but to no avail. Realizing they needed to part ways, Suki accepted Sokka apology for his previous remarks and kissed him on the cheek, causing him to blush.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Love interest",
        "Sokka"
      ],
      "text": "Suki and Sokka first met when she and the other Kyoshi Warriors ambushed him, Aang, and Katara, who were temporarily visiting her homeland of Kyoshi Island. At first, the two were not on the best of terms with Sokka's sexist attitude irritating Suki. After Suki humiliated him during a sparring match, however, Sokka was humbled and personally asked Suki to train him. Suki accepted his pleas on the conditions that Sokka follow all of her traditions and rules, which included wearing the warriors' dress. Eventually, after continuous practicing, Sokka was able to successfully block Suki's attack and knock her down. The two continued to train until Zuko attacked the island. The two worked together in an attempt to defeat Zuko, but to no avail. Realizing they needed to part ways, Suki accepted Sokka apology for his previous remarks and kissed him on the cheek, causing him to blush."
    },
    {
      "body": "After Aang was arrested in ${link_0} and held guilty for murder in a past life, Sokka and Katara journeyed to Kyoshi Island to gather information that would prove his innocence. When Sokka asked ${link_1} as to Suki's whereabouts, Oyaji informed him that Suki and the other warriors had left to fight in the ${link_2}. Sokka was clearly disappointed by the news of her absence.",
      "links": [
        {
          "body": "Chin Village",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Chin_Village",
            "page": "Chin_Village"
          }
        },
        {
          "body": "Oyaji",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Oyaji",
            "page": "Oyaji"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Love interest",
        "Sokka"
      ],
      "text": "After Aang was arrested in Chin Village and held guilty for murder in a past life, Sokka and Katara journeyed to Kyoshi Island to gather information that would prove his innocence. When Sokka asked Oyaji as to Suki's whereabouts, Oyaji informed him that Suki and the other warriors had left to fight in the Hundred Year War. Sokka was clearly disappointed by the news of her absence."
    },
    {
      "body": "Sokka and Suki were reunited on the team's journey to ${link_0}. Clad in a security guard outfit and without her make-up, Suki grabbed and interrogated Sokka, who did not recognize her at first though soon realized her identity when she kissed him on the cheek. Happily reunited, Suki decided to help Sokka and the rest of ${link_1} in escorting a group of refugees across the ${link_2}. Much to her annoyance, Sokka was very protective of her due to his traumatic experience with ${link_3} ${link_4}. That night, Sokka explained that he was simply being overprotective because he did not want to lose another person he cared about. Suki understood and expressed how important Sokka was to her and that she had missed him, before leaning in to kiss him, though Sokka drew back before they connected. The following day, Suki apologized for trying to kiss Sokka but was cut off when he kissed her twice.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Serpent's Pass",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Serpent%27s_Pass",
            "page": "Serpent%27s_Pass"
          }
        },
        {
          "body": "Princess",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Yue",
            "page": "Yue"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Love interest",
        "Sokka"
      ],
      "text": "Sokka and Suki were reunited on the team's journey to Ba Sing Se. Clad in a security guard outfit and without her make-up, Suki grabbed and interrogated Sokka, who did not recognize her at first though soon realized her identity when she kissed him on the cheek. Happily reunited, Suki decided to help Sokka and the rest of Team Avatar in escorting a group of refugees across the Serpent's Pass. Much to her annoyance, Sokka was very protective of her due to his traumatic experience with Princess Yue. That night, Sokka explained that he was simply being overprotective because he did not want to lose another person he cared about. Suki understood and expressed how important Sokka was to her and that she had missed him, before leaning in to kiss him, though Sokka drew back before they connected. The following day, Suki apologized for trying to kiss Sokka but was cut off when he kissed her twice."
    },
    {
      "body": "Sokka and Suki did not meet again for a while as Suki was soon captured by ${link_0} and imprisoned. Azula taunted Sokka, mockingly stating that Suki used to mention him all the time while imprisoned, but gave up on him when he never came to rescue her. This caused Sokka to shed a single tear and charge at Azula in blind emotional rage, wasting the remaining time the team had to find the ${link_1} during the ${link_2}.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "eclipse",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Love interest",
        "Sokka"
      ],
      "text": "Sokka and Suki did not meet again for a while as Suki was soon captured by Azula and imprisoned. Azula taunted Sokka, mockingly stating that Suki used to mention him all the time while imprisoned, but gave up on him when he never came to rescue her. This caused Sokka to shed a single tear and charge at Azula in blind emotional rage, wasting the remaining time the team had to find the Fire Lord during the eclipse."
    },
    {
      "body": "Sokka and Suki finally reunited again at the ${link_0}, where she was being held. When Suki first saw Sokka, she could not recognize him due to his guard outfit and pushed him backward. When she found out who he was, however, she happily embraced him. Shedding tears of joy, she revealed that she knew he would come and the two shared a kiss, only to be interrupted by Zuko warning them of an approaching guard. When Sokka decided to stay at the prison for the possible return of his father, Suki opted to stay with him. Suki, Sokka, Zuko, ${link_1}, and ${link_2} all ${link_3} together on the ${link_4}.",
      "links": [
        {
          "body": "Boiling Rock",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "Hakoda",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Chit Sang",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Chit_Sang",
            "page": "Chit_Sang"
          }
        },
        {
          "body": "escaped",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Escape_from_the_Boiling_Rock",
            "page": "Escape_from_the_Boiling_Rock"
          }
        },
        {
          "body": "gondola",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Gondola",
            "page": "Gondola"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Love interest",
        "Sokka"
      ],
      "text": "Sokka and Suki finally reunited again at the Boiling Rock, where she was being held. When Suki first saw Sokka, she could not recognize him due to his guard outfit and pushed him backward. When she found out who he was, however, she happily embraced him. Shedding tears of joy, she revealed that she knew he would come and the two shared a kiss, only to be interrupted by Zuko warning them of an approaching guard. When Sokka decided to stay at the prison for the possible return of his father, Suki opted to stay with him. Suki, Sokka, Zuko, Hakoda, and Chit Sang all escaped together on the gondola."
    },
    {
      "body": "Suki and Sokka once seemed to have planned to have a romantic evening together only to have it comically interrupted by Zuko. When watching a ${link_0} on ${link_1}, a scene of Sokka and Yue separating was depicted; Suki teased Sokka about kissing the Moon Spirit. Sokka tearfully shushed her, so he could keep watching the scene with Suki expressing notable jealousy.",
      "links": [
        {
          "body": "play",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        },
        {
          "body": "Ember Island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ember_Island",
            "page": "Ember_Island"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Love interest",
        "Sokka"
      ],
      "text": "Suki and Sokka once seemed to have planned to have a romantic evening together only to have it comically interrupted by Zuko. When watching a play on Ember Island, a scene of Sokka and Yue separating was depicted; Suki teased Sokka about kissing the Moon Spirit. Sokka tearfully shushed her, so he could keep watching the scene with Suki expressing notable jealousy."
    },
    {
      "body": "While relaxing on the beach, Sokka created a crude sand sculpture of Suki which she considered sweet, despite his lack of artistic talent. Sokka responded by kissing her on the cheek, but the sand sculpture was destroyed shortly afterward by Zuko as he attacked Aang. During the arrival of ${link_0}, Sokka and Suki, along with ${link_1}, worked together to destroy the ${link_2} fleet. Midway through the mission, Suki was separated from Sokka and Toph when she became trapped on the falling vessel. Landing safely on another airship, she urged the others to continue their mission and later returned, using a hijacked airship, to successfully save the two from falling to their deaths.",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Fire Nation airship",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Love interest",
        "Sokka"
      ],
      "text": "While relaxing on the beach, Sokka created a crude sand sculpture of Suki which she considered sweet, despite his lack of artistic talent. Sokka responded by kissing her on the cheek, but the sand sculpture was destroyed shortly afterward by Zuko as he attacked Aang. During the arrival of Sozin's Comet, Sokka and Suki, along with Toph, worked together to destroy the Fire Nation airship fleet. Midway through the mission, Suki was separated from Sokka and Toph when she became trapped on the falling vessel. Landing safely on another airship, she urged the others to continue their mission and later returned, using a hijacked airship, to successfully save the two from falling to their deaths."
    },
    {
      "body": "A year later, Suki arrived at the ${link_0} to meet Toph and Sokka, sharing a passionate kiss with the latter. Afterward, she explained how she was one of ${link_1}'s guards and overheard a complaint from ${link_2} about a \"dirt girl\" and a \"snow savage\", thus traveling to them to check it out.",
      "links": [
        {
          "body": "Beifong Metalbending Academy",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Beifong_Metalbending_Academy",
            "page": "Beifong_Metalbending_Academy"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Kunyo",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Kunyo",
            "page": "Kunyo"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Love interest",
        "Sokka"
      ],
      "text": "A year later, Suki arrived at the Beifong Metalbending Academy to meet Toph and Sokka, sharing a passionate kiss with the latter. Afterward, she explained how she was one of Zuko's guards and overheard a complaint from Kunyo about a \"dirt girl\" and a \"snow savage\", thus traveling to them to check it out."
    },
    {
      "body": "Aang and Suki met when she and her warriors ambushed him, Katara, and Sokka, on their first visit to Kyoshi Island. After Aang informed them that he was the ${link_0}, they began treating him and his friends as honored guests. They met again at ${link_1} where she expressed concern for Aang and asked if he was feeling okay with the discovery that ${link_2} was currently missing. Suki later came across Appa and attempted to reunite the bison with Aang, only to be attacked by Azula, ${link_3}, and ${link_4}. Aang and Suki met once more when she escaped from the Boiling Rock. Suki was apparently comfortable around Aang to the extent where she snickered with Sokka when Zuko sarcastically criticized the Avatar and grew anxious to find him when he disappeared.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Full Moon Bay",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Full_Moon_Bay",
            "page": "Full_Moon_Bay"
          }
        },
        {
          "body": "Appa",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Mai",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Allies",
        "Aang"
      ],
      "text": "Aang and Suki met when she and her warriors ambushed him, Katara, and Sokka, on their first visit to Kyoshi Island. After Aang informed them that he was the Avatar, they began treating him and his friends as honored guests. They met again at Full Moon Bay where she expressed concern for Aang and asked if he was feeling okay with the discovery that Appa was currently missing. Suki later came across Appa and attempted to reunite the bison with Aang, only to be attacked by Azula, Mai, and Ty Lee. Aang and Suki met once more when she escaped from the Boiling Rock. Suki was apparently comfortable around Aang to the extent where she snickered with Sokka when Zuko sarcastically criticized the Avatar and grew anxious to find him when he disappeared."
    },
    {
      "body": "Suki first met Appa when he, Aang, Sokka, and Katara visited Kyoshi Island. She expressed concern upon finding out that he was missing and later discovered him in a cavern, where he was lost, afraid, and wounded. Although Appa was initially skittish toward Suki and the Kyoshi Warriors due to having been kidnapped earlier and abused, Suki gained Appa's trust by offering him apples. She, with the help of her warriors, cleansed Appa until he was rid of the scrap and dirt that covered his fur from when he was lost. During this time, Azula, Mai, and Ty Lee ambushed the Kyoshi Warriors. Suki defended and saved Appa, despite her and her warriors being outmatched. She persistently fought, allowing Appa to escape in hopes that he would find Aang.",
      "links": [],
      "section": [
        "Suki's relationships",
        "Allies",
        "Appa"
      ],
      "text": "Suki first met Appa when he, Aang, Sokka, and Katara visited Kyoshi Island. She expressed concern upon finding out that he was missing and later discovered him in a cavern, where he was lost, afraid, and wounded. Although Appa was initially skittish toward Suki and the Kyoshi Warriors due to having been kidnapped earlier and abused, Suki gained Appa's trust by offering him apples. She, with the help of her warriors, cleansed Appa until he was rid of the scrap and dirt that covered his fur from when he was lost. During this time, Azula, Mai, and Ty Lee ambushed the Kyoshi Warriors. Suki defended and saved Appa, despite her and her warriors being outmatched. She persistently fought, allowing Appa to escape in hopes that he would find Aang."
    },
    {
      "body": "Katara and Suki first met when Suki and the rest of the Kyoshi Warriors ambushed her, Aang, and Sokka. When she discovered that Aang was the Avatar, her village treated Katara and her friends like royalty. They met again at Full Moon Bay and, with the rest of the group, escorted a band of refugees across the Serpent's Pass and helped deliver a ${link_0}. When Azula, Mai, and Ty Lee infiltrated Ba Sing Se disguised as Kyoshi Warriors, Katara, thinking Azula was Suki, revealed to her that Zuko and ${link_1} were in Ba Sing Se. She soon realized the warrior to be the Fire Nation princess only to be paralyzed by Ty Lee, rendering her helpless. She and Suki worked together to try to find Aang when he disappeared, however, their search came up unsuccessful. Both girls shared a strong friendship and effectively cooperated with one another.",
      "links": [
        {
          "body": "baby",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hope",
            "page": "Hope"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Allies",
        "Katara"
      ],
      "text": "Katara and Suki first met when Suki and the rest of the Kyoshi Warriors ambushed her, Aang, and Sokka. When she discovered that Aang was the Avatar, her village treated Katara and her friends like royalty. They met again at Full Moon Bay and, with the rest of the group, escorted a band of refugees across the Serpent's Pass and helped deliver a baby. When Azula, Mai, and Ty Lee infiltrated Ba Sing Se disguised as Kyoshi Warriors, Katara, thinking Azula was Suki, revealed to her that Zuko and Iroh were in Ba Sing Se. She soon realized the warrior to be the Fire Nation princess only to be paralyzed by Ty Lee, rendering her helpless. She and Suki worked together to try to find Aang when he disappeared, however, their search came up unsuccessful. Both girls shared a strong friendship and effectively cooperated with one another."
    },
    {
      "body": "The Kyoshi Warriors respected Suki as their leader and shared a strong friendship. They were loyal to her and heeded her every command.",
      "links": [],
      "section": [
        "Suki's relationships",
        "Allies",
        "Kyoshi Warriors"
      ],
      "text": "The Kyoshi Warriors respected Suki as their leader and shared a strong friendship. They were loyal to her and heeded her every command."
    },
    {
      "body": "When they first met, Suki and Mai were enemies. Suki was forced to fight Azula while Mai assisted Ty Lee in disabling the other warriors, eventually leaving Suki as the only warrior to face Azula even as she was hopelessly outmatched. Upon the Warriors' defeat, Mai also stole their uniforms along with Azula and Ty Lee for use in toppling the Earth King. Suki and Mai did not meet face-to-face during the former's eventual ${link_0} from the Boiling Rock with the help of Team Avatar, as Zuko had locked Mai in a cell to defend his new allies. Despite this, Mai eventually intervened to save Zuko from the guards cutting the cables keeping the gondola suspended in mid-air, saving Suki in the process as well at the expense of her own freedom. It was not until after the War finally ended that Mai was released along with Ty Lee and the two of them finally made peace with Team Avatar. It would seem that Suki and Mai eventually formed a mutual bond as they played ${link_1} together at the ${link_2}.",
      "links": [
        {
          "body": "escape",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Escape_from_the_Boiling_Rock",
            "page": "Escape_from_the_Boiling_Rock"
          }
        },
        {
          "body": "Pai Sho",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pai_Sho",
            "page": "Pai_Sho"
          }
        },
        {
          "body": "Jasmine Dragon",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Allies",
        "Mai"
      ],
      "text": "When they first met, Suki and Mai were enemies. Suki was forced to fight Azula while Mai assisted Ty Lee in disabling the other warriors, eventually leaving Suki as the only warrior to face Azula even as she was hopelessly outmatched. Upon the Warriors' defeat, Mai also stole their uniforms along with Azula and Ty Lee for use in toppling the Earth King. Suki and Mai did not meet face-to-face during the former's eventual escape from the Boiling Rock with the help of Team Avatar, as Zuko had locked Mai in a cell to defend his new allies. Despite this, Mai eventually intervened to save Zuko from the guards cutting the cables keeping the gondola suspended in mid-air, saving Suki in the process as well at the expense of her own freedom. It was not until after the War finally ended that Mai was released along with Ty Lee and the two of them finally made peace with Team Avatar. It would seem that Suki and Mai eventually formed a mutual bond as they played Pai Sho together at the Jasmine Dragon."
    },
    {
      "body": "A year after the War's end, when Zuko was the victim of several failed assassination attempts on his life, Mai personally requested the aid of Suki and her team of warriors, of whom Ty Lee was now a part as well, to help protect Zuko at the Royal Palace, considering them to be far more competent than the Royal Guardsmen. It can be assumed from this fact that the two have grown to trust each other with the passage of time.",
      "links": [],
      "section": [
        "Suki's relationships",
        "Allies",
        "Mai"
      ],
      "text": "A year after the War's end, when Zuko was the victim of several failed assassination attempts on his life, Mai personally requested the aid of Suki and her team of warriors, of whom Ty Lee was now a part as well, to help protect Zuko at the Royal Palace, considering them to be far more competent than the Royal Guardsmen. It can be assumed from this fact that the two have grown to trust each other with the passage of time."
    },
    {
      "body": "During this assignment, Suki learned of Zuko's continued visits to his father in prison, a fact he had hidden from Mai. Suki informed Mai of her discovery, but this backfired when Mai, feeling betrayed by Zuko constantly keeping secrets from her, broke off their relationship once more. Immediately after this, Suki apologized to Zuko, regretting the outcome of her actions.",
      "links": [],
      "section": [
        "Suki's relationships",
        "Allies",
        "Mai"
      ],
      "text": "During this assignment, Suki learned of Zuko's continued visits to his father in prison, a fact he had hidden from Mai. Suki informed Mai of her discovery, but this backfired when Mai, feeling betrayed by Zuko constantly keeping secrets from her, broke off their relationship once more. Immediately after this, Suki apologized to Zuko, regretting the outcome of her actions."
    },
    {
      "body": "Suki and Toph first met when the group was traveling on foot to Ba Sing Se. When Toph fell into the water after the serpent destroyed the ice bridge she was walking along, Suki saved her. Toph, thinking Suki was Sokka after calling for him, gave her a kiss on the cheek. Embarrassed upon finding out it was Suki, she asked the warrior to \"let [her] drown\". Toph, Suki, and Sokka set out together on a mission to stop the Fire Nation airship fleet from burning down the Earth Kingdom. When Sokka and Toph were surrounded on an airship by Fire Nation soldiers with comet-enhanced ${link_0} surrounding them, Suki saved them, piloting a hijacked airship.",
      "links": [
        {
          "body": "firebending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Allies",
        "Toph Beifong"
      ],
      "text": "Suki and Toph first met when the group was traveling on foot to Ba Sing Se. When Toph fell into the water after the serpent destroyed the ice bridge she was walking along, Suki saved her. Toph, thinking Suki was Sokka after calling for him, gave her a kiss on the cheek. Embarrassed upon finding out it was Suki, she asked the warrior to \"let [her] drown\". Toph, Suki, and Sokka set out together on a mission to stop the Fire Nation airship fleet from burning down the Earth Kingdom. When Sokka and Toph were surrounded on an airship by Fire Nation soldiers with comet-enhanced firebending surrounding them, Suki saved them, piloting a hijacked airship."
    },
    {
      "body": "When Suki and Ty Lee first met, they were natural enemies. Even though Suki was unable to acknowledge Ty Lee because she was preoccupied with fighting Azula, it is likely she glimpsed what Ty Lee had done to her fellow warriors. They met once more during her escape from the Boiling Rock where they battled on the gondola. During their battle, it seemed they were evenly matched. When Ty Lee betrayed Azula in order to save Mai, she was imprisoned with the other Kyoshi Warriors. They bonded over time and after a few ${link_0} lessons, they let Ty Lee join their group. Suki seemed happy with her acceptation.",
      "links": [
        {
          "body": "chi blocking",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Chi_blocking",
            "page": "Chi_blocking"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Allies",
        "Ty Lee"
      ],
      "text": "When Suki and Ty Lee first met, they were natural enemies. Even though Suki was unable to acknowledge Ty Lee because she was preoccupied with fighting Azula, it is likely she glimpsed what Ty Lee had done to her fellow warriors. They met once more during her escape from the Boiling Rock where they battled on the gondola. During their battle, it seemed they were evenly matched. When Ty Lee betrayed Azula in order to save Mai, she was imprisoned with the other Kyoshi Warriors. They bonded over time and after a few chi blocking lessons, they let Ty Lee join their group. Suki seemed happy with her acceptation."
    },
    {
      "body": "Zuko and Suki unofficially met when Zuko attacked Kyoshi Island in an attempt to capture Aang. Suki and her team of warriors fought to stop Zuko's rampage, as his firebending threatened to destroy their village. They were hopelessly outmatched, however, and eventually defeated by Zuko, although they did buy Aang and his friends the time they needed to escape.",
      "links": [],
      "section": [
        "Suki's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "Zuko and Suki unofficially met when Zuko attacked Kyoshi Island in an attempt to capture Aang. Suki and her team of warriors fought to stop Zuko's rampage, as his firebending threatened to destroy their village. They were hopelessly outmatched, however, and eventually defeated by Zuko, although they did buy Aang and his friends the time they needed to escape."
    },
    {
      "body": "Suki and Zuko formally met at the Boiling Rock. By this point, Suki had been imprisoned in the Boiling Rock by Azula and Zuko had reformed and joined Team Avatar. While serving hard time, Suki did not hesitate to remind Zuko about his attack on her village many months before. Zuko recalled this event and apologized for his wrongdoings. Despite the obvious animosity between the two, Suki cooperated with Zuko and Sokka in escaping the prison and freeing Sokka's father, Hakoda.",
      "links": [],
      "section": [
        "Suki's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "Suki and Zuko formally met at the Boiling Rock. By this point, Suki had been imprisoned in the Boiling Rock by Azula and Zuko had reformed and joined Team Avatar. While serving hard time, Suki did not hesitate to remind Zuko about his attack on her village many months before. Zuko recalled this event and apologized for his wrongdoings. Despite the obvious animosity between the two, Suki cooperated with Zuko and Sokka in escaping the prison and freeing Sokka's father, Hakoda."
    },
    {
      "body": "After their successful escape and a brief humorous evening interaction outside Sokka's tent, Suki and Zuko were on much better terms, as she spent time with Zuko and the gang at ${link_0} in Ba Sing Se.",
      "links": [
        {
          "body": "Iroh's tea shop",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "After their successful escape and a brief humorous evening interaction outside Sokka's tent, Suki and Zuko were on much better terms, as she spent time with Zuko and the gang at Iroh's tea shop in Ba Sing Se."
    },
    {
      "body": "One year after the Hundred Year War, Suki and the rest of the Kyoshi Warriors were hired by Mai in place of Zuko's previous bodyguards after they failed to prevent an attempt on the Fire Lord's life. When Zuko awoke from his sleep in fear of another assassination attempt, Suki seemed genuinely concerned and reassured Zuko that he was not in danger. That same night, when Zuko went to secretly meet with the disposed Fire Lord ${link_0} under the guise of going for a walk, Suki, worried for Zuko, asked if he needed an escort, to which he declined.",
      "links": [
        {
          "body": "Ozai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "One year after the Hundred Year War, Suki and the rest of the Kyoshi Warriors were hired by Mai in place of Zuko's previous bodyguards after they failed to prevent an attempt on the Fire Lord's life. When Zuko awoke from his sleep in fear of another assassination attempt, Suki seemed genuinely concerned and reassured Zuko that he was not in danger. That same night, when Zuko went to secretly meet with the disposed Fire Lord Ozai under the guise of going for a walk, Suki, worried for Zuko, asked if he needed an escort, to which he declined."
    },
    {
      "body": "Later, Suki unintentionally provoked Mai into breaking up with Zuko after telling her about Zuko's late night meetings with Ozai. Suki was very sorry for what had happened, and apologized to Zuko, telling him, as she reached out for his hand, that she was very worried about him, though she was also alarmed to learn that he had sent spies to the Earth Kingdom.",
      "links": [],
      "section": [
        "Suki's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "Later, Suki unintentionally provoked Mai into breaking up with Zuko after telling her about Zuko's late night meetings with Ozai. Suki was very sorry for what had happened, and apologized to Zuko, telling him, as she reached out for his hand, that she was very worried about him, though she was also alarmed to learn that he had sent spies to the Earth Kingdom."
    },
    {
      "body": "After Zuko departed for ${link_0} to defend the colonists from an incoming attack by ${link_1} ${link_2} and his army, Suki followed suit and returned to the Earth Kingdom in a war balloon to enlist Sokka and Toph's aid in stopping the battle. During the trio's efforts to slow down the incoming Fire Nation armored forces, Suki still expressed sympathy for Zuko in spite of his actions, suggesting that they should really try to talk things out with him instead. She also sadly remarked on how lonely Zuko seemed to be, showing that she still cared for him as a friend in spite of all that was happening.",
      "links": [
        {
          "body": "Yu Dao",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Yu_Dao",
            "page": "Yu_Dao"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Kuei",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Kuei",
            "page": "Kuei"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "After Zuko departed for Yu Dao to defend the colonists from an incoming attack by Earth King Kuei and his army, Suki followed suit and returned to the Earth Kingdom in a war balloon to enlist Sokka and Toph's aid in stopping the battle. During the trio's efforts to slow down the incoming Fire Nation armored forces, Suki still expressed sympathy for Zuko in spite of his actions, suggesting that they should really try to talk things out with him instead. She also sadly remarked on how lonely Zuko seemed to be, showing that she still cared for him as a friend in spite of all that was happening."
    },
    {
      "body": "Suki and Azula first met when Azula, Mai, and Ty Lee tracked down Appa by following his fur trail. Even though Azula did not find Aang present as intended, she proceeded to attack Suki anyway. Suki drove Appa away successfully, however, she and her warriors were soon defeated by the trio. Azula's team stole some of the warriors' uniforms and used them to successfully conquer Ba Sing Se by disguising themselves as Kyoshi Warriors. Azula successfully tampered with Sokka's emotions by telling him that her favorite prisoner, Suki, used to mention him all the time before she gave up on him. Azula and Suki met once more at the Boiling Rock. Instead of fighting Azula, however, Suki directed her attention toward Ty Lee. The two met one last time when the Fire Nation princess assaulted the ${link_0}, however, Azula was too preoccupied with trying to kill Zuko to acknowledge Suki.",
      "links": [
        {
          "body": "Western Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Enemies",
        "Azula"
      ],
      "text": "Suki and Azula first met when Azula, Mai, and Ty Lee tracked down Appa by following his fur trail. Even though Azula did not find Aang present as intended, she proceeded to attack Suki anyway. Suki drove Appa away successfully, however, she and her warriors were soon defeated by the trio. Azula's team stole some of the warriors' uniforms and used them to successfully conquer Ba Sing Se by disguising themselves as Kyoshi Warriors. Azula successfully tampered with Sokka's emotions by telling him that her favorite prisoner, Suki, used to mention him all the time before she gave up on him. Azula and Suki met once more at the Boiling Rock. Instead of fighting Azula, however, Suki directed her attention toward Ty Lee. The two met one last time when the Fire Nation princess assaulted the Western Air Temple, however, Azula was too preoccupied with trying to kill Zuko to acknowledge Suki."
    },
    {
      "body": "Suki briefly met Ozai along with Sokka and Toph directly after Aang defeated him. At first, Suki thought he was dead, but Ozai sadistically told her he was still alive, startling her. He was unable to follow through on his threat, however, as his bending abilities had been terminated through the use of ${link_0}, leaving him powerless. Suki attempted to mock Ozai along with Sokka and Toph, only to have Toph tell her, \"Leave the nicknames to us, honey.\"",
      "links": [
        {
          "body": "energybending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Energybending",
            "page": "Energybending"
          }
        }
      ],
      "section": [
        "Suki's relationships",
        "Enemies",
        "Ozai"
      ],
      "text": "Suki briefly met Ozai along with Sokka and Toph directly after Aang defeated him. At first, Suki thought he was dead, but Ozai sadistically told her he was still alive, startling her. He was unable to follow through on his threat, however, as his bending abilities had been terminated through the use of energybending, leaving him powerless. Suki attempted to mock Ozai along with Sokka and Toph, only to have Toph tell her, \"Leave the nicknames to us, honey.\""
    },
    {
      "body": "Suki was imprisoned in Boiling Rock upon her defeat at the hands of Azula. When Sokka announced his plan to escape, Suki agreed to help. During the riot, Suki hopped up on the heads of the rioters, jumped, and flipped onto the tower. She reached the warden, tied his hands together and used his headband as a gag, allowing the escapees to secure him as a prisoner.",
      "links": [],
      "section": [
        "Suki's relationships",
        "Enemies",
        "The warden"
      ],
      "text": "Suki was imprisoned in Boiling Rock upon her defeat at the hands of Azula. When Sokka announced his plan to escape, Suki agreed to help. During the riot, Suki hopped up on the heads of the rioters, jumped, and flipped onto the tower. She reached the warden, tied his hands together and used his headband as a gag, allowing the escapees to secure him as a prisoner."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Suki%27s_relationships",
    "file": "avatar.wikia.com/wiki/Suki's_relationships.html",
    "page": "Suki's_relationships",
    "title": "Suki's relationships"
  }
}