{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Events",
      "target": {
        "href": "Category_Events",
        "page": "Category_Events"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "href": "Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0} meditating during the summer solstice on ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Roku's island",
          "key": "${link_1}",
          "target": {
            "href": "Roku%27s_island",
            "page": "Roku%27s_island"
          }
        }
      ],
      "text": "Aang meditating during the summer solstice on Roku's island."
    },
    {
      "body": "The summer solstice is a natural phenomenon that occurs in a hemisphere's summer season when the sun reaches its highest position in the sky, making it the longest day of the year in that hemisphere. As the solstice approaches, the natural world and the ${link_0} grow closer together, blurring the line between the two; consequently, the summer and ${link_1} are the easiest times for people to enter the Spirit World.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "winter solstices",
          "key": "${link_1}",
          "target": {
            "href": "Winter_solstice",
            "page": "Winter_solstice"
          }
        }
      ],
      "text": "The summer solstice is a natural phenomenon that occurs in a hemisphere's summer season when the sun reaches its highest position in the sky, making it the longest day of the year in that hemisphere. As the solstice approaches, the natural world and the Spirit World grow closer together, blurring the line between the two; consequently, the summer and winter solstices are the easiest times for people to enter the Spirit World."
    },
    {
      "body": "${link_0} ${link_1} establishing a ${link_2} connection to his past life, ${link_3}, on the solstice.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "spiritual",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Roku",
          "key": "${link_3}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        }
      ],
      "text": "Avatar Aang establishing a spiritual connection to his past life, Roku, on the solstice."
    },
    {
      "body": "In the summer of 100 ${link_0}, ${link_1} ${link_2} used the power of the summer solstice to cross over into the Spirit World, where Avatar ${link_3} was waiting for him. The purpose of this journey was to allow Roku to teach Aang about ${link_4} ${link_5}'s machinations of world conquest and the eventual dawn of the ${link_6}. Roku told Aang that he needed to understand how the war began, if he wanted to know how to end it.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Roku",
          "key": "${link_3}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_4}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_5}",
          "target": {
            "href": "Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_6}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "In the summer of 100 AG, Avatar Aang used the power of the summer solstice to cross over into the Spirit World, where Avatar Roku was waiting for him. The purpose of this journey was to allow Roku to teach Aang about Fire Lord Sozin's machinations of world conquest and the eventual dawn of the Hundred Year War. Roku told Aang that he needed to understand how the war began, if he wanted to know how to end it."
    },
    {
      "body": "Aang was confronted with the solstice again when he and ${link_0} traveled to the ${link_1}. They could not enter the sacred room until the light of the solstice would reach the ${link_2} situated above the door. However, Zuko redirected the sunlight with one of his swords, fooling the celestial calendar into opening the door prematurely.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Sun Warriors' ancient city",
          "key": "${link_1}",
          "target": {
            "href": "Sun_Warriors%27_ancient_city",
            "page": "Sun_Warriors%27_ancient_city"
          }
        },
        {
          "body": "sunstone",
          "key": "${link_2}",
          "target": {
            "href": "Sunstone",
            "page": "Sunstone"
          }
        }
      ],
      "text": "Aang was confronted with the solstice again when he and Zuko traveled to the Sun Warriors' ancient city. They could not enter the sacred room until the light of the solstice would reach the sunstone situated above the door. However, Zuko redirected the sunlight with one of his swords, fooling the celestial calendar into opening the door prematurely."
    },
    {
      "body": "During the summer solstice, the boundaries between the ${link_0} and the Spirit World are almost non-existent. This makes it easier for the Avatar to enter the Spirit World, either by their own choosing or unintentionally.",
      "links": [
        {
          "body": "Avatar World",
          "key": "${link_0}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "During the summer solstice, the boundaries between the Avatar World and the Spirit World are almost non-existent. This makes it easier for the Avatar to enter the Spirit World, either by their own choosing or unintentionally."
    },
    {
      "body": "The ${link_0} used a celestial locking system that was triggered by the angle of the light on the solstice to protect their sacred hall. Only when the light reached a large orange gem, located in center of the courtyard, could the door be opened.",
      "links": [
        {
          "body": "Sun Warriors",
          "key": "${link_0}",
          "target": {
            "href": "Sun_Warriors",
            "page": "Sun_Warriors"
          }
        }
      ],
      "text": "The Sun Warriors used a celestial locking system that was triggered by the angle of the light on the solstice to protect their sacred hall. Only when the light reached a large orange gem, located in center of the courtyard, could the door be opened."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Summer_solstice",
    "file": "avatar.wikia.com/wiki/Summer_solstice.html",
    "page": "Summer_solstice",
    "title": "Summer solstice"
  }
}