{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "external": false,
        "href": "/wiki/Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Objects",
      "target": {
        "external": false,
        "href": "/wiki/Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirituality",
        "page": "Category_Spirituality"
      }
    },
    {
      "body": "Sun Warriors",
      "target": {
        "external": false,
        "href": "/wiki/Category_Sun_Warriors",
        "page": "Category_Sun_Warriors"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The sunstone is a ${link_0} treasure kept hidden inside a room in their ${link_1}, and is supposedly accessible only during a ${link_2}. To find it, after entering the room, two people are required to perform the ${link_3} form, following the steps of the statues lining the room. This will activate switches on the floor, causing the pedestal with the sunstone to rise.",
      "links": [
        {
          "body": "Sun Warrior",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sun_Warriors",
            "page": "Sun_Warriors"
          }
        },
        {
          "body": "ancient city",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Sun_Warriors%27_ancient_city",
            "page": "Sun_Warriors%27_ancient_city"
          }
        },
        {
          "body": "solstice",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Astronomy_in_the_World_of_Avatar#Solstices",
            "page": "Astronomy_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Dancing Dragon",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Dancing_Dragon",
            "page": "Dancing_Dragon"
          }
        }
      ],
      "section": [
        "Sunstone"
      ],
      "text": "The sunstone is a Sun Warrior treasure kept hidden inside a room in their ancient city, and is supposedly accessible only during a solstice. To find it, after entering the room, two people are required to perform the Dancing Dragon form, following the steps of the statues lining the room. This will activate switches on the floor, causing the pedestal with the sunstone to rise."
    },
    {
      "body": "When ${link_0} lost his drive to ${link_1}, he and ${link_2} traveled to the Sun Warriors' ancient city in hopes of discovering the original source of firebending. After Zuko outsmarted the celestial calendar by reflecting a beam of light with one of his ${link_3}, mimicking what would occur during a solstice, the duo entered the room that held the statues depicting the Dancing Dragon. Aang convinced Zuko to perform the firebending form with him. After the final move, the pedestal supporting the sunstone appeared. Although Aang advised against it, Zuko picked it up and commented that it felt alive. When he wanted to place the gem back on its pedestal, a geyser of ${link_4} shot out of the pedestal, pinning Zuko and the sunstone to an air vent face-down. Aang sent a gust of air at Zuko and the sunstone, flipping them over. Removing the gem also triggered an automatic system that closed the door and trapped every intruder in the sacred room to be consumed by the slime. The unfortunate duo was eventually freed by the Sun Warriors and the stone was recovered. The ${link_5} threatened to punish them severely for trying to steal sacred Sun Warrior treasure. ${link_6} protectively held on to the sunstone after Zuko and Aang were freed and explained what they were doing there.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebend",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "swords",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Dual_broadswords",
            "page": "Dual_broadswords"
          }
        },
        {
          "body": "slime",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Viscous_slime",
            "page": "Viscous_slime"
          }
        },
        {
          "body": "Sun Warrior chief",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Sun_Warrior_chief",
            "page": "Sun_Warrior_chief"
          }
        },
        {
          "body": "Ham Ghao",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Ham_Ghao",
            "page": "Ham_Ghao"
          }
        }
      ],
      "section": [
        "Sunstone",
        "History"
      ],
      "text": "When Zuko lost his drive to firebend, he and Aang traveled to the Sun Warriors' ancient city in hopes of discovering the original source of firebending. After Zuko outsmarted the celestial calendar by reflecting a beam of light with one of his swords, mimicking what would occur during a solstice, the duo entered the room that held the statues depicting the Dancing Dragon. Aang convinced Zuko to perform the firebending form with him. After the final move, the pedestal supporting the sunstone appeared. Although Aang advised against it, Zuko picked it up and commented that it felt alive. When he wanted to place the gem back on its pedestal, a geyser of slime shot out of the pedestal, pinning Zuko and the sunstone to an air vent face-down. Aang sent a gust of air at Zuko and the sunstone, flipping them over. Removing the gem also triggered an automatic system that closed the door and trapped every intruder in the sacred room to be consumed by the slime. The unfortunate duo was eventually freed by the Sun Warriors and the stone was recovered. The Sun Warrior chief threatened to punish them severely for trying to steal sacred Sun Warrior treasure. Ham Ghao protectively held on to the sunstone after Zuko and Aang were freed and explained what they were doing there."
    },
    {
      "body": "The fact that Zuko commented that it felt alive, along with its shape and how Aang called it a \"glowing egg\", led to massive speculation by some fans, who believed the sunstone could actually be a ${link_0}. This theory is also supported by a virtual artifact, a ${link_1} egg, that can be earned in the game ${link_2} and is very similar to this object. However, the sunstone did not appear again, so the theory was not proven either way.",
      "links": [
        {
          "body": "dragon egg",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon_egg",
            "page": "Dragon_egg"
          }
        },
        {
          "body": "dragon",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon",
            "page": "Dragon"
          }
        },
        {
          "body": "Legends of the Arena",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Legends_of_the_Arena",
            "page": "Legends_of_the_Arena"
          }
        }
      ],
      "section": [
        "Sunstone",
        "Trivia"
      ],
      "text": "The fact that Zuko commented that it felt alive, along with its shape and how Aang called it a \"glowing egg\", led to massive speculation by some fans, who believed the sunstone could actually be a dragon egg. This theory is also supported by a virtual artifact, a dragon egg, that can be earned in the game Legends of the Arena and is very similar to this object. However, the sunstone did not appear again, so the theory was not proven either way."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Astronomy in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Astronomy_in_the_World_of_Avatar",
            "page": "Astronomy_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Sunstone",
        "See also"
      ],
      "text": "Astronomy in the World of Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Sun Warriors",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sun_Warriors",
            "page": "Sun_Warriors"
          }
        }
      ],
      "section": [
        "Sunstone",
        "See also"
      ],
      "text": "Sun Warriors"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Sunstone",
    "file": "avatar.wikia.com/wiki/Sunstone.html",
    "page": "Sunstone",
    "title": "Sunstone"
  }
}