{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Settlements",
      "target": {
        "href": "Category_Settlements",
        "page": "Category_Settlements"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "Coast of the ${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "United Republic of Nations",
              "key": "${link_0}",
              "target": {
                "href": "United_Republic_of_Nations",
                "page": "United_Republic_of_Nations"
              }
            }
          ],
          "text": "Coast of the United Republic of Nations",
          "value": "Coast of the ${link_0}",
          "value_text": "Coast of the United Republic of Nations"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "Center of ${link_0} (abandoned)",
          "extra": "(abandoned)",
          "extra_text": "(abandoned)",
          "links": [
            {
              "body": "commerce",
              "key": "${link_0}",
              "target": {
                "href": "Economy_in_the_World_of_Avatar",
                "page": "Economy_in_the_World_of_Avatar"
              }
            }
          ],
          "text": "Center of commerce (abandoned)",
          "value": "Center of ${link_0}",
          "value_text": "Center of commerce"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "The Blue Spirit",
              "key": "${link_0}",
              "target": {
                "href": "The_Blue_Spirit",
                "page": "The_Blue_Spirit"
              }
            }
          ],
          "text": "\"The Blue Spirit\"",
          "value": "\"${link_0}\"",
          "value_text": "\"The Blue Spirit\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Taku is an abandoned city ${link_0} on the shores of the ${link_1}, formerly the northwestern ${link_2}. Prior to the ${link_3}, the city was an important center of ${link_4}. However, it was destroyed by the ${link_5} during the first wave of attacks due to its strategic location and importance to the Earth Kingdom.",
      "links": [
        {
          "body": "located",
          "key": "${link_0}",
          "target": {
            "href": "Geography_of_the_World_of_Avatar",
            "page": "Geography_of_the_World_of_Avatar"
          }
        },
        {
          "body": "United Republic of Nations",
          "key": "${link_1}",
          "target": {
            "href": "United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_3}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "commerce",
          "key": "${link_4}",
          "target": {
            "href": "Economy_in_the_World_of_Avatar",
            "page": "Economy_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_5}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "Taku is an abandoned city located on the shores of the United Republic of Nations, formerly the northwestern Earth Kingdom. Prior to the Hundred Year War, the city was an important center of commerce. However, it was destroyed by the Fire Nation during the first wave of attacks due to its strategic location and importance to the Earth Kingdom."
    },
    {
      "body": "Taku's primary purpose was to distribute cargo imported from ships throughout the entire nation. After the Fire Nation recognized its position, Taku became one of the first Earth Kingdom cities to be destroyed in the Hundred Year War. However, a small number of inhabitants remained in the area, and around 60 ${link_0}, a ${link_1} began teaching at the city's medical institute. Eventually, her students left to help the ${link_2}, and the herbalist became Taku's lone resident. She continued to maintain the institute, providing medical assistance for the wounded Earth Kingdom soldiers that would occasionally traverse the area.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "herbalist",
          "key": "${link_1}",
          "target": {
            "href": "Herbalist",
            "page": "Herbalist"
          }
        },
        {
          "body": "Earth Kingdom Army",
          "key": "${link_2}",
          "target": {
            "href": "Military_of_the_Earth_Kingdom#Army",
            "page": "Military_of_the_Earth_Kingdom"
          }
        }
      ],
      "text": "Taku's primary purpose was to distribute cargo imported from ships throughout the entire nation. After the Fire Nation recognized its position, Taku became one of the first Earth Kingdom cities to be destroyed in the Hundred Year War. However, a small number of inhabitants remained in the area, and around 60 AG, a herbalist began teaching at the city's medical institute. Eventually, her students left to help the Earth Kingdom Army, and the herbalist became Taku's lone resident. She continued to maintain the institute, providing medical assistance for the wounded Earth Kingdom soldiers that would occasionally traverse the area."
    },
    {
      "body": "While journeying to the ${link_0}, ${link_1} took shelter within an abandoned structure in Taku. ${link_2} had become sick, prompting ${link_3} to search for ginger root so he could make a medicinal ${link_4}. He could not find the herb, but did come across a map that revealed to him the location of the herbalist institute. Fearing ${link_5} would also become sick, Aang quickly set out to consult the herbalist; however, he was forced to travel without using his ${link_6} as a lightning storm had begun. Two watchmen spotted Aang from within a scout house as he was running across a mountain walkway, and a horn was sounded to alert Fire Nation authorities that the ${link_7} had been found. Aang visited the herbalist, who told him that he needed to collect ${link_8} for his friends to suck on in order to cure them. Aang left and began his search, but was promptly captured by ${link_9}. After hours in captivity, Aang escaped and returned to the shelter he had left his friends at, and gave them the cure to their sickness.",
      "links": [
        {
          "body": "Northern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_2}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Aang",
          "key": "${link_3}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "tea",
          "key": "${link_4}",
          "target": {
            "href": "Tea",
            "page": "Tea"
          }
        },
        {
          "body": "Katara",
          "key": "${link_5}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "glider",
          "key": "${link_6}",
          "target": {
            "href": "Airbender_staff",
            "page": "Airbender_staff"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_7}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "frozen frogs",
          "key": "${link_8}",
          "target": {
            "href": "Wood_frog",
            "page": "Wood_frog"
          }
        },
        {
          "body": "Yuyan Archers",
          "key": "${link_9}",
          "target": {
            "href": "Yuyan_Archers",
            "page": "Yuyan_Archers"
          }
        }
      ],
      "text": "While journeying to the Northern Water Tribe, Team Avatar took shelter within an abandoned structure in Taku. Sokka had become sick, prompting Aang to search for ginger root so he could make a medicinal tea. He could not find the herb, but did come across a map that revealed to him the location of the herbalist institute. Fearing Katara would also become sick, Aang quickly set out to consult the herbalist; however, he was forced to travel without using his glider as a lightning storm had begun. Two watchmen spotted Aang from within a scout house as he was running across a mountain walkway, and a horn was sounded to alert Fire Nation authorities that the Avatar had been found. Aang visited the herbalist, who told him that he needed to collect frozen frogs for his friends to suck on in order to cure them. Aang left and began his search, but was promptly captured by Yuyan Archers. After hours in captivity, Aang escaped and returned to the shelter he had left his friends at, and gave them the cure to their sickness."
    },
    {
      "body": "During his search for the Avatar, ${link_0} came to this village accompanied by ${link_1} and ${link_2}, and encountered the herbalist. June's ${link_3}, ${link_4}, was able to detect that Aang had previously traveled through the area, and the group moved on after a brief conversation with the healer.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "June",
          "key": "${link_2}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "shirshu",
          "key": "${link_3}",
          "target": {
            "href": "Shirshu",
            "page": "Shirshu"
          }
        },
        {
          "body": "Nyla",
          "key": "${link_4}",
          "target": {
            "href": "Nyla",
            "page": "Nyla"
          }
        }
      ],
      "text": "During his search for the Avatar, Zuko came to this village accompanied by Iroh and June, and encountered the herbalist. June's shirshu, Nyla, was able to detect that Aang had previously traveled through the area, and the group moved on after a brief conversation with the healer."
    },
    {
      "body": "The ${link_0} institute is located on top of the hill on which the village is situated.",
      "links": [
        {
          "body": "herbalist",
          "key": "${link_0}",
          "target": {
            "href": "Herbalist",
            "page": "Herbalist"
          }
        }
      ],
      "text": "The herbalist institute is located on top of the hill on which the village is situated."
    },
    {
      "body": "One of the few remaining Earth Kingdom establishments in this area, the herbalist institute is hidden high in the mountains surrounded by ${link_0}. The institute is over one hundred years old and was formerly a thriving establishment until the settlement was deserted. After the Fire Nation attacked, only the herbalist and her beloved pet ${link_1}, ${link_2}, resided there, though wounded Earth Kingdom troops would occasionally visit the institute seeking medicinal cures. Its medicines were once sent all across the ${link_3}. The location of the institute is important because the climate present is ideal for growing a variety of herbs needed to make medicines. A greenhouse is attached to the structure, holding an enormous supply of flora, some of which are considered to be the rarest in the world.",
      "links": [
        {
          "body": "natural growth",
          "key": "${link_0}",
          "target": {
            "href": "Flora_in_the_World_of_Avatar",
            "page": "Flora_in_the_World_of_Avatar"
          }
        },
        {
          "body": "cat",
          "key": "${link_1}",
          "target": {
            "href": "Cat",
            "page": "Cat"
          }
        },
        {
          "body": "Miyuki",
          "key": "${link_2}",
          "target": {
            "href": "Miyuki",
            "page": "Miyuki"
          }
        },
        {
          "body": "world",
          "key": "${link_3}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "One of the few remaining Earth Kingdom establishments in this area, the herbalist institute is hidden high in the mountains surrounded by natural growth. The institute is over one hundred years old and was formerly a thriving establishment until the settlement was deserted. After the Fire Nation attacked, only the herbalist and her beloved pet cat, Miyuki, resided there, though wounded Earth Kingdom troops would occasionally visit the institute seeking medicinal cures. Its medicines were once sent all across the world. The location of the institute is important because the climate present is ideal for growing a variety of herbs needed to make medicines. A greenhouse is attached to the structure, holding an enormous supply of flora, some of which are considered to be the rarest in the world."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Taku",
    "file": "avatar.wikia.com/wiki/Taku.html",
    "page": "Taku",
    "title": "Taku"
  }
}