{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "href": "Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. He possessed a highly manipulative nature, able to persuade a majority of the ${link_2}'s members to vote in his favor in meetings and having the ${link_3} to report to him.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "United Republic Council",
          "key": "${link_2}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        },
        {
          "body": "Metalbending Police Force",
          "key": "${link_3}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        }
      ],
      "text": "This page is comprised of Tarrlok's relationships with other characters in the World of Avatar. He possessed a highly manipulative nature, able to persuade a majority of the United Republic Council's members to vote in his favor in meetings and having the Metalbending Police Force to report to him."
    },
    {
      "body": "${link_0} fighting ${link_1}.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_1}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        }
      ],
      "text": "Amon fighting Tarrlok."
    },
    {
      "body": "Tarrlok had a good relationship with his older brother, ${link_0}. He looked up at him, as Noatak was always there to protect him and tried to shield Tarrlok from harm, even if that meant standing up to ${link_1}. However, over the course of their joint ${link_2} under Yakone's harsh tutelage, their relationship estranged; Tarrlok was the lesser bender of them, and Noatak gradually grew colder and more distant, to the point where he had no qualms in ${link_3} Tarrlok as part of their training. However, when Tarrlok refused to do the same to Noatak, resulting in their father labeling him a weakling and disgrace, and intending to physically harm Tarrlok, Noatak bloodbent Yakone in order to save Tarrlok. Noatak wanted to run away from home, away from Yakone, and wanted Tarrlok to join him. Tarrlok refused, however, as he did not want to leave their mother. Noatak saw that as a sign of weakness, noting that their father had been right after all, and ran away by himself. Tarrlok desperately searched for his brother but was unable to find him and assumed he had perished in a snowstorm.",
      "links": [
        {
          "body": "Noatak",
          "key": "${link_0}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        },
        {
          "body": "their father",
          "key": "${link_1}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        },
        {
          "body": "waterbending training",
          "key": "${link_2}",
          "target": {
            "href": "Waterbending_training",
            "page": "Waterbending_training"
          }
        },
        {
          "body": "bloodbending",
          "key": "${link_3}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        }
      ],
      "text": "Tarrlok had a good relationship with his older brother, Noatak. He looked up at him, as Noatak was always there to protect him and tried to shield Tarrlok from harm, even if that meant standing up to their father. However, over the course of their joint waterbending training under Yakone's harsh tutelage, their relationship estranged; Tarrlok was the lesser bender of them, and Noatak gradually grew colder and more distant, to the point where he had no qualms in bloodbending Tarrlok as part of their training. However, when Tarrlok refused to do the same to Noatak, resulting in their father labeling him a weakling and disgrace, and intending to physically harm Tarrlok, Noatak bloodbent Yakone in order to save Tarrlok. Noatak wanted to run away from home, away from Yakone, and wanted Tarrlok to join him. Tarrlok refused, however, as he did not want to leave their mother. Noatak saw that as a sign of weakness, noting that their father had been right after all, and ran away by himself. Tarrlok desperately searched for his brother but was unable to find him and assumed he had perished in a snowstorm."
    },
    {
      "body": "Years passed before Tarrlok ever saw his brother again, who now went by the name of Amon. It was only after the ${link_0}' leader took his bending away, that Tarrlok recognized the sensation as his brother's bloodbending grip. Realizing that both he and his brother became soldiers of revenge, just like their father had wanted them to be, Tarrlok tried to help stop Amon's advance in Republic City by sharing their past with ${link_1}, hoping the knowledge could be of use to her.",
      "links": [
        {
          "body": "Equalist",
          "key": "${link_0}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Years passed before Tarrlok ever saw his brother again, who now went by the name of Amon. It was only after the Equalist' leader took his bending away, that Tarrlok recognized the sensation as his brother's bloodbending grip. Realizing that both he and his brother became soldiers of revenge, just like their father had wanted them to be, Tarrlok tried to help stop Amon's advance in Republic City by sharing their past with Korra, hoping the knowledge could be of use to her."
    },
    {
      "body": "${link_0} before killing himself and ${link_1} by detonating the fuel tank.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "his brother",
          "key": "${link_1}",
          "target": {
            "href": "Amon",
            "page": "Amon"
          }
        }
      ],
      "text": "Tarrlok before killing himself and his brother by detonating the fuel tank."
    },
    {
      "body": "Despite the words said when the brothers parted ways as children, Amon still cared for his younger brother and wanted to escape Republic City together after he had been made as a fraud. Tarrlok joined his brother this time, though as they sped away from the city on a ${link_0} to start a new life together elsewhere, Tarrlok used an ${link_1} to ignite the fuel tank on the boat, causing it to explode, killing them both.",
      "links": [
        {
          "body": "speedboat",
          "key": "${link_0}",
          "target": {
            "href": "Speedboat",
            "page": "Speedboat"
          }
        },
        {
          "body": "electrified glove",
          "key": "${link_1}",
          "target": {
            "href": "Electrified_glove",
            "page": "Electrified_glove"
          }
        }
      ],
      "text": "Despite the words said when the brothers parted ways as children, Amon still cared for his younger brother and wanted to escape Republic City together after he had been made as a fraud. Tarrlok joined his brother this time, though as they sped away from the city on a speedboat to start a new life together elsewhere, Tarrlok used an electrified glove to ignite the fuel tank on the boat, causing it to explode, killing them both."
    },
    {
      "body": "${link_0} and a young ${link_1}.",
      "links": [
        {
          "body": "Yakone",
          "key": "${link_0}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_1}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        }
      ],
      "text": "Yakone and a young Tarrlok."
    },
    {
      "body": "Tarrlok had a strained relationship with his father, although it had not always been like that. Prior to the discovery of his bending capabilities, Tarrlok and Yakone got along well. However, once it became apparent that Tarrlok was a waterbender, Yakone took to vigorously training both his sons, not shying away from verbally abusing either of them. Being that Tarrlok's bending was not as powerful as his brother's, he was considerably less respectable in his father's eyes. This only worsened after Yakone eventually revealed his true identity to his sons as the most notorious crime boss in Republic City and a once incredible bloodbender. In order to exact his revenge on the Avatar for stripping him of his bending, he intensified his sons' training regime with bloodbending training so they could one day kill the Avatar and take over Republic City to avenge him. However, Tarrlok did not advance as swiftly as his brother or as cruelly as Yakone would have wanted, resulting in a fallout between father and son. The tension reached its boiling point when Tarrlok refused to bloodbend Noatak as part of their training. Yakone lashed out at his youngest son, labeling him a weakling and a disgrace. Noatak prevented Yakone from physically abusing Tarrlok and ran away, after which Yakone stopped training Tarrlok, believing that with Noatak gone, he would never be able to exact vengeance on Republic City or the Avatar.",
      "links": [],
      "text": "Tarrlok had a strained relationship with his father, although it had not always been like that. Prior to the discovery of his bending capabilities, Tarrlok and Yakone got along well. However, once it became apparent that Tarrlok was a waterbender, Yakone took to vigorously training both his sons, not shying away from verbally abusing either of them. Being that Tarrlok's bending was not as powerful as his brother's, he was considerably less respectable in his father's eyes. This only worsened after Yakone eventually revealed his true identity to his sons as the most notorious crime boss in Republic City and a once incredible bloodbender. In order to exact his revenge on the Avatar for stripping him of his bending, he intensified his sons' training regime with bloodbending training so they could one day kill the Avatar and take over Republic City to avenge him. However, Tarrlok did not advance as swiftly as his brother or as cruelly as Yakone would have wanted, resulting in a fallout between father and son. The tension reached its boiling point when Tarrlok refused to bloodbend Noatak as part of their training. Yakone lashed out at his youngest son, labeling him a weakling and a disgrace. Noatak prevented Yakone from physically abusing Tarrlok and ran away, after which Yakone stopped training Tarrlok, believing that with Noatak gone, he would never be able to exact vengeance on Republic City or the Avatar."
    },
    {
      "body": "As a councilman, Tarrlok compared the threat Republic City faced from Amon to the threat it had faced from his father over forty years previously.",
      "links": [],
      "text": "As a councilman, Tarrlok compared the threat Republic City faced from Amon to the threat it had faced from his father over forty years previously."
    },
    {
      "body": "Tarrlok had a good relationship with ${link_0}, as he refused to run away with Noatak because he was afraid of what would happen to her. He would later describe her as a \"warm, caring woman\" to Korra and ${link_1}.",
      "links": [
        {
          "body": "his mother",
          "key": "${link_0}",
          "target": {
            "href": "Yakone%27s_wife",
            "page": "Yakone%27s_wife"
          }
        },
        {
          "body": "Mako",
          "key": "${link_1}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        }
      ],
      "text": "Tarrlok had a good relationship with his mother, as he refused to run away with Noatak because he was afraid of what would happen to her. He would later describe her as a \"warm, caring woman\" to Korra and Mako."
    },
    {
      "body": "The animosity between ${link_0} and ${link_1} grew they moment he realized he could no longer manipulate her to advance his own agenda.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "The animosity between Tarrlok and Korra grew they moment he realized he could no longer manipulate her to advance his own agenda."
    },
    {
      "body": "Tarrlok's relationship with Korra was mainly based on manipulation and deceit, as he used the Avatar in order to push his own agenda, such as goading her to join his ${link_0}. The moment she refused to do his bidding, however, the animosity between the two began to grow, evolving from verbal confrontations, such him insulting Korra's Avatar status and ordering ${link_1} to not meddle in police business by capturing a number of Equalists, to more physical encounters, as evidenced when Korra tried to stop Tarrlok from arresting a large number of innocent nonbenders and her friends with a show of ${link_2}.",
      "links": [
        {
          "body": "task force",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok%27s_task_force",
            "page": "Tarrlok%27s_task_force"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "Tarrlok's relationship with Korra was mainly based on manipulation and deceit, as he used the Avatar in order to push his own agenda, such as goading her to join his task force. The moment she refused to do his bidding, however, the animosity between the two began to grow, evolving from verbal confrontations, such him insulting Korra's Avatar status and ordering Team Avatar to not meddle in police business by capturing a number of Equalists, to more physical encounters, as evidenced when Korra tried to stop Tarrlok from arresting a large number of innocent nonbenders and her friends with a show of earthbending."
    },
    {
      "body": "After the arrest of her friends, the tension between them came to a breaking point: Korra confronted Tarrlok in private at his office in ${link_0}, where she accused him using his power to oppress and intimidate people. In turn, Tarrlok accused Korra of doing the same, assuming she was there to intimidate him into releasing her friends. However, he saw it more as a shared quality of theirs, one to be admired: a willingness to go to extremes in order to get what they want. He tried to force Korra into submission once again, by offering her a trade: her obedience for her friends' freedom. When she refused, Tarrlok knew that the Avatar was no longer of any use to him. Deciding she was a liability to his plans and should be removed, he had no qualms resorting to illegal techniques, such a bloodbending, to achieve that goal, and ended up imprisoning her in a metal box in the basement of a remote ${link_1}.",
      "links": [
        {
          "body": "City Hall",
          "key": "${link_0}",
          "target": {
            "href": "City_Hall",
            "page": "City_Hall"
          }
        },
        {
          "body": "cabin",
          "key": "${link_1}",
          "target": {
            "href": "Tarrlok%27s_hideout",
            "page": "Tarrlok%27s_hideout"
          }
        }
      ],
      "text": "After the arrest of her friends, the tension between them came to a breaking point: Korra confronted Tarrlok in private at his office in City Hall, where she accused him using his power to oppress and intimidate people. In turn, Tarrlok accused Korra of doing the same, assuming she was there to intimidate him into releasing her friends. However, he saw it more as a shared quality of theirs, one to be admired: a willingness to go to extremes in order to get what they want. He tried to force Korra into submission once again, by offering her a trade: her obedience for her friends' freedom. When she refused, Tarrlok knew that the Avatar was no longer of any use to him. Deciding she was a liability to his plans and should be removed, he had no qualms resorting to illegal techniques, such a bloodbending, to achieve that goal, and ended up imprisoning her in a metal box in the basement of a remote cabin."
    },
    {
      "body": "After being captured by Amon and having his bending removed, Tarrlok encountered Korra a last time. Feeling remorseful about his actions, he apologized to the Avatar and cooperated with her to the best of his abilities in order to defeat Amon, sharing with her his knowledge about Amon's past as his waterbending brother.",
      "links": [],
      "text": "After being captured by Amon and having his bending removed, Tarrlok encountered Korra a last time. Feeling remorseful about his actions, he apologized to the Avatar and cooperated with her to the best of his abilities in order to defeat Amon, sharing with her his knowledge about Amon's past as his waterbending brother."
    },
    {
      "body": "${link_0} arrested ${link_1}, as well as ${link_2} and ${link_3}.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Asami",
          "key": "${link_1}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Mako",
          "key": "${link_2}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_3}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        }
      ],
      "text": "Tarrlok arrested Asami, as well as Mako and Bolin."
    },
    {
      "body": "Team Avatar was created by Korra, Mako, ${link_0}, and ${link_1} as a direct result to Tarrlok's actions against Korra, as he had decimated her self-confidence about being able to fulfill her role as the Avatar. The team clashed with Tarrlok a first time when they had apprehended several escaped Equalists before Tarrlok's task force or the ${link_2} could and a second time when Tarrlok had implemented a strict curfew for nonbenders and was arresting the nonbending inhabitants of the ${link_3} on alleged ties with the Equalist. Tarrlok did not hesitate to apprehend the members of Team Avatar as well, arresting Asami for staying outside past curfew and Mako and Bolin for protecting her.",
      "links": [
        {
          "body": "Asami",
          "key": "${link_0}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Metalbending Police Force",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "Dragon Flats borough",
          "key": "${link_3}",
          "target": {
            "href": "Dragon_Flats_borough",
            "page": "Dragon_Flats_borough"
          }
        }
      ],
      "text": "Team Avatar was created by Korra, Mako, Asami, and Bolin as a direct result to Tarrlok's actions against Korra, as he had decimated her self-confidence about being able to fulfill her role as the Avatar. The team clashed with Tarrlok a first time when they had apprehended several escaped Equalists before Tarrlok's task force or the Metalbending Police Force could and a second time when Tarrlok had implemented a strict curfew for nonbenders and was arresting the nonbending inhabitants of the Dragon Flats borough on alleged ties with the Equalist. Tarrlok did not hesitate to apprehend the members of Team Avatar as well, arresting Asami for staying outside past curfew and Mako and Bolin for protecting her."
    },
    {
      "body": "Following the Equalist conquest of Republic City, Korra and Mako ventured to ${link_0} to confront Amon though found an imprisoned Tarrlok in the temple's attic instead. Tarrlok, who had since regretted his recent actions toward Korra and the rest of Team Avatar, sincerely apologized for his actions against them and revealed his shared past with Amon to them. Based on this information, Team Avatar was able to out the Equalist leader as a fraud.",
      "links": [
        {
          "body": "Air Temple Island",
          "key": "${link_0}",
          "target": {
            "href": "Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        }
      ],
      "text": "Following the Equalist conquest of Republic City, Korra and Mako ventured to Air Temple Island to confront Amon though found an imprisoned Tarrlok in the temple's attic instead. Tarrlok, who had since regretted his recent actions toward Korra and the rest of Team Avatar, sincerely apologized for his actions against them and revealed his shared past with Amon to them. Based on this information, Team Avatar was able to out the Equalist leader as a fraud."
    },
    {
      "body": "${link_0} and the ${link_1}.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "council page",
          "key": "${link_1}",
          "target": {
            "href": "Council_page",
            "page": "Council_page"
          }
        }
      ],
      "text": "Tarrlok and the council page."
    },
    {
      "body": "Tarrlok thought not much about his employee, using him as a messenger boy and having no qualms about ordering him around. When ${link_0} and ${link_1} were questioning Tarrlok about Korra's disappearance, the page appeared and revealed that Tarrlok kidnapped her, to which Tarrlok replied that he was \"nothing but a squeaky-voiced liar.\"",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_1}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        }
      ],
      "text": "Tarrlok thought not much about his employee, using him as a messenger boy and having no qualms about ordering him around. When Tenzin and Lin Beifong were questioning Tarrlok about Korra's disappearance, the page appeared and revealed that Tarrlok kidnapped her, to which Tarrlok replied that he was \"nothing but a squeaky-voiced liar.\""
    },
    {
      "body": "Tarrlok had little respect for Lin Beifong as the ${link_0} of Republic City; he merely saw her as another paw in his game of manipulation to gain more power for himself. He goaded her into taking responsibility should anything happen during the ${link_1} after the Equalist threatened to attack. As such, he was able to discredit her as chief after she failed to thwart the Equalists' attack on the ${link_2}, publicly stating that she had failed Republic City and that new leadership was needed.",
      "links": [
        {
          "body": "Chief of Police",
          "key": "${link_0}",
          "target": {
            "href": "Chief_of_Police",
            "page": "Chief_of_Police"
          }
        },
        {
          "body": "Pro-bending Tournament",
          "key": "${link_1}",
          "target": {
            "href": "Pro-bending#Pro-bending_Tournament",
            "page": "Pro-bending"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_2}",
          "target": {
            "href": "Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        }
      ],
      "text": "Tarrlok had little respect for Lin Beifong as the Chief of Police of Republic City; he merely saw her as another paw in his game of manipulation to gain more power for himself. He goaded her into taking responsibility should anything happen during the Pro-bending Tournament after the Equalist threatened to attack. As such, he was able to discredit her as chief after she failed to thwart the Equalists' attack on the Pro-bending Arena, publicly stating that she had failed Republic City and that new leadership was needed."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Tarrlok",
          "key": "${link_0}",
          "target": {
            "href": "Tarrlok",
            "page": "Tarrlok"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_1}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        }
      ],
      "text": "Tarrlok and Tenzin."
    },
    {
      "body": "Tenzin worked with Tarrlok on the United Republic Council. The two were fierce rivals for the duration of their tenures, rarely agreeing on suggestions in the council meetings. Tenzin was especially displeased with Tarrlok's new law that would enforce a curfew for all nonbenders.",
      "links": [],
      "text": "Tenzin worked with Tarrlok on the United Republic Council. The two were fierce rivals for the duration of their tenures, rarely agreeing on suggestions in the council meetings. Tenzin was especially displeased with Tarrlok's new law that would enforce a curfew for all nonbenders."
    },
    {
      "body": "After Tarrlok abducted Avatar Korra, it was Tenzin who discovered that it was not Equalists like Tarrlok had claimed, but Tarrlok himself who had taken her. Tenzin headed to City Hall and confronted Tarrlok with his crimes, who claimed innocence to all accusations. However, the council page finally confirmed the truth and revealed that Tarrlok was a bloodbender, leaving him no choice but to incapacitate everyone present and flee the scene.",
      "links": [],
      "text": "After Tarrlok abducted Avatar Korra, it was Tenzin who discovered that it was not Equalists like Tarrlok had claimed, but Tarrlok himself who had taken her. Tenzin headed to City Hall and confronted Tarrlok with his crimes, who claimed innocence to all accusations. However, the council page finally confirmed the truth and revealed that Tarrlok was a bloodbender, leaving him no choice but to incapacitate everyone present and flee the scene."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Tarrlok%27s_relationships",
    "file": "avatar.wikia.com/wiki/Tarrlok's_relationships.html",
    "page": "Tarrlok's_relationships",
    "title": "Tarrlok's relationships"
  }
}