{
  "categories": [
    {
      "body": "B-class candidates",
      "target": {
        "href": "Category_B-class_candidates",
        "page": "Category_B-class_candidates"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Beverages",
      "target": {
        "href": "Category_Beverages",
        "page": "Category_Beverages"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "href": "Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page has been nominated to be a ${link_0} due to its reasonable standard.",
      "links": [
        {
          "body": "B-class article",
          "key": "${link_0}",
          "target": {
            "href": "Avatar_Wiki_B-class_articles",
            "page": "Avatar_Wiki_B-class_articles"
          }
        }
      ],
      "text": "This page has been nominated to be a B-class article due to its reasonable standard."
    },
    {
      "body": "${link_0} enjoyed drinking and serving tea.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Iroh enjoyed drinking and serving tea."
    },
    {
      "body": "Tea is a commonly served ${link_0} in the ${link_1}. It is brewed from a variety of leaves and ${link_2}, which are steeped in hot water prior to consumption. While milk is not typically added to traditional brews, ${link_3} suggested it as a complementary additive when he attempted to create his own varieties.",
      "links": [
        {
          "body": "beverage",
          "key": "${link_0}",
          "target": {
            "href": "Cuisine_in_the_World_of_Avatar",
            "page": "Cuisine_in_the_World_of_Avatar"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "herbs",
          "key": "${link_2}",
          "target": {
            "href": "Flora_in_the_World_of_Avatar",
            "page": "Flora_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_3}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Tea is a commonly served beverage in the World of Avatar. It is brewed from a variety of leaves and herbs, which are steeped in hot water prior to consumption. While milk is not typically added to traditional brews, Iroh suggested it as a complementary additive when he attempted to create his own varieties."
    },
    {
      "body": "Tea is most commonly consumed in the ${link_0} and ${link_1} due its is relative accessibility. Comparatively, tea is not as actively consumed in the ${link_2} due to the lack of suitable plants with which to create it.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Water Tribes",
          "key": "${link_2}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        }
      ],
      "text": "Tea is most commonly consumed in the Earth Kingdom and Fire Nation due its is relative accessibility. Comparatively, tea is not as actively consumed in the Water Tribes due to the lack of suitable plants with which to create it."
    },
    {
      "body": "The most notable tea drinker was Iroh, who enjoyed it on a regular basis. He had a lifelong dream of opening a tea shop, and achieved this goal when he opened the ${link_0} in ${link_1}.",
      "links": [
        {
          "body": "Jasmine Dragon",
          "key": "${link_0}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "The most notable tea drinker was Iroh, who enjoyed it on a regular basis. He had a lifelong dream of opening a tea shop, and achieved this goal when he opened the Jasmine Dragon in Ba Sing Se."
    },
    {
      "body": "When consumed, ${link_0}-enhancing tea is a natural stimulant that improves strength and increases energy tenfold. It is consumed by ${link_1} officials and soldiers, though rather sparingly due to its rarity.",
      "links": [
        {
          "body": "chi",
          "key": "${link_0}",
          "target": {
            "href": "Chi",
            "page": "Chi"
          }
        },
        {
          "body": "Earth Kingdom military",
          "key": "${link_1}",
          "target": {
            "href": "Military_of_the_Earth_Kingdom",
            "page": "Military_of_the_Earth_Kingdom"
          }
        }
      ],
      "text": "When consumed, chi-enhancing tea is a natural stimulant that improves strength and increases energy tenfold. It is consumed by Earth Kingdom military officials and soldiers, though rather sparingly due to its rarity."
    },
    {
      "body": "${link_0} ${link_1} drank this tea per ${link_2} ${link_3}'s suggestion. While the beverage made Aang hyperactive, it did not successfully induce the ${link_4}, which was the intended goal.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "General",
          "key": "${link_2}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#General",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Fong",
          "key": "${link_3}",
          "target": {
            "href": "Fong",
            "page": "Fong"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_4}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        }
      ],
      "text": "Avatar Aang drank this tea per General Fong's suggestion. While the beverage made Aang hyperactive, it did not successfully induce the Avatar State, which was the intended goal."
    },
    {
      "body": "An herbal concoction, ginger tea is made through the use of ginger roots and is primarily used for medicinal purposes.",
      "links": [],
      "text": "An herbal concoction, ginger tea is made through the use of ginger roots and is primarily used for medicinal purposes."
    },
    {
      "body": "Zuko and Iroh were served ginseng tea during their stay at ${link_0}'s base. Iroh enjoyed many cups of this tea and claimed it to be his favorite upon their departure.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        }
      ],
      "text": "Zuko and Iroh were served ginseng tea during their stay at Zhao's base. Iroh enjoyed many cups of this tea and claimed it to be his favorite upon their departure."
    },
    {
      "body": "Green tea is one of the many teas served in Iroh's teashop. It is enjoyed primarily by ${link_0} of the Earth Kingdom.",
      "links": [
        {
          "body": "citizens",
          "key": "${link_0}",
          "target": {
            "href": "Society_in_the_World_of_Avatar",
            "page": "Society_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Green tea is one of the many teas served in Iroh's teashop. It is enjoyed primarily by citizens of the Earth Kingdom."
    },
    {
      "body": "Said to be a relatively soothing brew, jasmine tea is a favorite of Iroh's. He offered it to ${link_0} right after he saw the light in the sky resulting from Aang's release from the iceberg.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Said to be a relatively soothing brew, jasmine tea is a favorite of Iroh's. He offered it to Zuko right after he saw the light in the sky resulting from Aang's release from the iceberg."
    },
    {
      "body": "A tea available in Iroh's teashop, this brew is enjoyed by many citizens of the Earth Kingdom, specifically those in ${link_0}. It is made from ${link_1} and, due to the fruit's availability, is commonly found in many parts of the globe.",
      "links": [
        {
          "body": "Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "lychee nuts",
          "key": "${link_1}",
          "target": {
            "href": "Lychee_nut",
            "page": "Lychee_nut"
          }
        }
      ],
      "text": "A tea available in Iroh's teashop, this brew is enjoyed by many citizens of the Earth Kingdom, specifically those in Ba Sing Se. It is made from lychee nuts and, due to the fruit's availability, is commonly found in many parts of the globe."
    },
    {
      "body": "Spiced tea is commonly served in the Fire Nation. It was offered to ${link_0} by ${link_1} after she found the group camping out near ${link_2}.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Hama",
          "key": "${link_1}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "her inn",
          "key": "${link_2}",
          "target": {
            "href": "Hama%27s_inn",
            "page": "Hama%27s_inn"
          }
        }
      ],
      "text": "Spiced tea is commonly served in the Fire Nation. It was offered to Team Avatar by Hama after she found the group camping out near her inn."
    },
    {
      "body": "Invented by Iroh, this kind of tea is made by stewing tapioca balls until they are soft and tender. The tapioca is subsequently added to a cup of tea, along with a small amount of milk. Both Zuko and Aang disliked the taste, with Zuko spitting his out and Aang commenting that he found it chewy.",
      "links": [],
      "text": "Invented by Iroh, this kind of tea is made by stewing tapioca balls until they are soft and tender. The tapioca is subsequently added to a cup of tea, along with a small amount of milk. Both Zuko and Aang disliked the taste, with Zuko spitting his out and Aang commenting that he found it chewy."
    },
    {
      "body": "The ${link_0} is a plant that grows in the eastern Earth Kingdom. According to Iroh, the plant can be used to brew a tea \"so delicious, it's heartbreaking\". It is sometimes confused with the white jade bush due to the two plants having similar appearances.",
      "links": [
        {
          "body": "white dragon bush",
          "key": "${link_0}",
          "target": {
            "href": "White_dragon_bush",
            "page": "White_dragon_bush"
          }
        }
      ],
      "text": "The white dragon bush is a plant that grows in the eastern Earth Kingdom. According to Iroh, the plant can be used to brew a tea \"so delicious, it's heartbreaking\". It is sometimes confused with the white jade bush due to the two plants having similar appearances."
    },
    {
      "body": "The ${link_0} is a plant that grows in the eastern Earth Kingdom. It is sometimes confused with the white dragon bush, due to the two plants having similar appearances. Tea made from the white jade bush can be poisonous to the drinker if brewed incorrectly. When Iroh brewed a tea from the white jade plant, he developed a severe rash that would have caused his throat to swell and restricted his breathing if left untreated. However, it can be prepared for safe consumption, as ${link_1} served a cup of this brew to Iroh when he was detained in the ${link_2}, stating that she knew how much he liked rare teas.",
      "links": [
        {
          "body": "white jade bush",
          "key": "${link_0}",
          "target": {
            "href": "White_jade_bush",
            "page": "White_jade_bush"
          }
        },
        {
          "body": "Ming",
          "key": "${link_1}",
          "target": {
            "href": "Ming",
            "page": "Ming"
          }
        },
        {
          "body": "Capital City Prison",
          "key": "${link_2}",
          "target": {
            "href": "Capital_City_Prison",
            "page": "Capital_City_Prison"
          }
        }
      ],
      "text": "The white jade bush is a plant that grows in the eastern Earth Kingdom. It is sometimes confused with the white dragon bush, due to the two plants having similar appearances. Tea made from the white jade bush can be poisonous to the drinker if brewed incorrectly. When Iroh brewed a tea from the white jade plant, he developed a severe rash that would have caused his throat to swell and restricted his breathing if left untreated. However, it can be prepared for safe consumption, as Ming served a cup of this brew to Iroh when he was detained in the Capital City Prison, stating that she knew how much he liked rare teas."
    },
    {
      "body": "The ${link_0} was located in the ${link_1} of ${link_2} and owned by ${link_3}.",
      "links": [
        {
          "body": "Jasmine Dragon",
          "key": "${link_0}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        },
        {
          "body": "Upper Ring",
          "key": "${link_1}",
          "target": {
            "href": "Ba_Sing_Se#Upper_Ring",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_2}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_3}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "The Jasmine Dragon was located in the Upper Ring of Ba Sing Se and owned by Iroh."
    },
    {
      "body": "The Jasmine Dragon was a tea house owned by Iroh and located in the ${link_0} of Ba Sing Se. Traditional in design, the once-failing business was revived after being taken over by Iroh and was frequented by many high-class citizens due to the renowned tea served there.",
      "links": [
        {
          "body": "Upper Ring",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se#Upper_Ring",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "The Jasmine Dragon was a tea house owned by Iroh and located in the Upper Ring of Ba Sing Se. Traditional in design, the once-failing business was revived after being taken over by Iroh and was frequented by many high-class citizens due to the renowned tea served there."
    },
    {
      "body": "Located on the grounds of the ${link_0} and surrounded by lush gardens, the King's Tea Palace is among the most prestigious in Ba Sing Se, considered a place for tranquility and reflection. With servants on hand to brew and serve the tea, it was often used by ${link_1} ${link_2} as a place to meet with guests, or frequented by the king and his pet bear, ${link_3}. In Kuei's time, the King's Tea Palace was surrounded by animal topiaries representing the king's menagerie of exotic ${link_4}.",
      "links": [
        {
          "body": "Earth Kingdom Royal Palace",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_1}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Kuei",
          "key": "${link_2}",
          "target": {
            "href": "Kuei",
            "page": "Kuei"
          }
        },
        {
          "body": "Bosco",
          "key": "${link_3}",
          "target": {
            "href": "Bosco",
            "page": "Bosco"
          }
        },
        {
          "body": "fauna",
          "key": "${link_4}",
          "target": {
            "href": "Fauna_in_the_World_of_Avatar",
            "page": "Fauna_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "Located on the grounds of the Earth Kingdom Royal Palace and surrounded by lush gardens, the King's Tea Palace is among the most prestigious in Ba Sing Se, considered a place for tranquility and reflection. With servants on hand to brew and serve the tea, it was often used by Earth King Kuei as a place to meet with guests, or frequented by the king and his pet bear, Bosco. In Kuei's time, the King's Tea Palace was surrounded by animal topiaries representing the king's menagerie of exotic fauna."
    },
    {
      "body": "The Pao Family Tea House is a tea house in the ${link_0} of Ba Sing Se owned by ${link_1}. It enjoyed commercial success during the short period that Iroh worked there and was frequented by citizens of the Lower Ring searching for a place to relax and talk over a cup of tea.",
      "links": [
        {
          "body": "Lower Ring",
          "key": "${link_0}",
          "target": {
            "href": "Ba_Sing_Se#Lower_Ring",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Pao",
          "key": "${link_1}",
          "target": {
            "href": "Pao",
            "page": "Pao"
          }
        }
      ],
      "text": "The Pao Family Tea House is a tea house in the Lower Ring of Ba Sing Se owned by Pao. It enjoyed commercial success during the short period that Iroh worked there and was frequented by citizens of the Lower Ring searching for a place to relax and talk over a cup of tea."
    },
    {
      "body": "Tea is also a very common drink in the real world, especially in Asia and the British Isles, the former being a continent with various cultures from which the franchise draws influence. Many types of tea in the Avatar World also exist in the real world.",
      "links": [],
      "text": "Tea is also a very common drink in the real world, especially in Asia and the British Isles, the former being a continent with various cultures from which the franchise draws influence. Many types of tea in the Avatar World also exist in the real world."
    },
    {
      "body": "Iroh's \"tapioca tea\" is similar to bubble tea, which was invented in Taiwan in the 1980's and includes many varieties, one of which involves the use of a tea-based mixture blended with milk, fruit, and toppings like tapioca pearls and various jellies to create a thicker consistency beverage.",
      "links": [],
      "text": "Iroh's \"tapioca tea\" is similar to bubble tea, which was invented in Taiwan in the 1980's and includes many varieties, one of which involves the use of a tea-based mixture blended with milk, fruit, and toppings like tapioca pearls and various jellies to create a thicker consistency beverage."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Tea",
    "file": "avatar.wikia.com/wiki/Tea.html",
    "page": "Tea",
    "title": "Tea"
  }
}