{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Tenzin is a quiet and calm man with a great sense of responsibility toward the people of ${link_2}.",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        }
      ],
      "section": [
        "Tenzin's relationships"
      ],
      "text": "This page is comprised of Tenzin's relationships with other characters in the World of Avatar. Tenzin is a quiet and calm man with a great sense of responsibility toward the people of Republic City."
    },
    {
      "body": "Tenzin was the only one of ${link_0} ${link_1}'s children who inherited his father's ${link_2}. As the only living airbending master, Aang taught him, and Tenzin mastered the skill, earning his ${link_3}. The two developed a good relationship; the Avatar even built a ${link_4} for his son and his family. Tenzin highly respects his father as his mentor, and rarely addresses him as \"father\" unlike ${link_5}. Instead, Tenzin calls him \"Avatar Aang\" whenever the latter is brought up in a conversation. However, it is notable that when he does refer to Aang as such, the topic of conversation usually has to do with the responsibility of being the Avatar, whereas his referring to Aang as \"father\" or \"dad\" can be observed when the conversation turns to Aang in a familiar setting.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "airbending",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "arrows",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Body_markings_in_the_World_of_Avatar#Airbending_masters",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        },
        {
          "body": "new air temple",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island",
            "page": "Air_Temple_Island"
          }
        },
        {
          "body": "his mother",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Relatives",
        "Aang"
      ],
      "text": "Tenzin was the only one of Avatar Aang's children who inherited his father's airbending. As the only living airbending master, Aang taught him, and Tenzin mastered the skill, earning his arrows. The two developed a good relationship; the Avatar even built a new air temple for his son and his family. Tenzin highly respects his father as his mentor, and rarely addresses him as \"father\" unlike his mother. Instead, Tenzin calls him \"Avatar Aang\" whenever the latter is brought up in a conversation. However, it is notable that when he does refer to Aang as such, the topic of conversation usually has to do with the responsibility of being the Avatar, whereas his referring to Aang as \"father\" or \"dad\" can be observed when the conversation turns to Aang in a familiar setting."
    },
    {
      "body": "Tenzin respects his father and still misses him. When he was heading to Air Temple Island on ${link_0}, he looked up at ${link_1} with sorrow before solemnly bowing his head. When ${link_2} suggested that he was emulating Aang's past actions in the council, Tenzin quickly and defensively chastised him for being arrogant enough to think himself to be as good as \"Avatar Aang\".",
      "links": [
        {
          "body": "his boat",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Temple_Island_ferry",
            "page": "Air_Temple_Island_ferry"
          }
        },
        {
          "body": "Aang's statue",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Aang_Memorial_Island#Aang.27s_statue",
            "page": "Aang_Memorial_Island"
          }
        },
        {
          "body": "Tarrlok",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Tarrlok",
            "page": "Tarrlok"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Relatives",
        "Aang"
      ],
      "text": "Tenzin respects his father and still misses him. When he was heading to Air Temple Island on his boat, he looked up at Aang's statue with sorrow before solemnly bowing his head. When Tarrlok suggested that he was emulating Aang's past actions in the council, Tenzin quickly and defensively chastised him for being arrogant enough to think himself to be as good as \"Avatar Aang\"."
    },
    {
      "body": "Being a member of the ${link_0}, Tenzin feels a great responsibility for the welfare of Republic City and its inhabitants. His original desire was to protect the metropolis. This may have stemmed from the fact that his father helped to found the entire United Republic. If this is so, it shows how much Tenzin wishes to please his father, both then and now. Being the son of Aang, a true spiritualist, Tenzin is ashamed that despite his extensive training and study of the subject, he has yet to achieve a connection to the Spirit World like his father.",
      "links": [
        {
          "body": "United Republic Council",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/United_Republic_Council",
            "page": "United_Republic_Council"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Relatives",
        "Aang"
      ],
      "text": "Being a member of the United Republic Council, Tenzin feels a great responsibility for the welfare of Republic City and its inhabitants. His original desire was to protect the metropolis. This may have stemmed from the fact that his father helped to found the entire United Republic. If this is so, it shows how much Tenzin wishes to please his father, both then and now. Being the son of Aang, a true spiritualist, Tenzin is ashamed that despite his extensive training and study of the subject, he has yet to achieve a connection to the Spirit World like his father."
    },
    {
      "body": "During his vacation with his family and siblings, Tenzin was forced to acknowledge that his father had several faults, including unintentionally favoring him over his siblings, which he felt he needed to rectify by apologizing on Aang's behalf.",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Relatives",
        "Aang"
      ],
      "text": "During his vacation with his family and siblings, Tenzin was forced to acknowledge that his father had several faults, including unintentionally favoring him over his siblings, which he felt he needed to rectify by apologizing on Aang's behalf."
    },
    {
      "body": "When Tenzin was lost in the ${link_0} and began to succumb to the mental deterioration of the place, he attempted to remind himself of who he was by constantly reminding himself that he was the son of Avatar Aang and the hope of future generations of airbenders. When a vision of Aang appeared before his son, Tenzin profusely apologized to his father for failing to continue his work. The late airbender solemnly told his son that he only failed because he spent his entire life trying to be like him, holding on to a false perception of himself. Aang told Tenzin that they were different people and that was how it should be. Realizing that he had to live his own life, Tenzin was able to finally step out of his father's shadow and awaken his spiritual side, dispersing the fog long enough to save himself as well as his daughter and siblings.",
      "links": [
        {
          "body": "Fog of Lost Souls",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fog_of_Lost_Souls",
            "page": "Fog_of_Lost_Souls"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Relatives",
        "Aang"
      ],
      "text": "When Tenzin was lost in the Fog of Lost Souls and began to succumb to the mental deterioration of the place, he attempted to remind himself of who he was by constantly reminding himself that he was the son of Avatar Aang and the hope of future generations of airbenders. When a vision of Aang appeared before his son, Tenzin profusely apologized to his father for failing to continue his work. The late airbender solemnly told his son that he only failed because he spent his entire life trying to be like him, holding on to a false perception of himself. Aang told Tenzin that they were different people and that was how it should be. Realizing that he had to live his own life, Tenzin was able to finally step out of his father's shadow and awaken his spiritual side, dispersing the fog long enough to save himself as well as his daughter and siblings."
    },
    {
      "body": "Tenzin was averse of his older brother's hyperactivity and bouncy personality. When Bumi arrived at Air Temple Island after ${link_0}'s defeat, Tenzin sighed, dreading the idea of having to entertain his brother, much to Tenzin's dismay and Bumi's greatness. Following Bumi's retirement from the United Forces, Tenzin allowed him to stay with him and his family on Air Temple Island. Despite routinely detesting Bumi's episodes of immaturity and convoluted storytelling, they sincerely care for each other, as it was evidenced when, voicing his fear to not belong in the Air Nation when he gained the ability of airbending in 171 AG, Bumi was reassured by Tenzin that he was where he belonged or when the ex commander reassured his brother that he and ${link_1} would be for him whenever he wanted, including, even, in fighting together.",
      "links": [
        {
          "body": "Amon",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Amon",
            "page": "Amon"
          }
        },
        {
          "body": "her sister",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Kya",
            "page": "Kya"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Relatives",
        "Bumi"
      ],
      "text": "Tenzin was averse of his older brother's hyperactivity and bouncy personality. When Bumi arrived at Air Temple Island after Amon's defeat, Tenzin sighed, dreading the idea of having to entertain his brother, much to Tenzin's dismay and Bumi's greatness. Following Bumi's retirement from the United Forces, Tenzin allowed him to stay with him and his family on Air Temple Island. Despite routinely detesting Bumi's episodes of immaturity and convoluted storytelling, they sincerely care for each other, as it was evidenced when, voicing his fear to not belong in the Air Nation when he gained the ability of airbending in 171 AG, Bumi was reassured by Tenzin that he was where he belonged or when the ex commander reassured his brother that he and her sister would be for him whenever he wanted, including, even, in fighting together."
    },
    {
      "body": "As evidenced by ${link_0} and ${link_1}'s reaction to ${link_2} accusing Tenzin of being a \"terrible teacher\", Tenzin has a loving relationship with his two daughters and son. His daughters immediately comforted him when he appeared crestfallen, and he was not at all surprised by their gestures. Despite facing testy parenting issues, namely Jinora's growing interest in boys, Ikki's uncontrollable verbosity, and Meelo's constant mischief, Tenzin still loves his children dearly. He also has a good relationship with his youngest son, ${link_3}, being able to soothe the boy and making him laugh.",
      "links": [
        {
          "body": "Ikki",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ikki",
            "page": "Ikki"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Korra",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Rohan",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Rohan",
            "page": "Rohan"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Relatives",
        "Children"
      ],
      "text": "As evidenced by Ikki and Jinora's reaction to Korra accusing Tenzin of being a \"terrible teacher\", Tenzin has a loving relationship with his two daughters and son. His daughters immediately comforted him when he appeared crestfallen, and he was not at all surprised by their gestures. Despite facing testy parenting issues, namely Jinora's growing interest in boys, Ikki's uncontrollable verbosity, and Meelo's constant mischief, Tenzin still loves his children dearly. He also has a good relationship with his youngest son, Rohan, being able to soothe the boy and making him laugh."
    },
    {
      "body": "After the United Republic Council was disbanded, Tenzin used his time to spend more time with his children, something he thoroughly enjoyed as he regretted that he had put his duty to the city before their needs in the past.",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Relatives",
        "Children"
      ],
      "text": "After the United Republic Council was disbanded, Tenzin used his time to spend more time with his children, something he thoroughly enjoyed as he regretted that he had put his duty to the city before their needs in the past."
    },
    {
      "body": "He was highly resistant to acknowledge Jinora's mastery of airbending at the young age of eleven, but due to her actions in leading the newly reborn Air Nation in aiding Korra in her battle against Zaheer, he finally relented. Two weeks later, he anointed her a true master and marked her with the blue arrow tattoos of a master airbender before the new Air Nation. Tenzin has shown a caring relationship with all of them, as they are always willing to help his father, as when Meelo agreed that they would help him collecting the new airbenders, and share a group hug, or fighting against ${link_0}.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Relatives",
        "Children"
      ],
      "text": "He was highly resistant to acknowledge Jinora's mastery of airbending at the young age of eleven, but due to her actions in leading the newly reborn Air Nation in aiding Korra in her battle against Zaheer, he finally relented. Two weeks later, he anointed her a true master and marked her with the blue arrow tattoos of a master airbender before the new Air Nation. Tenzin has shown a caring relationship with all of them, as they are always willing to help his father, as when Meelo agreed that they would help him collecting the new airbenders, and share a group hug, or fighting against Kuvira."
    },
    {
      "body": "When Tenzin and his family traveled to the ${link_0}, Katara was eagerly awaiting the arrival of her youngest son and her grandchildren. Once he arrived, Tenzin briefly bowed with respect to his mother. When Tenzin revealed that his family would not be moving to the compound as planned and would only be staying for one night, Katara appeared quite disappointed. During the Glacier Spirits Festival, Katara watched as Tenzin was teased by his siblings during the royal feast. When Tenzin was ready to leave, Katara insisted he take his siblings to visit their father's home together, telling him that he'd appreciate the time he had with his siblings when he got to her age.",
      "links": [
        {
          "body": "Southern Water Tribe compound",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe_compound",
            "page": "Southern_Water_Tribe_compound"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Relatives",
        "Katara"
      ],
      "text": "When Tenzin and his family traveled to the Southern Water Tribe compound, Katara was eagerly awaiting the arrival of her youngest son and her grandchildren. Once he arrived, Tenzin briefly bowed with respect to his mother. When Tenzin revealed that his family would not be moving to the compound as planned and would only be staying for one night, Katara appeared quite disappointed. During the Glacier Spirits Festival, Katara watched as Tenzin was teased by his siblings during the royal feast. When Tenzin was ready to leave, Katara insisted he take his siblings to visit their father's home together, telling him that he'd appreciate the time he had with his siblings when he got to her age."
    },
    {
      "body": "Katara mentioned that Tenzin, while growing up, had always had a different personality than his older siblings; while his older sister Kya was rambunctious, he retained a more serious and calm demeanor. He was often the victim of Kya's teasing as a child, as she liked to play rough games with him, causing him to be afraid of her sometimes. Despite that, however, they maintained a healthy brother-sister relationship, and he supported her when she revealed her sexual orientation to him.",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Relatives",
        "Kya"
      ],
      "text": "Katara mentioned that Tenzin, while growing up, had always had a different personality than his older siblings; while his older sister Kya was rambunctious, he retained a more serious and calm demeanor. He was often the victim of Kya's teasing as a child, as she liked to play rough games with him, causing him to be afraid of her sometimes. Despite that, however, they maintained a healthy brother-sister relationship, and he supported her when she revealed her sexual orientation to him."
    },
    {
      "body": "Later in life, Tenzin felt that his sister was irresponsible for wasting years trying to find herself, stating that it was only when she settled down in the South with their mother that she acted responsible. Most of the problems between them came from this. However, Both Tenzin and Kya are racional thinkers, to the contrary of Bumi, which led them to have arguments with him. However, after listening to Ikki, he reconciled with Kya.",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Relatives",
        "Kya"
      ],
      "text": "Later in life, Tenzin felt that his sister was irresponsible for wasting years trying to find herself, stating that it was only when she settled down in the South with their mother that she acted responsible. Most of the problems between them came from this. However, Both Tenzin and Kya are racional thinkers, to the contrary of Bumi, which led them to have arguments with him. However, after listening to Ikki, he reconciled with Kya."
    },
    {
      "body": "Kya is always there when Tenzin need her, being sometimes a voice of reason to him. This was evident when Korra lost against Unalaq and she encouraged her brother to help her, being conscious that the Avatar would need her. When Jinora travelled to the Spirit World, Kya consoled Tenzin by saying that she was smart and intelligent, so there was no need to worry, though if he need to talk, she and Bumi would be there for him. Also, she helped him protecting and teaching the new airbenders. When Tenzin fought against the Red Lotus, Kya was on his side.",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Relatives",
        "Kya"
      ],
      "text": "Kya is always there when Tenzin need her, being sometimes a voice of reason to him. This was evident when Korra lost against Unalaq and she encouraged her brother to help her, being conscious that the Avatar would need her. When Jinora travelled to the Spirit World, Kya consoled Tenzin by saying that she was smart and intelligent, so there was no need to worry, though if he need to talk, she and Bumi would be there for him. Also, she helped him protecting and teaching the new airbenders. When Tenzin fought against the Red Lotus, Kya was on his side."
    },
    {
      "body": "${link_0} and Tenzin seem to have a distant, yet professional, relationship. The two were romantically involved in their younger years, but began to drift apart after a while, one of the reasons being Lin's lack of interest toward having children unlike Tenzin. Tenzin broke it off after Pema confessed her love to him. Lin tried unsuccessfully to get Pema thrown into jail afterward, and caused damage to Air Temple Island in a fit of rage. Presently, despite there still being some tension between the two, they seem to regard each other with respect, as Tenzin managed to convince Lin to release Korra after she was detained by the ${link_1}. Even with the tension and distance between them, they also worked closely together while monitoring the Pro-bending Championship and during the subsequent investigations into ${link_2} and ${link_3}. Sometime later, Tenzin asked Lin to protect his family in his absence while he met with the council. Lin accepted, acknowledging him as an old friend. He later showed concern for Lin after she left to take down the ${link_4} and agreed with his son when Meelo commented, \"That lady is my hero\", referring to Lin.",
      "links": [
        {
          "body": "Lin",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "Metalbending Police Force",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "Cabbage Corp",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Cabbage_Corp",
            "page": "Cabbage_Corp"
          }
        },
        {
          "body": "Future Industries",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries",
            "page": "Future_Industries"
          }
        },
        {
          "body": "Equalist airships",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Equalist_airship",
            "page": "Equalist_airship"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Love interests",
        "Lin Beifong"
      ],
      "text": "Lin and Tenzin seem to have a distant, yet professional, relationship. The two were romantically involved in their younger years, but began to drift apart after a while, one of the reasons being Lin's lack of interest toward having children unlike Tenzin. Tenzin broke it off after Pema confessed her love to him. Lin tried unsuccessfully to get Pema thrown into jail afterward, and caused damage to Air Temple Island in a fit of rage. Presently, despite there still being some tension between the two, they seem to regard each other with respect, as Tenzin managed to convince Lin to release Korra after she was detained by the Metalbending Police Force. Even with the tension and distance between them, they also worked closely together while monitoring the Pro-bending Championship and during the subsequent investigations into Cabbage Corp and Future Industries. Sometime later, Tenzin asked Lin to protect his family in his absence while he met with the council. Lin accepted, acknowledging him as an old friend. He later showed concern for Lin after she left to take down the Equalist airships and agreed with his son when Meelo commented, \"That lady is my hero\", referring to Lin."
    },
    {
      "body": "${link_0} and Tenzin got to know each other at Air Temple Island, where she was part of the ${link_1} that had moved there to learn the ways of the ${link_2}. At that time, Tenzin was in a relationship with Lin Beifong, but Pema fell in love with him nonetheless. Albeit shy and scared of rejection at first, she eventually mustered up the courage to admit her true feelings to him. Those feelings were reciprocated by him, as he broke off his relationship with Lin and eventually married Pema. Together, the two started a family on Air Temple Island which consists of four children, two daughters and two sons.",
      "links": [
        {
          "body": "Pema",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pema",
            "page": "Pema"
          }
        },
        {
          "body": "Air Acolytes",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Acolytes",
            "page": "Air_Acolytes"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Air_Nomads",
            "page": "Air_Nomads"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Love interests",
        "Pema"
      ],
      "text": "Pema and Tenzin got to know each other at Air Temple Island, where she was part of the Air Acolytes that had moved there to learn the ways of the Air Nomads. At that time, Tenzin was in a relationship with Lin Beifong, but Pema fell in love with him nonetheless. Albeit shy and scared of rejection at first, she eventually mustered up the courage to admit her true feelings to him. Those feelings were reciprocated by him, as he broke off his relationship with Lin and eventually married Pema. Together, the two started a family on Air Temple Island which consists of four children, two daughters and two sons."
    },
    {
      "body": "Tenzin is protective of Pema, especially when she was pregnant, and wants to assist her in any way he can. Tenzin holds his wife's opinion in high regard, though is not above keeping secrets from her, particularly his shame over his inability to enter the Spirit World.",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Love interests",
        "Pema"
      ],
      "text": "Tenzin is protective of Pema, especially when she was pregnant, and wants to assist her in any way he can. Tenzin holds his wife's opinion in high regard, though is not above keeping secrets from her, particularly his shame over his inability to enter the Spirit World."
    },
    {
      "body": "Tenzin allowed Korra to stay with him on Air Temple Island after disagreeing with Lin's decision to send the Avatar back to the Southern Water Tribe. Having Korra stay with his family changed his peaceful life and, on top of protecting Republic City as a council member, he had the added responsibility of teaching Korra airbending and the spiritual aspects of being the Avatar.",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Allies",
        "Korra"
      ],
      "text": "Tenzin allowed Korra to stay with him on Air Temple Island after disagreeing with Lin's decision to send the Avatar back to the Southern Water Tribe. Having Korra stay with his family changed his peaceful life and, on top of protecting Republic City as a council member, he had the added responsibility of teaching Korra airbending and the spiritual aspects of being the Avatar."
    },
    {
      "body": "Tenzin also plays the part of a father figure for Korra. He became protective over her when she moved to Republic City. For example, he almost sent out search parties to look for Korra when she did not return home while she was looking for Bolin. Furthermore, Tenzin prohibited her from watching ${link_0} as she had come to the city to learn airbending. Although he eventually let her participate, Tenzin watched the final tournament, just to make sure Korra was safe. Tenzin also noticed Korra's fear of Amon and asked her about her real reason for refusing to join ${link_1}, telling her that it is okay to be afraid sometimes. At her denial, he reassured her that she could tell him anything whenever she wanted. After the Avatar's encounter with Amon, Tenzin found her at Aang Memorial Island, where Korra finally admitted her fears, crying in his arms while he comforted her. He was also concerned when Korra was captured by Tarrlok and even threatened to attack him if he did not reveal where Korra was.",
      "links": [
        {
          "body": "pro-bending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending",
            "page": "Pro-bending"
          }
        },
        {
          "body": "Tarrlok's task force",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tarrlok%27s_task_force",
            "page": "Tarrlok%27s_task_force"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Allies",
        "Korra"
      ],
      "text": "Tenzin also plays the part of a father figure for Korra. He became protective over her when she moved to Republic City. For example, he almost sent out search parties to look for Korra when she did not return home while she was looking for Bolin. Furthermore, Tenzin prohibited her from watching pro-bending as she had come to the city to learn airbending. Although he eventually let her participate, Tenzin watched the final tournament, just to make sure Korra was safe. Tenzin also noticed Korra's fear of Amon and asked her about her real reason for refusing to join Tarrlok's task force, telling her that it is okay to be afraid sometimes. At her denial, he reassured her that she could tell him anything whenever she wanted. After the Avatar's encounter with Amon, Tenzin found her at Aang Memorial Island, where Korra finally admitted her fears, crying in his arms while he comforted her. He was also concerned when Korra was captured by Tarrlok and even threatened to attack him if he did not reveal where Korra was."
    },
    {
      "body": "Tenzin was concerned for Korra when she lost her bending to Amon. However, when Korra regained her powers and entered the Avatar State, he was incredibly proud of her and relieved that she had her bending back. When she restored Lin's bending, he addressed her as \"Avatar Korra\".",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Allies",
        "Korra"
      ],
      "text": "Tenzin was concerned for Korra when she lost her bending to Amon. However, when Korra regained her powers and entered the Avatar State, he was incredibly proud of her and relieved that she had her bending back. When she restored Lin's bending, he addressed her as \"Avatar Korra\"."
    },
    {
      "body": "Six months later, their relationship took a turn for the worse, due to Korra's impatience with her airbending training, and her learning that Tenzin was involved in the decision to keep her secluded at the Southern Water Tribe. Because of this and Tenzin's inability to handle a spirit attack, Korra took up her uncle Unalaq's offer to be her spiritual mentor. Tenzin, while hurt, declared it had been an honor serving her.",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Allies",
        "Korra"
      ],
      "text": "Six months later, their relationship took a turn for the worse, due to Korra's impatience with her airbending training, and her learning that Tenzin was involved in the decision to keep her secluded at the Southern Water Tribe. Because of this and Tenzin's inability to handle a spirit attack, Korra took up her uncle Unalaq's offer to be her spiritual mentor. Tenzin, while hurt, declared it had been an honor serving her."
    },
    {
      "body": "Later at the Eastern Air Temple, Tenzin received a surprise visit from Korra. Despite their shaky relation when they last met, Tenzin welcomed Korra back. After learning of Unalaq's ulterior motives, Korra blamed herself for causing a huge disaster. Tenzin told her not to blame herself and offered his services as the Avatar's spiritual mentor once more. However, after repeated failed attempts to guide Korra to the Spirit World in the Eastern Air Temple, he reluctantly resigned to Korra's wish to follow the dragonfly bunny spirits Jinora found, leading them to an ancient airbender meditation circle. After witnessing Korra's purification technique, Tenzin expressed shame at his inability to be of any true help to her. Korra was quick to refute his words, stating his undying loyalty, and apologized for \"turning [her] back on [him]\". Tenzin promised not to let her down, and the duo fixed their estranged relationship. When his final attempts to cross over failed, he eventually let Jinora take over, giving both of them his well wishes and encouragements.",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Allies",
        "Korra"
      ],
      "text": "Later at the Eastern Air Temple, Tenzin received a surprise visit from Korra. Despite their shaky relation when they last met, Tenzin welcomed Korra back. After learning of Unalaq's ulterior motives, Korra blamed herself for causing a huge disaster. Tenzin told her not to blame herself and offered his services as the Avatar's spiritual mentor once more. However, after repeated failed attempts to guide Korra to the Spirit World in the Eastern Air Temple, he reluctantly resigned to Korra's wish to follow the dragonfly bunny spirits Jinora found, leading them to an ancient airbender meditation circle. After witnessing Korra's purification technique, Tenzin expressed shame at his inability to be of any true help to her. Korra was quick to refute his words, stating his undying loyalty, and apologized for \"turning [her] back on [him]\". Tenzin promised not to let her down, and the duo fixed their estranged relationship. When his final attempts to cross over failed, he eventually let Jinora take over, giving both of them his well wishes and encouragements."
    },
    {
      "body": "During Harmonic Convergence, Tenzin found an unconscious Korra. Upon learning of the end of the Avatar Cycle, Tenzin attempted to console the distraught Korra, assuring her that not all hope is lost and imparted her with the knowledge of connecting with cosmic energies of the universe to stop Vaatu. When Korra's spirit returned to her body and the Avatar Cycle was recreated, Tenzin commended her, stating that \"[she was] amazing\".",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Allies",
        "Korra"
      ],
      "text": "During Harmonic Convergence, Tenzin found an unconscious Korra. Upon learning of the end of the Avatar Cycle, Tenzin attempted to console the distraught Korra, assuring her that not all hope is lost and imparted her with the knowledge of connecting with cosmic energies of the universe to stop Vaatu. When Korra's spirit returned to her body and the Avatar Cycle was recreated, Tenzin commended her, stating that \"[she was] amazing\"."
    },
    {
      "body": "Weeks later, Korra, banished from Republic City by ${link_0}, joined Tenzin on a journey to search for new airbenders whom had emerged following Harmonic Convergence. Upon realizing that ${link_1} ${link_2} was abducting airbenders into her army, Tenzin agreed with Korra's plan to bust them out. They were successful in doing so, and, after escaping Ba Sing Se, Tenzin assured Korra that she had done well before they embraced and parted ways.",
      "links": [
        {
          "body": "Raiko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Raiko",
            "page": "Raiko"
          }
        },
        {
          "body": "Earth Queen",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Hou-Ting",
            "page": "Hou-Ting"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Allies",
        "Korra"
      ],
      "text": "Weeks later, Korra, banished from Republic City by Raiko, joined Tenzin on a journey to search for new airbenders whom had emerged following Harmonic Convergence. Upon realizing that Earth Queen Hou-Ting was abducting airbenders into her army, Tenzin agreed with Korra's plan to bust them out. They were successful in doing so, and, after escaping Ba Sing Se, Tenzin assured Korra that she had done well before they embraced and parted ways."
    },
    {
      "body": "Korra later contacted Tenzin through the ${link_0} radio and offered him advice on how to inspire the unmotivated airbenders. Tenzin was impressed by Korra's counsel, promptly stating that she was becoming a wise Avatar.",
      "links": [
        {
          "body": "Northern Air Temple",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Allies",
        "Korra"
      ],
      "text": "Korra later contacted Tenzin through the Northern Air Temple radio and offered him advice on how to inspire the unmotivated airbenders. Tenzin was impressed by Korra's counsel, promptly stating that she was becoming a wise Avatar."
    },
    {
      "body": "Originally, Tenzin only knew Mako as Korra's pro-bending teammate, and due to his personal views against pro-bending, Tenzin did not interact much with Mako. However, as the Equalists began taking a more active approach against Republic City, Mako's budding relationship with Korra made the airbending master converse more with the firebender. Tenzin later even allowed him and his brother Bolin to live at Air Temple Island after losing their home at the Pro-bending Arena. When the Equalists captured Tenzin and his family, and Amon was about to strip Tenzin of his airbending, Mako directed a lightning strike at the stage and diverted the attention away from the airbenders while Korra freed them. Afterward, Tenzin sincerely thanked the young firebender. When Korra fell into depression over losing three of her bending abilities to Amon, Tenzin offered Mako some advice about how to approach Korra regarding his new feelings for the young Avatar. Despite not having a close relationship, they have fought alongside one another several times, combining their bending to form a more powerful offensive force against their enemies.",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Allies",
        "Mako"
      ],
      "text": "Originally, Tenzin only knew Mako as Korra's pro-bending teammate, and due to his personal views against pro-bending, Tenzin did not interact much with Mako. However, as the Equalists began taking a more active approach against Republic City, Mako's budding relationship with Korra made the airbending master converse more with the firebender. Tenzin later even allowed him and his brother Bolin to live at Air Temple Island after losing their home at the Pro-bending Arena. When the Equalists captured Tenzin and his family, and Amon was about to strip Tenzin of his airbending, Mako directed a lightning strike at the stage and diverted the attention away from the airbenders while Korra freed them. Afterward, Tenzin sincerely thanked the young firebender. When Korra fell into depression over losing three of her bending abilities to Amon, Tenzin offered Mako some advice about how to approach Korra regarding his new feelings for the young Avatar. Despite not having a close relationship, they have fought alongside one another several times, combining their bending to form a more powerful offensive force against their enemies."
    },
    {
      "body": "When Tenzin originally met the young airbender he was excited at finally having recruited a pupil before discovering from the local sheriff much to his disgust that ${link_0} was a thief and a liar. But his desperation to rebuild his culture won out and had the boy appointed as his ward rather than let him face jail time. Tenzin was wary from that point on of Kai's mischievous nature and tendency to run away but still believed Kai was his responsibility and deserved to stay with the group. Later upon Jinora's discovery of Kai's capture at the hands of the ${link_1}, Tenzin displayed an iron resolve to rescue the boy and his fellow airbending captives from the Earth Queen's prison, even putting a second team together to specifically rescue the lad, knowing he had been placed in solitary confinement. However, upon their arrival at the Northern Air Temple, Tenzin was shocked to hear ${link_2} describe Kai as Jinora's boyfriend. His irritation subsided, however, when he saw that Kai was trying to save Jinora from ${link_3} and helped the boy escape the ${link_4}'s vehicle before it was roughly halted by an adult bison. When Kai used his airbending to hurt Ganbat, Tenzin halted him, sternly telling him that an airbender never attacked a defenseless opponent, though complimented him nonetheless on his technique, showing concealed approval for his actions.",
      "links": [
        {
          "body": "Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kai",
            "page": "Kai"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Dai_Li",
            "page": "Dai_Li"
          }
        },
        {
          "body": "Yung",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Yung",
            "page": "Yung"
          }
        },
        {
          "body": "Ganbat",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ganbat",
            "page": "Ganbat"
          }
        },
        {
          "body": "bison rustler",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Bison_rustlers",
            "page": "Bison_rustlers"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Allies",
        "Kai"
      ],
      "text": "When Tenzin originally met the young airbender he was excited at finally having recruited a pupil before discovering from the local sheriff much to his disgust that Kai was a thief and a liar. But his desperation to rebuild his culture won out and had the boy appointed as his ward rather than let him face jail time. Tenzin was wary from that point on of Kai's mischievous nature and tendency to run away but still believed Kai was his responsibility and deserved to stay with the group. Later upon Jinora's discovery of Kai's capture at the hands of the Dai Li, Tenzin displayed an iron resolve to rescue the boy and his fellow airbending captives from the Earth Queen's prison, even putting a second team together to specifically rescue the lad, knowing he had been placed in solitary confinement. However, upon their arrival at the Northern Air Temple, Tenzin was shocked to hear Yung describe Kai as Jinora's boyfriend. His irritation subsided, however, when he saw that Kai was trying to save Jinora from Ganbat and helped the boy escape the bison rustler's vehicle before it was roughly halted by an adult bison. When Kai used his airbending to hurt Ganbat, Tenzin halted him, sternly telling him that an airbender never attacked a defenseless opponent, though complimented him nonetheless on his technique, showing concealed approval for his actions."
    },
    {
      "body": "Tenzin considered Amon a great threat to Republic City and was concerned about how the city would react to ${link_0}. Unlike Tarrlok, however, Tenzin did not favor any direct action against Amon, thinking it would escalate into a civil war between benders and nonbenders.",
      "links": [
        {
          "body": "his revolution",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Anti-bending_Revolution",
            "page": "Anti-bending_Revolution"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Enemies",
        "Amon"
      ],
      "text": "Tenzin considered Amon a great threat to Republic City and was concerned about how the city would react to his revolution. Unlike Tarrlok, however, Tenzin did not favor any direct action against Amon, thinking it would escalate into a civil war between benders and nonbenders."
    },
    {
      "body": "As a member of the United Republic Council, Tenzin took the ${link_0}' threat seriously, though he wished to see it handled to a point where balance was retained between benders and nonbenders. Tenzin first encountered the Equalists in the ${link_1} during their ${link_2}. He and Lin Beifong were attacked, both of them stunned by electrified gloves. Following the completion of their attack and subsequent escape, Tenzin declared that Republic City was at war with the Equalists. Days later, Tenzin, Lin, Korra, and members of the Metalbending Police Force ambushed the ${link_3} after receiving tips of a secret underground factory in operation. However, the Equalists planned everything out and ambushed the investigating party. Tenzin held his own for as long as he could, but like his associates, he was stunned by ${link_4} and left unconscious before they were rescued.",
      "links": [
        {
          "body": "Equalists",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "ambush",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Attack_on_the_Pro-bending_Arena",
            "page": "Attack_on_the_Pro-bending_Arena"
          }
        },
        {
          "body": "Sato estate",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Sato_estate",
            "page": "Sato_estate"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Enemies",
        "Equalists"
      ],
      "text": "As a member of the United Republic Council, Tenzin took the Equalists' threat seriously, though he wished to see it handled to a point where balance was retained between benders and nonbenders. Tenzin first encountered the Equalists in the Pro-bending Arena during their ambush. He and Lin Beifong were attacked, both of them stunned by electrified gloves. Following the completion of their attack and subsequent escape, Tenzin declared that Republic City was at war with the Equalists. Days later, Tenzin, Lin, Korra, and members of the Metalbending Police Force ambushed the Sato estate after receiving tips of a secret underground factory in operation. However, the Equalists planned everything out and ambushed the investigating party. Tenzin held his own for as long as he could, but like his associates, he was stunned by Hiroshi Sato and left unconscious before they were rescued."
    },
    {
      "body": "Before knowing Hiroshi Sato's real personality, Tenzin never suspected that he could be an Equalist sympathizer. When Korra told him and Lin Beifong about the phone conversation she had overheard Sato having, he concurred with Lin that he had the means and a motive to be allied with the Equalists. After getting a tip about Hiroshi's involvement with the revolutionary group, he accompanied Korra, Lin, and several ${link_0} during the raid of the ${link_1} beneath ${link_2}, where they were ambushed by the industrialist and some Equalists.",
      "links": [
        {
          "body": "metalbending officers",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_Police#Metalbending_Police_Force",
            "page": "Republic_City_Police"
          }
        },
        {
          "body": "secret factory",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Equalist_factory",
            "page": "Equalist_factory"
          }
        },
        {
          "body": "Sato's mansion",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Sato_estate",
            "page": "Sato_estate"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Enemies",
        "Hiroshi Sato"
      ],
      "text": "Before knowing Hiroshi Sato's real personality, Tenzin never suspected that he could be an Equalist sympathizer. When Korra told him and Lin Beifong about the phone conversation she had overheard Sato having, he concurred with Lin that he had the means and a motive to be allied with the Equalists. After getting a tip about Hiroshi's involvement with the revolutionary group, he accompanied Korra, Lin, and several metalbending officers during the raid of the secret factory beneath Sato's mansion, where they were ambushed by the industrialist and some Equalists."
    },
    {
      "body": "Team Avatar initially arrived in Ba Sing Se to ask the Earth Queen for her help in finding new airbenders. However, after Korra completed a task for her, the Earth Queen blatantly said that there were no airbenders in Ba Sing Se, angering the group. Upon learning Her Majesty was conscripting airbenders into a secret army, Tenzin was shocked and could not believe the Earth Queen was capable of such an act. That night, Team Avatar and the newly-arrived Lin Beifong used the cover of night to sneak into the Queen's secret military compound. Tenzin, Korra, and Bumi split off from the others to rescue the airbenders, and after doing so, repelled the Dai Li and escaped on Oogi.",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Enemies",
        "Hou-Ting"
      ],
      "text": "Team Avatar initially arrived in Ba Sing Se to ask the Earth Queen for her help in finding new airbenders. However, after Korra completed a task for her, the Earth Queen blatantly said that there were no airbenders in Ba Sing Se, angering the group. Upon learning Her Majesty was conscripting airbenders into a secret army, Tenzin was shocked and could not believe the Earth Queen was capable of such an act. That night, Team Avatar and the newly-arrived Lin Beifong used the cover of night to sneak into the Queen's secret military compound. Tenzin, Korra, and Bumi split off from the others to rescue the airbenders, and after doing so, repelled the Dai Li and escaped on Oogi."
    },
    {
      "body": "Tenzin and Tarrlok served together on the United Republic Council until the latter's secret past and abilities were exposed. They had a contentious relationship and a long-standing rivalry, almost always disagreeing in every council meeting. When Tarrlok went to Air Temple Island in an attempt to recruit Korra into his task force, Tenzin was hostile toward him and only reluctantly allowed him to stay. Tenzin and Tarrlok briefly agreed when they both decided to shut down the Pro-bending Arena. However, Tarrlok recanted after Lin Beifong intervened.",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Enemies",
        "Tarrlok"
      ],
      "text": "Tenzin and Tarrlok served together on the United Republic Council until the latter's secret past and abilities were exposed. They had a contentious relationship and a long-standing rivalry, almost always disagreeing in every council meeting. When Tarrlok went to Air Temple Island in an attempt to recruit Korra into his task force, Tenzin was hostile toward him and only reluctantly allowed him to stay. Tenzin and Tarrlok briefly agreed when they both decided to shut down the Pro-bending Arena. However, Tarrlok recanted after Lin Beifong intervened."
    },
    {
      "body": "Later, Tarrlok kidnapped Korra, using the art of bloodbending. After finding the Equalist headquarters, Tenzin realized that Tarrlok must have been the one who had kidnapped Korra. He chased down Tarrlok, and found him at the ${link_0}. There, the ${link_1} informed him, Lin, the Council, and the rest of ${link_2} that Tarrlok was a bloodbender. Upon this revelation, Tarrlok used bloodbending to knock out Tenzin as well as the others, and fled the scene.",
      "links": [
        {
          "body": "City Hall",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/City_Hall",
            "page": "City_Hall"
          }
        },
        {
          "body": "Council page",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Council_page",
            "page": "Council_page"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Enemies",
        "Tarrlok"
      ],
      "text": "Later, Tarrlok kidnapped Korra, using the art of bloodbending. After finding the Equalist headquarters, Tenzin realized that Tarrlok must have been the one who had kidnapped Korra. He chased down Tarrlok, and found him at the City Hall. There, the Council page informed him, Lin, the Council, and the rest of Team Avatar that Tarrlok was a bloodbender. Upon this revelation, Tarrlok used bloodbending to knock out Tenzin as well as the others, and fled the scene."
    },
    {
      "body": "Unaware of their true identity, Tenzin first encountered the Red Lotus organization in 158 AG when ${link_0}, ${link_1}, ${link_2}, and ${link_3} attempted to kidnap the five-year-old Korra. Tenzin helped Fire Lord Zuko, Chief Sokka, and Tonraq fight them off and imprisoned them in specially constructed prisons on secret locations. He grew alarmed upon being notified thirteen years later that the four had escaped their confinement and that Zaheer had gained airbending abilities.",
      "links": [
        {
          "body": "Zaheer",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/P%27Li",
            "page": "P%27Li"
          }
        },
        {
          "body": "Ming-Hua",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ming-Hua",
            "page": "Ming-Hua"
          }
        },
        {
          "body": "Ghazan",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Ghazan",
            "page": "Ghazan"
          }
        }
      ],
      "section": [
        "Tenzin's relationships",
        "Enemies",
        "Red Lotus"
      ],
      "text": "Unaware of their true identity, Tenzin first encountered the Red Lotus organization in 158 AG when Zaheer, P'Li, Ming-Hua, and Ghazan attempted to kidnap the five-year-old Korra. Tenzin helped Fire Lord Zuko, Chief Sokka, and Tonraq fight them off and imprisoned them in specially constructed prisons on secret locations. He grew alarmed upon being notified thirteen years later that the four had escaped their confinement and that Zaheer had gained airbending abilities."
    },
    {
      "body": "When the Red Lotus managed to capture all the inhabitants of the reborn Air Nation at the Northern Air Temple, Tenzin faced off against Zaheer once more, determined to buy everyone enough time to escape. Although he was on the winning hand in his duel against Zaheer, he was overpowered when the other three Red Lotus members joined the fight. Although severely wounded and outnumbered, he refused to surrender to them and vowed that he would keep fighting to protect the Avatar and those whom he loved.",
      "links": [],
      "section": [
        "Tenzin's relationships",
        "Enemies",
        "Red Lotus"
      ],
      "text": "When the Red Lotus managed to capture all the inhabitants of the reborn Air Nation at the Northern Air Temple, Tenzin faced off against Zaheer once more, determined to buy everyone enough time to escape. Although he was on the winning hand in his duel against Zaheer, he was overpowered when the other three Red Lotus members joined the fight. Although severely wounded and outnumbered, he refused to surrender to them and vowed that he would keep fighting to protect the Avatar and those whom he loved."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Tenzin%27s_relationships",
    "file": "avatar.wikia.com/wiki/Tenzin's_relationships.html",
    "page": "Tenzin's_relationships",
    "title": "Tenzin's relationships"
  }
}