{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Books",
      "target": {
        "href": "Category_Books",
        "page": "Category_Books"
      }
    },
    {
      "body": "Print publications",
      "target": {
        "href": "Category_Print_publications",
        "page": "Category_Print_publications"
      }
    },
    {
      "body": "Real world",
      "target": {
        "href": "Category_Real_world",
        "page": "Category_Real_world"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The Earth Kingdom Chronicles is a series of six books based on ${link_0}, the second season of ${link_1}. These books go inside the thoughts of the characters during the events of Book Two.",
      "links": [
        {
          "body": "Book Two: Earth",
          "key": "${link_0}",
          "target": {
            "href": "Book_Two__Earth",
            "page": "Book_Two__Earth"
          }
        },
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_1}",
          "target": {
            "href": "Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        }
      ],
      "text": "The Earth Kingdom Chronicles is a series of six books based on Book Two: Earth, the second season of Avatar: The Last Airbender. These books go inside the thoughts of the characters during the events of Book Two."
    },
    {
      "body": "This book is a ninety-six page diary of the events of Book Two from Aang's perspective. The book was written by Michael Teitelbaum.",
      "links": [],
      "text": "This book is a ninety-six page diary of the events of Book Two from Aang's perspective. The book was written by Michael Teitelbaum."
    },
    {
      "body": "\"I'm ${link_0} — and this is the tale of my journey through the ${link_1}. I traveled there with my friends ${link_2} and ${link_3} to find an ${link_4} teacher. I'm not sure why, but we ran into trouble almost everywhere we went. We got chased by Prince Zuko's sister, ${link_5}, and got caught in a sinking ${link_6}. Did I mention that Appa got kidnapped by ${link_7}? There were definitely some scary moments ... but I can't complain about getting stuck in the ${link_8} with Katara! All in a day's work for the ${link_9}, right?\"",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_3}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_4}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Azula",
          "key": "${link_5}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "library",
          "key": "${link_6}",
          "target": {
            "href": "Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "sandbenders",
          "key": "${link_7}",
          "target": {
            "href": "Sandbender_Tribes",
            "page": "Sandbender_Tribes"
          }
        },
        {
          "body": "Cave of Two Lovers",
          "key": "${link_8}",
          "target": {
            "href": "Cave_of_Two_Lovers",
            "page": "Cave_of_Two_Lovers"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_9}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "\"I'm Aang — and this is the tale of my journey through the Earth Kingdom. I traveled there with my friends Katara and Sokka to find an earthbending teacher. I'm not sure why, but we ran into trouble almost everywhere we went. We got chased by Prince Zuko's sister, Azula, and got caught in a sinking library. Did I mention that Appa got kidnapped by sandbenders? There were definitely some scary moments ... but I can't complain about getting stuck in the Cave of Two Lovers with Katara! All in a day's work for the Avatar, right?\""
    },
    {
      "body": "May 8, 2007",
      "links": [],
      "text": "May 8, 2007"
    },
    {
      "body": "This book is a ninety-six page diary of the events of Book Two from Azula's perspective. The book was written by Michael Teitelbaum.",
      "links": [],
      "text": "This book is a ninety-six page diary of the events of Book Two from Azula's perspective. The book was written by Michael Teitelbaum."
    },
    {
      "body": "\"I am ${link_0}, daughter of ${link_1} ${link_2}, and I plan to one day rule the ${link_3} — and the world. But first I have to deal with my good-for-nothing brother, Prince Zuko. Well, he was good for nothing, until he led me to the Avatar! I headed to the Earth Kingdom, where, with the help of ${link_4} and ${link_5}, we tracked down the Avatar and his ragtag band. I engaged in a fierce battle with the Avatar himself! I lost that fight, but he should be forewarned: He has not seen the last of Princess Azula.\"",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_2}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Mai",
          "key": "${link_4}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_5}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "text": "\"I am Azula, daughter of Fire Lord Ozai, and I plan to one day rule the Fire Nation — and the world. But first I have to deal with my good-for-nothing brother, Prince Zuko. Well, he was good for nothing, until he led me to the Avatar! I headed to the Earth Kingdom, where, with the help of Mai and Ty Lee, we tracked down the Avatar and his ragtag band. I engaged in a fierce battle with the Avatar himself! I lost that fight, but he should be forewarned: He has not seen the last of Princess Azula.\""
    },
    {
      "body": "June 26, 2007",
      "links": [],
      "text": "June 26, 2007"
    },
    {
      "body": "This book is a ninety-six page diary of the events of Book Two from Toph's perspective. The book was written by Michael Teitelbaum.",
      "links": [],
      "text": "This book is a ninety-six page diary of the events of Book Two from Toph's perspective. The book was written by Michael Teitelbaum."
    },
    {
      "body": "\"I'm ${link_0}. After ${link_1} found out that I'd been competing in ${link_2} tournaments, he threatened to put me under constant surveillance! So I left home. Now I'm traveling through the Earth Kingdom with Aang - he's the Avatar - and his friends Katara and Sokka, on Aang's ${link_3}, ${link_4}. I'm teaching earthbending to Aang, and man, do I have my work cut out for me! Even though we've had our differences, it's kind of nice knowing these guys will always have my back and point me in the right direction when I can't feel which way to go.\"",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "my father",
          "key": "${link_1}",
          "target": {
            "href": "Lao_Beifong",
            "page": "Lao_Beifong"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "sky bison",
          "key": "${link_3}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "Appa",
          "key": "${link_4}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "\"I'm Toph. After my father found out that I'd been competing in earthbending tournaments, he threatened to put me under constant surveillance! So I left home. Now I'm traveling through the Earth Kingdom with Aang - he's the Avatar - and his friends Katara and Sokka, on Aang's sky bison, Appa. I'm teaching earthbending to Aang, and man, do I have my work cut out for me! Even though we've had our differences, it's kind of nice knowing these guys will always have my back and point me in the right direction when I can't feel which way to go.\""
    },
    {
      "body": "October 23, 2007",
      "links": [],
      "text": "October 23, 2007"
    },
    {
      "body": "This book is a ninety-six page diary of the events of Book Two from Sokka's perspective. The book was written by Michael Teitelbaum.",
      "links": [],
      "text": "This book is a ninety-six page diary of the events of Book Two from Sokka's perspective. The book was written by Michael Teitelbaum."
    },
    {
      "body": "\"I am Sokka of the ${link_0}, and I'm the \"plan guy\" for ${link_1}! Even though I am not a bender, I'm still an awesome fighter with my trusty ${link_2}. The Avatar and my sister Katara are depending on me to get them safely through the Earth Kingdom, and it has not been easy. I've had to deal with fierce ${link_3}, an evil Fire Nation princess, and an ${link_4} who refuses to acknowledge that there is a ${link_5} going on! Still, I'm giving it my best shot. After all, the fate of the world is in our hands.\"",
      "links": [
        {
          "body": "Southern Water Tribe",
          "key": "${link_0}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "boomerang",
          "key": "${link_2}",
          "target": {
            "href": "Sokka%27s_weapons#Boomerang",
            "page": "Sokka%27s_weapons"
          }
        },
        {
          "body": "badger-moles",
          "key": "${link_3}",
          "target": {
            "href": "Badgermole",
            "page": "Badgermole"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_4}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "war",
          "key": "${link_5}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "\"I am Sokka of the Southern Water Tribe, and I'm the \"plan guy\" for Team Avatar! Even though I am not a bender, I'm still an awesome fighter with my trusty boomerang. The Avatar and my sister Katara are depending on me to get them safely through the Earth Kingdom, and it has not been easy. I've had to deal with fierce badger-moles, an evil Fire Nation princess, and an Earth King who refuses to acknowledge that there is a war going on! Still, I'm giving it my best shot. After all, the fate of the world is in our hands.\""
    },
    {
      "body": "November 27, 2007",
      "links": [],
      "text": "November 27, 2007"
    },
    {
      "body": "This book is a ninety-six page diary of the events of Book Two from Zuko's perspective. The book was written by Michael Teitelbaum.",
      "links": [],
      "text": "This book is a ninety-six page diary of the events of Book Two from Zuko's perspective. The book was written by Michael Teitelbaum."
    },
    {
      "body": "\"I am ${link_0} ${link_1}. After being betrayed by my wicked sister, Azula, Uncle ${link_2} and I have sought new lives in the Earth Kingdom. It is humbling to wander as a refugee, but it has also opened my eyes to the pain the Fire Nation has inflicted on the world — as well as on me. On one hand I am proud to be a prince of the Fire Nation, but on the other hand I feel very ashamed. What is my destiny? Is it to turn my back on the Fire Nation and start anew, or is it to restore my honor and earn back my rightful place as the future Fire Lord? I have yet to find out.\"",
      "links": [
        {
          "body": "Prince",
          "key": "${link_0}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_2}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "\"I am Prince Zuko. After being betrayed by my wicked sister, Azula, Uncle Iroh and I have sought new lives in the Earth Kingdom. It is humbling to wander as a refugee, but it has also opened my eyes to the pain the Fire Nation has inflicted on the world — as well as on me. On one hand I am proud to be a prince of the Fire Nation, but on the other hand I feel very ashamed. What is my destiny? Is it to turn my back on the Fire Nation and start anew, or is it to restore my honor and earn back my rightful place as the future Fire Lord? I have yet to find out.\""
    },
    {
      "body": "February 5, 2008",
      "links": [],
      "text": "February 5, 2008"
    },
    {
      "body": "This book is a ninety-six page diary of the events of Book Two from Katara's perspective. The book was written by Michael Teitelbaum.",
      "links": [],
      "text": "This book is a ninety-six page diary of the events of Book Two from Katara's perspective. The book was written by Michael Teitelbaum."
    },
    {
      "body": "\"I'm ${link_0}. I'm traveling through the Earth Kingdom with my brother, Sokka, and Aang, the Avatar. After Aang and I studied ${link_1} at the ${link_2}, we set off to find him an earthbending teacher. The journey has been kind of rough on all of us. I'm having trouble getting along with Aang's new earthbending teacher, Toph; Aang's struggling with his earthbending lessons; and we're being chased not only by Prince Zuko, but his sister, Princess Azula, too! But I know we'll make it through this, as long as we all stick together!\"",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_1}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "North Pole",
          "key": "${link_2}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        }
      ],
      "text": "\"I'm Katara. I'm traveling through the Earth Kingdom with my brother, Sokka, and Aang, the Avatar. After Aang and I studied waterbending at the North Pole, we set off to find him an earthbending teacher. The journey has been kind of rough on all of us. I'm having trouble getting along with Aang's new earthbending teacher, Toph; Aang's struggling with his earthbending lessons; and we're being chased not only by Prince Zuko, but his sister, Princess Azula, too! But I know we'll make it through this, as long as we all stick together!\""
    },
    {
      "body": "April 8, 2008",
      "links": [],
      "text": "April 8, 2008"
    },
    {
      "body": "In this collection of four books, Aang, Azula, Toph, and Sokka tell about their exciting and eye-opening journeys through the Earth Kingdom. This is a collection of the first four books in the series.",
      "links": [],
      "text": "In this collection of four books, Aang, Azula, Toph, and Sokka tell about their exciting and eye-opening journeys through the Earth Kingdom. This is a collection of the first four books in the series."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/The_Earth_Kingdom_Chronicles",
    "file": "avatar.wikia.com/wiki/The_Earth_Kingdom_Chronicles.html",
    "page": "The_Earth_Kingdom_Chronicles",
    "title": "The Earth Kingdom Chronicles"
  }
}