{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Real world",
      "target": {
        "href": "Category_Real_world",
        "page": "Category_Real_world"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The soundtrack's cover features a special design of ${link_0} ${link_1}.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "The soundtrack's cover features a special design of Avatar Korra."
    },
    {
      "body": "The Legend of Korra: Original Music From Book One is a soundtrack that includes much of the music composed by ${link_0} and mixed by ${link_1} for ${link_2} of ${link_3}. Released digitally and in stores on July 16, 2013, by ${link_4} and Sony Music Entertainment's Legacy Recordings, Original Music From Book One features twenty-six instrumental tracks from the series.",
      "links": [
        {
          "body": "Jeremy Zuckerman",
          "key": "${link_0}",
          "target": {
            "href": "Jeremy_Zuckerman",
            "page": "Jeremy_Zuckerman"
          }
        },
        {
          "body": "Benjamin Wynn",
          "key": "${link_1}",
          "target": {
            "href": "Benjamin_Wynn",
            "page": "Benjamin_Wynn"
          }
        },
        {
          "body": "Book One",
          "key": "${link_2}",
          "target": {
            "href": "Book_One__Air",
            "page": "Book_One__Air"
          }
        },
        {
          "body": "The Legend of Korra",
          "key": "${link_3}",
          "target": {
            "href": "The_Legend_of_Korra",
            "page": "The_Legend_of_Korra"
          }
        },
        {
          "body": "Nickelodeon",
          "key": "${link_4}",
          "target": {
            "href": "Nickelodeon",
            "page": "Nickelodeon"
          }
        }
      ],
      "text": "The Legend of Korra: Original Music From Book One is a soundtrack that includes much of the music composed by Jeremy Zuckerman and mixed by Benjamin Wynn for Book One of The Legend of Korra. Released digitally and in stores on July 16, 2013, by Nickelodeon and Sony Music Entertainment's Legacy Recordings, Original Music From Book One features twenty-six instrumental tracks from the series."
    },
    {
      "body": "For nine years, ${link_0} and ${link_1} had struggled to create a soundtrack for ${link_2} and The Legend of Korra, a \"bureaucratic impasse\" having kept them from reaching this goal despite numerous online petitions with thousands of signatures for the release of an Avatar soundtrack. Cooperation with Nickelodeon as well as with people outside of the company resulted in plans for the first-ever Avatar soundtrack, The Legend of Korra: Original Music From Book One, with most or all of the tracks having already been produced and recorded for use in the series.",
      "links": [
        {
          "body": "Michael Dante DiMartino",
          "key": "${link_0}",
          "target": {
            "href": "Michael_Dante_DiMartino",
            "page": "Michael_Dante_DiMartino"
          }
        },
        {
          "body": "Bryan Konietzko",
          "key": "${link_1}",
          "target": {
            "href": "Bryan_Konietzko",
            "page": "Bryan_Konietzko"
          }
        },
        {
          "body": "Avatar: The Last Airbender",
          "key": "${link_2}",
          "target": {
            "href": "Avatar__The_Last_Airbender",
            "page": "Avatar__The_Last_Airbender"
          }
        }
      ],
      "text": "For nine years, Michael Dante DiMartino and Bryan Konietzko had struggled to create a soundtrack for Avatar: The Last Airbender and The Legend of Korra, a \"bureaucratic impasse\" having kept them from reaching this goal despite numerous online petitions with thousands of signatures for the release of an Avatar soundtrack. Cooperation with Nickelodeon as well as with people outside of the company resulted in plans for the first-ever Avatar soundtrack, The Legend of Korra: Original Music From Book One, with most or all of the tracks having already been produced and recorded for use in the series."
    },
    {
      "body": "The soundtrack has been described as jazz, but as if it were stylized in 1920s-era China. Its tone has been described as being more mature and unique from the ${link_0}. ${link_1} wanted a more in-depth exploration of instruments and as a result, the music is a little more sparse in the number of instruments playing at once. The new soundtrack takes advantage of Eastern and Western live instruments, digital sound design, and Chinese instrumentalist ${link_2}, who is proficient in over twenty ethnic instruments.",
      "links": [
        {
          "body": "soundtrack of Avatar: The Last Airbender",
          "key": "${link_0}",
          "target": {
            "href": "Soundtrack_of_Avatar__The_Last_Airbender",
            "page": "Soundtrack_of_Avatar__The_Last_Airbender"
          }
        },
        {
          "body": "The Track Team",
          "key": "${link_1}",
          "target": {
            "href": "The_Track_Team",
            "page": "The_Track_Team"
          }
        },
        {
          "body": "Wang Hong",
          "key": "${link_2}",
          "target": {
            "href": "Wang_Hong",
            "page": "Wang_Hong"
          }
        }
      ],
      "text": "The soundtrack has been described as jazz, but as if it were stylized in 1920s-era China. Its tone has been described as being more mature and unique from the soundtrack of Avatar: The Last Airbender. The Track Team wanted a more in-depth exploration of instruments and as a result, the music is a little more sparse in the number of instruments playing at once. The new soundtrack takes advantage of Eastern and Western live instruments, digital sound design, and Chinese instrumentalist Wang Hong, who is proficient in over twenty ethnic instruments."
    },
    {
      "body": "There are twenty-six tracks on The Legend of Korra: Original Music From Book One, all of which were composed by Jeremy Zuckerman of The Track Team.",
      "links": [],
      "text": "There are twenty-six tracks on The Legend of Korra: Original Music From Book One, all of which were composed by Jeremy Zuckerman of The Track Team."
    },
    {
      "body": "The following is the episode(s) and scene(s) in the show where each track takes place. These were obtained by analyzing the show and music within each chapter of ${link_0}.",
      "links": [
        {
          "body": "Book One: Air",
          "key": "${link_0}",
          "target": {
            "href": "Book_One__Air",
            "page": "Book_One__Air"
          }
        }
      ],
      "text": "The following is the episode(s) and scene(s) in the show where each track takes place. These were obtained by analyzing the show and music within each chapter of Book One: Air."
    },
    {
      "body": "July 16, 2013 saw an overwhelmingly successful release for Original Music From Book One, taking the number one spot on Amazon's soundtrack bestseller list and the number five spot on the pop music charts.",
      "links": [],
      "text": "July 16, 2013 saw an overwhelmingly successful release for Original Music From Book One, taking the number one spot on Amazon's soundtrack bestseller list and the number five spot on the pop music charts."
    },
    {
      "body": "The Legend of Korra: Original Music From Book One received mostly positive reviews from critics. AllMusic.com called it a \"fascinating listen, even without the story line,\" citing the unique mix of predominantly Asian instruments and other sound effects as a highlight of the album.",
      "links": [],
      "text": "The Legend of Korra: Original Music From Book One received mostly positive reviews from critics. AllMusic.com called it a \"fascinating listen, even without the story line,\" citing the unique mix of predominantly Asian instruments and other sound effects as a highlight of the album."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/The_Legend_of_Korra:_Original_Music_From_Book_One",
    "file": "avatar.wikia.com/wiki/The_Legend_of_Korra__Original_Music_From_Book_One.html",
    "page": "The_Legend_of_Korra__Original_Music_From_Book_One",
    "title": "The Legend of Korra: Original Music From Book One"
  }
}