{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Toph Beifong",
      "target": {
        "href": "Category_Toph_Beifong",
        "page": "Category_Toph_Beifong"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "href": "Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Toph's independent and adventurous personality led to her gaining many friends.",
      "links": [
        {
          "body": "Toph Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "This page is comprised of Toph Beifong's relationships with other characters in the World of Avatar. Toph's independent and adventurous personality led to her gaining many friends."
    },
    {
      "body": "Twenty years after the conclusion of the ${link_0}, Toph gave birth to a daughter, ${link_1}, who inherited her ${link_2} abilities and also similarly mastered the sub-skills of ${link_3} and ${link_4}, although Toph felt that Lin never quite mastered all the key elements to these skills. The two share similar personalities, as they can both be blunt and stubborn on occasion; Toph was referred to by Korra as being a \"cranky, more miserable version of Lin\", and Toph proudly affirmed herself as being \"the original Beifong\".",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Lin",
          "key": "${link_1}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_2}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "metalbending",
          "key": "${link_3}",
          "target": {
            "href": "Metalbending",
            "page": "Metalbending"
          }
        },
        {
          "body": "seismic sense",
          "key": "${link_4}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        }
      ],
      "text": "Twenty years after the conclusion of the Hundred Year War, Toph gave birth to a daughter, Lin, who inherited her earthbending abilities and also similarly mastered the sub-skills of metalbending and seismic sense, although Toph felt that Lin never quite mastered all the key elements to these skills. The two share similar personalities, as they can both be blunt and stubborn on occasion; Toph was referred to by Korra as being a \"cranky, more miserable version of Lin\", and Toph proudly affirmed herself as being \"the original Beifong\"."
    },
    {
      "body": "After twenty years of no contact, ${link_0} and ${link_1} found a common ground and reconciled.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Lin",
          "key": "${link_1}",
          "target": {
            "href": "Lin_Beifong",
            "page": "Lin_Beifong"
          }
        }
      ],
      "text": "After twenty years of no contact, Toph and Lin found a common ground and reconciled."
    },
    {
      "body": "Despite her good intentions as a single mother, Toph refused to discuss Lin's father with her, which weighed heavily on her daughter. Despite this, Lin continued to have respect for her mother as the Chief of Police, as she was angry at Suyin being the cause of Toph's premature retirement. Their relationship became strained and by 154 ${link_0}, they had ceased communicating with each other.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "Despite her good intentions as a single mother, Toph refused to discuss Lin's father with her, which weighed heavily on her daughter. Despite this, Lin continued to have respect for her mother as the Chief of Police, as she was angry at Suyin being the cause of Toph's premature retirement. Their relationship became strained and by 154 AG, they had ceased communicating with each other."
    },
    {
      "body": "When they reunited by chance in 174 AG to save a captured Suyin and her family, Toph acted casual with her daughter, inadvertently working on her nerves. Lin finally unloaded on Toph after Bolin received an answer to the question who her father was, blaming Toph for never knowing or caring why she infuriated her. As Lin stated she wanted nothing more to do with her after saving their family, Toph solemnly accepted the words, stating that she would agree to it if that was what Lin desired. Later, after successfully having saved everyone, Lin apologized for her harsh words, to which Toph admitted she had not been the best mother, though was nonetheless proud of how she had ended up with the great daughters. Saying that it was enough for her to know that Lin did not hate her, Lin accepted her words and shared a small hug.",
      "links": [],
      "text": "When they reunited by chance in 174 AG to save a captured Suyin and her family, Toph acted casual with her daughter, inadvertently working on her nerves. Lin finally unloaded on Toph after Bolin received an answer to the question who her father was, blaming Toph for never knowing or caring why she infuriated her. As Lin stated she wanted nothing more to do with her after saving their family, Toph solemnly accepted the words, stating that she would agree to it if that was what Lin desired. Later, after successfully having saved everyone, Lin apologized for her harsh words, to which Toph admitted she had not been the best mother, though was nonetheless proud of how she had ended up with the great daughters. Saying that it was enough for her to know that Lin did not hate her, Lin accepted her words and shared a small hug."
    },
    {
      "body": "${link_0} voluntarily came to ${link_1}'s rescue when she was captured by ${link_2} and warmly hugged her back upon her release.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Suyin",
          "key": "${link_1}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_2}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        }
      ],
      "text": "Toph voluntarily came to Suyin's rescue when she was captured by Kuvira and warmly hugged her back upon her release."
    },
    {
      "body": "In 126 AG, Toph had her second daughter, ${link_0}, with another man. Suyin also inherited earthbending and mastery of the sub-skill of metalbending, although Toph felt that Suyin never quite mastered all the key elements of these skills. Toph gave her and her sister the freedom that she did not have while growing up, but when Suyin got arrested by Lin for being the wheelman for the ${link_1}, Toph tore up the report and sent her second daughter to live with her grandparents. A year later, Toph retired, while Suyin went on to build the city of Zaofu. They both reconciled from the incident and Toph would often visit before she went off in search of enlightenment.",
      "links": [
        {
          "body": "Suyin",
          "key": "${link_0}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "Terra Triad",
          "key": "${link_1}",
          "target": {
            "href": "Terra_Triad",
            "page": "Terra_Triad"
          }
        }
      ],
      "text": "In 126 AG, Toph had her second daughter, Suyin, with another man. Suyin also inherited earthbending and mastery of the sub-skill of metalbending, although Toph felt that Suyin never quite mastered all the key elements of these skills. Toph gave her and her sister the freedom that she did not have while growing up, but when Suyin got arrested by Lin for being the wheelman for the Terra Triad, Toph tore up the report and sent her second daughter to live with her grandparents. A year later, Toph retired, while Suyin went on to build the city of Zaofu. They both reconciled from the incident and Toph would often visit before she went off in search of enlightenment."
    },
    {
      "body": "While residing in the ${link_0}, Toph kept an eye on Zaofu and after learning that Suyin and her family were taken prisoner by ${link_1} in 174 AG, Toph traveled toward the metal city in order to rescue them. Upon being reunited with her youngest daughter, Toph let herself be hugged and readily returned the embrace. After successfully escaping the ${link_2}, Toph noted how proud she was to have such great daughters as Suyin and Lin.",
      "links": [
        {
          "body": "Foggy Swamp",
          "key": "${link_0}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_1}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "prison",
          "key": "${link_2}",
          "target": {
            "href": "Earth_Empire_factory",
            "page": "Earth_Empire_factory"
          }
        }
      ],
      "text": "While residing in the Foggy Swamp, Toph kept an eye on Zaofu and after learning that Suyin and her family were taken prisoner by Kuvira in 174 AG, Toph traveled toward the metal city in order to rescue them. Upon being reunited with her youngest daughter, Toph let herself be hugged and readily returned the embrace. After successfully escaping the prison, Toph noted how proud she was to have such great daughters as Suyin and Lin."
    },
    {
      "body": "${link_0} was fond to see her only granddaughter, ${link_1}, again.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Opal",
          "key": "${link_1}",
          "target": {
            "href": "Opal",
            "page": "Opal"
          }
        }
      ],
      "text": "Toph was fond to see her only granddaughter, Opal, again."
    },
    {
      "body": "While not often openly kind, Toph showed a warmness toward her only granddaughter. During her visits to Zaofu, Toph would often tell her tales from her past. In 174 AG, when Toph went to rescue her family, Opal rushed to hug her, an action Toph did not resist, although she cut it short and moved to hold Opal's hands instead. Appraising her granddaughter, she fondly noted how much she had grown, though questioned her judgment when learning that ${link_0} was her ${link_1} and ${link_2} her boyfriend.",
      "links": [
        {
          "body": "Juicy",
          "key": "${link_0}",
          "target": {
            "href": "Juicy",
            "page": "Juicy"
          }
        },
        {
          "body": "flying bison",
          "key": "${link_1}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_2}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        }
      ],
      "text": "While not often openly kind, Toph showed a warmness toward her only granddaughter. During her visits to Zaofu, Toph would often tell her tales from her past. In 174 AG, when Toph went to rescue her family, Opal rushed to hug her, an action Toph did not resist, although she cut it short and moved to hold Opal's hands instead. Appraising her granddaughter, she fondly noted how much she had grown, though questioned her judgment when learning that Juicy was her flying bison and Bolin her boyfriend."
    },
    {
      "body": "${link_0} and her parents.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Toph and her parents."
    },
    {
      "body": "Toph had a complicated, love-hate relationship with her parents, ${link_0} and ${link_1}. Being that their daughter was blind, her parents viewed her as helpless and fragile and therefore were extremely over-protective of her. Toph was restricted inside her family's house and guarded at all times. As a result, she never had any contact with her peers and never managed to form any real friendships. In fact, they kept her under such close guard that many people in her own ${link_2} were not even aware of her existence. Toph resented her parents for their treatment of her and as such, would often run away from home.",
      "links": [
        {
          "body": "Lao",
          "key": "${link_0}",
          "target": {
            "href": "Lao_Beifong",
            "page": "Lao_Beifong"
          }
        },
        {
          "body": "Poppy Beifong",
          "key": "${link_1}",
          "target": {
            "href": "Poppy_Beifong",
            "page": "Poppy_Beifong"
          }
        },
        {
          "body": "village",
          "key": "${link_2}",
          "target": {
            "href": "Gaoling",
            "page": "Gaoling"
          }
        }
      ],
      "text": "Toph had a complicated, love-hate relationship with her parents, Lao and Poppy Beifong. Being that their daughter was blind, her parents viewed her as helpless and fragile and therefore were extremely over-protective of her. Toph was restricted inside her family's house and guarded at all times. As a result, she never had any contact with her peers and never managed to form any real friendships. In fact, they kept her under such close guard that many people in her own village were not even aware of her existence. Toph resented her parents for their treatment of her and as such, would often run away from home."
    },
    {
      "body": "The relationship between Toph and her parents changed after she met the ${link_0}. After using an impressive display of earthbending to free ${link_1} from ${link_2} and his fighters, she confronted her father who had seen the whole thing. She pleaded with her parents for them to see her for herself and not as a helpless blind girl. Her father reacted by placing her under even more restrictions which caused Toph to run away from home, join Aang on his journey to save the world, and teach him earthbending. She claimed that her parents had changed their mind, but in reality, they had not and still held the same opinion of her. Her parents reacted in this way even though they loved their daughter, because they were scared for and of her, causing them to become controlling in a bid to prevent her from accidentally hurting herself by getting in over her head in the world of earthbending that they did not completely understand.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Xin Fu",
          "key": "${link_2}",
          "target": {
            "href": "Xin_Fu",
            "page": "Xin_Fu"
          }
        }
      ],
      "text": "The relationship between Toph and her parents changed after she met the Avatar. After using an impressive display of earthbending to free Aang from Xin Fu and his fighters, she confronted her father who had seen the whole thing. She pleaded with her parents for them to see her for herself and not as a helpless blind girl. Her father reacted by placing her under even more restrictions which caused Toph to run away from home, join Aang on his journey to save the world, and teach him earthbending. She claimed that her parents had changed their mind, but in reality, they had not and still held the same opinion of her. Her parents reacted in this way even though they loved their daughter, because they were scared for and of her, causing them to become controlling in a bid to prevent her from accidentally hurting herself by getting in over her head in the world of earthbending that they did not completely understand."
    },
    {
      "body": "After the ${link_0} arrived in ${link_1} and were able to talk to the ${link_2}, Toph received a letter she thought was from her mother. Toph seemed happy to find out that Poppy was in the city and that she seemed to finally accept her for who she was, judging by the sound of the letter which ${link_3} read to her. Nevertheless, Toph was nervous at seeing her mother again after she ran away from home before she was able to enter through the doorway of Poppy's supposed place of residence. Once inside, she found herself captured in a metal cage, her hopes concerning her parents smashed by the fact that they had sent two bounty hunters to drag her forcibly back home. She found herself so unwilling to return home under these circumstances that she managed to overcome the given illusion that earthbenders could not manipulate metal in her desire to escape being taken back home to her parents against her will.",
      "links": [
        {
          "body": "group",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Earth King",
          "key": "${link_2}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "After the group arrived in Ba Sing Se and were able to talk to the Earth King, Toph received a letter she thought was from her mother. Toph seemed happy to find out that Poppy was in the city and that she seemed to finally accept her for who she was, judging by the sound of the letter which Katara read to her. Nevertheless, Toph was nervous at seeing her mother again after she ran away from home before she was able to enter through the doorway of Poppy's supposed place of residence. Once inside, she found herself captured in a metal cage, her hopes concerning her parents smashed by the fact that they had sent two bounty hunters to drag her forcibly back home. She found herself so unwilling to return home under these circumstances that she managed to overcome the given illusion that earthbenders could not manipulate metal in her desire to escape being taken back home to her parents against her will."
    },
    {
      "body": "Perhaps because she was holding a grudge against her parents and their authority for doing this to her, upon entering into the ${link_0} Toph began acting rebellious by scamming several people for money. Feeling that this was getting out of hand, Katara confronted her about this behavior, which only caused Toph to lash out at her. The earthbender accused her of being \"motherly\" and made a reference about how much fun they were having without parents. Upon Toph saying this, Katara reasoned that she only acted wild because of her relationship with her parents. After the two made up, Toph revealed to Katara that she did miss her parents and felt guilty for hurting them when she ran away. In the end, Toph asked Katara to help write a letter to her parents, which they sent to them via ${link_1}.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Hawky",
          "key": "${link_1}",
          "target": {
            "href": "Hawky",
            "page": "Hawky"
          }
        }
      ],
      "text": "Perhaps because she was holding a grudge against her parents and their authority for doing this to her, upon entering into the Fire Nation Toph began acting rebellious by scamming several people for money. Feeling that this was getting out of hand, Katara confronted her about this behavior, which only caused Toph to lash out at her. The earthbender accused her of being \"motherly\" and made a reference about how much fun they were having without parents. Upon Toph saying this, Katara reasoned that she only acted wild because of her relationship with her parents. After the two made up, Toph revealed to Katara that she did miss her parents and felt guilty for hurting them when she ran away. In the end, Toph asked Katara to help write a letter to her parents, which they sent to them via Hawky."
    },
    {
      "body": "Her love-hate relationship with her parents continued to be an important point of orientation for her even into her teenage years. She spoke to Sokka of how her parents expected her to be not only helpless and thus in need of constant care and observation by others, but to simultaneously be a well-mannered, soft-spoken, little lady, so that all she felt was \"pressure and pain\". Coming to an epiphany that her headlong attempts to force the initial three students of her academy to become metalbenders was hypocritical, Toph chose to give up her school to Kunyo, feeling that all she was doing was subconsciously passing on the flack from her relationship with her parents to other people and wanting to take some responsibility for her actions.",
      "links": [],
      "text": "Her love-hate relationship with her parents continued to be an important point of orientation for her even into her teenage years. She spoke to Sokka of how her parents expected her to be not only helpless and thus in need of constant care and observation by others, but to simultaneously be a well-mannered, soft-spoken, little lady, so that all she felt was \"pressure and pain\". Coming to an epiphany that her headlong attempts to force the initial three students of her academy to become metalbenders was hypocritical, Toph chose to give up her school to Kunyo, feeling that all she was doing was subconsciously passing on the flack from her relationship with her parents to other people and wanting to take some responsibility for her actions."
    },
    {
      "body": "When ${link_0} saw ${link_1} again after two years, he refused to acknowledge her, as she was not the girl he had raised.",
      "links": [
        {
          "body": "Lao",
          "key": "${link_0}",
          "target": {
            "href": "Lao_Beifong",
            "page": "Lao_Beifong"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "When Lao saw Toph again after two years, he refused to acknowledge her, as she was not the girl he had raised."
    },
    {
      "body": "In 102 AG, Toph unexpectedly came face-to-face with her father at a crystal-processing ${link_0}. Although Toph addressed him as her father, Lao dismissed her presence by declaring her to be confused and he ordered the guards to lead her off the premises. Toph later confronted him in his office, where he continued to claim that she was not his daughter as he had spent hours of his life and a good portion of his fortune to raise a poised, demure, obedient young woman, all things Toph was not. Toph countered by admitting that she knew she put her family through a lot, but revealed that the quiet, little girl he presumed she was had all been an act to please her parents. She recounted her successes as the greatest earthbender of all time and the trainer of the Avatar, though Lao did not react to this and merely turned his back to her. Hurt, Toph turned to leave as well, stating that she would never bother him again.",
      "links": [
        {
          "body": "refinery",
          "key": "${link_0}",
          "target": {
            "href": "Earthen_Fire_Refinery",
            "page": "Earthen_Fire_Refinery"
          }
        }
      ],
      "text": "In 102 AG, Toph unexpectedly came face-to-face with her father at a crystal-processing refinery. Although Toph addressed him as her father, Lao dismissed her presence by declaring her to be confused and he ordered the guards to lead her off the premises. Toph later confronted him in his office, where he continued to claim that she was not his daughter as he had spent hours of his life and a good portion of his fortune to raise a poised, demure, obedient young woman, all things Toph was not. Toph countered by admitting that she knew she put her family through a lot, but revealed that the quiet, little girl he presumed she was had all been an act to please her parents. She recounted her successes as the greatest earthbender of all time and the trainer of the Avatar, though Lao did not react to this and merely turned his back to her. Hurt, Toph turned to leave as well, stating that she would never bother him again."
    },
    {
      "body": "However, Toph and Lao soon after found themselves fighting for their lives when Loban's secret iron ore mines were discovered by Sokka and Katara, and subsequently began to collapse as they attempted to evacuate the miners. Toph and Lao were among those trapped, with Toph using her metalbending to prevent the mine from collapsing and burying everybody alive. Fearing they might not survive, and awed by his daughter's resolve and strength as she struggled beneath the weight of the mine, Lao finally felt compelled to confess his true feelings for Toph in the time since she ran away. Lao admitted that her mother blamed him for driving her away, and that in his guilt he left to start anew with his new ventures in Yu Dao. Finally letting go of his anguish and bitterness, Lao professed his undying love for Toph, having never stopped thinking of her since her disappearance. Moved by his words, Toph acknowledged her father's affection before proudly proclaiming that she would protect everyone in the mine for as long as necessary, and that Lao no longer needed to question her true strength as an earthbender. After Aang and Toph's students reopened the mine and freed their friends, Lao tended to Toph who had been overcome by exhaustion, and nursed her back to health as the group was sent to receive medical attention. Toph would again rush to the defense of her friends when the warrior spirit General Old Iron attacked the town, with Lao finally recognizing her ability to take care of herself even while still overcoming his old protectiveness of her.",
      "links": [],
      "text": "However, Toph and Lao soon after found themselves fighting for their lives when Loban's secret iron ore mines were discovered by Sokka and Katara, and subsequently began to collapse as they attempted to evacuate the miners. Toph and Lao were among those trapped, with Toph using her metalbending to prevent the mine from collapsing and burying everybody alive. Fearing they might not survive, and awed by his daughter's resolve and strength as she struggled beneath the weight of the mine, Lao finally felt compelled to confess his true feelings for Toph in the time since she ran away. Lao admitted that her mother blamed him for driving her away, and that in his guilt he left to start anew with his new ventures in Yu Dao. Finally letting go of his anguish and bitterness, Lao professed his undying love for Toph, having never stopped thinking of her since her disappearance. Moved by his words, Toph acknowledged her father's affection before proudly proclaiming that she would protect everyone in the mine for as long as necessary, and that Lao no longer needed to question her true strength as an earthbender. After Aang and Toph's students reopened the mine and freed their friends, Lao tended to Toph who had been overcome by exhaustion, and nursed her back to health as the group was sent to receive medical attention. Toph would again rush to the defense of her friends when the warrior spirit General Old Iron attacked the town, with Lao finally recognizing her ability to take care of herself even while still overcoming his old protectiveness of her."
    },
    {
      "body": "After the town is saved, Lao has now fully embraced Toph for who she is and the two rebuild their bond. Toph shows support for her father's efforts to rebuild the damaged mining town in the hopes of building the better future he believes in, and comments that his speech to the emboldened miners was \"not bad\" before the two go to catch up some more.",
      "links": [],
      "text": "After the town is saved, Lao has now fully embraced Toph for who she is and the two rebuild their bond. Toph shows support for her father's efforts to rebuild the damaged mining town in the hopes of building the better future he believes in, and comments that his speech to the emboldened miners was \"not bad\" before the two go to catch up some more."
    },
    {
      "body": "The lack of freedom her parents gave her led to Toph's parenting style becoming a total opposite of theirs, giving her two daughters, Lin and Suyin, total freedom in their life. By 141 AG, Toph had reconciled with her parents, so much so that they were willing to let Suyin stay with them to avoid going to jail.",
      "links": [],
      "text": "The lack of freedom her parents gave her led to Toph's parenting style becoming a total opposite of theirs, giving her two daughters, Lin and Suyin, total freedom in their life. By 141 AG, Toph had reconciled with her parents, so much so that they were willing to let Suyin stay with them to avoid going to jail."
    },
    {
      "body": "At some point before 120 AG, Toph became romantically involved with a man named Kanto, with whom she had a daughter, Lin. Despite referring to him as a \"nice man\", their relationship did not work out and Toph never mentioned him to their daughter. Whenever Lin inquired about his identity, Toph would refuse to talk about Kanto, until 174 AG, when she revealed his name to Bolin, Lin, and Opal.",
      "links": [],
      "text": "At some point before 120 AG, Toph became romantically involved with a man named Kanto, with whom she had a daughter, Lin. Despite referring to him as a \"nice man\", their relationship did not work out and Toph never mentioned him to their daughter. Whenever Lin inquired about his identity, Toph would refuse to talk about Kanto, until 174 AG, when she revealed his name to Bolin, Lin, and Opal."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Satoru",
          "key": "${link_1}",
          "target": {
            "href": "Satoru",
            "page": "Satoru"
          }
        }
      ],
      "text": "Toph and Satoru."
    },
    {
      "body": "Upon spotting Toph on the grounds of the ${link_0} as its interim boss while ${link_1} was away, ${link_2} was instantly starstruck by her, praising her role in the War, almost to the point of dismissing Aang's role entirely, and her invention of a new style of bending that even the Avatar could not perform. Toph seemed somewhat dismissive of him at first, but quickly warmed up to him after the praising. After she informed him about her ${link_3}, the two soon struck up a deal between themselves, in which Satoru and his uncle would sponsor a new school building in exchange for their regular checkups of the refinery's machines. Toph enthusiastically agreed by saying she would love to be in a partnership with him, though quickly corrected herself by claiming she had meant to say the refinery.",
      "links": [
        {
          "body": "Earthen Fire Refinery",
          "key": "${link_0}",
          "target": {
            "href": "Earthen_Fire_Refinery",
            "page": "Earthen_Fire_Refinery"
          }
        },
        {
          "body": "his uncle",
          "key": "${link_1}",
          "target": {
            "href": "Loban",
            "page": "Loban"
          }
        },
        {
          "body": "Satoru",
          "key": "${link_2}",
          "target": {
            "href": "Satoru",
            "page": "Satoru"
          }
        },
        {
          "body": "metalbending academy",
          "key": "${link_3}",
          "target": {
            "href": "Beifong_Metalbending_Academy",
            "page": "Beifong_Metalbending_Academy"
          }
        }
      ],
      "text": "Upon spotting Toph on the grounds of the Earthen Fire Refinery as its interim boss while his uncle was away, Satoru was instantly starstruck by her, praising her role in the War, almost to the point of dismissing Aang's role entirely, and her invention of a new style of bending that even the Avatar could not perform. Toph seemed somewhat dismissive of him at first, but quickly warmed up to him after the praising. After she informed him about her metalbending academy, the two soon struck up a deal between themselves, in which Satoru and his uncle would sponsor a new school building in exchange for their regular checkups of the refinery's machines. Toph enthusiastically agreed by saying she would love to be in a partnership with him, though quickly corrected herself by claiming she had meant to say the refinery."
    },
    {
      "body": "When Aang went on the offensive against Satoru by claiming that it was the refinery's fault that the river had become polluted, Toph was quick to shout at everyone to back off from the engineer and used her seismic sense lie-detecting abilities to verify the truth behind Satoru's defense that the factory was not to blame. Sensing no lie, she backed him up, prompting Aang to take her aside and inform her that her perception may have been distorted due to the crush he perceived her to have on Satoru; to this, she merely retorted by drawing a parallel with how she perceived Aang's judgment to be clouded by his traditions.",
      "links": [],
      "text": "When Aang went on the offensive against Satoru by claiming that it was the refinery's fault that the river had become polluted, Toph was quick to shout at everyone to back off from the engineer and used her seismic sense lie-detecting abilities to verify the truth behind Satoru's defense that the factory was not to blame. Sensing no lie, she backed him up, prompting Aang to take her aside and inform her that her perception may have been distorted due to the crush he perceived her to have on Satoru; to this, she merely retorted by drawing a parallel with how she perceived Aang's judgment to be clouded by his traditions."
    },
    {
      "body": "When Loban later yelled at Satoru, who took it without a word, Toph deemed him to have acted like a \"sniveling flunky\", which was something she could not respect. Satoru on the other hand, believed he had merely been respectful to his uncle. The disagreement strained their relationship, as Satoru claimed that Toph had no right commenting on his situation as she did not know what he and Loban had been through.",
      "links": [],
      "text": "When Loban later yelled at Satoru, who took it without a word, Toph deemed him to have acted like a \"sniveling flunky\", which was something she could not respect. Satoru on the other hand, believed he had merely been respectful to his uncle. The disagreement strained their relationship, as Satoru claimed that Toph had no right commenting on his situation as she did not know what he and Loban had been through."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Toph and Sokka."
    },
    {
      "body": "Because of Toph's young age and blindness, ${link_0} was skeptical of her earthbending powers at first. Upon witnessing her fight Xin Fu's entire group of earthbenders, however, he was astonished to the point of fainting. Afterward, he gladly welcomed Toph into their group. Just as Sokka was initially doubtful of Toph's fighting skills, Toph thought little of Sokka's abilities as a warrior, dismissing his fighting skills due to his inability to ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "bend",
          "key": "${link_1}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "Because of Toph's young age and blindness, Sokka was skeptical of her earthbending powers at first. Upon witnessing her fight Xin Fu's entire group of earthbenders, however, he was astonished to the point of fainting. Afterward, he gladly welcomed Toph into their group. Just as Sokka was initially doubtful of Toph's fighting skills, Toph thought little of Sokka's abilities as a warrior, dismissing his fighting skills due to his inability to bend."
    },
    {
      "body": "Though the two were initially somewhat hostile, Sokka was the only member of the group who did not confront Toph for her apparent lack of responsibility and later confronted Katara and Aang with the realization that they \"were pretty much jerks\". He was also the only one who attempted to stop Toph when she tried to leave the group. The two came to an easy understanding and frequently worked together to accomplish tasks outside the range of one or the other.",
      "links": [],
      "text": "Though the two were initially somewhat hostile, Sokka was the only member of the group who did not confront Toph for her apparent lack of responsibility and later confronted Katara and Aang with the realization that they \"were pretty much jerks\". He was also the only one who attempted to stop Toph when she tried to leave the group. The two came to an easy understanding and frequently worked together to accomplish tasks outside the range of one or the other."
    },
    {
      "body": "When Toph was knocked into a large body of water while crossing an ice bridge, she called for help and, though Sokka began to untie his shoes to come to her rescue, ${link_0} jumped in the water without second thoughts and was able to reach Toph before Sokka had entered the water. Unaware that it was Suki, Toph gleefully thanked Sokka for the rescue and kissed Suki on the cheek. She was very embarrassed to find out what actually happened, commenting that Suki could let her drown.",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        }
      ],
      "text": "When Toph was knocked into a large body of water while crossing an ice bridge, she called for help and, though Sokka began to untie his shoes to come to her rescue, Suki jumped in the water without second thoughts and was able to reach Toph before Sokka had entered the water. Unaware that it was Suki, Toph gleefully thanked Sokka for the rescue and kissed Suki on the cheek. She was very embarrassed to find out what actually happened, commenting that Suki could let her drown."
    },
    {
      "body": "When Sokka briefly left the group to pursue the tutelage of a ${link_0}, Aang, Katara, and Toph all expressed regret over his absence, reflecting that his humor and strict adherence to a planned schedule had given them entertainment and focus in their lives. When Sokka returned, Toph claimed that she had not missed him, but turned aside and blushed afterward, providing more evidence that she had a crush on him. By this point, Sokka also seemed to connect with Toph more than with any other character in the group, giving her a piece of ${link_1} that was used in crafting his ${link_2} after they left the ${link_3}. Being composed of earth and metal, Toph was able to mold the fragment into any shape or form she desired and wore it as an arm ${link_4}. She later expressed how valuable her meteorite arm bracelet was to her when she let herself get captured by ${link_5}, only to have her plan backfire on her. When Katara asked if she had the bracelet so that they might escape, Toph told her she left it at camp because she was afraid it would be taken away from her by the soldiers. Sokka remained the only person who managed to settle the argument between Toph and Katara which occurred right before the girls were captured. He also trusted Toph to the extent where he told her that he could not remember his mother's face, rather only seeing Katara's when he tried to picture his ${link_6} face; this is a fact which he had not told anyone before. Toph trusted him enough to tell him how she actually appreciated Katara's motherly attitude sometimes.",
      "links": [
        {
          "body": "renowned sword master",
          "key": "${link_0}",
          "target": {
            "href": "Piandao",
            "page": "Piandao"
          }
        },
        {
          "body": "meteorite",
          "key": "${link_1}",
          "target": {
            "href": "Meteor",
            "page": "Meteor"
          }
        },
        {
          "body": "sword",
          "key": "${link_2}",
          "target": {
            "href": "Sokka%27s_sword",
            "page": "Sokka%27s_sword"
          }
        },
        {
          "body": "swordmaster's residence",
          "key": "${link_3}",
          "target": {
            "href": "Piandao%27s_castle",
            "page": "Piandao%27s_castle"
          }
        },
        {
          "body": "bracelet",
          "key": "${link_4}",
          "target": {
            "href": "Toph%27s_bracelet",
            "page": "Toph%27s_bracelet"
          }
        },
        {
          "body": "Fire Nation soldiers",
          "key": "${link_5}",
          "target": {
            "href": "Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "mother's",
          "key": "${link_6}",
          "target": {
            "href": "Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        }
      ],
      "text": "When Sokka briefly left the group to pursue the tutelage of a renowned sword master, Aang, Katara, and Toph all expressed regret over his absence, reflecting that his humor and strict adherence to a planned schedule had given them entertainment and focus in their lives. When Sokka returned, Toph claimed that she had not missed him, but turned aside and blushed afterward, providing more evidence that she had a crush on him. By this point, Sokka also seemed to connect with Toph more than with any other character in the group, giving her a piece of meteorite that was used in crafting his sword after they left the swordmaster's residence. Being composed of earth and metal, Toph was able to mold the fragment into any shape or form she desired and wore it as an arm bracelet. She later expressed how valuable her meteorite arm bracelet was to her when she let herself get captured by Fire Nation soldiers, only to have her plan backfire on her. When Katara asked if she had the bracelet so that they might escape, Toph told her she left it at camp because she was afraid it would be taken away from her by the soldiers. Sokka remained the only person who managed to settle the argument between Toph and Katara which occurred right before the girls were captured. He also trusted Toph to the extent where he told her that he could not remember his mother's face, rather only seeing Katara's when he tried to picture his mother's face; this is a fact which he had not told anyone before. Toph trusted him enough to tell him how she actually appreciated Katara's motherly attitude sometimes."
    },
    {
      "body": "When Sokka became suspicious of ${link_0} while Team Avatar stayed at her inn, Toph ignored the apprehensiveness of Aang and Katara and helped him unlock a mysterious chest, which ended up containing Hama's ${link_1}, briefly blushing as she did so, providing further proof of her crush on Sokka.",
      "links": [
        {
          "body": "Hama",
          "key": "${link_0}",
          "target": {
            "href": "Hama",
            "page": "Hama"
          }
        },
        {
          "body": "whale tooth comb",
          "key": "${link_1}",
          "target": {
            "href": "Whale_tooth_comb",
            "page": "Whale_tooth_comb"
          }
        }
      ],
      "text": "When Sokka became suspicious of Hama while Team Avatar stayed at her inn, Toph ignored the apprehensiveness of Aang and Katara and helped him unlock a mysterious chest, which ended up containing Hama's whale tooth comb, briefly blushing as she did so, providing further proof of her crush on Sokka."
    },
    {
      "body": "During the search for ${link_0} ${link_1} during the ${link_2}, Toph used her expert earthbending and metalbending abilities to locate the underground bunkers. Sokka consistently expressed his admiration for Toph's abilities during this search and how happy he was that Toph had been added to the group. Later, when Sokka was tricked into attacking ${link_3}, rather than ignoring her as he had instructed the group to do, Toph had to intervene twice to prevent Azula from killing him – the first time from being stabbed with one of Mai's weapons and the second time from being burned by Azula's ${link_4}. She also insisted that he should not blame himself for his failure to ignore Azula and for the ultimate failure of the invasion which resulted from that, despite Sokka's love for Suki being the reason he fell into the ${link_5} trap.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_1}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        },
        {
          "body": "Azula",
          "key": "${link_3}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "firebending",
          "key": "${link_4}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Fire Princess's",
          "key": "${link_5}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "text": "During the search for Fire Lord Ozai during the invasion of the Fire Nation, Toph used her expert earthbending and metalbending abilities to locate the underground bunkers. Sokka consistently expressed his admiration for Toph's abilities during this search and how happy he was that Toph had been added to the group. Later, when Sokka was tricked into attacking Azula, rather than ignoring her as he had instructed the group to do, Toph had to intervene twice to prevent Azula from killing him – the first time from being stabbed with one of Mai's weapons and the second time from being burned by Azula's firebending. She also insisted that he should not blame himself for his failure to ignore Azula and for the ultimate failure of the invasion which resulted from that, despite Sokka's love for Suki being the reason he fell into the Fire Princess's trap."
    },
    {
      "body": "${link_0} shielding ${link_1}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Sokka shielding Toph."
    },
    {
      "body": "Toph and Sokka made a superb team while destroying Ozai's ${link_0} alongside Suki upon the arrival of ${link_1}. When Suki was separated from them, Toph helped Sokka continue their assault. The two fell off one of the airships and hung helplessly as Sokka gripped onto the hull. He desperately tried to defend Toph and himself as the firebenders attacked, but was soon rendered powerless. Toph cried when she realized both of them would die. However, the duo was saved by Suki and they succeeded in finishing the attack. They celebrated their victory with the gang at Ba Sing Se. Although it was never confirmed that Toph was over her crush on Sokka, her seeming acceptance of Suki as they joked after Ozai is subdued shows that she has learned to deal with the older girl's romantic relationship with Sokka by this point. Because of this, it is generally regarded that their relationship is basically platonic during the time immediately subsequent to the end of the War.",
      "links": [
        {
          "body": "airships",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_airship",
            "page": "Fire_Nation_airship"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_1}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        }
      ],
      "text": "Toph and Sokka made a superb team while destroying Ozai's airships alongside Suki upon the arrival of Sozin's Comet. When Suki was separated from them, Toph helped Sokka continue their assault. The two fell off one of the airships and hung helplessly as Sokka gripped onto the hull. He desperately tried to defend Toph and himself as the firebenders attacked, but was soon rendered powerless. Toph cried when she realized both of them would die. However, the duo was saved by Suki and they succeeded in finishing the attack. They celebrated their victory with the gang at Ba Sing Se. Although it was never confirmed that Toph was over her crush on Sokka, her seeming acceptance of Suki as they joked after Ozai is subdued shows that she has learned to deal with the older girl's romantic relationship with Sokka by this point. Because of this, it is generally regarded that their relationship is basically platonic during the time immediately subsequent to the end of the War."
    },
    {
      "body": "One year after the Hundred Year War's end, Toph met back up with Sokka and the rest of Team Avatar, after having been separated from them for an unknown period of time. After having pulled away from the hug he and Katara had given her upon her return, Sokka questioned her about the metalbending academy she had recently started up; when he asked how the training was going, however, the best that Toph could say was \"meh\" (showing her low view of her student's abilities at that point). During the stand-off at ${link_0} which happened soon afterward between ${link_1} and Aang, Sokka tried to keep the crowd gathered outside the gates calm, but was rewarded by being called \"a Water Tribe savage\" and by a rock to the head, thrown by an unseen member of the mob. Toph seemed to take this as a personal insult, treating the crowd to a tirade about how they should treat the friend of \"the greatest earthbender of all time\" with more respect, and threatening to crush via boulder anyone who continued to cause problems.",
      "links": [
        {
          "body": "Yu Dao",
          "key": "${link_0}",
          "target": {
            "href": "Yu_Dao",
            "page": "Yu_Dao"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "One year after the Hundred Year War's end, Toph met back up with Sokka and the rest of Team Avatar, after having been separated from them for an unknown period of time. After having pulled away from the hug he and Katara had given her upon her return, Sokka questioned her about the metalbending academy she had recently started up; when he asked how the training was going, however, the best that Toph could say was \"meh\" (showing her low view of her student's abilities at that point). During the stand-off at Yu Dao which happened soon afterward between Zuko and Aang, Sokka tried to keep the crowd gathered outside the gates calm, but was rewarded by being called \"a Water Tribe savage\" and by a rock to the head, thrown by an unseen member of the mob. Toph seemed to take this as a personal insult, treating the crowd to a tirade about how they should treat the friend of \"the greatest earthbender of all time\" with more respect, and threatening to crush via boulder anyone who continued to cause problems."
    },
    {
      "body": "${link_0} going with ${link_1} to avoid ${link_2} and ${link_3}.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Sokka going with Toph to avoid Aang and Katara."
    },
    {
      "body": "When Toph had to return from the group to her school as she had promised her students, Sokka complained that without her being present the \"oogies\" he was getting from Katara and Aang's romantic displays would only get worse. With an odd look on her face, Toph suggested Sokka to come along with her in order to avoid this, an idea he promptly jumped on as if it were his own. After Sokka explained his plans to his sister and her boyfriend, Toph took him by the hand and jumped off ${link_0} without waiting for the bison to land, which caused Sokka to freak out, especially when Toph had to let go of him in order to create the earth-slide which was to cushion their fall. Once they were standing on solid ground, Sokka asked Toph where she had come up with the idea for her metalbending academy; however, when she waxed enthusiastic about how she felt she had made a difference by teaching out Aang and how this had led her to feel in her heart that becoming a metalbending teacher was her life's calling. Sokka promptly dismissed this as a cover for her taking on the role simply because she liked telling other people what to do, to which Toph actually agreed. Soon after they arrived at the school, Sokka partnered up with Toph on an adventure once again, helping her prepare her students to defend her metalbending school against a rival class of firebenders.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "When Toph had to return from the group to her school as she had promised her students, Sokka complained that without her being present the \"oogies\" he was getting from Katara and Aang's romantic displays would only get worse. With an odd look on her face, Toph suggested Sokka to come along with her in order to avoid this, an idea he promptly jumped on as if it were his own. After Sokka explained his plans to his sister and her boyfriend, Toph took him by the hand and jumped off Appa without waiting for the bison to land, which caused Sokka to freak out, especially when Toph had to let go of him in order to create the earth-slide which was to cushion their fall. Once they were standing on solid ground, Sokka asked Toph where she had come up with the idea for her metalbending academy; however, when she waxed enthusiastic about how she felt she had made a difference by teaching out Aang and how this had led her to feel in her heart that becoming a metalbending teacher was her life's calling. Sokka promptly dismissed this as a cover for her taking on the role simply because she liked telling other people what to do, to which Toph actually agreed. Soon after they arrived at the school, Sokka partnered up with Toph on an adventure once again, helping her prepare her students to defend her metalbending school against a rival class of firebenders."
    },
    {
      "body": "At the beginning of this adventure, Toph expressed her worries to Sokka that her students may not be able to metalbend, as she was just working off her intuitions that those who caused her meteorite bracelet to vibrate would have the potential to metalbend, without anything to prove the theory. In response, Sokka offered his services as a \"motivational bender\" to try to inspire her students, and when his initial attempts fail, came up with the idea of making them \"super-emotional\" to draw out their Metalbending potential. In order to do this, he has Toph construct via metalbending the armor left behind by the firebending class into Flying Boar in order to send them all into a panic. When he praised her as having outdone herself in the construction of this metal beast, she responded that he can just call her the greatest Earthbender of all time; when Sokka laughed this off as a joke, Toph surprised him by insisting upon the flattery, only to remark that it was very sweet of him to tell her that with an enormous grin on her face.",
      "links": [],
      "text": "At the beginning of this adventure, Toph expressed her worries to Sokka that her students may not be able to metalbend, as she was just working off her intuitions that those who caused her meteorite bracelet to vibrate would have the potential to metalbend, without anything to prove the theory. In response, Sokka offered his services as a \"motivational bender\" to try to inspire her students, and when his initial attempts fail, came up with the idea of making them \"super-emotional\" to draw out their Metalbending potential. In order to do this, he has Toph construct via metalbending the armor left behind by the firebending class into Flying Boar in order to send them all into a panic. When he praised her as having outdone herself in the construction of this metal beast, she responded that he can just call her the greatest Earthbender of all time; when Sokka laughed this off as a joke, Toph surprised him by insisting upon the flattery, only to remark that it was very sweet of him to tell her that with an enormous grin on her face."
    },
    {
      "body": "Finding Toph sulking with her head buried in her arms when this failed in turn, Sokka tried to cheer her up by offering further suggestions on how to motivate her students, but she cut him off by telling him the story of her invention of Metalbending. She confessed that her parents' attempts to make her into something she was not (which her metal prison symbolized) caused her to feel a great deal of pressure and pain. She then decides that the Beifong Metalbending Academy was guilty of hypocrisy in attempting to do the same thing to its students, ignoring his protests to the contrary.",
      "links": [],
      "text": "Finding Toph sulking with her head buried in her arms when this failed in turn, Sokka tried to cheer her up by offering further suggestions on how to motivate her students, but she cut him off by telling him the story of her invention of Metalbending. She confessed that her parents' attempts to make her into something she was not (which her metal prison symbolized) caused her to feel a great deal of pressure and pain. She then decides that the Beifong Metalbending Academy was guilty of hypocrisy in attempting to do the same thing to its students, ignoring his protests to the contrary."
    },
    {
      "body": "After her students rose to the occasion and defended Toph's Metalbending school from the rival class of firebenders, Sokka and her apparently did not have much to do for a while. For this reason, Sokka began complaining that his sister and Aang were too caught up in their own lovey-dovey-ness to remember him, such that Toph had gotten irritated with his \"belly-aching\" about the pair by the point that Suki finally showed up to request their assistance in Yu Dao. She quite visibly expressed her own disgust with the affection that Sokka showered on his girlfriend upon her arrival, demonstrating a continuing sense about them displaying romantic affection in front of her, though she is amicable enough with the Kyoshi Warrior as a teammate when these displays ceased.",
      "links": [],
      "text": "After her students rose to the occasion and defended Toph's Metalbending school from the rival class of firebenders, Sokka and her apparently did not have much to do for a while. For this reason, Sokka began complaining that his sister and Aang were too caught up in their own lovey-dovey-ness to remember him, such that Toph had gotten irritated with his \"belly-aching\" about the pair by the point that Suki finally showed up to request their assistance in Yu Dao. She quite visibly expressed her own disgust with the affection that Sokka showered on his girlfriend upon her arrival, demonstrating a continuing sense about them displaying romantic affection in front of her, though she is amicable enough with the Kyoshi Warrior as a teammate when these displays ceased."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Aang and Toph."
    },
    {
      "body": "Aang once had a vision of Toph before the two actually met. First encountering one another at the underground ${link_0} earthbending tournament, Toph considered Aang a rival when he almost effortlessly defeated her through ${link_1}. In the beginning, she was unwilling to talk to Aang and forcefully kept him quiet when he tried to talk about her earthbending skills during dinner at her parents' house that evening. After dinner, however, a truce was made and Toph explained to Aang her ability to listen to the earth. She went on to talk about her life under her overbearing parents. Later, Toph single-handedly saved Aang when he was held captive by the participants of the earthbending tournament. She soon joined him on his quest after running away from home, but not before throwing him into a tree via earthbending to even the score from the tournament.",
      "links": [
        {
          "body": "Earth Rumble VI",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Rumble_VI",
            "page": "Earth_Rumble_VI"
          }
        },
        {
          "body": "airbending",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        }
      ],
      "text": "Aang once had a vision of Toph before the two actually met. First encountering one another at the underground Earth Rumble VI earthbending tournament, Toph considered Aang a rival when he almost effortlessly defeated her through airbending. In the beginning, she was unwilling to talk to Aang and forcefully kept him quiet when he tried to talk about her earthbending skills during dinner at her parents' house that evening. After dinner, however, a truce was made and Toph explained to Aang her ability to listen to the earth. She went on to talk about her life under her overbearing parents. Later, Toph single-handedly saved Aang when he was held captive by the participants of the earthbending tournament. She soon joined him on his quest after running away from home, but not before throwing him into a tree via earthbending to even the score from the tournament."
    },
    {
      "body": "Toph began to teach Aang earthbending, but complications arose between Toph's teaching style and Aang's natural tendencies as an airbender. Earthbending is, according to Toph, about directly taking on a challenge, not trying to find a way around or over it. The two clashed personality wise as well, with Aang's pacifistic, carefree attitude being ill-prepared to deal with the tough and stubborn Toph. She even went as far as intentionally acting mean by taking ${link_0} and using it as a nutcracker in order to get a rise out of the passive Aang. Counter-productively, Aang's peaceful nature prevented him from acting and depression came as a result. Only after an insightful talk with Katara about earth being his natural opposite element did Aang start thinking positively.",
      "links": [
        {
          "body": "Aang's staff",
          "key": "${link_0}",
          "target": {
            "href": "Airbender_staff",
            "page": "Airbender_staff"
          }
        }
      ],
      "text": "Toph began to teach Aang earthbending, but complications arose between Toph's teaching style and Aang's natural tendencies as an airbender. Earthbending is, according to Toph, about directly taking on a challenge, not trying to find a way around or over it. The two clashed personality wise as well, with Aang's pacifistic, carefree attitude being ill-prepared to deal with the tough and stubborn Toph. She even went as far as intentionally acting mean by taking Aang's staff and using it as a nutcracker in order to get a rise out of the passive Aang. Counter-productively, Aang's peaceful nature prevented him from acting and depression came as a result. Only after an insightful talk with Katara about earth being his natural opposite element did Aang start thinking positively."
    },
    {
      "body": "Later, when he was forced to confront a ferocious ${link_0} in order to protect trapped Sokka, Aang finally stood his ground and learned to think like an earthbender. It was revealed that Toph had been observing all the while and after Aang proved his new toughness by taking back his staff and moving a boulder, Toph finally and proudly proclaimed him an earthbender.",
      "links": [
        {
          "body": "saber-tooth moose lion",
          "key": "${link_0}",
          "target": {
            "href": "Saber-tooth_moose_lion",
            "page": "Saber-tooth_moose_lion"
          }
        }
      ],
      "text": "Later, when he was forced to confront a ferocious saber-tooth moose lion in order to protect trapped Sokka, Aang finally stood his ground and learned to think like an earthbender. It was revealed that Toph had been observing all the while and after Aang proved his new toughness by taking back his staff and moving a boulder, Toph finally and proudly proclaimed him an earthbender."
    },
    {
      "body": "Toph often referred to Aang as \"Twinkle Toes\", which was likely out of friendly humor rather than insult. The nickname originated from Aang's hovering when they fought. She commented that he was \"light on his feet\" and asked if his tournament nickname was \"The Fancy Dancer\". Toph was able to find Aang in a large crowd because of his light footsteps.",
      "links": [],
      "text": "Toph often referred to Aang as \"Twinkle Toes\", which was likely out of friendly humor rather than insult. The nickname originated from Aang's hovering when they fought. She commented that he was \"light on his feet\" and asked if his tournament nickname was \"The Fancy Dancer\". Toph was able to find Aang in a large crowd because of his light footsteps."
    },
    {
      "body": "Aang and Toph's relationship was quite strained at times. Toph's hardheaded nature clashed with Aang's on several occasions, particularly over the subject of Appa. A tired Toph, weary of going days without sleep, blamed Appa's shedding as the reason they could not shake their mysterious pursuers. Although she was right, Aang immediately jumped to Appa's defense, which resulted in Toph abandoning the group for a short time. Later, after Appa was stolen by ${link_0}, Aang accused Toph of allowing the thieves to steal him. Only Katara was able to reason with him, reminding Aang that Toph had still managed to save the rest of the group even if it was at the cost of losing Appa. Nonetheless, they were able to work together when dealing with threats, such as the Fire Nation and the ${link_1}. They appeared to get along much better as time went on. Later, Aang referred to everyone, including Toph, as his family.",
      "links": [
        {
          "body": "sandbenders",
          "key": "${link_0}",
          "target": {
            "href": "Sandbender_Tribes",
            "page": "Sandbender_Tribes"
          }
        },
        {
          "body": "Dai Li",
          "key": "${link_1}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "Aang and Toph's relationship was quite strained at times. Toph's hardheaded nature clashed with Aang's on several occasions, particularly over the subject of Appa. A tired Toph, weary of going days without sleep, blamed Appa's shedding as the reason they could not shake their mysterious pursuers. Although she was right, Aang immediately jumped to Appa's defense, which resulted in Toph abandoning the group for a short time. Later, after Appa was stolen by sandbenders, Aang accused Toph of allowing the thieves to steal him. Only Katara was able to reason with him, reminding Aang that Toph had still managed to save the rest of the group even if it was at the cost of losing Appa. Nonetheless, they were able to work together when dealing with threats, such as the Fire Nation and the Dai Li. They appeared to get along much better as time went on. Later, Aang referred to everyone, including Toph, as his family."
    },
    {
      "body": "Following the Hundred Year War, Toph separated from Aang and the rest of Team Avatar, only to join back up with them when she heard Appa flying over the Beifong Metalbending Academy just before the skirmish at Yu Dao. Due to the fact that he was deep in meditation with ${link_0}, Aang did not seem to immediately realize that she had returned; however, once they had landed, he greeted her with a hug just as Katara and Sokka had, a matter made slightly difficult by the fact that he had clearly outgrown Toph during the last year (compensated by his bending down and her standing on the tips of her toes during the hug).",
      "links": [
        {
          "body": "Roku",
          "key": "${link_0}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        }
      ],
      "text": "Following the Hundred Year War, Toph separated from Aang and the rest of Team Avatar, only to join back up with them when she heard Appa flying over the Beifong Metalbending Academy just before the skirmish at Yu Dao. Due to the fact that he was deep in meditation with Roku, Aang did not seem to immediately realize that she had returned; however, once they had landed, he greeted her with a hug just as Katara and Sokka had, a matter made slightly difficult by the fact that he had clearly outgrown Toph during the last year (compensated by his bending down and her standing on the tips of her toes during the hug)."
    },
    {
      "body": "During the arrest of ${link_0}, Toph still appears to call the Avatar by the nickname \"Twinkle Toes\", despite his complaints that he was forty years old, which he considered to be \"too old for nicknames\".",
      "links": [
        {
          "body": "Yakone",
          "key": "${link_0}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        }
      ],
      "text": "During the arrest of Yakone, Toph still appears to call the Avatar by the nickname \"Twinkle Toes\", despite his complaints that he was forty years old, which he considered to be \"too old for nicknames\"."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Appa",
          "key": "${link_1}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "Toph and Appa."
    },
    {
      "body": "Toph hated and feared flying, as it rendered her truly blind and severed her connection to the earth; at best, she seemed rather bored and restless while flying on Appa. This was emphasized when she claimed to have spotted the titular library from Appa's back, only to remind her friends that she was blind.",
      "links": [],
      "text": "Toph hated and feared flying, as it rendered her truly blind and severed her connection to the earth; at best, she seemed rather bored and restless while flying on Appa. This was emphasized when she claimed to have spotted the titular library from Appa's back, only to remind her friends that she was blind."
    },
    {
      "body": "Toph expressed dislike toward Appa when she angrily pointed out that Appa's shedding left a large trail that allowed Azula to find them no matter how far or fast they flew.",
      "links": [],
      "text": "Toph expressed dislike toward Appa when she angrily pointed out that Appa's shedding left a large trail that allowed Azula to find them no matter how far or fast they flew."
    },
    {
      "body": "Toph tried her best, however, to protect Appa from being stolen by sandbenders. She was unable to fight her hardest, since she was preoccupied with keeping Aang, Katara, and Sokka's only exit from an ancient library from falling into sand, which curtailed her abilities. This caused her to fail in protecting Appa, something she tearfully apologised to the bison for under her breath as he was dragged away. When Aang angrily lashed out at her for failing to protect Appa, she did not attempt to defend herself in her usual fashion and remained silent, indicating that she blamed herself heavily for losing Appa despite the circumstances having made it impossible to save him.",
      "links": [],
      "text": "Toph tried her best, however, to protect Appa from being stolen by sandbenders. She was unable to fight her hardest, since she was preoccupied with keeping Aang, Katara, and Sokka's only exit from an ancient library from falling into sand, which curtailed her abilities. This caused her to fail in protecting Appa, something she tearfully apologised to the bison for under her breath as he was dragged away. When Aang angrily lashed out at her for failing to protect Appa, she did not attempt to defend herself in her usual fashion and remained silent, indicating that she blamed herself heavily for losing Appa despite the circumstances having made it impossible to save him."
    },
    {
      "body": "Toph, along with everyone else, was overjoyed to see Appa again when he returned to the group at ${link_0}. Despite her persistent dislike for flying, Toph cared much more about Appa in later episodes.",
      "links": [
        {
          "body": "Lake Laogai",
          "key": "${link_0}",
          "target": {
            "href": "Lake_Laogai",
            "page": "Lake_Laogai"
          }
        }
      ],
      "text": "Toph, along with everyone else, was overjoyed to see Appa again when he returned to the group at Lake Laogai. Despite her persistent dislike for flying, Toph cared much more about Appa in later episodes."
    },
    {
      "body": "${link_0} and the ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "badgermoles",
          "key": "${link_1}",
          "target": {
            "href": "Badgermole",
            "page": "Badgermole"
          }
        }
      ],
      "text": "Toph and the badgermoles."
    },
    {
      "body": "Toph harbored great respect and sympathy toward these ${link_0}. When she was younger, she ran away from home and met these giant earthbenders in a cave. She recognized herself in them, as she understood their blindness. They showed her affection as well and ultimately taught her earthbending, most notably their unique way of sensing their surroundings to be able to see. The badgermoles were Toph's true masters and for this reason, she showed respect while discussing them.",
      "links": [
        {
          "body": "creatures",
          "key": "${link_0}",
          "target": {
            "href": "Badgermole",
            "page": "Badgermole"
          }
        }
      ],
      "text": "Toph harbored great respect and sympathy toward these creatures. When she was younger, she ran away from home and met these giant earthbenders in a cave. She recognized herself in them, as she understood their blindness. They showed her affection as well and ultimately taught her earthbending, most notably their unique way of sensing their surroundings to be able to see. The badgermoles were Toph's true masters and for this reason, she showed respect while discussing them."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Iroh and Toph."
    },
    {
      "body": "Toph met ${link_0} in an ${link_1} forest when she temporarily separated from Aang, Sokka and Katara after having an argument. Although she had heard stories about the exploits of the Dragon of the West, she was not aware she was talking to him. The two sat around a fire which Iroh used to make tea and engaged in conversation, although neither indicated their purpose for traveling or the identities of their relations. Iroh noted that Toph was similar to his nephew in the sense that they both tried to do too much by themselves. He commented that there was nothing wrong with needing help and sometimes people offer help because they want, not because they believe the other person is incapable. Toph thanked him for the advice and suggested that Iroh tell his nephew how much he means to him.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Toph met Iroh in an Earth Kingdom forest when she temporarily separated from Aang, Sokka and Katara after having an argument. Although she had heard stories about the exploits of the Dragon of the West, she was not aware she was talking to him. The two sat around a fire which Iroh used to make tea and engaged in conversation, although neither indicated their purpose for traveling or the identities of their relations. Iroh noted that Toph was similar to his nephew in the sense that they both tried to do too much by themselves. He commented that there was nothing wrong with needing help and sometimes people offer help because they want, not because they believe the other person is incapable. Toph thanked him for the advice and suggested that Iroh tell his nephew how much he means to him."
    },
    {
      "body": "Toph and Iroh encountered each other again later at ${link_0} when the two participated with Aang, Sokka, Katara and Zuko in cornering Azula. Iroh's attention was diverted from Azula when he noticed Toph's presence and her association with Aang, Sokka and Katara. Taking advantage of his lack of focus on her, Azula wounded Iroh with a blast of fire before successfully fleeing. Toph showed particular concern for her new friend, but left him after Zuko violently demanded that she and the others leave.",
      "links": [
        {
          "body": "Tu Zin",
          "key": "${link_0}",
          "target": {
            "href": "Tu_Zin",
            "page": "Tu_Zin"
          }
        }
      ],
      "text": "Toph and Iroh encountered each other again later at Tu Zin when the two participated with Aang, Sokka, Katara and Zuko in cornering Azula. Iroh's attention was diverted from Azula when he noticed Toph's presence and her association with Aang, Sokka and Katara. Taking advantage of his lack of focus on her, Azula wounded Iroh with a blast of fire before successfully fleeing. Toph showed particular concern for her new friend, but left him after Zuko violently demanded that she and the others leave."
    },
    {
      "body": "When Iroh sought Aang, Sokka and Toph for help in rescuing Zuko, Toph referred to him as an old friend.",
      "links": [],
      "text": "When Iroh sought Aang, Sokka and Toph for help in rescuing Zuko, Toph referred to him as an old friend."
    },
    {
      "body": "Toph referred back to her meeting with Iroh in order to reassure Zuko about Iroh forgiving him. She said that Iroh's constant talk about Zuko was \"kind of annoying\" but \"very sweet\". When Zuko pulled out Iroh's stinky sandal in order for ${link_0}'s ${link_1}, ${link_2}, to track down Iroh's scent, she said that Zuko's keeping of Iroh's stinky sandal was \"kind of sweet\", referring back to her general knowledge about Iroh and Zuko's relationship that was founded upon this first meeting.",
      "links": [
        {
          "body": "June",
          "key": "${link_0}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "shirshu",
          "key": "${link_1}",
          "target": {
            "href": "Shirshu",
            "page": "Shirshu"
          }
        },
        {
          "body": "Nyla",
          "key": "${link_2}",
          "target": {
            "href": "Nyla",
            "page": "Nyla"
          }
        }
      ],
      "text": "Toph referred back to her meeting with Iroh in order to reassure Zuko about Iroh forgiving him. She said that Iroh's constant talk about Zuko was \"kind of annoying\" but \"very sweet\". When Zuko pulled out Iroh's stinky sandal in order for June's shirshu, Nyla, to track down Iroh's scent, she said that Zuko's keeping of Iroh's stinky sandal was \"kind of sweet\", referring back to her general knowledge about Iroh and Zuko's relationship that was founded upon this first meeting."
    },
    {
      "body": "${link_0} and ${link_1} arguing.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        }
      ],
      "text": "Toph and Katara arguing."
    },
    {
      "body": "Katara had shown great sympathy for Toph over her restricted life under her parents. Like Aang and Sokka, Katara gladly welcomed Toph into their group. At first, the two were at odds with one another, after Toph refused to help set up their campsite, claiming she was carrying her own weight. Toph, at one point, referred insultingly to Katara as \"Sugar Queen\". However, over time, they reached better terms with each other. Later, Katara tried to help Toph by offering her wisdom on how to teach Aang earthbending, although Toph naturally ignored the suggestion because of the fundamental difference between the head-on attitude of earthbending and the redirection of ${link_0}. At the very least, Toph seemed to respect Katara as an equal, bender to bender. Katara and Toph's relationship is often thought of as an older and younger sister bond. In the Si Wong Desert, Katara was the only one who stuck up for Toph when Aang blamed her for not saving Appa.",
      "links": [
        {
          "body": "waterbending",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "Katara had shown great sympathy for Toph over her restricted life under her parents. Like Aang and Sokka, Katara gladly welcomed Toph into their group. At first, the two were at odds with one another, after Toph refused to help set up their campsite, claiming she was carrying her own weight. Toph, at one point, referred insultingly to Katara as \"Sugar Queen\". However, over time, they reached better terms with each other. Later, Katara tried to help Toph by offering her wisdom on how to teach Aang earthbending, although Toph naturally ignored the suggestion because of the fundamental difference between the head-on attitude of earthbending and the redirection of waterbending. At the very least, Toph seemed to respect Katara as an equal, bender to bender. Katara and Toph's relationship is often thought of as an older and younger sister bond. In the Si Wong Desert, Katara was the only one who stuck up for Toph when Aang blamed her for not saving Appa."
    },
    {
      "body": "Later, Katara and Toph got makeovers together and the usually self-confident Toph felt down about her looks after a group of pompous girls made rude comments about her. She still felt hurt, even after she earthbent them into a river, and Katara waterbent them away. Katara managed to cheer her up by expressing her admiration for the fact she did not usually care about other people's opinion about her, for which she was rewarded with a friendly, and unintentionally painful, punch in the arm. The two of them definitely respected each other and seemed to be good friends by this point.",
      "links": [],
      "text": "Later, Katara and Toph got makeovers together and the usually self-confident Toph felt down about her looks after a group of pompous girls made rude comments about her. She still felt hurt, even after she earthbent them into a river, and Katara waterbent them away. Katara managed to cheer her up by expressing her admiration for the fact she did not usually care about other people's opinion about her, for which she was rewarded with a friendly, and unintentionally painful, punch in the arm. The two of them definitely respected each other and seemed to be good friends by this point."
    },
    {
      "body": "${link_0} comforting ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Katara comforting Toph."
    },
    {
      "body": "The two were in conflict a second time when Toph accused Katara of being overbearing and \"motherly\". Katara claimed Toph was acting this way because of her parents and because she was feeling guilty about running away. This made Toph exceptionally angry. She did, however, admit in a private conversation with Sokka, which Katara overheard, that Katara's motherly ways could be good sometimes. The pair made up when Toph confessed to Katara that the real reason she was so angry when Katara accused her of acting out was because she was feeling guilty about her parents, thereby proving the fact that Katara was indeed correct.",
      "links": [],
      "text": "The two were in conflict a second time when Toph accused Katara of being overbearing and \"motherly\". Katara claimed Toph was acting this way because of her parents and because she was feeling guilty about running away. This made Toph exceptionally angry. She did, however, admit in a private conversation with Sokka, which Katara overheard, that Katara's motherly ways could be good sometimes. The pair made up when Toph confessed to Katara that the real reason she was so angry when Katara accused her of acting out was because she was feeling guilty about her parents, thereby proving the fact that Katara was indeed correct."
    },
    {
      "body": "Toph had nicknames for Katara which included \"Sugar Queen\", \"Madame Fussy Britches\", and \"Sweetness\", which linked to Katara's motherly nature and habits. She had used them to insult her whenever they were arguing.",
      "links": [],
      "text": "Toph had nicknames for Katara which included \"Sugar Queen\", \"Madame Fussy Britches\", and \"Sweetness\", which linked to Katara's motherly nature and habits. She had used them to insult her whenever they were arguing."
    },
    {
      "body": "${link_0} helped ${link_1} to overcome her fears.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Toph helped Korra to overcome her fears."
    },
    {
      "body": "Toph found an unconscious ${link_0} in the Foggy Swamp in 174 AG and, having recognized her as the Avatar, took her back to her dwelling. As the young woman awoke, Toph addressed her by the nickname she gave Aang, \"Twinkle Toes\". Much like her attitude toward Aang, Toph had a tendency of belittling Korra, even calling her pathetic for losing all the time. Despite this, Toph agreed to help train Korra, which meant that she thoroughly enjoyed smacking her around, showing no sensitivity in her methods and flat-out pointing out her mistakes in combat. However, the exercise took its toll on her aging body, giving her a sore back, though she was too proud to let Korra know, not wanting to seem weak toward the young woman. Ultimately, Toph became instrumental to Korra's recovery, as she notified Korra that she was still carrying around residual traces of ${link_1} in her body. Toph tried to remove them, though gave up after Korra subconsciously fought her on it twice, telling the Avatar that she would have to remove it herself. Regardless, Toph continued to help Korra and made her realize that she needed to let go of her fears of her past enemies if she wished to be able to face new ones. Believing Korra to be disconnected from those she loved and herself, Toph took the Avatar to the ${link_2}, where Korra re-established her connection to her surroundings. When Korra followed up on Toph's teachings and advice by bending the metal traces out of her body, the earthbender allowed the Avatar to hug her, noting that she had earned that.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "mercury",
          "key": "${link_1}",
          "target": {
            "href": "Mercury",
            "page": "Mercury"
          }
        },
        {
          "body": "banyan-grove tree",
          "key": "${link_2}",
          "target": {
            "href": "Banyan-grove_tree",
            "page": "Banyan-grove_tree"
          }
        }
      ],
      "text": "Toph found an unconscious Korra in the Foggy Swamp in 174 AG and, having recognized her as the Avatar, took her back to her dwelling. As the young woman awoke, Toph addressed her by the nickname she gave Aang, \"Twinkle Toes\". Much like her attitude toward Aang, Toph had a tendency of belittling Korra, even calling her pathetic for losing all the time. Despite this, Toph agreed to help train Korra, which meant that she thoroughly enjoyed smacking her around, showing no sensitivity in her methods and flat-out pointing out her mistakes in combat. However, the exercise took its toll on her aging body, giving her a sore back, though she was too proud to let Korra know, not wanting to seem weak toward the young woman. Ultimately, Toph became instrumental to Korra's recovery, as she notified Korra that she was still carrying around residual traces of mercury in her body. Toph tried to remove them, though gave up after Korra subconsciously fought her on it twice, telling the Avatar that she would have to remove it herself. Regardless, Toph continued to help Korra and made her realize that she needed to let go of her fears of her past enemies if she wished to be able to face new ones. Believing Korra to be disconnected from those she loved and herself, Toph took the Avatar to the banyan-grove tree, where Korra re-established her connection to her surroundings. When Korra followed up on Toph's teachings and advice by bending the metal traces out of her body, the earthbender allowed the Avatar to hug her, noting that she had earned that."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Momo",
          "key": "${link_1}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "Toph and Momo."
    },
    {
      "body": "Although Toph and ${link_0} barely interacted, they did have a friendly relationship. She was also comfortable with letting him eat nuts out of her hand and ride away on her shoulder while training Aang. Momo did ride on her shoulder when they were traveling through the ${link_1}. Shortly before Team Avatar was attacked by ${link_2}, Momo was seen sleeping while curled up next to Toph. At the ${link_3} ferry station, when told animals were not allowed aboard the ferries, Toph readily claimed Momo to be her \"seeing-eye lemur\", thereby granting him the right to travel via ferry.",
      "links": [
        {
          "body": "Momo",
          "key": "${link_0}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        },
        {
          "body": "Serpent's Pass",
          "key": "${link_1}",
          "target": {
            "href": "Serpent%27s_Pass",
            "page": "Serpent%27s_Pass"
          }
        },
        {
          "body": "Combustion Man",
          "key": "${link_2}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        },
        {
          "body": "Full Moon Bay",
          "key": "${link_3}",
          "target": {
            "href": "Full_Moon_Bay",
            "page": "Full_Moon_Bay"
          }
        }
      ],
      "text": "Although Toph and Momo barely interacted, they did have a friendly relationship. She was also comfortable with letting him eat nuts out of her hand and ride away on her shoulder while training Aang. Momo did ride on her shoulder when they were traveling through the Serpent's Pass. Shortly before Team Avatar was attacked by Combustion Man, Momo was seen sleeping while curled up next to Toph. At the Full Moon Bay ferry station, when told animals were not allowed aboard the ferries, Toph readily claimed Momo to be her \"seeing-eye lemur\", thereby granting him the right to travel via ferry."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Suki",
          "key": "${link_1}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        }
      ],
      "text": "Toph and Suki."
    },
    {
      "body": "While navigating the Serpent's Pass, Aang, Katara, Sokka, Toph, and Suki, along with ${link_0} and his family, arrived at a section which was completely submerged underneath the water. Initially discouraged, the group was brought together as Katara instructed everyone to form a single-file line as she parted the water, allowing them to walk the path. Aang aided her in creating a bubble in which they could walk. Momo jumped into the water, seeking to catch fish when something large suddenly swam by. The bubble was burst by the ${link_1} and Toph was forced to earthbend the floor of the path above the waterline. The serpent circled them before showing itself, revealing the origin of the name, the \"Serpent's Pass\".",
      "links": [
        {
          "body": "Than",
          "key": "${link_0}",
          "target": {
            "href": "Than",
            "page": "Than"
          }
        },
        {
          "body": "creature",
          "key": "${link_1}",
          "target": {
            "href": "Serpent",
            "page": "Serpent"
          }
        }
      ],
      "text": "While navigating the Serpent's Pass, Aang, Katara, Sokka, Toph, and Suki, along with Than and his family, arrived at a section which was completely submerged underneath the water. Initially discouraged, the group was brought together as Katara instructed everyone to form a single-file line as she parted the water, allowing them to walk the path. Aang aided her in creating a bubble in which they could walk. Momo jumped into the water, seeking to catch fish when something large suddenly swam by. The bubble was burst by the creature and Toph was forced to earthbend the floor of the path above the waterline. The serpent circled them before showing itself, revealing the origin of the name, the \"Serpent's Pass\"."
    },
    {
      "body": "Aang told Katara to guide the others to safety while he distracted the serpent. Katara created an ice bridge for the others to cross before heading out to assist Aang. Sokka encouraged Toph to cross the ice, but midway through her progress along the bridge, the serpent smashed the pathway, sending Toph into the water. Sokka immediately alerted that he was coming for her and started to undress in order to swim out and save her but Suki was quicker and rescued Toph. Toph, however, thinking it was Sokka, kissed Suki after being brought to the surface. When she realized this, an embarrassed Toph said, \"You can go ahead and let me drown now.\"",
      "links": [],
      "text": "Aang told Katara to guide the others to safety while he distracted the serpent. Katara created an ice bridge for the others to cross before heading out to assist Aang. Sokka encouraged Toph to cross the ice, but midway through her progress along the bridge, the serpent smashed the pathway, sending Toph into the water. Sokka immediately alerted that he was coming for her and started to undress in order to swim out and save her but Suki was quicker and rescued Toph. Toph, however, thinking it was Sokka, kissed Suki after being brought to the surface. When she realized this, an embarrassed Toph said, \"You can go ahead and let me drown now.\""
    },
    {
      "body": "Suki, Toph and Sokka joined together in an attempt to prevent the Fire Nation airship fleet from destroying the Earth Kingdom. Suki was abruptly separated from the others during their mission, forcing Toph and Sokka to continue on their own. When it seemed like the end for Toph and Sokka, Suki arrived just in time to save them, piloting an airship and warding off the attacking firebenders.",
      "links": [],
      "text": "Suki, Toph and Sokka joined together in an attempt to prevent the Fire Nation airship fleet from destroying the Earth Kingdom. Suki was abruptly separated from the others during their mission, forcing Toph and Sokka to continue on their own. When it seemed like the end for Toph and Sokka, Suki arrived just in time to save them, piloting an airship and warding off the attacking firebenders."
    },
    {
      "body": "Suki, Sokka, and Toph journeyed to ${link_0}, where Aang had just defeated Ozai. Sokka and Toph each invented nicknames for Ozai like \"Loser Lord\" and \"Phoenix King of getting his butt whooped\", respectively. Suki tried her hand at the game but could only come up with \"King of the guys who don't win?\" Toph dismissively replied, \"Leave the nicknames to us, honey\".",
      "links": [
        {
          "body": "Wulong Forest",
          "key": "${link_0}",
          "target": {
            "href": "Wulong_Forest",
            "page": "Wulong_Forest"
          }
        }
      ],
      "text": "Suki, Sokka, and Toph journeyed to Wulong Forest, where Aang had just defeated Ozai. Sokka and Toph each invented nicknames for Ozai like \"Loser Lord\" and \"Phoenix King of getting his butt whooped\", respectively. Suki tried her hand at the game but could only come up with \"King of the guys who don't win?\" Toph dismissively replied, \"Leave the nicknames to us, honey\"."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "The Duke",
          "key": "${link_1}",
          "target": {
            "href": "The_Duke",
            "page": "The_Duke"
          }
        }
      ],
      "text": "Toph and The Duke."
    },
    {
      "body": "Toph had a friendly relationship with ${link_0}. The two met while Aang was still unconscious from Azula's attack. When the crew of a Fire Nation ship ambushed them soon after Aang's awakening, The Duke acted as Toph's seeing-eye guide so that she could fire boulders at the ship correctly. The Duke offered Toph his helmet in which she vomited when she became seasick from riding in a submarine during the invasion of the Fire Nation. At the ${link_1}, The Duke suggested looking for Toph after she disappeared from the group upon her meeting with Zuko. They were separated when Azula attacked the temple. At the end of the Hundred Year War, they reunited where The Duke hugged her, although Toph appeared to accept it with a great deal of surprise. Afterward they were sitting next to each other, The Duke on ${link_2}'s shoulders and Toph on ${link_3}'s shoulders. However, there is no indication she thought of him romantically in any way.",
      "links": [
        {
          "body": "The Duke",
          "key": "${link_0}",
          "target": {
            "href": "The_Duke",
            "page": "The_Duke"
          }
        },
        {
          "body": "Western Air Temple",
          "key": "${link_1}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        },
        {
          "body": "Pipsqueak",
          "key": "${link_2}",
          "target": {
            "href": "Pipsqueak",
            "page": "Pipsqueak"
          }
        },
        {
          "body": "The Big Bad Hippo",
          "key": "${link_3}",
          "target": {
            "href": "The_Big_Bad_Hippo",
            "page": "The_Big_Bad_Hippo"
          }
        }
      ],
      "text": "Toph had a friendly relationship with The Duke. The two met while Aang was still unconscious from Azula's attack. When the crew of a Fire Nation ship ambushed them soon after Aang's awakening, The Duke acted as Toph's seeing-eye guide so that she could fire boulders at the ship correctly. The Duke offered Toph his helmet in which she vomited when she became seasick from riding in a submarine during the invasion of the Fire Nation. At the Western Air Temple, The Duke suggested looking for Toph after she disappeared from the group upon her meeting with Zuko. They were separated when Azula attacked the temple. At the end of the Hundred Year War, they reunited where The Duke hugged her, although Toph appeared to accept it with a great deal of surprise. Afterward they were sitting next to each other, The Duke on Pipsqueak's shoulders and Toph on The Big Bad Hippo's shoulders. However, there is no indication she thought of him romantically in any way."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Toph and Zuko."
    },
    {
      "body": "Toph was the only one in the group, aside from Appa, who did not dismiss Zuko right away after he expressed his desire to join the team, scolding Aang, Katara and Sokka afterward for letting their hurt feelings cloud their judgment. She even went as far as to yell \"I'm beginning to wonder who is really the blind one around here!\" and storm off. She was also a realist, pointing out that, besides Zuko, there was no one else who could teach Aang firebending, stressing the prince's importance. At night, she secretly visited Zuko at his campsite; Zuko, assuming it was an enemy or a wild beast, accidentally burned her feet. This, however, did not deter her from accepting him and after he defended the group from Combustion Man, she let him join them under the pretext that it would give her plenty of opportunities to get back at him for burning her feet.",
      "links": [],
      "text": "Toph was the only one in the group, aside from Appa, who did not dismiss Zuko right away after he expressed his desire to join the team, scolding Aang, Katara and Sokka afterward for letting their hurt feelings cloud their judgment. She even went as far as to yell \"I'm beginning to wonder who is really the blind one around here!\" and storm off. She was also a realist, pointing out that, besides Zuko, there was no one else who could teach Aang firebending, stressing the prince's importance. At night, she secretly visited Zuko at his campsite; Zuko, assuming it was an enemy or a wild beast, accidentally burned her feet. This, however, did not deter her from accepting him and after he defended the group from Combustion Man, she let him join them under the pretext that it would give her plenty of opportunities to get back at him for burning her feet."
    },
    {
      "body": "Unlike Sokka and Katara, Toph gave helpful advice to Zuko when his firebending became weaker, by suggesting that he relearn firebending directly from the ${link_0}.",
      "links": [
        {
          "body": "original source",
          "key": "${link_0}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        }
      ],
      "text": "Unlike Sokka and Katara, Toph gave helpful advice to Zuko when his firebending became weaker, by suggesting that he relearn firebending directly from the original source."
    },
    {
      "body": "When Aang disappeared prior to the arrival of Sozin's Comet, Toph grabbed Zuko's arm and insisted that she join him during their search for Aang, stating it was her turn for a \"life-changing trip\" with him; Zuko blushed at the sudden act. Toph took this field trip as her chance to tell him about her life-story and her troubles at home, in hopes of having a \"life-changing\" experience via opening up to her friend; however, much to Toph's chagrin, Zuko brushed her off as well as he could without hurting her feelings, as he was more occupied with finding Aang. Despite this, Toph and Zuko still remained friends after the end of the war; they were seen in Ba Sing Se at Iroh's ${link_0} with the rest of the gang.",
      "links": [
        {
          "body": "tea shop",
          "key": "${link_0}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "text": "When Aang disappeared prior to the arrival of Sozin's Comet, Toph grabbed Zuko's arm and insisted that she join him during their search for Aang, stating it was her turn for a \"life-changing trip\" with him; Zuko blushed at the sudden act. Toph took this field trip as her chance to tell him about her life-story and her troubles at home, in hopes of having a \"life-changing\" experience via opening up to her friend; however, much to Toph's chagrin, Zuko brushed her off as well as he could without hurting her feelings, as he was more occupied with finding Aang. Despite this, Toph and Zuko still remained friends after the end of the war; they were seen in Ba Sing Se at Iroh's tea shop with the rest of the gang."
    },
    {
      "body": "${link_0}.",
      "links": [
        {
          "body": "Ho Tun",
          "key": "${link_0}",
          "target": {
            "href": "Ho_Tun",
            "page": "Ho_Tun"
          }
        }
      ],
      "text": "Ho Tun."
    },
    {
      "body": "${link_0} was the last of the three initial students who are first seen enrolled in Toph's metalbending academy. Though he was the oldest of her students, the possible advantage of experience due to age seems to have been erased in his case by the fearful attitude in which he went about life; of all of Toph's students, he seemed to find her the most imposing, fearfully calling her \"Sifu Toph\" when \"corrected\" by her for being distracted by the events in Yu Dao. Perhaps the most accurately, Toph labeled Ho Tun a \"lily liver\" just as she did to her other first three students.",
      "links": [
        {
          "body": "Ho Tun",
          "key": "${link_0}",
          "target": {
            "href": "Ho_Tun",
            "page": "Ho_Tun"
          }
        }
      ],
      "text": "Ho Tun was the last of the three initial students who are first seen enrolled in Toph's metalbending academy. Though he was the oldest of her students, the possible advantage of experience due to age seems to have been erased in his case by the fearful attitude in which he went about life; of all of Toph's students, he seemed to find her the most imposing, fearfully calling her \"Sifu Toph\" when \"corrected\" by her for being distracted by the events in Yu Dao. Perhaps the most accurately, Toph labeled Ho Tun a \"lily liver\" just as she did to her other first three students."
    },
    {
      "body": "Along with ${link_0} and ${link_1}, Ho Tun was caught leaving the school just as Toph returned from her excursion with Team Avatar. He cowered behind Penga as Toph threatened the three of them with extreme corporeal punishment, whining as he did so about how doomed they all were. Upon being introduced to Sokka by his teacher, he implored the ${link_2} ${link_3} to save them from their doom.",
      "links": [
        {
          "body": "Penga",
          "key": "${link_0}",
          "target": {
            "href": "Penga",
            "page": "Penga"
          }
        },
        {
          "body": "The Dark One",
          "key": "${link_1}",
          "target": {
            "href": "The_Dark_One",
            "page": "The_Dark_One"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "warrior",
          "key": "${link_3}",
          "target": {
            "href": "Military_of_the_Water_Tribe",
            "page": "Military_of_the_Water_Tribe"
          }
        }
      ],
      "text": "Along with Penga and The Dark One, Ho Tun was caught leaving the school just as Toph returned from her excursion with Team Avatar. He cowered behind Penga as Toph threatened the three of them with extreme corporeal punishment, whining as he did so about how doomed they all were. Upon being introduced to Sokka by his teacher, he implored the Southern Water Tribe warrior to save them from their doom."
    },
    {
      "body": "${link_0}.",
      "links": [
        {
          "body": "Penga",
          "key": "${link_0}",
          "target": {
            "href": "Penga",
            "page": "Penga"
          }
        }
      ],
      "text": "Penga."
    },
    {
      "body": "Penga was enrolled in the Beifong Metalbending Academy near Yu Dao sometime after the Hundred Year War. She was the youngest of Toph's initial students, and desired to go with her when the blind earthbender left to greet the rest of Team Avatar on Appa; Toph, however, told her to stay put and work on her forms along with the other two students, threatening that they were \"really gonna get it\" if she found out that they had not when she returned. Along with the others, Penga was routinely called a \"lily liver\" by Toph, even when she was not present.",
      "links": [],
      "text": "Penga was enrolled in the Beifong Metalbending Academy near Yu Dao sometime after the Hundred Year War. She was the youngest of Toph's initial students, and desired to go with her when the blind earthbender left to greet the rest of Team Avatar on Appa; Toph, however, told her to stay put and work on her forms along with the other two students, threatening that they were \"really gonna get it\" if she found out that they had not when she returned. Along with the others, Penga was routinely called a \"lily liver\" by Toph, even when she was not present."
    },
    {
      "body": "Penga was unlucky enough to be caught leaving the school with The Dark One and Ho Tun just as Toph had arrived back at the school with Sokka in tow, something which \"Sifu Toph\" reacted to by threatening the whole group that she would hurt them so bad that they would not remember what day of the week it was. Despite her obvious fear of repercussions from the older girl, Penga remained distractable enough to be curious about who Toph had brought along with her. This caused Toph to stop threatening her students long enough to introduce them to Sokka and Sokka to them, taking long enough for Penga to develop a parallel crush on Sokka, as revealed by the hearts in her eyes as she remarked about large his biceps were.",
      "links": [],
      "text": "Penga was unlucky enough to be caught leaving the school with The Dark One and Ho Tun just as Toph had arrived back at the school with Sokka in tow, something which \"Sifu Toph\" reacted to by threatening the whole group that she would hurt them so bad that they would not remember what day of the week it was. Despite her obvious fear of repercussions from the older girl, Penga remained distractable enough to be curious about who Toph had brought along with her. This caused Toph to stop threatening her students long enough to introduce them to Sokka and Sokka to them, taking long enough for Penga to develop a parallel crush on Sokka, as revealed by the hearts in her eyes as she remarked about large his biceps were."
    },
    {
      "body": "${link_0}.",
      "links": [
        {
          "body": "The Dark One",
          "key": "${link_0}",
          "target": {
            "href": "The_Dark_One",
            "page": "The_Dark_One"
          }
        }
      ],
      "text": "The Dark One."
    },
    {
      "body": "The Dark One was also enrolled in Toph's metalbending academy sometime after the Hundred Year War. Closest of the initial students in age to Toph, he does not seem to respect her any more than he respected his fellow students, judging by his grudging look when Toph \"corrected\" her students for looking out of the window when they were supposed to have been metalbending. Despite his apparent ego, Toph labeled him as a \"lily liver\" along with the others, even when she was simply speaking about them in conversation with the rest of Team Avatar.",
      "links": [],
      "text": "The Dark One was also enrolled in Toph's metalbending academy sometime after the Hundred Year War. Closest of the initial students in age to Toph, he does not seem to respect her any more than he respected his fellow students, judging by his grudging look when Toph \"corrected\" her students for looking out of the window when they were supposed to have been metalbending. Despite his apparent ego, Toph labeled him as a \"lily liver\" along with the others, even when she was simply speaking about them in conversation with the rest of Team Avatar."
    },
    {
      "body": "Along with Penga and Ho Tun, The Dark One was caught leaving the school when Toph returned to the academy with Sokka. Looking worried at her threats of extreme punishment for leaving the school when she had told them to stay put while she was away, he still showed the same general lack of respect for his teacher by interrupting her when she was introducing him and his fellow students to Sokka so that she would not inadvertently give away his real name.",
      "links": [],
      "text": "Along with Penga and Ho Tun, The Dark One was caught leaving the school when Toph returned to the academy with Sokka. Looking worried at her threats of extreme punishment for leaving the school when she had told them to stay put while she was away, he still showed the same general lack of respect for his teacher by interrupting her when she was introducing him and his fellow students to Sokka so that she would not inadvertently give away his real name."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Toph and Azula."
    },
    {
      "body": "Azula was an indirect enemy of Toph. Since her main goal was to capture Aang, she considered Toph as more of an obstacle to her trophy, rather than a true enemy. Like Sokka, Toph never had a direct battle with the princess with the exception of the ${link_0}. She, along with Team Avatar, was often forced to dodge the attacks of Azula and her allies throughout the Earth Kingdom until the events in the ${link_1} underground bunker. She and Aang both attempted to land a blow to her, though Azula proved to be a formidable foe even without her firebending power. Toph's aggression toward Azula also clouded her realization that Azula was simply stalling the team until the eclipse ended. Although Sokka was able to see through her ruse, Toph was still baited by Azula following the princess' nasty joke toward her blindness. Sokka did not keep a level head, allowing Azula to prompt him into attack her. She prepared to injure Sokka with a concealed shuriken-knife only for Toph to intervene, pinning Azula to the wall and ultimately saving Sokka from serious harm.",
      "links": [
        {
          "body": "duel at Tu Zin",
          "key": "${link_0}",
          "target": {
            "href": "Confrontation_at_Tu_Zin",
            "page": "Confrontation_at_Tu_Zin"
          }
        },
        {
          "body": "Fire Nation Capital's",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        }
      ],
      "text": "Azula was an indirect enemy of Toph. Since her main goal was to capture Aang, she considered Toph as more of an obstacle to her trophy, rather than a true enemy. Like Sokka, Toph never had a direct battle with the princess with the exception of the duel at Tu Zin. She, along with Team Avatar, was often forced to dodge the attacks of Azula and her allies throughout the Earth Kingdom until the events in the Fire Nation Capital's underground bunker. She and Aang both attempted to land a blow to her, though Azula proved to be a formidable foe even without her firebending power. Toph's aggression toward Azula also clouded her realization that Azula was simply stalling the team until the eclipse ended. Although Sokka was able to see through her ruse, Toph was still baited by Azula following the princess' nasty joke toward her blindness. Sokka did not keep a level head, allowing Azula to prompt him into attack her. She prepared to injure Sokka with a concealed shuriken-knife only for Toph to intervene, pinning Azula to the wall and ultimately saving Sokka from serious harm."
    },
    {
      "body": "Toph and Azula indirectly met for the last time at the Western Air Temple. The two did not meet again, as Azula was defeated by Katara during the passing of Sozin's Comet.",
      "links": [],
      "text": "Toph and Azula indirectly met for the last time at the Western Air Temple. The two did not meet again, as Azula was defeated by Katara during the passing of Sozin's Comet."
    },
    {
      "body": "Although Toph chose to live in seclusion in the Foggy Swamp, she kept an eye on the world through the vines, learning of how Kuvira had taken over the Earth Kingdom. She was not fond of the metalbender's actions, as she denounced Bolin as a \"dipstick\" for having been involved with Kuvira. After having saved her youngest daughter and her family from their imprisonment at the hand of Kuvira, Toph openly declared Kuvira to give metalbenders a bad name.",
      "links": [],
      "text": "Although Toph chose to live in seclusion in the Foggy Swamp, she kept an eye on the world through the vines, learning of how Kuvira had taken over the Earth Kingdom. She was not fond of the metalbender's actions, as she denounced Bolin as a \"dipstick\" for having been involved with Kuvira. After having saved her youngest daughter and her family from their imprisonment at the hand of Kuvira, Toph openly declared Kuvira to give metalbenders a bad name."
    },
    {
      "body": "${link_0}, ${link_1}, and ${link_2}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_2}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        }
      ],
      "text": "Toph, Katara, and Long Feng."
    },
    {
      "body": "Toph and ${link_0} first met when she and Katara were attempting to sneak into ${link_1}'s party so they could talk to the Earth King. In order to gain entrance into the party, they told Long Feng their parents were waiting for them and that they had lost their invitations. Long Feng permitted them to enter, but quickly apprehended Toph and the rest of Team Avatar. Following his apprehension, he strictly warns them to no longer interfere with his ${link_2}, or else they will be expelled from the city. The team listened to him at first, but soon defied his orders by infiltrating his secret headquarters underneath Lake Laogai and later invading the ${link_3} where they informed ${link_4} of the conspiracy, resulting in Long Feng's arrest. Toph greatly despised the former Grand Secretariat, not only for his reprehensible actions toward her and her friends, but also because he represented the controlling and repressive lifestyle she despised.",
      "links": [
        {
          "body": "Long Feng",
          "key": "${link_0}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        },
        {
          "body": "Bosco",
          "key": "${link_1}",
          "target": {
            "href": "Bosco",
            "page": "Bosco"
          }
        },
        {
          "body": "conspiracy",
          "key": "${link_2}",
          "target": {
            "href": "Conspiracy_of_Ba_Sing_Se",
            "page": "Conspiracy_of_Ba_Sing_Se"
          }
        },
        {
          "body": "palace",
          "key": "${link_3}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        },
        {
          "body": "Kuei",
          "key": "${link_4}",
          "target": {
            "href": "Kuei",
            "page": "Kuei"
          }
        }
      ],
      "text": "Toph and Long Feng first met when she and Katara were attempting to sneak into Bosco's party so they could talk to the Earth King. In order to gain entrance into the party, they told Long Feng their parents were waiting for them and that they had lost their invitations. Long Feng permitted them to enter, but quickly apprehended Toph and the rest of Team Avatar. Following his apprehension, he strictly warns them to no longer interfere with his conspiracy, or else they will be expelled from the city. The team listened to him at first, but soon defied his orders by infiltrating his secret headquarters underneath Lake Laogai and later invading the palace where they informed Kuei of the conspiracy, resulting in Long Feng's arrest. Toph greatly despised the former Grand Secretariat, not only for his reprehensible actions toward her and her friends, but also because he represented the controlling and repressive lifestyle she despised."
    },
    {
      "body": "Master ${link_0} was a firebending master who maintained a school near Yu Dao, which Toph took over for the Beifong Metalbending Academy. Kunyo and his students returned after Zuko withdrew his support for the Harmony Restoration movement and demanded to have his school returned to him; he himself held extremely little respect for Toph as he viewed non-Fire Nation people as racially inferior. After humiliating him with some metalbending, Toph agreed to a contest between their students, in which the first master who was forced to sit down would have to leave the school forever. The lack of the progress of Toph's students led her to believe that they would not succeed, and she went to face Kunyo and forfeit their competition. However, the belief she had expressed in her students proved to be the motivation they needed to unlock their metalbending potential, and Kunyo and his students were subsequently defeated by the metalbenders, sending them packing.",
      "links": [
        {
          "body": "Kunyo",
          "key": "${link_0}",
          "target": {
            "href": "Kunyo",
            "page": "Kunyo"
          }
        }
      ],
      "text": "Master Kunyo was a firebending master who maintained a school near Yu Dao, which Toph took over for the Beifong Metalbending Academy. Kunyo and his students returned after Zuko withdrew his support for the Harmony Restoration movement and demanded to have his school returned to him; he himself held extremely little respect for Toph as he viewed non-Fire Nation people as racially inferior. After humiliating him with some metalbending, Toph agreed to a contest between their students, in which the first master who was forced to sit down would have to leave the school forever. The lack of the progress of Toph's students led her to believe that they would not succeed, and she went to face Kunyo and forfeit their competition. However, the belief she had expressed in her students proved to be the motivation they needed to unlock their metalbending potential, and Kunyo and his students were subsequently defeated by the metalbenders, sending them packing."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Yu",
          "key": "${link_1}",
          "target": {
            "href": "Yu",
            "page": "Yu"
          }
        }
      ],
      "text": "Toph and Yu."
    },
    {
      "body": "Unlike Xin Fu, ${link_0} and Toph seemed to have a more interactive relationship. When Toph was discovered to have earthbending abilities, her parents hired Yu as her master, giving her private lessons in which she was only allowed to be taught basic forms and breathing exercises, despite Toph's already perfect mastery over those techniques. At first, Yu seemed to be an ally, traveling with Lao Beifong to recover Toph from Xin Fu, wherein he watched her defeat the other benders with ease. Yu would, however, prove to be an enemy in the long run, quickly accepting Lao's monetary bribe to forcibly bring Toph back, as Lao thought Toph had been kidnapped by the Avatar. He was, however, considerably less hostile toward Toph than Xin Fu. He and Xin Fu captured her in Ba Sing Se, though she was able to escape from the metal box in which she was contained by teaching herself metalbending, trapping Yu and Xin Fu within the box in the process.",
      "links": [
        {
          "body": "Yu",
          "key": "${link_0}",
          "target": {
            "href": "Yu",
            "page": "Yu"
          }
        }
      ],
      "text": "Unlike Xin Fu, Yu and Toph seemed to have a more interactive relationship. When Toph was discovered to have earthbending abilities, her parents hired Yu as her master, giving her private lessons in which she was only allowed to be taught basic forms and breathing exercises, despite Toph's already perfect mastery over those techniques. At first, Yu seemed to be an ally, traveling with Lao Beifong to recover Toph from Xin Fu, wherein he watched her defeat the other benders with ease. Yu would, however, prove to be an enemy in the long run, quickly accepting Lao's monetary bribe to forcibly bring Toph back, as Lao thought Toph had been kidnapped by the Avatar. He was, however, considerably less hostile toward Toph than Xin Fu. He and Xin Fu captured her in Ba Sing Se, though she was able to escape from the metal box in which she was contained by teaching herself metalbending, trapping Yu and Xin Fu within the box in the process."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_1}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Toph and Ozai."
    },
    {
      "body": "Toph was the one who volunteered to teach Aang earthbending so that he could use it to defeat Ozai when confronting his archenemy. Toph along with Sokka and Suki infiltrated and stowed aboard one airship by means of using it as a decoy to demolish the rest of the airships in mid-air. At Suki's comment about the beauty of the comet, Toph said it was too bad that Ozai was going to use it to destroy the world.",
      "links": [],
      "text": "Toph was the one who volunteered to teach Aang earthbending so that he could use it to defeat Ozai when confronting his archenemy. Toph along with Sokka and Suki infiltrated and stowed aboard one airship by means of using it as a decoy to demolish the rest of the airships in mid-air. At Suki's comment about the beauty of the comet, Toph said it was too bad that Ozai was going to use it to destroy the world."
    },
    {
      "body": "In the aftermath of the battle, Toph briefly met Ozai directly after Aang defeated him. After learning he had lost his bending, Toph and Sokka immediately seized their chance to mock Ozai, who stood up in futile anger and called himself \"the Phoenix King\", but merely fell back to the ground exhausted and semi-conscious.",
      "links": [],
      "text": "In the aftermath of the battle, Toph briefly met Ozai directly after Aang defeated him. After learning he had lost his bending, Toph and Sokka immediately seized their chance to mock Ozai, who stood up in futile anger and called himself \"the Phoenix King\", but merely fell back to the ground exhausted and semi-conscious."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Xin Fu",
          "key": "${link_1}",
          "target": {
            "href": "Xin_Fu",
            "page": "Xin_Fu"
          }
        }
      ],
      "text": "Toph and Xin Fu."
    },
    {
      "body": "Xin Fu and Toph did not have a very well defined relationship for most of their history together, as he was limited to being an Earth Rumble VI host, whereas Toph competed and showed her prowess as an earthbender. Xin Fu apparently had known or discovered her true identity, as he was able to locate her in the Beifong Estate, while most people only knew Toph as The Blind Bandit. The two had a formal scuffle under the ring after Toph defeated all the other opponents. In a short matter of time, Toph easily defeated Xin Fu. Later that day, after Toph ran away with Team Avatar, Lao Beifong appointed Xin Fu and Yu as bounty hunters to bring Toph home.",
      "links": [],
      "text": "Xin Fu and Toph did not have a very well defined relationship for most of their history together, as he was limited to being an Earth Rumble VI host, whereas Toph competed and showed her prowess as an earthbender. Xin Fu apparently had known or discovered her true identity, as he was able to locate her in the Beifong Estate, while most people only knew Toph as The Blind Bandit. The two had a formal scuffle under the ring after Toph defeated all the other opponents. In a short matter of time, Toph easily defeated Xin Fu. Later that day, after Toph ran away with Team Avatar, Lao Beifong appointed Xin Fu and Yu as bounty hunters to bring Toph home."
    },
    {
      "body": "The two men traveled throughout the Earth Kingdom and eventually to Ba Sing Se, where they finally caught her by setting a trap. As they escorted Toph back to her home, Xin Fu reminded Toph that her earthbending skills are rendered useless because she was within in a metal container. Toph, however, taught herself the unique ability of metalbending, allowing her to escape imprisonment; she subsequently trapped Xin Fu and Yu within the box.",
      "links": [],
      "text": "The two men traveled throughout the Earth Kingdom and eventually to Ba Sing Se, where they finally caught her by setting a trap. As they escorted Toph back to her home, Xin Fu reminded Toph that her earthbending skills are rendered useless because she was within in a metal container. Toph, however, taught herself the unique ability of metalbending, allowing her to escape imprisonment; she subsequently trapped Xin Fu and Yu within the box."
    },
    {
      "body": "${link_0} and ${link_1}.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Yakone",
          "key": "${link_1}",
          "target": {
            "href": "Yakone",
            "page": "Yakone"
          }
        }
      ],
      "text": "Toph and Yakone."
    },
    {
      "body": "In 128 AG, Toph arrested Yakone on account of several witnesses claiming that he ruled a crime empire by ${link_0} during the day. As ${link_1} at the time, she clearly showed the crime lord that she despised him for his illegal actions. Therefore, she arrested him full of satisfaction. Toph was also present with her force at his ${link_2}, and watched as the ${link_3} decided he was guilty because of the high number of witnesses. After being sentenced for life, Yakone bloodbent everyone in the room, and dragged Toph forward to unlock his chains to her greatest dismay. He used bloodbending to knock out everyone in the room, including Toph.",
      "links": [
        {
          "body": "bloodbending",
          "key": "${link_0}",
          "target": {
            "href": "Bloodbending",
            "page": "Bloodbending"
          }
        },
        {
          "body": "Chief of Police",
          "key": "${link_1}",
          "target": {
            "href": "Chief_of_Police",
            "page": "Chief_of_Police"
          }
        },
        {
          "body": "trial",
          "key": "${link_2}",
          "target": {
            "href": "Yakone%27s_trial",
            "page": "Yakone%27s_trial"
          }
        },
        {
          "body": "United Republic Council",
          "key": "${link_3}",
          "target": {
            "href": "United_Republic_Council",
            "page": "United_Republic_Council"
          }
        }
      ],
      "text": "In 128 AG, Toph arrested Yakone on account of several witnesses claiming that he ruled a crime empire by bloodbending during the day. As Chief of Police at the time, she clearly showed the crime lord that she despised him for his illegal actions. Therefore, she arrested him full of satisfaction. Toph was also present with her force at his trial, and watched as the United Republic Council decided he was guilty because of the high number of witnesses. After being sentenced for life, Yakone bloodbent everyone in the room, and dragged Toph forward to unlock his chains to her greatest dismay. He used bloodbending to knock out everyone in the room, including Toph."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Toph_Beifong%27s_relationships",
    "file": "avatar.wikia.com/wiki/Toph_Beifong's_relationships.html",
    "page": "Toph_Beifong's_relationships",
    "title": "Toph Beifong's relationships"
  }
}