{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Interviews",
      "target": {
        "href": "Category_Interviews",
        "page": "Category_Interviews"
      }
    },
    {
      "body": "Real world",
      "target": {
        "href": "Category_Real_world",
        "page": "Category_Real_world"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "",
      "links": [],
      "text": ""
    },
    {
      "body": "So while this is all going on, my youngest child is watching a show on Nickelodeon, and she's totally into it – totally into it. And in classic parenting style, I did not pay any attention to what she is watching. One day my mom came over to baby-sit – I remember this moment specifically cause it was in the house we lived in before. She was baby-sitting, we were going out to dinner, and she starting watching this show that she (the daughter) is obsessed with, with her. My mom calls me from the family room and is like; this has Hindu philosophies in it! [In another comical Indian voice.] and I'm all like; \"great, Mom ... thanks. We'll be back, we'll be back.\" We take off and there's this movement going on in the house and I'm not really paying attention to it still. And then there's the request for a Katara costume for Halloween, and I'm like \"Who's Katara? What is this?\" I remember in my office we were looking it up; I type in 'Katara' and see it's a cartoon, and then still paying no attention to it in the big scheme of things.",
      "links": [],
      "text": "So while this is all going on, my youngest child is watching a show on Nickelodeon, and she's totally into it – totally into it. And in classic parenting style, I did not pay any attention to what she is watching. One day my mom came over to baby-sit – I remember this moment specifically cause it was in the house we lived in before. She was baby-sitting, we were going out to dinner, and she starting watching this show that she (the daughter) is obsessed with, with her. My mom calls me from the family room and is like; this has Hindu philosophies in it! [In another comical Indian voice.] and I'm all like; \"great, Mom ... thanks. We'll be back, we'll be back.\" We take off and there's this movement going on in the house and I'm not really paying attention to it still. And then there's the request for a Katara costume for Halloween, and I'm like \"Who's Katara? What is this?\" I remember in my office we were looking it up; I type in 'Katara' and see it's a cartoon, and then still paying no attention to it in the big scheme of things."
    },
    {
      "body": "Meanwhile, there's the plotline of me having conversations about these other franchises and it not working out while this other little thing is happening – ya know, if this is how I would structure it. Then we went out to go get some books, and this store they were selling DVD's and books. The first season of this show was there, and my daughter was like; \"can we get it? Can we get it?!\" and I'm like \"Okay, we'll get it, we'll get it.\" We didn't have anything to do that afternoon, it was a Sunday – so we all went down in the theater. At the time we only had the four of us, but now we have another child. So the four of us went down into the movie theater and watched the first episode, and we were like; \"this is cool, this is cool. All right we'll watch another one ...\" and we put another one on ... and another one, and another one. And literally the whole day went by. It went from daylight to darkness while we were in there, and we go \"my god, we gotta feed these children! We gotta eat!\"",
      "links": [],
      "text": "Meanwhile, there's the plotline of me having conversations about these other franchises and it not working out while this other little thing is happening – ya know, if this is how I would structure it. Then we went out to go get some books, and this store they were selling DVD's and books. The first season of this show was there, and my daughter was like; \"can we get it? Can we get it?!\" and I'm like \"Okay, we'll get it, we'll get it.\" We didn't have anything to do that afternoon, it was a Sunday – so we all went down in the theater. At the time we only had the four of us, but now we have another child. So the four of us went down into the movie theater and watched the first episode, and we were like; \"this is cool, this is cool. All right we'll watch another one ...\" and we put another one on ... and another one, and another one. And literally the whole day went by. It went from daylight to darkness while we were in there, and we go \"my god, we gotta feed these children! We gotta eat!\""
    },
    {
      "body": "When I was thinking about it, I was thinking it was so weird because it has everything that I love. I study martial arts; I've been studying Kempo for a decade. Obviously I study spirituality of all kinds. I was in a Hindu family, but I am hugely Buddhist in influence. So everything was there. I have to go visit monasteries in France, the whole thing, I'm totally into it! There's that, and then martial arts movie background. Everything about it was just so interesting to me. I've never done a CGI movie because my storytelling is so much about humanity. I love the dinner table scene, but everybody else get scared of the dinner table scene in a movie cause the movie will stop – I love it! Like Signs, it's all built around the dinner table scene: their last supper together. I love it. If it's in a room, I got it. It's the end of the world? We'll just see it on the TV. The whole technical part of it got in the way of how I can think really cleanly and clearly, and tell my voice. Well, in this, when we were watching I thought it was really cool because what they're doing with the elements is related to their emotions and philosophy. And as you can tell from the movies I've made recently, I'm very into nature vs. man kind of questions. So the idea of the struggle with the balance between nature, and the connective-ness to nature was really cool.",
      "links": [],
      "text": "When I was thinking about it, I was thinking it was so weird because it has everything that I love. I study martial arts; I've been studying Kempo for a decade. Obviously I study spirituality of all kinds. I was in a Hindu family, but I am hugely Buddhist in influence. So everything was there. I have to go visit monasteries in France, the whole thing, I'm totally into it! There's that, and then martial arts movie background. Everything about it was just so interesting to me. I've never done a CGI movie because my storytelling is so much about humanity. I love the dinner table scene, but everybody else get scared of the dinner table scene in a movie cause the movie will stop – I love it! Like Signs, it's all built around the dinner table scene: their last supper together. I love it. If it's in a room, I got it. It's the end of the world? We'll just see it on the TV. The whole technical part of it got in the way of how I can think really cleanly and clearly, and tell my voice. Well, in this, when we were watching I thought it was really cool because what they're doing with the elements is related to their emotions and philosophy. And as you can tell from the movies I've made recently, I'm very into nature vs. man kind of questions. So the idea of the struggle with the balance between nature, and the connective-ness to nature was really cool."
    },
    {
      "body": "So, we leave the theater and go up to get some food. Everybody's over in the kitchen and I open the fridge up and just stop and I was like: \"This would make a great movie!\" and the whole house erupted. I was serious. My wife, who basically if I said I retire today would be the happiest in the world, was like \"you have to make this! This is it! This is the movie you've been waiting to make. This is you, this is so you.\" \"Calm down, take it easy!\" Everybody was just like hyped. The kids were so worried was going to say no. But I was like \"I'm gonna find out who owns this and find out what's going on.\" And my wife was like \"you gotta call right now!\" \"It's Sunday night! I'm sure it can wait til tomorrow morning.\" So I slept on it and brought it to the o-ffice. I said how this is really cool, and I think I could see me in this. So I called up Paramount and chairman Brad Grey and asked him to come to New York. I was very cryptic about the whole thing. \"What is it about? You wanna make a movie?!\" \"Yeah, let's just talk.\" So he came and I said \"Look, you have on the Nickelodeon station this show that I think is Star Wars. I would love to make this movie for you.\" He went and checked it out, and we had another meeting in L.A. and he was like: \"go make it!\"",
      "links": [],
      "text": "So, we leave the theater and go up to get some food. Everybody's over in the kitchen and I open the fridge up and just stop and I was like: \"This would make a great movie!\" and the whole house erupted. I was serious. My wife, who basically if I said I retire today would be the happiest in the world, was like \"you have to make this! This is it! This is the movie you've been waiting to make. This is you, this is so you.\" \"Calm down, take it easy!\" Everybody was just like hyped. The kids were so worried was going to say no. But I was like \"I'm gonna find out who owns this and find out what's going on.\" And my wife was like \"you gotta call right now!\" \"It's Sunday night! I'm sure it can wait til tomorrow morning.\" So I slept on it and brought it to the o-ffice. I said how this is really cool, and I think I could see me in this. So I called up Paramount and chairman Brad Grey and asked him to come to New York. I was very cryptic about the whole thing. \"What is it about? You wanna make a movie?!\" \"Yeah, let's just talk.\" So he came and I said \"Look, you have on the Nickelodeon station this show that I think is Star Wars. I would love to make this movie for you.\" He went and checked it out, and we had another meeting in L.A. and he was like: \"go make it!\""
    },
    {
      "body": "I thought out of all of the elements air would be the most difficult, but we came to the realization that air has no inherent qualities – it's just whatever environment you're in. If you're in a snow environment, it starts moving snow. If you're in a dirt environment, it starts movie dirt. You just have to keep it translucent enough so you know that it's not another element, but the element of air. So there was a careful analysis of each element, and ILM would start to do tests for me and show me different things. Water I really felt like I wanted it to be like when I saw stuff from astronauts when they'd open up a Gatorade bottle and it stays connected, but it's kind of moving. And they touch it and it starts moving again. That was the basis of water; I wanted the water to look it was in zero-g. So they went under those kind of principles. ILM has a huge amount of experience with water in particular. I really like some of the stuff they did with the 3rd Pirates and the whirlwind of water as the boats are going down. They have a huge amount of experience. They were the first ones that started this stuff with The Perfect Storm. So it was a real long process, but super, super exciting. Each and every time it had to be a combination of what the character was doing and at any time, nothing could look the same. It was wasn't like you could do waterbending twice and make it look the same. And that was the thing, I think, when the burden of what went to such a high level. They would come up with one way effectively, and I was like \"Great, now come up with eighty more!\" – because nobody does it the same way. That was the fun thing for me because I got to express character through CGI. Then I could really talk to the animators and say \"Katara isn't skilled yet, so it should be very fragmentary with things falling off the edges.\" I could talk in character like that. Or \"This person is angry\" and so on.",
      "links": [],
      "text": "I thought out of all of the elements air would be the most difficult, but we came to the realization that air has no inherent qualities – it's just whatever environment you're in. If you're in a snow environment, it starts moving snow. If you're in a dirt environment, it starts movie dirt. You just have to keep it translucent enough so you know that it's not another element, but the element of air. So there was a careful analysis of each element, and ILM would start to do tests for me and show me different things. Water I really felt like I wanted it to be like when I saw stuff from astronauts when they'd open up a Gatorade bottle and it stays connected, but it's kind of moving. And they touch it and it starts moving again. That was the basis of water; I wanted the water to look it was in zero-g. So they went under those kind of principles. ILM has a huge amount of experience with water in particular. I really like some of the stuff they did with the 3rd Pirates and the whirlwind of water as the boats are going down. They have a huge amount of experience. They were the first ones that started this stuff with The Perfect Storm. So it was a real long process, but super, super exciting. Each and every time it had to be a combination of what the character was doing and at any time, nothing could look the same. It was wasn't like you could do waterbending twice and make it look the same. And that was the thing, I think, when the burden of what went to such a high level. They would come up with one way effectively, and I was like \"Great, now come up with eighty more!\" – because nobody does it the same way. That was the fun thing for me because I got to express character through CGI. Then I could really talk to the animators and say \"Katara isn't skilled yet, so it should be very fragmentary with things falling off the edges.\" I could talk in character like that. Or \"This person is angry\" and so on."
    },
    {
      "body": "Then talking about physics, ya know, I just don't believe moving from A to B can be that fast, and all of those wonderful conversations that we've had for two years now. My big fear was that whatever was in my head would look, at the end of the day, cheesy. That after I guided all of these amazing people for two years, we'd look at it and go [Makes an 'uh-oh' face.] Luckily that hasn't been the case. I've been so excited about what we've seen. I love going to watch the new footage every day. I think in the movie there is – if you count every little thing like: they have to put a background in the corner frame because there is a little bit of set you see – I think there are four hundred CGI shots. Which, for a movie of this scale, is very, very little. To give you an example of another film, Temple of Doom would have two thousand. That's also because I have very long shots. So with the Pakku shot, you just stay with the Pakku shot. And of course ILM just hates that because you're just starring at the CGI for so long. \"You should be cutting for distraction\" – \"Not on this one, you're just going to have to make it look real good.\"",
      "links": [],
      "text": "Then talking about physics, ya know, I just don't believe moving from A to B can be that fast, and all of those wonderful conversations that we've had for two years now. My big fear was that whatever was in my head would look, at the end of the day, cheesy. That after I guided all of these amazing people for two years, we'd look at it and go [Makes an 'uh-oh' face.] Luckily that hasn't been the case. I've been so excited about what we've seen. I love going to watch the new footage every day. I think in the movie there is – if you count every little thing like: they have to put a background in the corner frame because there is a little bit of set you see – I think there are four hundred CGI shots. Which, for a movie of this scale, is very, very little. To give you an example of another film, Temple of Doom would have two thousand. That's also because I have very long shots. So with the Pakku shot, you just stay with the Pakku shot. And of course ILM just hates that because you're just starring at the CGI for so long. \"You should be cutting for distraction\" – \"Not on this one, you're just going to have to make it look real good.\""
    },
    {
      "body": "Even on Nickelodeon, and even on that show, the comedy is broad at times. And then you have episodes like \"The Blue Spirit\" episode, I think it's 13 from the first season, which is all edgy. Straight up, I literally I picked episode 13 and put it in the movie. I just literally picked it up and put it in the movie. But from the first season and first episode, you're just picking and choosing really delicately how to maintain it. I've actually written a second draft of the second movie, and it's so much older. It's so much edgier and older. That's what they were naturally having to do because the kids are 12/14 at the beginning and they just keep on growing and getting more mature. It just naturally moves that way. Then you have all of these cool ladies fighting, the Kyoshi Warriors vs. Azula's crew, in the second movie. It just gets darker and edgier in the greatest way – more Shakespearean, for me, as the season progress. So ... I like goofy humor, so I have a higher tolerance than most. [Laughs.]",
      "links": [],
      "text": "Even on Nickelodeon, and even on that show, the comedy is broad at times. And then you have episodes like \"The Blue Spirit\" episode, I think it's 13 from the first season, which is all edgy. Straight up, I literally I picked episode 13 and put it in the movie. I just literally picked it up and put it in the movie. But from the first season and first episode, you're just picking and choosing really delicately how to maintain it. I've actually written a second draft of the second movie, and it's so much older. It's so much edgier and older. That's what they were naturally having to do because the kids are 12/14 at the beginning and they just keep on growing and getting more mature. It just naturally moves that way. Then you have all of these cool ladies fighting, the Kyoshi Warriors vs. Azula's crew, in the second movie. It just gets darker and edgier in the greatest way – more Shakespearean, for me, as the season progress. So ... I like goofy humor, so I have a higher tolerance than most. [Laughs.]"
    },
    {
      "body": "I moved some things around, like \"The Deserter\" (I love him!) – I moved him to the third movie when Aang's going to learn fire. So those kinds of things. King Bumi's not in the first movie, but my hope as we get to earth, all of those earth kind of related things will come in handy. It's really is a distillation of just getting the story correct – and how much lay in? I have a line, which I hope stays after the three months, that is Grandma saying something about her friend Hama, which is like my favorite episode in the series – the bloodbender episode from the 3rd season. I wanted to lay the groundwork for that. So as much as I can, do the balancing act. It's always sad to lose something that was fun and exciting in the first season.",
      "links": [],
      "text": "I moved some things around, like \"The Deserter\" (I love him!) – I moved him to the third movie when Aang's going to learn fire. So those kinds of things. King Bumi's not in the first movie, but my hope as we get to earth, all of those earth kind of related things will come in handy. It's really is a distillation of just getting the story correct – and how much lay in? I have a line, which I hope stays after the three months, that is Grandma saying something about her friend Hama, which is like my favorite episode in the series – the bloodbender episode from the 3rd season. I wanted to lay the groundwork for that. So as much as I can, do the balancing act. It's always sad to lose something that was fun and exciting in the first season."
    },
    {
      "body": "When my movies go around the world, like in Spain, right away they'll just take it and anywhere I want to go with spirituality and that stuff. The same with Japan. And then other countries and other places, it's much more: \"I'm not getting this. What is this?\" United States and UK fall into a brother/sister category in that reaction. I know when I come up with an idea that's more spiritually oriented that these are the territories I have to be more aware of. The Last Airbender is a spiritual movie. There's no way around it. I mean, it's badass – it's really cool, but it's so meaningful in so many ways. Making sure that comes through is something that really motivates me. So there's a lot of things that really excite me and make me want to be like the guardian angel of the movie. I feel very protective of it. There's a great connective tissue. The way I feel as a parent to my other movies, I feel that way as well with this movie.",
      "links": [],
      "text": "When my movies go around the world, like in Spain, right away they'll just take it and anywhere I want to go with spirituality and that stuff. The same with Japan. And then other countries and other places, it's much more: \"I'm not getting this. What is this?\" United States and UK fall into a brother/sister category in that reaction. I know when I come up with an idea that's more spiritually oriented that these are the territories I have to be more aware of. The Last Airbender is a spiritual movie. There's no way around it. I mean, it's badass – it's really cool, but it's so meaningful in so many ways. Making sure that comes through is something that really motivates me. So there's a lot of things that really excite me and make me want to be like the guardian angel of the movie. I feel very protective of it. There's a great connective tissue. The way I feel as a parent to my other movies, I feel that way as well with this movie."
    },
    {
      "body": "The last thing that as the contract was closing with Paramount, I just said \"Three. Right? Three.\" That way I can put a lot of integrity into it and know how to press the accelerator on a storyline or not. And as I am developing it, if I go \"okay, this is not fitting into the movie,\" I know how to handle it. Like already I pulled out a couple of things from the first movie that I thought were going to be in the first movie. Now it's going to affect the draft of the second movie. I need to redo the introductory scene of a character because I pulled her from this one – that kind of thing. It's really important for me to have that. For me, the second season was like spot. I just got that season; I felt it. Of the twenty episodes, so many spoke to me. And the storyline was really clear and very exciting. The whole trauma of the way it ends – the darkness of that – I love it! Love it, love it, love it. The third movie (and I can't even think about it right now without getting really upset) I have to really go through and analyze it really carefully. That was, again, very schizophrenic for me. I've got to find it, and I suspect when I look at those twenty-one episodes, I will see that there are the eight episodes that have the through line right there. And then there are all kinds of things, like remember The Beach episode? (he directs at me) that have really nice colors, and we'll see what we can do ... I don't even know if I answered your question.",
      "links": [],
      "text": "The last thing that as the contract was closing with Paramount, I just said \"Three. Right? Three.\" That way I can put a lot of integrity into it and know how to press the accelerator on a storyline or not. And as I am developing it, if I go \"okay, this is not fitting into the movie,\" I know how to handle it. Like already I pulled out a couple of things from the first movie that I thought were going to be in the first movie. Now it's going to affect the draft of the second movie. I need to redo the introductory scene of a character because I pulled her from this one – that kind of thing. It's really important for me to have that. For me, the second season was like spot. I just got that season; I felt it. Of the twenty episodes, so many spoke to me. And the storyline was really clear and very exciting. The whole trauma of the way it ends – the darkness of that – I love it! Love it, love it, love it. The third movie (and I can't even think about it right now without getting really upset) I have to really go through and analyze it really carefully. That was, again, very schizophrenic for me. I've got to find it, and I suspect when I look at those twenty-one episodes, I will see that there are the eight episodes that have the through line right there. And then there are all kinds of things, like remember The Beach episode? (he directs at me) that have really nice colors, and we'll see what we can do ... I don't even know if I answered your question."
    },
    {
      "body": "It was funny cause Mike and Bryan when they were asked to come up with a show, the first drawing they had was someone in the clouds with a staff and some bisons in the air. That was the very first image. Like there was a shepherded and his flock was in the air. \"I guess he's kinda related to air\" and they started working that way. \"Maybe there's a water\" and that kind of thing. That image though, the Appa image, is the literally beginning of this entire thing. So when we were making the movie, I was like \"we're just gonna go with that. I'm not gonna change it into something that could actually physically fly with wings and all that stuff.\" Not while the kids are sleeping with a plush Appa.",
      "links": [],
      "text": "It was funny cause Mike and Bryan when they were asked to come up with a show, the first drawing they had was someone in the clouds with a staff and some bisons in the air. That was the very first image. Like there was a shepherded and his flock was in the air. \"I guess he's kinda related to air\" and they started working that way. \"Maybe there's a water\" and that kind of thing. That image though, the Appa image, is the literally beginning of this entire thing. So when we were making the movie, I was like \"we're just gonna go with that. I'm not gonna change it into something that could actually physically fly with wings and all that stuff.\" Not while the kids are sleeping with a plush Appa."
    },
    {
      "body": "You know what the funny thing is? He's my favorite in the movie. He's my favorite. I literally can't wait to see him again every time he comes on screen. And there's this one scene where he shows up behind the villagers that are getting attacked and he roars! So you know, it works. Sometimes you just accept the material and you take that leap of faith.",
      "links": [],
      "text": "You know what the funny thing is? He's my favorite in the movie. He's my favorite. I literally can't wait to see him again every time he comes on screen. And there's this one scene where he shows up behind the villagers that are getting attacked and he roars! So you know, it works. Sometimes you just accept the material and you take that leap of faith."
    },
    {
      "body": "So on the day, if this was the scene, I could tell you if we got it and I'd say; \"Ya know, Amy's shirt is popping too much. All of that silver, we gotta take that out. This color is way too much, we gotta take that out there. I don't like that that's blank right there. This is not working for me, you need to get me something from set. Let's switch you positions over here 'cause your blue's popping.\" You know? That I can tell you. But not when we're doing a movie like this, literally all I have is you maybe, and I have to use all of those skills at a later point. I can talk to everybody, all of the crew members, about what I am hoping is there. But you can't even use the thing that I am good at because it's not there yet. But now it's there. Now I'm looking at it and going \"the red in the starburst thing is too bright, pull it out,\" and they go \"great, great, great!\"",
      "links": [],
      "text": "So on the day, if this was the scene, I could tell you if we got it and I'd say; \"Ya know, Amy's shirt is popping too much. All of that silver, we gotta take that out. This color is way too much, we gotta take that out there. I don't like that that's blank right there. This is not working for me, you need to get me something from set. Let's switch you positions over here 'cause your blue's popping.\" You know? That I can tell you. But not when we're doing a movie like this, literally all I have is you maybe, and I have to use all of those skills at a later point. I can talk to everybody, all of the crew members, about what I am hoping is there. But you can't even use the thing that I am good at because it's not there yet. But now it's there. Now I'm looking at it and going \"the red in the starburst thing is too bright, pull it out,\" and they go \"great, great, great!\""
    },
    {
      "body": "Now I am back again, but that's like ... how long ago did I stop shooting? That's a long time to wait to do what you do. I didn't anticipate that. I didn't anticipate how frustrating that was going to be. And then you're so far down the line, and it's so costly. For example, if we were shooting this (the meeting) live-action, you can tell – as the actors and the crew – if I don't think we have it. I'll be tense. \"Well, what do you want?\" \"Hold on guys, this isn't right. It's just not right. Just give me five minutes and I'll figure it out. Okay, we're taking this apart. We're taking all of you guys out and putting you out in the hallway. It's gonna be a walk and talk while you're getting on the elevator.\" I don't have that option to do that. By the time I realize I would have done it differently, so much money and time has been spent. There's just no way to tell ILM to start from scratch. It doesn't work like that. So that's a super, super challenging thing. I guess I've learned a new skill of being able to imagine even more in my head and hold to it as long as I can.",
      "links": [],
      "text": "Now I am back again, but that's like ... how long ago did I stop shooting? That's a long time to wait to do what you do. I didn't anticipate that. I didn't anticipate how frustrating that was going to be. And then you're so far down the line, and it's so costly. For example, if we were shooting this (the meeting) live-action, you can tell – as the actors and the crew – if I don't think we have it. I'll be tense. \"Well, what do you want?\" \"Hold on guys, this isn't right. It's just not right. Just give me five minutes and I'll figure it out. Okay, we're taking this apart. We're taking all of you guys out and putting you out in the hallway. It's gonna be a walk and talk while you're getting on the elevator.\" I don't have that option to do that. By the time I realize I would have done it differently, so much money and time has been spent. There's just no way to tell ILM to start from scratch. It doesn't work like that. So that's a super, super challenging thing. I guess I've learned a new skill of being able to imagine even more in my head and hold to it as long as I can."
    },
    {
      "body": "For example, if you found a great brother, but it didn't go with my favorite Katara, then I couldn't use him. Theoretical things like that would happen. There was an Aang that I really loved, but he was like five foot ten. There's all kinds of issues that come to the table. I kept having a board of all the people that I was considering. There was at one time a – I think their background was Chinese – a Sokka and Katara. One of them was a better actor than the other, and I was gathering my pros and cons. \"Let's say that was that, what would the Fire Nation be?\" And you just do that. Being without agenda and letting it come to the table. Noah's like a photo double for the cartoon; I mean he's literally spot-on. To me, the best part is, I didn't really know their backgrounds. Noah, for me, has a slightly mixed quality look to him – so I cast airbenders as all mixed race. So when you see the monks and that stuff, they're all mixed. And it kind of goes with the nomadic culture that over the years all different nationalities came to the table. The Fire Nation was the most complicated. I kept switching who was playing Zuko. It was such a complicated and drawn out thing about practical matters. The first person I was considering for Zuko was Ecuadorian. So I started thinking that way. And then when that person couldn't do it, the second person who came in was much more Caucasian. I was like, \"well then we have to switch the others. All right, now how are we doing this?\" What is the Earth Kingdom was always the issue because the second movie is so dominated by that group, and will represent most of the movie, but it has a small, small part in the first movie. That was important. It just sort of came into being and started to distill.",
      "links": [],
      "text": "For example, if you found a great brother, but it didn't go with my favorite Katara, then I couldn't use him. Theoretical things like that would happen. There was an Aang that I really loved, but he was like five foot ten. There's all kinds of issues that come to the table. I kept having a board of all the people that I was considering. There was at one time a – I think their background was Chinese – a Sokka and Katara. One of them was a better actor than the other, and I was gathering my pros and cons. \"Let's say that was that, what would the Fire Nation be?\" And you just do that. Being without agenda and letting it come to the table. Noah's like a photo double for the cartoon; I mean he's literally spot-on. To me, the best part is, I didn't really know their backgrounds. Noah, for me, has a slightly mixed quality look to him – so I cast airbenders as all mixed race. So when you see the monks and that stuff, they're all mixed. And it kind of goes with the nomadic culture that over the years all different nationalities came to the table. The Fire Nation was the most complicated. I kept switching who was playing Zuko. It was such a complicated and drawn out thing about practical matters. The first person I was considering for Zuko was Ecuadorian. So I started thinking that way. And then when that person couldn't do it, the second person who came in was much more Caucasian. I was like, \"well then we have to switch the others. All right, now how are we doing this?\" What is the Earth Kingdom was always the issue because the second movie is so dominated by that group, and will represent most of the movie, but it has a small, small part in the first movie. That was important. It just sort of came into being and started to distill."
    },
    {
      "body": "Dev came into the picture really early on – he had auditioned for me in London. He's kind of like a sweet guy, but he did such a great reading. I always go for the actor. When I was doing The Sixth Sense, you literally read the script of The Sixth Sense and [Cole's] dark haired, black eyed. I always pictured the kid from Searching for Bobby fisher as the lead of The Sixth Sense. \"We are not casting hiring any blonde L.A. kids, okay? Don't even bring them in!\" And Haley came in \"... You got the part!\" How can you not have him play the part? So that's always been my lean. I have hopes of what I want them to be. My hope was that this movie would be incredibly diverse. When we look back on the three movies, without peer, they were the most diverse movies of all time. And that is the case when you watch the movie. It's not like an agenda like when you see a picture of a kid's school with kids on the swings and there's one from each background – it's not like that. It's a real thing. This nation has this ethnicity and when we go deep into that culture, we'll see more and more of that. Again, Dev ended up being my choice for Zuko. I looked for an uncle that could be in that realm. For a moment there I thought of Ben Kingsly. ${link_0}, who I loved in Iron Man, took us into kind of a Mediterranean, Arab and Indian world. I can go as far as that. That would be the breadth of the Fire Nation – that kind of look.",
      "links": [
        {
          "body": "Shaun Toub",
          "key": "${link_0}",
          "target": {
            "href": "Film_Shaun_Toub",
            "page": "Film_Shaun_Toub"
          }
        }
      ],
      "text": "Dev came into the picture really early on – he had auditioned for me in London. He's kind of like a sweet guy, but he did such a great reading. I always go for the actor. When I was doing The Sixth Sense, you literally read the script of The Sixth Sense and [Cole's] dark haired, black eyed. I always pictured the kid from Searching for Bobby fisher as the lead of The Sixth Sense. \"We are not casting hiring any blonde L.A. kids, okay? Don't even bring them in!\" And Haley came in \"... You got the part!\" How can you not have him play the part? So that's always been my lean. I have hopes of what I want them to be. My hope was that this movie would be incredibly diverse. When we look back on the three movies, without peer, they were the most diverse movies of all time. And that is the case when you watch the movie. It's not like an agenda like when you see a picture of a kid's school with kids on the swings and there's one from each background – it's not like that. It's a real thing. This nation has this ethnicity and when we go deep into that culture, we'll see more and more of that. Again, Dev ended up being my choice for Zuko. I looked for an uncle that could be in that realm. For a moment there I thought of Ben Kingsly. Shaun Toub, who I loved in Iron Man, took us into kind of a Mediterranean, Arab and Indian world. I can go as far as that. That would be the breadth of the Fire Nation – that kind of look."
    },
    {
      "body": "For me, Nicola had a lot of Russian qualities and European qualities, so that's what we're going to go here ... just like that. Whoever we ended up with, I said that's their nationality. Suki was Jessica, who is a mix of Filipino and now the Earth Kingdom is going to be all-Asian, so Toph now will have to be ... like that. There is a sudden [moment] when I looked at the board and I said \"this works for me\", because I represented everyone. And there's a section of that's African-American cause it's such a big country and such a big land [that] I felt you could have some diversity in there as they travel through the different cities there. So, more so than the show, it will have a much more diverse ethnic background. It's not an agenda for me, but it's something I'm super proud of; that when my kids look at, or any kids look at it, they'll see themselves in the movie.",
      "links": [],
      "text": "For me, Nicola had a lot of Russian qualities and European qualities, so that's what we're going to go here ... just like that. Whoever we ended up with, I said that's their nationality. Suki was Jessica, who is a mix of Filipino and now the Earth Kingdom is going to be all-Asian, so Toph now will have to be ... like that. There is a sudden [moment] when I looked at the board and I said \"this works for me\", because I represented everyone. And there's a section of that's African-American cause it's such a big country and such a big land [that] I felt you could have some diversity in there as they travel through the different cities there. So, more so than the show, it will have a much more diverse ethnic background. It's not an agenda for me, but it's something I'm super proud of; that when my kids look at, or any kids look at it, they'll see themselves in the movie."
    },
    {
      "body": "The subject matter is so rich, anyway you want to go, but driven by the emotion. The action is driven by emotion, which is such a great thing for me. We did a little bit of that in Unbreakable, but we had a real great opportunity to do that here. One of the great balancing tricks of the movie was, how much Asian influence to put into the patina of the movie. Do you have pagodas? Do you have this sort of thing? The consensus with the production designer and myself, and consequently with James, was it's a flavoring. It's not Asian. We're not in Asia, but it's influenced by it. What medieval stuff is to Lord of the Rings, Asia is to us. It's influencing it, but it's not necessarily: that's a kimono or that kind of thing. The same thing goes with the music. We toyed with the idea of it being very Crouching Tiger, but we ended up going with its influenced but it has its own world. So I'm really excited for you to hear the score.",
      "links": [],
      "text": "The subject matter is so rich, anyway you want to go, but driven by the emotion. The action is driven by emotion, which is such a great thing for me. We did a little bit of that in Unbreakable, but we had a real great opportunity to do that here. One of the great balancing tricks of the movie was, how much Asian influence to put into the patina of the movie. Do you have pagodas? Do you have this sort of thing? The consensus with the production designer and myself, and consequently with James, was it's a flavoring. It's not Asian. We're not in Asia, but it's influenced by it. What medieval stuff is to Lord of the Rings, Asia is to us. It's influencing it, but it's not necessarily: that's a kimono or that kind of thing. The same thing goes with the music. We toyed with the idea of it being very Crouching Tiger, but we ended up going with its influenced but it has its own world. So I'm really excited for you to hear the score."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Transcript:Roundtable_discussion_with_M._Night_Shyamalan",
    "file": "avatar.wikia.com/wiki/Transcript_Roundtable_discussion_with_M.html",
    "page": "Transcript_Roundtable_discussion_with_M",
    "title": "Transcript:Roundtable discussion with M. Night Shyamalan"
  }
}