{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Flora",
      "target": {
        "external": false,
        "href": "/wiki/Category_Flora",
        "page": "Category_Flora"
      }
    },
    {
      "body": "Locations",
      "target": {
        "external": false,
        "href": "/wiki/Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Spirit World",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirit_World",
        "page": "Category_Spirit_World"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The Tree of Time is an ancient ${link_0} located in the ${link_1}, centered between the two ${link_2} that lead to the ${link_3} and ${link_4} of the ${link_5}. During ${link_6} in 9,829 ${link_7}, ${link_8} ${link_9} imprisoned ${link_10} in the tree to prevent darkness from enveloping the world.",
      "links": [
        {
          "body": "tree",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Flora_in_the_World_of_Avatar",
            "page": "Flora_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "spirit portals",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "North",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/North_Pole",
            "page": "North_Pole"
          }
        },
        {
          "body": "South Poles",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "mortal realm",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Harmonic Convergence",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "BG",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Wan",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Wan",
            "page": "Wan"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/Vaatu",
            "page": "Vaatu"
          }
        }
      ],
      "section": [
        "Tree of Time"
      ],
      "text": "The Tree of Time is an ancient tree located in the Spirit World, centered between the two spirit portals that lead to the North and South Poles of the mortal realm. During Harmonic Convergence in 9,829 BG, Avatar Wan imprisoned Vaatu in the tree to prevent darkness from enveloping the world."
    },
    {
      "body": "In 9,829 BG, after permanently merging with ${link_0} during Harmonic Convergence, Wan used the four ${link_1} to subdue Vaatu and trap him inside the hollow of the Tree of Time.",
      "links": [
        {
          "body": "Raava",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Raava",
            "page": "Raava"
          }
        },
        {
          "body": "bending arts",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "History"
      ],
      "text": "In 9,829 BG, after permanently merging with Raava during Harmonic Convergence, Wan used the four bending arts to subdue Vaatu and trap him inside the hollow of the Tree of Time."
    },
    {
      "body": "Ten thousand years later, in 171 AG, ${link_0} visited Vaatu at the Tree of Time, and apologized for his failure to bring back Avatar ${link_1} to aid in opening the ${link_2} spirit portal. Vaatu informed Unalaq that he had not necessarily failed him yet, as Korra was alive and currently in the Spirit World.",
      "links": [
        {
          "body": "Unalaq",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Northern",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/North_Pole",
            "page": "North_Pole"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "History"
      ],
      "text": "Ten thousand years later, in 171 AG, Unalaq visited Vaatu at the Tree of Time, and apologized for his failure to bring back Avatar Korra to aid in opening the Northern spirit portal. Vaatu informed Unalaq that he had not necessarily failed him yet, as Korra was alive and currently in the Spirit World."
    },
    {
      "body": "Korra met Vaatu, who was still imprisoned in the Tree of Time, shortly after entering the Spirit World. Threatening to destroy ${link_0}'s soul, Unalaq forced Korra to open the Northern spirit portal, causing a massive release of energy which weakened the barrier that imprisoned Vaatu.",
      "links": [
        {
          "body": "Jinora",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Jinora",
            "page": "Jinora"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "History"
      ],
      "text": "Korra met Vaatu, who was still imprisoned in the Tree of Time, shortly after entering the Spirit World. Threatening to destroy Jinora's soul, Unalaq forced Korra to open the Northern spirit portal, causing a massive release of energy which weakened the barrier that imprisoned Vaatu."
    },
    {
      "body": "Just before Harmonic Convergence, Korra attempted to reseal the ${link_0} spirit portal to no avail, and witnessed as the influx of spiritual energy resulting from the phenomenon allowed Vaatu to break free from his bonds and escape imprisonment from the Tree of Time.",
      "links": [
        {
          "body": "Southern",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "History"
      ],
      "text": "Just before Harmonic Convergence, Korra attempted to reseal the Southern spirit portal to no avail, and witnessed as the influx of spiritual energy resulting from the phenomenon allowed Vaatu to break free from his bonds and escape imprisonment from the Tree of Time."
    },
    {
      "body": "After her connection with Raava and the past Avatars was severed by the ${link_0}, Korra was escorted by Tenzin to the Tree of Time. Due to the tree's connection to cosmic energy, it retained all memories, and Korra saw and subsequently remembered events of her past, which had been suppressed by her amnesia. Using the energy inside the tree, Korra was able to channel the energy within herself and connect with the cosmic energy of the universe, allowing her to summon a massive astral projection of her spirit.",
      "links": [
        {
          "body": "Dark Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_Avatar",
            "page": "Dark_Avatar"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "History"
      ],
      "text": "After her connection with Raava and the past Avatars was severed by the Dark Avatar, Korra was escorted by Tenzin to the Tree of Time. Due to the tree's connection to cosmic energy, it retained all memories, and Korra saw and subsequently remembered events of her past, which had been suppressed by her amnesia. Using the energy inside the tree, Korra was able to channel the energy within herself and connect with the cosmic energy of the universe, allowing her to summon a massive astral projection of her spirit."
    },
    {
      "body": "Shortly after, numerous ${link_0} charged at the tree in an attempt to retrieve Korra's body, but were held back by Tenzin, ${link_1}, ${link_2}, ${link_3}, and ${link_4}. ${link_5} also arrived to assist in subduing the dark spirits, but were soon driven inside the Tree of Time along with the others. Before the dark spirits could completely enter the hollow of the tree, Korra's astral projection returned, bringing with it a ray of light that caused the dark spirits to disappear.",
      "links": [
        {
          "body": "dark spirits",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Dark_spirits",
            "page": "Dark_spirits"
          }
        },
        {
          "body": "Bumi",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bumi",
            "page": "Bumi"
          }
        },
        {
          "body": "Kya",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Kya",
            "page": "Kya"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Mako",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Desna and Eska",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "History"
      ],
      "text": "Shortly after, numerous dark spirits charged at the tree in an attempt to retrieve Korra's body, but were held back by Tenzin, Bumi, Kya, Bolin, and Mako. Desna and Eska also arrived to assist in subduing the dark spirits, but were soon driven inside the Tree of Time along with the others. Before the dark spirits could completely enter the hollow of the tree, Korra's astral projection returned, bringing with it a ray of light that caused the dark spirits to disappear."
    },
    {
      "body": "With Vaatu's influence absent from the Spirit World, the Tree of Time and the surrounding area were basked in light, attracting many peaceful spirits to live in the area. Two and a half years after Korra lost touch with the Avatar Spirit due to ${link_0} poisoning at the hands of the ${link_1}, she came to the Tree of Time to meditate in its hollow. However, her meditation was interrupted by several spirits, who were debating among themselves whether or not she was the Avatar. Upon verifying her identity, they approached Korra inside the tree's hollow, wondering where she had been. After Korra relayed what had befallen her, she admitted that she hoped meditating inside the Tree of Time could help her to reconnect with Raava, as she had seen many visions the last time she was there, though was unable to see anything at that moment. When ${link_2} offered to help, Korra declined, believing that she needed to figure it out on her own. She left the Tree of Time and the Spirit World and began to wander the physical world alone.",
      "links": [
        {
          "body": "mercury",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mercury",
            "page": "Mercury"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "a spirit",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Light_spirit",
            "page": "Light_spirit"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "History"
      ],
      "text": "With Vaatu's influence absent from the Spirit World, the Tree of Time and the surrounding area were basked in light, attracting many peaceful spirits to live in the area. Two and a half years after Korra lost touch with the Avatar Spirit due to mercury poisoning at the hands of the Red Lotus, she came to the Tree of Time to meditate in its hollow. However, her meditation was interrupted by several spirits, who were debating among themselves whether or not she was the Avatar. Upon verifying her identity, they approached Korra inside the tree's hollow, wondering where she had been. After Korra relayed what had befallen her, she admitted that she hoped meditating inside the Tree of Time could help her to reconnect with Raava, as she had seen many visions the last time she was there, though was unable to see anything at that moment. When a spirit offered to help, Korra declined, believing that she needed to figure it out on her own. She left the Tree of Time and the Spirit World and began to wander the physical world alone."
    },
    {
      "body": "Some time later, Korra tracked the spirits leaving ${link_0}'s ${link_1} to the base of the Tree of Time. She asked them to help her defend the city against ${link_2}, who was perverting spirit power to attack other humans. After a ${link_3} refused her plea, all the spirits vanished one by one.",
      "links": [
        {
          "body": "Republic City",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "Spirit Wilds",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Wilds",
            "page": "Spirit_Wilds"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "dragon eel spirit",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon_eel_spirit",
            "page": "Dragon_eel_spirit"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "History"
      ],
      "text": "Some time later, Korra tracked the spirits leaving Republic City's Spirit Wilds to the base of the Tree of Time. She asked them to help her defend the city against Kuvira, who was perverting spirit power to attack other humans. After a dragon eel spirit refused her plea, all the spirits vanished one by one."
    },
    {
      "body": "Legends state that the Tree of Time's roots bind the two worlds together and is a source of great spiritual energy. In the ${link_0}, the ancients used to commune in the hollow of the tree to connect with the great cosmic energy of the universe, before Vaatu was imprisoned in the tree by Avatar Wan.",
      "links": [
        {
          "body": "era of Raava",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Era_of_Raava",
            "page": "Era_of_Raava"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "Legend"
      ],
      "text": "Legends state that the Tree of Time's roots bind the two worlds together and is a source of great spiritual energy. In the era of Raava, the ancients used to commune in the hollow of the tree to connect with the great cosmic energy of the universe, before Vaatu was imprisoned in the tree by Avatar Wan."
    },
    {
      "body": "A book in ${link_0} recalls the legend of Vaatu's imprisonment in the Tree of Time. Elders believe that Vaatu is trapped by a strong spiritual barrier from which he cannot break free, provided that the two spirit portals are sealed by the arrival of Harmonic Convergence. If the portals were opened during this time, the amplified spiritual energy caused by overlap of the two portals will be enough for Vaatu to use in breaking the bonds that restrain him, leaving the mortal realm vulnerable to becoming enveloped in darkness.",
      "links": [
        {
          "body": "Wan Shi Tong's Library",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "Legend"
      ],
      "text": "A book in Wan Shi Tong's Library recalls the legend of Vaatu's imprisonment in the Tree of Time. Elders believe that Vaatu is trapped by a strong spiritual barrier from which he cannot break free, provided that the two spirit portals are sealed by the arrival of Harmonic Convergence. If the portals were opened during this time, the amplified spiritual energy caused by overlap of the two portals will be enough for Vaatu to use in breaking the bonds that restrain him, leaving the mortal realm vulnerable to becoming enveloped in darkness."
    },
    {
      "body": "The Tree of Time is similar to ${link_0}, the Tree of Life in Norse mythology. It is believed that the latter connects the nine realms of Norse cosmology, while the former connects the mortal and spiritual realms.",
      "links": [
        {
          "body": "Yggdrasil",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Yggdrasil",
            "page": "http://en.wikipedia.org/wiki/Yggdrasil"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "Trivia"
      ],
      "text": "The Tree of Time is similar to Yggdrasil, the Tree of Life in Norse mythology. It is believed that the latter connects the nine realms of Norse cosmology, while the former connects the mortal and spiritual realms."
    },
    {
      "body": "The manner in which the ancients are said to have communed in the hollow of the tree to connect with the great cosmic energy of the universe is similar to how Buddha meditated under the ${link_0} to reach enlightenment.",
      "links": [
        {
          "body": "Bodhi Tree",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Bodhi_Tree",
            "page": "http://en.wikipedia.org/wiki/Bodhi_Tree"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "Trivia"
      ],
      "text": "The manner in which the ancients are said to have communed in the hollow of the tree to connect with the great cosmic energy of the universe is similar to how Buddha meditated under the Bodhi Tree to reach enlightenment."
    },
    {
      "body": "The Tree of Time was inspired by ancient bristlecone pines; individuals of the three species classified as ${link_0} are among the oldest living plants in the world.",
      "links": [
        {
          "body": "bristlecone pines",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Bristlecone_pine",
            "page": "http://en.wikipedia.org/wiki/Bristlecone_pine"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "Trivia"
      ],
      "text": "The Tree of Time was inspired by ancient bristlecone pines; individuals of the three species classified as bristlecone pines are among the oldest living plants in the world."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Flora in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Flora_in_the_World_of_Avatar",
            "page": "Flora_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "See also"
      ],
      "text": "Flora in the World of Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "See also"
      ],
      "text": "Spirit World"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Bristlecone pine",
          "key": "${link_0}",
          "target": {
            "external": true,
            "href": "http://en.wikipedia.org/wiki/Bristlecone_pine",
            "page": "http://en.wikipedia.org/wiki/Bristlecone_pine"
          }
        }
      ],
      "section": [
        "Tree of Time",
        "External links"
      ],
      "text": "Bristlecone pine"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Tree_of_Time",
    "file": "avatar.wikia.com/wiki/Tree_of_Time.html",
    "page": "Tree_of_Time",
    "title": "Tree of Time"
  }
}