{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Objects",
      "target": {
        "external": false,
        "href": "/wiki/Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Republic City",
      "target": {
        "external": false,
        "href": "/wiki/Category_Republic_City",
        "page": "Category_Republic_City"
      }
    },
    {
      "body": "Vehicles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Vehicles",
        "page": "Category_Vehicles"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "A trolley is a mode of rail-based ${link_0} that is commonly powered by electricity and operates with a single car. Trolleys are widely used across many of ${link_1}'s boroughs and also operate ${link_2}, where the ${link_3} once used them for their own illegal purposes, such as ${link_4} trafficking.",
      "links": [
        {
          "body": "transportation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Transportation_in_the_World_of_Avatar",
            "page": "Transportation_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "underground",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_tunnel_network",
            "page": "Republic_City_tunnel_network"
          }
        },
        {
          "body": "Equalists",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "weapons",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Electrified_glove",
            "page": "Electrified_glove"
          }
        }
      ],
      "section": [
        "Trolley"
      ],
      "text": "A trolley is a mode of rail-based transportation that is commonly powered by electricity and operates with a single car. Trolleys are widely used across many of Republic City's boroughs and also operate underground, where the Equalists once used them for their own illegal purposes, such as weapons trafficking."
    },
    {
      "body": "Trolleys are commonplace in Republic City. Above ground, they are in use as a means of cheap public transportation. Underground, a different type of trolley was used by the Equalists, and its existence was kept a secret from the rest of the city for a long period of time.",
      "links": [],
      "section": [
        "Trolley",
        "History"
      ],
      "text": "Trolleys are commonplace in Republic City. Above ground, they are in use as a means of cheap public transportation. Underground, a different type of trolley was used by the Equalists, and its existence was kept a secret from the rest of the city for a long period of time."
    },
    {
      "body": "${link_0} regularly rode a trolley to commute from his home at the ${link_1} to the ${link_2}, where he was employed. One day, while running to catch the trolley after finishing his shift, he was accidentally hit by a moped. Despite being angered by the incident, he was happy to accept a date requested by the driver, ${link_3}. That night, Mako ate dinner with her at ${link_4}, which was located near a trolley line.",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Pro-bending Arena",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pro-bending_Arena",
            "page": "Pro-bending_Arena"
          }
        },
        {
          "body": "Republic City power plant",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Republic_City_power_plant",
            "page": "Republic_City_power_plant"
          }
        },
        {
          "body": "Asami Sato",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Kwong's Cuisine",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Kwong%27s_Cuisine",
            "page": "Kwong%27s_Cuisine"
          }
        }
      ],
      "section": [
        "Trolley",
        "History"
      ],
      "text": "Mako regularly rode a trolley to commute from his home at the Pro-bending Arena to the Republic City power plant, where he was employed. One day, while running to catch the trolley after finishing his shift, he was accidentally hit by a moped. Despite being angered by the incident, he was happy to accept a date requested by the driver, Asami Sato. That night, Mako ate dinner with her at Kwong's Cuisine, which was located near a trolley line."
    },
    {
      "body": "While searching for ${link_0} in the underground Equalist headquarters, ${link_1} secretly boarded a tram and rode it into a prison, where they thought Korra was being held captive. However, they failed to find her and were forced to flee the headquarters. They once again boarded the tram and left for the exit, but were pursued by several Equalists in a tram behind them. ${link_2} divided the two trams by blocking the rail in front of the tram behind them with ${link_3}. ${link_4} blasted a hole in the ceiling and thrust the tram upward with her earthbending, allowing Team Avatar to escape without reaching the exit, which was heavily guarded and thus rendered unusable.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "earthbending",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Earthbending",
            "page": "Earthbending"
          }
        },
        {
          "body": "Lin Beifong",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Lin_Beifong",
            "page": "Lin_Beifong"
          }
        }
      ],
      "section": [
        "Trolley",
        "History"
      ],
      "text": "While searching for Korra in the underground Equalist headquarters, Team Avatar secretly boarded a tram and rode it into a prison, where they thought Korra was being held captive. However, they failed to find her and were forced to flee the headquarters. They once again boarded the tram and left for the exit, but were pursued by several Equalists in a tram behind them. Bolin divided the two trams by blocking the rail in front of the tram behind them with earthbending. Lin Beifong blasted a hole in the ceiling and thrust the tram upward with her earthbending, allowing Team Avatar to escape without reaching the exit, which was heavily guarded and thus rendered unusable."
    },
    {
      "body": "Streetcar - Used at street level in downtown Republic City, and has stops near ${link_0}, the Republic City power plant, and Kwong's Cuisine. The stations are open-air and small, with enough seats for only a few passengers waiting to board the streetcar. The trolleys themselves are small as well, and only one car is allowed to stop at each station at a time. Passengers can board or exit the streetcar through the back or front, where the passageways are on the left. Streetcars are box-shaped and have several windows to let in light, including three on the back and four on the left. For the most part, the cars are yellowish-green in color. Since they function at street level, these trolleys do occasionally interfere with ${link_1} traffic. Like trains, they run on tracks and wheels, but are powered by electricity channeled through two cables held high above the tracks. Two thin metal rods reach into the air and connect the cars to the cables. Overall, streetcars are intricately designed with ornate patterns that are aesthetically pleasing.",
      "links": [
        {
          "body": "Central City Station",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Central_City_Station",
            "page": "Central_City_Station"
          }
        },
        {
          "body": "vehicle",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Motor_vehicle",
            "page": "Motor_vehicle"
          }
        }
      ],
      "section": [
        "Trolley",
        "Known types"
      ],
      "text": "Streetcar - Used at street level in downtown Republic City, and has stops near Central City Station, the Republic City power plant, and Kwong's Cuisine. The stations are open-air and small, with enough seats for only a few passengers waiting to board the streetcar. The trolleys themselves are small as well, and only one car is allowed to stop at each station at a time. Passengers can board or exit the streetcar through the back or front, where the passageways are on the left. Streetcars are box-shaped and have several windows to let in light, including three on the back and four on the left. For the most part, the cars are yellowish-green in color. Since they function at street level, these trolleys do occasionally interfere with vehicle traffic. Like trains, they run on tracks and wheels, but are powered by electricity channeled through two cables held high above the tracks. Two thin metal rods reach into the air and connect the cars to the cables. Overall, streetcars are intricately designed with ornate patterns that are aesthetically pleasing."
    },
    {
      "body": "Tram - Found in the tunnels beneath Republic City and formerly operated by the Equalists. They are made of metal and do not have grooves. The cars have two large searchlights on the front and rear, which are used in the dark to see. Each tramway has its own tunnel, although more than one tram can be used on each one. Either side of a tram can be used as the front. The tram cars can be divided into two halves; one side carries the cargo, while the other has the passenger seats. Unlike streetcars, trams run on only one rail, and get electricity from one cable as well. There is only one connection between the tram and the cable, which is attached to the ceiling. A single tram can hold several passengers.",
      "links": [],
      "section": [
        "Trolley",
        "Known types"
      ],
      "text": "Tram - Found in the tunnels beneath Republic City and formerly operated by the Equalists. They are made of metal and do not have grooves. The cars have two large searchlights on the front and rear, which are used in the dark to see. Each tramway has its own tunnel, although more than one tram can be used on each one. Either side of a tram can be used as the front. The tram cars can be divided into two halves; one side carries the cargo, while the other has the passenger seats. Unlike streetcars, trams run on only one rail, and get electricity from one cable as well. There is only one connection between the tram and the cable, which is attached to the ceiling. A single tram can hold several passengers."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Trolley",
    "file": "avatar.wikia.com/wiki/Trolley.html",
    "page": "Trolley",
    "title": "Trolley"
  }
}