{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Settlements",
      "target": {
        "href": "Category_Settlements",
        "page": "Category_Settlements"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "Southern ${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Earth Kingdom",
              "key": "${link_0}",
              "target": {
                "href": "Earth_Kingdom",
                "page": "Earth_Kingdom"
              }
            }
          ],
          "text": "Southern Earth Kingdom",
          "value": "Southern ${link_0}",
          "value_text": "Southern Earth Kingdom"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "Abandoned",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Abandoned",
          "value": "Abandoned",
          "value_text": "Abandoned"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "The Chase",
              "key": "${link_0}",
              "target": {
                "href": "The_Chase",
                "page": "The_Chase"
              }
            }
          ],
          "text": "\"The Chase\"",
          "value": "\"${link_0}\"",
          "value_text": "\"The Chase\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Tu Zin is a small, abandoned village ${link_0} near a mountainous region of the southern ${link_1}. It was the scene of a ${link_2} between ${link_3}, Zuko and Iroh, and Azula. The settlement is situated in a small, deserted valley some distance from the expansive ${link_4}.",
      "links": [
        {
          "body": "located",
          "key": "${link_0}",
          "target": {
            "href": "Geography_of_the_World_of_Avatar",
            "page": "Geography_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "conflict",
          "key": "${link_2}",
          "target": {
            "href": "Confrontation_at_Tu_Zin",
            "page": "Confrontation_at_Tu_Zin"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_4}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        }
      ],
      "text": "Tu Zin is a small, abandoned village located near a mountainous region of the southern Earth Kingdom. It was the scene of a conflict between Team Avatar, Zuko and Iroh, and Azula. The settlement is situated in a small, deserted valley some distance from the expansive Si Wong Desert."
    },
    {
      "body": "This boomtown quickly came to be after rare and valuable metals were discovered in the nearby mines. In a short amount of time, ${link_0} from all over the Earth Kingdom came here to mine for the valuable metals. For years Tu Zin was a thriving town that flourished with commerce; however, people began to leave after the mines dried up. The villagers abandoned the town to search for new opportunities elsewhere in the Earth Kingdom, leaving behind several possessions and leaving the town to decay. It was not long before everyone was gone, leaving this place a deserted ghost town.",
      "links": [
        {
          "body": "earthbenders",
          "key": "${link_0}",
          "target": {
            "href": "Earthbending",
            "page": "Earthbending"
          }
        }
      ],
      "text": "This boomtown quickly came to be after rare and valuable metals were discovered in the nearby mines. In a short amount of time, earthbenders from all over the Earth Kingdom came here to mine for the valuable metals. For years Tu Zin was a thriving town that flourished with commerce; however, people began to leave after the mines dried up. The villagers abandoned the town to search for new opportunities elsewhere in the Earth Kingdom, leaving behind several possessions and leaving the town to decay. It was not long before everyone was gone, leaving this place a deserted ghost town."
    },
    {
      "body": "Tu Zin is not known to have had any major involvement in ${link_0} that had engulfed the rest of the Earth Kingdom. However, ${link_1} ${link_2} arrived at this town while fleeing from ${link_3} ${link_4}. Sleep-deprived and exhausted, he finally faced her here and was moments away from fighting her when Prince ${link_5} interrupted their standoff. He too had been following the Avatar by trailing his sister. Both siblings were intent on capturing Aang for themselves and fought each other as they chased Aang through the rotting buildings.",
      "links": [
        {
          "body": "the ongoing war",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Princess",
          "key": "${link_3}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Azula",
          "key": "${link_4}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_5}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Tu Zin is not known to have had any major involvement in the ongoing war that had engulfed the rest of the Earth Kingdom. However, Avatar Aang arrived at this town while fleeing from Princess Azula. Sleep-deprived and exhausted, he finally faced her here and was moments away from fighting her when Prince Zuko interrupted their standoff. He too had been following the Avatar by trailing his sister. Both siblings were intent on capturing Aang for themselves and fought each other as they chased Aang through the rotting buildings."
    },
    {
      "body": "${link_0} shielded herself from multiple attacks with blue fire.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        }
      ],
      "text": "Azula shielded herself from multiple attacks with blue fire."
    },
    {
      "body": "After knocking out Zuko, Azula cornered Aang and was only stopped from her attempt to end him by the timely intervention of Aang's friends. Zuko's uncle, ${link_0}, also joined the fray, and soon Aang, his friends, Zuko, and Iroh were all battling Azula. They quickly cornered her and when she saw that she was overwhelmed, she \"surrendered\" to the group. This was just a diversion, however, and she blasted Iroh with her blue flames while they were distracted by her plea. The four remaining benders, Aang, Zuko, ${link_1}, and ${link_2}, attacked Azula simultaneously with their native elements, but Azula blocked the attack with a fire shield. The resulting explosion set most of the ruined town ablaze, allowing Azula to escape. Zuko furiously drove away the Avatar and his friends despite their attempts to help him heal Iroh.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Toph",
          "key": "${link_2}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "After knocking out Zuko, Azula cornered Aang and was only stopped from her attempt to end him by the timely intervention of Aang's friends. Zuko's uncle, Iroh, also joined the fray, and soon Aang, his friends, Zuko, and Iroh were all battling Azula. They quickly cornered her and when she saw that she was overwhelmed, she \"surrendered\" to the group. This was just a diversion, however, and she blasted Iroh with her blue flames while they were distracted by her plea. The four remaining benders, Aang, Zuko, Katara, and Toph, attacked Azula simultaneously with their native elements, but Azula blocked the attack with a fire shield. The resulting explosion set most of the ruined town ablaze, allowing Azula to escape. Zuko furiously drove away the Avatar and his friends despite their attempts to help him heal Iroh."
    },
    {
      "body": "Afterward, Zuko cared for his wounded uncle in a ruined shack located on a hill outside of the city. This was also where Iroh continued Zuko's training, teaching him about the ${link_0} and the ${link_1}.",
      "links": [
        {
          "body": "four nations",
          "key": "${link_0}",
          "target": {
            "href": "Four_nations",
            "page": "Four_nations"
          }
        },
        {
          "body": "redirection of lightning",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "text": "Afterward, Zuko cared for his wounded uncle in a ruined shack located on a hill outside of the city. This was also where Iroh continued Zuko's training, teaching him about the four nations and the redirection of lightning."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Tu_Zin",
    "file": "avatar.wikia.com/wiki/Tu_Zin.html",
    "page": "Tu_Zin",
    "title": "Tu Zin"
  }
}