{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "external": false,
        "href": "/wiki/Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}. Due to her friendly, outgoing personality, she easily formed friendships. However, being a citizen of the ${link_2}, she made easy enemies with allies of the ${link_3} though most of them became good friends after the end of the ${link_4}.",
      "links": [
        {
          "body": "Ty Lee",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships"
      ],
      "text": "This page is comprised of Ty Lee's relationships with other characters in the World of Avatar. Due to her friendly, outgoing personality, she easily formed friendships. However, being a citizen of the Fire Nation, she made easy enemies with allies of the Avatar though most of them became good friends after the end of the Hundred Year War."
    },
    {
      "body": "Ty Lee grew up with ${link_0}, Ty Lin, Ty Lat, Ty Lao, Ty Liu, Ty Lum, and Ty Woo, a situation that made them compete for attention and strive for individuality. In order to deal with the situation, they each chose a specialty in which they would develop themselves and no other sister could follow them; Ty Lee chose acrobatics. Despite this sliver of individuality, Ty Lee could not get over her fear of being part of a matched set. Longing to be a distinct person, she escaped her home life and joined the ${link_1}, though it still left a bitter aftertaste that stood in direct contrast to her normally bubbly personality.",
      "links": [
        {
          "body": "six identical sisters",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ty_sisters",
            "page": "Ty_sisters"
          }
        },
        {
          "body": "circus",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_circus",
            "page": "Fire_Nation_circus"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Relatives"
      ],
      "text": "Ty Lee grew up with six identical sisters, Ty Lin, Ty Lat, Ty Lao, Ty Liu, Ty Lum, and Ty Woo, a situation that made them compete for attention and strive for individuality. In order to deal with the situation, they each chose a specialty in which they would develop themselves and no other sister could follow them; Ty Lee chose acrobatics. Despite this sliver of individuality, Ty Lee could not get over her fear of being part of a matched set. Longing to be a distinct person, she escaped her home life and joined the circus, though it still left a bitter aftertaste that stood in direct contrast to her normally bubbly personality."
    },
    {
      "body": "After the Hundred Year War, Ty Lee joined the ${link_0}, though the identical uniforms resurfaced her old fears of being part of a matched set. To cheer her up, ${link_1} took her back to the circus where she once performed, though they discovered that Ty Lee's sisters were now performing an acrobatic routine there as the \"Flying Ty Sisters\". Despite an initial happiness over reuniting with her siblings, Ty Lee grew dismayed about her sisters' acrobatic abilities, as she had used those to set herself apart from them, which resulted in an argument. Storming out in frustration, she was subsequently confronted by a criminal who easily shrugged off her attempt to subdue him. However, her six sisters came to her aid and quickly overpowered her assailant. Ty Lee was grateful for their support and they all reconciled with a big hug. She realized that she could be her own person among her sisters or teammates, concluding that even with their similarities, it was sometimes better to face challenges together rather than alone.",
      "links": [
        {
          "body": "Kyoshi Warriors",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Relatives"
      ],
      "text": "After the Hundred Year War, Ty Lee joined the Kyoshi Warriors, though the identical uniforms resurfaced her old fears of being part of a matched set. To cheer her up, Toph took her back to the circus where she once performed, though they discovered that Ty Lee's sisters were now performing an acrobatic routine there as the \"Flying Ty Sisters\". Despite an initial happiness over reuniting with her siblings, Ty Lee grew dismayed about her sisters' acrobatic abilities, as she had used those to set herself apart from them, which resulted in an argument. Storming out in frustration, she was subsequently confronted by a criminal who easily shrugged off her attempt to subdue him. However, her six sisters came to her aid and quickly overpowered her assailant. Ty Lee was grateful for their support and they all reconciled with a big hug. She realized that she could be her own person among her sisters or teammates, concluding that even with their similarities, it was sometimes better to face challenges together rather than alone."
    },
    {
      "body": "Ty Lee and ${link_0} first met in ${link_1} during a prisoner exchange, but did not directly interact. Later, when Ty Lee and her friends pursued the Avatar and ${link_2} through a forested area, she chose to battle Sokka and easily disabled him using ${link_3}. Sokka and ${link_4} were almost defeated; however, ${link_5} disposed of ${link_6} and Ty Lee by launching them into a ${link_7} using ${link_8}. Ty Lee later told Mai that Sokka was \"kind of cute\".",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Omashu",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Omashu",
            "page": "Omashu"
          }
        },
        {
          "body": "his group",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "chi blocking",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Chi_blocking",
            "page": "Chi_blocking"
          }
        },
        {
          "body": "Katara",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Appa",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Mai",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Mai",
            "page": "Mai"
          }
        },
        {
          "body": "nearby river",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Nan_Shan_River",
            "page": "Nan_Shan_River"
          }
        },
        {
          "body": "airbending",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Airbending",
            "page": "Airbending"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Love interest",
        "Sokka"
      ],
      "text": "Ty Lee and Sokka first met in Omashu during a prisoner exchange, but did not directly interact. Later, when Ty Lee and her friends pursued the Avatar and his group through a forested area, she chose to battle Sokka and easily disabled him using chi blocking. Sokka and Katara were almost defeated; however, Appa disposed of Mai and Ty Lee by launching them into a nearby river using airbending. Ty Lee later told Mai that Sokka was \"kind of cute\"."
    },
    {
      "body": "They met again while Ty Lee was overseeing an attempt to breach the ${link_0} of ${link_1} with a huge ${link_2}. Ty Lee was happy to see Sokka again, giving him a flirtatious look, to which he replied with a smile and a friendly \"hey\".",
      "links": [
        {
          "body": "Outer Wall",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se#Outer_Wall",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Fire Nation drill",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_drill",
            "page": "Fire_Nation_drill"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Love interest",
        "Sokka"
      ],
      "text": "They met again while Ty Lee was overseeing an attempt to breach the Outer Wall of Ba Sing Se with a huge Fire Nation drill. Ty Lee was happy to see Sokka again, giving him a flirtatious look, to which he replied with a smile and a friendly \"hey\"."
    },
    {
      "body": "When Sokka and Toph tried to hinder ${link_0}'s ${link_1}, Ty Lee swiftly approached him and called him a \"cutie\". Not recognizing her in her Kyoshi Warrior gear and slightly uncomfortable, he remarked that he was \"kinda involved with ${link_2}\". She smiled goofily at Sokka and attempted to block his ${link_3} after her cover was blown. However, Sokka awkwardly managed to dodge her punches, with Ty Lee coquettishly stating that it looked like they were dancing together.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Azula",
            "page": "Azula"
          }
        },
        {
          "body": "coup of Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Suki",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Suki",
            "page": "Suki"
          }
        },
        {
          "body": "chi",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Chi",
            "page": "Chi"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Love interest",
        "Sokka"
      ],
      "text": "When Sokka and Toph tried to hinder Azula's coup of Ba Sing Se, Ty Lee swiftly approached him and called him a \"cutie\". Not recognizing her in her Kyoshi Warrior gear and slightly uncomfortable, he remarked that he was \"kinda involved with Suki\". She smiled goofily at Sokka and attempted to block his chi after her cover was blown. However, Sokka awkwardly managed to dodge her punches, with Ty Lee coquettishly stating that it looked like they were dancing together."
    },
    {
      "body": "Later, after the fall of Ba Sing Se, Ty Lee returned to the Fire Nation. She and Azula visited the ${link_0} where they intervened in an attempt by ${link_1} and Sokka to rescue prisoners there. Ty Lee did not directly encounter Sokka, as she was preoccupied with fighting Suki. However, she looked somewhat sad after the fight when it seemed that Sokka and company were going to fall to their deaths because of the cables of their ${link_2} being cut.",
      "links": [
        {
          "body": "Boiling Rock",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Boiling_Rock",
            "page": "Boiling_Rock"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "gondola",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Gondola",
            "page": "Gondola"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Love interest",
        "Sokka"
      ],
      "text": "Later, after the fall of Ba Sing Se, Ty Lee returned to the Fire Nation. She and Azula visited the Boiling Rock where they intervened in an attempt by Zuko and Sokka to rescue prisoners there. Ty Lee did not directly encounter Sokka, as she was preoccupied with fighting Suki. However, she looked somewhat sad after the fight when it seemed that Sokka and company were going to fall to their deaths because of the cables of their gondola being cut."
    },
    {
      "body": "Ty Lee and Sokka saw each other again once Ty Lee was released from prison following the end of the Hundred Year War. At Zuko's coronation, she appeared before him, dressed as a Kyoshi Warrior. Sokka accused her of antagonistic motives, but Suki revealed that Ty Lee had joined her team after making up with them during their imprisonment. By this point, she had also reconciled with Suki, Sokka's current girlfriend.",
      "links": [],
      "section": [
        "Ty Lee's relationships",
        "Love interest",
        "Sokka"
      ],
      "text": "Ty Lee and Sokka saw each other again once Ty Lee was released from prison following the end of the Hundred Year War. At Zuko's coronation, she appeared before him, dressed as a Kyoshi Warrior. Sokka accused her of antagonistic motives, but Suki revealed that Ty Lee had joined her team after making up with them during their imprisonment. By this point, she had also reconciled with Suki, Sokka's current girlfriend."
    },
    {
      "body": "Ty Lee and the Kyoshi Warriors were natural enemies during the war. They first encountered each other in a forest where the warriors had nursed a lost Appa back to health. With the aid of her friends, Ty Lee defeated the warriors using chi blocking. She taunted them by saying, \"You're not prettier than we are!\" After the battle, she and her friends stole some of their uniforms, disguising themselves as allies of Earth Kingdom to infiltrate and capture Ba Sing Se.",
      "links": [],
      "section": [
        "Ty Lee's relationships",
        "Allies",
        "Kyoshi Warriors"
      ],
      "text": "Ty Lee and the Kyoshi Warriors were natural enemies during the war. They first encountered each other in a forest where the warriors had nursed a lost Appa back to health. With the aid of her friends, Ty Lee defeated the warriors using chi blocking. She taunted them by saying, \"You're not prettier than we are!\" After the battle, she and her friends stole some of their uniforms, disguising themselves as allies of Earth Kingdom to infiltrate and capture Ba Sing Se."
    },
    {
      "body": "After teaming up with Mai and betraying Azula after the battle, Ty Lee was imprisoned along with the captive Kyoshi Warriors. While together, the girls bonded with each other, with the warriors forgiving Ty Lee for her past actions. After she taught them a few lessons on chi blocking, they invited her to join their group, an offer she gladly accepted.",
      "links": [],
      "section": [
        "Ty Lee's relationships",
        "Allies",
        "Kyoshi Warriors"
      ],
      "text": "After teaming up with Mai and betraying Azula after the battle, Ty Lee was imprisoned along with the captive Kyoshi Warriors. While together, the girls bonded with each other, with the warriors forgiving Ty Lee for her past actions. After she taught them a few lessons on chi blocking, they invited her to join their group, an offer she gladly accepted."
    },
    {
      "body": "After the war ended, Ty Lee and her new team were released from prison, where she made up with her former enemy, Suki. Ty Lee became the only outsider, other than Sokka, to join the Kyoshi Warriors. She stated at Zuko's coronation as ${link_0} that they were going to be \"best friends forever\".",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Allies",
        "Kyoshi Warriors"
      ],
      "text": "After the war ended, Ty Lee and her new team were released from prison, where she made up with her former enemy, Suki. Ty Lee became the only outsider, other than Sokka, to join the Kyoshi Warriors. She stated at Zuko's coronation as Fire Lord that they were going to be \"best friends forever\"."
    },
    {
      "body": "Since the war's end, Ty Lee established a strong working relationship with the other Kyoshi Warriors. However, around 102 ${link_0}, she began to question her place on the team and thought of quitting as it made her feel like her home life as part of a matched set, several people looking and acting the same. Despite her fear of losing her individuality, Ty Lee realized that the other warriors were like sisters to her and that sometimes it was good to have the support of a team. Knowing that despite their similarities, they were also different and that she could take off her makeup once in a while, she remained on the team, continuing their strong bond.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Allies",
        "Kyoshi Warriors"
      ],
      "text": "Since the war's end, Ty Lee established a strong working relationship with the other Kyoshi Warriors. However, around 102 AG, she began to question her place on the team and thought of quitting as it made her feel like her home life as part of a matched set, several people looking and acting the same. Despite her fear of losing her individuality, Ty Lee realized that the other warriors were like sisters to her and that sometimes it was good to have the support of a team. Knowing that despite their similarities, they were also different and that she could take off her makeup once in a while, she remained on the team, continuing their strong bond."
    },
    {
      "body": "Despite their drastically differing personalities, with Ty Lee expressing an outgoing, friendly nature as opposed to Mai's stoic, very reserved manner, Mai was Ty Lee's best friend and vice versa. Even after partaking in a prank Azula devised to embarrass Mai, the two maintained a strong friendship, emphasizing the strength of their relationship. Ty Lee occasionally teased Mai for her crush on Zuko, a romance she in fact encouraged. There was discord between the two at some points, such as when Mai pointed out that Ty Lee needed the affection of ten boyfriends because of her lack of childhood attention, a statement that hurt Ty Lee deeply. Regardless, Ty Lee still demonstrated great loyalty to Mai. When Mai betrayed Azula and saved Zuko at the Boiling Rock, the Fire Nation ${link_0} questioned her reasons for her actions and prepared to duel Mai. Sensing her friend was in danger, Ty Lee unhesitatingly proceeded to block Azula's chi in order to save Mai, herself betraying the princess to whom she had previously shown immense devotion. The two girls were imprisoned on Azula's orders but were released after the end of the war.",
      "links": [
        {
          "body": "princess",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Allies",
        "Mai"
      ],
      "text": "Despite their drastically differing personalities, with Ty Lee expressing an outgoing, friendly nature as opposed to Mai's stoic, very reserved manner, Mai was Ty Lee's best friend and vice versa. Even after partaking in a prank Azula devised to embarrass Mai, the two maintained a strong friendship, emphasizing the strength of their relationship. Ty Lee occasionally teased Mai for her crush on Zuko, a romance she in fact encouraged. There was discord between the two at some points, such as when Mai pointed out that Ty Lee needed the affection of ten boyfriends because of her lack of childhood attention, a statement that hurt Ty Lee deeply. Regardless, Ty Lee still demonstrated great loyalty to Mai. When Mai betrayed Azula and saved Zuko at the Boiling Rock, the Fire Nation princess questioned her reasons for her actions and prepared to duel Mai. Sensing her friend was in danger, Ty Lee unhesitatingly proceeded to block Azula's chi in order to save Mai, herself betraying the princess to whom she had previously shown immense devotion. The two girls were imprisoned on Azula's orders but were released after the end of the war."
    },
    {
      "body": "After the Hundred Year War's conclusion, Ty Lee and Mai maintained a strong friendship, despite not being together all that often. As such, Ty Lee and the Kyoshi Warriors readily headed Mai's request to protect Zuko's protection following several threats made against his life and was tolerated by Mai to hug her.",
      "links": [],
      "section": [
        "Ty Lee's relationships",
        "Allies",
        "Mai"
      ],
      "text": "After the Hundred Year War's conclusion, Ty Lee and Mai maintained a strong friendship, despite not being together all that often. As such, Ty Lee and the Kyoshi Warriors readily headed Mai's request to protect Zuko's protection following several threats made against his life and was tolerated by Mai to hug her."
    },
    {
      "body": "Ty Lee continued to have Mai's trust, as she was asked to help gauge ${link_0}'s true intentions in regards to the ${link_1} and learn more about ${link_2}'s plans for overthrowing Zuko. Their friendship was also comfortable enough that they could voice criticism about each other, as Ty Lee berated Mai for feigning affection for Kei Lo to get him to talk, scolding her for being \"fake\" and dishonest.",
      "links": [
        {
          "body": "Kei Lo",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Kei_Lo",
            "page": "Kei_Lo"
          }
        },
        {
          "body": "New Ozai Society",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/New_Ozai_Society",
            "page": "New_Ozai_Society"
          }
        },
        {
          "body": "Ukano",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Ukano",
            "page": "Ukano"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Allies",
        "Mai"
      ],
      "text": "Ty Lee continued to have Mai's trust, as she was asked to help gauge Kei Lo's true intentions in regards to the New Ozai Society and learn more about Ukano's plans for overthrowing Zuko. Their friendship was also comfortable enough that they could voice criticism about each other, as Ty Lee berated Mai for feigning affection for Kei Lo to get him to talk, scolding her for being \"fake\" and dishonest."
    },
    {
      "body": "Ty Lee appeared to have known Zuko since their early childhood. When she joined up with Azula and Mai, they followed Zuko and ${link_0} across the world in an attempt to capture them. She seemed to accept him without any objections upon his return from exile, and even vacationed with him along with Mai and Azula to ${link_1}. When tensions rose, Zuko called her a \"circus freak\" and berated her for her boundless optimism, causing her to grow emotional and prompting her to reveal her reasons for joining the circus. She pressured him, along with the others, into openly revealing his reasons behind his recent anger. Like her friends, Ty Lee sympathized with Zuko's inner turmoil and confusion. After she and Azula fled to another gondola during a battle with Zuko and his allies, leaving them for dead, she looked uneasy and concerned, for Zuko who would have fallen to his death at that time had it not been for Mai's timely intervention.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Ember Island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Ember_Island",
            "page": "Ember_Island"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "Ty Lee appeared to have known Zuko since their early childhood. When she joined up with Azula and Mai, they followed Zuko and Iroh across the world in an attempt to capture them. She seemed to accept him without any objections upon his return from exile, and even vacationed with him along with Mai and Azula to Ember Island. When tensions rose, Zuko called her a \"circus freak\" and berated her for her boundless optimism, causing her to grow emotional and prompting her to reveal her reasons for joining the circus. She pressured him, along with the others, into openly revealing his reasons behind his recent anger. Like her friends, Ty Lee sympathized with Zuko's inner turmoil and confusion. After she and Azula fled to another gondola during a battle with Zuko and his allies, leaving them for dead, she looked uneasy and concerned, for Zuko who would have fallen to his death at that time had it not been for Mai's timely intervention."
    },
    {
      "body": "A year after the end of the Hundred Year War, Ty Lee joined the rest of the Kyoshi Warriors in protecting Zuko due to numerous assassination attempts against the new Fire Lord, and she continued to protect him the following years.",
      "links": [],
      "section": [
        "Ty Lee's relationships",
        "Allies",
        "Zuko"
      ],
      "text": "A year after the end of the Hundred Year War, Ty Lee joined the rest of the Kyoshi Warriors in protecting Zuko due to numerous assassination attempts against the new Fire Lord, and she continued to protect him the following years."
    },
    {
      "body": "Hailing from the Fire Nation and part of ${link_0}, Ty Lee was a natural enemy of the Avatar. However, her animosity toward ${link_1} was solely based on those orders. As such, the two easily got along after the conclusion of the Hundred Year War.",
      "links": [
        {
          "body": "Azula's team",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Azula%27s_team",
            "page": "Azula%27s_team"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Former enemies",
        "Aang"
      ],
      "text": "Hailing from the Fire Nation and part of Azula's team, Ty Lee was a natural enemy of the Avatar. However, her animosity toward Aang was solely based on those orders. As such, the two easily got along after the conclusion of the Hundred Year War."
    },
    {
      "body": "Ty Lee and Katara only ever met when they fought each other. They first met during a botched prisoner exchange. When Katara attempted to disable Mai using ${link_0}, Ty Lee used chi blocking to disable Katara, rendering her defenseless. This nearly resulted in Katara's defeat at the hands of Mai. Although Katara escaped unharmed along with her friends, she developed knowledge of Ty Lee's skills, stating her ability to strip her of her ${link_1} was frightening.",
      "links": [
        {
          "body": "waterbending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "bending power",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Former enemies",
        "Katara"
      ],
      "text": "Ty Lee and Katara only ever met when they fought each other. They first met during a botched prisoner exchange. When Katara attempted to disable Mai using waterbending, Ty Lee used chi blocking to disable Katara, rendering her defenseless. This nearly resulted in Katara's defeat at the hands of Mai. Although Katara escaped unharmed along with her friends, she developed knowledge of Ty Lee's skills, stating her ability to strip her of her bending power was frightening."
    },
    {
      "body": "Katara and Ty Lee fought with each other on several occasions afterward, including when Azula and her friends chased the group by following Appa's fur trail and when the Fire Nation drill prepared to penetrate the walls of Ba Sing Se. However, in the latter engagement, Katara successfully fought off Ty Lee by bending the drill's liquefied slurry, thus trapping her, and angrily called her a \"circus freak\". In her disguise as a Kyoshi Warrior at the ${link_0} in Ba Sing Se, Ty Lee overwhelmed Katara using chi blocking, resulting in Katara's capture. The two did not interact for the remainder of the Hundred Year War, nor at Zuko's coronation.",
      "links": [
        {
          "body": "Palace",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Former enemies",
        "Katara"
      ],
      "text": "Katara and Ty Lee fought with each other on several occasions afterward, including when Azula and her friends chased the group by following Appa's fur trail and when the Fire Nation drill prepared to penetrate the walls of Ba Sing Se. However, in the latter engagement, Katara successfully fought off Ty Lee by bending the drill's liquefied slurry, thus trapping her, and angrily called her a \"circus freak\". In her disguise as a Kyoshi Warrior at the Palace in Ba Sing Se, Ty Lee overwhelmed Katara using chi blocking, resulting in Katara's capture. The two did not interact for the remainder of the Hundred Year War, nor at Zuko's coronation."
    },
    {
      "body": "In the aftermath of the War, Ty Lee has since joined the Kyoshi Warriors and was present in the Fire Nation Capital when Team Avatar arrived to help Zuko and an unbound Azula to track down their long-lost mother. Although the two did not directly interact, it seems Katara and Ty Lee no longer mind each other's presence.",
      "links": [],
      "section": [
        "Ty Lee's relationships",
        "Former enemies",
        "Katara"
      ],
      "text": "In the aftermath of the War, Ty Lee has since joined the Kyoshi Warriors and was present in the Fire Nation Capital when Team Avatar arrived to help Zuko and an unbound Azula to track down their long-lost mother. Although the two did not directly interact, it seems Katara and Ty Lee no longer mind each other's presence."
    },
    {
      "body": "During the Hundred Year War, Ty Lee only knew Toph as an ally of the Avatar and thus her enemy. After the conclusion of the War, Ty Lee joined the Kyoshi Warriors and thus had no reason to be antagonistic toward Toph anymore. By 102 AG, the relation between the girls had reached the point where Ty Lee trusted Toph with why she was feeling down and Toph took notice of the negative change in Ty Lee's attitude, caring enough to try and lift the girl's spirits. When they encountered Ty Lee's sisters, which increased Ty Lee's gloomy attitude as she felt down over being part of a matched set, Toph commented that Ty Lee was her favorite out of the seven identical Ty sisters.",
      "links": [],
      "section": [
        "Ty Lee's relationships",
        "Former enemies",
        "Toph Beifong"
      ],
      "text": "During the Hundred Year War, Ty Lee only knew Toph as an ally of the Avatar and thus her enemy. After the conclusion of the War, Ty Lee joined the Kyoshi Warriors and thus had no reason to be antagonistic toward Toph anymore. By 102 AG, the relation between the girls had reached the point where Ty Lee trusted Toph with why she was feeling down and Toph took notice of the negative change in Ty Lee's attitude, caring enough to try and lift the girl's spirits. When they encountered Ty Lee's sisters, which increased Ty Lee's gloomy attitude as she felt down over being part of a matched set, Toph commented that Ty Lee was her favorite out of the seven identical Ty sisters."
    },
    {
      "body": "Azula and Ty Lee had a somewhat complicated relationship due to their contrasting personalities; while Azula was mean-spirited, a great strategist, intimidating and socially inept, Ty Lee was warmhearted, friendly, and highly social. Although Ty Lee seemed to enjoy the princess's company when they were younger, many of her actions seemed to be based out of fear of Azula as she grew older. Ty Lee met Azula in the ${link_0} along with Mai. During their childhood, Azula laughed as she pushed Ty Lee down after the latter upstaged her in performing a series of cartwheels and somersaults, much to Ty Lee's dismay. Soon, however, the two happily teamed up to play a prank on Mai and Zuko.",
      "links": [
        {
          "body": "Royal Fire Academy for Girls",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Royal_Fire_Academy_for_Girls",
            "page": "Royal_Fire_Academy_for_Girls"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Former ally",
        "Azula"
      ],
      "text": "Azula and Ty Lee had a somewhat complicated relationship due to their contrasting personalities; while Azula was mean-spirited, a great strategist, intimidating and socially inept, Ty Lee was warmhearted, friendly, and highly social. Although Ty Lee seemed to enjoy the princess's company when they were younger, many of her actions seemed to be based out of fear of Azula as she grew older. Ty Lee met Azula in the Royal Fire Academy for Girls along with Mai. During their childhood, Azula laughed as she pushed Ty Lee down after the latter upstaged her in performing a series of cartwheels and somersaults, much to Ty Lee's dismay. Soon, however, the two happily teamed up to play a prank on Mai and Zuko."
    },
    {
      "body": "When Azula came to recruit her for a mission to capture Zuko and Iroh (and soon after, Aang), Ty Lee initially declined, stating she enjoyed living at the ${link_0}. When Azula nonchalantly stated she would be attending Ty Lee's performance later that evening, Ty Lee expressed notable uneasiness. During the circus' show, Azula made it as dangerous for Ty Lee as possible; so much so, that Ty Lee nearly faulted when performing an acrobatic stance. Later, when Azula said she was looking forward to the next day's show, Ty Lee quickly abandoned her peaceful life and left with Azula.",
      "links": [
        {
          "body": "Fire Nation circus",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_circus",
            "page": "Fire_Nation_circus"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Former ally",
        "Azula"
      ],
      "text": "When Azula came to recruit her for a mission to capture Zuko and Iroh (and soon after, Aang), Ty Lee initially declined, stating she enjoyed living at the Fire Nation circus. When Azula nonchalantly stated she would be attending Ty Lee's performance later that evening, Ty Lee expressed notable uneasiness. During the circus' show, Azula made it as dangerous for Ty Lee as possible; so much so, that Ty Lee nearly faulted when performing an acrobatic stance. Later, when Azula said she was looking forward to the next day's show, Ty Lee quickly abandoned her peaceful life and left with Azula."
    },
    {
      "body": "While Ty Lee, at one point, regarded Azula as a friend, it was apparent that she formulated a fear of the princess and was hesitant to disobey her. She seemed to have more respect for Azula, however, as opposed to Mai. When Azula ordered them to follow the Avatar's friends, she continued the pursuit, even jumping into a canal of slurry which Mai refused to approach. She looked up to the princess to a certain degree, openly admiring her confidence.",
      "links": [],
      "section": [
        "Ty Lee's relationships",
        "Former ally",
        "Azula"
      ],
      "text": "While Ty Lee, at one point, regarded Azula as a friend, it was apparent that she formulated a fear of the princess and was hesitant to disobey her. She seemed to have more respect for Azula, however, as opposed to Mai. When Azula ordered them to follow the Avatar's friends, she continued the pursuit, even jumping into a canal of slurry which Mai refused to approach. She looked up to the princess to a certain degree, openly admiring her confidence."
    },
    {
      "body": "Ty Lee seemed to care about Azula's opinions of her and other matters, emphasized when she immediately began crying after Azula insulted her. Azula seemed to care about her friend's feelings to a certain degree, expressing genuine remorse for her actions. However, when Zuko called Ty Lee a \"circus freak\", Azula laughed coldly, contrasting her earlier actions. Ty Lee ventured to the Boiling Rock prison with Azula and fought alongside her until Azula discovered that Mai helped Zuko escape. When Mai was captured, Azula prepared to strike her down out of rage. However, Ty Lee chose to block Azula's chi to save Mai. Azula had them locked away, with Ty Lee giving her one last look of defiance before she was taken away.",
      "links": [],
      "section": [
        "Ty Lee's relationships",
        "Former ally",
        "Azula"
      ],
      "text": "Ty Lee seemed to care about Azula's opinions of her and other matters, emphasized when she immediately began crying after Azula insulted her. Azula seemed to care about her friend's feelings to a certain degree, expressing genuine remorse for her actions. However, when Zuko called Ty Lee a \"circus freak\", Azula laughed coldly, contrasting her earlier actions. Ty Lee ventured to the Boiling Rock prison with Azula and fought alongside her until Azula discovered that Mai helped Zuko escape. When Mai was captured, Azula prepared to strike her down out of rage. However, Ty Lee chose to block Azula's chi to save Mai. Azula had them locked away, with Ty Lee giving her one last look of defiance before she was taken away."
    },
    {
      "body": "Like Mai, Ty Lee seemed to have little sympathy for Azula. She did not mention Azula after the Hundred Year War ended, instead choosing to move on and befriend the Kyoshi Warriors, whom she promptly joined.",
      "links": [],
      "section": [
        "Ty Lee's relationships",
        "Former ally",
        "Azula"
      ],
      "text": "Like Mai, Ty Lee seemed to have little sympathy for Azula. She did not mention Azula after the Hundred Year War ended, instead choosing to move on and befriend the Kyoshi Warriors, whom she promptly joined."
    },
    {
      "body": "As part of her new life, she was tasked to guard Azula together with Suki on Zuko's request. When the princess attacked her brother, Ty Lee was quick to chi block Azula, earning her a scolded question from the princess, asking her when \"she\", referring to Ursa, had managed to take away Ty Lee's fear for her. The chi blocker commented that Azula made no sense, though after she left the room, she admitted to Zuko and Suki that Azula had been wrong and that she had never lost her fear for the girl. Later, when Azula constantly mocked Zuko and his friends as they prepared to set out to find Ursa, Ty Lee scolded Azula for always being mean to those around her. These feelings for the princess remained, as Ty Lee admitted to Mai that she feared for their safety after learning that Azula had disappeared in the ${link_0}. Wondering if Azula still desired revenge for having been betrayed, Ty Lee noted to have been unable to maintain a \"peaceful aura\", constantly checking her surroundings in the event that the princess ever reemerged.",
      "links": [
        {
          "body": "Forgetful Valley",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Forgetful_Valley",
            "page": "Forgetful_Valley"
          }
        }
      ],
      "section": [
        "Ty Lee's relationships",
        "Former ally",
        "Azula"
      ],
      "text": "As part of her new life, she was tasked to guard Azula together with Suki on Zuko's request. When the princess attacked her brother, Ty Lee was quick to chi block Azula, earning her a scolded question from the princess, asking her when \"she\", referring to Ursa, had managed to take away Ty Lee's fear for her. The chi blocker commented that Azula made no sense, though after she left the room, she admitted to Zuko and Suki that Azula had been wrong and that she had never lost her fear for the girl. Later, when Azula constantly mocked Zuko and his friends as they prepared to set out to find Ursa, Ty Lee scolded Azula for always being mean to those around her. These feelings for the princess remained, as Ty Lee admitted to Mai that she feared for their safety after learning that Azula had disappeared in the Forgetful Valley. Wondering if Azula still desired revenge for having been betrayed, Ty Lee noted to have been unable to maintain a \"peaceful aura\", constantly checking her surroundings in the event that the princess ever reemerged."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Ty_Lee%27s_relationships",
    "file": "avatar.wikia.com/wiki/Ty_Lee's_relationships.html",
    "page": "Ty_Lee's_relationships",
    "title": "Ty Lee's relationships"
  }
}