{
  "categories": [
    {
      "body": "A-class articles",
      "target": {
        "href": "Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Fauna",
      "target": {
        "href": "Category_Fauna",
        "page": "Category_Fauna"
      }
    },
    {
      "body": "Non-hybrid creatures",
      "target": {
        "href": "Category_Non-hybrid_creatures",
        "page": "Category_Non-hybrid_creatures"
      }
    }
  ],
  "facts": [
    {
      "key": "Habitat",
      "value": [
        {
          "body": "${link_0}, ${link_1}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Kyoshi Island",
              "key": "${link_0}",
              "target": {
                "href": "Kyoshi_Island",
                "page": "Kyoshi_Island"
              }
            },
            {
              "body": "Earth Kingdom",
              "key": "${link_1}",
              "target": {
                "href": "Earth_Kingdom",
                "page": "Earth_Kingdom"
              }
            }
          ],
          "text": "Kyoshi Island, Earth Kingdom",
          "value": "${link_0}, ${link_1}",
          "value_text": "Kyoshi Island, Earth Kingdom"
        }
      ]
    },
    {
      "key": "Status",
      "value": [
        {
          "body": "Active",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Active",
          "value": "Active",
          "value_text": "Active"
        }
      ]
    },
    {
      "key": "Uses",
      "value": [
        {
          "body": "Extinguishing fires, execution",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Extinguishing fires, execution",
          "value": "Extinguishing fires, execution",
          "value_text": "Extinguishing fires, execution"
        }
      ]
    },
    {
      "key": "First Appearance",
      "value": [
        {
          "body": "\"${link_0}\" (only appearance)",
          "extra": "(only appearance)",
          "extra_text": "(only appearance)",
          "links": [
            {
              "body": "The Warriors of Kyoshi",
              "key": "${link_0}",
              "target": {
                "href": "The_Warriors_of_Kyoshi",
                "page": "The_Warriors_of_Kyoshi"
              }
            }
          ],
          "text": "\"The Warriors of Kyoshi\" (only appearance)",
          "value": "\"${link_0}\"",
          "value_text": "\"The Warriors of Kyoshi\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "The unagi is an enormous, powerful, and carnivorous ${link_0} capable of firing large jets of water from its mouth at high velocities.",
      "links": [
        {
          "body": "eel",
          "key": "${link_0}",
          "target": {
            "href": "Fauna_in_the_World_of_Avatar",
            "page": "Fauna_in_the_World_of_Avatar"
          }
        }
      ],
      "text": "The unagi is an enormous, powerful, and carnivorous eel capable of firing large jets of water from its mouth at high velocities."
    },
    {
      "body": "While visiting ${link_0}, ${link_1} engaged in a pastime of surfing on the ${link_2} living off the coast of the isle. Not long into his recreation, he encountered the unagi, who was hunting the elephant koi. Dragging the fish underwater one by one, the unagi also attacked the one Aang had mounted, consequentially launching him into the water. The giant eel proceeded to pursue the ${link_3}, but he managed to escape to the safety of the beach before the unagi could swallow him. The creature was later referenced by the ${link_4} as a means of coercion by threatening to feed Aang and ${link_5} to the unagi.",
      "links": [
        {
          "body": "Kyoshi Island",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "elephant koi",
          "key": "${link_2}",
          "target": {
            "href": "Elephant_koi",
            "page": "Elephant_koi"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Kyoshi Warriors",
          "key": "${link_4}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "his friends",
          "key": "${link_5}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "While visiting Kyoshi Island, Aang engaged in a pastime of surfing on the elephant koi living off the coast of the isle. Not long into his recreation, he encountered the unagi, who was hunting the elephant koi. Dragging the fish underwater one by one, the unagi also attacked the one Aang had mounted, consequentially launching him into the water. The giant eel proceeded to pursue the Avatar, but he managed to escape to the safety of the beach before the unagi could swallow him. The creature was later referenced by the Kyoshi Warriors as a means of coercion by threatening to feed Aang and his friends to the unagi."
    },
    {
      "body": "${link_0} narrowly avoided being eaten by the unagi by holding on to one of its barbels.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Aang narrowly avoided being eaten by the unagi by holding on to one of its barbels."
    },
    {
      "body": "The unagi confronted Aang again the following day, when the latter desired to ride the creature in order to impress a crowd of adoring girls. After hours of inactivity from the eel and in response to Katara's prompting, Aang began advancing back toward the shore; however, the unagi arrived and initiated a chase. Before Aang had realized the creature's presence, the eel had already lifted him out of the water using a portion of its midsection. Glaring directly into the face of the vulnerable ${link_0}, the unagi unleashed a powerful blast of water from its mouth, prompting Aang to brace himself by clutching the creature's fin. Having failed to blast its prey into the water, the eel snapped at Aang, albeit to no avail, as he had managed to evade the attack by jumping up and grabbing hold of one of the creature's barbels. The unagi thrashed its head about in an attempt to fling off the Avatar and eventually succeeded, causing Aang to plummet into the water, where he floated unconsciously. The unagi raced toward its prey underwater, but as it emerged in front of Aang, ${link_1} had already reached the unconscious Avatar and managed to evade the unagi's wild launch at them by distancing Aang and herself from the creature with her ${link_2}. Enraged by their escape, the creature spewed vicious jet-streams of water in different directions though dove under once more upon the arrival of ${link_3}.",
      "links": [
        {
          "body": "airbender",
          "key": "${link_0}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_2}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Zuko's ship",
          "key": "${link_3}",
          "target": {
            "href": "Zuko%27s_ship",
            "page": "Zuko%27s_ship"
          }
        }
      ],
      "text": "The unagi confronted Aang again the following day, when the latter desired to ride the creature in order to impress a crowd of adoring girls. After hours of inactivity from the eel and in response to Katara's prompting, Aang began advancing back toward the shore; however, the unagi arrived and initiated a chase. Before Aang had realized the creature's presence, the eel had already lifted him out of the water using a portion of its midsection. Glaring directly into the face of the vulnerable airbender, the unagi unleashed a powerful blast of water from its mouth, prompting Aang to brace himself by clutching the creature's fin. Having failed to blast its prey into the water, the eel snapped at Aang, albeit to no avail, as he had managed to evade the attack by jumping up and grabbing hold of one of the creature's barbels. The unagi thrashed its head about in an attempt to fling off the Avatar and eventually succeeded, causing Aang to plummet into the water, where he floated unconsciously. The unagi raced toward its prey underwater, but as it emerged in front of Aang, Katara had already reached the unconscious Avatar and managed to evade the unagi's wild launch at them by distancing Aang and herself from the creature with her waterbending. Enraged by their escape, the creature spewed vicious jet-streams of water in different directions though dove under once more upon the arrival of Zuko's ship."
    },
    {
      "body": "The unagi was coaxed by ${link_0} into spewing a gentle rain to extinguish widespread fires on ${link_1}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        }
      ],
      "text": "The unagi was coaxed by Aang into spewing a gentle rain to extinguish widespread fires on Kyoshi Island."
    },
    {
      "body": "The unagi had one final encounter with Aang later that day; when Team Avatar was leaving on ${link_0} to escape the ${link_1} ${link_2} raiding Kyoshi Island, Aang dove into the water and emerged atop the unagi. Using the barbels located on either side of the eel's head, Aang forced the creature to spray water on the burning buildings, extinguishing the flames consuming the nearby village. As Aang leaped off its head, the unagi returned beneath the surface of the water and proceeded to snake through the bay, with parts of its body breaching occasionally.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "soldiers",
          "key": "${link_2}",
          "target": {
            "href": "Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        }
      ],
      "text": "The unagi had one final encounter with Aang later that day; when Team Avatar was leaving on Appa to escape the Fire Nation soldiers raiding Kyoshi Island, Aang dove into the water and emerged atop the unagi. Using the barbels located on either side of the eel's head, Aang forced the creature to spray water on the burning buildings, extinguishing the flames consuming the nearby village. As Aang leaped off its head, the unagi returned beneath the surface of the water and proceeded to snake through the bay, with parts of its body breaching occasionally."
    },
    {
      "body": "The unagi's dorsal fin dwarfs a human when fully erected.",
      "links": [],
      "text": "The unagi's dorsal fin dwarfs a human when fully erected."
    },
    {
      "body": "The unagi's body is long and serpentine, with no scales and minimal aposematic coloration. While uniformly light gray in appearance ventrally, the creature's dorsal surface is primarily dark gray with light gray segments over both cheeks and a light gray stripe extending down the midline of the body. Located posteriorly to the head are four yellow stripes similar in appearance to gill slits.",
      "links": [],
      "text": "The unagi's body is long and serpentine, with no scales and minimal aposematic coloration. While uniformly light gray in appearance ventrally, the creature's dorsal surface is primarily dark gray with light gray segments over both cheeks and a light gray stripe extending down the midline of the body. Located posteriorly to the head are four yellow stripes similar in appearance to gill slits."
    },
    {
      "body": "A large dorsal fin protrudes from the top of the unagi's head, consisting of six spines interconnected by cartilage that allow the creature to expand and contract the structure during movement. Behind the primary dorsal fin are a series of evenly dispersed finlets that gradually increase in size toward the caudal end of the body.",
      "links": [],
      "text": "A large dorsal fin protrudes from the top of the unagi's head, consisting of six spines interconnected by cartilage that allow the creature to expand and contract the structure during movement. Behind the primary dorsal fin are a series of evenly dispersed finlets that gradually increase in size toward the caudal end of the body."
    },
    {
      "body": "The unagi has bright green eyes protected by a pair of pink, vertically-oriented nictitating membranes as well as a pair of light gray, horizontal eyelids. The creature's mouth is lined with sixteen pairs of sharp, interlocking teeth oriented backward and is flanked on either side by a pair of sensory barbels. Inside the creature's body just posterior to the jaw musculature are specialized glands that allow the unagi to launch pressurized streams of water from its mouth.",
      "links": [],
      "text": "The unagi has bright green eyes protected by a pair of pink, vertically-oriented nictitating membranes as well as a pair of light gray, horizontal eyelids. The creature's mouth is lined with sixteen pairs of sharp, interlocking teeth oriented backward and is flanked on either side by a pair of sensory barbels. Inside the creature's body just posterior to the jaw musculature are specialized glands that allow the unagi to launch pressurized streams of water from its mouth."
    },
    {
      "body": "The unagi stuns its prey using powerful blasts of water.",
      "links": [],
      "text": "The unagi stuns its prey using powerful blasts of water."
    },
    {
      "body": "The unagi is a carnivorous predator that will consume anything that it encounters in the water, with a particular preference for the elephant koi found in the waters surrounding Kyoshi Island. It is capable of launching powerful streams of water from its mouth as a means of subduing prey and deterring external threats.",
      "links": [],
      "text": "The unagi is a carnivorous predator that will consume anything that it encounters in the water, with a particular preference for the elephant koi found in the waters surrounding Kyoshi Island. It is capable of launching powerful streams of water from its mouth as a means of subduing prey and deterring external threats."
    },
    {
      "body": "Because of its aggressive nature, the residents of Kyoshi Island typically avoid the bay in which the unagi is found. Despite its tendency to lash out, the unagi has an instinctive fear of anything that exceeds it in size, and it can be controlled, to some extent, by its barbels, as demonstrated by Aang when he forced the unagi to spray water over the burning Kyoshi Village.",
      "links": [],
      "text": "Because of its aggressive nature, the residents of Kyoshi Island typically avoid the bay in which the unagi is found. Despite its tendency to lash out, the unagi has an instinctive fear of anything that exceeds it in size, and it can be controlled, to some extent, by its barbels, as demonstrated by Aang when he forced the unagi to spray water over the burning Kyoshi Village."
    },
    {
      "body": "The unagi has many attributes found in members of Anguilliformes, particularly to several species of carnivorous freshwater eels also known for their serpentine appearance. Its use of pressurized jets of water to stun prey also resembles the hunting strategy employed by archerfish, which use their specialized jaw musculature to strike terrestrial insects with pressurized water droplets.",
      "links": [],
      "text": "The unagi has many attributes found in members of Anguilliformes, particularly to several species of carnivorous freshwater eels also known for their serpentine appearance. Its use of pressurized jets of water to stun prey also resembles the hunting strategy employed by archerfish, which use their specialized jaw musculature to strike terrestrial insects with pressurized water droplets."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Unagi",
    "file": "avatar.wikia.com/wiki/Unagi.html",
    "page": "Unagi",
    "title": "Unagi"
  }
}