{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Companies",
      "target": {
        "href": "Category_Companies",
        "page": "Category_Companies"
      }
    },
    {
      "body": "Real world",
      "target": {
        "href": "Category_Real_world",
        "page": "Category_Real_world"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This is the Upper Deck Company logo.",
      "links": [],
      "text": "This is the Upper Deck Company logo."
    },
    {
      "body": "The Upper Deck Company, LLC is a company known mostly for its involvement in the sports cards and collectibles industry. Formed in 1988, with its first set of collectible sports cards being released the following year, Upper Deck soon formed a name for itself; however, it wasn't until a decade later when, through an agreement with Konami Digital Entertainment Co., Ltd. Japan, they were granted the rights to distribute several other-language versions of the Yu-Gi-Oh! Trading Card Game, but lost these rights after a lawsuit regarding counterfeit cards. Furthermore, its Upper Deck Entertainment brand specialized in the development of the QuickStrike TCG system, for which the first release was the ${link_0}. Compatible with this game was its Pirates of the Caribbean counterpart, neither of which enjoyed significant success. Despite acquiring licenses to release several other trading cards for different companies, such as Marvel Studios, DC Comics, and rights for a World of Warcraft game, these have since been canceled, with Upper Deck Entertainment losing the rights to the World of Warcraft TCG in mid-2010. The lack of success in this area has not prevented the company from remaining at the forefront of collectible sports cards, and Upper Deck continues to produce NBA, MLB, and NHL collectible trading cards; some of the company's hallmark products, with the baseball cards having been its original sales item in 1989. Upper Deck is now an internationally renowned company popular for the distribution of numerous trading card franchises.",
      "links": [
        {
          "body": "Avatar: The Last Airbender Trading Card Game",
          "key": "${link_0}",
          "target": {
            "href": "Avatar__The_Last_Airbender_Trading_Card_Game",
            "page": "Avatar__The_Last_Airbender_Trading_Card_Game"
          }
        }
      ],
      "text": "The Upper Deck Company, LLC is a company known mostly for its involvement in the sports cards and collectibles industry. Formed in 1988, with its first set of collectible sports cards being released the following year, Upper Deck soon formed a name for itself; however, it wasn't until a decade later when, through an agreement with Konami Digital Entertainment Co., Ltd. Japan, they were granted the rights to distribute several other-language versions of the Yu-Gi-Oh! Trading Card Game, but lost these rights after a lawsuit regarding counterfeit cards. Furthermore, its Upper Deck Entertainment brand specialized in the development of the QuickStrike TCG system, for which the first release was the Avatar: The Last Airbender Trading Card Game. Compatible with this game was its Pirates of the Caribbean counterpart, neither of which enjoyed significant success. Despite acquiring licenses to release several other trading cards for different companies, such as Marvel Studios, DC Comics, and rights for a World of Warcraft game, these have since been canceled, with Upper Deck Entertainment losing the rights to the World of Warcraft TCG in mid-2010. The lack of success in this area has not prevented the company from remaining at the forefront of collectible sports cards, and Upper Deck continues to produce NBA, MLB, and NHL collectible trading cards; some of the company's hallmark products, with the baseball cards having been its original sales item in 1989. Upper Deck is now an internationally renowned company popular for the distribution of numerous trading card franchises."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Upper_Deck_Company",
    "file": "avatar.wikia.com/wiki/Upper_Deck_Company.html",
    "page": "Upper_Deck_Company",
    "title": "Upper Deck Company"
  }
}