{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "external": false,
        "href": "/wiki/Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Objects",
      "target": {
        "external": false,
        "href": "/wiki/Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Vehicles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Vehicles",
        "page": "Category_Vehicles"
      }
    },
    {
      "body": "Water Tribes",
      "target": {
        "external": false,
        "href": "/wiki/Category_Water_Tribes",
        "page": "Category_Water_Tribes"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Varrick's yacht is a luxurious boat used by the shipping magnate to travel around the world, flaunting his flamboyant lifestyle, though ${link_0} has also claimed that he built it to escape clingy women.",
      "links": [
        {
          "body": "Varrick",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        }
      ],
      "section": [
        "Varrick's yacht"
      ],
      "text": "Varrick's yacht is a luxurious boat used by the shipping magnate to travel around the world, flaunting his flamboyant lifestyle, though Varrick has also claimed that he built it to escape clingy women."
    },
    {
      "body": "In 171 ${link_0}, Varrick's yacht was docked in the ${link_1} harbor, and Varrick entertained a number of guests, including ${link_2} and ${link_3}, on the ship prior to the ${link_4} banquet. He demonstrated his supposed levitation abilities to his audience, though Bolin was quick to point out that he did not actually appear to have been levitating. Bolin's ignorance was mistaken as frankness and Varrick decided he liked the two foreigners, opposed to how he felt about his ${link_5}, whom he held responsible for his failed levitation attempt and fired thereafter. Varrick later introduced Asami and Bolin to his newest venture, motion pictures. Asami attempted to steer the conversation back toward her goal of a ${link_6} shipping deal, to which Varrick quickly agreed, intending to sort out the details of the agreement later that day during the royal feast. With their business concluded, Varrick excitedly invited everyone on a rocket-boat ride.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Asami",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Asami_Sato",
            "page": "Asami_Sato"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Glacier Spirits Festival",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Glacier_Spirits_Festival",
            "page": "Glacier_Spirits_Festival"
          }
        },
        {
          "body": "swami",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Swami",
            "page": "Swami"
          }
        },
        {
          "body": "Future Industries",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Future_Industries",
            "page": "Future_Industries"
          }
        }
      ],
      "section": [
        "Varrick's yacht",
        "History"
      ],
      "text": "In 171 AG, Varrick's yacht was docked in the Southern Water Tribe harbor, and Varrick entertained a number of guests, including Asami and Bolin, on the ship prior to the Glacier Spirits Festival banquet. He demonstrated his supposed levitation abilities to his audience, though Bolin was quick to point out that he did not actually appear to have been levitating. Bolin's ignorance was mistaken as frankness and Varrick decided he liked the two foreigners, opposed to how he felt about his swami, whom he held responsible for his failed levitation attempt and fired thereafter. Varrick later introduced Asami and Bolin to his newest venture, motion pictures. Asami attempted to steer the conversation back toward her goal of a Future Industries shipping deal, to which Varrick quickly agreed, intending to sort out the details of the agreement later that day during the royal feast. With their business concluded, Varrick excitedly invited everyone on a rocket-boat ride."
    },
    {
      "body": "After the ${link_0}, Varrick's yacht was one of the many ships that were left unable to leave due to the harbor lock-down by Northern naval forces. A few days later, Varrick and ${link_1} managed to get on board the yacht for the purpose of breaking the blockade and rescuing ${link_2} and the other rebel prisoners. After ${link_3} ${link_4} stated that she needed to get into the air to waterbend the Northern ships out of the way, Varrick revealed he had a ${link_5} on board kept under a hatch beneath deck, but Asami pointed out that there was no runway on the vessel; Varrick subsequently told his assistant, ${link_6}, to make a note to build a runway on the yacht for later. Despite this, Korra and Mako were able to firebend to give the biplane enough thrust to take off as Asami piloted. Korra subsequently went into the Avatar State to waterbend the battleships out of the way as Varrick drove his yacht past them, and they successfully managed to free the prisoners. However, after dropping the rebels back at the Southern Water Tribe so they could continue the fight against the north, Varrick spotted Eska traveling right at them, a look of intense fury on her face, and at Bolin's encouragement, drove the ship away at full speed.",
      "links": [
        {
          "body": "winter solstice",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Winter_solstice",
            "page": "Winter_solstice"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "biplane",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Biplane",
            "page": "Biplane"
          }
        },
        {
          "body": "Zhu Li",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        }
      ],
      "section": [
        "Varrick's yacht",
        "History"
      ],
      "text": "After the winter solstice, Varrick's yacht was one of the many ships that were left unable to leave due to the harbor lock-down by Northern naval forces. A few days later, Varrick and Team Avatar managed to get on board the yacht for the purpose of breaking the blockade and rescuing Tonraq and the other rebel prisoners. After Avatar Korra stated that she needed to get into the air to waterbend the Northern ships out of the way, Varrick revealed he had a biplane on board kept under a hatch beneath deck, but Asami pointed out that there was no runway on the vessel; Varrick subsequently told his assistant, Zhu Li, to make a note to build a runway on the yacht for later. Despite this, Korra and Mako were able to firebend to give the biplane enough thrust to take off as Asami piloted. Korra subsequently went into the Avatar State to waterbend the battleships out of the way as Varrick drove his yacht past them, and they successfully managed to free the prisoners. However, after dropping the rebels back at the Southern Water Tribe so they could continue the fight against the north, Varrick spotted Eska traveling right at them, a look of intense fury on her face, and at Bolin's encouragement, drove the ship away at full speed."
    },
    {
      "body": "Korra later used Varrick's yacht to return to the ${link_0} in order to confront ${link_1} and his followers.",
      "links": [
        {
          "body": "South Pole",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "Hundun",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hundun",
            "page": "Hundun"
          }
        }
      ],
      "section": [
        "Varrick's yacht",
        "History"
      ],
      "text": "Korra later used Varrick's yacht to return to the South Pole in order to confront Hundun and his followers."
    },
    {
      "body": "The yacht is predominantly white, with blue accents and a blue insignia. It has at least three floors, and the room Asami and Bolin met Varrick in was quite spacious, comfortably accommodating several guests on floor cushions. At the front of the vessel is a hatch containing a biplane, though there is a lack of a runway long enough to allow the plane to take off.",
      "links": [],
      "section": [
        "Varrick's yacht",
        "Design"
      ],
      "text": "The yacht is predominantly white, with blue accents and a blue insignia. It has at least three floors, and the room Asami and Bolin met Varrick in was quite spacious, comfortably accommodating several guests on floor cushions. At the front of the vessel is a hatch containing a biplane, though there is a lack of a runway long enough to allow the plane to take off."
    },
    {
      "body": "In terms of mobility, the vehicle was able to outpace even a high-class waterbender in the water.",
      "links": [],
      "section": [
        "Varrick's yacht",
        "Design"
      ],
      "text": "In terms of mobility, the vehicle was able to outpace even a high-class waterbender in the water."
    },
    {
      "body": "The blue ship logo on the yacht appears on a number of other items associated with Varrick, including the snowsuit he provided for Bolin, the biplane he had on his yacht, and speedboats from his ships.",
      "links": [],
      "section": [
        "Varrick's yacht",
        "Trivia"
      ],
      "text": "The blue ship logo on the yacht appears on a number of other items associated with Varrick, including the snowsuit he provided for Bolin, the biplane he had on his yacht, and speedboats from his ships."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Varrick%27s_yacht",
    "file": "avatar.wikia.com/wiki/Varrick's_yacht.html",
    "page": "Varrick's_yacht",
    "title": "Varrick's yacht"
  }
}