{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Establishments",
      "target": {
        "href": "Category_Establishments",
        "page": "Category_Establishments"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Spirit World",
      "target": {
        "href": "Category_Spirit_World",
        "page": "Category_Spirit_World"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "${link_0}; central ${link_1} (formerly), ${link_2}",
          "extra": "(formerly)",
          "extra_text": "(formerly)",
          "links": [
            {
              "body": "Si Wong Desert",
              "key": "${link_0}",
              "target": {
                "href": "Si_Wong_Desert",
                "page": "Si_Wong_Desert"
              }
            },
            {
              "body": "Earth Kingdom",
              "key": "${link_1}",
              "target": {
                "href": "Earth_Kingdom",
                "page": "Earth_Kingdom"
              }
            },
            {
              "body": "Spirit World",
              "key": "${link_2}",
              "target": {
                "href": "Spirit_World",
                "page": "Spirit_World"
              }
            }
          ],
          "text": "Si Wong Desert; central Earth Kingdom (formerly), Spirit World",
          "value": "${link_0}; central ${link_1} , ${link_2}",
          "value_text": "Si Wong Desert; central Earth Kingdom , Spirit World"
        }
      ]
    },
    {
      "key": "Ruler",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Wan Shi Tong",
              "key": "${link_0}",
              "target": {
                "href": "Wan_Shi_Tong",
                "page": "Wan_Shi_Tong"
              }
            }
          ],
          "text": "Wan Shi Tong",
          "value": "${link_0}",
          "value_text": "Wan Shi Tong"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\" (flashback only)",
          "extra": "(flashback only)",
          "extra_text": "(flashback only)",
          "links": [
            {
              "body": "The Siege of the North, Part 1",
              "key": "${link_0}",
              "target": {
                "href": "The_Siege_of_the_North%2c_Part_1",
                "page": "The_Siege_of_the_North%2c_Part_1"
              }
            }
          ],
          "text": "\"The Siege of the North, Part 1\" (flashback only)",
          "value": "\"${link_0}\"",
          "value_text": "\"The Siege of the North, Part 1\""
        },
        {
          "body": "\"${link_0}\" (actual)",
          "extra": "(actual)",
          "extra_text": "(actual)",
          "links": [
            {
              "body": "The Library",
              "key": "${link_0}",
              "target": {
                "href": "The_Library",
                "page": "The_Library"
              }
            }
          ],
          "text": "\"The Library\" (actual)",
          "value": "\"${link_0}\"",
          "value_text": "\"The Library\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Wan Shi Tong's Library, also called Wan Shi Tong's Spirit Library, is an enormous library located in the ${link_0}. Until 100 ${link_1}, however, it could be found in the central ${link_2} and was a popular destination for many adventurers. The library was considered to be very difficult to locate, as it was almost completely buried under desert sand.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "AG",
          "key": "${link_1}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_2}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        }
      ],
      "text": "Wan Shi Tong's Library, also called Wan Shi Tong's Spirit Library, is an enormous library located in the Spirit World. Until 100 AG, however, it could be found in the central Si Wong Desert and was a popular destination for many adventurers. The library was considered to be very difficult to locate, as it was almost completely buried under desert sand."
    },
    {
      "body": "${link_0} searched for knowledge about the ${link_1} in one of the many rooms of the library.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Water Tribes",
          "key": "${link_1}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        }
      ],
      "text": "Zhao searched for knowledge about the Water Tribes in one of the many rooms of the library."
    },
    {
      "body": "Several thousand years before ${link_0}'s arrival at the Si Wong Desert in 100 AG, ${link_1} built the library with the intention of preserving all the world's knowledge. With time, it eventually held a vast, ancient collection of books, gathered by the spirit's ${link_2}. At one point in time, the library was accessible to humans, as Wan Shi Tong hoped they would benefit from the vast amount of information. However, some humans sought secrets that would destroy their enemies. Angered by the abuse of his knowledge, Wan Shi Tong closed the library.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Wan Shi Tong",
          "key": "${link_1}",
          "target": {
            "href": "Wan_Shi_Tong",
            "page": "Wan_Shi_Tong"
          }
        },
        {
          "body": "Knowledge Seekers",
          "key": "${link_2}",
          "target": {
            "href": "Knowledge_Seekers",
            "page": "Knowledge_Seekers"
          }
        }
      ],
      "text": "Several thousand years before Team Avatar's arrival at the Si Wong Desert in 100 AG, Wan Shi Tong built the library with the intention of preserving all the world's knowledge. With time, it eventually held a vast, ancient collection of books, gathered by the spirit's Knowledge Seekers. At one point in time, the library was accessible to humans, as Wan Shi Tong hoped they would benefit from the vast amount of information. However, some humans sought secrets that would destroy their enemies. Angered by the abuse of his knowledge, Wan Shi Tong closed the library."
    },
    {
      "body": "Eventually, the location of the library was lost to mankind. Though the building of the library is the size of a large palace, most of it lay buried beneath the sands of the desert, with only its topmost spire visible from above ground. At one time, ${link_0}, who was a lieutenant at the time, stumbled across the library. Because of the library's otherworldly origins, its collection contains a great amount of information concerning the spirits. From this, Zhao learned that the Ocean and Moon spirits, ${link_1} and ${link_2}, were located at the ${link_3} and were the key to defeating the ${link_4}. Zhao had the portion of the library concerning the ${link_5} destroyed to stop anyone from discovering his nation's weaknesses.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Tui",
          "key": "${link_1}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "La",
          "key": "${link_2}",
          "target": {
            "href": "La",
            "page": "La"
          }
        },
        {
          "body": "Spirit Oasis",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "Water Tribe",
          "key": "${link_4}",
          "target": {
            "href": "Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_5}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "Eventually, the location of the library was lost to mankind. Though the building of the library is the size of a large palace, most of it lay buried beneath the sands of the desert, with only its topmost spire visible from above ground. At one time, Zhao, who was a lieutenant at the time, stumbled across the library. Because of the library's otherworldly origins, its collection contains a great amount of information concerning the spirits. From this, Zhao learned that the Ocean and Moon spirits, Tui and La, were located at the Spirit Oasis and were the key to defeating the Water Tribe. Zhao had the portion of the library concerning the Fire Nation destroyed to stop anyone from discovering his nation's weaknesses."
    },
    {
      "body": "Professor ${link_0} and ${link_1} rediscovered the library.",
      "links": [
        {
          "body": "Zei",
          "key": "${link_0}",
          "target": {
            "href": "Zei",
            "page": "Zei"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Professor Zei and Team Avatar rediscovered the library."
    },
    {
      "body": "With the help of Professor ${link_0}, Team Avatar rediscovered the library. Wan Shi Tong grudgingly allowed them to peruse the library after each had made a contribution to the collection, on the condition that no knowledge from the library would be used for violent purposes. During their visit, ${link_1} found a small note reading \"the darkest day in Fire Nation history.\" With only that small line and a date on the top, he decided to go deeper into the library to find out what happened to the ${link_2} on that day.",
      "links": [
        {
          "body": "Zei",
          "key": "${link_0}",
          "target": {
            "href": "Zei",
            "page": "Zei"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "With the help of Professor Zei, Team Avatar rediscovered the library. Wan Shi Tong grudgingly allowed them to peruse the library after each had made a contribution to the collection, on the condition that no knowledge from the library would be used for violent purposes. During their visit, Sokka found a small note reading \"the darkest day in Fire Nation history.\" With only that small line and a date on the top, he decided to go deeper into the library to find out what happened to the Fire Nation on that day."
    },
    {
      "body": "After finding out that the entire wing of the library dedicated to the Fire Nation was destroyed by ${link_0}, Sokka further expressed his determination to find out more about the note. Subsequently, a Knowledge Seeker appeared and led the group toward a domed ${link_1} in the library. This calendar revealed the date of the upcoming ${link_2} to Team Avatar, who used this information to formulate an ${link_3} plan.",
      "links": [
        {
          "body": "firebenders",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "planetary calendar room",
          "key": "${link_1}",
          "target": {
            "href": "Planetary_calendar_room",
            "page": "Planetary_calendar_room"
          }
        },
        {
          "body": "solar eclipse",
          "key": "${link_2}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        },
        {
          "body": "invasion",
          "key": "${link_3}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "text": "After finding out that the entire wing of the library dedicated to the Fire Nation was destroyed by firebenders, Sokka further expressed his determination to find out more about the note. Subsequently, a Knowledge Seeker appeared and led the group toward a domed planetary calendar room in the library. This calendar revealed the date of the upcoming solar eclipse to Team Avatar, who used this information to formulate an invasion plan."
    },
    {
      "body": "Outraged at the betrayal of his trust, Wan Shi Tong completely buried the library in order to \"take his knowledge back\". While Team Avatar escaped, Zei stayed behind, declaring that he could spend an eternity there.",
      "links": [],
      "text": "Outraged at the betrayal of his trust, Wan Shi Tong completely buried the library in order to \"take his knowledge back\". While Team Avatar escaped, Zei stayed behind, declaring that he could spend an eternity there."
    },
    {
      "body": "${link_0} discovered ${link_1}'s Library suspended upside down in the trees somewhere in the ${link_2}.",
      "links": [
        {
          "body": "Jinora",
          "key": "${link_0}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Wan Shi Tong",
          "key": "${link_1}",
          "target": {
            "href": "Wan_Shi_Tong",
            "page": "Wan_Shi_Tong"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Jinora discovered Wan Shi Tong's Library suspended upside down in the trees somewhere in the Spirit World."
    },
    {
      "body": "In 171 ${link_0}, the ${link_1} ${link_2} had named Furry-Foot brought her to the library in the ${link_3}. The young ${link_4} remarked that the building, now suspended upside down in the trees, looked like an \"awesome tree house\", before realizing that it was the spirit library. As she entered the building and looked around in awe, she stated that she could spend an eternity there, reading. She was interrupted by the arrival of Wan Shi Tong, who pointed out the skeletal remains of Professor Zei, the last person to make such a statement. The owl spirit reminded the young airbender that he no longer allowed humans in his library, but when Jinora revealed to him the true inner workings of the ${link_5} and her affiliation with the Avatar, Wan Shi Tong permitted her to stay.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#After_war_.28100_AG_.E2.80.93_Present.29",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "dragonfly bunny spirit",
          "key": "${link_1}",
          "target": {
            "href": "Dragonfly_bunny_spirit",
            "page": "Dragonfly_bunny_spirit"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_2}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "airbender",
          "key": "${link_4}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "radio",
          "key": "${link_5}",
          "target": {
            "href": "Radio",
            "page": "Radio"
          }
        }
      ],
      "text": "In 171 AG, the dragonfly bunny spirit Jinora had named Furry-Foot brought her to the library in the Spirit World. The young airbender remarked that the building, now suspended upside down in the trees, looked like an \"awesome tree house\", before realizing that it was the spirit library. As she entered the building and looked around in awe, she stated that she could spend an eternity there, reading. She was interrupted by the arrival of Wan Shi Tong, who pointed out the skeletal remains of Professor Zei, the last person to make such a statement. The owl spirit reminded the young airbender that he no longer allowed humans in his library, but when Jinora revealed to him the true inner workings of the radio and her affiliation with the Avatar, Wan Shi Tong permitted her to stay."
    },
    {
      "body": "Unable to find a map to the spirit portals, Jinora asked a nearby Knowledge Seeker for help, and the creature immediately found Jinora a book that contained information about the portals. Jinora discovered that if both portals were open when ${link_0} occurred, ${link_1} would be strong enough to escape his imprisonment, putting the mortal world at risk once more of being engulfed in darkness. Jinora attempted to leave the library to warn Avatar Korra, only to be confronted by Wan Shi Tong and ${link_2}. The airbender tried to back away from the waterbender, but the present dark energy transformed the gentle Furry-Foot into a ${link_3}, capturing the young girl on Unalaq's wishes.",
      "links": [
        {
          "body": "Harmonic Convergence",
          "key": "${link_0}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "Vaatu",
          "key": "${link_1}",
          "target": {
            "href": "Vaatu",
            "page": "Vaatu"
          }
        },
        {
          "body": "Unalaq",
          "key": "${link_2}",
          "target": {
            "href": "Unalaq",
            "page": "Unalaq"
          }
        },
        {
          "body": "dark spirit",
          "key": "${link_3}",
          "target": {
            "href": "Dark_spirits",
            "page": "Dark_spirits"
          }
        }
      ],
      "text": "Unable to find a map to the spirit portals, Jinora asked a nearby Knowledge Seeker for help, and the creature immediately found Jinora a book that contained information about the portals. Jinora discovered that if both portals were open when Harmonic Convergence occurred, Vaatu would be strong enough to escape his imprisonment, putting the mortal world at risk once more of being engulfed in darkness. Jinora attempted to leave the library to warn Avatar Korra, only to be confronted by Wan Shi Tong and Unalaq. The airbender tried to back away from the waterbender, but the present dark energy transformed the gentle Furry-Foot into a dark spirit, capturing the young girl on Unalaq's wishes."
    },
    {
      "body": "The ${link_0} depicts the location of the sun and moon in the sky at a certain point in time.",
      "links": [
        {
          "body": "planetary calendar room",
          "key": "${link_0}",
          "target": {
            "href": "Planetary_calendar_room",
            "page": "Planetary_calendar_room"
          }
        }
      ],
      "text": "The planetary calendar room depicts the location of the sun and moon in the sky at a certain point in time."
    },
    {
      "body": "The ${link_0} means \"${link_1}'s Mysterious Library\".",
      "links": [
        {
          "body": "writing",
          "key": "${link_0}",
          "target": {
            "href": "Writing_in_the_World_of_Avatar",
            "page": "Writing_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Wan Shi Tong",
          "key": "${link_1}",
          "target": {
            "href": "Wan_Shi_Tong",
            "page": "Wan_Shi_Tong"
          }
        }
      ],
      "text": "The writing means \"Wan Shi Tong's Mysterious Library\"."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Wan_Shi_Tong%27s_Library",
    "file": "avatar.wikia.com/wiki/Wan_Shi_Tong's_Library.html",
    "page": "Wan_Shi_Tong's_Library",
    "title": "Wan Shi Tong's Library"
  }
}