{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Events",
      "target": {
        "external": false,
        "href": "/wiki/Category_Events",
        "page": "Category_Events"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "external": false,
        "href": "/wiki/Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "The winter solstice is a natural astronomical phenomenon that occurs when the sun is at its greatest angular distance from the equator, making it the shortest day of the year in that hemisphere. As the solstice approaches, the line between the natural world and the ${link_0} is blurred as the two grow closer together; consequently, during the solstices, the spirits can exert incredible power in the natural world. This is also the time during which it is easiest for people to enter the Spirit World, either by their own abilities or with the aid of a spirit.",
      "links": [
        {
          "body": "Spirit World",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "section": [
        "Winter solstice"
      ],
      "text": "The winter solstice is a natural astronomical phenomenon that occurs when the sun is at its greatest angular distance from the equator, making it the shortest day of the year in that hemisphere. As the solstice approaches, the line between the natural world and the Spirit World is blurred as the two grow closer together; consequently, during the solstices, the spirits can exert incredible power in the natural world. This is also the time during which it is easiest for people to enter the Spirit World, either by their own abilities or with the aid of a spirit."
    },
    {
      "body": "Around 55 ${link_0}, ${link_1} ${link_2}, angered that he was not making any noticeable progress in mastering the ${link_3}, tried to use the energy from the sun during the winter solstice to aid him. On the day of the solstice, he aligned his eyes with a beam of light coming from the sun; the method initially proved to be a success, but Roku was stuck in the Avatar State as a result of the overwhelming power he received. He destroyed the top half of the temple before ${link_4} ${link_5} was able to remove Roku from the Avatar State by aligning the Avatar's eyes with the winter solstice sun through the gem once more.",
      "links": [
        {
          "body": "BG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Roku",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Fire Sage",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Sages",
            "page": "Fire_Sages"
          }
        },
        {
          "body": "Kaja",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Kaja",
            "page": "Kaja"
          }
        }
      ],
      "section": [
        "Winter solstice",
        "History"
      ],
      "text": "Around 55 BG, Avatar Roku, angered that he was not making any noticeable progress in mastering the Avatar State, tried to use the energy from the sun during the winter solstice to aid him. On the day of the solstice, he aligned his eyes with a beam of light coming from the sun; the method initially proved to be a success, but Roku was stuck in the Avatar State as a result of the overwhelming power he received. He destroyed the top half of the temple before Fire Sage Kaja was able to remove Roku from the Avatar State by aligning the Avatar's eyes with the winter solstice sun through the gem once more."
    },
    {
      "body": "In the days prior to the winter solstice of 99 AG, ${link_0} had to stop ${link_1}, the Black and White Spirit, from destroying ${link_2}. The ${link_3} had burned Hei Bai's home, the once-great ${link_4}, enraging the spirit into attacking the village. Since the upcoming solstice enabled the spirit to cross over to the physical plain with ease, Hei Bai had managed to abduct several villagers by the time Aang, ${link_5}, and ${link_6} had discovered the village, and the spirit proceeded to take Sokka captive during Aang's first attempt to deter him. Aang pursued them and was able to grab Sokka's hand just as Hei Bai crossed over to the Spirit World. As a result, Aang unknowingly crossed with them. Since his ${link_7} abilities did not work in the Spirit World, he was no longer able to use his ${link_8} and plummeted to the ground, passing out next to Hei Bai's statue. Once Aang realized he was in the Spirit World, he called out to Avatar Roku for help. In response to his plea, ${link_9}, Roku's animal guide, appeared and brought Aang to Roku's ${link_10} on ${link_11} at the fringe of the Fire Nation. With a telepathic connection made through his whiskers, the ${link_12} showed Aang that he could contact Roku when the light of the winter solstice touched the eyes of Roku's statue, located inside a special chamber near the top of the temple. Aang was returned to the normal world and proceeded to confront Hei Bai a second time. He succeeded in calming the spirit down by informing Hei Bai that the forest will eventually grow back; as a result, Hei Bai released his hostages and returned to the Spirit World.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Hei Bai",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hei_Bai",
            "page": "Hei_Bai"
          }
        },
        {
          "body": "Senlin Village",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Senlin_Village",
            "page": "Senlin_Village"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Senlin Forest",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Scorched_forest",
            "page": "Scorched_forest"
          }
        },
        {
          "body": "Katara",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "bending",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Bending_arts",
            "page": "Bending_arts"
          }
        },
        {
          "body": "glider",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Airbender_staff",
            "page": "Airbender_staff"
          }
        },
        {
          "body": "Fang",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Fang",
            "page": "Fang"
          }
        },
        {
          "body": "temple",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Temple",
            "page": "Fire_Temple"
          }
        },
        {
          "body": "Crescent Island",
          "key": "${link_11}",
          "target": {
            "external": false,
            "href": "/wiki/Crescent_Island",
            "page": "Crescent_Island"
          }
        },
        {
          "body": "dragon",
          "key": "${link_12}",
          "target": {
            "external": false,
            "href": "/wiki/Dragon",
            "page": "Dragon"
          }
        }
      ],
      "section": [
        "Winter solstice",
        "History"
      ],
      "text": "In the days prior to the winter solstice of 99 AG, Aang had to stop Hei Bai, the Black and White Spirit, from destroying Senlin Village. The Fire Nation had burned Hei Bai's home, the once-great Senlin Forest, enraging the spirit into attacking the village. Since the upcoming solstice enabled the spirit to cross over to the physical plain with ease, Hei Bai had managed to abduct several villagers by the time Aang, Katara, and Sokka had discovered the village, and the spirit proceeded to take Sokka captive during Aang's first attempt to deter him. Aang pursued them and was able to grab Sokka's hand just as Hei Bai crossed over to the Spirit World. As a result, Aang unknowingly crossed with them. Since his bending abilities did not work in the Spirit World, he was no longer able to use his glider and plummeted to the ground, passing out next to Hei Bai's statue. Once Aang realized he was in the Spirit World, he called out to Avatar Roku for help. In response to his plea, Fang, Roku's animal guide, appeared and brought Aang to Roku's temple on Crescent Island at the fringe of the Fire Nation. With a telepathic connection made through his whiskers, the dragon showed Aang that he could contact Roku when the light of the winter solstice touched the eyes of Roku's statue, located inside a special chamber near the top of the temple. Aang was returned to the normal world and proceeded to confront Hei Bai a second time. He succeeded in calming the spirit down by informing Hei Bai that the forest will eventually grow back; as a result, Hei Bai released his hostages and returned to the Spirit World."
    },
    {
      "body": "After the event, ${link_0} traveled to the Fire Temple so that Aang could meet Roku. On the exact moment of the solstice, the light hit the eyes of Roku's statue and they began to glow, allowing Aang to talk to his past life. Roku informed him of the arrival of ${link_1} at the end of summer, describing how it would grant all ${link_2} incredible power, enough to win the ${link_3}. Roku told Aang that he must master all four elements by summer's end or else he would not be able to restore balance to the world. At the end of their meeting, Roku assured Aang a safe route out of his temple by ${link_4} himself through the young Avatar and overpowering the threat that awaited him outside the chamber.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Sozin's Comet",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "firebenders",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "manifesting",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_manifestation",
            "page": "Avatar"
          }
        }
      ],
      "section": [
        "Winter solstice",
        "History"
      ],
      "text": "After the event, Team Avatar traveled to the Fire Temple so that Aang could meet Roku. On the exact moment of the solstice, the light hit the eyes of Roku's statue and they began to glow, allowing Aang to talk to his past life. Roku informed him of the arrival of Sozin's Comet at the end of summer, describing how it would grant all firebenders incredible power, enough to win the Hundred Year War. Roku told Aang that he must master all four elements by summer's end or else he would not be able to restore balance to the world. At the end of their meeting, Roku assured Aang a safe route out of his temple by manifesting himself through the young Avatar and overpowering the threat that awaited him outside the chamber."
    },
    {
      "body": "In 171 AG, Avatar ${link_0} opened the ${link_1} ${link_2} on the day of the winter solstice, as the first step to restoring the spiritual balance of the ${link_3}. Opening the portal could only be done during the winter solstice.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Southern",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/South_Pole",
            "page": "South_Pole"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "section": [
        "Winter solstice",
        "History"
      ],
      "text": "In 171 AG, Avatar Korra opened the Southern spirit portal on the day of the winter solstice, as the first step to restoring the spiritual balance of the Southern Water Tribe. Opening the portal could only be done during the winter solstice."
    },
    {
      "body": "The Dōngzhì Festival, or Winter Solstice Festival (冬至; The Extreme of Winter), is one of the most important festivals celebrated by the Chinese and other East Asians during the Dongzhi solar term on or around December 22, when sunshine is weakest and daylight shortest; i.e., on the first day of the Dongzhi solar term.",
      "links": [],
      "section": [
        "Winter solstice",
        "Connection"
      ],
      "text": "The Dōngzhì Festival, or Winter Solstice Festival (冬至; The Extreme of Winter), is one of the most important festivals celebrated by the Chinese and other East Asians during the Dongzhi solar term on or around December 22, when sunshine is weakest and daylight shortest; i.e., on the first day of the Dongzhi solar term."
    },
    {
      "body": "107. \"${link_0}\" (vision)",
      "links": [
        {
          "body": "Winter Solstice, Part 1: The Spirit World",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Winter_Solstice%2c_Part_1__The_Spirit_World",
            "page": "Winter_Solstice%2c_Part_1__The_Spirit_World"
          }
        }
      ],
      "section": [
        "Winter solstice",
        "Appearances",
        "Avatar: The Last Airbender",
        "Book One: Water (水)"
      ],
      "text": "107. \"Winter Solstice, Part 1: The Spirit World\" (vision)"
    },
    {
      "body": "108. \"${link_0}\"",
      "links": [
        {
          "body": "Winter Solstice, Part 2: Avatar Roku",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Winter_Solstice%2c_Part_2__Avatar_Roku",
            "page": "Winter_Solstice%2c_Part_2__Avatar_Roku"
          }
        }
      ],
      "section": [
        "Winter solstice",
        "Appearances",
        "Avatar: The Last Airbender",
        "Book One: Water (水)"
      ],
      "text": "108. \"Winter Solstice, Part 2: Avatar Roku\""
    },
    {
      "body": "\"${link_0}\"",
      "links": [
        {
          "body": "Chapter 1: Avatar Roku",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Escape_from_the_Spirit_World#Chapter_1:_Avatar_Roku",
            "page": "Escape_from_the_Spirit_World"
          }
        }
      ],
      "section": [
        "Winter solstice",
        "Appearances",
        "Avatar: The Last Airbender",
        "Escape from the Spirit World"
      ],
      "text": "\"Chapter 1: Avatar Roku\""
    },
    {
      "body": "202. \"${link_0}\"",
      "links": [
        {
          "body": "The Southern Lights",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/The_Southern_Lights",
            "page": "The_Southern_Lights"
          }
        }
      ],
      "section": [
        "Winter solstice",
        "Appearances",
        "The Legend of Korra",
        "Book Two: Spirits (神靈)"
      ],
      "text": "202. \"The Southern Lights\""
    },
    {
      "body": "The ${link_0} apparently had a strong spiritual connection to the solstices, seeing as they had a shrine only accessible via a ${link_1} that would open the door on the solstices. The Fire Sages, whose temples were derived from Sun Warrior culture, also make use of a sunstone.",
      "links": [
        {
          "body": "Sun Warriors",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Sun_Warriors",
            "page": "Sun_Warriors"
          }
        },
        {
          "body": "sunstone",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Sunstone",
            "page": "Sunstone"
          }
        }
      ],
      "section": [
        "Winter solstice",
        "Trivia"
      ],
      "text": "The Sun Warriors apparently had a strong spiritual connection to the solstices, seeing as they had a shrine only accessible via a sunstone that would open the door on the solstices. The Fire Sages, whose temples were derived from Sun Warrior culture, also make use of a sunstone."
    },
    {
      "body": "The winter solstice is the shortest day of the year in the Northern Hemisphere, but the longest in the Southern Hemisphere due to the planet's position to the sun, when the Southern Hemisphere is pointing toward the sun.",
      "links": [],
      "section": [
        "Winter solstice",
        "Trivia"
      ],
      "text": "The winter solstice is the shortest day of the year in the Northern Hemisphere, but the longest in the Southern Hemisphere due to the planet's position to the sun, when the Southern Hemisphere is pointing toward the sun."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Astronomy in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Astronomy_in_the_World_of_Avatar",
            "page": "Astronomy_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Winter solstice",
        "See also"
      ],
      "text": "Astronomy in the World of Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Summer solstice",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Summer_solstice",
            "page": "Summer_solstice"
          }
        }
      ],
      "section": [
        "Winter solstice",
        "See also"
      ],
      "text": "Summer solstice"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Winter_solstice",
    "file": "avatar.wikia.com/wiki/Winter_solstice.html",
    "page": "Winter_solstice",
    "title": "Winter solstice"
  }
}