{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Characters",
      "target": {
        "href": "Category_Characters",
        "page": "Category_Characters"
      }
    },
    {
      "body": "Graphic novel characters",
      "target": {
        "href": "Category_Graphic_novel_characters",
        "page": "Category_Graphic_novel_characters"
      }
    },
    {
      "body": "Legend of Korra characters",
      "target": {
        "href": "Category_Legend_of_Korra_characters",
        "page": "Category_Legend_of_Korra_characters"
      }
    },
    {
      "body": "Major graphic novel characters (Legend of Korra)",
      "target": {
        "href": "Category_Major_graphic_novel_characters_(Legend_of_Korra)",
        "page": "Category_Major_graphic_novel_characters_(Legend_of_Korra)"
      }
    },
    {
      "body": "Turf Wars characters",
      "target": {
        "href": "Category_Turf_Wars_characters",
        "page": "Category_Turf_Wars_characters"
      }
    },
    {
      "body": "United Republic characters",
      "target": {
        "href": "Category_United_Republic_characters",
        "page": "Category_United_Republic_characters"
      }
    }
  ],
  "facts": [
    {
      "key": "Nationality",
      "value": [
        {
          "body": "${link_0}, ${link_1}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Republic City",
              "key": "${link_0}",
              "target": {
                "href": "Republic_City",
                "page": "Republic_City"
              }
            },
            {
              "body": "United Republic",
              "key": "${link_1}",
              "target": {
                "href": "United_Republic_of_Nations",
                "page": "United_Republic_of_Nations"
              }
            }
          ],
          "text": "Republic City, United Republic",
          "value": "${link_0}, ${link_1}",
          "value_text": "Republic City, United Republic"
        }
      ]
    },
    {
      "key": "Ethnicity",
      "value": [
        {
          "body": "United Republic",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "United Republic",
          "value": "United Republic",
          "value_text": "United Republic"
        }
      ]
    },
    {
      "key": "Gender",
      "value": [
        {
          "body": "Male",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Male",
          "value": "Male",
          "value_text": "Male"
        }
      ]
    },
    {
      "key": "Eye color",
      "value": [
        {
          "body": "Brown",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Brown",
          "value": "Brown",
          "value_text": "Brown"
        }
      ]
    },
    {
      "key": "Hair color",
      "value": [
        {
          "body": "Gray",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Gray",
          "value": "Gray",
          "value_text": "Gray"
        }
      ]
    },
    {
      "key": "Love Interest",
      "value": [
        {
          "body": "His wife",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "His wife",
          "value": "His wife",
          "value_text": "His wife"
        }
      ]
    },
    {
      "key": "Allies",
      "value": [
        {
          "body": "${link_0} (formerly)",
          "extra": "(formerly)",
          "extra_text": "(formerly)",
          "links": [
            {
              "body": "Tokuga",
              "key": "${link_0}",
              "target": {
                "href": "Tokuga",
                "page": "Tokuga"
              }
            }
          ],
          "text": "Tokuga (formerly)",
          "value": "${link_0}",
          "value_text": "Tokuga"
        }
      ]
    },
    {
      "key": "Enemies",
      "value": [
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Tokuga",
              "key": "${link_0}",
              "target": {
                "href": "Tokuga",
                "page": "Tokuga"
              }
            }
          ],
          "text": "Tokuga",
          "value": "${link_0}",
          "value_text": "Tokuga"
        }
      ]
    },
    {
      "key": "Profession",
      "value": [
        {
          "body": "Businessman",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Businessman",
          "value": "Businessman",
          "value_text": "Businessman"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "CEO of Keum Enterprises",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "CEO of Keum Enterprises",
          "value": "CEO of Keum Enterprises",
          "value_text": "CEO of Keum Enterprises"
        }
      ]
    },
    {
      "key": "First Appearance",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Turf Wars Part One",
              "key": "${link_0}",
              "target": {
                "href": "Turf_Wars_Part_One",
                "page": "Turf_Wars_Part_One"
              }
            }
          ],
          "text": "\"Turf Wars Part One\"",
          "value": "\"${link_0}\"",
          "value_text": "\"Turf Wars Part One\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Wonyong Keum is the CEO of Keum Enterprises. Owning the land surrounding the ${link_0} ${link_1}, he intended to turn the area into an amusement park from where he could launch tours and excursions into the ${link_2}.",
      "links": [
        {
          "body": "Republic City",
          "key": "${link_0}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Wonyong Keum is the CEO of Keum Enterprises. Owning the land surrounding the Republic City spirit portal, he intended to turn the area into an amusement park from where he could launch tours and excursions into the Spirit World."
    },
    {
      "body": "In 166 ${link_0}, Wonyong met with ${link_1}, who wanted his help to develop gas dispersion pumps for the ${link_2} ${link_3}. Unwilling to help Hiroshi create weapons, Wonyong backed out of the deal, an act that earned him the enmity of ${link_4}, who was then unaware of its true nature.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Hiroshi Sato",
          "key": "${link_1}",
          "target": {
            "href": "Hiroshi_Sato",
            "page": "Hiroshi_Sato"
          }
        },
        {
          "body": "Equalist",
          "key": "${link_2}",
          "target": {
            "href": "Equalists",
            "page": "Equalists"
          }
        },
        {
          "body": "mecha tanks",
          "key": "${link_3}",
          "target": {
            "href": "Mecha_tank",
            "page": "Mecha_tank"
          }
        },
        {
          "body": "Asami Sato",
          "key": "${link_4}",
          "target": {
            "href": "Asami_Sato",
            "page": "Asami_Sato"
          }
        }
      ],
      "text": "In 166 AG, Wonyong met with Hiroshi Sato, who wanted his help to develop gas dispersion pumps for the Equalist mecha tanks. Unwilling to help Hiroshi create weapons, Wonyong backed out of the deal, an act that earned him the enmity of Asami Sato, who was then unaware of its true nature."
    },
    {
      "body": "Wonyong informed ${link_0} and the other ${link_1} that they were trespassing on his land, as he owned the land surrounding the ${link_2} ${link_3}.",
      "links": [
        {
          "body": "Jinora",
          "key": "${link_0}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Republic City",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City",
            "page": "Republic_City"
          }
        },
        {
          "body": "spirit portal",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_portal",
            "page": "Spirit_portal"
          }
        }
      ],
      "text": "Wonyong informed Jinora and the other airbenders that they were trespassing on his land, as he owned the land surrounding the Republic City spirit portal."
    },
    {
      "body": "Eight years later, in the aftermath of ${link_0}'s failed ${link_1}, Wonyong, as the owner of the land surrounding the spirit portal in ${link_2}, visited the spirit portal with a work crew to measure up the area, as he intended to turn it into an amusement park. Discovering several ${link_3} who had been meditating there, he ordered them to vacate the area under threat of calling the police. ${link_4}, speaking for their group, refused to leave, and an angered Wonyong yelled at her that they were trespassing. When ${link_5} ${link_6} and Asami emerged from the spirit portal, Wonyong introduced himself to the Avatar and was surprised to discover Asami there as well, almost failing to recognize her, as he had not seen her since he had walked out on an important deal with her father. When Asami showed her resentment toward him, he explained that his actions were purely business, nothing personal, and extended his condolences for the loss of Hiroshi. He did not seem fazed when Asami rejected them and turned his attention back to Korra, asking her to escort the airbenders off his property. When Jinora pleaded with Korra not to listen, saying that Wonyong intended to build a road leading to the Spirit World so he could drive \"truckloads of tourists\" into the Spirit World, the businessman countered that Jinora was making his plans sound crass. What he really intended to do, according to himself, was to provide a \"state-of-the-art experience for the discerning traveler\", since he believed everyone should be able to experience the wonders and beauty that the Spirit World had to offer. When an angry Asami bluntly stated that people like him should not be allowed anywhere near the Spirit World just because it is wondrous and beautiful, Wonyong snapped back that there is nothing any of them could do about his plans since Keum Enterprises owned the land.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "invasion of the United Republic of Nations",
          "key": "${link_1}",
          "target": {
            "href": "Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        },
        {
          "body": "downtown Republic City",
          "key": "${link_2}",
          "target": {
            "href": "Republic_City#Downtown",
            "page": "Republic_City"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_3}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Jinora",
          "key": "${link_4}",
          "target": {
            "href": "Jinora",
            "page": "Jinora"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_5}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_6}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        }
      ],
      "text": "Eight years later, in the aftermath of Kuvira's failed invasion of the United Republic of Nations, Wonyong, as the owner of the land surrounding the spirit portal in downtown Republic City, visited the spirit portal with a work crew to measure up the area, as he intended to turn it into an amusement park. Discovering several airbenders who had been meditating there, he ordered them to vacate the area under threat of calling the police. Jinora, speaking for their group, refused to leave, and an angered Wonyong yelled at her that they were trespassing. When Avatar Korra and Asami emerged from the spirit portal, Wonyong introduced himself to the Avatar and was surprised to discover Asami there as well, almost failing to recognize her, as he had not seen her since he had walked out on an important deal with her father. When Asami showed her resentment toward him, he explained that his actions were purely business, nothing personal, and extended his condolences for the loss of Hiroshi. He did not seem fazed when Asami rejected them and turned his attention back to Korra, asking her to escort the airbenders off his property. When Jinora pleaded with Korra not to listen, saying that Wonyong intended to build a road leading to the Spirit World so he could drive \"truckloads of tourists\" into the Spirit World, the businessman countered that Jinora was making his plans sound crass. What he really intended to do, according to himself, was to provide a \"state-of-the-art experience for the discerning traveler\", since he believed everyone should be able to experience the wonders and beauty that the Spirit World had to offer. When an angry Asami bluntly stated that people like him should not be allowed anywhere near the Spirit World just because it is wondrous and beautiful, Wonyong snapped back that there is nothing any of them could do about his plans since Keum Enterprises owned the land."
    },
    {
      "body": "Wonyong was threatened by the ${link_0} over his plans to exploit the ${link_1}.",
      "links": [
        {
          "body": "dragon eel spirit",
          "key": "${link_0}",
          "target": {
            "href": "Dragon_eel_spirit",
            "page": "Dragon_eel_spirit"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "text": "Wonyong was threatened by the dragon eel spirit over his plans to exploit the Spirit World."
    },
    {
      "body": "Their argument was interrupted when the ${link_0} appeared and confronted a startled Wonyong, saying that he was just another human who refused to respect the sacred and making it clear that the deeds to the land did not give him the right to ravage and plunder the Spirit World. After Korra reasoned with the spirit and it returned to its own world, Wonyong, having had enough, reiterated that Korra and her friends were all trespassing on his land and that he wanted them gone immediately. The Avatar did not take kindly to his order and entered the Avatar State, intimidating Wonyong and his workers into fleeing the area.",
      "links": [
        {
          "body": "dragon eel spirit",
          "key": "${link_0}",
          "target": {
            "href": "Dragon_eel_spirit",
            "page": "Dragon_eel_spirit"
          }
        }
      ],
      "text": "Their argument was interrupted when the dragon eel spirit appeared and confronted a startled Wonyong, saying that he was just another human who refused to respect the sacred and making it clear that the deeds to the land did not give him the right to ravage and plunder the Spirit World. After Korra reasoned with the spirit and it returned to its own world, Wonyong, having had enough, reiterated that Korra and her friends were all trespassing on his land and that he wanted them gone immediately. The Avatar did not take kindly to his order and entered the Avatar State, intimidating Wonyong and his workers into fleeing the area."
    },
    {
      "body": "Wonyong was attack by ${link_0}, who held him responsible for his disfigurement by the ${link_1}.",
      "links": [
        {
          "body": "Tokuga",
          "key": "${link_0}",
          "target": {
            "href": "Tokuga",
            "page": "Tokuga"
          }
        },
        {
          "body": "dragon eel spirit",
          "key": "${link_1}",
          "target": {
            "href": "Dragon_eel_spirit",
            "page": "Dragon_eel_spirit"
          }
        }
      ],
      "text": "Wonyong was attack by Tokuga, who held him responsible for his disfigurement by the dragon eel spirit."
    },
    {
      "body": "Wonyong was not pleased with how things transpired and hired the ${link_0} to secure the area surrounding the portal. After the attack transpired, Wonyong received a surprise visit from ${link_1} and a few of his men, who had forced their way into the Keum Enterprise building. The businessman was shocked to see Tokuga's new appearance, as the Triple Threat Leader was partially deformed due to a hostile encounter with the dragon eel spirit. Tokuga was under the impression that Korra had summoned the spirits and ordered one to attack him and therefore held Wonyong responsible for not alerting him of the possibility that the Avatar could have interfered. When Tokuga attacked him, lifting him off the ground by his neck, Wonyong asked what he desired, readily vowing to pay double of what he already owed him. The Triple Threat leader was not satisfied with the order and told Wonyong that he assumed control of Keum Enterprises and all its assets, effective immediately, which meant that the businessman now worked for him.",
      "links": [
        {
          "body": "Triple Threat Triad",
          "key": "${link_0}",
          "target": {
            "href": "Triple_Threat_Triad",
            "page": "Triple_Threat_Triad"
          }
        },
        {
          "body": "Tokuga",
          "key": "${link_1}",
          "target": {
            "href": "Tokuga",
            "page": "Tokuga"
          }
        }
      ],
      "text": "Wonyong was not pleased with how things transpired and hired the Triple Threat Triad to secure the area surrounding the portal. After the attack transpired, Wonyong received a surprise visit from Tokuga and a few of his men, who had forced their way into the Keum Enterprise building. The businessman was shocked to see Tokuga's new appearance, as the Triple Threat Leader was partially deformed due to a hostile encounter with the dragon eel spirit. Tokuga was under the impression that Korra had summoned the spirits and ordered one to attack him and therefore held Wonyong responsible for not alerting him of the possibility that the Avatar could have interfered. When Tokuga attacked him, lifting him off the ground by his neck, Wonyong asked what he desired, readily vowing to pay double of what he already owed him. The Triple Threat leader was not satisfied with the order and told Wonyong that he assumed control of Keum Enterprises and all its assets, effective immediately, which meant that the businessman now worked for him."
    },
    {
      "body": "Wonyong was subsequently held captive by the Triple Threats, which alerted his bodyguards and wife, though they all refrained from reporting his disappearance to the authorities due to his private nature and dislike for the authorities. When Tokuga and the Triple Threats attacked a military depot containing the Earth Empire weaponry and vehicles left over from Kuvira's failed ${link_0}, Wonyong was bought along as a hostage, along with a recently captured Asami.",
      "links": [
        {
          "body": "invasion of the United Republic",
          "key": "${link_0}",
          "target": {
            "href": "Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        }
      ],
      "text": "Wonyong was subsequently held captive by the Triple Threats, which alerted his bodyguards and wife, though they all refrained from reporting his disappearance to the authorities due to his private nature and dislike for the authorities. When Tokuga and the Triple Threats attacked a military depot containing the Earth Empire weaponry and vehicles left over from Kuvira's failed invasion of the United Republic, Wonyong was bought along as a hostage, along with a recently captured Asami."
    },
    {
      "body": "Following the raid, and Tokuga's attack on the ${link_0} turf, Wonyong and Asami were locked up together in the abandoned ${link_1}, which had since been taken over by the Triple Threats. Wonyong asked Asami if she was okay, but Asami angrily told him not to pretend he cared about her, since his greed had led to her current situation. Wonyong replied that he had simply wanted to protect his property, and when Asami pointed out that he had hired criminals to intimidate and threaten others, Wonyong claimed that running a business sometimes required unsavory partnerships, referring to Hiroshi's involvement with the Equalists. Furious at the insult toward her father, Asami pointed out that Hiroshi had sacrificed his life for Republic City, and asked Wonyong what he would be willing to sacrifice.",
      "links": [
        {
          "body": "Creeping Crystals'",
          "key": "${link_0}",
          "target": {
            "href": "Creeping_Crystal_Triad",
            "page": "Creeping_Crystal_Triad"
          }
        },
        {
          "body": "Earthen Fire Refinery",
          "key": "${link_1}",
          "target": {
            "href": "Earthen_Fire_Refinery",
            "page": "Earthen_Fire_Refinery"
          }
        }
      ],
      "text": "Following the raid, and Tokuga's attack on the Creeping Crystals' turf, Wonyong and Asami were locked up together in the abandoned Earthen Fire Refinery, which had since been taken over by the Triple Threats. Wonyong asked Asami if she was okay, but Asami angrily told him not to pretend he cared about her, since his greed had led to her current situation. Wonyong replied that he had simply wanted to protect his property, and when Asami pointed out that he had hired criminals to intimidate and threaten others, Wonyong claimed that running a business sometimes required unsavory partnerships, referring to Hiroshi's involvement with the Equalists. Furious at the insult toward her father, Asami pointed out that Hiroshi had sacrificed his life for Republic City, and asked Wonyong what he would be willing to sacrifice."
    },
    {
      "body": "At that moment, Tokuga entered the room and revealed that he had taken possession of the plans for gas dispersion pumps, which Wonyong had kept in his office since his failed deal with Hiroshi, and Wonyong told Asami that Hiroshi's desire to build illegal weaponry was what ultimately led to him to walk out on a business deal between the two. Tokuga threatened to murder Wonyong unless Asami agreed to build one of the pumps and attach it to one of the airships taken from the depot, the triad leader intending to use it to threaten Republic City with poison gas; Asami reluctantly agreed to his plans. After Asami finished work on the pump, the refinery was attacked by Korra, ${link_0}, ${link_1} and ${link_2}. Tokuga and the triads managed to load Wonyong and Asami onto the airship before it took off, with Tokuga following them. As the airship flew back to the Republic City spirit portal, Wonyong and Asami agreed to work together to prevent Tokuga using the gas.",
      "links": [
        {
          "body": "Mako",
          "key": "${link_0}",
          "target": {
            "href": "Mako",
            "page": "Mako"
          }
        },
        {
          "body": "Bolin",
          "key": "${link_1}",
          "target": {
            "href": "Bolin",
            "page": "Bolin"
          }
        },
        {
          "body": "Jargala",
          "key": "${link_2}",
          "target": {
            "href": "Jargala_Omo",
            "page": "Jargala_Omo"
          }
        }
      ],
      "text": "At that moment, Tokuga entered the room and revealed that he had taken possession of the plans for gas dispersion pumps, which Wonyong had kept in his office since his failed deal with Hiroshi, and Wonyong told Asami that Hiroshi's desire to build illegal weaponry was what ultimately led to him to walk out on a business deal between the two. Tokuga threatened to murder Wonyong unless Asami agreed to build one of the pumps and attach it to one of the airships taken from the depot, the triad leader intending to use it to threaten Republic City with poison gas; Asami reluctantly agreed to his plans. After Asami finished work on the pump, the refinery was attacked by Korra, Mako, Bolin and Jargala. Tokuga and the triads managed to load Wonyong and Asami onto the airship before it took off, with Tokuga following them. As the airship flew back to the Republic City spirit portal, Wonyong and Asami agreed to work together to prevent Tokuga using the gas."
    },
    {
      "body": "Asami sabotaged the pump, causing it to release the gas inside the airship, subduing all the triad members on board except Tokuga, who was immune because of his mutation. Wonyong grabbed two gas masks, one for himself and one for Asami, to allow them to survive. Korra later made it onto the airship and battled Tokuga, while Asami piloted the airship through the portal and into the Spirit World, guessing that the spirits would be immune to the gas as Tokuga was. After the triad leader was forced out of the airship and left clinging to it with his tentacle arm, Wonyong dealt the final blow, severing the tentacle arm with a fire axe and causing him to fall from the airship, as Wonyong declared that Keum Enterprises belonged to him, not Tokuga.",
      "links": [],
      "text": "Asami sabotaged the pump, causing it to release the gas inside the airship, subduing all the triad members on board except Tokuga, who was immune because of his mutation. Wonyong grabbed two gas masks, one for himself and one for Asami, to allow them to survive. Korra later made it onto the airship and battled Tokuga, while Asami piloted the airship through the portal and into the Spirit World, guessing that the spirits would be immune to the gas as Tokuga was. After the triad leader was forced out of the airship and left clinging to it with his tentacle arm, Wonyong dealt the final blow, severing the tentacle arm with a fire axe and causing him to fall from the airship, as Wonyong declared that Keum Enterprises belonged to him, not Tokuga."
    },
    {
      "body": "After Asami managed to land the airship, Wonyong and the others were once again confronted by the dragon eel spirit, who insisted that there would never be peace between humans and spirits as long as humans like Wonyong were willing to exploit the Spirit World. Out of gratitude toward Korra and Asami for saving his life, Wonyong diffused the situation by agreeing to abandon his claim to the land around the spirit portal, explaining to the spirit that he did not wish to be the cause of further conflict in Republic City, and would rather help Korra to ensure peace. These actions caused Asami to admit that she had been wrong about Wonyong and apologize to him for doing so, to which he expressed a hope that their two companies could do business together in the future. Asami politely told Wonyong not to get ahead of himself, but added that she would see what happened in the future.",
      "links": [],
      "text": "After Asami managed to land the airship, Wonyong and the others were once again confronted by the dragon eel spirit, who insisted that there would never be peace between humans and spirits as long as humans like Wonyong were willing to exploit the Spirit World. Out of gratitude toward Korra and Asami for saving his life, Wonyong diffused the situation by agreeing to abandon his claim to the land around the spirit portal, explaining to the spirit that he did not wish to be the cause of further conflict in Republic City, and would rather help Korra to ensure peace. These actions caused Asami to admit that she had been wrong about Wonyong and apologize to him for doing so, to which he expressed a hope that their two companies could do business together in the future. Asami politely told Wonyong not to get ahead of himself, but added that she would see what happened in the future."
    },
    {
      "body": "Three weeks later, Wonyong attended ${link_0}'s election night party at the Four Elements hotel boardroom, and after she was confirmed as the winner and the new President of the United Republic, he listened to her victory speech, during which she declared that her first act as president would be to give Wonyong's land to the Air Nation, allowing them to protect the portal and the Spirit World from those seeking to desecrate them.",
      "links": [
        {
          "body": "Zhu Li",
          "key": "${link_0}",
          "target": {
            "href": "Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        }
      ],
      "text": "Three weeks later, Wonyong attended Zhu Li's election night party at the Four Elements hotel boardroom, and after she was confirmed as the winner and the new President of the United Republic, he listened to her victory speech, during which she declared that her first act as president would be to give Wonyong's land to the Air Nation, allowing them to protect the portal and the Spirit World from those seeking to desecrate them."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Wonyong_Keum",
    "file": "avatar.wikia.com/wiki/Wonyong_Keum.html",
    "page": "Wonyong_Keum",
    "title": "Wonyong Keum"
  }
}