{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Air Nomads",
      "target": {
        "href": "Category_Air_Nomads",
        "page": "Category_Air_Nomads"
      }
    },
    {
      "body": "Events",
      "target": {
        "href": "Category_Events",
        "page": "Category_Events"
      }
    },
    {
      "body": "Spirituality",
      "target": {
        "href": "Category_Spirituality",
        "page": "Category_Spirituality"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "${link_0}'s Festival was held by the ${link_1} in honor of the late ${link_2}.",
      "links": [
        {
          "body": "Yangchen",
          "key": "${link_0}",
          "target": {
            "href": "Yangchen",
            "page": "Yangchen"
          }
        },
        {
          "body": "Air Nomads",
          "key": "${link_1}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        }
      ],
      "text": "Yangchen's Festival was held by the Air Nomads in honor of the late Avatar."
    },
    {
      "body": "Yangchen's Festival was a ritual held by the ${link_0} to ensure that the terms of a deal ${link_1} ${link_2} brokered with General ${link_3} would continue. Despite having been recognized in the past as one of the nation's most symbolic holidays, observances ceased as a result of the ${link_4}. Shortly after the end of the ${link_5}, Avatar ${link_6} made efforts to reinstitute the festivities with the help of ${link_7} and the ${link_8}.",
      "links": [
        {
          "body": "Air Nomads",
          "key": "${link_0}",
          "target": {
            "href": "Air_Nomads",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Yangchen",
          "key": "${link_2}",
          "target": {
            "href": "Yangchen",
            "page": "Yangchen"
          }
        },
        {
          "body": "Old Iron",
          "key": "${link_3}",
          "target": {
            "href": "Old_Iron",
            "page": "Old_Iron"
          }
        },
        {
          "body": "Air Nomad Genocide",
          "key": "${link_4}",
          "target": {
            "href": "Air_Nomad_Genocide",
            "page": "Air_Nomad_Genocide"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_5}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Aang",
          "key": "${link_6}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_7}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Air Acolytes",
          "key": "${link_8}",
          "target": {
            "href": "Air_Acolytes",
            "page": "Air_Acolytes"
          }
        }
      ],
      "text": "Yangchen's Festival was a ritual held by the Air Nomads to ensure that the terms of a deal Avatar Yangchen brokered with General Old Iron would continue. Despite having been recognized in the past as one of the nation's most symbolic holidays, observances ceased as a result of the Air Nomad Genocide. Shortly after the end of the Hundred Year War, Avatar Aang made efforts to reinstitute the festivities with the help of Team Avatar and the Air Acolytes."
    },
    {
      "body": "Avatar Yangchen's first mission was to aid a city located at the meadow that would become the site for this festival. An angered spirit, General Old Iron, had begun to attack the city for a reason that was, at the time, unknown to its inhabitants. After fighting with the spirit all night, the people of the city having been evacuated, Yangchen was able to enter the ${link_0} and talk to the spirit. She learned that he was finally following through with a plan to wipe out the citizens that he had devised many centuries beforehand; the only thing that stopped him at that time was Lady ${link_1}, another spirit whom he had sworn to protect. Her death, only a few nights previous to his attack, prompted him to return and destroy the village. Yangchen was able to make a deal with General Old Iron to spare the town: she would build a memorial to Lady Tienhai and revert the land to its natural state, free of human civilization, as a sign that humans could preserve and protect and balance was possible between the worlds. She would lead the Air Nomads to the land once a year as no one else would defile it because of its sacred status. After Yangchen's death, the Air Nomads kept the tradition faithfully until they were wiped out.",
      "links": [
        {
          "body": "Avatar State",
          "key": "${link_0}",
          "target": {
            "href": "Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Tienhai",
          "key": "${link_1}",
          "target": {
            "href": "Tienhai",
            "page": "Tienhai"
          }
        }
      ],
      "text": "Avatar Yangchen's first mission was to aid a city located at the meadow that would become the site for this festival. An angered spirit, General Old Iron, had begun to attack the city for a reason that was, at the time, unknown to its inhabitants. After fighting with the spirit all night, the people of the city having been evacuated, Yangchen was able to enter the Avatar State and talk to the spirit. She learned that he was finally following through with a plan to wipe out the citizens that he had devised many centuries beforehand; the only thing that stopped him at that time was Lady Tienhai, another spirit whom he had sworn to protect. Her death, only a few nights previous to his attack, prompted him to return and destroy the village. Yangchen was able to make a deal with General Old Iron to spare the town: she would build a memorial to Lady Tienhai and revert the land to its natural state, free of human civilization, as a sign that humans could preserve and protect and balance was possible between the worlds. She would lead the Air Nomads to the land once a year as no one else would defile it because of its sacred status. After Yangchen's death, the Air Nomads kept the tradition faithfully until they were wiped out."
    },
    {
      "body": "Due to Avatar Yangchen's devotion to her duty as the Avatar, no threats of war occurred for an entire generation following her death around 345 ${link_0}. As a result of this, she was highly respected by her people, so much that two statues were erected in her honor in both the ${link_1} and ${link_2}. The Air Nomads also immortalized her achievements, one of which was her victory over a powerful spirit, by declaring a festival in her name, which eventually became to be considered as one of the nation's most sacred celebrations.",
      "links": [
        {
          "body": "BG",
          "key": "${link_0}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "Eastern",
          "key": "${link_1}",
          "target": {
            "href": "Eastern_Air_Temple",
            "page": "Eastern_Air_Temple"
          }
        },
        {
          "body": "Western Air Temples",
          "key": "${link_2}",
          "target": {
            "href": "Western_Air_Temple",
            "page": "Western_Air_Temple"
          }
        }
      ],
      "text": "Due to Avatar Yangchen's devotion to her duty as the Avatar, no threats of war occurred for an entire generation following her death around 345 BG. As a result of this, she was highly respected by her people, so much that two statues were erected in her honor in both the Eastern and Western Air Temples. The Air Nomads also immortalized her achievements, one of which was her victory over a powerful spirit, by declaring a festival in her name, which eventually became to be considered as one of the nation's most sacred celebrations."
    },
    {
      "body": "The celebrations start by bowing four times to a statue of Lady ${link_0}, before marching down under guidance of music to a sacred meadow to enjoy a ceremonial meal.",
      "links": [
        {
          "body": "Tienhai",
          "key": "${link_0}",
          "target": {
            "href": "Tienhai",
            "page": "Tienhai"
          }
        }
      ],
      "text": "The celebrations start by bowing four times to a statue of Lady Tienhai, before marching down under guidance of music to a sacred meadow to enjoy a ceremonial meal."
    },
    {
      "body": "On the day of Yangchen's Festival, Air Nomads traveled to a cliff overlooking the ocean, where a statue of a woman was erected. To begin the festivities, the nomads would gather beneath the statue and bow four times as a sign of respect, before making their way to a secluded meadow located down the cliff. The march is accompanied by traditional Air Nomad ${link_0}. A traditional Air Nomad meal takes place in the meadow, consisting primarily of tofu and an assortment of vegetables. Following this, the monks took the young nomads to an island just off the coast, where they used ${link_1} to fly ${link_2} kites. Afterward, the nomads would share a meal.",
      "links": [
        {
          "body": "music",
          "key": "${link_0}",
          "target": {
            "href": "Music_in_the_World_of_Avatar",
            "page": "Music_in_the_World_of_Avatar"
          }
        },
        {
          "body": "airbending",
          "key": "${link_1}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "cranefish",
          "key": "${link_2}",
          "target": {
            "href": "Cranefish",
            "page": "Cranefish"
          }
        }
      ],
      "text": "On the day of Yangchen's Festival, Air Nomads traveled to a cliff overlooking the ocean, where a statue of a woman was erected. To begin the festivities, the nomads would gather beneath the statue and bow four times as a sign of respect, before making their way to a secluded meadow located down the cliff. The march is accompanied by traditional Air Nomad music. A traditional Air Nomad meal takes place in the meadow, consisting primarily of tofu and an assortment of vegetables. Following this, the monks took the young nomads to an island just off the coast, where they used airbending to fly cranefish kites. Afterward, the nomads would share a meal."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Yangchen%27s_Festival",
    "file": "avatar.wikia.com/wiki/Yangchen's_Festival.html",
    "page": "Yangchen's_Festival",
    "title": "Yangchen's Festival"
  }
}