{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "href": "Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}.",
      "links": [
        {
          "body": "Yue",
          "key": "${link_0}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        }
      ],
      "text": "This page is comprised of Yue's relationships with other characters in the World of Avatar."
    },
    {
      "body": "${link_0} sitting next to her father, ${link_1} ${link_2}.",
      "links": [
        {
          "body": "Yue",
          "key": "${link_0}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Chief",
          "key": "${link_1}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Arnook",
          "key": "${link_2}",
          "target": {
            "href": "Arnook",
            "page": "Arnook"
          }
        }
      ],
      "text": "Yue sitting next to her father, Chief Arnook."
    },
    {
      "body": "When Yue was born, her father, ${link_0} ${link_1}, had a spiritual vision of his daughter; he learned that when she matured, she would become the reincarnation of the ${link_2}. Shortly after her parents found out she had a fatal illness, her father prayed to the Moon Spirit every day to heal his daughter. One night, beneath a full moon, he placed her in the ${link_3}. The Moon Spirit placed a bit of her own life force within Yue, who was subsequently given her name, which meant \"moon\".",
      "links": [
        {
          "body": "Chief",
          "key": "${link_0}",
          "target": {
            "href": "Tribal_chief",
            "page": "Tribal_chief"
          }
        },
        {
          "body": "Arnook",
          "key": "${link_1}",
          "target": {
            "href": "Arnook",
            "page": "Arnook"
          }
        },
        {
          "body": "Moon Spirit",
          "key": "${link_2}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        },
        {
          "body": "Spirit Oasis",
          "key": "${link_3}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        }
      ],
      "text": "When Yue was born, her father, Chief Arnook, had a spiritual vision of his daughter; he learned that when she matured, she would become the reincarnation of the Moon Spirit. Shortly after her parents found out she had a fatal illness, her father prayed to the Moon Spirit every day to heal his daughter. One night, beneath a full moon, he placed her in the Spirit Oasis. The Moon Spirit placed a bit of her own life force within Yue, who was subsequently given her name, which meant \"moon\"."
    },
    {
      "body": "Arnook was very gentle and compassionate toward his daughter. As shown by his actions after she was born, he was spiritual and willing to do anything to save his daughter's life. She was always seen by his side at formal tribal events. Though their relationship was sometimes strained, such when it was arranged that Yue would marry ${link_0}, he showed that he always has his daughter's interests at heart. The Chief appointed ${link_1} to look after his daughter during the ${link_2}, wishing to protect her from any threats. He was last seen gazing at the moon, with the knowledge that his daughter had fulfilled her destiny as the Moon Spirit.",
      "links": [
        {
          "body": "Hahn",
          "key": "${link_0}",
          "target": {
            "href": "Hahn",
            "page": "Hahn"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Siege of the North",
          "key": "${link_2}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        }
      ],
      "text": "Arnook was very gentle and compassionate toward his daughter. As shown by his actions after she was born, he was spiritual and willing to do anything to save his daughter's life. She was always seen by his side at formal tribal events. Though their relationship was sometimes strained, such when it was arranged that Yue would marry Hahn, he showed that he always has his daughter's interests at heart. The Chief appointed Sokka to look after his daughter during the Siege of the North, wishing to protect her from any threats. He was last seen gazing at the moon, with the knowledge that his daughter had fulfilled her destiny as the Moon Spirit."
    },
    {
      "body": "${link_0} revealing her ${link_1} from ${link_2}.",
      "links": [
        {
          "body": "Yue",
          "key": "${link_0}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "betrothal necklace",
          "key": "${link_1}",
          "target": {
            "href": "Betrothal_necklace",
            "page": "Betrothal_necklace"
          }
        },
        {
          "body": "Hahn",
          "key": "${link_2}",
          "target": {
            "href": "Hahn",
            "page": "Hahn"
          }
        }
      ],
      "text": "Yue revealing her betrothal necklace from Hahn."
    },
    {
      "body": "Sometime prior to ${link_0}'s arrival at the ${link_1}, it was arranged that Yue would marry a young, egotistical warrior named Hahn who carved a ${link_2} for her to mark their engagement. It was revealed that she did not really love Hahn and was marrying out of a sense of duty \"for her people\", suggesting it was more of a political marriage than a romantic one. Similarly, Hahn was more enthralled with her high status than with Yue herself. He boasted once to Sokka that \"she [came] with the most perks\". Though she did not really love him, she remained loyal to their engagement anyway and refused Sokka's first advances.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "betrothal necklace",
          "key": "${link_2}",
          "target": {
            "href": "Betrothal_necklace",
            "page": "Betrothal_necklace"
          }
        }
      ],
      "text": "Sometime prior to Team Avatar's arrival at the Northern Water Tribe, it was arranged that Yue would marry a young, egotistical warrior named Hahn who carved a betrothal necklace for her to mark their engagement. It was revealed that she did not really love Hahn and was marrying out of a sense of duty \"for her people\", suggesting it was more of a political marriage than a romantic one. Similarly, Hahn was more enthralled with her high status than with Yue herself. He boasted once to Sokka that \"she [came] with the most perks\". Though she did not really love him, she remained loyal to their engagement anyway and refused Sokka's first advances."
    },
    {
      "body": "${link_0} and ${link_1} kissing.",
      "links": [
        {
          "body": "Yue",
          "key": "${link_0}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Yue and Sokka kissing."
    },
    {
      "body": "When Sokka first arrived at the Northern Water Tribe, he became smitten with the young princess. Yue displayed affection for him as well, laughing at his jokes and seemingly impressed when he told her that he was \"like a prince\" in his tribe. The two met again the next day and arranged meetings. These included riding on ${link_0} and taking walks together. Sokka and Yue came to realize their love for one another, but she could not bear to continue seeing him because she was engaged to another man.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        }
      ],
      "text": "When Sokka first arrived at the Northern Water Tribe, he became smitten with the young princess. Yue displayed affection for him as well, laughing at his jokes and seemingly impressed when he told her that he was \"like a prince\" in his tribe. The two met again the next day and arranged meetings. These included riding on Appa and taking walks together. Sokka and Yue came to realize their love for one another, but she could not bear to continue seeing him because she was engaged to another man."
    },
    {
      "body": "Yue eventually refused to see Sokka anymore because she was already engaged to the warrior Hahn, though in reality it was a political union and she did not love him. She explained that she had feelings for Sokka, but could not alienate her people and their customs. Sokka countered that she was not marrying her people. Both of their feelings persisted, and during ${link_0} ${link_1}'s siege of the Northern Water Tribe, Sokka was ordered by Arnook to act as Yue's bodyguard. The relationship came to a tragic end when Yue sacrificed her mortal form to give the Moon Spirit new life after Admiral Zhao killed the mortal form of the Moon Spirit. Her spirit appeared before him shortly after, wearing a long white gown. She whispered, \"Goodbye, Sokka. I'll always be with you,\" and the two shared a final kiss before she vanished completely.",
      "links": [
        {
          "body": "Admiral",
          "key": "${link_0}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        }
      ],
      "text": "Yue eventually refused to see Sokka anymore because she was already engaged to the warrior Hahn, though in reality it was a political union and she did not love him. She explained that she had feelings for Sokka, but could not alienate her people and their customs. Sokka countered that she was not marrying her people. Both of their feelings persisted, and during Admiral Zhao's siege of the Northern Water Tribe, Sokka was ordered by Arnook to act as Yue's bodyguard. The relationship came to a tragic end when Yue sacrificed her mortal form to give the Moon Spirit new life after Admiral Zhao killed the mortal form of the Moon Spirit. Her spirit appeared before him shortly after, wearing a long white gown. She whispered, \"Goodbye, Sokka. I'll always be with you,\" and the two shared a final kiss before she vanished completely."
    },
    {
      "body": "Several times following her death, Yue's influence on Sokka returned. While in the ${link_0}, Sokka, under the swamp's magical influence, saw a vision of her. The vision of Yue angrily told Sokka that he had failed to protect her. During his time in the ${link_1}, Sokka directly referred to the moon as Yue in the intoxicated state brought about by drinking ${link_2}.",
      "links": [
        {
          "body": "Foggy Swamp",
          "key": "${link_0}",
          "target": {
            "href": "Foggy_Swamp",
            "page": "Foggy_Swamp"
          }
        },
        {
          "body": "Si Wong Desert",
          "key": "${link_1}",
          "target": {
            "href": "Si_Wong_Desert",
            "page": "Si_Wong_Desert"
          }
        },
        {
          "body": "cactus juice",
          "key": "${link_2}",
          "target": {
            "href": "Cactus_juice",
            "page": "Cactus_juice"
          }
        }
      ],
      "text": "Several times following her death, Yue's influence on Sokka returned. While in the Foggy Swamp, Sokka, under the swamp's magical influence, saw a vision of her. The vision of Yue angrily told Sokka that he had failed to protect her. During his time in the Si Wong Desert, Sokka directly referred to the moon as Yue in the intoxicated state brought about by drinking cactus juice."
    },
    {
      "body": "When Sokka and ${link_0} nearly kissed while crossing the ${link_1}, the moon was visible in the background, alluding to Yue's presence. Sokka's memories of Yue's death prompted him to refuse the kiss, while acting overly protective of Suki.",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Serpent's Pass",
          "key": "${link_1}",
          "target": {
            "href": "Serpent%27s_Pass",
            "page": "Serpent%27s_Pass"
          }
        }
      ],
      "text": "When Sokka and Suki nearly kissed while crossing the Serpent's Pass, the moon was visible in the background, alluding to Yue's presence. Sokka's memories of Yue's death prompted him to refuse the kiss, while acting overly protective of Suki."
    },
    {
      "body": "Several months later, while looking for leads regarding the disappearances surrounding the full moon, Sokka yelled at ${link_0} when she suggested that the Moon Spirit might be harming people, saying that the Moon Spirit was \"a gentle, loving lady who [ruled] the skies with compassion and lunar goodness,\" showing that he still cared deeply for Yue. While journeying with Zuko to the ${link_1}, Sokka mentioned that \"[his] first girlfriend turned into the moon.\"",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_1}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        }
      ],
      "text": "Several months later, while looking for leads regarding the disappearances surrounding the full moon, Sokka yelled at Toph when she suggested that the Moon Spirit might be harming people, saying that the Moon Spirit was \"a gentle, loving lady who [ruled] the skies with compassion and lunar goodness,\" showing that he still cared deeply for Yue. While journeying with Zuko to the Boiling Rock, Sokka mentioned that \"[his] first girlfriend turned into the moon.\""
    },
    {
      "body": "${link_0} guiding ${link_1} as the Moon Spirit.",
      "links": [
        {
          "body": "Yue",
          "key": "${link_0}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Yue guiding Aang as the Moon Spirit."
    },
    {
      "body": "Yue aided ${link_0} in entering the ${link_1} by leading him, along with ${link_2}, to the Spirit Oasis. Later, when Aang had been captured by ${link_3}, Yue accompanied Katara and Sokka as they tracked the two of them down on Appa.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_1}",
          "target": {
            "href": "Spirit_World",
            "page": "Spirit_World"
          }
        },
        {
          "body": "Katara",
          "key": "${link_2}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_3}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Yue aided Aang in entering the Spirit World by leading him, along with Katara, to the Spirit Oasis. Later, when Aang had been captured by Zuko, Yue accompanied Katara and Sokka as they tracked the two of them down on Appa."
    },
    {
      "body": "After Aang was struck down by Azula's ${link_0} during the ${link_1}, the Avatar met Yue in the Spirit World. She informed him of the damage that had taken place to the Avatar Spirit and explained how to return to his body, further instructing him to seek out the past four ${link_2} while avoiding ${link_3} the Face Stealer. She appeared to Aang once more to encourage him not to lose hope and to continue fighting. She subsequently assisted him in his impressive feat of ${link_4} to get himself to safety, utilizing her powers as the Moon Spirit.",
      "links": [
        {
          "body": "lightning",
          "key": "${link_0}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        },
        {
          "body": "Coup of Ba Sing Se",
          "key": "${link_1}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Avatars",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Koh",
          "key": "${link_3}",
          "target": {
            "href": "Koh",
            "page": "Koh"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_4}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        }
      ],
      "text": "After Aang was struck down by Azula's lightning during the Coup of Ba Sing Se, the Avatar met Yue in the Spirit World. She informed him of the damage that had taken place to the Avatar Spirit and explained how to return to his body, further instructing him to seek out the past four Avatars while avoiding Koh the Face Stealer. She appeared to Aang once more to encourage him not to lose hope and to continue fighting. She subsequently assisted him in his impressive feat of waterbending to get himself to safety, utilizing her powers as the Moon Spirit."
    },
    {
      "body": "${link_0} and ${link_1} together looking down at ${link_2}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Yue",
          "key": "${link_1}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Momo",
          "key": "${link_2}",
          "target": {
            "href": "Momo",
            "page": "Momo"
          }
        }
      ],
      "text": "Katara and Yue together looking down at Momo."
    },
    {
      "body": "During the time they spent together, Yue and Katara got along amicably and became friends. Yue led them to the Spirit Oasis where they worked together in helping Aang reach the Spirit World. Later, when Zuko attacked them, Katara used her waterbending to defend Aang while Yue ran to get Sokka. She accompanied Katara and Sokka as they tracked down Zuko and Aang on Appa. Katara would sometimes look toward Yue as the Moon Spirit, as a reference to her waterbending powers.",
      "links": [],
      "text": "During the time they spent together, Yue and Katara got along amicably and became friends. Yue led them to the Spirit Oasis where they worked together in helping Aang reach the Spirit World. Later, when Zuko attacked them, Katara used her waterbending to defend Aang while Yue ran to get Sokka. She accompanied Katara and Sokka as they tracked down Zuko and Aang on Appa. Katara would sometimes look toward Yue as the Moon Spirit, as a reference to her waterbending powers."
    },
    {
      "body": "${link_0} stands with ${link_1}.",
      "links": [
        {
          "body": "Yue",
          "key": "${link_0}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        }
      ],
      "text": "Yue stands with Iroh."
    },
    {
      "body": "Though they never knew each other formally, Iroh first encountered Yue when she and Team Avatar pleaded with Admiral Zhao not to kill Tui. Iroh joined the scene and threatened Zhao if he would not comply to the pleas of the others. After the Admiral did so anyway, Iroh stayed with Yue and the others and witnessed Aang merge with La. While they were all mourning the death of the Moon Spirit, Iroh noticed that Yue had been touched by the spirit, detecting some of its life force in her. Subsequently, Yue figured that she might be able to return the life to the spirit. Iroh held Tui's body out to her while she revived the spirit, and he was saddened by her resulting death.",
      "links": [],
      "text": "Though they never knew each other formally, Iroh first encountered Yue when she and Team Avatar pleaded with Admiral Zhao not to kill Tui. Iroh joined the scene and threatened Zhao if he would not comply to the pleas of the others. After the Admiral did so anyway, Iroh stayed with Yue and the others and witnessed Aang merge with La. While they were all mourning the death of the Moon Spirit, Iroh noticed that Yue had been touched by the spirit, detecting some of its life force in her. Subsequently, Yue figured that she might be able to return the life to the spirit. Iroh held Tui's body out to her while she revived the spirit, and he was saddened by her resulting death."
    },
    {
      "body": "${link_0} giving up her life to revive the ${link_1}.",
      "links": [
        {
          "body": "Yue",
          "key": "${link_0}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        },
        {
          "body": "Moon Spirit",
          "key": "${link_1}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        }
      ],
      "text": "Yue giving up her life to revive the Moon Spirit."
    },
    {
      "body": "When Yue was born with a serious illness, her parents prayed for her survival as she was incredibly ill, weak, and on the brink of death. One night, they placed her in the Spirit Oasis where the Moon Spirit gifted her with part of its own life force, saving her life and turning her hair white as a side effect. Thus, her parents named her Yue, in honor of the moon.",
      "links": [],
      "text": "When Yue was born with a serious illness, her parents prayed for her survival as she was incredibly ill, weak, and on the brink of death. One night, they placed her in the Spirit Oasis where the Moon Spirit gifted her with part of its own life force, saving her life and turning her hair white as a side effect. Thus, her parents named her Yue, in honor of the moon."
    },
    {
      "body": "When the Fire Nation invaded, Admiral Zhao killed Tui, the Moon Spirit. Yue realized the only way to save the Moon Spirit was to give up her own life force. Yue subsequently sacrificed her life in order to resurrect the spirit. Once this happened, not only did the moon return to its full power, but Yue's physical body disappeared and manifested itself in a spiritual form, making her the new Moon Spirit.",
      "links": [],
      "text": "When the Fire Nation invaded, Admiral Zhao killed Tui, the Moon Spirit. Yue realized the only way to save the Moon Spirit was to give up her own life force. Yue subsequently sacrificed her life in order to resurrect the spirit. Once this happened, not only did the moon return to its full power, but Yue's physical body disappeared and manifested itself in a spiritual form, making her the new Moon Spirit."
    },
    {
      "body": "By having her life force energy re-bonded with Tui, Yue not only reincarnated as Tui's successor, but she also gained the ability to waterbend, a trait she did not carry in her previous life. Her abilities were seen to some extent when she generated a massive wave on which Aang could ride toward the ${link_0} where ${link_1} once stood.",
      "links": [
        {
          "body": "island",
          "key": "${link_0}",
          "target": {
            "href": "Crescent_Island",
            "page": "Crescent_Island"
          }
        },
        {
          "body": "Roku's temple",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Temple",
            "page": "Fire_Temple"
          }
        }
      ],
      "text": "By having her life force energy re-bonded with Tui, Yue not only reincarnated as Tui's successor, but she also gained the ability to waterbend, a trait she did not carry in her previous life. Her abilities were seen to some extent when she generated a massive wave on which Aang could ride toward the island where Roku's temple once stood."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Yue%27s_relationships",
    "file": "avatar.wikia.com/wiki/Yue's_relationships.html",
    "page": "Yue's_relationships",
    "title": "Yue's relationships"
  }
}