{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Earth Kingdom",
      "target": {
        "href": "Category_Earth_Kingdom",
        "page": "Category_Earth_Kingdom"
      }
    },
    {
      "body": "Legend of Korra",
      "target": {
        "href": "Category_Legend_of_Korra",
        "page": "Category_Legend_of_Korra"
      }
    },
    {
      "body": "Locations",
      "target": {
        "href": "Category_Locations",
        "page": "Category_Locations"
      }
    },
    {
      "body": "Settlements",
      "target": {
        "href": "Category_Settlements",
        "page": "Category_Settlements"
      }
    }
  ],
  "facts": [
    {
      "key": "Location",
      "value": [
        {
          "body": "Southwestern ${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Earth Kingdom",
              "key": "${link_0}",
              "target": {
                "href": "Earth_Kingdom",
                "page": "Earth_Kingdom"
              }
            }
          ],
          "text": "Southwestern Earth Kingdom",
          "value": "Southwestern ${link_0}",
          "value_text": "Southwestern Earth Kingdom"
        }
      ]
    },
    {
      "key": "Position",
      "value": [
        {
          "body": "Autonomous city state",
          "extra": "",
          "extra_text": "",
          "links": [],
          "text": "Autonomous city state",
          "value": "Autonomous city state",
          "value_text": "Autonomous city state"
        }
      ]
    },
    {
      "key": "Leader",
      "value": [
        {
          "body": "${link_0} (formerly)",
          "extra": "(formerly)",
          "extra_text": "(formerly)",
          "links": [
            {
              "body": "Kuvira",
              "key": "${link_0}",
              "target": {
                "href": "Kuvira",
                "page": "Kuvira"
              }
            }
          ],
          "text": "Kuvira (formerly)",
          "value": "${link_0}",
          "value_text": "Kuvira"
        },
        {
          "body": "${link_0}",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "Suyin Beifong",
              "key": "${link_0}",
              "target": {
                "href": "Suyin_Beifong",
                "page": "Suyin_Beifong"
              }
            }
          ],
          "text": "Suyin Beifong",
          "value": "${link_0}",
          "value_text": "Suyin Beifong"
        }
      ]
    },
    {
      "key": "First appearance",
      "value": [
        {
          "body": "\"${link_0}\"",
          "extra": "",
          "extra_text": "",
          "links": [
            {
              "body": "The Metal Clan",
              "key": "${link_0}",
              "target": {
                "href": "The_Metal_Clan",
                "page": "The_Metal_Clan"
              }
            }
          ],
          "text": "\"The Metal Clan\"",
          "value": "\"${link_0}\"",
          "value_text": "\"The Metal Clan\""
        }
      ]
    }
  ],
  "paragraphs": [
    {
      "body": "Zaofu is an autonomous city-state, located in the southwestern part of the ${link_0}, and the home of the ${link_1}. Founded by ${link_2}, the Clan's matriarch, Zaofu is constructed entirely out of metal and is regarded by some as the safest city in the world. ${link_3} traveled to the city in 171 ${link_4} in their search to recruit new ${link_5} to rebuild the ${link_6}. In 174 AG, the Zaofu was ${link_7} to ${link_8}'s Earth Empire, who sent off all the citizens who refused to acknowledge her rule, and took down its protective platinum domes. After the failed ${link_9}, Kuvira surrendered and relinquished control over the Earth Kingdom, which restored Suyin as the city's leader.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Metal Clan",
          "key": "${link_1}",
          "target": {
            "href": "Metal_Clan",
            "page": "Metal_Clan"
          }
        },
        {
          "body": "Suyin Beifong",
          "key": "${link_2}",
          "target": {
            "href": "Suyin_Beifong",
            "page": "Suyin_Beifong"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        },
        {
          "body": "AG",
          "key": "${link_4}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "airbenders",
          "key": "${link_5}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Air Nation",
          "key": "${link_6}",
          "target": {
            "href": "Air_Nomads#Rebirth_of_a_nation",
            "page": "Air_Nomads"
          }
        },
        {
          "body": "annexed",
          "key": "${link_7}",
          "target": {
            "href": "Fall_of_Zaofu",
            "page": "Fall_of_Zaofu"
          }
        },
        {
          "body": "Kuvira",
          "key": "${link_8}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "invasion of the United Republic of Nations",
          "key": "${link_9}",
          "target": {
            "href": "Invasion_of_the_United_Republic_of_Nations",
            "page": "Invasion_of_the_United_Republic_of_Nations"
          }
        }
      ],
      "text": "Zaofu is an autonomous city-state, located in the southwestern part of the Earth Kingdom, and the home of the Metal Clan. Founded by Suyin Beifong, the Clan's matriarch, Zaofu is constructed entirely out of metal and is regarded by some as the safest city in the world. Team Avatar traveled to the city in 171 AG in their search to recruit new airbenders to rebuild the Air Nation. In 174 AG, the Zaofu was annexed to Kuvira's Earth Empire, who sent off all the citizens who refused to acknowledge her rule, and took down its protective platinum domes. After the failed invasion of the United Republic of Nations, Kuvira surrendered and relinquished control over the Earth Kingdom, which restored Suyin as the city's leader."
    },
    {
      "body": "Sometime after 141 AG, Suyin Beifong purchased a parcel of land to develop into the city of Zaofu. To advance her project, Suyin worked with ${link_0}, an architect whom she eventually married and had five children with. Suyin's eldest son, ${link_1} eventually became an engineer and assisted his father in numerous projects around the city.",
      "links": [
        {
          "body": "Baatar",
          "key": "${link_0}",
          "target": {
            "href": "Baatar",
            "page": "Baatar"
          }
        },
        {
          "body": "Baatar Jr.",
          "key": "${link_1}",
          "target": {
            "href": "Baatar_Jr",
            "page": "Baatar_Jr"
          }
        }
      ],
      "text": "Sometime after 141 AG, Suyin Beifong purchased a parcel of land to develop into the city of Zaofu. To advance her project, Suyin worked with Baatar, an architect whom she eventually married and had five children with. Suyin's eldest son, Baatar Jr. eventually became an engineer and assisted his father in numerous projects around the city."
    },
    {
      "body": "Following Zaofu's creation, ${link_0} occassionally visited the city and statues of her were erected to commemorate her discovery of metalbending. Suyin's philosophy in governing Zaofu was to encourage citizens to reach their fullest potential in whatever they pursued, and the city thrived as one of the Earth Kingdom's most technologically innovative settlements.",
      "links": [
        {
          "body": "Toph Beifong",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        }
      ],
      "text": "Following Zaofu's creation, Toph Beifong occassionally visited the city and statues of her were erected to commemorate her discovery of metalbending. Suyin's philosophy in governing Zaofu was to encourage citizens to reach their fullest potential in whatever they pursued, and the city thrived as one of the Earth Kingdom's most technologically innovative settlements."
    },
    {
      "body": "${link_0} and two guards welcomed ${link_1} and her company to Zaofu shortly after their arrival in 171 ${link_2}.",
      "links": [
        {
          "body": "Aiwei",
          "key": "${link_0}",
          "target": {
            "href": "Aiwei",
            "page": "Aiwei"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "AG",
          "key": "${link_2}",
          "target": {
            "href": "History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        }
      ],
      "text": "Aiwei and two guards welcomed Korra and her company to Zaofu shortly after their arrival in 171 AG."
    },
    {
      "body": "Shortly after ${link_0} in 171 AG, ${link_1} and ${link_2} traveled to Zaofu, where the former sought refuge in exchange to head the city's technology division. Two weeks later, ${link_3} ${link_4} and her company arrived to the city in hopes of recruiting Suyin's daughter, ${link_5}, to hone her newfound ${link_6} abilities at the ${link_7}.",
      "links": [
        {
          "body": "Harmonic Convergence",
          "key": "${link_0}",
          "target": {
            "href": "Harmonic_Convergence",
            "page": "Harmonic_Convergence"
          }
        },
        {
          "body": "Varrick",
          "key": "${link_1}",
          "target": {
            "href": "Iknik_Blackstone_Varrick",
            "page": "Iknik_Blackstone_Varrick"
          }
        },
        {
          "body": "Zhu Li",
          "key": "${link_2}",
          "target": {
            "href": "Zhu_Li_Moon",
            "page": "Zhu_Li_Moon"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_4}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Opal",
          "key": "${link_5}",
          "target": {
            "href": "Opal",
            "page": "Opal"
          }
        },
        {
          "body": "airbending",
          "key": "${link_6}",
          "target": {
            "href": "Airbending",
            "page": "Airbending"
          }
        },
        {
          "body": "Northern Air Temple",
          "key": "${link_7}",
          "target": {
            "href": "Northern_Air_Temple",
            "page": "Northern_Air_Temple"
          }
        }
      ],
      "text": "Shortly after Harmonic Convergence in 171 AG, Varrick and Zhu Li traveled to Zaofu, where the former sought refuge in exchange to head the city's technology division. Two weeks later, Avatar Korra and her company arrived to the city in hopes of recruiting Suyin's daughter, Opal, to hone her newfound airbending abilities at the Northern Air Temple."
    },
    {
      "body": "After the airbender's departure, the city was infiltrated by ${link_0} and the ${link_1} in an attempt to kidnap Korra. Despite their attempts to remain covert, the group was discovered and pursued by Team Avatar and members of the Metal Clan, inevitably forcing them to flee the city without the Avatar. Aiwei told Suyin that Korra's abduction appeared to be the result of an inside job; as such, Suyin ordered the interrogation of all the guards in search of Zaheer's accomplice. Although ${link_2} was initially suspected, ${link_3}'s involvement eventually came to light and the truth seer was forced to leave the city as a fugitive, having a few hours' head start on Team Avatar, who left the city to find him.",
      "links": [
        {
          "body": "Zaheer",
          "key": "${link_0}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Red Lotus",
          "key": "${link_1}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "Hong Li",
          "key": "${link_2}",
          "target": {
            "href": "Hong_Li",
            "page": "Hong_Li"
          }
        },
        {
          "body": "Aiwei",
          "key": "${link_3}",
          "target": {
            "href": "Aiwei",
            "page": "Aiwei"
          }
        }
      ],
      "text": "After the airbender's departure, the city was infiltrated by Zaheer and the Red Lotus in an attempt to kidnap Korra. Despite their attempts to remain covert, the group was discovered and pursued by Team Avatar and members of the Metal Clan, inevitably forcing them to flee the city without the Avatar. Aiwei told Suyin that Korra's abduction appeared to be the result of an inside job; as such, Suyin ordered the interrogation of all the guards in search of Zaheer's accomplice. Although Hong Li was initially suspected, Aiwei's involvement eventually came to light and the truth seer was forced to leave the city as a fugitive, having a few hours' head start on Team Avatar, who left the city to find him."
    },
    {
      "body": "Team Avatar later returned to Zaofu, accompanied by Lin, ${link_0}, Lord ${link_1}, and Mako and Bolin's family, in order to use the city's radio transmission to send a warning to the Northern Air Temple about the Red Lotus' approach. Unable to sit idly by at the prospect of her daughter getting harmed, Suyin rallied the Metal Clan security forces to leave for the temple to aid the Air Nation.",
      "links": [
        {
          "body": "Tonraq",
          "key": "${link_0}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Team Avatar later returned to Zaofu, accompanied by Lin, Tonraq, Lord Zuko, and Mako and Bolin's family, in order to use the city's radio transmission to send a warning to the Northern Air Temple about the Red Lotus' approach. Unable to sit idly by at the prospect of her daughter getting harmed, Suyin rallied the Metal Clan security forces to leave for the temple to aid the Air Nation."
    },
    {
      "body": "After the death of ${link_0} ${link_1} and despite Suyin's refusal to take action, Kuvira started working with Baatar Jr. to find ways to stabilize the chaotic Earth Kingdom. They left the city with a large part of its security force and a few of Zaofu's wealthiest citizens.",
      "links": [
        {
          "body": "Earth Queen",
          "key": "${link_0}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_1}",
          "target": {
            "href": "Hou-Ting",
            "page": "Hou-Ting"
          }
        }
      ],
      "text": "After the death of Earth Queen Hou-Ting and despite Suyin's refusal to take action, Kuvira started working with Baatar Jr. to find ways to stabilize the chaotic Earth Kingdom. They left the city with a large part of its security force and a few of Zaofu's wealthiest citizens."
    },
    {
      "body": "After the Earth Kingdom's transformation into the Earth Empire in 174 AG, Zaofu remained as the last city unconquered by Kuvira and ${link_0}. However, the former captain of the guard marched her entire army toward her former home and gave its matriarch twenty-four hours to surrender, lest they take the city by force.",
      "links": [
        {
          "body": "her forces",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        }
      ],
      "text": "After the Earth Kingdom's transformation into the Earth Empire in 174 AG, Zaofu remained as the last city unconquered by Kuvira and her forces. However, the former captain of the guard marched her entire army toward her former home and gave its matriarch twenty-four hours to surrender, lest they take the city by force."
    },
    {
      "body": "Annexed by ${link_0} to her ${link_1}, Zaofu was decorated with the empire's banners.",
      "links": [
        {
          "body": "Kuvira",
          "key": "${link_0}",
          "target": {
            "href": "Kuvira",
            "page": "Kuvira"
          }
        },
        {
          "body": "Earth Empire",
          "key": "${link_1}",
          "target": {
            "href": "Military_of_the_Earth_Empire",
            "page": "Military_of_the_Earth_Empire"
          }
        }
      ],
      "text": "Annexed by Kuvira to her Earth Empire, Zaofu was decorated with the empire's banners."
    },
    {
      "body": "In order to save the city, Suyin, ${link_0} set out during the night in an attempt to take Kuvira out, though they were unsuccessful and were arrested. Kuvira used the city's communication system to alert the citizens of Suyin's actions and fate and ordered the remaining leaders to surrender by dawn. Still attempting to find a peaceful resolution, Korra approached Kuvira at dawn and attempted to persuade the army leader one last time to leave. However, Kuvira believed Korra was interfering with her plans of uniting the Earth Empire and thus challenged her to a duel to decide the fate of Zaofu. After Korra lost the duel, the military commander annexed the city to her empire and decorated its buildings with her banner. She demanded everyone bow down and pledge their loyalty to her in order to be treated fairly as citizens of the Earth Empire, lest they be imprisoned as traitors. Kuvira ordered her army to dismantle the platinum domes and cover Toph Beifong's statue in the downtown core.",
      "links": [
        {
          "body": "Wing, and Wei",
          "key": "${link_0}",
          "target": {
            "href": "Wei_and_Wing",
            "page": "Wei_and_Wing"
          }
        }
      ],
      "text": "In order to save the city, Suyin, Wing, and Wei set out during the night in an attempt to take Kuvira out, though they were unsuccessful and were arrested. Kuvira used the city's communication system to alert the citizens of Suyin's actions and fate and ordered the remaining leaders to surrender by dawn. Still attempting to find a peaceful resolution, Korra approached Kuvira at dawn and attempted to persuade the army leader one last time to leave. However, Kuvira believed Korra was interfering with her plans of uniting the Earth Empire and thus challenged her to a duel to decide the fate of Zaofu. After Korra lost the duel, the military commander annexed the city to her empire and decorated its buildings with her banner. She demanded everyone bow down and pledge their loyalty to her in order to be treated fairly as citizens of the Earth Empire, lest they be imprisoned as traitors. Kuvira ordered her army to dismantle the platinum domes and cover Toph Beifong's statue in the downtown core."
    },
    {
      "body": "After Bolin and Varrick warned the world leaders about Kuvira's spirit energy cannon, Bolin, Lin, and Opal left for Zaofu with aspirations to reconquer the city and find the family of the latter two. When they arrived, they realized that the domes had been removed, though before they were able to sneak into the city, Toph stopped them, informing them that all the prisoners had been moved out of the city.",
      "links": [],
      "text": "After Bolin and Varrick warned the world leaders about Kuvira's spirit energy cannon, Bolin, Lin, and Opal left for Zaofu with aspirations to reconquer the city and find the family of the latter two. When they arrived, they realized that the domes had been removed, though before they were able to sneak into the city, Toph stopped them, informing them that all the prisoners had been moved out of the city."
    },
    {
      "body": "A few days later, Kuvira and her entourage returned to the city, where she addressed her troops in a motivational speech. She announced that they were going to annex the ${link_0}, reasoning that its territory belonged to the Earth Empire and had been stolen by Avatar ${link_1} and ${link_2} ${link_3} after the conclusion of the ${link_4}.",
      "links": [
        {
          "body": "United Republic of Nations",
          "key": "${link_0}",
          "target": {
            "href": "United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_2}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_3}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_4}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        }
      ],
      "text": "A few days later, Kuvira and her entourage returned to the city, where she addressed her troops in a motivational speech. She announced that they were going to annex the United Republic of Nations, reasoning that its territory belonged to the Earth Empire and had been stolen by Avatar Aang and Fire Lord Zuko after the conclusion of the Hundred Year War."
    },
    {
      "body": "After the failed invasion, Kuvira surrendered and Suyin became the recognized leader of Zaofu once more. However, Earth King ${link_0} announced that he would move to abolish the monarchy in favor of independent states with a democratically elected government.",
      "links": [
        {
          "body": "Wu",
          "key": "${link_0}",
          "target": {
            "href": "Wu",
            "page": "Wu"
          }
        }
      ],
      "text": "After the failed invasion, Kuvira surrendered and Suyin became the recognized leader of Zaofu once more. However, Earth King Wu announced that he would move to abolish the monarchy in favor of independent states with a democratically elected government."
    },
    {
      "body": "Zaofu is situated directly on a valley flanked by two rivers and surrounded by mountains. Consisting of five different sectors, the city is connected by a series of metal rails on which a state-of-the-art ${link_0} system operates, allowing citizens to reach opposing ends of the city limits in very little time.",
      "links": [
        {
          "body": "monorail",
          "key": "${link_0}",
          "target": {
            "href": "Monorail",
            "page": "Monorail"
          }
        }
      ],
      "text": "Zaofu is situated directly on a valley flanked by two rivers and surrounded by mountains. Consisting of five different sectors, the city is connected by a series of metal rails on which a state-of-the-art monorail system operates, allowing citizens to reach opposing ends of the city limits in very little time."
    },
    {
      "body": "At night, platinum domes around each major portion of the city close to provide protection.",
      "links": [],
      "text": "At night, platinum domes around each major portion of the city close to provide protection."
    },
    {
      "body": "Architecture used in developing the city landmarks involves innovative design, particularly in that each portion of the settlement is surrounded by petal-like metal panels with exteriors made of platinum, which remain open during the day and closed to provide protection during the night. Following the city's brief annexation into the Earth Empire, the platinum domes were torn down and used by Kuvira's army to build an enormous mecha suit. Buildings range from small edifices to large skyscrapers and a large metal statue of Toph Beifong stands in the middle of the downtown core. At the city's edge is Suyin Beifong's estate, a large metal compound consisting of numerous halls and courtyards to accommodate her large family. Near the estate are several guesthouses for individuals which Suyin chooses to receive.",
      "links": [],
      "text": "Architecture used in developing the city landmarks involves innovative design, particularly in that each portion of the settlement is surrounded by petal-like metal panels with exteriors made of platinum, which remain open during the day and closed to provide protection during the night. Following the city's brief annexation into the Earth Empire, the platinum domes were torn down and used by Kuvira's army to build an enormous mecha suit. Buildings range from small edifices to large skyscrapers and a large metal statue of Toph Beifong stands in the middle of the downtown core. At the city's edge is Suyin Beifong's estate, a large metal compound consisting of numerous halls and courtyards to accommodate her large family. Near the estate are several guesthouses for individuals which Suyin chooses to receive."
    },
    {
      "body": "Apart from the platinum panels, Zaofu maintains its security by stationing metalbending guards at every part of the city, especially at nighttime. In addition, Suyin's former assistant, Aiwei, was capable of using ${link_0} to detect whenever an individual lied, effectively ensuring that there were no secrets in the city. As a result, citizens of Zaofu live relatively free of trouble and doubt. In addition, individuals are encouraged to live to their fullest potential in order to achieve success.",
      "links": [
        {
          "body": "seismic sense",
          "key": "${link_0}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        }
      ],
      "text": "Apart from the platinum panels, Zaofu maintains its security by stationing metalbending guards at every part of the city, especially at nighttime. In addition, Suyin's former assistant, Aiwei, was capable of using seismic sense to detect whenever an individual lied, effectively ensuring that there were no secrets in the city. As a result, citizens of Zaofu live relatively free of trouble and doubt. In addition, individuals are encouraged to live to their fullest potential in order to achieve success."
    },
    {
      "body": "The Metal Clan's emblem is a stylized gray octagon with the Earth Kingdom national emblem, a square inscribed within a circle, in the middle. Around the circle are straps which form a cross. The emblem was also the emblem of the Earth Empire.",
      "links": [],
      "text": "The Metal Clan's emblem is a stylized gray octagon with the Earth Kingdom national emblem, a square inscribed within a circle, in the middle. Around the circle are straps which form a cross. The emblem was also the emblem of the Earth Empire."
    },
    {
      "body": "Government system: Autocracy",
      "links": [],
      "text": "Government system: Autocracy"
    },
    {
      "body": "Head of government: Autocrat",
      "links": [],
      "text": "Head of government: Autocrat"
    },
    {
      "body": "Zaofu is an autonomous city state in the Earth Kingdom inhabited by the Metal Clan with Suyin Beifong as its matriarch. The Metal Clan is a multicultural people of Earth Kingdom, ${link_0}, and ${link_1} descent, for whom the loyalty to the clan is far more important than to the Earth Kingdom. In contrast to the reactionary regime in ${link_2}, Suyin's rule is marked by restraint, progress and the validity of the law for every citizen. Because of this, Suyin herself is subject to Zaofu's law, even though she is the matriarch and has full control over the city's political affairs. As result of these ideological differences, Zaofu is effectively independent from the central government, as the city does not obey orders from the capital or enforces laws passed by the monarchy. Zaofu even offered protection to members of ${link_3} when they were deemed enemies of state by the government of Ba Sing Se as well as Varrick, who was wanted in the United Republic.",
      "links": [
        {
          "body": "Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "United Republic",
          "key": "${link_1}",
          "target": {
            "href": "United_Republic_of_Nations",
            "page": "United_Republic_of_Nations"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_2}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_3}",
          "target": {
            "href": "Team_Avatar_(Korra)",
            "page": "Team_Avatar_(Korra)"
          }
        }
      ],
      "text": "Zaofu is an autonomous city state in the Earth Kingdom inhabited by the Metal Clan with Suyin Beifong as its matriarch. The Metal Clan is a multicultural people of Earth Kingdom, Fire Nation, and United Republic descent, for whom the loyalty to the clan is far more important than to the Earth Kingdom. In contrast to the reactionary regime in Ba Sing Se, Suyin's rule is marked by restraint, progress and the validity of the law for every citizen. Because of this, Suyin herself is subject to Zaofu's law, even though she is the matriarch and has full control over the city's political affairs. As result of these ideological differences, Zaofu is effectively independent from the central government, as the city does not obey orders from the capital or enforces laws passed by the monarchy. Zaofu even offered protection to members of Team Avatar when they were deemed enemies of state by the government of Ba Sing Se as well as Varrick, who was wanted in the United Republic."
    },
    {
      "body": "The guards of Zaofu's security team are heavily armored and highly professional ${link_0}.",
      "links": [
        {
          "body": "benders",
          "key": "${link_0}",
          "target": {
            "href": "Bending_arts",
            "page": "Bending_arts"
          }
        }
      ],
      "text": "The guards of Zaofu's security team are heavily armored and highly professional benders."
    },
    {
      "body": "Due to Zaofu's autonomy, the city has its own judicial system that is centered around ${link_0} and the law enforcement of the security team. Truth seers such as Aiwei made it possible for there to be almost no lies in Zaofu. Suspects are generally questioned by a truth seer until they are proven to be lying, whereupon they are arrested. One of the heaviest crimes in the city is to betray the Metal Clan and the matriarch will go through great lengths to see the offender brought to justice.",
      "links": [
        {
          "body": "truth seeing",
          "key": "${link_0}",
          "target": {
            "href": "Seismic_Sense#Lie_detection",
            "page": "Seismic_Sense"
          }
        }
      ],
      "text": "Due to Zaofu's autonomy, the city has its own judicial system that is centered around truth seeing and the law enforcement of the security team. Truth seers such as Aiwei made it possible for there to be almost no lies in Zaofu. Suspects are generally questioned by a truth seer until they are proven to be lying, whereupon they are arrested. One of the heaviest crimes in the city is to betray the Metal Clan and the matriarch will go through great lengths to see the offender brought to justice."
    },
    {
      "body": "Zaofu's security team acts as police as well as first line of defense to the city. The guards are among the best fighters of the Earth Kingdom and can be earthbenders, metalbenders, and ${link_0}, who generally wear metal chest armor with shoulder pads, forearm guards as well as helmets. Metalbending guards also employ metal cables extending through their forearm guards, which can be lengthened or retracted through metalbending.",
      "links": [
        {
          "body": "firebenders",
          "key": "${link_0}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Zaofu's security team acts as police as well as first line of defense to the city. The guards are among the best fighters of the Earth Kingdom and can be earthbenders, metalbenders, and firebenders, who generally wear metal chest armor with shoulder pads, forearm guards as well as helmets. Metalbending guards also employ metal cables extending through their forearm guards, which can be lengthened or retracted through metalbending."
    },
    {
      "body": "In 171 AG, Kuvira convinced a large part of the security force to leave the city in order to restore balance in the rest of the Earth Kingdom, as the guards were tired of being locked away in the metal city as opposed to making a difference in the world.",
      "links": [],
      "text": "In 171 AG, Kuvira convinced a large part of the security force to leave the city in order to restore balance in the rest of the Earth Kingdom, as the guards were tired of being locked away in the metal city as opposed to making a difference in the world."
    },
    {
      "body": "Zaofu is a city that embodies progress, innovation, and advancement in a plethora of fields, from bending to architecture, dance to science, and even combining the features of these to create new fields altogether. Zaofu's society prizes creativity and insight. Given that its creation is owed to Toph Beifong for the discovery and development of metalbending, Toph remains a revered figure and symbol of the city.",
      "links": [],
      "text": "Zaofu is a city that embodies progress, innovation, and advancement in a plethora of fields, from bending to architecture, dance to science, and even combining the features of these to create new fields altogether. Zaofu's society prizes creativity and insight. Given that its creation is owed to Toph Beifong for the discovery and development of metalbending, Toph remains a revered figure and symbol of the city."
    },
    {
      "body": "The colors of the citizens' clothing come in various shades of green and most wear large metal jewelry and plating around their necks and forearms. There is little differentiation between the higher and lower class citizens, as even the city's reigning matriarch wears clothing that bears great resemblance to common citizens. Areas for training, art, and engineering projects are common place, giving way to a multitude of projects, as \"everyone is encouraged to reach his, or her, highest potential.\"",
      "links": [],
      "text": "The colors of the citizens' clothing come in various shades of green and most wear large metal jewelry and plating around their necks and forearms. There is little differentiation between the higher and lower class citizens, as even the city's reigning matriarch wears clothing that bears great resemblance to common citizens. Areas for training, art, and engineering projects are common place, giving way to a multitude of projects, as \"everyone is encouraged to reach his, or her, highest potential.\""
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Zaofu",
    "file": "avatar.wikia.com/wiki/Zaofu.html",
    "page": "Zaofu",
    "title": "Zaofu"
  }
}