{
  "categories": [
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "external": false,
        "href": "/wiki/Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "This page is comprised of ${link_0}'s relationships with other characters in the ${link_1}.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "World of Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Earth",
            "page": "Earth"
          }
        }
      ],
      "section": [
        "Zhao's relationships"
      ],
      "text": "This page is comprised of Zhao's relationships with other characters in the World of Avatar."
    },
    {
      "body": "Intent on capturing the ${link_0}, Zhao requested that ${link_1} ${link_2}, commander of a ${link_3} ${link_4} in the ${link_5}, use the legendary ${link_6} to fulfill this goal. Zhao insisted Shinu was wasting their talents in using them as security guards, but Shinu scoffed that Zhao's hunt for the Avatar was nothing more than a vanity project. However, a message arrived from ${link_7} ${link_8} promoting Zhao to ${link_9}. Zhao, now a higher rank than the colonel, made his request an order. After ${link_10} recaptured the Avatar, Shinu questioned Zhao's judgment in letting both Aang and the Blue Spirit escape.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Colonel",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Colonel",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Shinu",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Shinu",
            "page": "Shinu"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "fortress",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Pohuai_Stronghold",
            "page": "Pohuai_Stronghold"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        },
        {
          "body": "Yuyan Archers",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Yuyan_Archers",
            "page": "Yuyan_Archers"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "admiral",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_10}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "Allies",
        "Colonel Shinu"
      ],
      "text": "Intent on capturing the Avatar, Zhao requested that Colonel Shinu, commander of a Fire Nation fortress in the Earth Kingdom, use the legendary Yuyan Archers to fulfill this goal. Zhao insisted Shinu was wasting their talents in using them as security guards, but Shinu scoffed that Zhao's hunt for the Avatar was nothing more than a vanity project. However, a message arrived from Fire Lord Ozai promoting Zhao to admiral. Zhao, now a higher rank than the colonel, made his request an order. After Zuko recaptured the Avatar, Shinu questioned Zhao's judgment in letting both Aang and the Blue Spirit escape."
    },
    {
      "body": "It seemed that their relationship was more out of loyalty and necessity rather than out of mutual friendship. Oftentimes they seemed at edge with each other about what was best for the Fire Nation.",
      "links": [],
      "section": [
        "Zhao's relationships",
        "Allies",
        "Colonel Shinu"
      ],
      "text": "It seemed that their relationship was more out of loyalty and necessity rather than out of mutual friendship. Oftentimes they seemed at edge with each other about what was best for the Fire Nation."
    },
    {
      "body": "Fire Lord Ozai was very impressed with his actions in the ${link_0}. Zhao was always loyal to the Fire Lord and enforced all his wishes. For his ${link_1} expertise and loyalty to the nation, he was quickly promoted from a ${link_2} to a ${link_3} to ${link_4} and finally ${link_5} personally by the Fire Lord himself. As one of the most powerful men in the Fire Nation, Zhao took it upon himself to capture the Avatar, ${link_6}, and nearly succeeded at least once. Ozai was very impressed with his plan to capture the ${link_7} and eradicate ${link_8}, as he granted the ships necessary for the ${link_9}.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "military",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "lieutenant",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Lieutenant_2",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "captain",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Captain_3",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "commander",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Commander",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "admiral",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Admiral",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Aang",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_7}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "waterbending",
          "key": "${link_8}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "siege",
          "key": "${link_9}",
          "target": {
            "external": false,
            "href": "/wiki/Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "Allies",
        "Fire Lord Ozai"
      ],
      "text": "Fire Lord Ozai was very impressed with his actions in the Hundred Year War. Zhao was always loyal to the Fire Lord and enforced all his wishes. For his military expertise and loyalty to the nation, he was quickly promoted from a lieutenant to a captain to commander and finally admiral personally by the Fire Lord himself. As one of the most powerful men in the Fire Nation, Zhao took it upon himself to capture the Avatar, Aang, and nearly succeeded at least once. Ozai was very impressed with his plan to capture the Northern Water Tribe and eradicate waterbending, as he granted the ships necessary for the siege."
    },
    {
      "body": "Zhao served under Shu as a lieutenant in the Earth Kingdom. Though a brilliant lieutenant at the time, he was very secretive, as he kept the secrets that he stole from the ${link_0} to himself and did not report them to his higher ups. Years later, he used these secrets about the ${link_1} to aid him in the Siege of the North.",
      "links": [
        {
          "body": "Spirit Library",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wan_Shi_Tong%27s_Library",
            "page": "Wan_Shi_Tong%27s_Library"
          }
        },
        {
          "body": "Moon Spirit",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tui",
            "page": "Tui"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "Allies",
        "General Shu"
      ],
      "text": "Zhao served under Shu as a lieutenant in the Earth Kingdom. Though a brilliant lieutenant at the time, he was very secretive, as he kept the secrets that he stole from the Spirit Library to himself and did not report them to his higher ups. Years later, he used these secrets about the Moon Spirit to aid him in the Siege of the North."
    },
    {
      "body": "After Commander Zhao received his promotion to admiral, he took control of the archers and employed them in his hunt for the Avatar. When the archers discovered the Avatar, Aang's extreme agility was matched by their expert aim. Outnumbered and simultaneously trying to collect frozen ${link_0}, Aang could not resist the group and was consequently captured.",
      "links": [
        {
          "body": "wood frogs",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wood_frog",
            "page": "Wood_frog"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "Allies",
        "Yuyan Archers"
      ],
      "text": "After Commander Zhao received his promotion to admiral, he took control of the archers and employed them in his hunt for the Avatar. When the archers discovered the Avatar, Aang's extreme agility was matched by their expert aim. Outnumbered and simultaneously trying to collect frozen wood frogs, Aang could not resist the group and was consequently captured."
    },
    {
      "body": "The archers were also later used to incapacitate the Blue Spirit. Their loyalties changed to Zhao quickly, as he was promoted to admiral.",
      "links": [],
      "section": [
        "Zhao's relationships",
        "Allies",
        "Yuyan Archers"
      ],
      "text": "The archers were also later used to incapacitate the Blue Spirit. Their loyalties changed to Zhao quickly, as he was promoted to admiral."
    },
    {
      "body": "In his youth, Zhao studied under the now-renegade ${link_0} master, ${link_1}, but stayed under his tutelage only as long as necessary to learn destructive maneuvers, rejecting Jeong Jeong's attempts to teach him discipline. This lack of self-control, combined with a fiery temper, resulted in a tendency to make foolish mistakes when provoked.",
      "links": [
        {
          "body": "firebending",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Jeong Jeong",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jeong_Jeong",
            "page": "Jeong_Jeong"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "Former allies",
        "Jeong Jeong"
      ],
      "text": "In his youth, Zhao studied under the now-renegade firebending master, Jeong Jeong, but stayed under his tutelage only as long as necessary to learn destructive maneuvers, rejecting Jeong Jeong's attempts to teach him discipline. This lack of self-control, combined with a fiery temper, resulted in a tendency to make foolish mistakes when provoked."
    },
    {
      "body": "Years later, Zhao confronted his old master. He proclaimed that living in the wild had reduced his old master to a savage. Jeong Jeong retorted, saying that it was Zhao who had embraced savagery, using only the unrestrained destructive side of firebending and ignoring the discipline needed to control it. Jeong Jeong warned Zhao not to confront the Avatar, but Zhao arrogantly ignored these warnings. It was shown that Zhao had not learned from Jeong Jeong's past teachings, and his arrogance and recklessness in his firebending led to his own downfall by destroying his ships.",
      "links": [],
      "section": [
        "Zhao's relationships",
        "Former allies",
        "Jeong Jeong"
      ],
      "text": "Years later, Zhao confronted his old master. He proclaimed that living in the wild had reduced his old master to a savage. Jeong Jeong retorted, saying that it was Zhao who had embraced savagery, using only the unrestrained destructive side of firebending and ignoring the discipline needed to control it. Jeong Jeong warned Zhao not to confront the Avatar, but Zhao arrogantly ignored these warnings. It was shown that Zhao had not learned from Jeong Jeong's past teachings, and his arrogance and recklessness in his firebending led to his own downfall by destroying his ships."
    },
    {
      "body": "After discovering the Avatar's return to the world, Zhao became convinced that capturing Aang would be one of the paths to greatness. As a result, though their encounters were sparse, Zhao became one of Aang's primary enemies until the former's death at the North Pole.",
      "links": [],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Aang"
      ],
      "text": "After discovering the Avatar's return to the world, Zhao became convinced that capturing Aang would be one of the paths to greatness. As a result, though their encounters were sparse, Zhao became one of Aang's primary enemies until the former's death at the North Pole."
    },
    {
      "body": "Zhao participated in a number of notable attempts to capture Aang. When the Avatar sought advice from the spirit of Avatar ${link_0}, ${link_1} Zuko was able to track him to ${link_2}. Zhao attempted to corner and ambush Aang, who was already speaking with Roku, but the firebender's plans were thwarted when Roku himself intervened and caused the volcano beneath the temple to erupt; in the confusion, the team was able to escape. Sometime later, the newly promoted Admiral Zhao employed the skills of a legendary squad of archers to trap Aang, only for the Avatar to escape from imprisonment with help from the Blue Spirit. When Aang was briefly being tutored by renegade firebending master Jeong Jeong, the admiral let a convoy of ships up the river to the hidden deserter's campsite and proceeded to attack both his former teacher and the Avatar. However, from Jeong Jeong, Aang had learned about Zhao's tremendous temper and lack of control, and the peaceful Avatar decided to use his knowledge against his foe by taunting him on until, careless with rage, Zhao's wild firebending destroyed the ships in his convoy. Aang subsequently left the admiral to stew on his defeat, as the monk had effectively defeated Zhao without having thrown a single punch.",
      "links": [
        {
          "body": "Roku",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Prince",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Crescent Island",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Crescent_Island",
            "page": "Crescent_Island"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Aang"
      ],
      "text": "Zhao participated in a number of notable attempts to capture Aang. When the Avatar sought advice from the spirit of Avatar Roku, Prince Zuko was able to track him to Crescent Island. Zhao attempted to corner and ambush Aang, who was already speaking with Roku, but the firebender's plans were thwarted when Roku himself intervened and caused the volcano beneath the temple to erupt; in the confusion, the team was able to escape. Sometime later, the newly promoted Admiral Zhao employed the skills of a legendary squad of archers to trap Aang, only for the Avatar to escape from imprisonment with help from the Blue Spirit. When Aang was briefly being tutored by renegade firebending master Jeong Jeong, the admiral let a convoy of ships up the river to the hidden deserter's campsite and proceeded to attack both his former teacher and the Avatar. However, from Jeong Jeong, Aang had learned about Zhao's tremendous temper and lack of control, and the peaceful Avatar decided to use his knowledge against his foe by taunting him on until, careless with rage, Zhao's wild firebending destroyed the ships in his convoy. Aang subsequently left the admiral to stew on his defeat, as the monk had effectively defeated Zhao without having thrown a single punch."
    },
    {
      "body": "Having finally received permission from the Fire Lord, the admiral led a huge armada to the North Pole in order to destroy the Northern ${link_0}, where Aang was learning waterbending, and slay the Moon Spirit – the source of waterbending itself. Zhao attacked the Northern Water Tribe, and Aang was quick to retaliate, however, there were far too many ${link_1} ships to defeat. Desperate, the Avatar meditated and entered the ${link_2} to seek help.",
      "links": [
        {
          "body": "Water Tribe",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Water_Tribe",
            "page": "Water_Tribe"
          }
        },
        {
          "body": "Fire Navy",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "Spirit World",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_World",
            "page": "Spirit_World"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Aang"
      ],
      "text": "Having finally received permission from the Fire Lord, the admiral led a huge armada to the North Pole in order to destroy the Northern Water Tribe, where Aang was learning waterbending, and slay the Moon Spirit – the source of waterbending itself. Zhao attacked the Northern Water Tribe, and Aang was quick to retaliate, however, there were far too many Fire Navy ships to defeat. Desperate, the Avatar meditated and entered the Spirit World to seek help."
    },
    {
      "body": "Zhao invaded the ${link_0} and bagged the Moon Spirit. Quickly confronted by the team as well as an angered ${link_1}, Zhao slayed the Moon Spirit and fled. Enraged, the ${link_2} and Aang, now in the ${link_3}, combined their powers to form ${link_4} and vanquished the entire Fire Navy fleet. Seeing the return of its ally, ${link_5}, in the Moon Spirit's place, the Ocean Spirit separated from the Avatar and proceeded to drag the admiral down. Zhao, unwilling to accept help from Zuko, was carried underwater and dragged to the Spirit World, a fact of which Aang seemed unaware.",
      "links": [
        {
          "body": "Spirit Oasis",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Ocean Spirit",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/La",
            "page": "La"
          }
        },
        {
          "body": "Avatar State",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar#Avatar_State",
            "page": "Avatar"
          }
        },
        {
          "body": "Koizilla",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/La#Koizilla",
            "page": "La"
          }
        },
        {
          "body": "Yue",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Yue",
            "page": "Yue"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Aang"
      ],
      "text": "Zhao invaded the Spirit Oasis and bagged the Moon Spirit. Quickly confronted by the team as well as an angered Iroh, Zhao slayed the Moon Spirit and fled. Enraged, the Ocean Spirit and Aang, now in the Avatar State, combined their powers to form Koizilla and vanquished the entire Fire Navy fleet. Seeing the return of its ally, Yue, in the Moon Spirit's place, the Ocean Spirit separated from the Avatar and proceeded to drag the admiral down. Zhao, unwilling to accept help from Zuko, was carried underwater and dragged to the Spirit World, a fact of which Aang seemed unaware."
    },
    {
      "body": "La imprisoned Zhao in the ${link_0} for all eternity, where Zhao became trapped in his darkest nightmare, namely his obsession with capturing Aang.",
      "links": [
        {
          "body": "Fog of Lost Souls",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fog_of_Lost_Souls",
            "page": "Fog_of_Lost_Souls"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Aang"
      ],
      "text": "La imprisoned Zhao in the Fog of Lost Souls for all eternity, where Zhao became trapped in his darkest nightmare, namely his obsession with capturing Aang."
    },
    {
      "body": "Though Zhao and Zuko were bitter rivals in their attempts to capture Aang, Iroh maintained a more neutral attitude in regards to their enmity.",
      "links": [],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Iroh"
      ],
      "text": "Though Zhao and Zuko were bitter rivals in their attempts to capture Aang, Iroh maintained a more neutral attitude in regards to their enmity."
    },
    {
      "body": "Zhao showed Iroh much respect by bowing to him and calling him a \"great hero\" of the Fire Nation when Iroh and Zuko visited Zhao's harbor for their ${link_0} to be repaired from damage. There, Iroh was wholeheartedly prepared to join Zhao for a drink when the latter offered him and Zuko, and even urged Zuko to show Zhao his respect by accepting the offer.",
      "links": [
        {
          "body": "ship",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko%27s_ship",
            "page": "Zuko%27s_ship"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Iroh"
      ],
      "text": "Zhao showed Iroh much respect by bowing to him and calling him a \"great hero\" of the Fire Nation when Iroh and Zuko visited Zhao's harbor for their ship to be repaired from damage. There, Iroh was wholeheartedly prepared to join Zhao for a drink when the latter offered him and Zuko, and even urged Zuko to show Zhao his respect by accepting the offer."
    },
    {
      "body": "When Zhao and Zuko were arguing about Zuko's plight from the Fire Nation, Iroh consistently held Zuko back, trying to withhold him from the argument and remaining on neither his nephew nor Zhao's side during the outburst. Zhao subsequently attempted a dishonorable attack after challenging Zuko to an ${link_0} that was blocked by Iroh. Iroh scolded Zhao for the way such a great commander acted disgracefully in defeat and told Zhao that even in exile, Zuko had more honor than Zhao. Before leaving, Iroh at that moment thanked Zhao for the ginseng ${link_1}.",
      "links": [
        {
          "body": "Agni Kai",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Agni_Kai",
            "page": "Agni_Kai"
          }
        },
        {
          "body": "tea",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Tea",
            "page": "Tea"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Iroh"
      ],
      "text": "When Zhao and Zuko were arguing about Zuko's plight from the Fire Nation, Iroh consistently held Zuko back, trying to withhold him from the argument and remaining on neither his nephew nor Zhao's side during the outburst. Zhao subsequently attempted a dishonorable attack after challenging Zuko to an Agni Kai that was blocked by Iroh. Iroh scolded Zhao for the way such a great commander acted disgracefully in defeat and told Zhao that even in exile, Zuko had more honor than Zhao. Before leaving, Iroh at that moment thanked Zhao for the ginseng tea."
    },
    {
      "body": "Zuko entered into Fire Nation waters in pursuit of the Avatar, thus violating the terms of his exile; however, Zhao allowed him to pass. Iroh told Zuko that Zhao wanted to follow Zuko to the prize they were both seeking – the Avatar. Under Zuko's instruction, Iroh defied Zhao by continuing to head northward by means to distract Zhao while Zuko used the smoke of his ship as a cover. Despite this treacherous act, Zhao found no reason to dislike Iroh or consider him an enemy. Upon learning that Zhao was promoted from commander to admiral, Iroh was expressively neutral and replied, \"Good for him.\" When Zhao vowed to attack the Northern Water Tribe, he took Zuko's crew by force to aid him in his assault and unhesitatingly offered Iroh to join them. Zuko ran to attack Zhao, but once again, Iroh withheld him. Iroh did not know at that point the identity of the Blue Spirit and when asked by Zhao, he answered honestly which was that he knew only rumors. Before leaving, Zhao kept his offer for Iroh to join him on his mission.",
      "links": [],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Iroh"
      ],
      "text": "Zuko entered into Fire Nation waters in pursuit of the Avatar, thus violating the terms of his exile; however, Zhao allowed him to pass. Iroh told Zuko that Zhao wanted to follow Zuko to the prize they were both seeking – the Avatar. Under Zuko's instruction, Iroh defied Zhao by continuing to head northward by means to distract Zhao while Zuko used the smoke of his ship as a cover. Despite this treacherous act, Zhao found no reason to dislike Iroh or consider him an enemy. Upon learning that Zhao was promoted from commander to admiral, Iroh was expressively neutral and replied, \"Good for him.\" When Zhao vowed to attack the Northern Water Tribe, he took Zuko's crew by force to aid him in his assault and unhesitatingly offered Iroh to join them. Zuko ran to attack Zhao, but once again, Iroh withheld him. Iroh did not know at that point the identity of the Blue Spirit and when asked by Zhao, he answered honestly which was that he knew only rumors. Before leaving, Zhao kept his offer for Iroh to join him on his mission."
    },
    {
      "body": "Zhao secretly planned to assassinate Zuko in order to capture the Avatar without Zuko's hindrance. To this end, Zhao commissioned pirates who were enemies of Zuko to destroy Zuko's ship. The Prince survived, however, and with his uncle's help, stowed about Zhao's navy by means to secretly reach the North Pole and capture the Avatar. In order to help Zuko disguise himself, Iroh joined Zhao on his mission. Iroh lied to Zhao that Zuko was dead and Zhao lied to Iroh of his devastation. In the light of their siege of the Water Tribe, Iroh toasted the Fire Nation and Zhao toasted victory.",
      "links": [],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Iroh"
      ],
      "text": "Zhao secretly planned to assassinate Zuko in order to capture the Avatar without Zuko's hindrance. To this end, Zhao commissioned pirates who were enemies of Zuko to destroy Zuko's ship. The Prince survived, however, and with his uncle's help, stowed about Zhao's navy by means to secretly reach the North Pole and capture the Avatar. In order to help Zuko disguise himself, Iroh joined Zhao on his mission. Iroh lied to Zhao that Zuko was dead and Zhao lied to Iroh of his devastation. In the light of their siege of the Water Tribe, Iroh toasted the Fire Nation and Zhao toasted victory."
    },
    {
      "body": "As Zhao's naval fleet charged ruthlessly upon the North Pole sea, Zhao told Iroh how their siege would \"be one for the history books\". Iroh warned Zhao to be careful what he wished for and that history was not always kind to its subjects. Zhao assured Iroh that the Siege of the North would be nothing like the ${link_0}. Iroh was a kindhearted man and retired former general, but he merely joined Zhao and tried to be the great warrior he once was, not for the triumph of the Fire Nation but solely for the welfare of his beloved nephew. On the second day of the naval siege against the Water Tribe, Iroh reminded Zhao that if the enemy was not defeated before the full moon rose, defeat would be inevitable. Zhao revealed his plan to kill Tui, the Moon Spirit, so that waterbending would be permanently eliminated. Iroh angrily advised Zhao that the spirits were not to be trifled with. Zhao acknowledged Iroh's fear of the spirits, but that did not stop him from undertaking his monstrous plan to eliminate Tui.",
      "links": [
        {
          "body": "Siege of Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Siege_of_Ba_Sing_Se",
            "page": "Siege_of_Ba_Sing_Se"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Iroh"
      ],
      "text": "As Zhao's naval fleet charged ruthlessly upon the North Pole sea, Zhao told Iroh how their siege would \"be one for the history books\". Iroh warned Zhao to be careful what he wished for and that history was not always kind to its subjects. Zhao assured Iroh that the Siege of the North would be nothing like the Siege of Ba Sing Se. Iroh was a kindhearted man and retired former general, but he merely joined Zhao and tried to be the great warrior he once was, not for the triumph of the Fire Nation but solely for the welfare of his beloved nephew. On the second day of the naval siege against the Water Tribe, Iroh reminded Zhao that if the enemy was not defeated before the full moon rose, defeat would be inevitable. Zhao revealed his plan to kill Tui, the Moon Spirit, so that waterbending would be permanently eliminated. Iroh angrily advised Zhao that the spirits were not to be trifled with. Zhao acknowledged Iroh's fear of the spirits, but that did not stop him from undertaking his monstrous plan to eliminate Tui."
    },
    {
      "body": "After Aang told the admiral that destroying the Moon would hurt everyone, Iroh arrived, supporting Aang's statement. After a time of neutrality in his rivalry against Zuko, Zhao calmly and casually declared Iroh a traitor to the Fire Nation and admitted himself unsurprised at Iroh's treachery. Now Zhao's enemy because of the former's plot to kill Tui, Iroh angrily warned Zhao that he would inflict on Zhao whatever fate Zhao subjected Tui to and demanded Tui to be released back into the oasis pond. Zhao agreed at first, but driven by his violent anger, relentlessly killed Tui and destroyed the Moon, to Iroh's shock. Immediately, Iroh attacked Zhao, incapacitating the latter's guards. Zhao was terrified by Iroh's demonstration of firebending, his ambition evolving into cowardice. Fearing the old man, Zhao scarpered for his life.",
      "links": [],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Iroh"
      ],
      "text": "After Aang told the admiral that destroying the Moon would hurt everyone, Iroh arrived, supporting Aang's statement. After a time of neutrality in his rivalry against Zuko, Zhao calmly and casually declared Iroh a traitor to the Fire Nation and admitted himself unsurprised at Iroh's treachery. Now Zhao's enemy because of the former's plot to kill Tui, Iroh angrily warned Zhao that he would inflict on Zhao whatever fate Zhao subjected Tui to and demanded Tui to be released back into the oasis pond. Zhao agreed at first, but driven by his violent anger, relentlessly killed Tui and destroyed the Moon, to Iroh's shock. Immediately, Iroh attacked Zhao, incapacitating the latter's guards. Zhao was terrified by Iroh's demonstration of firebending, his ambition evolving into cowardice. Fearing the old man, Zhao scarpered for his life."
    },
    {
      "body": "Long before the Hundred Year War, ${link_0} brought his library from the Spirit World to the physical world. Together with his band of ${link_1}, he collected knowledge from all over the world. He put it all on display in his library for humanity to read and hopefully better itself. However, he was angered when Zhao used his library for war and destruction. Interested to learn the information it held, Zhao searched through scroll after scroll for knowledge that might aid him in his efforts against the Avatar and Water Tribes until he came across a detailed illustration with the words \"moon\" and \"ocean\". It was there that he learned about the Moon and Ocean Spirits of the Water Tribe and where their mortal incarnations could be found. After this incident, he became obsessed with his supposed destiny: to destroy the Ocean and Moon Spirits and end waterbending. Later, Wan Shi Tong banned all humans from his library because of these violent intentions.",
      "links": [
        {
          "body": "Wan Shi Tong",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Wan_Shi_Tong",
            "page": "Wan_Shi_Tong"
          }
        },
        {
          "body": "knowledge-seeking foxes",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Knowledge_Seekers",
            "page": "Knowledge_Seekers"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Wan Shi Tong"
      ],
      "text": "Long before the Hundred Year War, Wan Shi Tong brought his library from the Spirit World to the physical world. Together with his band of knowledge-seeking foxes, he collected knowledge from all over the world. He put it all on display in his library for humanity to read and hopefully better itself. However, he was angered when Zhao used his library for war and destruction. Interested to learn the information it held, Zhao searched through scroll after scroll for knowledge that might aid him in his efforts against the Avatar and Water Tribes until he came across a detailed illustration with the words \"moon\" and \"ocean\". It was there that he learned about the Moon and Ocean Spirits of the Water Tribe and where their mortal incarnations could be found. After this incident, he became obsessed with his supposed destiny: to destroy the Ocean and Moon Spirits and end waterbending. Later, Wan Shi Tong banned all humans from his library because of these violent intentions."
    },
    {
      "body": "Zhao always showed an antipathy toward Zuko. Zhao was one of the witnesses to the Agni Kai between Zuko and his father, Fire Lord Ozai, during which Ozai burned Zuko's face and banished him from the Fire Nation. His relish in seeing Zuko suffer showed the extent of his cruelty. When they met again after his banishment, Zhao was commanding a Fire Nation naval base when Zuko docked his ship and asked for repairs. Zuko initially told Zhao that the damage was caused by crashing into an Earth Kingdom ship, but Zhao sensed that he was hiding something. He secretly had the banished prince's crew interrogated and had Zuko and Iroh confined in his office. He revealed he wanted to capture the Avatar himself which lead to a bitter rivalry between the two and ended in Zuko challenging Zhao to an Agni Kai. During the duel, Zuko struggled for a moment with the idea of killing him. Zhao urged him to attack, but ultimately Zuko spared him and fired a small fire blast at the ground beside his head as a warning. As Zuko was walking away from the battle, an enraged Zhao attempted to attack with Zuko's back turned, but was stopped by Iroh. This event sparked a bitter rivalry between Zuko and Zhao.",
      "links": [],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Zuko"
      ],
      "text": "Zhao always showed an antipathy toward Zuko. Zhao was one of the witnesses to the Agni Kai between Zuko and his father, Fire Lord Ozai, during which Ozai burned Zuko's face and banished him from the Fire Nation. His relish in seeing Zuko suffer showed the extent of his cruelty. When they met again after his banishment, Zhao was commanding a Fire Nation naval base when Zuko docked his ship and asked for repairs. Zuko initially told Zhao that the damage was caused by crashing into an Earth Kingdom ship, but Zhao sensed that he was hiding something. He secretly had the banished prince's crew interrogated and had Zuko and Iroh confined in his office. He revealed he wanted to capture the Avatar himself which lead to a bitter rivalry between the two and ended in Zuko challenging Zhao to an Agni Kai. During the duel, Zuko struggled for a moment with the idea of killing him. Zhao urged him to attack, but ultimately Zuko spared him and fired a small fire blast at the ground beside his head as a warning. As Zuko was walking away from the battle, an enraged Zhao attempted to attack with Zuko's back turned, but was stopped by Iroh. This event sparked a bitter rivalry between Zuko and Zhao."
    },
    {
      "body": "They later met at Avatar Roku's island, where he used Zuko's intelligence to try and capture the Avatar as well as the Crown Prince himself. However, he was unsuccessful, as the tower was destroyed by Avatar Roku.",
      "links": [],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Zuko"
      ],
      "text": "They later met at Avatar Roku's island, where he used Zuko's intelligence to try and capture the Avatar as well as the Crown Prince himself. However, he was unsuccessful, as the tower was destroyed by Avatar Roku."
    },
    {
      "body": "When he finally captured the Avatar, Zuko, disguised as a blue-masked warrior, infiltrated the fortress and freed the Avatar. When Zuko held him at sword point, Zhao was forced to let them go. Later, Zhao discovered that Zuko was the vigilante thief. Determined to eliminate further interference, he ordered a group of pirates to engineer an assassination attempt on Prince Zuko, which successfully destroyed his ship but, unbeknownst to Zhao, failed to actually kill the prince.",
      "links": [],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Zuko"
      ],
      "text": "When he finally captured the Avatar, Zuko, disguised as a blue-masked warrior, infiltrated the fortress and freed the Avatar. When Zuko held him at sword point, Zhao was forced to let them go. Later, Zhao discovered that Zuko was the vigilante thief. Determined to eliminate further interference, he ordered a group of pirates to engineer an assassination attempt on Prince Zuko, which successfully destroyed his ship but, unbeknownst to Zhao, failed to actually kill the prince."
    },
    {
      "body": "During the Siege of the North, Zhao was confronted by Zuko, who sought revenge for Zhao's attempt to murder him. As he was defeated by Zuko, Zhao stared in disbelief at the restored moon. At that moment, La, who had not yet reached the Oasis, emerged from one of the canals, grabbed Zhao from the surface, and began to pull him into the water. When Zuko saw this, he offered help by reaching out to him and telling him to take his hand. While Zhao at first made an attempt to reach, he decided he would rather die than accept help from Zuko.",
      "links": [],
      "section": [
        "Zhao's relationships",
        "Enemies",
        "Zuko"
      ],
      "text": "During the Siege of the North, Zhao was confronted by Zuko, who sought revenge for Zhao's attempt to murder him. As he was defeated by Zuko, Zhao stared in disbelief at the restored moon. At that moment, La, who had not yet reached the Oasis, emerged from one of the canals, grabbed Zhao from the surface, and began to pull him into the water. When Zuko saw this, he offered help by reaching out to him and telling him to take his hand. While Zhao at first made an attempt to reach, he decided he would rather die than accept help from Zuko."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zhao",
            "page": "Zhao"
          }
        }
      ],
      "section": [
        "Zhao's relationships",
        "See also"
      ],
      "text": "Zhao"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Zhao%27s_relationships",
    "file": "avatar.wikia.com/wiki/Zhao's_relationships.html",
    "page": "Zhao's_relationships",
    "title": "Zhao's relationships"
  }
}