{
  "categories": [
    {
      "body": "Protected",
      "target": {
        "href": "Category_Protected",
        "page": "Category_Protected"
      }
    },
    {
      "body": "Needs help",
      "target": {
        "href": "Category_Needs_help",
        "page": "Category_Needs_help"
      }
    },
    {
      "body": "Articles to be expanded",
      "target": {
        "href": "Category_Articles_to_be_expanded",
        "page": "Category_Articles_to_be_expanded"
      }
    },
    {
      "body": "Zuko",
      "target": {
        "href": "Category_Zuko",
        "page": "Category_Zuko"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "href": "Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Character relationships",
      "target": {
        "href": "Category_Character_relationships",
        "page": "Category_Character_relationships"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "",
      "links": [],
      "text": ""
    },
    {
      "body": "This page requires editing to meet Avatar Wiki's quality standards.",
      "links": [],
      "text": "This page requires editing to meet Avatar Wiki's quality standards."
    },
    {
      "body": "This page needs to be expanded in order to include more relevant information.",
      "links": [],
      "text": "This page needs to be expanded in order to include more relevant information."
    },
    {
      "body": "This page is comprised of Zuko's relationships with other characters in the ${link_0}. A frequently troubled young man, ${link_1} acquired both friends and foes throughout his journeys.",
      "links": [
        {
          "body": "World of Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Earth",
            "page": "Earth"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "This page is comprised of Zuko's relationships with other characters in the World of Avatar. A frequently troubled young man, Zuko acquired both friends and foes throughout his journeys."
    },
    {
      "body": "${link_0} and ${link_1} often wore royal ${link_2} while in the ${link_3}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Azula",
          "key": "${link_1}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "robes",
          "key": "${link_2}",
          "target": {
            "href": "Fashion_in_the_World_of_Avatar#Prince_and_Princess",
            "page": "Fashion_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Fire Nation Royal Palace",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation_Royal_Palace",
            "page": "Fire_Nation_Royal_Palace"
          }
        }
      ],
      "text": "Zuko and Azula often wore royal robes while in the Fire Nation Royal Palace."
    },
    {
      "body": "${link_0} is Zuko's younger sister by two years. While siblings, she seemed to take great pleasure in the punishment inflicted on her brother. Zuko expressed resentment toward her, as she was a ${link_1} prodigy and the favored sibling. Following the failed ${link_2}, ${link_3} ${link_4} tasked Azula with capturing ${link_5} and Zuko, now considered traitors to the ${link_6}. Azula attempted to capture them, luring Zuko with the lie that Fire Lord Ozai wanted him back home. He discovered this lie however, and angrily attacked her, although he could not match her firebending abilities and skills in hand-to-hand combat. She also enjoyed tormenting her brother, calling him by disliked nicknames, including \"Zuzu\" and \"Dum-Dum\", and mentioning his inferiority in their father's eyes.",
      "links": [
        {
          "body": "Azula",
          "key": "${link_0}",
          "target": {
            "href": "Azula",
            "page": "Azula"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        },
        {
          "body": "Siege of the North",
          "key": "${link_2}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        },
        {
          "body": "Fire Lord",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_4}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_5}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_6}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "Azula is Zuko's younger sister by two years. While siblings, she seemed to take great pleasure in the punishment inflicted on her brother. Zuko expressed resentment toward her, as she was a firebending prodigy and the favored sibling. Following the failed Siege of the North, Fire Lord Ozai tasked Azula with capturing Iroh and Zuko, now considered traitors to the Fire Nation. Azula attempted to capture them, luring Zuko with the lie that Fire Lord Ozai wanted him back home. He discovered this lie however, and angrily attacked her, although he could not match her firebending abilities and skills in hand-to-hand combat. She also enjoyed tormenting her brother, calling him by disliked nicknames, including \"Zuzu\" and \"Dum-Dum\", and mentioning his inferiority in their father's eyes."
    },
    {
      "body": "It was revealed in one of Zuko's dreams that Azula had a great deal of influence over him, arguably rivaling his uncle's influence. This was only bolstered when Azula successfully convinced Zuko to betray their uncle, aid her against ${link_0} and ${link_1}, and finally ${link_2} ${link_3}. Azula later lied to her father and credited Zuko with Aang's supposed death, allegedly doing so out of sisterly love since he had been worried about their father's reaction to his return. Upon their return home, Azula seemed to gradually open up to Zuko, once warning him of the dangers of visiting their uncle and both sharing a nostalgic and depressing feeling after visiting their old beach home on ${link_4}. She also helped him sort through his anger and conflicted feelings of betraying Iroh, although she called him pathetic for letting these feelings get to him.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_1}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "conquer",
          "key": "${link_2}",
          "target": {
            "href": "Coup_of_Ba_Sing_Se",
            "page": "Coup_of_Ba_Sing_Se"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        },
        {
          "body": "Ember Island",
          "key": "${link_4}",
          "target": {
            "href": "Ember_Island",
            "page": "Ember_Island"
          }
        }
      ],
      "text": "It was revealed in one of Zuko's dreams that Azula had a great deal of influence over him, arguably rivaling his uncle's influence. This was only bolstered when Azula successfully convinced Zuko to betray their uncle, aid her against Aang and Katara, and finally conquer Ba Sing Se. Azula later lied to her father and credited Zuko with Aang's supposed death, allegedly doing so out of sisterly love since he had been worried about their father's reaction to his return. Upon their return home, Azula seemed to gradually open up to Zuko, once warning him of the dangers of visiting their uncle and both sharing a nostalgic and depressing feeling after visiting their old beach home on Ember Island. She also helped him sort through his anger and conflicted feelings of betraying Iroh, although she called him pathetic for letting these feelings get to him."
    },
    {
      "body": "This tentative sibling relationship did not withstand Zuko's decision to join ${link_0} to stop their father winning the Hundred Year War, as Azula showed no mercy for her brother during their next encounters. While his sister had no problem trying to kill him, Zuko did not share that sentiment, as he showed regret that his sister was seemingly going to fall to her death after being thrown off an airship by him.",
      "links": [
        {
          "body": "Team Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "This tentative sibling relationship did not withstand Zuko's decision to join Team Avatar to stop their father winning the Hundred Year War, as Azula showed no mercy for her brother during their next encounters. While his sister had no problem trying to kill him, Zuko did not share that sentiment, as he showed regret that his sister was seemingly going to fall to her death after being thrown off an airship by him."
    },
    {
      "body": "That incident and Azula's affection for Zuko during their time together does display that, at their best, the two do care about one another; however, due to their upbringing, Azula through Ozai and Zuko through ${link_0} and later Iroh, and contrasting views on life, there was seemingly irreconcilable bitterness, anger, and jealousy on both sides from the favoritism their parents showed.",
      "links": [
        {
          "body": "Ursa",
          "key": "${link_0}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        }
      ],
      "text": "That incident and Azula's affection for Zuko during their time together does display that, at their best, the two do care about one another; however, due to their upbringing, Azula through Ozai and Zuko through Ursa and later Iroh, and contrasting views on life, there was seemingly irreconcilable bitterness, anger, and jealousy on both sides from the favoritism their parents showed."
    },
    {
      "body": "After Azula mental breakdown during the passing of ${link_0} and their ${link_1}, Zuko ordered Azula to be institutionalized in a mental health facility. He did not entirely gave up on his sister though, as he was willing, albeit reluctantly, to ask her for help in persuading Ozai to reveal Ursa's location and, once they had it, allow her to accompany him, unbound, on a quest to track Ursa down. However, he remained focused and alert to her every move, even inviting Team Avatar to help keep an eye on her during their trip. After hearing a lecture about family and seeing Sokka's interaction with Katara, Zuko decided to move toward better treatment of his sister.",
      "links": [
        {
          "body": "Sozin's Comet",
          "key": "${link_0}",
          "target": {
            "href": "Sozin%27s_Comet",
            "page": "Sozin%27s_Comet"
          }
        },
        {
          "body": "Comet-Enhanced Agni Kai",
          "key": "${link_1}",
          "target": {
            "href": "Comet-Enhanced_Agni_Kai",
            "page": "Comet-Enhanced_Agni_Kai"
          }
        }
      ],
      "text": "After Azula mental breakdown during the passing of Sozin's Comet and their Comet-Enhanced Agni Kai, Zuko ordered Azula to be institutionalized in a mental health facility. He did not entirely gave up on his sister though, as he was willing, albeit reluctantly, to ask her for help in persuading Ozai to reveal Ursa's location and, once they had it, allow her to accompany him, unbound, on a quest to track Ursa down. However, he remained focused and alert to her every move, even inviting Team Avatar to help keep an eye on her during their trip. After hearing a lecture about family and seeing Sokka's interaction with Katara, Zuko decided to move toward better treatment of his sister."
    },
    {
      "body": "Zuko and Azula's relationship finally reached a defining point when he fought her to prevent her from killing their mother. When she asked him why he had not killed her when he had the chance, he replied that no matter how badly messed up their relationship was and might always be, she would never stop being his sister, someone whom he cared about. Azula subsequently ran away from her brother, ignoring his pleas for her to come back so that he could help her.",
      "links": [],
      "text": "Zuko and Azula's relationship finally reached a defining point when he fought her to prevent her from killing their mother. When she asked him why he had not killed her when he had the chance, he replied that no matter how badly messed up their relationship was and might always be, she would never stop being his sister, someone whom he cared about. Azula subsequently ran away from her brother, ignoring his pleas for her to come back so that he could help her."
    },
    {
      "body": "Little is known about Zuko's relationship with his paternal grandfather, ${link_0}. Zuko once tried to impress Azulon with a performance of firebending in order to get in his father's good graces. Azulon was displeased with Zuko's failure, angrily asking Ozai why he was wasting his time. Azulon seemed to care little, if at all, about his grandson, seeing that he ordered Ozai to kill Zuko after Ozai proposed stripping Iroh of his birthright to the throne, simply to teach Ozai a lesson.",
      "links": [
        {
          "body": "Azulon",
          "key": "${link_0}",
          "target": {
            "href": "Azulon",
            "page": "Azulon"
          }
        }
      ],
      "text": "Little is known about Zuko's relationship with his paternal grandfather, Azulon. Zuko once tried to impress Azulon with a performance of firebending in order to get in his father's good graces. Azulon was displeased with Zuko's failure, angrily asking Ozai why he was wasting his time. Azulon seemed to care little, if at all, about his grandson, seeing that he ordered Ozai to kill Zuko after Ozai proposed stripping Iroh of his birthright to the throne, simply to teach Ozai a lesson."
    },
    {
      "body": "Noren, previously named Ikem, was Zuko's step-father through his marriage to Zuko's mother, Ursa. Through means of an old letter addressed to Ikem from his mother, Zuko believed for some time that he was not Ozai's son but Ikem's. This short-lived belief shook Zuko enough that he even contemplated abdicating the throne. Zuko was amicable toward his step-father due to his intense loyalty to Ursa and Kiyi, his half-sister through Ursa and Noren. Noren felt enough familial loyalty and respect to Zuko to allow him and his friends to dine with his family, and to apologize to Zuko as Fire Lord for not telling him the truth from the beginning. The two built a solid relationship, though it was not particularly affectionate.",
      "links": [],
      "text": "Noren, previously named Ikem, was Zuko's step-father through his marriage to Zuko's mother, Ursa. Through means of an old letter addressed to Ikem from his mother, Zuko believed for some time that he was not Ozai's son but Ikem's. This short-lived belief shook Zuko enough that he even contemplated abdicating the throne. Zuko was amicable toward his step-father due to his intense loyalty to Ursa and Kiyi, his half-sister through Ursa and Noren. Noren felt enough familial loyalty and respect to Zuko to allow him and his friends to dine with his family, and to apologize to Zuko as Fire Lord for not telling him the truth from the beginning. The two built a solid relationship, though it was not particularly affectionate."
    },
    {
      "body": "${link_0} consistently urged ${link_1} to do what was right.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Iroh consistently urged Zuko to do what was right."
    },
    {
      "body": "Iroh was Zuko's uncle, mentor, ${link_0}, caretaker, and father figure. The tolerant and even-keeled foil to Zuko's impulsiveness, Iroh tempered Zuko's anger with practical advice and a wry sense of humor. Though Iroh was a hard instructor, his merciless drilling in firebending basics served to improve Zuko's skill. Iroh was sympathetic toward Zuko, having likewise fallen from grace due to an infamous military failure in his days as a Fire Nation ${link_1}, and pleaded that he not be so relentless in his search for the ${link_2}. Although he often teased Zuko, who impatiently balked at his advice, they cared deeply about each other. He even thought of Zuko as his surrogate child, his own son having died, and worried over him accordingly. Iroh constantly guided Zuko and tried to help him make good choices. In turn, Zuko was deeply thankful for his uncle and was greatly touched when Iroh indirectly praised him. When Zuko was once confronted with the choice of tracking the Avatar or saving a kidnapped Iroh, he chose the latter. Both depended on each other in exile. Iroh was considered a traitor by the Fire Lord, blamed for the failure of the Siege of the ${link_3} after he attacked Admiral ${link_4} for killing the mortal form of the ${link_5}.",
      "links": [
        {
          "body": "firebending teacher",
          "key": "${link_0}",
          "target": {
            "href": "Firebending_training",
            "page": "Firebending_training"
          }
        },
        {
          "body": "General",
          "key": "${link_1}",
          "target": {
            "href": "Military_ranks_in_the_World_of_Avatar#General_2",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_3}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_4}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Moon Spirit",
          "key": "${link_5}",
          "target": {
            "href": "Tui",
            "page": "Tui"
          }
        }
      ],
      "text": "Iroh was Zuko's uncle, mentor, firebending teacher, caretaker, and father figure. The tolerant and even-keeled foil to Zuko's impulsiveness, Iroh tempered Zuko's anger with practical advice and a wry sense of humor. Though Iroh was a hard instructor, his merciless drilling in firebending basics served to improve Zuko's skill. Iroh was sympathetic toward Zuko, having likewise fallen from grace due to an infamous military failure in his days as a Fire Nation General, and pleaded that he not be so relentless in his search for the Avatar. Although he often teased Zuko, who impatiently balked at his advice, they cared deeply about each other. He even thought of Zuko as his surrogate child, his own son having died, and worried over him accordingly. Iroh constantly guided Zuko and tried to help him make good choices. In turn, Zuko was deeply thankful for his uncle and was greatly touched when Iroh indirectly praised him. When Zuko was once confronted with the choice of tracking the Avatar or saving a kidnapped Iroh, he chose the latter. Both depended on each other in exile. Iroh was considered a traitor by the Fire Lord, blamed for the failure of the Siege of the Northern Water Tribe after he attacked Admiral Zhao for killing the mortal form of the Moon Spirit."
    },
    {
      "body": "Zuko separated from his uncle and they both began traveling alone after Iroh explained to Zuko that capturing the Avatar at this point would probably not immediately grant him his honor and throne. Zuko left, believing that they no longer had anything to gain from traveling together, stating that he needed to find his own way. Iroh discreetly continued to follow his nephew's trail, ensuring that if Zuko ever needed him, he would be there.",
      "links": [],
      "text": "Zuko separated from his uncle and they both began traveling alone after Iroh explained to Zuko that capturing the Avatar at this point would probably not immediately grant him his honor and throne. Zuko left, believing that they no longer had anything to gain from traveling together, stating that he needed to find his own way. Iroh discreetly continued to follow his nephew's trail, ensuring that if Zuko ever needed him, he would be there."
    },
    {
      "body": "Zuko and Iroh rejoined during a ${link_0} with Azula and Team Avatar. Their reunion was cut short, however, when Iroh was severely injured by Azula, over which Zuko grew visibly distraught. Zuko transported Iroh to safety and helped him to recover, even going so far as making tea for him. Once Iroh had healed significantly, he began to teach Zuko how to ${link_1} through his body; however, he refused to actually execute the technique for practice due to the risks involved.",
      "links": [
        {
          "body": "battle",
          "key": "${link_0}",
          "target": {
            "href": "Confrontation_at_Tu_Zin",
            "page": "Confrontation_at_Tu_Zin"
          }
        },
        {
          "body": "channel lightning",
          "key": "${link_1}",
          "target": {
            "href": "Lightning_redirection",
            "page": "Lightning_redirection"
          }
        }
      ],
      "text": "Zuko and Iroh rejoined during a battle with Azula and Team Avatar. Their reunion was cut short, however, when Iroh was severely injured by Azula, over which Zuko grew visibly distraught. Zuko transported Iroh to safety and helped him to recover, even going so far as making tea for him. Once Iroh had healed significantly, he began to teach Zuko how to channel lightning through his body; however, he refused to actually execute the technique for practice due to the risks involved."
    },
    {
      "body": "Iroh finally lost his temper and berated Zuko for his lack of forethought in his plans—in the most recent case, discovering ${link_0} before the rest of Team Avatar. While Iroh's words were harsh, Zuko ultimately seemed to respect the sentiments behind them, opting to release Appa, knowing the ${link_1} would return to Aang. After leaving the underground base, at his uncle's suggestion, he dropped his Blue Spirit mask into the lake and watched it sink from view. The two arrived back at their ${link_2} where Iroh once again congratulated him for letting Appa go; Zuko, however, merely said that he \"didn't feel right\" before passing out on the floor, greatly worrying Iroh. During Zuko's illness, Iroh gladly took care of his nephew. When he had been restored to full health, Zuko appeared uncharacteristically optimistic and expressed profound care and tenderness toward his uncle. This behavior, however, was short-lived when, following a confrontation in the ${link_3}, Zuko sided with Azula and betrayed Iroh. Iroh turned his head away in disappointment, signifying that he was ashamed of the choices that his nephew had made.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "bison",
          "key": "${link_1}",
          "target": {
            "href": "Flying_bison",
            "page": "Flying_bison"
          }
        },
        {
          "body": "apartment",
          "key": "${link_2}",
          "target": {
            "href": "Iroh_and_Zuko%27s_apartment",
            "page": "Iroh_and_Zuko%27s_apartment"
          }
        },
        {
          "body": "Crystal Catacombs",
          "key": "${link_3}",
          "target": {
            "href": "Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        }
      ],
      "text": "Iroh finally lost his temper and berated Zuko for his lack of forethought in his plans—in the most recent case, discovering Appa before the rest of Team Avatar. While Iroh's words were harsh, Zuko ultimately seemed to respect the sentiments behind them, opting to release Appa, knowing the bison would return to Aang. After leaving the underground base, at his uncle's suggestion, he dropped his Blue Spirit mask into the lake and watched it sink from view. The two arrived back at their apartment where Iroh once again congratulated him for letting Appa go; Zuko, however, merely said that he \"didn't feel right\" before passing out on the floor, greatly worrying Iroh. During Zuko's illness, Iroh gladly took care of his nephew. When he had been restored to full health, Zuko appeared uncharacteristically optimistic and expressed profound care and tenderness toward his uncle. This behavior, however, was short-lived when, following a confrontation in the Crystal Catacombs, Zuko sided with Azula and betrayed Iroh. Iroh turned his head away in disappointment, signifying that he was ashamed of the choices that his nephew had made."
    },
    {
      "body": "Once Iroh was taken back to the Fire Nation as a prisoner, he refused to talk to Zuko, despite his frequent visits and his apparent confusion. Iroh eventually broke his silence when he told Zuko that Avatar ${link_0} was his maternal great-grandfather, and that he might be able to redeem their family by helping to restore balance in the world. Signifying that although his nephew had betrayed him, he still had faith in Zuko, Iroh gave Zuko a ${link_1} which ${link_2} once gave to Roku: a royal artifact to only be worn by the crown ${link_3} of the Fire Nation.",
      "links": [
        {
          "body": "Roku",
          "key": "${link_0}",
          "target": {
            "href": "Roku",
            "page": "Roku"
          }
        },
        {
          "body": "crown",
          "key": "${link_1}",
          "target": {
            "href": "Crown_Prince_headpiece",
            "page": "Crown_Prince_headpiece"
          }
        },
        {
          "body": "Sozin",
          "key": "${link_2}",
          "target": {
            "href": "Sozin",
            "page": "Sozin"
          }
        },
        {
          "body": "prince",
          "key": "${link_3}",
          "target": {
            "href": "Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        }
      ],
      "text": "Once Iroh was taken back to the Fire Nation as a prisoner, he refused to talk to Zuko, despite his frequent visits and his apparent confusion. Iroh eventually broke his silence when he told Zuko that Avatar Roku was his maternal great-grandfather, and that he might be able to redeem their family by helping to restore balance in the world. Signifying that although his nephew had betrayed him, he still had faith in Zuko, Iroh gave Zuko a crown which Sozin once gave to Roku: a royal artifact to only be worn by the crown prince of the Fire Nation."
    },
    {
      "body": "During the events of the ${link_0}, Zuko chose to join the Avatar and decided to break Iroh out of prison. He would ask for his uncle's forgiveness for his previous betrayal at Ba Sing Se. However, Iroh escaped from prison himself long before Zuko arrived and Zuko was forced to leave without him.",
      "links": [
        {
          "body": "Day of Black Sun",
          "key": "${link_0}",
          "target": {
            "href": "Day_of_Black_Sun",
            "page": "Day_of_Black_Sun"
          }
        }
      ],
      "text": "During the events of the Day of Black Sun, Zuko chose to join the Avatar and decided to break Iroh out of prison. He would ask for his uncle's forgiveness for his previous betrayal at Ba Sing Se. However, Iroh escaped from prison himself long before Zuko arrived and Zuko was forced to leave without him."
    },
    {
      "body": "Zuko said often that Iroh was more of a father to him. He also attempted to tell his new found friends Iroh's favorite tea joke but was unsuccessful when he only remembered the punch line. He told an Iroh-like proverb to ${link_0}, that apparently made \"no sense at all\". When debating over how he could convince Team Avatar that he was on their side, Zuko wondered what Iroh would do and proceeded to do a fairly accurate impersonation of Iroh involving looking within himself to save himself, but exasperatedly remarked that even when he was talking for his uncle, he still couldn't understand him.",
      "links": [
        {
          "body": "Sokka",
          "key": "${link_0}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        }
      ],
      "text": "Zuko said often that Iroh was more of a father to him. He also attempted to tell his new found friends Iroh's favorite tea joke but was unsuccessful when he only remembered the punch line. He told an Iroh-like proverb to Sokka, that apparently made \"no sense at all\". When debating over how he could convince Team Avatar that he was on their side, Zuko wondered what Iroh would do and proceeded to do a fairly accurate impersonation of Iroh involving looking within himself to save himself, but exasperatedly remarked that even when he was talking for his uncle, he still couldn't understand him."
    },
    {
      "body": "${link_0} and ${link_1} reunited in the ${link_2} for the first time since Zuko learned of his ancestry.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "White Lotus camp",
          "key": "${link_2}",
          "target": {
            "href": "White_Lotus_camp",
            "page": "White_Lotus_camp"
          }
        }
      ],
      "text": "Zuko and Iroh reunited in the White Lotus camp for the first time since Zuko learned of his ancestry."
    },
    {
      "body": "Zuko expressed his guilt over betraying his uncle on several occasions after joining Team Avatar. Prior to the arrival of Sozin's Comet, Zuko learned that Iroh was the new leader of the ${link_0} and that his uncle intended on liberating Ba Sing Se. Zuko reunited with his uncle before the final battle and sobbed as he begged for his uncle's forgiveness. Iroh embraced his nephew in an emotional hug, stating that he was never angry with Zuko, just sad that he had lost his way and was now happy that Zuko found his way to him. He was proud to find that Zuko has finally found peace with himself and his destiny and the two finally made up.",
      "links": [
        {
          "body": "Order of the White Lotus",
          "key": "${link_0}",
          "target": {
            "href": "Order_of_the_White_Lotus",
            "page": "Order_of_the_White_Lotus"
          }
        }
      ],
      "text": "Zuko expressed his guilt over betraying his uncle on several occasions after joining Team Avatar. Prior to the arrival of Sozin's Comet, Zuko learned that Iroh was the new leader of the Order of the White Lotus and that his uncle intended on liberating Ba Sing Se. Zuko reunited with his uncle before the final battle and sobbed as he begged for his uncle's forgiveness. Iroh embraced his nephew in an emotional hug, stating that he was never angry with Zuko, just sad that he had lost his way and was now happy that Zuko found his way to him. He was proud to find that Zuko has finally found peace with himself and his destiny and the two finally made up."
    },
    {
      "body": "Before departing to fight Azula, Zuko asked Iroh if he would accept his rightful place as Fire Lord. Iroh refused, as Zuko was the far more suitable heir: an idealist with a pure heart. Zuko was unsure due to his history of misdeeds, but Iroh assured him that since Zuko had learned from his mistakes, he would know how to rule as a man of peace and love. Zuko was emboldened by his uncle's wise words and asked Katara to join him in the facing of his sister.",
      "links": [],
      "text": "Before departing to fight Azula, Zuko asked Iroh if he would accept his rightful place as Fire Lord. Iroh refused, as Zuko was the far more suitable heir: an idealist with a pure heart. Zuko was unsure due to his history of misdeeds, but Iroh assured him that since Zuko had learned from his mistakes, he would know how to rule as a man of peace and love. Zuko was emboldened by his uncle's wise words and asked Katara to join him in the facing of his sister."
    },
    {
      "body": "When the ${link_0} ended and Zuko became Fire Lord, he celebrated the victory with his uncle at the ${link_1}, their tea shop in Ba Sing Se, which had been reopened. Zuko even helped Iroh serve tea to their friends, just like old times.",
      "links": [
        {
          "body": "Hundred Year War",
          "key": "${link_0}",
          "target": {
            "href": "Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "Jasmine Dragon",
          "key": "${link_1}",
          "target": {
            "href": "Jasmine_Dragon",
            "page": "Jasmine_Dragon"
          }
        }
      ],
      "text": "When the Hundred Year War ended and Zuko became Fire Lord, he celebrated the victory with his uncle at the Jasmine Dragon, their tea shop in Ba Sing Se, which had been reopened. Zuko even helped Iroh serve tea to their friends, just like old times."
    },
    {
      "body": "When the dispute in Yu Dao became hostile, a year had passed since Zuko last spoke with his uncle. The young Fire Lord wanted to ensure that Iroh could live a peaceful and quiet life after the War, and did not wish to bother him by visiting Ba Sing Se frequently. After the crisis was subdued, Iroh wondered why Zuko had not come to him sooner.",
      "links": [],
      "text": "When the dispute in Yu Dao became hostile, a year had passed since Zuko last spoke with his uncle. The young Fire Lord wanted to ensure that Iroh could live a peaceful and quiet life after the War, and did not wish to bother him by visiting Ba Sing Se frequently. After the crisis was subdued, Iroh wondered why Zuko had not come to him sooner."
    },
    {
      "body": "Zuko is a source of guidance for his grandson, much like his Uncle Iroh was to him, and is held in high regard by him. As such, General ${link_0} based a decision on the words of his grandfather, stating that he would respect the Avatar's instinct since that was something that Zuko had done as well.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh_(United_Forces_general)",
            "page": "Iroh_(United_Forces_general)"
          }
        }
      ],
      "text": "Zuko is a source of guidance for his grandson, much like his Uncle Iroh was to him, and is held in high regard by him. As such, General Iroh based a decision on the words of his grandfather, stating that he would respect the Avatar's instinct since that was something that Zuko had done as well."
    },
    {
      "body": "Unlike his own father, Zuko is a caring father to his daughter, Izumi. After the ${link_0} assassinated ${link_1} ${link_2}, Zuko resolved to promptly return to the Fire Nation and ensure ${link_3}'s protection.",
      "links": [
        {
          "body": "Red Lotus",
          "key": "${link_0}",
          "target": {
            "href": "Red_Lotus",
            "page": "Red_Lotus"
          }
        },
        {
          "body": "Earth Queen",
          "key": "${link_1}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        },
        {
          "body": "Hou-Ting",
          "key": "${link_2}",
          "target": {
            "href": "Hou-Ting",
            "page": "Hou-Ting"
          }
        },
        {
          "body": "Izumi",
          "key": "${link_3}",
          "target": {
            "href": "Izumi",
            "page": "Izumi"
          }
        }
      ],
      "text": "Unlike his own father, Zuko is a caring father to his daughter, Izumi. After the Red Lotus assassinated Earth Queen Hou-Ting, Zuko resolved to promptly return to the Fire Nation and ensure Izumi's protection."
    },
    {
      "body": "${link_0} is Zuko's half-sister. Although Zuko was unaware of this when they first met, he immediately displayed brother-like affection toward her and catered a protective streak of her when Azula threatened to destroy her doll. In return, Kiyi had also grown fond of Zuko, begging him to come back to visit some time before he left to venture into Forgetful Valley. When Zuko returned, she hugged him and called him her \"new best friend\".",
      "links": [
        {
          "body": "Kiyi",
          "key": "${link_0}",
          "target": {
            "href": "Kiyi",
            "page": "Kiyi"
          }
        }
      ],
      "text": "Kiyi is Zuko's half-sister. Although Zuko was unaware of this when they first met, he immediately displayed brother-like affection toward her and catered a protective streak of her when Azula threatened to destroy her doll. In return, Kiyi had also grown fond of Zuko, begging him to come back to visit some time before he left to venture into Forgetful Valley. When Zuko returned, she hugged him and called him her \"new best friend\"."
    },
    {
      "body": "Their relationship continued to grow, and Zuko allowed her to call him \"Zuzu\", whereas he had always opposed the nickname when Azula used it. The bond they shared was one of trust, as Zuko was able to convince Kiyi to listen to their mother when she initially refused to after Ursa had readopted her original features. He was often affectionate with his little sister, allowing her to ride on his shoulders, disregarded royal decorum for her, and showed great concern for her wellbeing, as evidenced when she was kidnapped by the ${link_0}.",
      "links": [
        {
          "body": "Kemurikage",
          "key": "${link_0}",
          "target": {
            "href": "Kemurikage",
            "page": "Kemurikage"
          }
        }
      ],
      "text": "Their relationship continued to grow, and Zuko allowed her to call him \"Zuzu\", whereas he had always opposed the nickname when Azula used it. The bond they shared was one of trust, as Zuko was able to convince Kiyi to listen to their mother when she initially refused to after Ursa had readopted her original features. He was often affectionate with his little sister, allowing her to ride on his shoulders, disregarded royal decorum for her, and showed great concern for her wellbeing, as evidenced when she was kidnapped by the Kemurikage."
    },
    {
      "body": "In his younger years, ${link_0} spent quality time with ${link_1} and ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Iroh",
          "key": "${link_1}",
          "target": {
            "href": "Iroh",
            "page": "Iroh"
          }
        },
        {
          "body": "Lu Ten",
          "key": "${link_2}",
          "target": {
            "href": "Lu_Ten",
            "page": "Lu_Ten"
          }
        }
      ],
      "text": "In his younger years, Zuko spent quality time with Iroh and Lu Ten."
    },
    {
      "body": "Zuko's relationship with ${link_0} was primarily unknown, although it was evident that they got along well, as seen in one of Zuko's flashbacks of him in which he was present as Lu Ten and Iroh were building a sand castle together. Zuko appeared very upset when his mother informed him and his sister of Lu Ten's death.",
      "links": [
        {
          "body": "Lu Ten",
          "key": "${link_0}",
          "target": {
            "href": "Lu_Ten",
            "page": "Lu_Ten"
          }
        }
      ],
      "text": "Zuko's relationship with Lu Ten was primarily unknown, although it was evident that they got along well, as seen in one of Zuko's flashbacks of him in which he was present as Lu Ten and Iroh were building a sand castle together. Zuko appeared very upset when his mother informed him and his sister of Lu Ten's death."
    },
    {
      "body": "Also, unlike his father and Azula, Zuko defended Iroh's decision to abandon the ${link_0} due to his son's death, noting that it was a greater loss to Iroh than the battle. They were first cousins since Lu Ten was the son of Zuko's uncle, Iroh.",
      "links": [
        {
          "body": "Siege of Ba Sing Se",
          "key": "${link_0}",
          "target": {
            "href": "Siege_of_Ba_Sing_Se",
            "page": "Siege_of_Ba_Sing_Se"
          }
        }
      ],
      "text": "Also, unlike his father and Azula, Zuko defended Iroh's decision to abandon the Siege of Ba Sing Se due to his son's death, noting that it was a greater loss to Iroh than the battle. They were first cousins since Lu Ten was the son of Zuko's uncle, Iroh."
    },
    {
      "body": "${link_0} constantly sought his ${link_1}'s attention and approval.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "father",
          "key": "${link_1}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Zuko constantly sought his father's attention and approval."
    },
    {
      "body": "While Zuko's relationship with his sister was hostile, he was verbally abused by his father. Zuko was deemed little by his father, talking him down almost at every opportunity since childhood. Some of this stemmed from a heated conversation between Ursa and Ozai when Zuko was younger, where Ursa protected her son from her father's verbal torture. It came to a point where Ursa mentioned that she wishfully thought that Zuko grew up having none of Ozai's attributes and she would have wanted Zuko to be the son of her ex-fiancé Ikem instead. Hurt by Ursa's words, Ozai warned his wife that every insult he threw at Zuko only meant to fulfill Ursa's wish: to have Zuko be treated like someone else's child.",
      "links": [],
      "text": "While Zuko's relationship with his sister was hostile, he was verbally abused by his father. Zuko was deemed little by his father, talking him down almost at every opportunity since childhood. Some of this stemmed from a heated conversation between Ursa and Ozai when Zuko was younger, where Ursa protected her son from her father's verbal torture. It came to a point where Ursa mentioned that she wishfully thought that Zuko grew up having none of Ozai's attributes and she would have wanted Zuko to be the son of her ex-fiancé Ikem instead. Hurt by Ursa's words, Ozai warned his wife that every insult he threw at Zuko only meant to fulfill Ursa's wish: to have Zuko be treated like someone else's child."
    },
    {
      "body": "Zuko was once moved to tears by his father's upbraiding of him in the ${link_0} arena. He was resentful of Ozai's favoritism toward his sister, Azula. Ozai had told his son he was \"lucky to be born\", as opposed to his sister being \"born lucky\", and told Azula he considered Zuko \"a miserable failure\". Despite this, perhaps the most significant driving force behind Zuko's desire to regain his honor was that it would allow him to regain his father's love. Ozai welcomed his son home with open arms and pride in his false accomplishment: the slaying of the Avatar.",
      "links": [
        {
          "body": "Agni Kai",
          "key": "${link_0}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        }
      ],
      "text": "Zuko was once moved to tears by his father's upbraiding of him in the Agni Kai arena. He was resentful of Ozai's favoritism toward his sister, Azula. Ozai had told his son he was \"lucky to be born\", as opposed to his sister being \"born lucky\", and told Azula he considered Zuko \"a miserable failure\". Despite this, perhaps the most significant driving force behind Zuko's desire to regain his honor was that it would allow him to regain his father's love. Ozai welcomed his son home with open arms and pride in his false accomplishment: the slaying of the Avatar."
    },
    {
      "body": "During the events of the Day of Black Sun, Zuko decided to join the Avatar in his quest to defeat Ozai. Before leaving, however, Zuko confronted Ozai in his underground bunker and faced off with him during the eclipse. Zuko revealed that it was Azula who killed the Avatar, not him, and that the Avatar was in fact alive. Ozai nearly fought Zuko out of rage at this revelation, but was helpless without his firebending and would have had to face his son's swordsmanship. Zuko renounced his desire for his father's love, realizing that Ozai was incapable of love. He announced his decision to free Iroh and join the Avatar: he left saying that it was the Avatar's destiny to kill his father, and refused to kill him. Ozai deemed him a coward and a traitor and distracted his son by revealing what happened to his long-lost mother. According to Ozai, Ursa was banished in connection with the death of Fire Lord Azulon, who ordered Ozai to kill Zuko as punishment for his demands to replace Iroh as Fire Lord. Ozai had every intention of killing Zuko, but Ursa stopped him by helping him claim the throne. Zuko was filled with happiness and shock at this new knowledge, but when the eclipse ended, Ozai attacked him by ${link_0}. However, Zuko redirected the lightning at his father as Iroh had taught him, buying him time to escape and begin his mission to stop his father.",
      "links": [
        {
          "body": "generating lightning",
          "key": "${link_0}",
          "target": {
            "href": "Lightning_generation",
            "page": "Lightning_generation"
          }
        }
      ],
      "text": "During the events of the Day of Black Sun, Zuko decided to join the Avatar in his quest to defeat Ozai. Before leaving, however, Zuko confronted Ozai in his underground bunker and faced off with him during the eclipse. Zuko revealed that it was Azula who killed the Avatar, not him, and that the Avatar was in fact alive. Ozai nearly fought Zuko out of rage at this revelation, but was helpless without his firebending and would have had to face his son's swordsmanship. Zuko renounced his desire for his father's love, realizing that Ozai was incapable of love. He announced his decision to free Iroh and join the Avatar: he left saying that it was the Avatar's destiny to kill his father, and refused to kill him. Ozai deemed him a coward and a traitor and distracted his son by revealing what happened to his long-lost mother. According to Ozai, Ursa was banished in connection with the death of Fire Lord Azulon, who ordered Ozai to kill Zuko as punishment for his demands to replace Iroh as Fire Lord. Ozai had every intention of killing Zuko, but Ursa stopped him by helping him claim the throne. Zuko was filled with happiness and shock at this new knowledge, but when the eclipse ended, Ozai attacked him by generating lightning. However, Zuko redirected the lightning at his father as Iroh had taught him, buying him time to escape and begin his mission to stop his father."
    },
    {
      "body": "Zuko evidently began welcoming his father's demise prior to the arrival of Sozin's Comet, as he openly stated that Ozai was the worst father ever. He insisted that as the Avatar, Aang had to kill Ozai in order to save the world: a task Aang felt reluctant to conduct. Despite this, Zuko still reflected subconsciously on the imminent death of his father, as he made a Freudian slip while discussing battle plans with the group and mistakenly called Ozai \"the father lord\" instead of \"Fire Lord\". After the battle, Zuko visited his father in prison and was evidently satisfied with Aang's punishment of Ozai: the permanent loss of his firebending. Zuko hoped that after some time in prison, Ozai would soon be redeemed: he even praised his father for banishing him, as it helped him to realize his destiny. Ozai was no happier to see Zuko in his prison cell than he was to see him in his underground bunker.",
      "links": [],
      "text": "Zuko evidently began welcoming his father's demise prior to the arrival of Sozin's Comet, as he openly stated that Ozai was the worst father ever. He insisted that as the Avatar, Aang had to kill Ozai in order to save the world: a task Aang felt reluctant to conduct. Despite this, Zuko still reflected subconsciously on the imminent death of his father, as he made a Freudian slip while discussing battle plans with the group and mistakenly called Ozai \"the father lord\" instead of \"Fire Lord\". After the battle, Zuko visited his father in prison and was evidently satisfied with Aang's punishment of Ozai: the permanent loss of his firebending. Zuko hoped that after some time in prison, Ozai would soon be redeemed: he even praised his father for banishing him, as it helped him to realize his destiny. Ozai was no happier to see Zuko in his prison cell than he was to see him in his underground bunker."
    },
    {
      "body": "Sickened by the display of ${link_0}'s weakness, ${link_1} demanded his son leave his presence.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Ozai",
          "key": "${link_1}",
          "target": {
            "href": "Ozai",
            "page": "Ozai"
          }
        }
      ],
      "text": "Sickened by the display of Zuko's weakness, Ozai demanded his son leave his presence."
    },
    {
      "body": "Before leaving, Zuko demanded to know where his mother was, only to receive a taunt from his father, stating that the pressures of being Fire Lord would \"change him\", and he would be waiting his return to seek help.",
      "links": [],
      "text": "Before leaving, Zuko demanded to know where his mother was, only to receive a taunt from his father, stating that the pressures of being Fire Lord would \"change him\", and he would be waiting his return to seek help."
    },
    {
      "body": "Ozai's prophecy held true as Zuko struggled over the developing crisis regarding the ${link_0}, and the new Fire Lord later returned to Ozai's cell to seek his advice.",
      "links": [
        {
          "body": "Fire Nation colonies",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Nation_colonies",
            "page": "Fire_Nation_colonies"
          }
        }
      ],
      "text": "Ozai's prophecy held true as Zuko struggled over the developing crisis regarding the Fire Nation colonies, and the new Fire Lord later returned to Ozai's cell to seek his advice."
    },
    {
      "body": "After the second meeting, Ozai had tried to persuade Zuko that everything he chooses is right, as he is the Fire Lord. Zuko, although at first enraged by that comment, gave into Ozai's advice after he learned that the ${link_0} was attacking the colonies.",
      "links": [
        {
          "body": "Earth King",
          "key": "${link_0}",
          "target": {
            "href": "Earth_monarch",
            "page": "Earth_monarch"
          }
        }
      ],
      "text": "After the second meeting, Ozai had tried to persuade Zuko that everything he chooses is right, as he is the Fire Lord. Zuko, although at first enraged by that comment, gave into Ozai's advice after he learned that the Earth King was attacking the colonies."
    },
    {
      "body": "After hearing an important piece of a lecture from an esteemed Earth Kingdom professor regarding family, Zuko expressed some regret of how he was treating his father.",
      "links": [],
      "text": "After hearing an important piece of a lecture from an esteemed Earth Kingdom professor regarding family, Zuko expressed some regret of how he was treating his father."
    },
    {
      "body": "${link_0} was loved much by his mother, ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Ursa",
          "key": "${link_1}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        }
      ],
      "text": "Zuko was loved much by his mother, Ursa."
    },
    {
      "body": "Growing up, it was hinted that Zuko was his mother's favorite child, and the two were close. Zuko's sister, Azula, stated that Ursa had always favored Zuko more than her, as she claimed that Ursa had thought she was a monster. However, Zuko lost all contact with his mother after she disappeared in the middle of the night, after telling him that everything she had done had been to protect him.",
      "links": [],
      "text": "Growing up, it was hinted that Zuko was his mother's favorite child, and the two were close. Zuko's sister, Azula, stated that Ursa had always favored Zuko more than her, as she claimed that Ursa had thought she was a monster. However, Zuko lost all contact with his mother after she disappeared in the middle of the night, after telling him that everything she had done had been to protect him."
    },
    {
      "body": "Believing his mother to be dead, Zuko maintained a close bond to her, as he was plagued by dreams where she begged him to help her and talked to his portrait of Ursa during the ${link_0}, in which he stated \"I know I've made some bad choices, but today, I'm going to set things right.\" When he later confronted his father during the solar eclipse, he learned that Ursa was possibly still alive, as she had merely been banished from the Fire Nation for certain treasonous acts. This revelation renewed Zuko's hope to seeing his mother again and caused him to shed a few tears.",
      "links": [
        {
          "body": "invasion of the Fire Nation",
          "key": "${link_0}",
          "target": {
            "href": "Invasion_of_the_Fire_Nation",
            "page": "Invasion_of_the_Fire_Nation"
          }
        }
      ],
      "text": "Believing his mother to be dead, Zuko maintained a close bond to her, as he was plagued by dreams where she begged him to help her and talked to his portrait of Ursa during the invasion of the Fire Nation, in which he stated \"I know I've made some bad choices, but today, I'm going to set things right.\" When he later confronted his father during the solar eclipse, he learned that Ursa was possibly still alive, as she had merely been banished from the Fire Nation for certain treasonous acts. This revelation renewed Zuko's hope to seeing his mother again and caused him to shed a few tears."
    },
    {
      "body": "After Ozai was imprisoned following his defeat during the arrival of Sozin's Comet, Zuko visited his cell and demanded to know where his mother was but received no answer. Nonetheless, he sent out several search parties and employed ${link_0} and ${link_1} to track Ursa down though to no avail. Despite the hardships he had to deal with as the new Fire Lord, his missing mother stayed on his mind, and Zuko confided in Iroh and Aang his belief that finding and reconnecting with his mother would be his only chance to find peace. Strengthened by Aang's promise that he and the rest of Team Avatar would help, Zuko visited Azula in the mental ward and asked her for her assistance in finding their mother.",
      "links": [
        {
          "body": "June",
          "key": "${link_0}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "her shirshu",
          "key": "${link_1}",
          "target": {
            "href": "Nyla",
            "page": "Nyla"
          }
        }
      ],
      "text": "After Ozai was imprisoned following his defeat during the arrival of Sozin's Comet, Zuko visited his cell and demanded to know where his mother was but received no answer. Nonetheless, he sent out several search parties and employed June and her shirshu to track Ursa down though to no avail. Despite the hardships he had to deal with as the new Fire Lord, his missing mother stayed on his mind, and Zuko confided in Iroh and Aang his belief that finding and reconnecting with his mother would be his only chance to find peace. Strengthened by Aang's promise that he and the rest of Team Avatar would help, Zuko visited Azula in the mental ward and asked her for her assistance in finding their mother."
    },
    {
      "body": "After reconnecting with ${link_0}, ${link_1} eagerly wanted to learn everything about her.",
      "links": [
        {
          "body": "his mother",
          "key": "${link_0}",
          "target": {
            "href": "Ursa",
            "page": "Ursa"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "After reconnecting with his mother, Zuko eagerly wanted to learn everything about her."
    },
    {
      "body": "Eventually, Zuko found his mother living as Noriko in the small village of ${link_0}. Discovering she had all her memories wiped by the ${link_1} and had started a new family with ${link_2} and their daughter, ${link_3}, he was willing to let her live her life unaware of their connection. However, she ultimately chose to regain her former memories and identity. Reunited, Ursa apologized to her son for not loving him sufficiently, as she had chosen to forget about him, though Zuko rapidly consoled her by noting that everything turned out fine and that he had built himself a life he could be proud of. Reconciled with his past, he requested his mother to tell him everything about her own life, a request to which Ursa happily complied.",
      "links": [
        {
          "body": "Hira'a",
          "key": "${link_0}",
          "target": {
            "href": "Hira%27a",
            "page": "Hira%27a"
          }
        },
        {
          "body": "Mother of Faces",
          "key": "${link_1}",
          "target": {
            "href": "Mother_of_Faces",
            "page": "Mother_of_Faces"
          }
        },
        {
          "body": "Ikem",
          "key": "${link_2}",
          "target": {
            "href": "Noren#Life_as_Ikem",
            "page": "Noren"
          }
        },
        {
          "body": "Kiyi",
          "key": "${link_3}",
          "target": {
            "href": "Kiyi",
            "page": "Kiyi"
          }
        }
      ],
      "text": "Eventually, Zuko found his mother living as Noriko in the small village of Hira'a. Discovering she had all her memories wiped by the Mother of Faces and had started a new family with Ikem and their daughter, Kiyi, he was willing to let her live her life unaware of their connection. However, she ultimately chose to regain her former memories and identity. Reunited, Ursa apologized to her son for not loving him sufficiently, as she had chosen to forget about him, though Zuko rapidly consoled her by noting that everything turned out fine and that he had built himself a life he could be proud of. Reconciled with his past, he requested his mother to tell him everything about her own life, a request to which Ursa happily complied."
    },
    {
      "body": "${link_0} and ${link_1} enjoyed a romantic evening together.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Jin",
          "key": "${link_1}",
          "target": {
            "href": "Jin",
            "page": "Jin"
          }
        }
      ],
      "text": "Zuko and Jin enjoyed a romantic evening together."
    },
    {
      "body": "Zuko and ${link_0} met once when Jin visited the tea shop he worked at in order to ask Zuko out on a date. Zuko was at first suspicious of her, as she was constantly visiting the tea shop. He assumed that she had discovered that he and his uncle were firebenders, however, Iroh correctly deduced that Jin had a crush on Zuko, which shocked him. Jin subsequently asked him out, which Iroh quickly accepted on behalf of Zuko.",
      "links": [
        {
          "body": "Jin",
          "key": "${link_0}",
          "target": {
            "href": "Jin",
            "page": "Jin"
          }
        }
      ],
      "text": "Zuko and Jin met once when Jin visited the tea shop he worked at in order to ask Zuko out on a date. Zuko was at first suspicious of her, as she was constantly visiting the tea shop. He assumed that she had discovered that he and his uncle were firebenders, however, Iroh correctly deduced that Jin had a crush on Zuko, which shocked him. Jin subsequently asked him out, which Iroh quickly accepted on behalf of Zuko."
    },
    {
      "body": "When Jin picked Zuko up for their date, she rumpled his hairstyle, which Iroh had spent ten minutes working on, and dragged him to a restaurant, asking him obligatory questions. Zuko was shy and awkward throughout the meal; nonetheless, Jin seemed to be satisfied with the conversation. Zuko vehemently denied that she was his girlfriend when their waiter suggested it, though.",
      "links": [],
      "text": "When Jin picked Zuko up for their date, she rumpled his hairstyle, which Iroh had spent ten minutes working on, and dragged him to a restaurant, asking him obligatory questions. Zuko was shy and awkward throughout the meal; nonetheless, Jin seemed to be satisfied with the conversation. Zuko vehemently denied that she was his girlfriend when their waiter suggested it, though."
    },
    {
      "body": "After the dinner, Jin showed Zuko her favorite place, a fountain which was usually illuminated by lanterns. When they arrived there, though, the lanterns were not lit. Noting her disappointment, Zuko asked Jin to close her eyes and used precise firebending to light the lanterns. A thrilled Jin wondered aloud how the lanterns were lit, but Zuko only smiled in response.",
      "links": [],
      "text": "After the dinner, Jin showed Zuko her favorite place, a fountain which was usually illuminated by lanterns. When they arrived there, though, the lanterns were not lit. Noting her disappointment, Zuko asked Jin to close her eyes and used precise firebending to light the lanterns. A thrilled Jin wondered aloud how the lanterns were lit, but Zuko only smiled in response."
    },
    {
      "body": "Zuko was shy — he intercepted Jin's attempt to kiss him with a coupon for a free cup of tea. However, Jin finally kissed him and Zuko even returned it, but almost immediately broke away from her, telling her, \"It's complicated,\" and returned to his apartment, leaving behind a disappointed Jin.",
      "links": [],
      "text": "Zuko was shy — he intercepted Jin's attempt to kiss him with a coupon for a free cup of tea. However, Jin finally kissed him and Zuko even returned it, but almost immediately broke away from her, telling her, \"It's complicated,\" and returned to his apartment, leaving behind a disappointed Jin."
    },
    {
      "body": "When he returned to the apartment, Iroh asked Zuko how the night went, and Zuko at first went to a room and slammed the door, but after a few moments popped back out and replied simply, \"it was nice\", implying that despite the awkwardness and complications, he genuinely enjoyed his date with Jin.",
      "links": [],
      "text": "When he returned to the apartment, Iroh asked Zuko how the night went, and Zuko at first went to a room and slammed the door, but after a few moments popped back out and replied simply, \"it was nice\", implying that despite the awkwardness and complications, he genuinely enjoyed his date with Jin."
    },
    {
      "body": "Jin briefly appeared again later, but did not seem to mind ${link_0} being with Zuko.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        }
      ],
      "text": "Jin briefly appeared again later, but did not seem to mind Mai being with Zuko."
    },
    {
      "body": "${link_0} and ${link_1} occasionally demonstrated their affection toward one another.",
      "links": [
        {
          "body": "Mai",
          "key": "${link_0}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Mai and Zuko occasionally demonstrated their affection toward one another."
    },
    {
      "body": "Although Zuko and Mai's relationship did not start until he joined his sister's side, earning his return to the Fire Nation, it was hinted that they had crushes on one another when they were children, as confirmed by Azula. Once, when younger, the cunning princess devised a ruse specifically to embarrass the two childhood sweethearts. Her plan succeeded, and ${link_0} proclaimed that the two were \"cute together\". The first time they were seen kissing was during their set up \"date\" in the ${link_1}, and later on their way to the Fire Nation.",
      "links": [
        {
          "body": "Ty Lee",
          "key": "${link_0}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Earth Kingdom",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "text": "Although Zuko and Mai's relationship did not start until he joined his sister's side, earning his return to the Fire Nation, it was hinted that they had crushes on one another when they were children, as confirmed by Azula. Once, when younger, the cunning princess devised a ruse specifically to embarrass the two childhood sweethearts. Her plan succeeded, and Ty Lee proclaimed that the two were \"cute together\". The first time they were seen kissing was during their set up \"date\" in the Earth Kingdom, and later on their way to the Fire Nation."
    },
    {
      "body": "Their relationship became strained during a brief vacation to Ember Island, where Zuko's failed attempts to impress Mai with shells and an ice cream cone led to frustration. They broke up later at a party, with Zuko expressing fury at Mai's stoic nature. However, after some conflict and open confessions about the difficulties with which they were faced, the two made up, with Mai saying that he was the one she cared about the most. In the days leading up to the invasion of the Fire Nation, Zuko often spent time with Mai at ${link_0} and took pleasure in ordering the servants around. Before leaving to train the Avatar, he left a goodbye letter to her, and later told Sokka that he did not want Mai to be seen as a traitor.",
      "links": [
        {
          "body": "her house",
          "key": "${link_0}",
          "target": {
            "href": "Mai%27s_house",
            "page": "Mai%27s_house"
          }
        }
      ],
      "text": "Their relationship became strained during a brief vacation to Ember Island, where Zuko's failed attempts to impress Mai with shells and an ice cream cone led to frustration. They broke up later at a party, with Zuko expressing fury at Mai's stoic nature. However, after some conflict and open confessions about the difficulties with which they were faced, the two made up, with Mai saying that he was the one she cared about the most. In the days leading up to the invasion of the Fire Nation, Zuko often spent time with Mai at her house and took pleasure in ordering the servants around. Before leaving to train the Avatar, he left a goodbye letter to her, and later told Sokka that he did not want Mai to be seen as a traitor."
    },
    {
      "body": "A ${link_0} of ${link_1} and ${link_2} was done after the latter's return to the ${link_3}.",
      "links": [
        {
          "body": "painting",
          "key": "${link_0}",
          "target": {
            "href": "Arts_in_the_World_of_Avatar",
            "page": "Arts_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Mai",
          "key": "${link_1}",
          "target": {
            "href": "Mai",
            "page": "Mai"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_2}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_3}",
          "target": {
            "href": "Fire_Nation",
            "page": "Fire_Nation"
          }
        }
      ],
      "text": "A painting of Mai and Zuko was done after the latter's return to the Fire Nation."
    },
    {
      "body": "Zuko was later confronted by Mai in a prison cell at the ${link_0} where the latter expressed her grief and resentment at having been left behind. When a guard came to protect Mai after a prison riot ensued, Zuko said almost proudly that she did not need protection. Even so, he locked her up in the cell and told her that he needed to help the Fire Nation. In order to help him and the rest escape, she subdued all the prison guards who were hindering the escape effort, thereby betraying Azula, and told her that she loved Zuko more than she feared Azula. After the Hundred Year War was ended and Zuko's coronation was about to start, she helped him get dressed and they renewed their relationship through a passionate hug and a romantic kiss.",
      "links": [
        {
          "body": "Boiling Rock",
          "key": "${link_0}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        }
      ],
      "text": "Zuko was later confronted by Mai in a prison cell at the Boiling Rock where the latter expressed her grief and resentment at having been left behind. When a guard came to protect Mai after a prison riot ensued, Zuko said almost proudly that she did not need protection. Even so, he locked her up in the cell and told her that he needed to help the Fire Nation. In order to help him and the rest escape, she subdued all the prison guards who were hindering the escape effort, thereby betraying Azula, and told her that she loved Zuko more than she feared Azula. After the Hundred Year War was ended and Zuko's coronation was about to start, she helped him get dressed and they renewed their relationship through a passionate hug and a romantic kiss."
    },
    {
      "body": "Zuko and Mai remained close after the War, but as the peace process began to disintegrate a year later with continued unrest in the colonies, their relationship faced some strain. Zuko suffered severe stress after several attempts were made on his life, and after one attack, perpetrated by ${link_0}, Zuko ventured to the colony of ${link_1} to confront the colonists without informing Mai of his departure. Mai only discovered his whereabouts after finding official edicts posted around the city, and upon Zuko's return confronted him on this, having clearly been worried about his safety. Mai reminded Zuko that he has her as a confidant, and he apologized for having caused her so much worry.",
      "links": [
        {
          "body": "Kori Morishita",
          "key": "${link_0}",
          "target": {
            "href": "Kori_Morishita",
            "page": "Kori_Morishita"
          }
        },
        {
          "body": "Yu Dao",
          "key": "${link_1}",
          "target": {
            "href": "Yu_Dao",
            "page": "Yu_Dao"
          }
        }
      ],
      "text": "Zuko and Mai remained close after the War, but as the peace process began to disintegrate a year later with continued unrest in the colonies, their relationship faced some strain. Zuko suffered severe stress after several attempts were made on his life, and after one attack, perpetrated by Kori Morishita, Zuko ventured to the colony of Yu Dao to confront the colonists without informing Mai of his departure. Mai only discovered his whereabouts after finding official edicts posted around the city, and upon Zuko's return confronted him on this, having clearly been worried about his safety. Mai reminded Zuko that he has her as a confidant, and he apologized for having caused her so much worry."
    },
    {
      "body": "Mai was deeply troubled by the stress and lack of sleep Zuko had been suffering, and during his absence she called on the ${link_0} and her friend ${link_1} to act as his bodyguards, believing the ${link_2} to have proven ineffective in their duties. Zuko accepted the additional protection.",
      "links": [
        {
          "body": "Kyoshi Warriors",
          "key": "${link_0}",
          "target": {
            "href": "Kyoshi_Warriors",
            "page": "Kyoshi_Warriors"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_1}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        },
        {
          "body": "Imperial Guards",
          "key": "${link_2}",
          "target": {
            "href": "Royal_Procession",
            "page": "Royal_Procession"
          }
        }
      ],
      "text": "Mai was deeply troubled by the stress and lack of sleep Zuko had been suffering, and during his absence she called on the Kyoshi Warriors and her friend Ty Lee to act as his bodyguards, believing the Imperial Guards to have proven ineffective in their duties. Zuko accepted the additional protection."
    },
    {
      "body": "Zuko and Mai's relationship eventually reached at least a temporary end when Zuko continued to keep secrets from Mai. Coming to the conclusion that Zuko loved his secrets more than he loved her, Mai broke up with him, despite his claim that he loved her.",
      "links": [],
      "text": "Zuko and Mai's relationship eventually reached at least a temporary end when Zuko continued to keep secrets from Mai. Coming to the conclusion that Zuko loved his secrets more than he loved her, Mai broke up with him, despite his claim that he loved her."
    },
    {
      "body": "${link_0} and ${link_1} first met in the ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_2}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "Zuko and Aang first met in the Southern Water Tribe."
    },
    {
      "body": "Originally, as the Avatar, Aang was Zuko's greatest enemy and his long sought-after prize. Throughout the bulk of the series, Zuko's primary focus had been to capture Aang, who constantly eluded him. Even though the capture of the Avatar by anyone of the Fire Nation would assist his country, Zuko saw the capture and delivery of Aang to Fire Lord Ozai as the only way to restore his lost honor, so he went out of his way to impede rivals from capturing Aang before he did himself.",
      "links": [],
      "text": "Originally, as the Avatar, Aang was Zuko's greatest enemy and his long sought-after prize. Throughout the bulk of the series, Zuko's primary focus had been to capture Aang, who constantly eluded him. Even though the capture of the Avatar by anyone of the Fire Nation would assist his country, Zuko saw the capture and delivery of Aang to Fire Lord Ozai as the only way to restore his lost honor, so he went out of his way to impede rivals from capturing Aang before he did himself."
    },
    {
      "body": "Zuko took on the titular guise of the Blue Spirit, a masked, dual-broadsword-wielding vigilante, in order to abduct Aang from the fortress where he was being kept by Admiral Zhao, who had managed to capture him. Zuko managed to escape with Aang, but once they had made it a way down the road, Zuko was knocked out by a ${link_0} precision shooting, and Aang unmasked Zuko. However, even upon discovering that his rescuer-turned-abductor was his major enemy, Aang still took Zuko with him when he escaped. When Zuko awakened, Aang spoke to him fondly and nostalgically of ${link_1}, a boy from the Fire Nation who used to be his friend one hundred years before the War. Aang asked, guilelessly, if Zuko thought that he and Aang could have been friends in another time. Zuko responded by shooting a fire blast at Aang. Aang fled through the trees, but Zuko did not give a chase.",
      "links": [
        {
          "body": "Yuyan Archer's",
          "key": "${link_0}",
          "target": {
            "href": "Yuyan_Archers",
            "page": "Yuyan_Archers"
          }
        },
        {
          "body": "Kuzon",
          "key": "${link_1}",
          "target": {
            "href": "Kuzon",
            "page": "Kuzon"
          }
        }
      ],
      "text": "Zuko took on the titular guise of the Blue Spirit, a masked, dual-broadsword-wielding vigilante, in order to abduct Aang from the fortress where he was being kept by Admiral Zhao, who had managed to capture him. Zuko managed to escape with Aang, but once they had made it a way down the road, Zuko was knocked out by a Yuyan Archer's precision shooting, and Aang unmasked Zuko. However, even upon discovering that his rescuer-turned-abductor was his major enemy, Aang still took Zuko with him when he escaped. When Zuko awakened, Aang spoke to him fondly and nostalgically of Kuzon, a boy from the Fire Nation who used to be his friend one hundred years before the War. Aang asked, guilelessly, if Zuko thought that he and Aang could have been friends in another time. Zuko responded by shooting a fire blast at Aang. Aang fled through the trees, but Zuko did not give a chase."
    },
    {
      "body": "While Zuko had a catatonic Aang in his custody during the ${link_0}, he spoke to him about his life philosophy of struggle being the genesis of strength and compared Aang to Azula, citing that everything came easily to Azula. Once Aang's friends came to rescue him, Aang once again chose to save Zuko's life when he insisted on bringing Zuko along rather than leaving him unconscious in a blizzard to die.",
      "links": [
        {
          "body": "Siege of the North",
          "key": "${link_0}",
          "target": {
            "href": "Siege_of_the_North",
            "page": "Siege_of_the_North"
          }
        }
      ],
      "text": "While Zuko had a catatonic Aang in his custody during the Siege of the North, he spoke to him about his life philosophy of struggle being the genesis of strength and compared Aang to Azula, citing that everything came easily to Azula. Once Aang's friends came to rescue him, Aang once again chose to save Zuko's life when he insisted on bringing Zuko along rather than leaving him unconscious in a blizzard to die."
    },
    {
      "body": "After Zuko was declared a wanted traitor of the Fire Nation, he still somewhat expressed a desire to capture Aang, despite evidence that this would, in all likelihood, no longer be enough to win back his honor and his birthright. Zuko confronted both Aang and Azula and engaged in a three-way battle with them when Azula refused to leave the capture of the Avatar to him, though Zuko began to join Aang and let his focus be solely on Azula. When Azula surprise-attacked Zuko's beloved uncle, Iroh, he did not allow the Avatar or his friends to get near him. Zuko almost gave up in his pursuit of the Avatar later. The inner conflict resulting over this potential change in goals resulted with him undergoing a metamorphosis and dreaming that he had Air Nomad tattoos.",
      "links": [],
      "text": "After Zuko was declared a wanted traitor of the Fire Nation, he still somewhat expressed a desire to capture Aang, despite evidence that this would, in all likelihood, no longer be enough to win back his honor and his birthright. Zuko confronted both Aang and Azula and engaged in a three-way battle with them when Azula refused to leave the capture of the Avatar to him, though Zuko began to join Aang and let his focus be solely on Azula. When Azula surprise-attacked Zuko's beloved uncle, Iroh, he did not allow the Avatar or his friends to get near him. Zuko almost gave up in his pursuit of the Avatar later. The inner conflict resulting over this potential change in goals resulted with him undergoing a metamorphosis and dreaming that he had Air Nomad tattoos."
    },
    {
      "body": "Despite Aang being the clear protagonist and Zuko initially being the main antagonist, their stories were often paralleled in the narrative structure of the show. Flashbacks of the incidents that changed their respective lives forever, Aang being told that he was the Avatar and subsequently running away, and Zuko's Agni Kai against his father and subsequent scarring and loss of his honor, were shown side-by-side. Their attempts to progress in their bending while impeded by psychological blocks were also shown side-by-side. They were both marked men, with Aang having his ${link_0} all over his body, while Zuko had a large scar on his left eye given to him by his father. Scenes of Aang struggling to cope with an unexpected betrayal from an ${link_1} morphed smoothly into Zuko facing a similar betrayal from his sister. Aang was shown displaying the same frustration about the loss of his honor as Zuko, echoing the same frustration Zuko had been uttering for the first two seasons, \"I need to redeem myself. I need my honor back.\" Both Zuko and Aang found out about their interconnected fates, with Aang being the reincarnation of Avatar Roku and Zuko being Roku's direct descendant as Roku's granddaughter was Zuko's mother. Both characters at some point stated that they were ready to face the Fire Lord. Aang intended to do battle with Ozai, while Zuko was ready to confront his father about his feelings and choices. During that confrontation, he announced his intention to join the Avatar and helped him defeat Fire Lord Ozai. Zuko's confrontation with his father was mirrored by Aang's battle with Azula.",
      "links": [
        {
          "body": "arrow tattoos",
          "key": "${link_0}",
          "target": {
            "href": "Body_markings_in_the_World_of_Avatar#Airbending_masters",
            "page": "Body_markings_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Earth Kingdom general",
          "key": "${link_1}",
          "target": {
            "href": "Fong",
            "page": "Fong"
          }
        }
      ],
      "text": "Despite Aang being the clear protagonist and Zuko initially being the main antagonist, their stories were often paralleled in the narrative structure of the show. Flashbacks of the incidents that changed their respective lives forever, Aang being told that he was the Avatar and subsequently running away, and Zuko's Agni Kai against his father and subsequent scarring and loss of his honor, were shown side-by-side. Their attempts to progress in their bending while impeded by psychological blocks were also shown side-by-side. They were both marked men, with Aang having his arrow tattoos all over his body, while Zuko had a large scar on his left eye given to him by his father. Scenes of Aang struggling to cope with an unexpected betrayal from an Earth Kingdom general morphed smoothly into Zuko facing a similar betrayal from his sister. Aang was shown displaying the same frustration about the loss of his honor as Zuko, echoing the same frustration Zuko had been uttering for the first two seasons, \"I need to redeem myself. I need my honor back.\" Both Zuko and Aang found out about their interconnected fates, with Aang being the reincarnation of Avatar Roku and Zuko being Roku's direct descendant as Roku's granddaughter was Zuko's mother. Both characters at some point stated that they were ready to face the Fire Lord. Aang intended to do battle with Ozai, while Zuko was ready to confront his father about his feelings and choices. During that confrontation, he announced his intention to join the Avatar and helped him defeat Fire Lord Ozai. Zuko's confrontation with his father was mirrored by Aang's battle with Azula."
    },
    {
      "body": "Zuko revealed himself to Aang and the others, and told them that he was split off from Ozai, and wanted to join their group and teach Aang firebending. At first, Aang refused to allow Zuko in the group, although he seemed to consider it more seriously than the others when he saw Appa licking him. However, he relented after Zuko helped the group defeat ${link_0} and Zuko expressed the need for restraint in relation to firebending. From that point on, Zuko became Aang's firebending teacher.",
      "links": [
        {
          "body": "Combustion Man",
          "key": "${link_0}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        }
      ],
      "text": "Zuko revealed himself to Aang and the others, and told them that he was split off from Ozai, and wanted to join their group and teach Aang firebending. At first, Aang refused to allow Zuko in the group, although he seemed to consider it more seriously than the others when he saw Appa licking him. However, he relented after Zuko helped the group defeat Combustion Man and Zuko expressed the need for restraint in relation to firebending. From that point on, Zuko became Aang's firebending teacher."
    },
    {
      "body": "${link_0} and ${link_1} traveled together to learn ${link_2}.",
      "links": [
        {
          "body": "Aang",
          "key": "${link_0}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "firebending",
          "key": "${link_2}",
          "target": {
            "href": "Firebending",
            "page": "Firebending"
          }
        }
      ],
      "text": "Aang and Zuko traveled together to learn firebending."
    },
    {
      "body": "Aang appeared to be friendlier toward Zuko than the others in the group. He was the first to accept Zuko, and never made any sarcastic or unfriendly comments toward him. He even complimented Zuko by saying that he was \"pretty smart\". His liking for Zuko may have even deepened after their adventure with the Sun Warriors, and their learning of the secret of firebending.",
      "links": [],
      "text": "Aang appeared to be friendlier toward Zuko than the others in the group. He was the first to accept Zuko, and never made any sarcastic or unfriendly comments toward him. He even complimented Zuko by saying that he was \"pretty smart\". His liking for Zuko may have even deepened after their adventure with the Sun Warriors, and their learning of the secret of firebending."
    },
    {
      "body": "Aang and Zuko became better friends as time passed, with Zuko continuing to teach him firebending and helping his friends to accomplish various tasks. While they took refuge on Ember Island, Aang did not take his training seriously, choosing to have a beach party with his friends instead. Zuko became angry and decided to attack Aang in the Fire Lord's summer home, demanding Aang to fight back instead of trying to avoid conflict, assuming he would take on the Fire Lord before the comet arrived. When he learned that Aang would face Ozai after Sozin's Comet passed, Zuko informed them of Ozai's plan to destroy the Earth Kingdom. In preparation, Zuko taught Aang to redirect lightning.",
      "links": [],
      "text": "Aang and Zuko became better friends as time passed, with Zuko continuing to teach him firebending and helping his friends to accomplish various tasks. While they took refuge on Ember Island, Aang did not take his training seriously, choosing to have a beach party with his friends instead. Zuko became angry and decided to attack Aang in the Fire Lord's summer home, demanding Aang to fight back instead of trying to avoid conflict, assuming he would take on the Fire Lord before the comet arrived. When he learned that Aang would face Ozai after Sozin's Comet passed, Zuko informed them of Ozai's plan to destroy the Earth Kingdom. In preparation, Zuko taught Aang to redirect lightning."
    },
    {
      "body": "When Zuko made his opinion known that Aang needed to kill Ozai in order to save the world, Aang became very frustrated and criticized Zuko's advice. When Aang went missing the next morning, Zuko was genuinely concerned over his disappearance and went to great lengths to track him, confessing to Katara his worries about Aang were greater than his worries about fighting Azula.",
      "links": [],
      "text": "When Zuko made his opinion known that Aang needed to kill Ozai in order to save the world, Aang became very frustrated and criticized Zuko's advice. When Aang went missing the next morning, Zuko was genuinely concerned over his disappearance and went to great lengths to track him, confessing to Katara his worries about Aang were greater than his worries about fighting Azula."
    },
    {
      "body": "Aang eventually did defeat Ozai and ultimately spared the Fire Lord by stripping him of his firebending. At his coronation as Fire Lord, Zuko expressed pride at Aang's success, and the two embraced each other in a warm hug, as they had finally become friends. They promised the world that they would work together to restore the war-torn nations, and celebrated together at Ba Sing Se.",
      "links": [],
      "text": "Aang eventually did defeat Ozai and ultimately spared the Fire Lord by stripping him of his firebending. At his coronation as Fire Lord, Zuko expressed pride at Aang's success, and the two embraced each other in a warm hug, as they had finally become friends. They promised the world that they would work together to restore the war-torn nations, and celebrated together at Ba Sing Se."
    },
    {
      "body": "As the ${link_0} is announced while the team is flying on Appa, Zuko asked Aang to promise that the latter would end him if he ever became like his father.",
      "links": [
        {
          "body": "Harmony Restoration Movement",
          "key": "${link_0}",
          "target": {
            "href": "Harmony_Restoration_Movement",
            "page": "Harmony_Restoration_Movement"
          }
        }
      ],
      "text": "As the Harmony Restoration Movement is announced while the team is flying on Appa, Zuko asked Aang to promise that the latter would end him if he ever became like his father."
    },
    {
      "body": "A year later, their friendship became tense as Zuko pulled his nation out of the Harmony Restoration Movement. Zuko seemed more caring for his people, and this led to a verbal spar between him and Aang. Zuko argued to Aang that he would not allow the hard work of the Fire Nation to be destroyed against Aang arguing that the nations needed to remain separate. The altercation ended with Katara suggesting a meeting with Earth King ${link_0} to try and settle matters, to which each of the two agreed.",
      "links": [
        {
          "body": "Kuei",
          "key": "${link_0}",
          "target": {
            "href": "Kuei",
            "page": "Kuei"
          }
        }
      ],
      "text": "A year later, their friendship became tense as Zuko pulled his nation out of the Harmony Restoration Movement. Zuko seemed more caring for his people, and this led to a verbal spar between him and Aang. Zuko argued to Aang that he would not allow the hard work of the Fire Nation to be destroyed against Aang arguing that the nations needed to remain separate. The altercation ended with Katara suggesting a meeting with Earth King Kuei to try and settle matters, to which each of the two agreed."
    },
    {
      "body": "While they were spiritually related, as Roku was Zuko's great-grandfather, Zuko was never seen telling this to Aang, who was unaware of his relation to Zuko, until he was informed of this by Roku. Upon this revelation, Aang began to view Zuko as family and they grew to be lifelong, best friends, with Aang regularly turning to Zuko for advice. According to his grandson ${link_0}, Zuko would always trust the Avatar's instinct.",
      "links": [
        {
          "body": "Iroh",
          "key": "${link_0}",
          "target": {
            "href": "Iroh_(United_Forces_general)",
            "page": "Iroh_(United_Forces_general)"
          }
        }
      ],
      "text": "While they were spiritually related, as Roku was Zuko's great-grandfather, Zuko was never seen telling this to Aang, who was unaware of his relation to Zuko, until he was informed of this by Roku. Upon this revelation, Aang began to view Zuko as family and they grew to be lifelong, best friends, with Aang regularly turning to Zuko for advice. According to his grandson Iroh, Zuko would always trust the Avatar's instinct."
    },
    {
      "body": "${link_0} thanked ${link_1} for saving him.",
      "links": [
        {
          "body": "Appa",
          "key": "${link_0}",
          "target": {
            "href": "Appa",
            "page": "Appa"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Appa thanked Zuko for saving him."
    },
    {
      "body": "As an enemy of Team Avatar, Zuko was originally an enemy of Appa. At Ba Sing Se, Zuko freed Appa from the ${link_0}, gaining Appa's respect. While at the Western Air Temple, Appa was the first to approve of Zuko's entrance into the group, showing this by licking him. The fact that Appa approved of Zuko was one of the reasons Aang and the others accepted him into the group. The first time Zuko rode Appa, he stated that he thought \"this thing would be a lot faster\". Prior to the arrival of Sozin's Comet, Appa apparently felt comfortable enough to let Zuko steer him.",
      "links": [
        {
          "body": "Dai Li",
          "key": "${link_0}",
          "target": {
            "href": "Dai_Li",
            "page": "Dai_Li"
          }
        }
      ],
      "text": "As an enemy of Team Avatar, Zuko was originally an enemy of Appa. At Ba Sing Se, Zuko freed Appa from the Dai Li, gaining Appa's respect. While at the Western Air Temple, Appa was the first to approve of Zuko's entrance into the group, showing this by licking him. The fact that Appa approved of Zuko was one of the reasons Aang and the others accepted him into the group. The first time Zuko rode Appa, he stated that he thought \"this thing would be a lot faster\". Prior to the arrival of Sozin's Comet, Appa apparently felt comfortable enough to let Zuko steer him."
    },
    {
      "body": "${link_0} and ${link_1} cooperated with one another to perform a successful ${link_2} from the ${link_3}.",
      "links": [
        {
          "body": "Hakoda",
          "key": "${link_0}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "escape",
          "key": "${link_2}",
          "target": {
            "href": "Escape_from_the_Boiling_Rock",
            "page": "Escape_from_the_Boiling_Rock"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_3}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        }
      ],
      "text": "Hakoda and Zuko cooperated with one another to perform a successful escape from the Boiling Rock."
    },
    {
      "body": "After Zuko heard that his friend Sokka's father's ${link_0} was captured among the troops taken prisoner after the failed Invasion of the Fire Nation and that Sokka needed to know what he had put his father through, Zuko was distraught at his friend's condition and pitiful of Hakoda's situation. Nevertheless, with sorrow, he told Sokka that the most likely place Hakoda was taken to was Boiling Rock. When Sokka asked where the Boiling Rock was, Zuko was curious as to why he needed to know and what he was planning at first, but soon divulged the answer. When Sokka tried to sneak away on Appa to save Hakoda, Zuko caught him red-handed.",
      "links": [
        {
          "body": "Hakoda",
          "key": "${link_0}",
          "target": {
            "href": "Hakoda",
            "page": "Hakoda"
          }
        }
      ],
      "text": "After Zuko heard that his friend Sokka's father's Hakoda was captured among the troops taken prisoner after the failed Invasion of the Fire Nation and that Sokka needed to know what he had put his father through, Zuko was distraught at his friend's condition and pitiful of Hakoda's situation. Nevertheless, with sorrow, he told Sokka that the most likely place Hakoda was taken to was Boiling Rock. When Sokka asked where the Boiling Rock was, Zuko was curious as to why he needed to know and what he was planning at first, but soon divulged the answer. When Sokka tried to sneak away on Appa to save Hakoda, Zuko caught him red-handed."
    },
    {
      "body": "Sokka stated how the invasion plan was his idea and that it was his decision to stay when things were going wrong because it was his job to fix his mistake and regain his honor. Zuko completely understood Sokka's condition and accompanied his friend on the mission to rescue Hakoda. After Sokka was commanded to escort ${link_0} into the cooler and told Zuko to meet him back in an hour where they were now, Zuko unhesitatingly took the trouble to find out whether war prisoners would be held at the Boiling Rock and was despairingly shocked when he found that there were no Water Tribe prisoners, which meant Hakoda was not held prisoner in the Boiling Rock. Later, the two boys overheard that some robbers, traitors, war prisoners, and a pirate would be brought into the Boiling Rock at dawn and were highly concerned that Hakoda was among the said war prisoners. When the boys and their party attempted to leave the Boiling Rock, Zuko reminded Sokka that rescuing Hakoda was his chance if he stayed at the Boiling Rock at dawn.",
      "links": [
        {
          "body": "Chit Sang",
          "key": "${link_0}",
          "target": {
            "href": "Chit_Sang",
            "page": "Chit_Sang"
          }
        }
      ],
      "text": "Sokka stated how the invasion plan was his idea and that it was his decision to stay when things were going wrong because it was his job to fix his mistake and regain his honor. Zuko completely understood Sokka's condition and accompanied his friend on the mission to rescue Hakoda. After Sokka was commanded to escort Chit Sang into the cooler and told Zuko to meet him back in an hour where they were now, Zuko unhesitatingly took the trouble to find out whether war prisoners would be held at the Boiling Rock and was despairingly shocked when he found that there were no Water Tribe prisoners, which meant Hakoda was not held prisoner in the Boiling Rock. Later, the two boys overheard that some robbers, traitors, war prisoners, and a pirate would be brought into the Boiling Rock at dawn and were highly concerned that Hakoda was among the said war prisoners. When the boys and their party attempted to leave the Boiling Rock, Zuko reminded Sokka that rescuing Hakoda was his chance if he stayed at the Boiling Rock at dawn."
    },
    {
      "body": "It was with Zuko's advice that Sokka decided to stay on the chance that Hakoda would show up. Suki would not leave without Sokka and Zuko was staying too, being concerned just as Suki was. When the prisoners did arrive, Zuko mistook Hakoda as a big burly man with shaggy long hair, a long beard, a nose ring, and a tattoo on his arm, only to be told that Hakoda did not have a nose ring. Hakoda was among the new arrivals to the Boiling Rock, though he was the only one of them who was a war prisoner. Hakoda himself knew of Zuko as Fire Lord Ozai's son. When Sokka mentioned to his father that Zuko was on the Boiling Rock, Hakoda at first saw it as a major problem. When told that Zuko had changed his ways and reformed from evil, Hakoda was skeptical at first, until Sokka admitted himself to having had the same reaction. He went on to say, though, that Zuko had proven himself trustworthy and that it was only with Zuko's aid that Hakoda had ever been found, winning Hakoda's trust for Zuko.",
      "links": [],
      "text": "It was with Zuko's advice that Sokka decided to stay on the chance that Hakoda would show up. Suki would not leave without Sokka and Zuko was staying too, being concerned just as Suki was. When the prisoners did arrive, Zuko mistook Hakoda as a big burly man with shaggy long hair, a long beard, a nose ring, and a tattoo on his arm, only to be told that Hakoda did not have a nose ring. Hakoda was among the new arrivals to the Boiling Rock, though he was the only one of them who was a war prisoner. Hakoda himself knew of Zuko as Fire Lord Ozai's son. When Sokka mentioned to his father that Zuko was on the Boiling Rock, Hakoda at first saw it as a major problem. When told that Zuko had changed his ways and reformed from evil, Hakoda was skeptical at first, until Sokka admitted himself to having had the same reaction. He went on to say, though, that Zuko had proven himself trustworthy and that it was only with Zuko's aid that Hakoda had ever been found, winning Hakoda's trust for Zuko."
    },
    {
      "body": "When carrying out their escape plan, Zuko almost sacrificed himself trying to save Hakoda and their companions by stopping at the end of the platform while the rest boarded the ${link_0} and pushing down the lever so that the gondola slowly moved off. This left behind Zuko who successfully broke the lever before running toward the departing gondola. Zuko flew over the railings with fireballs being launched at him by the guards below. Sokka caught Zuko who had made sure the Boiling Rock guards could not stop the gondola, at the risk of his own life. When Azula and her airships attacked the Western Air Temple, Zuko was wholeheartedly prepared to hold off his sister and her men, by means of giving his friends, including Hakoda, enough time to escape. After the end of the War, Hakoda came to the ${link_1} for Zuko's coronation.",
      "links": [
        {
          "body": "gondola",
          "key": "${link_0}",
          "target": {
            "href": "Gondola",
            "page": "Gondola"
          }
        },
        {
          "body": "Fire Nation Capital",
          "key": "${link_1}",
          "target": {
            "href": "Fire_Nation_Capital",
            "page": "Fire_Nation_Capital"
          }
        }
      ],
      "text": "When carrying out their escape plan, Zuko almost sacrificed himself trying to save Hakoda and their companions by stopping at the end of the platform while the rest boarded the gondola and pushing down the lever so that the gondola slowly moved off. This left behind Zuko who successfully broke the lever before running toward the departing gondola. Zuko flew over the railings with fireballs being launched at him by the guards below. Sokka caught Zuko who had made sure the Boiling Rock guards could not stop the gondola, at the risk of his own life. When Azula and her airships attacked the Western Air Temple, Zuko was wholeheartedly prepared to hold off his sister and her men, by means of giving his friends, including Hakoda, enough time to escape. After the end of the War, Hakoda came to the Fire Nation Capital for Zuko's coronation."
    },
    {
      "body": "${link_0} was eventually able to forgive ${link_1}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        }
      ],
      "text": "Katara was eventually able to forgive Zuko."
    },
    {
      "body": "Katara was a ${link_0} of the ${link_1}, Aang's close friend and staunch defender, and thus, by association, was an enemy of Zuko.",
      "links": [
        {
          "body": "waterbender",
          "key": "${link_0}",
          "target": {
            "href": "Waterbending",
            "page": "Waterbending"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "href": "Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        }
      ],
      "text": "Katara was a waterbender of the Southern Water Tribe, Aang's close friend and staunch defender, and thus, by association, was an enemy of Zuko."
    },
    {
      "body": "The only trace of the Avatar and his companions that Zuko found on an ${link_0} that they helped liberate was ${link_1}, lost in the commotion. After capturing Katara with the assistance of a band of pirates, Zuko attempted to use the necklace as a bribe to get Katara to betray Aang's whereabouts, but she refused. Later, Zuko employed the bounty hunter, ${link_2}, and her ${link_3}, a tracking beast with a hypersensitive olfactory system, and used the necklace to track Katara, thus tracking Aang by proxy. However, once Zuko found him, the necklace was reclaimed by Aang and returned to Katara. June teased Zuko about finding his girlfriend who had run away and after seeing Katara, stated that it was no wonder she dumped him as she was \"too pretty for [him]\".",
      "links": [
        {
          "body": "earthbender prison rig",
          "key": "${link_0}",
          "target": {
            "href": "Prison_rig",
            "page": "Prison_rig"
          }
        },
        {
          "body": "Katara's tribal necklace",
          "key": "${link_1}",
          "target": {
            "href": "Katara%27s_necklace",
            "page": "Katara%27s_necklace"
          }
        },
        {
          "body": "June",
          "key": "${link_2}",
          "target": {
            "href": "June",
            "page": "June"
          }
        },
        {
          "body": "shirshu",
          "key": "${link_3}",
          "target": {
            "href": "Shirshu",
            "page": "Shirshu"
          }
        }
      ],
      "text": "The only trace of the Avatar and his companions that Zuko found on an earthbender prison rig that they helped liberate was Katara's tribal necklace, lost in the commotion. After capturing Katara with the assistance of a band of pirates, Zuko attempted to use the necklace as a bribe to get Katara to betray Aang's whereabouts, but she refused. Later, Zuko employed the bounty hunter, June, and her shirshu, a tracking beast with a hypersensitive olfactory system, and used the necklace to track Katara, thus tracking Aang by proxy. However, once Zuko found him, the necklace was reclaimed by Aang and returned to Katara. June teased Zuko about finding his girlfriend who had run away and after seeing Katara, stated that it was no wonder she dumped him as she was \"too pretty for [him]\"."
    },
    {
      "body": "During the Siege of the North, after Zuko had made his way into the ${link_0} of the Northern Water Tribe, Katara was the only thing keeping him from abducting Aang, who was in meditative fugue as he tried to solicit help from the spirits to defeat Zhao's fleet attacking the North Pole. Due to having previously been trained by ${link_1}, a waterbending master, and with her bending at its most powerful during the waxing gibbous moon due to waterbending's lunar sympathy, Katara was more than a match for Zuko and initially subdued him. However, when the sun rose, lessening her power and increasing his, he overpowered her, knocked her out, and escaped with Aang. Later, when Katara, Sokka, and ${link_2} ${link_3} came to Aang's rescue, Katara knocked Zuko unconscious and wanted to leave him in a snowstorm.",
      "links": [
        {
          "body": "Spirit Oasis",
          "key": "${link_0}",
          "target": {
            "href": "Spirit_Oasis",
            "page": "Spirit_Oasis"
          }
        },
        {
          "body": "Pakku",
          "key": "${link_1}",
          "target": {
            "href": "Pakku",
            "page": "Pakku"
          }
        },
        {
          "body": "Princess",
          "key": "${link_2}",
          "target": {
            "href": "Tribal_Princess",
            "page": "Tribal_Princess"
          }
        },
        {
          "body": "Yue",
          "key": "${link_3}",
          "target": {
            "href": "Yue",
            "page": "Yue"
          }
        }
      ],
      "text": "During the Siege of the North, after Zuko had made his way into the Spirit Oasis of the Northern Water Tribe, Katara was the only thing keeping him from abducting Aang, who was in meditative fugue as he tried to solicit help from the spirits to defeat Zhao's fleet attacking the North Pole. Due to having previously been trained by Pakku, a waterbending master, and with her bending at its most powerful during the waxing gibbous moon due to waterbending's lunar sympathy, Katara was more than a match for Zuko and initially subdued him. However, when the sun rose, lessening her power and increasing his, he overpowered her, knocked her out, and escaped with Aang. Later, when Katara, Sokka, and Princess Yue came to Aang's rescue, Katara knocked Zuko unconscious and wanted to leave him in a snowstorm."
    },
    {
      "body": "Katara, along with ${link_0}, Sokka, and Aang, attacked Princess Azula in unison with Zuko at ${link_1}. Once Azula had disappeared, Katara tried to tell Zuko that she could assist the injured Iroh with her ${link_2} abilities, but ran off with her companions when Zuko violently demanded that they leave him and his uncle alone.",
      "links": [
        {
          "body": "Toph",
          "key": "${link_0}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Tu Zin",
          "key": "${link_1}",
          "target": {
            "href": "Tu_Zin",
            "page": "Tu_Zin"
          }
        },
        {
          "body": "healing",
          "key": "${link_2}",
          "target": {
            "href": "Healing",
            "page": "Healing"
          }
        }
      ],
      "text": "Katara, along with Toph, Sokka, and Aang, attacked Princess Azula in unison with Zuko at Tu Zin. Once Azula had disappeared, Katara tried to tell Zuko that she could assist the injured Iroh with her healing abilities, but ran off with her companions when Zuko violently demanded that they leave him and his uncle alone."
    },
    {
      "body": "He and Katara were imprisoned in a crystal cave below the ${link_0}. Katara initially yelled at Zuko, blaming him for the Fire Nation starting the War. Zuko seemed empathetic after Katara said that the War took away her ${link_1}, remarking that the actions of the Fire Nation had also taken his mother, Ursa. He also told Katara that he once thought his scar set him apart and made him different, but now believed he no longer needed it to determine his destiny. Katara offered to heal his scar with water from the Spirit Oasis. Before any action could be taken, Iroh and Aang broke them out of the prison. Despite the sympathy each showed the other, Zuko joined Azula in trying to capture the Avatar soon afterward, and the siblings battled both Katara and Aang, marking a betrayal that made Katara bitter toward him.",
      "links": [
        {
          "body": "Earth King's palace",
          "key": "${link_0}",
          "target": {
            "href": "Earth_Kingdom_Royal_Palace",
            "page": "Earth_Kingdom_Royal_Palace"
          }
        },
        {
          "body": "mother",
          "key": "${link_1}",
          "target": {
            "href": "Kya_(nonbender)",
            "page": "Kya_(nonbender)"
          }
        }
      ],
      "text": "He and Katara were imprisoned in a crystal cave below the Earth King's palace. Katara initially yelled at Zuko, blaming him for the Fire Nation starting the War. Zuko seemed empathetic after Katara said that the War took away her mother, remarking that the actions of the Fire Nation had also taken his mother, Ursa. He also told Katara that he once thought his scar set him apart and made him different, but now believed he no longer needed it to determine his destiny. Katara offered to heal his scar with water from the Spirit Oasis. Before any action could be taken, Iroh and Aang broke them out of the prison. Despite the sympathy each showed the other, Zuko joined Azula in trying to capture the Avatar soon afterward, and the siblings battled both Katara and Aang, marking a betrayal that made Katara bitter toward him."
    },
    {
      "body": "${link_0} offered to heal ${link_1}'s scar while they were in the ${link_2} of ${link_3}.",
      "links": [
        {
          "body": "Katara",
          "key": "${link_0}",
          "target": {
            "href": "Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Crystal Catacombs",
          "key": "${link_2}",
          "target": {
            "href": "Crystal_Catacombs",
            "page": "Crystal_Catacombs"
          }
        },
        {
          "body": "Ba Sing Se",
          "key": "${link_3}",
          "target": {
            "href": "Ba_Sing_Se",
            "page": "Ba_Sing_Se"
          }
        }
      ],
      "text": "Katara offered to heal Zuko's scar while they were in the Crystal Catacombs of Ba Sing Se."
    },
    {
      "body": "Zuko remembered Katara's offer to heal his scar using the sacred water from the Northern Tribe's spirit oasis. He suspected that Katara used the special water to save Aang and deduced that the Avatar could still be alive, despite being struck by a fatal lightning bolt. However, he chose to hide this information from his sister.",
      "links": [],
      "text": "Zuko remembered Katara's offer to heal his scar using the sacred water from the Northern Tribe's spirit oasis. He suspected that Katara used the special water to save Aang and deduced that the Avatar could still be alive, despite being struck by a fatal lightning bolt. However, he chose to hide this information from his sister."
    },
    {
      "body": "Katara was the most unforgiving one of the group when Zuko asked to join. Later, privately, Katara threatened Zuko, telling him that he if so much as made one glance at his dark side, one step out of line, or gave her one reason to think he may hurt Aang, she would personally kill him.",
      "links": [],
      "text": "Katara was the most unforgiving one of the group when Zuko asked to join. Later, privately, Katara threatened Zuko, telling him that he if so much as made one glance at his dark side, one step out of line, or gave her one reason to think he may hurt Aang, she would personally kill him."
    },
    {
      "body": "Zuko eventually confronted Katara on why she did not trust him. Katara yelled at Zuko, saying that she was the first person to trust him and he betrayed her. After Sokka told him about the Southern Raiders who killed their mother, Zuko realized who they were. He later told Katara that he knew the ${link_0} responsible for the murder, a man by the name of Yon Rha, and they set out together to track him down.",
      "links": [
        {
          "body": "soldier",
          "key": "${link_0}",
          "target": {
            "href": "Yon_Rha",
            "page": "Yon_Rha"
          }
        }
      ],
      "text": "Zuko eventually confronted Katara on why she did not trust him. Katara yelled at Zuko, saying that she was the first person to trust him and he betrayed her. After Sokka told him about the Southern Raiders who killed their mother, Zuko realized who they were. He later told Katara that he knew the soldier responsible for the murder, a man by the name of Yon Rha, and they set out together to track him down."
    },
    {
      "body": "Despite the lingering animosity, Katara and Zuko were able to work well together in tracking down the soldier, and when they did, Zuko forced the soldier to remember her face. Katara almost killed Yon Rha but ultimately stopped herself. Upon returning to the campsite, Katara finally forgave Zuko and hugged him warmly, admitting that while she would never be able to forgive Yon Rha, she did forgive Zuko.",
      "links": [],
      "text": "Despite the lingering animosity, Katara and Zuko were able to work well together in tracking down the soldier, and when they did, Zuko forced the soldier to remember her face. Katara almost killed Yon Rha but ultimately stopped herself. Upon returning to the campsite, Katara finally forgave Zuko and hugged him warmly, admitting that while she would never be able to forgive Yon Rha, she did forgive Zuko."
    },
    {
      "body": "Zuko and Katara got along a lot better after their adventure. In the ${link_0} they watched on Ember Island, their theatrical counterparts displayed a romantic interest in each other. Slightly disturbed and embarrassed, Katara and Zuko slid away from each other in their seats. When June later referred to Katara as Zuko's girlfriend, they both quickly denied it, angered and embarrassed. Before the arrival of Sozin's Comet, Zuko helped Katara in tracking down Aang, who had disappeared when he had ventured to the ${link_1} island in a trance. Before Zuko faced his uncle, Katara assured him that Iroh would forgive his past wrongs. When Zuko realized he had to defeat Azula and take his rightful place as Fire Lord, he asked Katara to help him, something she gladly agreed to do. When they arrived, Zuko told Katara to stand back, not willing to get her injured. When Azula attempted to kill Katara with a lightning bolt, Zuko threw himself in the lightning's path. However, since he no longer had the proper stance, he could not redirect all of the lightning and was badly wounded. After Katara defeated Azula, she healed Zuko. When he thanked her, Katara said she was the one who should be thanking him.",
      "links": [
        {
          "body": "play",
          "key": "${link_0}",
          "target": {
            "href": "The_Boy_in_the_Iceberg_(play)",
            "page": "The_Boy_in_the_Iceberg_(play)"
          }
        },
        {
          "body": "lion turtle",
          "key": "${link_1}",
          "target": {
            "href": "Lion_turtle#Era_of_the_Avatar",
            "page": "Lion_turtle"
          }
        }
      ],
      "text": "Zuko and Katara got along a lot better after their adventure. In the play they watched on Ember Island, their theatrical counterparts displayed a romantic interest in each other. Slightly disturbed and embarrassed, Katara and Zuko slid away from each other in their seats. When June later referred to Katara as Zuko's girlfriend, they both quickly denied it, angered and embarrassed. Before the arrival of Sozin's Comet, Zuko helped Katara in tracking down Aang, who had disappeared when he had ventured to the lion turtle island in a trance. Before Zuko faced his uncle, Katara assured him that Iroh would forgive his past wrongs. When Zuko realized he had to defeat Azula and take his rightful place as Fire Lord, he asked Katara to help him, something she gladly agreed to do. When they arrived, Zuko told Katara to stand back, not willing to get her injured. When Azula attempted to kill Katara with a lightning bolt, Zuko threw himself in the lightning's path. However, since he no longer had the proper stance, he could not redirect all of the lightning and was badly wounded. After Katara defeated Azula, she healed Zuko. When he thanked her, Katara said she was the one who should be thanking him."
    },
    {
      "body": "The two remained friends after the battle, and they celebrated the War's end in Ba Sing Se along with the rest of Team Avatar.",
      "links": [],
      "text": "The two remained friends after the battle, and they celebrated the War's end in Ba Sing Se along with the rest of Team Avatar."
    },
    {
      "body": "Their friendship suffered another strain when Zuko restrained Katara after she protected Aang from Zuko's guards at ${link_0}, hurting her in the process. Regardless, it was Katara who suggested a meeting with the Earth King to ease tensions between Zuko and Aang.",
      "links": [
        {
          "body": "Yu Dao",
          "key": "${link_0}",
          "target": {
            "href": "Yu_Dao",
            "page": "Yu_Dao"
          }
        }
      ],
      "text": "Their friendship suffered another strain when Zuko restrained Katara after she protected Aang from Zuko's guards at Yu Dao, hurting her in the process. Regardless, it was Katara who suggested a meeting with the Earth King to ease tensions between Zuko and Aang."
    },
    {
      "body": "Zuko was glad to serve as ${link_0}'s advisor, just as he had done years prior for ${link_1}.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Aang",
          "key": "${link_1}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Zuko was glad to serve as Korra's advisor, just as he had done years prior for Aang."
    },
    {
      "body": "Zuko is on friendly terms with Avatar ${link_0} and helped ${link_1}, ${link_2}, and ${link_3} rescue her from the Red Lotus when she was five years old. After reacquainting with her thirteen years later at the ${link_4}, Zuko was happy to resume his role as the Avatar's advisor when he was asked for help by Korra. Since she could no longer contact Aang, she deemed Zuko, as Aang's best friend, to be the best placed person to tell her what her predecessor would have done in her situation. He relayed the fact that Aang knew better than anyone that in times of turmoil, the world needed its Avatar the most.",
      "links": [
        {
          "body": "Korra",
          "key": "${link_0}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "Tenzin",
          "key": "${link_1}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_2}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_3}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "Misty Palms Oasis",
          "key": "${link_4}",
          "target": {
            "href": "Misty_Palms_Oasis",
            "page": "Misty_Palms_Oasis"
          }
        }
      ],
      "text": "Zuko is on friendly terms with Avatar Korra and helped Tenzin, Tonraq, and Sokka rescue her from the Red Lotus when she was five years old. After reacquainting with her thirteen years later at the Misty Palms Oasis, Zuko was happy to resume his role as the Avatar's advisor when he was asked for help by Korra. Since she could no longer contact Aang, she deemed Zuko, as Aang's best friend, to be the best placed person to tell her what her predecessor would have done in her situation. He relayed the fact that Aang knew better than anyone that in times of turmoil, the world needed its Avatar the most."
    },
    {
      "body": "While Momo was Zuko's enemy for quite a while, being affiliated with Team Avatar, he quickly warmed up to Zuko when the prince underwent a change of heart and expressed his desire to join the group. He was shown to be sad after Zuko left when the group rejected him. During one of Aang's firebending lessons, Momo hid himself behind Zuko for protection, which might have implied that he trusted him just like everyone else did.",
      "links": [],
      "text": "While Momo was Zuko's enemy for quite a while, being affiliated with Team Avatar, he quickly warmed up to Zuko when the prince underwent a change of heart and expressed his desire to join the group. He was shown to be sad after Zuko left when the group rejected him. During one of Aang's firebending lessons, Momo hid himself behind Zuko for protection, which might have implied that he trusted him just like everyone else did."
    },
    {
      "body": "${link_0} worked with ${link_1} to ${link_2} from the ${link_3}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_1}",
          "target": {
            "href": "Sokka",
            "page": "Sokka"
          }
        },
        {
          "body": "escape",
          "key": "${link_2}",
          "target": {
            "href": "Escape_from_the_Boiling_Rock",
            "page": "Escape_from_the_Boiling_Rock"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_3}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        }
      ],
      "text": "Zuko worked with Sokka to escape from the Boiling Rock."
    },
    {
      "body": "Zuko and Sokka never had much social interaction with each other at first. Their first encounter was a brief face-off against each other at the Southern Water Tribe, during which Zuko attacked his village while Sokka zealously defended it. Zuko was the clear winner, despite Sokka's persistence. They met in other battles after that, mostly as foes, with one exception being when Zuko teamed up with Sokka and the rest of the group against Azula at a Tu Zin. Other than that, Sokka had constantly been opposed to assisting Zuko whenever Aang suggested it, clearly indicating how little Sokka trusted him.",
      "links": [],
      "text": "Zuko and Sokka never had much social interaction with each other at first. Their first encounter was a brief face-off against each other at the Southern Water Tribe, during which Zuko attacked his village while Sokka zealously defended it. Zuko was the clear winner, despite Sokka's persistence. They met in other battles after that, mostly as foes, with one exception being when Zuko teamed up with Sokka and the rest of the group against Azula at a Tu Zin. Other than that, Sokka had constantly been opposed to assisting Zuko whenever Aang suggested it, clearly indicating how little Sokka trusted him."
    },
    {
      "body": "During the invasion of the Fire Nation, Zuko and Sokka were paralleled for the first time. Zuko learned that his mother may still be alive and Sokka learned that Suki was imprisoned by Azula. These discoveries occurred at the same time and garnered similar reactions.",
      "links": [],
      "text": "During the invasion of the Fire Nation, Zuko and Sokka were paralleled for the first time. Zuko learned that his mother may still be alive and Sokka learned that Suki was imprisoned by Azula. These discoveries occurred at the same time and garnered similar reactions."
    },
    {
      "body": "The two were properly introduced at the Western Air Temple. Sokka still did not trust Zuko after their history, even going so far as hypothesizing that Zuko covered himself in honey to get Appa to lick him, a sign of affection from the bison. Despite his distrust of Zuko, Sokka did trust Aang and conceded to let Zuko join the group when Aang felt it was the best course of action. Later, Sokka showed Zuko to his room. Sokka was a bit uncomfortable, but Zuko smiled at him, implying he had no hostility toward the other. Sokka remarked to Aang that escorting his former enemy was \"really weird\". Later, Sokka was much more comfortable in tormenting Zuko, going so far as to taunt him and make sarcastic remarks, like asking if he could watch him and Aang practice \"jerkbending\" and literally prodding Zuko with his ${link_0} ${link_1}, trying to frustrate him enough to get his firebending back. Although he taunted Zuko, it appeared to be in a joking manner instead of a sign of true hostility unlike his sister.",
      "links": [
        {
          "body": "meteor",
          "key": "${link_0}",
          "target": {
            "href": "Meteor",
            "page": "Meteor"
          }
        },
        {
          "body": "sword",
          "key": "${link_1}",
          "target": {
            "href": "Sokka%27s_sword",
            "page": "Sokka%27s_sword"
          }
        }
      ],
      "text": "The two were properly introduced at the Western Air Temple. Sokka still did not trust Zuko after their history, even going so far as hypothesizing that Zuko covered himself in honey to get Appa to lick him, a sign of affection from the bison. Despite his distrust of Zuko, Sokka did trust Aang and conceded to let Zuko join the group when Aang felt it was the best course of action. Later, Sokka showed Zuko to his room. Sokka was a bit uncomfortable, but Zuko smiled at him, implying he had no hostility toward the other. Sokka remarked to Aang that escorting his former enemy was \"really weird\". Later, Sokka was much more comfortable in tormenting Zuko, going so far as to taunt him and make sarcastic remarks, like asking if he could watch him and Aang practice \"jerkbending\" and literally prodding Zuko with his meteor sword, trying to frustrate him enough to get his firebending back. Although he taunted Zuko, it appeared to be in a joking manner instead of a sign of true hostility unlike his sister."
    },
    {
      "body": "Sokka came to trust Zuko even more during their adventure on the Boiling Rock, that served as a bonding point for the two, as Zuko and Sokka alone attempted to rescue the invasion forces from the prison. During the journey, Sokka stated that he believed Iroh was proud of Zuko and commended him for making the decision to leave everything for which he had worked so hard to help Aang. The two also conversed regarding their respective romances. While speaking with his father, Sokka stated that while he was distrusting of Zuko at first, he had proven himself on multiple occasions and was very trustworthy. The two were shown to be able to work together quite well; Zuko, the superior fighter of the two, often failed to think things through, like when, while keeping lookout for Sokka as he visited Suki's cell, he was questioned by one of the guards and immediately resorted to attacking the guard, which led to his capture. Sokka, on the other hand, may have had less fighting ability but was an excellent strategist and kept a clear head in tense situations. Sokka often depended on Zuko to execute his plans in the Boiling Rock, such as when Zuko started a fight with Chit Sang, unscrewed the cooler, and jammed the gondola's controls. Later, Sokka and Zuko fought Azula on top of the gondola: Zuko defended Sokka and deflected Azula's attacks while Sokka struck at Azula with his sword.",
      "links": [],
      "text": "Sokka came to trust Zuko even more during their adventure on the Boiling Rock, that served as a bonding point for the two, as Zuko and Sokka alone attempted to rescue the invasion forces from the prison. During the journey, Sokka stated that he believed Iroh was proud of Zuko and commended him for making the decision to leave everything for which he had worked so hard to help Aang. The two also conversed regarding their respective romances. While speaking with his father, Sokka stated that while he was distrusting of Zuko at first, he had proven himself on multiple occasions and was very trustworthy. The two were shown to be able to work together quite well; Zuko, the superior fighter of the two, often failed to think things through, like when, while keeping lookout for Sokka as he visited Suki's cell, he was questioned by one of the guards and immediately resorted to attacking the guard, which led to his capture. Sokka, on the other hand, may have had less fighting ability but was an excellent strategist and kept a clear head in tense situations. Sokka often depended on Zuko to execute his plans in the Boiling Rock, such as when Zuko started a fight with Chit Sang, unscrewed the cooler, and jammed the gondola's controls. Later, Sokka and Zuko fought Azula on top of the gondola: Zuko defended Sokka and deflected Azula's attacks while Sokka struck at Azula with his sword."
    },
    {
      "body": "Following the events on the Boiling Rock their relationship was in much better shape than it ever had been. After escaping Azula's attack on the Western Air Temple, Sokka toasted Zuko as the group's hero for helping hold off the Fire Nation airships and Azula. Later Zuko asked Sokka about his mother's death. Despite Sokka's obvious discomfort with the subject, he trusted Zuko enough to tell him the story. This information in turn helped Zuko to make amends with Katara, who still hated him at the time.",
      "links": [],
      "text": "Following the events on the Boiling Rock their relationship was in much better shape than it ever had been. After escaping Azula's attack on the Western Air Temple, Sokka toasted Zuko as the group's hero for helping hold off the Fire Nation airships and Azula. Later Zuko asked Sokka about his mother's death. Despite Sokka's obvious discomfort with the subject, he trusted Zuko enough to tell him the story. This information in turn helped Zuko to make amends with Katara, who still hated him at the time."
    },
    {
      "body": "When the War ended, he and Sokka were still friends, as they were seen enjoying themselves at the tea house.",
      "links": [],
      "text": "When the War ended, he and Sokka were still friends, as they were seen enjoying themselves at the tea house."
    },
    {
      "body": "It should be noted that Zuko and Sokka shared some similarities that may have had some indirect impact on how they got along. Both were the eldest children in their respective families and both had younger sisters to whom they have felt inferior to at some point, Zuko having not excelled in firebending as quickly as Azula and not having the approval of his father, and Sokka not being a bender at all. Both had also lost their mothers and both were skilled at using some form of bladed weaponry. They were also the closest in age among the main children, aside from Aang and Toph.",
      "links": [],
      "text": "It should be noted that Zuko and Sokka shared some similarities that may have had some indirect impact on how they got along. Both were the eldest children in their respective families and both had younger sisters to whom they have felt inferior to at some point, Zuko having not excelled in firebending as quickly as Azula and not having the approval of his father, and Sokka not being a bender at all. Both had also lost their mothers and both were skilled at using some form of bladed weaponry. They were also the closest in age among the main children, aside from Aang and Toph."
    },
    {
      "body": "Zuko even looked to Sokka's sibling relationship with Katara as an example of how family should respect one another. Sokka remained Zuko's friend and ally many years after the War, and, along with ${link_0} and ${link_1}, helped him defeat and imprison ${link_2}, ${link_3}, ${link_4}, and ${link_5}.",
      "links": [
        {
          "body": "Tenzin",
          "key": "${link_0}",
          "target": {
            "href": "Tenzin",
            "page": "Tenzin"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_1}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Zaheer",
          "key": "${link_2}",
          "target": {
            "href": "Zaheer",
            "page": "Zaheer"
          }
        },
        {
          "body": "Ghazan",
          "key": "${link_3}",
          "target": {
            "href": "Ghazan",
            "page": "Ghazan"
          }
        },
        {
          "body": "Ming-Hua",
          "key": "${link_4}",
          "target": {
            "href": "Ming-Hua",
            "page": "Ming-Hua"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_5}",
          "target": {
            "href": "P%27Li",
            "page": "P%27Li"
          }
        }
      ],
      "text": "Zuko even looked to Sokka's sibling relationship with Katara as an example of how family should respect one another. Sokka remained Zuko's friend and ally many years after the War, and, along with Tenzin and Tonraq, helped him defeat and imprison Zaheer, Ghazan, Ming-Hua, and P'Li."
    },
    {
      "body": "${link_0} tried to distance himself from ${link_1}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Song",
          "key": "${link_1}",
          "target": {
            "href": "Song",
            "page": "Song"
          }
        }
      ],
      "text": "Zuko tried to distance himself from Song."
    },
    {
      "body": "${link_0} was the young herbalist who treated Iroh when he mistakenly brewed and consumed the poisonous ${link_1}. When seeing that Iroh and Zuko were travel-worn, she invited them to her home for a good meal and rest. Zuko initially declined, not wishing to become too familiar with the Earth Kingdom and its natives at the time. However, he was overridden by Iroh who accepted the warm invite. As the evening progressed, Song continued trying to reach out to Zuko, knowing that he suffered at the hands of a firebender — all attempts were met with distanced acknowledgment until she revealed the scar she received the day her father was taken from her in a raid by Fire Nation soldiers. It was at this moment Zuko appeared shocked, concerned and ashamed of his nation.",
      "links": [
        {
          "body": "Song",
          "key": "${link_0}",
          "target": {
            "href": "Song",
            "page": "Song"
          }
        },
        {
          "body": "white jade tea",
          "key": "${link_1}",
          "target": {
            "href": "White_jade_bush",
            "page": "White_jade_bush"
          }
        }
      ],
      "text": "Song was the young herbalist who treated Iroh when he mistakenly brewed and consumed the poisonous white jade tea. When seeing that Iroh and Zuko were travel-worn, she invited them to her home for a good meal and rest. Zuko initially declined, not wishing to become too familiar with the Earth Kingdom and its natives at the time. However, he was overridden by Iroh who accepted the warm invite. As the evening progressed, Song continued trying to reach out to Zuko, knowing that he suffered at the hands of a firebender — all attempts were met with distanced acknowledgment until she revealed the scar she received the day her father was taken from her in a raid by Fire Nation soldiers. It was at this moment Zuko appeared shocked, concerned and ashamed of his nation."
    },
    {
      "body": "Disturbed by his feelings over Song's suffering, he tried to leave immediately and stole Song's ${link_0}, despite Iroh's protests. Song witnessed the theft and closed the door silently, crushed and disappointed.",
      "links": [
        {
          "body": "ostrich horse",
          "key": "${link_0}",
          "target": {
            "href": "Ostrich_horse",
            "page": "Ostrich_horse"
          }
        }
      ],
      "text": "Disturbed by his feelings over Song's suffering, he tried to leave immediately and stole Song's ostrich horse, despite Iroh's protests. Song witnessed the theft and closed the door silently, crushed and disappointed."
    },
    {
      "body": "Although the relationship was not resolved, due to the fact that they do not encounter each other again, the impact Song left upon Zuko was considered to be the start of his exceptionally gradual journey toward redemption.",
      "links": [],
      "text": "Although the relationship was not resolved, due to the fact that they do not encounter each other again, the impact Song left upon Zuko was considered to be the start of his exceptionally gradual journey toward redemption."
    },
    {
      "body": "${link_0} and ${link_1} were able to successfully ${link_2} from the ${link_3}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Suki",
          "key": "${link_1}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "escape",
          "key": "${link_2}",
          "target": {
            "href": "Escape_from_the_Boiling_Rock",
            "page": "Escape_from_the_Boiling_Rock"
          }
        },
        {
          "body": "Boiling Rock",
          "key": "${link_3}",
          "target": {
            "href": "Boiling_Rock",
            "page": "Boiling_Rock"
          }
        }
      ],
      "text": "Zuko and Suki were able to successfully escape from the Boiling Rock."
    },
    {
      "body": "Zuko and ${link_0} unofficially met when Zuko attacked ${link_1} in an attempt to capture Aang. Suki and her team of warriors fought to stop Zuko's rampage as his firebending was destroying her village. They were hopelessly outmatched and eventually defeated by Zuko, but bought Aang and his friends the time they needed to escape, but not before Aang extinguished the flames with the help of the ${link_2}. Zuko's attack was part of the reason Suki left home to assist the Earth Kingdom in their war effort.",
      "links": [
        {
          "body": "Suki",
          "key": "${link_0}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        },
        {
          "body": "Kyoshi Island",
          "key": "${link_1}",
          "target": {
            "href": "Kyoshi_Island",
            "page": "Kyoshi_Island"
          }
        },
        {
          "body": "unagi",
          "key": "${link_2}",
          "target": {
            "href": "Unagi",
            "page": "Unagi"
          }
        }
      ],
      "text": "Zuko and Suki unofficially met when Zuko attacked Kyoshi Island in an attempt to capture Aang. Suki and her team of warriors fought to stop Zuko's rampage as his firebending was destroying her village. They were hopelessly outmatched and eventually defeated by Zuko, but bought Aang and his friends the time they needed to escape, but not before Aang extinguished the flames with the help of the unagi. Zuko's attack was part of the reason Suki left home to assist the Earth Kingdom in their war effort."
    },
    {
      "body": "Suki and Zuko finally met each other properly in prison. By this point, Suki had been imprisoned in the Boiling Rock by Azula and Zuko had reformed and joined the Avatar's gang. While they were serving hard time, Suki did not hesitate to remind Zuko about his attack on her village many months before. Zuko recalled this event and apologized for his wrongdoings. Despite the obvious animosity between the two, Suki cooperated with Zuko and Sokka in escaping the prison and freeing Sokka's father, Hakoda.",
      "links": [],
      "text": "Suki and Zuko finally met each other properly in prison. By this point, Suki had been imprisoned in the Boiling Rock by Azula and Zuko had reformed and joined the Avatar's gang. While they were serving hard time, Suki did not hesitate to remind Zuko about his attack on her village many months before. Zuko recalled this event and apologized for his wrongdoings. Despite the obvious animosity between the two, Suki cooperated with Zuko and Sokka in escaping the prison and freeing Sokka's father, Hakoda."
    },
    {
      "body": "After their successful escape and a brief humorous evening interaction outside Sokka's tent, Suki and Zuko were on much better terms. At the end of the War, she was seen hanging out with Zuko and the gang at Iroh's tea shop in Ba Sing Se.",
      "links": [],
      "text": "After their successful escape and a brief humorous evening interaction outside Sokka's tent, Suki and Zuko were on much better terms. At the end of the War, she was seen hanging out with Zuko and the gang at Iroh's tea shop in Ba Sing Se."
    },
    {
      "body": "Even as ${link_0}, ${link_1} trusted ${link_2}.",
      "links": [
        {
          "body": "Fire Lord",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Lord",
            "page": "Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_1}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Suki",
          "key": "${link_2}",
          "target": {
            "href": "Suki",
            "page": "Suki"
          }
        }
      ],
      "text": "Even as Fire Lord, Zuko trusted Suki."
    },
    {
      "body": "A year later, as the Harmony Restoration Movement crumbled and Zuko's life was threatened by numerous assassination attempts, Mai requested that Suki and the Kyoshi Warriors return to the Royal Palace to serve as his bodyguards, given their elite warrior status. Suki accepted and brought her team, including Ty Lee, to protect Zuko during the nighttime hours. Suki seemed especially concerned for Zuko's well-being, even as he tried to reassure her that he was okay in spite of his mounting stress.",
      "links": [],
      "text": "A year later, as the Harmony Restoration Movement crumbled and Zuko's life was threatened by numerous assassination attempts, Mai requested that Suki and the Kyoshi Warriors return to the Royal Palace to serve as his bodyguards, given their elite warrior status. Suki accepted and brought her team, including Ty Lee, to protect Zuko during the nighttime hours. Suki seemed especially concerned for Zuko's well-being, even as he tried to reassure her that he was okay in spite of his mounting stress."
    },
    {
      "body": "${link_0} and ${link_1} set out to find ${link_2} together.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Toph",
          "key": "${link_1}",
          "target": {
            "href": "Toph_Beifong",
            "page": "Toph_Beifong"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "href": "Aang",
            "page": "Aang"
          }
        }
      ],
      "text": "Zuko and Toph set out to find Aang together."
    },
    {
      "body": "Apart from Appa, Toph was probably the first and only one to trust Zuko after he proposed to join the group. Using her ${link_0}, she managed to sense Zuko's sincerity. Their lack of history, the fact that she understood Zuko's family life, and her relationship with Iroh could have also been factors. Zuko accidentally burned Toph's feet when she paid him a surprise visit in the middle of the night. She was reduced to crawling and feeling the vibrations of the earth through her hands. The attack was not on purpose however, as he did not realize it was her at the time. Afterward, he humbly apologized for attacking her and burning her feet, acknowledging that he must be careful when bending such a wild and dangerous element, which was the reason Aang decided he was a worthy teacher. She thus forgave him, stating that him joining would give her a chance to avenge her feet, albeit in a joking manner. When Zuko and Aang were unable to create fire, Toph did not make fun of Zuko like Katara and Sokka did. Instead, she advised them to find and relearn the original roots of firebending, upon which Zuko answered bitterly that the ${link_1} were all dead. During the play on Ember Island, Toph comforted him when the play reminded him of his horrible mistakes, and gave him a punch in the arm, stating it was how she showed affection.",
      "links": [
        {
          "body": "seismic sense",
          "key": "${link_0}",
          "target": {
            "href": "Seismic_sense",
            "page": "Seismic_sense"
          }
        },
        {
          "body": "original firebenders",
          "key": "${link_1}",
          "target": {
            "href": "Dragon",
            "page": "Dragon"
          }
        }
      ],
      "text": "Apart from Appa, Toph was probably the first and only one to trust Zuko after he proposed to join the group. Using her seismic sense, she managed to sense Zuko's sincerity. Their lack of history, the fact that she understood Zuko's family life, and her relationship with Iroh could have also been factors. Zuko accidentally burned Toph's feet when she paid him a surprise visit in the middle of the night. She was reduced to crawling and feeling the vibrations of the earth through her hands. The attack was not on purpose however, as he did not realize it was her at the time. Afterward, he humbly apologized for attacking her and burning her feet, acknowledging that he must be careful when bending such a wild and dangerous element, which was the reason Aang decided he was a worthy teacher. She thus forgave him, stating that him joining would give her a chance to avenge her feet, albeit in a joking manner. When Zuko and Aang were unable to create fire, Toph did not make fun of Zuko like Katara and Sokka did. Instead, she advised them to find and relearn the original roots of firebending, upon which Zuko answered bitterly that the original firebenders were all dead. During the play on Ember Island, Toph comforted him when the play reminded him of his horrible mistakes, and gave him a punch in the arm, stating it was how she showed affection."
    },
    {
      "body": "When Aang disappeared prior to the arrival of the comet, Toph hugged Zuko's arm and insisted that she joined Zuko during their search for him, stating it was her turn for a \"field trip\", in relation to how everybody else went on a life changing adventure with him, making Zuko blush at the sudden act. She and Zuko talked about their bad family relations and Toph expressed the lack of love she got from her parents. When Zuko shot her down due to their search, Toph was offended. However, they made up almost immediately and have remained friends.",
      "links": [],
      "text": "When Aang disappeared prior to the arrival of the comet, Toph hugged Zuko's arm and insisted that she joined Zuko during their search for him, stating it was her turn for a \"field trip\", in relation to how everybody else went on a life changing adventure with him, making Zuko blush at the sudden act. She and Zuko talked about their bad family relations and Toph expressed the lack of love she got from her parents. When Zuko shot her down due to their search, Toph was offended. However, they made up almost immediately and have remained friends."
    },
    {
      "body": "${link_0} and ${link_1}'s outlooks on life often differed.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Ty Lee",
          "key": "${link_1}",
          "target": {
            "href": "Ty_Lee",
            "page": "Ty_Lee"
          }
        }
      ],
      "text": "Zuko and Ty Lee's outlooks on life often differed."
    },
    {
      "body": "Zuko and Ty Lee were rarely shown interacting with one another, although Ty Lee seemed to consider Zuko as a friend. When the two were younger, Ty Lee willingly cooperated with Azula to play a prank on him and Mai to embarrass them both, revealing the extent of their friendship where she felt comfortable enough to tease him. When Zuko began to put his arm around Mai, asking \"You cold?\", Mai brushed him aside, and Ty Lee said, \"I'm freezing!\" When Zuko merely stated he would build a fire, Ty Lee seemed disappointed. Mai's remark about her needing to have \"ten boyfriends\" implied that she had a crush on almost every boy.",
      "links": [],
      "text": "Zuko and Ty Lee were rarely shown interacting with one another, although Ty Lee seemed to consider Zuko as a friend. When the two were younger, Ty Lee willingly cooperated with Azula to play a prank on him and Mai to embarrass them both, revealing the extent of their friendship where she felt comfortable enough to tease him. When Zuko began to put his arm around Mai, asking \"You cold?\", Mai brushed him aside, and Ty Lee said, \"I'm freezing!\" When Zuko merely stated he would build a fire, Ty Lee seemed disappointed. Mai's remark about her needing to have \"ten boyfriends\" implied that she had a crush on almost every boy."
    },
    {
      "body": "Ty Lee appeared upset when she and Azula left on the second gondola back to the Boiling Rock after their fight with Zuko, Sokka, and Suki, possibly sad for Zuko, as the two had left him to drown in the boiling lake. Afterward, when Azula confronted Mai, she struck Azula down, to save Mai and by doing so, Zuko.",
      "links": [],
      "text": "Ty Lee appeared upset when she and Azula left on the second gondola back to the Boiling Rock after their fight with Zuko, Sokka, and Suki, possibly sad for Zuko, as the two had left him to drown in the boiling lake. Afterward, when Azula confronted Mai, she struck Azula down, to save Mai and by doing so, Zuko."
    },
    {
      "body": "Ty Lee joined the Kyoshi Warriors after the Hundred Year War. In the following year, as Zuko's life was repeatedly threatened by various assassins from the Earth Kingdom and elsewhere, Ty Lee and the rest of the Kyoshi Warriors accepted Mai's request that they serve as Zuko's personal bodyguards in the Royal City. Ty Lee seemed more than happy to see Zuko again, and the Fire Lord in turn appreciated her contribution to his protection against the assassins",
      "links": [],
      "text": "Ty Lee joined the Kyoshi Warriors after the Hundred Year War. In the following year, as Zuko's life was repeatedly threatened by various assassins from the Earth Kingdom and elsewhere, Ty Lee and the rest of the Kyoshi Warriors accepted Mai's request that they serve as Zuko's personal bodyguards in the Royal City. Ty Lee seemed more than happy to see Zuko again, and the Fire Lord in turn appreciated her contribution to his protection against the assassins"
    },
    {
      "body": "Zuko and Kei Lo met during the uprising of the New Ozai Society. Although he was initially distrustful of the Society member, Kei Lo gained Zuko's trust when he freed the Fire Lord from his bonds, allowing him to save his family. As such, when Mai rounded on her boyfriend, Zuko came to his defence. However, Zuko's trust was superficial, as he immediately believed Kei Lo had betrayed them upon seeing him among the captured New Ozai Society rioters. It was only due to Mai's intervention that he agreed to release Kei Lo.",
      "links": [],
      "text": "Zuko and Kei Lo met during the uprising of the New Ozai Society. Although he was initially distrustful of the Society member, Kei Lo gained Zuko's trust when he freed the Fire Lord from his bonds, allowing him to save his family. As such, when Mai rounded on her boyfriend, Zuko came to his defence. However, Zuko's trust was superficial, as he immediately believed Kei Lo had betrayed them upon seeing him among the captured New Ozai Society rioters. It was only due to Mai's intervention that he agreed to release Kei Lo."
    },
    {
      "body": "${link_0} tried to stop ${link_1} in order to save ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Combustion Man",
          "key": "${link_1}",
          "target": {
            "href": "Combustion_Man",
            "page": "Combustion_Man"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_2}",
          "target": {
            "href": "Team_Avatar",
            "page": "Team_Avatar"
          }
        }
      ],
      "text": "Zuko tried to stop Combustion Man in order to save Team Avatar."
    },
    {
      "body": "Zuko hired Combustion Man to assassinate Aang. While attempting to join the group at the Western Air Temple, the prince accidentally let slip of that fact; he also revealed that the name \"Combustion Man\" by which the team referred to the assassin was not his real name, and denied Sokka's accusation that they were friends. Combustion Man tracked down the group at the Western Air Temple and was prepared to kill them. Zuko tried to get him to cease his attacks, first by telling him the deal was off and afterward by offering higher pay if he would halt, however, Combustion Man turned on Zuko and blasted him off the side of the building. Zuko clung onto a vine, just narrowly escaping death. Although his attempt to hinder the assassin's actions failed, it gave Sokka enough time to hit Combustion Man on his tattoo eye, thus blocking his ${link_0} and causing the assassin's subsequent attack to result in a fatal explosion.",
      "links": [
        {
          "body": "chi",
          "key": "${link_0}",
          "target": {
            "href": "Chi",
            "page": "Chi"
          }
        }
      ],
      "text": "Zuko hired Combustion Man to assassinate Aang. While attempting to join the group at the Western Air Temple, the prince accidentally let slip of that fact; he also revealed that the name \"Combustion Man\" by which the team referred to the assassin was not his real name, and denied Sokka's accusation that they were friends. Combustion Man tracked down the group at the Western Air Temple and was prepared to kill them. Zuko tried to get him to cease his attacks, first by telling him the deal was off and afterward by offering higher pay if he would halt, however, Combustion Man turned on Zuko and blasted him off the side of the building. Zuko clung onto a vine, just narrowly escaping death. Although his attempt to hinder the assassin's actions failed, it gave Sokka enough time to hit Combustion Man on his tattoo eye, thus blocking his chi and causing the assassin's subsequent attack to result in a fatal explosion."
    },
    {
      "body": "${link_0} dueled ${link_1} outside of the ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Jet",
          "key": "${link_1}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        },
        {
          "body": "Pao Family Tea House",
          "key": "${link_2}",
          "target": {
            "href": "Pao_Family_Tea_House",
            "page": "Pao_Family_Tea_House"
          }
        }
      ],
      "text": "Zuko dueled Jet outside of the Pao Family Tea House."
    },
    {
      "body": "Zuko first encountered ${link_0} when they were both traveling on the ${link_1} to Ba Sing Se. Jet approached Zuko after overhearing him complain about the quality of the food and suggested that Zuko assist him and his gang in stealing better food from the captain's stores. Zuko accepted this offer and they worked together very well to complete their mission and deliver food to all the ferry passengers. Jet later told Iroh and Zuko that he was going to Ba Sing Se to make amends for past deeds of which he was not proud. Iroh pointedly stated that he believed that people deserved second chances and could change their lives if they so desired, clearly meaning this as a message to Zuko. Zuko, however, appeared to be unaffected.",
      "links": [
        {
          "body": "Jet",
          "key": "${link_0}",
          "target": {
            "href": "Jet",
            "page": "Jet"
          }
        },
        {
          "body": "ferry",
          "key": "${link_1}",
          "target": {
            "href": "Earth_Kingdom_ferry",
            "page": "Earth_Kingdom_ferry"
          }
        }
      ],
      "text": "Zuko first encountered Jet when they were both traveling on the ferry to Ba Sing Se. Jet approached Zuko after overhearing him complain about the quality of the food and suggested that Zuko assist him and his gang in stealing better food from the captain's stores. Zuko accepted this offer and they worked together very well to complete their mission and deliver food to all the ferry passengers. Jet later told Iroh and Zuko that he was going to Ba Sing Se to make amends for past deeds of which he was not proud. Iroh pointedly stated that he believed that people deserved second chances and could change their lives if they so desired, clearly meaning this as a message to Zuko. Zuko, however, appeared to be unaffected."
    },
    {
      "body": "Upon arrival in Ba Sing Se, Jet watched Zuko and Iroh from afar, and told ${link_0} and ${link_1} that he thought \"Lee\", which was Zuko's chosen alias, would make a good ${link_2}. While the others insisted that they barely even knew him, Jet retorted, taking note that Lee did not get his scar from a waterbender. Later on, he approached Zuko and asked him to join his group. Zuko rebuffed him, and Jet seemed disappointed. However, out of the corner of his eye, he noticed Iroh's formerly cold tea was suddenly hot and he quickly gathered that Zuko and Iroh were firebenders. From that point on, he resolved to gather evidence against them, and turn them into the authorities.",
      "links": [
        {
          "body": "Smellerbee",
          "key": "${link_0}",
          "target": {
            "href": "Smellerbee",
            "page": "Smellerbee"
          }
        },
        {
          "body": "Longshot",
          "key": "${link_1}",
          "target": {
            "href": "Longshot",
            "page": "Longshot"
          }
        },
        {
          "body": "Freedom Fighter",
          "key": "${link_2}",
          "target": {
            "href": "Freedom_Fighters",
            "page": "Freedom_Fighters"
          }
        }
      ],
      "text": "Upon arrival in Ba Sing Se, Jet watched Zuko and Iroh from afar, and told Smellerbee and Longshot that he thought \"Lee\", which was Zuko's chosen alias, would make a good Freedom Fighter. While the others insisted that they barely even knew him, Jet retorted, taking note that Lee did not get his scar from a waterbender. Later on, he approached Zuko and asked him to join his group. Zuko rebuffed him, and Jet seemed disappointed. However, out of the corner of his eye, he noticed Iroh's formerly cold tea was suddenly hot and he quickly gathered that Zuko and Iroh were firebenders. From that point on, he resolved to gather evidence against them, and turn them into the authorities."
    },
    {
      "body": "Jet spied on Zuko and Iroh, trying to find proof that they were firebenders. He followed them in the city, and to their new jobs in the tea shop. Smellerbee objected to this action, saying that Jet had no real proof that the two were firebenders and that even if they were, there was nothing they could do. Jet, however, pressed on with his investigation. He sneaked into their apartment and stole their spark rocks, a move that he hoped would force one of them to firebend. This plan was foiled, however, when Iroh simply borrowed spark rocks from his neighbor. Later on, Jet argued with Longshot and Smellerbee over the issue outside the tea shop. Jet reminded them of how the Fire Nation left them homeless, and why it was so important to fight them.",
      "links": [],
      "text": "Jet spied on Zuko and Iroh, trying to find proof that they were firebenders. He followed them in the city, and to their new jobs in the tea shop. Smellerbee objected to this action, saying that Jet had no real proof that the two were firebenders and that even if they were, there was nothing they could do. Jet, however, pressed on with his investigation. He sneaked into their apartment and stole their spark rocks, a move that he hoped would force one of them to firebend. This plan was foiled, however, when Iroh simply borrowed spark rocks from his neighbor. Later on, Jet argued with Longshot and Smellerbee over the issue outside the tea shop. Jet reminded them of how the Fire Nation left them homeless, and why it was so important to fight them."
    },
    {
      "body": "Finally, tired of waiting, Jet burst into the shop, his hooked swords drawn, proclaiming Zuko and Iroh to be firebenders. While the police officers in the shop tried to calm him, Jet insisted that the two waiters be arrested. When Jet walked threateningly toward Iroh, Zuko grabbed a pair of swords from an officer and the two began to fight. The fight carried them outside the shop and into the street, with Jet trying to goad Zuko into firebending the entire time. The fight was broken up by the Dai Li, who arrested Jet based on the words of Iroh, the shop owner, and the soldiers who saw the fight.",
      "links": [],
      "text": "Finally, tired of waiting, Jet burst into the shop, his hooked swords drawn, proclaiming Zuko and Iroh to be firebenders. While the police officers in the shop tried to calm him, Jet insisted that the two waiters be arrested. When Jet walked threateningly toward Iroh, Zuko grabbed a pair of swords from an officer and the two began to fight. The fight carried them outside the shop and into the street, with Jet trying to goad Zuko into firebending the entire time. The fight was broken up by the Dai Li, who arrested Jet based on the words of Iroh, the shop owner, and the soldiers who saw the fight."
    },
    {
      "body": "Zuko was unaware that he would never see Jet again, as the young warrior was killed under ${link_0} by ${link_1} while fighting the Dai Li.",
      "links": [
        {
          "body": "Lake Laogai",
          "key": "${link_0}",
          "target": {
            "href": "Lake_Laogai",
            "page": "Lake_Laogai"
          }
        },
        {
          "body": "Long Feng",
          "key": "${link_1}",
          "target": {
            "href": "Long_Feng",
            "page": "Long_Feng"
          }
        }
      ],
      "text": "Zuko was unaware that he would never see Jet again, as the young warrior was killed under Lake Laogai by Long Feng while fighting the Dai Li."
    },
    {
      "body": "Zuko watched a play about the Avatar on Ember Island. When he saw the segment about Jet's death, he was shocked, and asked Sokka \"Did Jet just ... die?\" to which Sokka replied that it was \"really unclear\".",
      "links": [],
      "text": "Zuko watched a play about the Avatar on Ember Island. When he saw the segment about Jet's death, he was shocked, and asked Sokka \"Did Jet just ... die?\" to which Sokka replied that it was \"really unclear\"."
    },
    {
      "body": "Lord ${link_0}, along with ${link_1} and ${link_2}, were in the North Pole to stop the attempted prison break of ${link_3}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Tonraq",
          "key": "${link_1}",
          "target": {
            "href": "Tonraq",
            "page": "Tonraq"
          }
        },
        {
          "body": "Desna and Eska",
          "key": "${link_2}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        },
        {
          "body": "P'Li",
          "key": "${link_3}",
          "target": {
            "href": "P%27Li",
            "page": "P%27Li"
          }
        }
      ],
      "text": "Lord Zuko, along with Tonraq and Desna and Eska, were in the North Pole to stop the attempted prison break of P'Li."
    },
    {
      "body": "The Red Lotus consists of four powerful criminals who were incarcerated for thirteen years following a failed attempt to kidnap ${link_0} ${link_1}. The group would have been successful in the kidnapping had it not been for the efforts of Zuko, Sokka, Tonraq, and Tenzin, who defeated the criminals and imprisoned them in facilities designed to impair their abilities. Thirteen years later, Lord Zuko received information from a ${link_2} that Zaheer had acquired airbending and managed to bust out his allies, Ghazan and Ming-Hua. Knowing that the group was headed to the North Pole to bust out their fourth and final ally, P'Li, Zuko mounted his dragon ${link_3} and traveled to the ${link_4}, and together, with the efforts of Tonraq and ${link_5}, prepared to apprehend the Red Lotus. Despite his age and the frosty environment, Zuko fought well, although he was quickly overwhelmed by Ghazan's earthbending, and the Red Lotus was able to escape. Zuko took the threat the Red Lotus posed seriously, cautioning everyone not to underestimate their skills. After the Earth Queen was assassinated by Zaheer, Zuko opted to return to the Fire Nation in order to safeguard his daughter's life in case the organization decided to go after her next, rather than journeying with Team Avatar to the Northern Air Temple to save the Air Nation. Even after their defeat, he remained weary about the possibility of more members still lurking around.",
      "links": [
        {
          "body": "Avatar",
          "key": "${link_0}",
          "target": {
            "href": "Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "Korra",
          "key": "${link_1}",
          "target": {
            "href": "Korra",
            "page": "Korra"
          }
        },
        {
          "body": "White Lotus sentry",
          "key": "${link_2}",
          "target": {
            "href": "White_Lotus_sentries",
            "page": "White_Lotus_sentries"
          }
        },
        {
          "body": "Druk",
          "key": "${link_3}",
          "target": {
            "href": "Druk",
            "page": "Druk"
          }
        },
        {
          "body": "Northern Water Tribe",
          "key": "${link_4}",
          "target": {
            "href": "Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "Desna and Eska",
          "key": "${link_5}",
          "target": {
            "href": "Desna_and_Eska",
            "page": "Desna_and_Eska"
          }
        }
      ],
      "text": "The Red Lotus consists of four powerful criminals who were incarcerated for thirteen years following a failed attempt to kidnap Avatar Korra. The group would have been successful in the kidnapping had it not been for the efforts of Zuko, Sokka, Tonraq, and Tenzin, who defeated the criminals and imprisoned them in facilities designed to impair their abilities. Thirteen years later, Lord Zuko received information from a White Lotus sentry that Zaheer had acquired airbending and managed to bust out his allies, Ghazan and Ming-Hua. Knowing that the group was headed to the North Pole to bust out their fourth and final ally, P'Li, Zuko mounted his dragon Druk and traveled to the Northern Water Tribe, and together, with the efforts of Tonraq and Desna and Eska, prepared to apprehend the Red Lotus. Despite his age and the frosty environment, Zuko fought well, although he was quickly overwhelmed by Ghazan's earthbending, and the Red Lotus was able to escape. Zuko took the threat the Red Lotus posed seriously, cautioning everyone not to underestimate their skills. After the Earth Queen was assassinated by Zaheer, Zuko opted to return to the Fire Nation in order to safeguard his daughter's life in case the organization decided to go after her next, rather than journeying with Team Avatar to the Northern Air Temple to save the Air Nation. Even after their defeat, he remained weary about the possibility of more members still lurking around."
    },
    {
      "body": "${link_0} challenged ${link_1} to an ${link_2}.",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "href": "Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Zhao",
          "key": "${link_1}",
          "target": {
            "href": "Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "Agni Kai",
          "key": "${link_2}",
          "target": {
            "href": "Agni_Kai",
            "page": "Agni_Kai"
          }
        }
      ],
      "text": "Zuko challenged Zhao to an Agni Kai."
    },
    {
      "body": "Zhao was a high-ranking and ambitious officer in the ${link_0} and Zuko's major rival in his attempts to capture Avatar Aang. Zhao and Zuko were constantly at odds as they attempted to stay one step ahead of each other in their pursuit of the Avatar. Their enmity seemed to stem from an earlier time however, as Zhao was seen in the audience of Zuko's Agni Kai with his father, smirking while Zuko was burned.",
      "links": [
        {
          "body": "Fire Navy",
          "key": "${link_0}",
          "target": {
            "href": "Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        }
      ],
      "text": "Zhao was a high-ranking and ambitious officer in the Fire Navy and Zuko's major rival in his attempts to capture Avatar Aang. Zhao and Zuko were constantly at odds as they attempted to stay one step ahead of each other in their pursuit of the Avatar. Their enmity seemed to stem from an earlier time however, as Zhao was seen in the audience of Zuko's Agni Kai with his father, smirking while Zuko was burned."
    },
    {
      "body": "Zuko attempted to withhold the information that the Avatar had returned from Zhao, but Zhao discovered the truth anyway and decided to detain Zuko so that he would be unable to capture the Avatar first. This infuriated Zuko and in their subsequent argument Zhao mocked Zuko's plight, telling him that his father does not really want him back at all. Zuko challenged Zhao to an Agni Kai in which he defeated Zhao by utilizing a strong foundation in the basics of firebending that he had previously dismissed. Zuko, however, chose not to scar or kill Zhao upon his victory, and while he walked away, the latter attempted a dishonorable attack that was blocked by Iroh.",
      "links": [],
      "text": "Zuko attempted to withhold the information that the Avatar had returned from Zhao, but Zhao discovered the truth anyway and decided to detain Zuko so that he would be unable to capture the Avatar first. This infuriated Zuko and in their subsequent argument Zhao mocked Zuko's plight, telling him that his father does not really want him back at all. Zuko challenged Zhao to an Agni Kai in which he defeated Zhao by utilizing a strong foundation in the basics of firebending that he had previously dismissed. Zuko, however, chose not to scar or kill Zhao upon his victory, and while he walked away, the latter attempted a dishonorable attack that was blocked by Iroh."
    },
    {
      "body": "Zuko ran a blockade of Zhao's ships and entered into Fire Nation waters in pursuit of the Avatar, thus violating the terms of his exile. Zhao allowed him to pass, however, in order to follow Zuko to the location of the Avatar and, once there, planned to arrest the prince as well. Iroh warned Zuko about Zhao's plan, which led to the prince chasing Aang in a smaller boat while Iroh and his crew led Zhao off course. Zhao, however, was not fooled and tracked Zuko to the ${link_0}. There he caught him, but Zuko escaped when Roku began to destroy the temple.",
      "links": [
        {
          "body": "Fire Temple",
          "key": "${link_0}",
          "target": {
            "href": "Fire_Temple",
            "page": "Fire_Temple"
          }
        }
      ],
      "text": "Zuko ran a blockade of Zhao's ships and entered into Fire Nation waters in pursuit of the Avatar, thus violating the terms of his exile. Zhao allowed him to pass, however, in order to follow Zuko to the location of the Avatar and, once there, planned to arrest the prince as well. Iroh warned Zuko about Zhao's plan, which led to the prince chasing Aang in a smaller boat while Iroh and his crew led Zhao off course. Zhao, however, was not fooled and tracked Zuko to the Fire Temple. There he caught him, but Zuko escaped when Roku began to destroy the temple."
    },
    {
      "body": "Zuko took on the guise of the Blue Spirit, a masked, dual-dao-wielding vigilante, first to spy on Zhao and later to free the Avatar from Zhao's custody. Zhao realized later that this was Zuko's alternate identity when he came to commandeer Zuko's crew in order to invade the Northern Water Tribe and noticed dual broadswords in the prince's quarters. Zhao hired the pirates with whom Zuko had had bad dealings at the ${link_0} to assassinate him by blowing up his ship. However, Zuko survived and stowed away on one of Zhao's ships, pretending to be a soldier, and later engaged Zhao in a battle in retaliation for the admiral's attempt to kill him. During this fight, Zuko maintained that he had no choice but to act as the Blue Spirit, while Zhao insisted that he should have just accepted his failure with honor. Their battle, however, was interrupted when the vengeful Ocean Spirit, upset that Zhao killed its counterpart, the Moon Spirit, manifested a hand-like appendage of water and dragged Zhao away. Zuko reached out a hand to Zhao in an attempt to help him. Though Zhao initially tried to reach his hand, he refused to accept his help. He was dragged down into the water and killed by the Ocean Spirit, ${link_1}, after the Moon Spirit, Tui, was revived by Princess Yue's sacrifice. Zuko was the sole witness to Zhao's downfall as a result.",
      "links": [
        {
          "body": "waterfall lagoon",
          "key": "${link_0}",
          "target": {
            "href": "Waterfall_lagoon",
            "page": "Waterfall_lagoon"
          }
        },
        {
          "body": "La",
          "key": "${link_1}",
          "target": {
            "href": "La",
            "page": "La"
          }
        }
      ],
      "text": "Zuko took on the guise of the Blue Spirit, a masked, dual-dao-wielding vigilante, first to spy on Zhao and later to free the Avatar from Zhao's custody. Zhao realized later that this was Zuko's alternate identity when he came to commandeer Zuko's crew in order to invade the Northern Water Tribe and noticed dual broadswords in the prince's quarters. Zhao hired the pirates with whom Zuko had had bad dealings at the waterfall lagoon to assassinate him by blowing up his ship. However, Zuko survived and stowed away on one of Zhao's ships, pretending to be a soldier, and later engaged Zhao in a battle in retaliation for the admiral's attempt to kill him. During this fight, Zuko maintained that he had no choice but to act as the Blue Spirit, while Zhao insisted that he should have just accepted his failure with honor. Their battle, however, was interrupted when the vengeful Ocean Spirit, upset that Zhao killed its counterpart, the Moon Spirit, manifested a hand-like appendage of water and dragged Zhao away. Zuko reached out a hand to Zhao in an attempt to help him. Though Zhao initially tried to reach his hand, he refused to accept his help. He was dragged down into the water and killed by the Ocean Spirit, La, after the Moon Spirit, Tui, was revived by Princess Yue's sacrifice. Zuko was the sole witness to Zhao's downfall as a result."
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Zuko%27s_relationships",
    "file": "avatar.wikia.com/wiki/Zuko's_relationships.html",
    "page": "Zuko's_relationships",
    "title": "Zuko's relationships"
  }
}