{
  "categories": [
    {
      "body": "Featured articles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Featured_articles",
        "page": "Category_Featured_articles"
      }
    },
    {
      "body": "A-class articles",
      "target": {
        "external": false,
        "href": "/wiki/Category_A-class_articles",
        "page": "Category_A-class_articles"
      }
    },
    {
      "body": "A to Z",
      "target": {
        "external": false,
        "href": "/wiki/Category_A_to_Z",
        "page": "Category_A_to_Z"
      }
    },
    {
      "body": "Equipment",
      "target": {
        "external": false,
        "href": "/wiki/Category_Equipment",
        "page": "Category_Equipment"
      }
    },
    {
      "body": "Fire Nation",
      "target": {
        "external": false,
        "href": "/wiki/Category_Fire_Nation",
        "page": "Category_Fire_Nation"
      }
    },
    {
      "body": "Military",
      "target": {
        "external": false,
        "href": "/wiki/Category_Military",
        "page": "Category_Military"
      }
    },
    {
      "body": "Objects",
      "target": {
        "external": false,
        "href": "/wiki/Category_Objects",
        "page": "Category_Objects"
      }
    },
    {
      "body": "Vehicles",
      "target": {
        "external": false,
        "href": "/wiki/Category_Vehicles",
        "page": "Category_Vehicles"
      }
    },
    {
      "body": "Zuko",
      "target": {
        "external": false,
        "href": "/wiki/Category_Zuko",
        "page": "Category_Zuko"
      }
    }
  ],
  "facts": [],
  "paragraphs": [
    {
      "body": "Zuko's ship was a relatively small vessel handled by a small crew. In actuality, it was an outdated ${link_0} from the early days of the ${link_1}, with little in the way of special modifications for the ${link_2}'s convenience. ${link_3} used this ship to travel around the world in search of the long lost ${link_4}. Though evidently inferior in comparison to other ${link_5} vessels, Zuko's ship was small and light enough to effectively pursue a ${link_6}.",
      "links": [
        {
          "body": "Fire Nation cruiser",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_cruiser",
            "page": "Fire_Nation_cruiser"
          }
        },
        {
          "body": "Hundred Year War",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Hundred_Year_War",
            "page": "Hundred_Year_War"
          }
        },
        {
          "body": "prince",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Heir_to_the_Fire_Lord",
            "page": "Heir_to_the_Fire_Lord"
          }
        },
        {
          "body": "Zuko",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        },
        {
          "body": "Avatar",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Avatar",
            "page": "Avatar"
          }
        },
        {
          "body": "navy",
          "key": "${link_5}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation#Navy",
            "page": "Military_of_the_Fire_Nation"
          }
        },
        {
          "body": "flying bison",
          "key": "${link_6}",
          "target": {
            "external": false,
            "href": "/wiki/Flying_bison",
            "page": "Flying_bison"
          }
        }
      ],
      "section": [
        "Zuko's ship"
      ],
      "text": "Zuko's ship was a relatively small vessel handled by a small crew. In actuality, it was an outdated Fire Nation cruiser from the early days of the Hundred Year War, with little in the way of special modifications for the prince's convenience. Zuko used this ship to travel around the world in search of the long lost Avatar. Though evidently inferior in comparison to other navy vessels, Zuko's ship was small and light enough to effectively pursue a flying bison."
    },
    {
      "body": "The ship was destroyed when ${link_0} paid a group of pirates to fill the ship with barrels of ${link_1}, causing it to explode after ignition.",
      "links": [
        {
          "body": "Zhao",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zhao",
            "page": "Zhao"
          }
        },
        {
          "body": "blasting jelly",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Blasting_jelly",
            "page": "Blasting_jelly"
          }
        }
      ],
      "section": [
        "Zuko's ship"
      ],
      "text": "The ship was destroyed when Zhao paid a group of pirates to fill the ship with barrels of blasting jelly, causing it to explode after ignition."
    },
    {
      "body": "After Prince Zuko acquired this ship upon his banishment, it became his primary means of transportation across the world. In his relentless search for the Avatar, Zuko scoured the entire world on the ship, desperately seeking out his trophy so that he may present him to ${link_0} and reclaim his right to the throne. Three years after his banishment, Zuko finally found the Avatar in the ${link_1}, and assaulted the defenseless tribe until the Avatar agreed to surrender if Zuko spared the inhabitants. Zuko almost escaped with ${link_2}, but his new friends ${link_3} and ${link_4} rescued him and the three left the ship frozen in the icebergs.",
      "links": [
        {
          "body": "his father",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Ozai",
            "page": "Ozai"
          }
        },
        {
          "body": "Southern Water Tribe",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Southern_Water_Tribe",
            "page": "Southern_Water_Tribe"
          }
        },
        {
          "body": "Aang",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Aang",
            "page": "Aang"
          }
        },
        {
          "body": "Katara",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Katara",
            "page": "Katara"
          }
        },
        {
          "body": "Sokka",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Sokka",
            "page": "Sokka"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "History"
      ],
      "text": "After Prince Zuko acquired this ship upon his banishment, it became his primary means of transportation across the world. In his relentless search for the Avatar, Zuko scoured the entire world on the ship, desperately seeking out his trophy so that he may present him to his father and reclaim his right to the throne. Three years after his banishment, Zuko finally found the Avatar in the Southern Water Tribe, and assaulted the defenseless tribe until the Avatar agreed to surrender if Zuko spared the inhabitants. Zuko almost escaped with Aang, but his new friends Katara and Sokka rescued him and the three left the ship frozen in the icebergs."
    },
    {
      "body": "Following this escape, Zuko sailed the ship to a ${link_0} in order to repair his damaged vessel. He continued to use this ship to hunt down the Avatar. In one incident, he sailed this vessel in close proximity to ${link_1} within ${link_2} waters, as the Avatar was seeking counsel from Avatar ${link_3} at the ${link_4}. This was a blatant violation of the terms for Zuko's banishment, but he ultimately escaped capture. On another occasion, the vessel was almost sunk in a massive storm when Zuko attempted to chase the Avatar without regard for the safety of himself or his crew. He pulled the ship into port when he finally decided that the safety of his crew should come first.",
      "links": [
        {
          "body": "Fire Nation shipyard",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom_harbor",
            "page": "Earth_Kingdom_harbor"
          }
        },
        {
          "body": "Crescent Island",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Crescent_Island",
            "page": "Crescent_Island"
          }
        },
        {
          "body": "Fire Nation",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation",
            "page": "Fire_Nation"
          }
        },
        {
          "body": "Roku",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Roku",
            "page": "Roku"
          }
        },
        {
          "body": "Fire Temple",
          "key": "${link_4}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Temple",
            "page": "Fire_Temple"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "History"
      ],
      "text": "Following this escape, Zuko sailed the ship to a Fire Nation shipyard in order to repair his damaged vessel. He continued to use this ship to hunt down the Avatar. In one incident, he sailed this vessel in close proximity to Crescent Island within Fire Nation waters, as the Avatar was seeking counsel from Avatar Roku at the Fire Temple. This was a blatant violation of the terms for Zuko's banishment, but he ultimately escaped capture. On another occasion, the vessel was almost sunk in a massive storm when Zuko attempted to chase the Avatar without regard for the safety of himself or his crew. He pulled the ship into port when he finally decided that the safety of his crew should come first."
    },
    {
      "body": "When Zuko docked the ship in a Fire Nation port, where he met his rival Admiral Zhao once again, Zhao announced his intention to attack the ${link_0}. While on Zuko's ship, Zhao noticed two broadswords in his cabin. They were the same ones used by Zuko's alter-ego, the Blue Spirit, who had freed the Avatar in ${link_1}. Zhao instantly recognized them and secretly deducted that the Blue Spirit was Zuko. He ordered that Zuko's entire crew join him in the invasion, including the cook, much to Iroh's sadness.",
      "links": [
        {
          "body": "Northern Water Tribe",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Northern_Water_Tribe",
            "page": "Northern_Water_Tribe"
          }
        },
        {
          "body": "an earlier engagement",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Rescue_in_Pohuai_Stronghold",
            "page": "Rescue_in_Pohuai_Stronghold"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "History"
      ],
      "text": "When Zuko docked the ship in a Fire Nation port, where he met his rival Admiral Zhao once again, Zhao announced his intention to attack the Northern Water Tribe. While on Zuko's ship, Zhao noticed two broadswords in his cabin. They were the same ones used by Zuko's alter-ego, the Blue Spirit, who had freed the Avatar in an earlier engagement. Zhao instantly recognized them and secretly deducted that the Blue Spirit was Zuko. He ordered that Zuko's entire crew join him in the invasion, including the cook, much to Iroh's sadness."
    },
    {
      "body": "With Zuko alone on the ship, Zhao hired the band of pirates who had stolen the ${link_0} to assassinate him, and they attempted to do so by rigging the vessel with explosives. Zuko's ship was completely destroyed in the explosion, but Zuko survived the blast by ${link_1} the explosion around him and traveled to the North incognito. Due to the explosion, Zuko suffered several cuts and severe facial bruising.",
      "links": [
        {
          "body": "waterbending scroll",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Waterbending_scroll",
            "page": "Waterbending_scroll"
          }
        },
        {
          "body": "firebending",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending",
            "page": "Firebending"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "History"
      ],
      "text": "With Zuko alone on the ship, Zhao hired the band of pirates who had stolen the waterbending scroll to assassinate him, and they attempted to do so by rigging the vessel with explosives. Zuko's ship was completely destroyed in the explosion, but Zuko survived the blast by firebending the explosion around him and traveled to the North incognito. Due to the explosion, Zuko suffered several cuts and severe facial bruising."
    },
    {
      "body": "The loss of this vessel and his ultimately labeling as a traitor by his father forced Zuko to return to the ${link_0} on a makeshift raft and wander the enormous country by land.",
      "links": [
        {
          "body": "Earth Kingdom",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Earth_Kingdom",
            "page": "Earth_Kingdom"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "History"
      ],
      "text": "The loss of this vessel and his ultimately labeling as a traitor by his father forced Zuko to return to the Earth Kingdom on a makeshift raft and wander the enormous country by land."
    },
    {
      "body": "The vessel was a steam-powered warship that was much older than the standard models used by the Fire Nation Navy around 99 ${link_0}. Zuko's ship was already in use during the intermediate stages of the Hundred Year War, as proven by the decades-old ship of the same class that was ${link_1} near the South Pole. Zuko's ship was much smaller than newer warships, and boasted only a single ${link_2}, as opposed to the three to five larger trebuchets other warships had. The size difference between Zuko's ship and a regular Fire Navy ship was noticeable when Zuko docked his ship in the Fire Nation harbor next to the much larger ships of Zhao's fleet, which were of a more recent class. The ship was, however, very fast, and able to keep pace with ${link_3} for extended periods of time.",
      "links": [
        {
          "body": "AG",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/History_of_the_World_of_Avatar#Dates",
            "page": "History_of_the_World_of_Avatar"
          }
        },
        {
          "body": "shipwrecked",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Shipwreck",
            "page": "Shipwreck"
          }
        },
        {
          "body": "catapult",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Nation_trebuchet",
            "page": "Fire_Nation_trebuchet"
          }
        },
        {
          "body": "Appa",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Appa",
            "page": "Appa"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "Design"
      ],
      "text": "The vessel was a steam-powered warship that was much older than the standard models used by the Fire Nation Navy around 99 AG. Zuko's ship was already in use during the intermediate stages of the Hundred Year War, as proven by the decades-old ship of the same class that was shipwrecked near the South Pole. Zuko's ship was much smaller than newer warships, and boasted only a single catapult, as opposed to the three to five larger trebuchets other warships had. The size difference between Zuko's ship and a regular Fire Navy ship was noticeable when Zuko docked his ship in the Fire Nation harbor next to the much larger ships of Zhao's fleet, which were of a more recent class. The ship was, however, very fast, and able to keep pace with Appa for extended periods of time."
    },
    {
      "body": "The ship's general appearance was very similar to that of the mainline Fire Navy ships, with a raised spiked bow that could be used as a ram that could be lowered to form a loading ramp. The bow was also suitable for breaching and invading shoreline fortifications. The entire ship was made out of metal and was a uniform gray color. It was approximately fifty meters long. The front section of the main deck was featureless except for a stair leading below decks and the hatch through which the catapult was deployed. The stern of the ship was rectangular, much like that of a real-world ferry. It might have been opened to form a ferry-like rear ramp, through which the riverboat might have been deployed. Below the stern the propellers were placed.",
      "links": [],
      "section": [
        "Zuko's ship",
        "Design"
      ],
      "text": "The ship's general appearance was very similar to that of the mainline Fire Navy ships, with a raised spiked bow that could be used as a ram that could be lowered to form a loading ramp. The bow was also suitable for breaching and invading shoreline fortifications. The entire ship was made out of metal and was a uniform gray color. It was approximately fifty meters long. The front section of the main deck was featureless except for a stair leading below decks and the hatch through which the catapult was deployed. The stern of the ship was rectangular, much like that of a real-world ferry. It might have been opened to form a ferry-like rear ramp, through which the riverboat might have been deployed. Below the stern the propellers were placed."
    },
    {
      "body": "The command tower was placed about halfway down the deck, with the engine's steam boiler directly behind it. One large and one small smoke stack rose from the engine section. The tower was several stories high. The stories above contained officers' quarters; Zuko's cabin was about midway up the tower. These cabins had the narrow, rectangular, red-tinted windows signature of Fire Navy ships. The topmost deck of the tower was the bridge, a rectangular room with panoramic windows and a small open platform which protruded from the tower outside and served as an observation deck. The tower also featured a service ladder on the outside. On the very top of the tower was mounted the Fire Nation pennant.",
      "links": [],
      "section": [
        "Zuko's ship",
        "Design"
      ],
      "text": "The command tower was placed about halfway down the deck, with the engine's steam boiler directly behind it. One large and one small smoke stack rose from the engine section. The tower was several stories high. The stories above contained officers' quarters; Zuko's cabin was about midway up the tower. These cabins had the narrow, rectangular, red-tinted windows signature of Fire Navy ships. The topmost deck of the tower was the bridge, a rectangular room with panoramic windows and a small open platform which protruded from the tower outside and served as an observation deck. The tower also featured a service ladder on the outside. On the very top of the tower was mounted the Fire Nation pennant."
    },
    {
      "body": "The inside of the ship was mostly made up of dark and narrow, metal-walled corridors and was dimly lit with red lamps, evoking the feel of real-world diesel submarines. Like on submarines, most doors on Zuko's ship were made of heavy metal plating and were sealed shut using large cogwheels. The ship also had a cargo bay large enough to hold the riverboat and several ${link_0}.",
      "links": [
        {
          "body": "komodo rhinos",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Komodo_rhino",
            "page": "Komodo_rhino"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "Design"
      ],
      "text": "The inside of the ship was mostly made up of dark and narrow, metal-walled corridors and was dimly lit with red lamps, evoking the feel of real-world diesel submarines. Like on submarines, most doors on Zuko's ship were made of heavy metal plating and were sealed shut using large cogwheels. The ship also had a cargo bay large enough to hold the riverboat and several komodo rhinos."
    },
    {
      "body": "The ship had a small crew compared to other Fire Navy ships. Zuko clearly was in command of the ship, along with Iroh. Neither of them held any formal rank, apart from Iroh being a high general in retirement, which he did not use.",
      "links": [],
      "section": [
        "Zuko's ship",
        "Crew and equipment",
        "Crew"
      ],
      "text": "The ship had a small crew compared to other Fire Navy ships. Zuko clearly was in command of the ship, along with Iroh. Neither of them held any formal rank, apart from Iroh being a high general in retirement, which he did not use."
    },
    {
      "body": "The ship's captain was ${link_0} ${link_1}, a middle-aged firebender who, like most of the crew, had previously served under General Iroh. Captain here being his function, not rank, as in naval tradition whoever directly commands a ship is called a captain, regardless of actual rank. Zuko and Iroh had the same position as flag officers have on their vessels: they gave the orders, but the ship and its crew were commanded for them by a captain. Other crew included:",
      "links": [
        {
          "body": "Lieutenant",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_ranks_in_the_World_of_Avatar#Lieutenant_2",
            "page": "Military_ranks_in_the_World_of_Avatar"
          }
        },
        {
          "body": "Jee",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Jee",
            "page": "Jee"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "Crew and equipment",
        "Crew"
      ],
      "text": "The ship's captain was Lieutenant Jee, a middle-aged firebender who, like most of the crew, had previously served under General Iroh. Captain here being his function, not rank, as in naval tradition whoever directly commands a ship is called a captain, regardless of actual rank. Zuko and Iroh had the same position as flag officers have on their vessels: they gave the orders, but the ship and its crew were commanded for them by a captain. Other crew included:"
    },
    {
      "body": "a helmsman, an elderly sailor whom Zuko and Jee worked together to save from the ruined command tower during a storm",
      "links": [],
      "section": [
        "Zuko's ship",
        "Crew and equipment",
        "Crew"
      ],
      "text": "a helmsman, an elderly sailor whom Zuko and Jee worked together to save from the ruined command tower during a storm"
    },
    {
      "body": "at least one engine room operator",
      "links": [],
      "section": [
        "Zuko's ship",
        "Crew and equipment",
        "Crew"
      ],
      "text": "at least one engine room operator"
    },
    {
      "body": "a cook who was, apparently, Iroh's favorite crew member",
      "links": [],
      "section": [
        "Zuko's ship",
        "Crew and equipment",
        "Crew"
      ],
      "text": "a cook who was, apparently, Iroh's favorite crew member"
    },
    {
      "body": "seven firebenders, including Lieutenant Jee",
      "links": [],
      "section": [
        "Zuko's ship",
        "Crew and equipment",
        "Crew"
      ],
      "text": "seven firebenders, including Lieutenant Jee"
    },
    {
      "body": "several non-firebending soldiers",
      "links": [],
      "section": [
        "Zuko's ship",
        "Crew and equipment",
        "Crew"
      ],
      "text": "several non-firebending soldiers"
    },
    {
      "body": "In all the ship's crew numbers approximately thirty souls, as seen when what was likely the entire crew assembled to bid farewell to Iroh.",
      "links": [],
      "section": [
        "Zuko's ship",
        "Crew and equipment",
        "Crew"
      ],
      "text": "In all the ship's crew numbers approximately thirty souls, as seen when what was likely the entire crew assembled to bid farewell to Iroh."
    },
    {
      "body": "Zuko's ship was stocked with a moderate supply of weapons and four komodo rhinos and had one catapult, of smaller caliber than those used on Fire Navy cruisers, which was deployed from below decks through a hatch at the front of the main deck. The ship contained at least two small, steam-powered riverboats. One of these boats was used by Zuko to try to capture Aang, and get past Zhao's ship through a smoke cloud. It was later destroyed when it was commandeered by pirates and fell down a waterfall. Zuko used another riverboat to get back on the ship after his first adventure as the Blue Spirit.",
      "links": [],
      "section": [
        "Zuko's ship",
        "Crew and equipment",
        "Crew"
      ],
      "text": "Zuko's ship was stocked with a moderate supply of weapons and four komodo rhinos and had one catapult, of smaller caliber than those used on Fire Navy cruisers, which was deployed from below decks through a hatch at the front of the main deck. The ship contained at least two small, steam-powered riverboats. One of these boats was used by Zuko to try to capture Aang, and get past Zhao's ship through a smoke cloud. It was later destroyed when it was commandeered by pirates and fell down a waterfall. Zuko used another riverboat to get back on the ship after his first adventure as the Blue Spirit."
    },
    {
      "body": "At a certain time, there was a peculiar ${link_0} perched in the galley. It was bought by Iroh on a whim from the selfsame ${link_1} who later bombed the ship.",
      "links": [
        {
          "body": "monkey statue",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Monkey_statue",
            "page": "Monkey_statue"
          }
        },
        {
          "body": "pirates",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pirate_captain",
            "page": "Pirate_captain"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "Crew and equipment",
        "Crew"
      ],
      "text": "At a certain time, there was a peculiar monkey statue perched in the galley. It was bought by Iroh on a whim from the selfsame pirates who later bombed the ship."
    },
    {
      "body": "Boasting greater mobility than the ship, Zuko's skiff was used by the crew in order to better navigate narrow waterways. It was contained in and left through the back of the ship. Zuko also used it to head toward Crescent Island under the cover of the smoke produced by his damaged main ship.",
      "links": [],
      "section": [
        "Zuko's ship",
        "Crew and equipment",
        "Skiff"
      ],
      "text": "Boasting greater mobility than the ship, Zuko's skiff was used by the crew in order to better navigate narrow waterways. It was contained in and left through the back of the ship. Zuko also used it to head toward Crescent Island under the cover of the smoke produced by his damaged main ship."
    },
    {
      "body": "On the front deck of Zuko's ship was a telescope which the young prince used to spot objects or people from afar. Near the Southern Water Tribe, Zuko used his telescope to spot Avatar Aang as he was going down a shipwreck in the distance, the prince's attention having been drawn there by a flare. A few weeks later, right before the ${link_0}, Zuko used his telescope again to spot ${link_1} heading toward Fire Nation waters and subsequently running a ${link_2}.",
      "links": [
        {
          "body": "winter solstice",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Winter_solstice",
            "page": "Winter_solstice"
          }
        },
        {
          "body": "Team Avatar",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Team_Avatar",
            "page": "Team_Avatar"
          }
        },
        {
          "body": "Fire Navy blockade",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Fire_Navy_blockade",
            "page": "Fire_Navy_blockade"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "Crew and equipment",
        "Telescope"
      ],
      "text": "On the front deck of Zuko's ship was a telescope which the young prince used to spot objects or people from afar. Near the Southern Water Tribe, Zuko used his telescope to spot Avatar Aang as he was going down a shipwreck in the distance, the prince's attention having been drawn there by a flare. A few weeks later, right before the winter solstice, Zuko used his telescope again to spot Team Avatar heading toward Fire Nation waters and subsequently running a Fire Navy blockade."
    },
    {
      "body": "Iroh seemed to be in charge of the ship's pastime activities, showing his concern for the crew. It seemed to fit well into his character - Iroh made his life as an outcast worthwhile by trying to improve the lives of those around him.",
      "links": [],
      "section": [
        "Zuko's ship",
        "Activities aboard"
      ],
      "text": "Iroh seemed to be in charge of the ship's pastime activities, showing his concern for the crew. It seemed to fit well into his character - Iroh made his life as an outcast worthwhile by trying to improve the lives of those around him."
    },
    {
      "body": "The only activities organized and attended by Zuko, who was driven to improve his originally mediocre skills to be able to stand up to the Avatar, were his own ${link_0} and the accompanying sparring matches. Iroh was Zuko's firebending teacher, but did not spar. Though Iroh was one of the world's most powerful benders, he did not endorse unnecessary violence and had little interest even in sparring matches. Lieutenant Jee served as a more even opponent for Zuko, and the young prince would also challenge some of the other firebenders aboard his ship.",
      "links": [
        {
          "body": "firebending training",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Firebending_training",
            "page": "Firebending_training"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "Activities aboard",
        "Firebending training and sparring matches"
      ],
      "text": "The only activities organized and attended by Zuko, who was driven to improve his originally mediocre skills to be able to stand up to the Avatar, were his own firebending training and the accompanying sparring matches. Iroh was Zuko's firebending teacher, but did not spar. Though Iroh was one of the world's most powerful benders, he did not endorse unnecessary violence and had little interest even in sparring matches. Lieutenant Jee served as a more even opponent for Zuko, and the young prince would also challenge some of the other firebenders aboard his ship."
    },
    {
      "body": "Held by Iroh for the crew's entertainment, music night took place regularly. Various crew members from the cook to Lieutenant Jee participated, and whoever wished to sing or play an instrument was free to do so. Iroh sang and played the ${link_0} while Lieutenant Jee sang and played the ${link_1}. Zuko, while able to play the tsungi horn according to Iroh, deemed it below himself to attend. In good weather, music night took place on the main deck. Some of the ${link_2} sung were ${link_3}, and a love song that Lieutenant Jee could sing well.",
      "links": [
        {
          "body": "tsungi horn",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Tsungi_horn",
            "page": "Tsungi_horn"
          }
        },
        {
          "body": "pipa",
          "key": "${link_1}",
          "target": {
            "external": false,
            "href": "/wiki/Pipa",
            "page": "Pipa"
          }
        },
        {
          "body": "songs",
          "key": "${link_2}",
          "target": {
            "external": false,
            "href": "/wiki/Songs_in_the_World_of_Avatar",
            "page": "Songs_in_the_World_of_Avatar"
          }
        },
        {
          "body": "\"Four Seasons\"",
          "key": "${link_3}",
          "target": {
            "external": false,
            "href": "/wiki/Songs_in_the_World_of_Avatar#.22Four_Seasons.22",
            "page": "Songs_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "Activities aboard",
        "Music night"
      ],
      "text": "Held by Iroh for the crew's entertainment, music night took place regularly. Various crew members from the cook to Lieutenant Jee participated, and whoever wished to sing or play an instrument was free to do so. Iroh sang and played the tsungi horn while Lieutenant Jee sang and played the pipa. Zuko, while able to play the tsungi horn according to Iroh, deemed it below himself to attend. In good weather, music night took place on the main deck. Some of the songs sung were \"Four Seasons\", and a love song that Lieutenant Jee could sing well."
    },
    {
      "body": "Though an informal and irregular event, anyone who wished could challenge Iroh to a game of ${link_0} at any time, or just ask to play for practice. Pai Sho was one of Iroh's greatest passions, so he was always ready for a game. Mostly, it was Iroh who was on the lookout for a second player, as he would play all the time if it were up to him. Iroh was very good at Pai Sho, and the crew could not compete with his skills. Occasionally, the crew played against Iroh in teams instead of one-on-one, and according to him they were all improving. Zuko had little concern for Pai Sho and did not play.",
      "links": [
        {
          "body": "Pai Sho",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Pai_Sho",
            "page": "Pai_Sho"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "Activities aboard",
        "Pai Sho open tournament and lessons"
      ],
      "text": "Though an informal and irregular event, anyone who wished could challenge Iroh to a game of Pai Sho at any time, or just ask to play for practice. Pai Sho was one of Iroh's greatest passions, so he was always ready for a game. Mostly, it was Iroh who was on the lookout for a second player, as he would play all the time if it were up to him. Iroh was very good at Pai Sho, and the crew could not compete with his skills. Occasionally, the crew played against Iroh in teams instead of one-on-one, and according to him they were all improving. Zuko had little concern for Pai Sho and did not play."
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Azula's ship",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Royal_barge",
            "page": "Royal_barge"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "See also"
      ],
      "text": "Azula's ship"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Military of the Fire Nation",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Military_of_the_Fire_Nation",
            "page": "Military_of_the_Fire_Nation"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "See also"
      ],
      "text": "Military of the Fire Nation"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Transportation in the World of Avatar",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Transportation_in_the_World_of_Avatar",
            "page": "Transportation_in_the_World_of_Avatar"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "See also"
      ],
      "text": "Transportation in the World of Avatar"
    },
    {
      "body": "${link_0}",
      "links": [
        {
          "body": "Zuko",
          "key": "${link_0}",
          "target": {
            "external": false,
            "href": "/wiki/Zuko",
            "page": "Zuko"
          }
        }
      ],
      "section": [
        "Zuko's ship",
        "See also"
      ],
      "text": "Zuko"
    }
  ],
  "source": {
    "canonical": "http://avatar.wikia.com/wiki/Zuko%27s_ship",
    "file": "avatar.wikia.com/wiki/Zuko's_ship.html",
    "page": "Zuko's_ship",
    "title": "Zuko's ship"
  }
}